; ModuleID = 'blender/source/blender/modifiers/intern/MOD_mask.c'
source_filename = "blender/source/blender/modifiers/intern/MOD_mask.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!93 = !DIEnumerator(name: "CD_SHAPE_KEYINDEX", value: 27, isUnsigned: true)
!94 = !DIEnumerator(name: "CD_SHAPEKEY", value: 28, isUnsigned: true)
!95 = !DIEnumerator(name: "CD_BWEIGHT", value: 29, isUnsigned: true)
!96 = !DIEnumerator(name: "CD_CREASE", value: 30, isUnsigned: true)
!97 = !DIEnumerator(name: "CD_ORIGSPACE_MLOOP", value: 31, isUnsigned: true)
!98 = !DIEnumerator(name: "CD_PREVIEW_MLOOPCOL", value: 32, isUnsigned: true)
!99 = !DIEnumerator(name: "CD_BM_ELEM_PYPTR", value: 33, isUnsigned: true)
!100 = !DIEnumerator(name: "CD_PAINT_MASK", value: 34, isUnsigned: true)
!101 = !DIEnumerator(name: "CD_GRID_PAINT_MASK", value: 35, isUnsigned: true)
!102 = !DIEnumerator(name: "CD_MVERT_SKIN", value: 36, isUnsigned: true)
!103 = !DIEnumerator(name: "CD_FREESTYLE_EDGE", value: 37, isUnsigned: true)
!104 = !DIEnumerator(name: "CD_FREESTYLE_FACE", value: 38, isUnsigned: true)
!105 = !DIEnumerator(name: "CD_MLOOPTANGENT", value: 39, isUnsigned: true)
!106 = !DIEnumerator(name: "CD_TESSLOOPNORMAL", value: 40, isUnsigned: true)
!107 = !DIEnumerator(name: "CD_NUMTYPES", value: 41, isUnsigned: true)
!108 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !61, line: 194, baseType: !7, size: 32, elements: !109)
!109 = !{!110, !111}
!110 = !DIEnumerator(name: "MOD_MASK_MODE_VGROUP", value: 0, isUnsigned: true)
!111 = !DIEnumerator(name: "MOD_MASK_MODE_ARM", value: 1, isUnsigned: true)
!112 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eBone_Flag", file: !113, line: 187, baseType: !7, size: 32, elements: !114)
!113 = !DIFile(filename: "blender/source/blender/makesdna/DNA_armature_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!114 = !{!115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137}
!115 = !DIEnumerator(name: "BONE_SELECTED", value: 1, isUnsigned: true)
!116 = !DIEnumerator(name: "BONE_ROOTSEL", value: 2, isUnsigned: true)
!117 = !DIEnumerator(name: "BONE_TIPSEL", value: 4, isUnsigned: true)
!118 = !DIEnumerator(name: "BONE_TRANSFORM", value: 8, isUnsigned: true)
!119 = !DIEnumerator(name: "BONE_CONNECTED", value: 16, isUnsigned: true)
!120 = !DIEnumerator(name: "BONE_HIDDEN_P", value: 64, isUnsigned: true)
!121 = !DIEnumerator(name: "BONE_DONE", value: 128, isUnsigned: true)
!122 = !DIEnumerator(name: "BONE_DRAW_ACTIVE", value: 256, isUnsigned: true)
!123 = !DIEnumerator(name: "BONE_HINGE", value: 512, isUnsigned: true)
!124 = !DIEnumerator(name: "BONE_HIDDEN_A", value: 1024, isUnsigned: true)
!125 = !DIEnumerator(name: "BONE_MULT_VG_ENV", value: 2048, isUnsigned: true)
!126 = !DIEnumerator(name: "BONE_NO_DEFORM", value: 4096, isUnsigned: true)
!127 = !DIEnumerator(name: "BONE_UNKEYED", value: 8192, isUnsigned: true)
!128 = !DIEnumerator(name: "BONE_HINGE_CHILD_TRANSFORM", value: 16384, isUnsigned: true)
!129 = !DIEnumerator(name: "BONE_NO_SCALE", value: 32768, isUnsigned: true)
!130 = !DIEnumerator(name: "BONE_HIDDEN_PG", value: 65536, isUnsigned: true)
!131 = !DIEnumerator(name: "BONE_DRAWWIRE", value: 131072, isUnsigned: true)
!132 = !DIEnumerator(name: "BONE_NO_CYCLICOFFSET", value: 262144, isUnsigned: true)
!133 = !DIEnumerator(name: "BONE_EDITMODE_LOCKED", value: 524288, isUnsigned: true)
!134 = !DIEnumerator(name: "BONE_TRANSFORM_CHILD", value: 1048576, isUnsigned: true)
!135 = !DIEnumerator(name: "BONE_UNSELECTABLE", value: 2097152, isUnsigned: true)
!136 = !DIEnumerator(name: "BONE_NO_LOCAL_LOCATION", value: 4194304, isUnsigned: true)
!137 = !DIEnumerator(name: "BONE_RELATIVE_PARENTING", value: 8388608, isUnsigned: true)
!138 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eArmature_Flag", file: !113, line: 118, baseType: !7, size: 32, elements: !139)
!139 = !{!140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154}
!140 = !DIEnumerator(name: "ARM_RESTPOS", value: 1, isUnsigned: true)
!141 = !DIEnumerator(name: "ARM_DRAWXRAY", value: 2, isUnsigned: true)
!142 = !DIEnumerator(name: "ARM_DRAWAXES", value: 4, isUnsigned: true)
!143 = !DIEnumerator(name: "ARM_DRAWNAMES", value: 8, isUnsigned: true)
!144 = !DIEnumerator(name: "ARM_POSEMODE", value: 16, isUnsigned: true)
!145 = !DIEnumerator(name: "ARM_EDITMODE", value: 32, isUnsigned: true)
!146 = !DIEnumerator(name: "ARM_DELAYDEFORM", value: 64, isUnsigned: true)
!147 = !DIEnumerator(name: "ARM_DONT_USE", value: 128, isUnsigned: true)
!148 = !DIEnumerator(name: "ARM_MIRROR_EDIT", value: 256, isUnsigned: true)
!149 = !DIEnumerator(name: "ARM_AUTO_IK", value: 512, isUnsigned: true)
!150 = !DIEnumerator(name: "ARM_NO_CUSTOM", value: 1024, isUnsigned: true)
!151 = !DIEnumerator(name: "ARM_COL_CUSTOM", value: 2048, isUnsigned: true)
!152 = !DIEnumerator(name: "ARM_GHOST_ONLYSEL", value: 4096, isUnsigned: true)
!153 = !DIEnumerator(name: "ARM_DS_EXPAND", value: 8192, isUnsigned: true)
!154 = !DIEnumerator(name: "ARM_HAS_VIZ_DEPS", value: 16384, isUnsigned: true)
!155 = !{!156, !193, !1027, !168, !1030, !1036}
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "MaskModifierData", file: !61, line: 191, baseType: !158)
!158 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MaskModifierData", file: !61, line: 183, size: 1536, elements: !159)
!159 = !{!160, !182, !1024, !1025, !1026}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "modifier", scope: !158, file: !61, line: 184, baseType: !161, size: 896)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "ModifierData", file: !61, line: 110, baseType: !162)
!162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ModifierData", file: !61, line: 99, size: 896, elements: !163)
!163 = !{!164, !166, !167, !169, !170, !171, !172, !177, !180}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !162, file: !61, line: 100, baseType: !165, size: 64)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !162, file: !61, line: 100, baseType: !165, size: 64, offset: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !162, file: !61, line: 102, baseType: !168, size: 32, offset: 128)
!168 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !162, file: !61, line: 102, baseType: !168, size: 32, offset: 160)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "stackindex", scope: !162, file: !61, line: 103, baseType: !168, size: 32, offset: 192)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !162, file: !61, line: 103, baseType: !168, size: 32, offset: 224)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !162, file: !61, line: 104, baseType: !173, size: 512, offset: 256)
!173 = !DICompositeType(tag: DW_TAG_array_type, baseType: !174, size: 512, elements: !175)
!174 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!175 = !{!176}
!176 = !DISubrange(count: 64)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !162, file: !61, line: 107, baseType: !178, size: 64, offset: 768)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !61, line: 107, flags: DIFlagFwdDecl)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !162, file: !61, line: 109, baseType: !181, size: 64, offset: 832)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "ob_arm", scope: !158, file: !61, line: 186, baseType: !183, size: 64, offset: 896)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !185, line: 115, size: 11392, elements: !186)
!185 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!186 = !{!187, !254, !257, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !275, !287, !301, !302, !346, !347, !350, !351, !367, !368, !369, !370, !371, !372, !373, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !392, !393, !394, !395, !396, !397, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !457, !458, !459, !460, !461, !462, !463, !464, !465, !468, !471, !474, !475, !476, !477, !478, !481, !484, !971, !972, !978, !979, !980, !981, !982, !983, !985, !988, !991, !993, !1012, !1013}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !184, file: !185, line: 116, baseType: !188, size: 960)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !189, line: 130, baseType: !190)
!189 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!190 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !189, line: 117, size: 960, elements: !191)
!191 = !{!192, !194, !195, !197, !216, !220, !222, !223, !224, !225}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !190, file: !189, line: 118, baseType: !193, size: 64)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !190, file: !189, line: 118, baseType: !193, size: 64, offset: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !190, file: !189, line: 119, baseType: !196, size: 64, offset: 128)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !190, file: !189, line: 120, baseType: !198, size: 64, offset: 192)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!199 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !189, line: 136, size: 17600, elements: !200)
!200 = !{!201, !202, !204, !207, !211, !212, !213}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !199, file: !189, line: 137, baseType: !188, size: 960)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !199, file: !189, line: 138, baseType: !203, size: 64, offset: 960)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !199, file: !189, line: 139, baseType: !205, size: 64, offset: 1024)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !189, line: 43, flags: DIFlagFwdDecl)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !199, file: !189, line: 140, baseType: !208, size: 8192, offset: 1088)
!208 = !DICompositeType(tag: DW_TAG_array_type, baseType: !174, size: 8192, elements: !209)
!209 = !{!210}
!210 = !DISubrange(count: 1024)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !199, file: !189, line: 141, baseType: !208, size: 8192, offset: 9280)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !199, file: !189, line: 148, baseType: !198, size: 64, offset: 17472)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !199, file: !189, line: 150, baseType: !214, size: 64, offset: 17536)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!215 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !189, line: 45, flags: DIFlagFwdDecl)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !190, file: !189, line: 121, baseType: !217, size: 528, offset: 256)
!217 = !DICompositeType(tag: DW_TAG_array_type, baseType: !174, size: 528, elements: !218)
!218 = !{!219}
!219 = !DISubrange(count: 66)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !190, file: !189, line: 126, baseType: !221, size: 16, offset: 784)
!221 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !190, file: !189, line: 127, baseType: !168, size: 32, offset: 800)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !190, file: !189, line: 128, baseType: !168, size: 32, offset: 832)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !190, file: !189, line: 128, baseType: !168, size: 32, offset: 864)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !190, file: !189, line: 129, baseType: !226, size: 64, offset: 896)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !189, line: 75, baseType: !228)
!228 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !189, line: 62, size: 1024, elements: !229)
!229 = !{!230, !232, !233, !234, !235, !236, !237, !238, !252, !253}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !228, file: !189, line: 63, baseType: !231, size: 64)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !228, file: !189, line: 63, baseType: !231, size: 64, offset: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !228, file: !189, line: 64, baseType: !174, size: 8, offset: 128)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !228, file: !189, line: 64, baseType: !174, size: 8, offset: 136)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !228, file: !189, line: 65, baseType: !221, size: 16, offset: 144)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !228, file: !189, line: 66, baseType: !173, size: 512, offset: 160)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !228, file: !189, line: 67, baseType: !168, size: 32, offset: 672)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !228, file: !189, line: 69, baseType: !239, size: 256, offset: 704)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !189, line: 60, baseType: !240)
!240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !189, line: 48, size: 256, elements: !241)
!241 = !{!242, !243, !250, !251}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !240, file: !189, line: 49, baseType: !193, size: 64)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !240, file: !189, line: 58, baseType: !244, size: 128, offset: 64)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !245, line: 71, baseType: !246)
!245 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!246 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !245, line: 69, size: 128, elements: !247)
!247 = !{!248, !249}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !246, file: !245, line: 70, baseType: !193, size: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !246, file: !245, line: 70, baseType: !193, size: 64, offset: 64)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !240, file: !189, line: 59, baseType: !168, size: 32, offset: 192)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !240, file: !189, line: 59, baseType: !168, size: 32, offset: 224)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !228, file: !189, line: 70, baseType: !168, size: 32, offset: 960)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !228, file: !189, line: 74, baseType: !168, size: 32, offset: 992)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !184, file: !185, line: 117, baseType: !255, size: 64, offset: 960)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !113, line: 37, flags: DIFlagFwdDecl)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !184, file: !185, line: 119, baseType: !258, size: 64, offset: 1024)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!259 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !185, line: 57, flags: DIFlagFwdDecl)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !184, file: !185, line: 121, baseType: !221, size: 16, offset: 1088)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !184, file: !185, line: 121, baseType: !221, size: 16, offset: 1104)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !184, file: !185, line: 122, baseType: !168, size: 32, offset: 1120)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !184, file: !185, line: 122, baseType: !168, size: 32, offset: 1152)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !184, file: !185, line: 122, baseType: !168, size: 32, offset: 1184)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !184, file: !185, line: 123, baseType: !173, size: 512, offset: 1216)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !184, file: !185, line: 124, baseType: !183, size: 64, offset: 1728)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !184, file: !185, line: 124, baseType: !183, size: 64, offset: 1792)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !184, file: !185, line: 127, baseType: !183, size: 64, offset: 1856)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !184, file: !185, line: 127, baseType: !183, size: 64, offset: 1920)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !184, file: !185, line: 127, baseType: !183, size: 64, offset: 1984)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !184, file: !185, line: 128, baseType: !272, size: 64, offset: 2048)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64)
!273 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !274, line: 46, flags: DIFlagFwdDecl)
!274 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!275 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !184, file: !185, line: 130, baseType: !276, size: 64, offset: 2112)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!277 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !185, line: 97, size: 832, elements: !278)
!278 = !{!279, !285, !286}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !277, file: !185, line: 98, baseType: !280, size: 768)
!280 = !DICompositeType(tag: DW_TAG_array_type, baseType: !281, size: 768, elements: !282)
!281 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!282 = !{!283, !284}
!283 = !DISubrange(count: 8)
!284 = !DISubrange(count: 3)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !277, file: !185, line: 99, baseType: !168, size: 32, offset: 768)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !277, file: !185, line: 99, baseType: !168, size: 32, offset: 800)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !184, file: !185, line: 131, baseType: !288, size: 64, offset: 2176)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!289 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !290, line: 486, size: 1600, elements: !291)
!290 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!291 = !{!292, !293, !294, !295, !296, !297, !298, !299, !300}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !289, file: !290, line: 487, baseType: !188, size: 960)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !289, file: !290, line: 489, baseType: !244, size: 128, offset: 960)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !289, file: !290, line: 490, baseType: !244, size: 128, offset: 1088)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !289, file: !290, line: 491, baseType: !244, size: 128, offset: 1216)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !289, file: !290, line: 492, baseType: !244, size: 128, offset: 1344)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !289, file: !290, line: 494, baseType: !168, size: 32, offset: 1472)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !289, file: !290, line: 495, baseType: !168, size: 32, offset: 1504)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !289, file: !290, line: 497, baseType: !168, size: 32, offset: 1536)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !289, file: !290, line: 498, baseType: !168, size: 32, offset: 1568)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !184, file: !185, line: 132, baseType: !288, size: 64, offset: 2240)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !184, file: !185, line: 133, baseType: !303, size: 64, offset: 2304)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64)
!304 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !290, line: 334, size: 1728, elements: !305)
!305 = !{!306, !307, !311, !312, !313, !314, !315, !316, !319, !320, !321, !322, !323, !324, !325, !345}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !304, file: !290, line: 335, baseType: !244, size: 128)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !304, file: !290, line: 336, baseType: !308, size: 64, offset: 128)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64)
!309 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !310, line: 48, flags: DIFlagFwdDecl)
!310 = !DIFile(filename: "blender/source/blender/blenlib/BLI_ghash.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!311 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !304, file: !290, line: 338, baseType: !221, size: 16, offset: 192)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !304, file: !290, line: 338, baseType: !221, size: 16, offset: 208)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !304, file: !290, line: 339, baseType: !7, size: 32, offset: 224)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !304, file: !290, line: 340, baseType: !168, size: 32, offset: 256)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !304, file: !290, line: 342, baseType: !281, size: 32, offset: 288)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !304, file: !290, line: 343, baseType: !317, size: 96, offset: 320)
!317 = !DICompositeType(tag: DW_TAG_array_type, baseType: !281, size: 96, elements: !318)
!318 = !{!284}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !304, file: !290, line: 344, baseType: !317, size: 96, offset: 416)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !304, file: !290, line: 347, baseType: !244, size: 128, offset: 512)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !304, file: !290, line: 349, baseType: !168, size: 32, offset: 640)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !304, file: !290, line: 350, baseType: !168, size: 32, offset: 672)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !304, file: !290, line: 351, baseType: !193, size: 64, offset: 704)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !304, file: !290, line: 352, baseType: !193, size: 64, offset: 768)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !304, file: !290, line: 354, baseType: !326, size: 384, offset: 832)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !290, line: 116, baseType: !327)
!327 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !290, line: 94, size: 384, elements: !328)
!328 = !{!329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !327, file: !290, line: 96, baseType: !168, size: 32)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !327, file: !290, line: 96, baseType: !168, size: 32, offset: 32)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !327, file: !290, line: 97, baseType: !168, size: 32, offset: 64)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !327, file: !290, line: 97, baseType: !168, size: 32, offset: 96)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !327, file: !290, line: 99, baseType: !221, size: 16, offset: 128)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !327, file: !290, line: 100, baseType: !221, size: 16, offset: 144)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !327, file: !290, line: 102, baseType: !221, size: 16, offset: 160)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !327, file: !290, line: 105, baseType: !221, size: 16, offset: 176)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !327, file: !290, line: 108, baseType: !221, size: 16, offset: 192)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !327, file: !290, line: 109, baseType: !221, size: 16, offset: 208)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !327, file: !290, line: 111, baseType: !221, size: 16, offset: 224)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !327, file: !290, line: 112, baseType: !221, size: 16, offset: 240)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !327, file: !290, line: 114, baseType: !168, size: 32, offset: 256)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !327, file: !290, line: 114, baseType: !168, size: 32, offset: 288)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !327, file: !290, line: 115, baseType: !168, size: 32, offset: 320)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !327, file: !290, line: 115, baseType: !168, size: 32, offset: 352)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !304, file: !290, line: 355, baseType: !173, size: 512, offset: 1216)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !184, file: !185, line: 134, baseType: !193, size: 64, offset: 2368)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !184, file: !185, line: 136, baseType: !348, size: 64, offset: 2432)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64)
!349 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !185, line: 58, flags: DIFlagFwdDecl)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !184, file: !185, line: 138, baseType: !326, size: 384, offset: 2496)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !184, file: !185, line: 139, baseType: !352, size: 64, offset: 2880)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !290, line: 80, baseType: !354)
!354 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !290, line: 72, size: 192, elements: !355)
!355 = !{!356, !363, !364, !365, !366}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !354, file: !290, line: 73, baseType: !357, size: 64)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !290, line: 59, baseType: !359)
!359 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !290, line: 56, size: 128, elements: !360)
!360 = !{!361, !362}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !359, file: !290, line: 57, baseType: !317, size: 96)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !359, file: !290, line: 58, baseType: !168, size: 32, offset: 96)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !354, file: !290, line: 74, baseType: !168, size: 32, offset: 64)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !354, file: !290, line: 76, baseType: !168, size: 32, offset: 96)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !354, file: !290, line: 77, baseType: !168, size: 32, offset: 128)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !354, file: !290, line: 79, baseType: !168, size: 32, offset: 160)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !184, file: !185, line: 141, baseType: !244, size: 128, offset: 2944)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !184, file: !185, line: 142, baseType: !244, size: 128, offset: 3072)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !184, file: !185, line: 143, baseType: !244, size: 128, offset: 3200)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !184, file: !185, line: 144, baseType: !244, size: 128, offset: 3328)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !184, file: !185, line: 146, baseType: !168, size: 32, offset: 3456)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !184, file: !185, line: 147, baseType: !168, size: 32, offset: 3488)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !184, file: !185, line: 150, baseType: !374, size: 64, offset: 3520)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64)
!376 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !185, line: 50, flags: DIFlagFwdDecl)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !184, file: !185, line: 151, baseType: !181, size: 64, offset: 3584)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !184, file: !185, line: 152, baseType: !168, size: 32, offset: 3648)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !184, file: !185, line: 153, baseType: !168, size: 32, offset: 3680)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !184, file: !185, line: 156, baseType: !317, size: 96, offset: 3712)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !184, file: !185, line: 156, baseType: !317, size: 96, offset: 3808)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !184, file: !185, line: 156, baseType: !317, size: 96, offset: 3904)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !184, file: !185, line: 157, baseType: !317, size: 96, offset: 4000)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !184, file: !185, line: 158, baseType: !317, size: 96, offset: 4096)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !184, file: !185, line: 159, baseType: !317, size: 96, offset: 4192)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !184, file: !185, line: 160, baseType: !317, size: 96, offset: 4288)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !184, file: !185, line: 160, baseType: !317, size: 96, offset: 4384)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !184, file: !185, line: 161, baseType: !389, size: 128, offset: 4480)
!389 = !DICompositeType(tag: DW_TAG_array_type, baseType: !281, size: 128, elements: !390)
!390 = !{!391}
!391 = !DISubrange(count: 4)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !184, file: !185, line: 161, baseType: !389, size: 128, offset: 4608)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !184, file: !185, line: 162, baseType: !317, size: 96, offset: 4736)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !184, file: !185, line: 162, baseType: !317, size: 96, offset: 4832)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !184, file: !185, line: 163, baseType: !281, size: 32, offset: 4928)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !184, file: !185, line: 163, baseType: !281, size: 32, offset: 4960)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !184, file: !185, line: 164, baseType: !398, size: 512, offset: 4992)
!398 = !DICompositeType(tag: DW_TAG_array_type, baseType: !281, size: 512, elements: !399)
!399 = !{!391, !391}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !184, file: !185, line: 165, baseType: !398, size: 512, offset: 5504)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !184, file: !185, line: 166, baseType: !398, size: 512, offset: 6016)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !184, file: !185, line: 167, baseType: !398, size: 512, offset: 6528)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !184, file: !185, line: 176, baseType: !398, size: 512, offset: 7040)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !184, file: !185, line: 178, baseType: !7, size: 32, offset: 7552)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !184, file: !185, line: 180, baseType: !221, size: 16, offset: 7584)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !184, file: !185, line: 181, baseType: !221, size: 16, offset: 7600)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !184, file: !185, line: 183, baseType: !221, size: 16, offset: 7616)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !184, file: !185, line: 183, baseType: !221, size: 16, offset: 7632)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !184, file: !185, line: 184, baseType: !221, size: 16, offset: 7648)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !184, file: !185, line: 184, baseType: !221, size: 16, offset: 7664)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !184, file: !185, line: 185, baseType: !221, size: 16, offset: 7680)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !184, file: !185, line: 186, baseType: !221, size: 16, offset: 7696)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !184, file: !185, line: 187, baseType: !221, size: 16, offset: 7712)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !184, file: !185, line: 188, baseType: !174, size: 8, offset: 7728)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !184, file: !185, line: 189, baseType: !174, size: 8, offset: 7736)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !184, file: !185, line: 192, baseType: !168, size: 32, offset: 7744)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !184, file: !185, line: 192, baseType: !168, size: 32, offset: 7776)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !184, file: !185, line: 192, baseType: !168, size: 32, offset: 7808)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !184, file: !185, line: 192, baseType: !168, size: 32, offset: 7840)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !184, file: !185, line: 194, baseType: !168, size: 32, offset: 7872)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !184, file: !185, line: 202, baseType: !281, size: 32, offset: 7904)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !184, file: !185, line: 202, baseType: !281, size: 32, offset: 7936)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !184, file: !185, line: 202, baseType: !281, size: 32, offset: 7968)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !184, file: !185, line: 211, baseType: !281, size: 32, offset: 8000)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !184, file: !185, line: 212, baseType: !281, size: 32, offset: 8032)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !184, file: !185, line: 213, baseType: !281, size: 32, offset: 8064)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !184, file: !185, line: 214, baseType: !281, size: 32, offset: 8096)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !184, file: !185, line: 215, baseType: !281, size: 32, offset: 8128)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !184, file: !185, line: 216, baseType: !281, size: 32, offset: 8160)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !184, file: !185, line: 219, baseType: !281, size: 32, offset: 8192)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !184, file: !185, line: 220, baseType: !281, size: 32, offset: 8224)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !184, file: !185, line: 221, baseType: !281, size: 32, offset: 8256)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !184, file: !185, line: 224, baseType: !434, size: 16, offset: 8288)
!434 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !184, file: !185, line: 224, baseType: !434, size: 16, offset: 8304)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !184, file: !185, line: 226, baseType: !221, size: 16, offset: 8320)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !184, file: !185, line: 228, baseType: !174, size: 8, offset: 8336)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !184, file: !185, line: 229, baseType: !174, size: 8, offset: 8344)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !184, file: !185, line: 231, baseType: !221, size: 16, offset: 8352)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !184, file: !185, line: 232, baseType: !174, size: 8, offset: 8368)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !184, file: !185, line: 233, baseType: !174, size: 8, offset: 8376)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !184, file: !185, line: 234, baseType: !281, size: 32, offset: 8384)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !184, file: !185, line: 235, baseType: !281, size: 32, offset: 8416)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !184, file: !185, line: 237, baseType: !244, size: 128, offset: 8448)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !184, file: !185, line: 238, baseType: !244, size: 128, offset: 8576)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !184, file: !185, line: 239, baseType: !244, size: 128, offset: 8704)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !184, file: !185, line: 240, baseType: !244, size: 128, offset: 8832)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !184, file: !185, line: 242, baseType: !281, size: 32, offset: 8960)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !184, file: !185, line: 244, baseType: !221, size: 16, offset: 8992)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !184, file: !185, line: 245, baseType: !434, size: 16, offset: 9008)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !184, file: !185, line: 246, baseType: !389, size: 128, offset: 9024)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !184, file: !185, line: 248, baseType: !168, size: 32, offset: 9152)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !184, file: !185, line: 249, baseType: !168, size: 32, offset: 9184)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !184, file: !185, line: 251, baseType: !455, size: 64, offset: 9216)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64)
!456 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !185, line: 251, flags: DIFlagFwdDecl)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !184, file: !185, line: 253, baseType: !174, size: 8, offset: 9280)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !184, file: !185, line: 254, baseType: !174, size: 8, offset: 9288)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !184, file: !185, line: 255, baseType: !221, size: 16, offset: 9296)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !184, file: !185, line: 256, baseType: !317, size: 96, offset: 9312)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !184, file: !185, line: 258, baseType: !244, size: 128, offset: 9408)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !184, file: !185, line: 259, baseType: !244, size: 128, offset: 9536)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !184, file: !185, line: 260, baseType: !244, size: 128, offset: 9664)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !184, file: !185, line: 261, baseType: !244, size: 128, offset: 9792)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !184, file: !185, line: 263, baseType: !466, size: 64, offset: 9920)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!467 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !185, line: 52, flags: DIFlagFwdDecl)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !184, file: !185, line: 264, baseType: !469, size: 64, offset: 9984)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64)
!470 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !185, line: 53, flags: DIFlagFwdDecl)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !184, file: !185, line: 265, baseType: !472, size: 64, offset: 10048)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !290, line: 46, flags: DIFlagFwdDecl)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !184, file: !185, line: 267, baseType: !174, size: 8, offset: 10112)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !184, file: !185, line: 268, baseType: !174, size: 8, offset: 10120)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !184, file: !185, line: 269, baseType: !221, size: 16, offset: 10128)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !184, file: !185, line: 270, baseType: !281, size: 32, offset: 10144)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !184, file: !185, line: 272, baseType: !479, size: 64, offset: 10176)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64)
!480 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !61, line: 732, flags: DIFlagFwdDecl)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !184, file: !185, line: 275, baseType: !482, size: 64, offset: 10240)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64)
!483 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !185, line: 275, flags: DIFlagFwdDecl)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !184, file: !185, line: 277, baseType: !485, size: 64, offset: 10304)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64)
!486 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !28, line: 178, size: 13504, elements: !487)
!487 = !{!488, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !539, !542, !544, !545, !547, !548, !549, !550, !556, !561, !562, !566, !567, !568, !569, !570, !583, !595, !609, !613, !617, !621, !630, !642, !646, !650, !654, !658, !662, !663, !664, !665, !666, !667, !671, !672, !673, !674, !678, !679, !680, !681, !682, !687, !688, !689, !690, !691, !695, !696, !697, !698, !699, !706, !717, !722, !728, !738, !744, !755, !762, !769, !773, !778, !782, !787, !788, !789, !796, !802, !803, !804, !809, !810, !819, !928, !932, !940, !944, !948, !952, !960, !970}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "vertData", scope: !486, file: !28, line: 180, baseType: !489, size: 1600)
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomData", file: !65, line: 73, baseType: !490)
!490 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomData", file: !65, line: 64, size: 1600, elements: !491)
!491 = !{!492, !507, !511, !512, !513, !514, !517}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !490, file: !65, line: 65, baseType: !493, size: 64)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64)
!494 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataLayer", file: !65, line: 53, baseType: !495)
!495 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataLayer", file: !65, line: 42, size: 832, elements: !496)
!496 = !{!497, !498, !499, !500, !501, !502, !503, !504, !505, !506}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !495, file: !65, line: 43, baseType: !168, size: 32)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !495, file: !65, line: 44, baseType: !168, size: 32, offset: 32)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !495, file: !65, line: 45, baseType: !168, size: 32, offset: 64)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !495, file: !65, line: 46, baseType: !168, size: 32, offset: 96)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "active_rnd", scope: !495, file: !65, line: 47, baseType: !168, size: 32, offset: 128)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "active_clone", scope: !495, file: !65, line: 48, baseType: !168, size: 32, offset: 160)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "active_mask", scope: !495, file: !65, line: 49, baseType: !168, size: 32, offset: 192)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !495, file: !65, line: 50, baseType: !168, size: 32, offset: 224)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !495, file: !65, line: 51, baseType: !173, size: 512, offset: 256)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !495, file: !65, line: 52, baseType: !193, size: 64, offset: 768)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "typemap", scope: !490, file: !65, line: 66, baseType: !508, size: 1312, offset: 64)
!508 = !DICompositeType(tag: DW_TAG_array_type, baseType: !168, size: 1312, elements: !509)
!509 = !{!510}
!510 = !DISubrange(count: 41)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "totlayer", scope: !490, file: !65, line: 69, baseType: !168, size: 32, offset: 1376)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "maxlayer", scope: !490, file: !65, line: 69, baseType: !168, size: 32, offset: 1408)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "totsize", scope: !490, file: !65, line: 70, baseType: !168, size: 32, offset: 1440)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !490, file: !65, line: 71, baseType: !515, size: 64, offset: 1472)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 64)
!516 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool", file: !65, line: 71, flags: DIFlagFwdDecl)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !490, file: !65, line: 72, baseType: !518, size: 64, offset: 1536)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64)
!519 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataExternal", file: !65, line: 59, baseType: !520)
!520 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataExternal", file: !65, line: 57, size: 8192, elements: !521)
!521 = !{!522}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !520, file: !65, line: 58, baseType: !208, size: 8192)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "edgeData", scope: !486, file: !28, line: 180, baseType: !489, size: 1600, offset: 1600)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "faceData", scope: !486, file: !28, line: 180, baseType: !489, size: 1600, offset: 3200)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "loopData", scope: !486, file: !28, line: 180, baseType: !489, size: 1600, offset: 4800)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "polyData", scope: !486, file: !28, line: 180, baseType: !489, size: 1600, offset: 6400)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "numVertData", scope: !486, file: !28, line: 181, baseType: !168, size: 32, offset: 8000)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "numEdgeData", scope: !486, file: !28, line: 181, baseType: !168, size: 32, offset: 8032)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "numTessFaceData", scope: !486, file: !28, line: 181, baseType: !168, size: 32, offset: 8064)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "numLoopData", scope: !486, file: !28, line: 181, baseType: !168, size: 32, offset: 8096)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "numPolyData", scope: !486, file: !28, line: 181, baseType: !168, size: 32, offset: 8128)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "needsFree", scope: !486, file: !28, line: 182, baseType: !168, size: 32, offset: 8160)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "deformedOnly", scope: !486, file: !28, line: 183, baseType: !168, size: 32, offset: 8192)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "bvhCache", scope: !486, file: !28, line: 184, baseType: !535, size: 64, offset: 8256)
!535 = !DIDerivedType(tag: DW_TAG_typedef, name: "BVHCache", file: !536, line: 124, baseType: !537)
!536 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_bvhutils.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64)
!538 = !DICompositeType(tag: DW_TAG_structure_type, name: "LinkNode", file: !536, line: 124, flags: DIFlagFwdDecl)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "drawObject", scope: !486, file: !28, line: 185, baseType: !540, size: 64, offset: 8320)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64)
!541 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUDrawObject", file: !28, line: 97, flags: DIFlagFwdDecl)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !486, file: !28, line: 186, baseType: !543, size: 32, offset: 8384)
!543 = !DIDerivedType(tag: DW_TAG_typedef, name: "DerivedMeshType", file: !28, line: 132, baseType: !27)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "auto_bump_scale", scope: !486, file: !28, line: 187, baseType: !281, size: 32, offset: 8416)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "dirty", scope: !486, file: !28, line: 188, baseType: !546, size: 32, offset: 8448)
!546 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMDirtyFlag", file: !28, line: 175, baseType: !33)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "totmat", scope: !486, file: !28, line: 189, baseType: !168, size: 32, offset: 8480)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !486, file: !28, line: 190, baseType: !374, size: 64, offset: 8512)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "cd_flag", scope: !486, file: !28, line: 193, baseType: !174, size: 8, offset: 8576)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "calcNormals", scope: !486, file: !28, line: 196, baseType: !551, size: 64, offset: 8640)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64)
!552 = !DISubroutineType(types: !553)
!553 = !{null, !554}
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 64)
!555 = !DIDerivedType(tag: DW_TAG_typedef, name: "DerivedMesh", file: !28, line: 177, baseType: !486)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "calcLoopNormals", scope: !486, file: !28, line: 199, baseType: !557, size: 64, offset: 8704)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64)
!558 = !DISubroutineType(types: !559)
!559 = !{null, !554, !560}
!560 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !281)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "recalcTessellation", scope: !486, file: !28, line: 202, baseType: !551, size: 64, offset: 8768)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "getNumVerts", scope: !486, file: !28, line: 207, baseType: !563, size: 64, offset: 8832)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64)
!564 = !DISubroutineType(types: !565)
!565 = !{!168, !554}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "getNumEdges", scope: !486, file: !28, line: 208, baseType: !563, size: 64, offset: 8896)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "getNumTessFaces", scope: !486, file: !28, line: 209, baseType: !563, size: 64, offset: 8960)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "getNumLoops", scope: !486, file: !28, line: 210, baseType: !563, size: 64, offset: 9024)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "getNumPolys", scope: !486, file: !28, line: 211, baseType: !563, size: 64, offset: 9088)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "getVert", scope: !486, file: !28, line: 218, baseType: !571, size: 64, offset: 9152)
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64)
!572 = !DISubroutineType(types: !573)
!573 = !{null, !554, !168, !574}
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64)
!575 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MVert", file: !576, line: 65, size: 160, elements: !577)
!576 = !DIFile(filename: "blender/source/blender/makesdna/DNA_meshdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!577 = !{!578, !579, !581, !582}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !575, file: !576, line: 66, baseType: !317, size: 96)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !575, file: !576, line: 67, baseType: !580, size: 48, offset: 96)
!580 = !DICompositeType(tag: DW_TAG_array_type, baseType: !221, size: 48, elements: !318)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !575, file: !576, line: 68, baseType: !174, size: 8, offset: 144)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "bweight", scope: !575, file: !576, line: 68, baseType: !174, size: 8, offset: 152)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "getEdge", scope: !486, file: !28, line: 219, baseType: !584, size: 64, offset: 9216)
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64)
!585 = !DISubroutineType(types: !586)
!586 = !{null, !554, !168, !587}
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 64)
!588 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MEdge", file: !576, line: 48, size: 96, elements: !589)
!589 = !{!590, !591, !592, !593, !594}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !588, file: !576, line: 49, baseType: !7, size: 32)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !588, file: !576, line: 49, baseType: !7, size: 32, offset: 32)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "crease", scope: !588, file: !576, line: 50, baseType: !174, size: 8, offset: 64)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "bweight", scope: !588, file: !576, line: 50, baseType: !174, size: 8, offset: 72)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !588, file: !576, line: 51, baseType: !221, size: 16, offset: 80)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFace", scope: !486, file: !28, line: 220, baseType: !596, size: 64, offset: 9280)
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 64)
!597 = !DISubroutineType(types: !598)
!598 = !{null, !554, !168, !599}
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64)
!600 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MFace", file: !576, line: 42, size: 160, elements: !601)
!601 = !{!602, !603, !604, !605, !606, !607, !608}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !600, file: !576, line: 43, baseType: !7, size: 32)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !600, file: !576, line: 43, baseType: !7, size: 32, offset: 32)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !600, file: !576, line: 43, baseType: !7, size: 32, offset: 64)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !600, file: !576, line: 43, baseType: !7, size: 32, offset: 96)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !600, file: !576, line: 44, baseType: !221, size: 16, offset: 128)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "edcode", scope: !600, file: !576, line: 45, baseType: !174, size: 8, offset: 144)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !600, file: !576, line: 45, baseType: !174, size: 8, offset: 152)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "getVertArray", scope: !486, file: !28, line: 227, baseType: !610, size: 64, offset: 9344)
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64)
!611 = !DISubroutineType(types: !612)
!612 = !{!574, !554}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeArray", scope: !486, file: !28, line: 228, baseType: !614, size: 64, offset: 9408)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!615 = !DISubroutineType(types: !616)
!616 = !{!587, !554}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceArray", scope: !486, file: !28, line: 229, baseType: !618, size: 64, offset: 9472)
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !619, size: 64)
!619 = !DISubroutineType(types: !620)
!620 = !{!599, !554}
!621 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopArray", scope: !486, file: !28, line: 230, baseType: !622, size: 64, offset: 9536)
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 64)
!623 = !DISubroutineType(types: !624)
!624 = !{!625, !554}
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 64)
!626 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MLoop", file: !576, line: 88, size: 64, elements: !627)
!627 = !{!628, !629}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !626, file: !576, line: 89, baseType: !7, size: 32)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !626, file: !576, line: 90, baseType: !7, size: 32, offset: 32)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyArray", scope: !486, file: !28, line: 231, baseType: !631, size: 64, offset: 9600)
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64)
!632 = !DISubroutineType(types: !633)
!633 = !{!634, !554}
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64)
!635 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MPoly", file: !576, line: 79, size: 96, elements: !636)
!636 = !{!637, !638, !639, !640, !641}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "loopstart", scope: !635, file: !576, line: 81, baseType: !168, size: 32)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !635, file: !576, line: 82, baseType: !168, size: 32, offset: 32)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !635, file: !576, line: 83, baseType: !221, size: 16, offset: 64)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !635, file: !576, line: 84, baseType: !174, size: 8, offset: 80)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !635, file: !576, line: 84, baseType: !174, size: 8, offset: 88)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "copyVertArray", scope: !486, file: !28, line: 236, baseType: !643, size: 64, offset: 9664)
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 64)
!644 = !DISubroutineType(types: !645)
!645 = !{null, !554, !574}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "copyEdgeArray", scope: !486, file: !28, line: 237, baseType: !647, size: 64, offset: 9728)
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !648, size: 64)
!648 = !DISubroutineType(types: !649)
!649 = !{null, !554, !587}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "copyTessFaceArray", scope: !486, file: !28, line: 238, baseType: !651, size: 64, offset: 9792)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64)
!652 = !DISubroutineType(types: !653)
!653 = !{null, !554, !599}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "copyLoopArray", scope: !486, file: !28, line: 239, baseType: !655, size: 64, offset: 9856)
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 64)
!656 = !DISubroutineType(types: !657)
!657 = !{null, !554, !625}
!658 = !DIDerivedType(tag: DW_TAG_member, name: "copyPolyArray", scope: !486, file: !28, line: 240, baseType: !659, size: 64, offset: 9920)
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 64)
!660 = !DISubroutineType(types: !661)
!661 = !{null, !554, !634}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "dupVertArray", scope: !486, file: !28, line: 245, baseType: !610, size: 64, offset: 9984)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "dupEdgeArray", scope: !486, file: !28, line: 246, baseType: !614, size: 64, offset: 10048)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "dupTessFaceArray", scope: !486, file: !28, line: 247, baseType: !618, size: 64, offset: 10112)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "dupLoopArray", scope: !486, file: !28, line: 248, baseType: !622, size: 64, offset: 10176)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "dupPolyArray", scope: !486, file: !28, line: 249, baseType: !631, size: 64, offset: 10240)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "getVertData", scope: !486, file: !28, line: 255, baseType: !668, size: 64, offset: 10304)
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 64)
!669 = !DISubroutineType(types: !670)
!670 = !{!193, !554, !168, !168}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeData", scope: !486, file: !28, line: 256, baseType: !668, size: 64, offset: 10368)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceData", scope: !486, file: !28, line: 257, baseType: !668, size: 64, offset: 10432)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyData", scope: !486, file: !28, line: 258, baseType: !668, size: 64, offset: 10496)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "getVertDataArray", scope: !486, file: !28, line: 264, baseType: !675, size: 64, offset: 10560)
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !676, size: 64)
!676 = !DISubroutineType(types: !677)
!677 = !{!193, !554, !168}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeDataArray", scope: !486, file: !28, line: 265, baseType: !675, size: 64, offset: 10624)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceDataArray", scope: !486, file: !28, line: 266, baseType: !675, size: 64, offset: 10688)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopDataArray", scope: !486, file: !28, line: 267, baseType: !675, size: 64, offset: 10752)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyDataArray", scope: !486, file: !28, line: 268, baseType: !675, size: 64, offset: 10816)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "getVertDataLayout", scope: !486, file: !28, line: 272, baseType: !683, size: 64, offset: 10880)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 64)
!684 = !DISubroutineType(types: !685)
!685 = !{!686, !554}
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeDataLayout", scope: !486, file: !28, line: 273, baseType: !683, size: 64, offset: 10944)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceDataLayout", scope: !486, file: !28, line: 274, baseType: !683, size: 64, offset: 11008)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopDataLayout", scope: !486, file: !28, line: 275, baseType: !683, size: 64, offset: 11072)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyDataLayout", scope: !486, file: !28, line: 276, baseType: !683, size: 64, offset: 11136)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromVertCData", scope: !486, file: !28, line: 279, baseType: !692, size: 64, offset: 11200)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64)
!693 = !DISubroutineType(types: !694)
!694 = !{null, !554, !168, !686, !168}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromEdgeCData", scope: !486, file: !28, line: 280, baseType: !692, size: 64, offset: 11264)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromFaceCData", scope: !486, file: !28, line: 281, baseType: !692, size: 64, offset: 11328)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "getNumGrids", scope: !486, file: !28, line: 284, baseType: !563, size: 64, offset: 11392)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "getGridSize", scope: !486, file: !28, line: 285, baseType: !563, size: 64, offset: 11456)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "getGridData", scope: !486, file: !28, line: 286, baseType: !700, size: 64, offset: 11520)
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !701, size: 64)
!701 = !DISubroutineType(types: !702)
!702 = !{!703, !554}
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 64)
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !705, size: 64)
!705 = !DICompositeType(tag: DW_TAG_structure_type, name: "CCGElem", file: !28, line: 82, flags: DIFlagFwdDecl)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "getGridAdjacency", scope: !486, file: !28, line: 287, baseType: !707, size: 64, offset: 11584)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 64)
!708 = !DISubroutineType(types: !709)
!709 = !{!710, !554}
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 64)
!711 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMGridAdjacency", file: !28, line: 120, baseType: !712)
!712 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DMGridAdjacency", file: !28, line: 117, size: 256, elements: !713)
!713 = !{!714, !716}
!714 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !712, file: !28, line: 118, baseType: !715, size: 128)
!715 = !DICompositeType(tag: DW_TAG_array_type, baseType: !168, size: 128, elements: !390)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "rotation", scope: !712, file: !28, line: 119, baseType: !715, size: 128, offset: 128)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "getGridOffset", scope: !486, file: !28, line: 288, baseType: !718, size: 64, offset: 11648)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 64)
!719 = !DISubroutineType(types: !720)
!720 = !{!721, !554}
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "getGridKey", scope: !486, file: !28, line: 289, baseType: !723, size: 64, offset: 11712)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 64)
!724 = !DISubroutineType(types: !725)
!725 = !{null, !554, !726}
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 64)
!727 = !DICompositeType(tag: DW_TAG_structure_type, name: "CCGKey", file: !28, line: 83, flags: DIFlagFwdDecl)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "getGridFlagMats", scope: !486, file: !28, line: 290, baseType: !729, size: 64, offset: 11776)
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64)
!730 = !DISubroutineType(types: !731)
!731 = !{!732, !554}
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 64)
!733 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMFlagMat", file: !28, line: 126, baseType: !734)
!734 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DMFlagMat", file: !28, line: 123, size: 32, elements: !735)
!735 = !{!736, !737}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !734, file: !28, line: 124, baseType: !221, size: 16)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !734, file: !28, line: 125, baseType: !174, size: 8, offset: 16)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "getGridHidden", scope: !486, file: !28, line: 291, baseType: !739, size: 64, offset: 11840)
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 64)
!740 = !DISubroutineType(types: !741)
!741 = !{!742, !554}
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !743, size: 64)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedVert", scope: !486, file: !28, line: 299, baseType: !745, size: 64, offset: 11904)
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 64)
!746 = !DISubroutineType(types: !747)
!747 = !{null, !554, !748, !193, !754}
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 64)
!749 = !DISubroutineType(types: !750)
!750 = !{null, !193, !168, !751, !751, !752}
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 64)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 64)
!753 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !221)
!754 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMForeachFlag", file: !28, line: 162, baseType: !38)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedEdge", scope: !486, file: !28, line: 309, baseType: !756, size: 64, offset: 11968)
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !757, size: 64)
!757 = !DISubroutineType(types: !758)
!758 = !{null, !554, !759, !193}
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !760, size: 64)
!760 = !DISubroutineType(types: !761)
!761 = !{null, !193, !168, !751, !751}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedLoop", scope: !486, file: !28, line: 317, baseType: !763, size: 64, offset: 12032)
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 64)
!764 = !DISubroutineType(types: !765)
!765 = !{null, !554, !766, !193, !754}
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64)
!767 = !DISubroutineType(types: !768)
!768 = !{null, !193, !168, !168, !751, !751}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedFaceCenter", scope: !486, file: !28, line: 327, baseType: !770, size: 64, offset: 12096)
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !771, size: 64)
!771 = !DISubroutineType(types: !772)
!772 = !{null, !554, !759, !193, !754}
!773 = !DIDerivedType(tag: DW_TAG_member, name: "getMinMax", scope: !486, file: !28, line: 337, baseType: !774, size: 64, offset: 12160)
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 64)
!775 = !DISubroutineType(types: !776)
!776 = !{null, !554, !777, !777}
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "getVertCo", scope: !486, file: !28, line: 344, baseType: !779, size: 64, offset: 12224)
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !780, size: 64)
!780 = !DISubroutineType(types: !781)
!781 = !{null, !554, !168, !777}
!782 = !DIDerivedType(tag: DW_TAG_member, name: "getVertCos", scope: !486, file: !28, line: 347, baseType: !783, size: 64, offset: 12288)
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !784, size: 64)
!784 = !DISubroutineType(types: !785)
!785 = !{null, !554, !786}
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "getVertNo", scope: !486, file: !28, line: 350, baseType: !779, size: 64, offset: 12352)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyNo", scope: !486, file: !28, line: 351, baseType: !779, size: 64, offset: 12416)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyMap", scope: !486, file: !28, line: 355, baseType: !790, size: 64, offset: 12480)
!790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !791, size: 64)
!791 = !DISubroutineType(types: !792)
!792 = !{!793, !183, !554}
!793 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !794, size: 64)
!794 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !795)
!795 = !DICompositeType(tag: DW_TAG_structure_type, name: "MeshElemMap", file: !28, line: 355, flags: DIFlagFwdDecl)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "getPBVH", scope: !486, file: !28, line: 359, baseType: !797, size: 64, offset: 12544)
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !798, size: 64)
!798 = !DISubroutineType(types: !799)
!799 = !{!800, !183, !554}
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !801, size: 64)
!801 = !DICompositeType(tag: DW_TAG_structure_type, name: "PBVH", file: !28, line: 100, flags: DIFlagFwdDecl)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "drawVerts", scope: !486, file: !28, line: 364, baseType: !551, size: 64, offset: 12608)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "drawUVEdges", scope: !486, file: !28, line: 367, baseType: !551, size: 64, offset: 12672)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "drawEdges", scope: !486, file: !28, line: 373, baseType: !805, size: 64, offset: 12736)
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !806, size: 64)
!806 = !DISubroutineType(types: !807)
!807 = !{null, !554, !808, !808}
!808 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "drawLooseEdges", scope: !486, file: !28, line: 376, baseType: !551, size: 64, offset: 12800)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "drawFacesSolid", scope: !486, file: !28, line: 385, baseType: !811, size: 64, offset: 12864)
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !812, size: 64)
!812 = !DISubroutineType(types: !813)
!813 = !{null, !554, !814, !808, !815}
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!815 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSetMaterial", file: !28, line: 146, baseType: !816)
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 64)
!817 = !DISubroutineType(types: !818)
!818 = !{!168, !168, !193}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "drawFacesTex", scope: !486, file: !28, line: 391, baseType: !820, size: 64, offset: 12928)
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !821, size: 64)
!821 = !DISubroutineType(types: !822)
!822 = !{null, !554, !823, !923, !193, !927}
!823 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSetDrawOptionsTex", file: !28, line: 150, baseType: !824)
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !825, size: 64)
!825 = !DISubroutineType(types: !826)
!826 = !{!827, !828, !922, !168}
!827 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMDrawOption", file: !28, line: 143, baseType: !42)
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !829, size: 64)
!829 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTFace", file: !576, line: 160, size: 384, elements: !830)
!830 = !{!831, !835, !917, !918, !919, !920, !921}
!831 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !829, file: !576, line: 161, baseType: !832, size: 256)
!832 = !DICompositeType(tag: DW_TAG_array_type, baseType: !281, size: 256, elements: !833)
!833 = !{!391, !834}
!834 = !DISubrange(count: 2)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "tpage", scope: !829, file: !576, line: 162, baseType: !836, size: 64, offset: 256)
!836 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !837, size: 64)
!837 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !838, line: 77, size: 15424, elements: !839)
!838 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!839 = !{!840, !841, !842, !845, !848, !851, !854, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !906, !907, !911}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !837, file: !838, line: 78, baseType: !188, size: 960)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !837, file: !838, line: 80, baseType: !208, size: 8192, offset: 960)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !837, file: !838, line: 82, baseType: !843, size: 64, offset: 9152)
!843 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !844, size: 64)
!844 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !838, line: 43, flags: DIFlagFwdDecl)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !837, file: !838, line: 83, baseType: !846, size: 64, offset: 9216)
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 64)
!847 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !189, line: 46, flags: DIFlagFwdDecl)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !837, file: !838, line: 86, baseType: !849, size: 64, offset: 9280)
!849 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !850, size: 64)
!850 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !838, line: 41, flags: DIFlagFwdDecl)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !837, file: !838, line: 87, baseType: !852, size: 64, offset: 9344)
!852 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !853, size: 64)
!853 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !838, line: 44, flags: DIFlagFwdDecl)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !837, file: !838, line: 89, baseType: !855, size: 512, offset: 9408)
!855 = !DICompositeType(tag: DW_TAG_array_type, baseType: !852, size: 512, elements: !856)
!856 = !{!283}
!857 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !837, file: !838, line: 90, baseType: !221, size: 16, offset: 9920)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !837, file: !838, line: 90, baseType: !221, size: 16, offset: 9936)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !837, file: !838, line: 92, baseType: !221, size: 16, offset: 9952)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !837, file: !838, line: 92, baseType: !221, size: 16, offset: 9968)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !837, file: !838, line: 93, baseType: !221, size: 16, offset: 9984)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !837, file: !838, line: 93, baseType: !221, size: 16, offset: 10000)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !837, file: !838, line: 94, baseType: !168, size: 32, offset: 10016)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !837, file: !838, line: 97, baseType: !221, size: 16, offset: 10048)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !837, file: !838, line: 97, baseType: !221, size: 16, offset: 10064)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !837, file: !838, line: 98, baseType: !221, size: 16, offset: 10080)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !837, file: !838, line: 98, baseType: !221, size: 16, offset: 10096)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !837, file: !838, line: 99, baseType: !221, size: 16, offset: 10112)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !837, file: !838, line: 99, baseType: !221, size: 16, offset: 10128)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !837, file: !838, line: 100, baseType: !7, size: 32, offset: 10144)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !837, file: !838, line: 101, baseType: !743, size: 64, offset: 10176)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !837, file: !838, line: 103, baseType: !214, size: 64, offset: 10240)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !837, file: !838, line: 104, baseType: !874, size: 64, offset: 10304)
!874 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !875, size: 64)
!875 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !189, line: 159, size: 448, elements: !876)
!876 = !{!877, !880, !881, !883, !884, !886}
!877 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !875, file: !189, line: 161, baseType: !878, size: 64)
!878 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !879)
!879 = !{!834}
!880 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !875, file: !189, line: 162, baseType: !878, size: 64, offset: 64)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !875, file: !189, line: 163, baseType: !882, size: 32, offset: 128)
!882 = !DICompositeType(tag: DW_TAG_array_type, baseType: !221, size: 32, elements: !879)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !875, file: !189, line: 164, baseType: !882, size: 32, offset: 160)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !875, file: !189, line: 165, baseType: !885, size: 128, offset: 192)
!885 = !DICompositeType(tag: DW_TAG_array_type, baseType: !743, size: 128, elements: !879)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !875, file: !189, line: 166, baseType: !887, size: 128, offset: 320)
!887 = !DICompositeType(tag: DW_TAG_array_type, baseType: !846, size: 128, elements: !879)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !837, file: !838, line: 107, baseType: !281, size: 32, offset: 10368)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !837, file: !838, line: 108, baseType: !168, size: 32, offset: 10400)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !837, file: !838, line: 109, baseType: !221, size: 16, offset: 10432)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !837, file: !838, line: 110, baseType: !221, size: 16, offset: 10448)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !837, file: !838, line: 113, baseType: !168, size: 32, offset: 10464)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !837, file: !838, line: 113, baseType: !168, size: 32, offset: 10496)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !837, file: !838, line: 114, baseType: !174, size: 8, offset: 10528)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !837, file: !838, line: 114, baseType: !174, size: 8, offset: 10536)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !837, file: !838, line: 115, baseType: !221, size: 16, offset: 10544)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !837, file: !838, line: 116, baseType: !389, size: 128, offset: 10560)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !837, file: !838, line: 119, baseType: !281, size: 32, offset: 10688)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !837, file: !838, line: 119, baseType: !281, size: 32, offset: 10720)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !837, file: !838, line: 122, baseType: !901, size: 512, offset: 10752)
!901 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !902, line: 182, baseType: !903)
!902 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!903 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !902, line: 180, size: 512, elements: !904)
!904 = !{!905}
!905 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !903, file: !902, line: 181, baseType: !173, size: 512)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !837, file: !838, line: 123, baseType: !174, size: 8, offset: 11264)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !837, file: !838, line: 125, baseType: !908, size: 56, offset: 11272)
!908 = !DICompositeType(tag: DW_TAG_array_type, baseType: !174, size: 56, elements: !909)
!909 = !{!910}
!910 = !DISubrange(count: 7)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !837, file: !838, line: 126, baseType: !912, size: 4096, offset: 11328)
!912 = !DICompositeType(tag: DW_TAG_array_type, baseType: !913, size: 4096, elements: !856)
!913 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !838, line: 69, baseType: !914)
!914 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !838, line: 67, size: 512, elements: !915)
!915 = !{!916}
!916 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !914, file: !838, line: 68, baseType: !173, size: 512)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !829, file: !576, line: 163, baseType: !174, size: 8, offset: 320)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "transp", scope: !829, file: !576, line: 163, baseType: !174, size: 8, offset: 328)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !829, file: !576, line: 164, baseType: !221, size: 16, offset: 336)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "tile", scope: !829, file: !576, line: 164, baseType: !221, size: 16, offset: 352)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "unwrap", scope: !829, file: !576, line: 164, baseType: !221, size: 16, offset: 368)
!922 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !808)
!923 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMCompareDrawOptions", file: !28, line: 147, baseType: !924)
!924 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !925, size: 64)
!925 = !DISubroutineType(types: !926)
!926 = !{!168, !193, !168, !168}
!927 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMDrawFlag", file: !28, line: 157, baseType: !48)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "drawFacesGLSL", scope: !486, file: !28, line: 400, baseType: !929, size: 64, offset: 12992)
!929 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !930, size: 64)
!930 = !DISubroutineType(types: !931)
!931 = !{null, !554, !815}
!932 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedFaces", scope: !486, file: !28, line: 415, baseType: !933, size: 64, offset: 13056)
!933 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !934, size: 64)
!934 = !DISubroutineType(types: !935)
!935 = !{null, !554, !936, !815, !923, !193, !927}
!936 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSetDrawOptions", file: !28, line: 149, baseType: !937)
!937 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !938, size: 64)
!938 = !DISubroutineType(types: !939)
!939 = !{!827, !193, !168}
!940 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedFacesTex", scope: !486, file: !28, line: 425, baseType: !941, size: 64, offset: 13120)
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 64)
!942 = !DISubroutineType(types: !943)
!943 = !{null, !554, !936, !923, !193, !927}
!944 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedFacesGLSL", scope: !486, file: !28, line: 435, baseType: !945, size: 64, offset: 13184)
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64)
!946 = !DISubroutineType(types: !947)
!947 = !{null, !554, !815, !936, !193}
!948 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedEdges", scope: !486, file: !28, line: 444, baseType: !949, size: 64, offset: 13248)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64)
!950 = !DISubroutineType(types: !951)
!951 = !{null, !554, !936, !193}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedEdgesInterp", scope: !486, file: !28, line: 455, baseType: !953, size: 64, offset: 13312)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64)
!954 = !DISubroutineType(types: !955)
!955 = !{null, !554, !936, !956, !193}
!956 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSetDrawInterpOptions", file: !28, line: 148, baseType: !957)
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 64)
!958 = !DISubroutineType(types: !959)
!959 = !{null, !193, !168, !281}
!960 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedFacesMat", scope: !486, file: !28, line: 464, baseType: !961, size: 64, offset: 13376)
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 64)
!962 = !DISubroutineType(types: !963)
!963 = !{null, !554, !964, !967, !193}
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !965, size: 64)
!965 = !DISubroutineType(types: !966)
!966 = !{null, !193, !168, !193}
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 64)
!968 = !DISubroutineType(types: !969)
!969 = !{!808, !193, !168}
!970 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !486, file: !28, line: 470, baseType: !551, size: 64, offset: 13440)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !184, file: !185, line: 277, baseType: !485, size: 64, offset: 10368)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !184, file: !185, line: 278, baseType: !973, size: 64, offset: 10432)
!973 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !974, line: 27, baseType: !975)
!974 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!975 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !976, line: 45, baseType: !977)
!976 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!977 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_mask", scope: !184, file: !185, line: 279, baseType: !973, size: 64, offset: 10496)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !184, file: !185, line: 280, baseType: !7, size: 32, offset: 10560)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !184, file: !185, line: 281, baseType: !7, size: 32, offset: 10592)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "gpulamp", scope: !184, file: !185, line: 283, baseType: !244, size: 128, offset: 10624)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "pc_ids", scope: !184, file: !185, line: 284, baseType: !244, size: 128, offset: 10752)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "duplilist", scope: !184, file: !185, line: 285, baseType: !984, size: 64, offset: 10880)
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_object", scope: !184, file: !185, line: 287, baseType: !986, size: 64, offset: 10944)
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 64)
!987 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyOb", file: !185, line: 59, flags: DIFlagFwdDecl)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_constraint", scope: !184, file: !185, line: 288, baseType: !989, size: 64, offset: 11008)
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 64)
!990 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyCon", file: !185, line: 288, flags: DIFlagFwdDecl)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "ima_ofs", scope: !184, file: !185, line: 290, baseType: !992, size: 64, offset: 11072)
!992 = !DICompositeType(tag: DW_TAG_array_type, baseType: !281, size: 64, elements: !879)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !184, file: !185, line: 291, baseType: !994, size: 64, offset: 11136)
!994 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !995, size: 64)
!995 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageUser", file: !838, line: 65, baseType: !996)
!996 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !838, line: 50, size: 320, elements: !997)
!997 = !{!998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011}
!998 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !996, file: !838, line: 51, baseType: !178, size: 64)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !996, file: !838, line: 53, baseType: !168, size: 32, offset: 64)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !996, file: !838, line: 54, baseType: !168, size: 32, offset: 96)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !996, file: !838, line: 55, baseType: !168, size: 32, offset: 128)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !996, file: !838, line: 55, baseType: !168, size: 32, offset: 160)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !996, file: !838, line: 56, baseType: !174, size: 8, offset: 192)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "cycl", scope: !996, file: !838, line: 56, baseType: !174, size: 8, offset: 200)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !996, file: !838, line: 57, baseType: !174, size: 8, offset: 208)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !996, file: !838, line: 57, baseType: !174, size: 8, offset: 216)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "multi_index", scope: !996, file: !838, line: 59, baseType: !221, size: 16, offset: 224)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !996, file: !838, line: 59, baseType: !221, size: 16, offset: 240)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !996, file: !838, line: 59, baseType: !221, size: 16, offset: 256)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !996, file: !838, line: 61, baseType: !221, size: 16, offset: 272)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !996, file: !838, line: 63, baseType: !168, size: 32, offset: 288)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "lodlevels", scope: !184, file: !185, line: 293, baseType: !244, size: 128, offset: 11200)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "currentlod", scope: !184, file: !185, line: 294, baseType: !1014, size: 64, offset: 11328)
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64)
!1015 = !DIDerivedType(tag: DW_TAG_typedef, name: "LodLevel", file: !185, line: 113, baseType: !1016)
!1016 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LodLevel", file: !185, line: 108, size: 256, elements: !1017)
!1017 = !{!1018, !1020, !1021, !1022, !1023}
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1016, file: !185, line: 109, baseType: !1019, size: 64)
!1019 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1016, size: 64)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1016, file: !185, line: 109, baseType: !1019, size: 64, offset: 64)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !1016, file: !185, line: 110, baseType: !183, size: 64, offset: 128)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1016, file: !185, line: 111, baseType: !168, size: 32, offset: 192)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "distance", scope: !1016, file: !185, line: 112, baseType: !281, size: 32, offset: 224)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "vgroup", scope: !158, file: !61, line: 187, baseType: !173, size: 512, offset: 960)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !158, file: !61, line: 189, baseType: !168, size: 32, offset: 1472)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !158, file: !61, line: 190, baseType: !168, size: 32, offset: 1504)
!1027 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !1028, line: 87, baseType: !1029)
!1028 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!1029 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1031, size: 64)
!1031 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_gh_Entry", file: !310, line: 94, size: 192, elements: !1032)
!1032 = !{!1033, !1034, !1035}
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1031, file: !310, line: 94, baseType: !193, size: 64)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1031, file: !310, line: 94, baseType: !193, size: 64, offset: 64)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1031, file: !310, line: 94, baseType: !193, size: 64, offset: 128)
!1036 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1037, size: 64)
!1037 = !DIDerivedType(tag: DW_TAG_typedef, name: "bArmature", file: !113, line: 114, baseType: !1038)
!1038 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bArmature", file: !113, line: 78, size: 2048, elements: !1039)
!1039 = !{!1040, !1041, !1042, !1043, !1044, !1045, !1084, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106}
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1038, file: !113, line: 79, baseType: !188, size: 960)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1038, file: !113, line: 80, baseType: !255, size: 64, offset: 960)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "bonebase", scope: !1038, file: !113, line: 82, baseType: !244, size: 128, offset: 1024)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "chainbase", scope: !1038, file: !113, line: 83, baseType: !244, size: 128, offset: 1152)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "edbo", scope: !1038, file: !113, line: 84, baseType: !984, size: 64, offset: 1280)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "act_bone", scope: !1038, file: !113, line: 92, baseType: !1046, size: 64, offset: 1344)
!1046 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1047, size: 64)
!1047 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bone", file: !113, line: 76, baseType: !1048)
!1048 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Bone", file: !113, line: 48, size: 2624, elements: !1049)
