; ModuleID = 'blender/source/blender/editors/physics/physics_pointcache.c'
source_filename = "blender/source/blender/editors/physics/physics_pointcache.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.Global = type { %struct.Main*, [1024 x i8], [1024 x i8], i8, i8, i8, %struct.ListBase, i8, i8, i8, i16, i16, i16, i8, i16, i32, i32, i8, i32, i32, [200 x i8] }
%struct.Main = type { %struct.Main*, %struct.Main*, [1024 x i8], i16, i16, i16, i16, i64, [16 x i8], i16, %struct.Library*, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, [256 x i8], %struct.EvaluationContext*, %struct.MainLock* }
%struct.Library = type { %struct.ID, %struct.ID*, %struct.FileData*, [1024 x i8], [1024 x i8], %struct.Library*, %struct.PackedFile* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !13, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "blender/source/blender/editors/physics/physics_pointcache.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 351, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "blender/source/blender/makesdna/DNA_windowmanager_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9, !10, !11, !12}
!7 = !DIEnumerator(name: "OPERATOR_RUNNING_MODAL", value: 1, isUnsigned: true)
!8 = !DIEnumerator(name: "OPERATOR_CANCELLED", value: 2, isUnsigned: true)
!9 = !DIEnumerator(name: "OPERATOR_FINISHED", value: 4, isUnsigned: true)
!10 = !DIEnumerator(name: "OPERATOR_PASS_THROUGH", value: 8, isUnsigned: true)
!11 = !DIEnumerator(name: "OPERATOR_HANDLED", value: 16, isUnsigned: true)
!12 = !DIEnumerator(name: "OPERATOR_INTERFACE", value: 32, isUnsigned: true)
!13 = !{!14, !15, !19}
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!16 = !DISubroutineType(types: !17)
!17 = !{null, !14, !18}
!18 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!20 = !DISubroutineType(types: !21)
!21 = !{null, !14}
!22 = !{i32 7, !"Dwarf Version", i32 4}
!23 = !{i32 2, !"Debug Info Version", i32 3}
!24 = !{i32 1, !"wchar_size", i32 4}
!25 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!26 = distinct !DISubprogram(name: "PTCACHE_OT_bake_all", scope: !1, file: !1, line: 162, type: !27, scopeLine: 163, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !314)
!27 = !DISubroutineType(types: !28)
!28 = !{null, !29}
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "wmOperatorType", file: !31, line: 568, baseType: !32)
!31 = !DIFile(filename: "blender/source/blender/windowmanager/WM_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!32 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmOperatorType", file: !31, line: 508, size: 1536, elements: !33)
!33 = !{!34, !38, !39, !40, !41, !239, !244, !250, !254, !255, !259, !260, !261, !262, !266, !267, !282, !283, !287, !313}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !32, file: !31, line: 509, baseType: !35, size: 64)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!36 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !37)
!37 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !32, file: !31, line: 510, baseType: !35, size: 64, offset: 64)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "translation_context", scope: !32, file: !31, line: 511, baseType: !35, size: 64, offset: 128)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !32, file: !31, line: 512, baseType: !35, size: 64, offset: 192)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !32, file: !31, line: 518, baseType: !42, size: 64, offset: 256)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!43 = !DISubroutineType(types: !44)
!44 = !{!18, !45, !48}
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!46 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !47, line: 44, flags: DIFlagFwdDecl)
!47 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!49 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmOperator", file: !4, line: 328, size: 1344, elements: !50)
!50 = !{!51, !52, !53, !57, !88, !90, !91, !92, !104, !229, !230, !231, !234, !235}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !49, file: !4, line: 329, baseType: !48, size: 64)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !49, file: !4, line: 329, baseType: !48, size: 64, offset: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !49, file: !4, line: 332, baseType: !54, size: 512, offset: 128)
!54 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 512, elements: !55)
!55 = !{!56}
!56 = !DISubrange(count: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !49, file: !4, line: 333, baseType: !58, size: 64, offset: 640)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !60, line: 75, baseType: !61)
!60 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!61 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !60, line: 62, size: 1024, elements: !62)
!62 = !{!63, !65, !66, !67, !68, !70, !71, !72, !86, !87}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !61, file: !60, line: 63, baseType: !64, size: 64)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !61, file: !60, line: 63, baseType: !64, size: 64, offset: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !61, file: !60, line: 64, baseType: !37, size: 8, offset: 128)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !61, file: !60, line: 64, baseType: !37, size: 8, offset: 136)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !61, file: !60, line: 65, baseType: !69, size: 16, offset: 144)
!69 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !61, file: !60, line: 66, baseType: !54, size: 512, offset: 160)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !61, file: !60, line: 67, baseType: !18, size: 32, offset: 672)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !61, file: !60, line: 69, baseType: !73, size: 256, offset: 704)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !60, line: 60, baseType: !74)
!74 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !60, line: 48, size: 256, elements: !75)
!75 = !{!76, !77, !84, !85}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !74, file: !60, line: 49, baseType: !14, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !74, file: !60, line: 58, baseType: !78, size: 128, offset: 64)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !79, line: 71, baseType: !80)
!79 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !79, line: 69, size: 128, elements: !81)
!81 = !{!82, !83}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !80, file: !79, line: 70, baseType: !14, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !80, file: !79, line: 70, baseType: !14, size: 64, offset: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !74, file: !60, line: 59, baseType: !18, size: 32, offset: 192)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !74, file: !60, line: 59, baseType: !18, size: 32, offset: 224)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !61, file: !60, line: 70, baseType: !18, size: 32, offset: 960)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !61, file: !60, line: 74, baseType: !18, size: 32, offset: 992)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !49, file: !4, line: 336, baseType: !89, size: 64, offset: 704)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !49, file: !4, line: 337, baseType: !14, size: 64, offset: 768)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "py_instance", scope: !49, file: !4, line: 338, baseType: !14, size: 64, offset: 832)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !49, file: !4, line: 340, baseType: !93, size: 64, offset: 896)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !47, line: 55, size: 192, elements: !95)
!95 = !{!96, !100, !103}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !94, file: !47, line: 58, baseType: !97, size: 64)
!97 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !94, file: !47, line: 56, size: 64, elements: !98)
!98 = !{!99}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !97, file: !47, line: 57, baseType: !14, size: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !94, file: !47, line: 60, baseType: !101, size: 64, offset: 64)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !47, line: 41, flags: DIFlagFwdDecl)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !94, file: !47, line: 61, baseType: !14, size: 64, offset: 128)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "reports", scope: !49, file: !4, line: 341, baseType: !105, size: 64, offset: 960)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ReportList", file: !4, line: 106, size: 320, elements: !107)
!107 = !{!108, !109, !110, !111, !112, !113}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !106, file: !4, line: 107, baseType: !78, size: 128)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "printlevel", scope: !106, file: !4, line: 108, baseType: !18, size: 32, offset: 128)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "storelevel", scope: !106, file: !4, line: 109, baseType: !18, size: 32, offset: 160)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !106, file: !4, line: 110, baseType: !18, size: 32, offset: 192)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !106, file: !4, line: 110, baseType: !18, size: 32, offset: 224)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "reporttimer", scope: !106, file: !4, line: 111, baseType: !114, size: 64, offset: 256)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTimer", file: !31, line: 490, size: 768, elements: !116)
!116 = !{!117, !118, !119, !220, !221, !222, !223, !224, !225, !226, !227, !228}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !115, file: !31, line: 491, baseType: !114, size: 64)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !115, file: !31, line: 491, baseType: !114, size: 64, offset: 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "win", scope: !115, file: !31, line: 493, baseType: !120, size: 64, offset: 128)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindow", file: !4, line: 169, size: 2048, elements: !122)
!122 = !{!123, !124, !125, !126, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !195, !198, !212, !213, !214, !215, !216, !217, !218, !219}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !121, file: !4, line: 170, baseType: !120, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !121, file: !4, line: 170, baseType: !120, size: 64, offset: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "ghostwin", scope: !121, file: !4, line: 172, baseType: !14, size: 64, offset: 128)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !121, file: !4, line: 174, baseType: !127, size: 64, offset: 192)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !129, line: 41, flags: DIFlagFwdDecl)
!129 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_context.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!130 = !DIDerivedType(tag: DW_TAG_member, name: "newscreen", scope: !121, file: !4, line: 175, baseType: !127, size: 64, offset: 256)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "screenname", scope: !121, file: !4, line: 176, baseType: !54, size: 512, offset: 320)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "posx", scope: !121, file: !4, line: 178, baseType: !69, size: 16, offset: 832)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "posy", scope: !121, file: !4, line: 178, baseType: !69, size: 16, offset: 848)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "sizex", scope: !121, file: !4, line: 178, baseType: !69, size: 16, offset: 864)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "sizey", scope: !121, file: !4, line: 178, baseType: !69, size: 16, offset: 880)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "windowstate", scope: !121, file: !4, line: 179, baseType: !69, size: 16, offset: 896)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !121, file: !4, line: 180, baseType: !69, size: 16, offset: 912)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !121, file: !4, line: 181, baseType: !69, size: 16, offset: 928)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !121, file: !4, line: 182, baseType: !69, size: 16, offset: 944)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "lastcursor", scope: !121, file: !4, line: 183, baseType: !69, size: 16, offset: 960)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "modalcursor", scope: !121, file: !4, line: 184, baseType: !69, size: 16, offset: 976)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "grabcursor", scope: !121, file: !4, line: 185, baseType: !69, size: 16, offset: 992)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "addmousemove", scope: !121, file: !4, line: 186, baseType: !69, size: 16, offset: 1008)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "winid", scope: !121, file: !4, line: 188, baseType: !18, size: 32, offset: 1024)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "lock_pie_event", scope: !121, file: !4, line: 190, baseType: !69, size: 16, offset: 1056)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "last_pie_event", scope: !121, file: !4, line: 191, baseType: !69, size: 16, offset: 1072)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "eventstate", scope: !121, file: !4, line: 194, baseType: !148, size: 64, offset: 1088)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmEvent", file: !31, line: 421, size: 960, elements: !150)
!150 = !{!151, !152, !153, !154, !155, !156, !157, !161, !165, !166, !167, !168, !169, !170, !171, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !191, !192, !193, !194}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !149, file: !31, line: 422, baseType: !148, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !149, file: !31, line: 422, baseType: !148, size: 64, offset: 64)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !149, file: !31, line: 424, baseType: !69, size: 16, offset: 128)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !149, file: !31, line: 425, baseType: !69, size: 16, offset: 144)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !149, file: !31, line: 426, baseType: !18, size: 32, offset: 160)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !149, file: !31, line: 426, baseType: !18, size: 32, offset: 192)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "mval", scope: !149, file: !31, line: 427, baseType: !158, size: 64, offset: 224)
!158 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 64, elements: !159)
!159 = !{!160}
!160 = !DISubrange(count: 2)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "utf8_buf", scope: !149, file: !31, line: 428, baseType: !162, size: 48, offset: 288)
!162 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 48, elements: !163)
!163 = !{!164}
!164 = !DISubrange(count: 6)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !149, file: !31, line: 431, baseType: !37, size: 8, offset: 336)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !149, file: !31, line: 432, baseType: !37, size: 8, offset: 344)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "prevtype", scope: !149, file: !31, line: 435, baseType: !69, size: 16, offset: 352)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "prevval", scope: !149, file: !31, line: 436, baseType: !69, size: 16, offset: 368)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "prevx", scope: !149, file: !31, line: 437, baseType: !18, size: 32, offset: 384)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "prevy", scope: !149, file: !31, line: 437, baseType: !18, size: 32, offset: 416)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "prevclicktime", scope: !149, file: !31, line: 438, baseType: !172, size: 64, offset: 448)
!172 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "prevclickx", scope: !149, file: !31, line: 439, baseType: !18, size: 32, offset: 512)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "prevclicky", scope: !149, file: !31, line: 439, baseType: !18, size: 32, offset: 544)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !149, file: !31, line: 442, baseType: !69, size: 16, offset: 576)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "ctrl", scope: !149, file: !31, line: 442, baseType: !69, size: 16, offset: 592)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "alt", scope: !149, file: !31, line: 442, baseType: !69, size: 16, offset: 608)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "oskey", scope: !149, file: !31, line: 442, baseType: !69, size: 16, offset: 624)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "keymodifier", scope: !149, file: !31, line: 443, baseType: !69, size: 16, offset: 640)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "check_click", scope: !149, file: !31, line: 446, baseType: !69, size: 16, offset: 656)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "keymap_idname", scope: !149, file: !31, line: 449, baseType: !35, size: 64, offset: 704)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "tablet_data", scope: !149, file: !31, line: 452, baseType: !183, size: 64, offset: 768)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTabletData", file: !31, line: 463, size: 128, elements: !185)
!185 = !{!186, !187, !189, !190}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "Active", scope: !184, file: !31, line: 464, baseType: !18, size: 32)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "Pressure", scope: !184, file: !31, line: 465, baseType: !188, size: 32, offset: 32)
!188 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "Xtilt", scope: !184, file: !31, line: 466, baseType: !188, size: 32, offset: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "Ytilt", scope: !184, file: !31, line: 467, baseType: !188, size: 32, offset: 96)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "custom", scope: !149, file: !31, line: 455, baseType: !69, size: 16, offset: 832)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "customdatafree", scope: !149, file: !31, line: 456, baseType: !69, size: 16, offset: 848)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !149, file: !31, line: 457, baseType: !18, size: 32, offset: 864)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !149, file: !31, line: 458, baseType: !14, size: 64, offset: 896)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "curswin", scope: !121, file: !4, line: 196, baseType: !196, size: 64, offset: 1152)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!197 = !DICompositeType(tag: DW_TAG_structure_type, name: "wmSubWindow", file: !4, line: 55, flags: DIFlagFwdDecl)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "tweak", scope: !121, file: !4, line: 198, baseType: !199, size: 64, offset: 1216)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!200 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmGesture", file: !31, line: 398, size: 448, elements: !201)
!201 = !{!202, !203, !204, !205, !206, !207, !208, !209, !210, !211}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !200, file: !31, line: 399, baseType: !199, size: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !200, file: !31, line: 399, baseType: !199, size: 64, offset: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "event_type", scope: !200, file: !31, line: 400, baseType: !18, size: 32, offset: 128)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !200, file: !31, line: 401, baseType: !18, size: 32, offset: 160)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !200, file: !31, line: 402, baseType: !18, size: 32, offset: 192)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "swinid", scope: !200, file: !31, line: 403, baseType: !18, size: 32, offset: 224)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !200, file: !31, line: 404, baseType: !18, size: 32, offset: 256)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !200, file: !31, line: 405, baseType: !18, size: 32, offset: 288)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !200, file: !31, line: 407, baseType: !14, size: 64, offset: 320)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "userdata", scope: !200, file: !31, line: 414, baseType: !14, size: 64, offset: 384)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "drawmethod", scope: !121, file: !4, line: 200, baseType: !18, size: 32, offset: 1280)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "drawfail", scope: !121, file: !4, line: 200, baseType: !18, size: 32, offset: 1312)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "drawdata", scope: !121, file: !4, line: 201, baseType: !14, size: 64, offset: 1344)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !121, file: !4, line: 203, baseType: !78, size: 128, offset: 1408)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "handlers", scope: !121, file: !4, line: 204, baseType: !78, size: 128, offset: 1536)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "modalhandlers", scope: !121, file: !4, line: 205, baseType: !78, size: 128, offset: 1664)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "subwindows", scope: !121, file: !4, line: 207, baseType: !78, size: 128, offset: 1792)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "gesture", scope: !121, file: !4, line: 208, baseType: !78, size: 128, offset: 1920)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "timestep", scope: !115, file: !31, line: 495, baseType: !172, size: 64, offset: 192)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "event_type", scope: !115, file: !31, line: 496, baseType: !18, size: 32, offset: 256)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !115, file: !31, line: 497, baseType: !14, size: 64, offset: 320)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !115, file: !31, line: 499, baseType: !172, size: 64, offset: 384)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !115, file: !31, line: 500, baseType: !172, size: 64, offset: 448)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "ltime", scope: !115, file: !31, line: 502, baseType: !172, size: 64, offset: 512)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "ntime", scope: !115, file: !31, line: 503, baseType: !172, size: 64, offset: 576)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "stime", scope: !115, file: !31, line: 504, baseType: !172, size: 64, offset: 640)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "sleep", scope: !115, file: !31, line: 505, baseType: !18, size: 32, offset: 704)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "macro", scope: !49, file: !4, line: 343, baseType: !78, size: 128, offset: 1024)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "opm", scope: !49, file: !4, line: 344, baseType: !48, size: 64, offset: 1152)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "layout", scope: !49, file: !4, line: 345, baseType: !232, size: 64, offset: 1216)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = !DICompositeType(tag: DW_TAG_structure_type, name: "uiLayout", file: !4, line: 61, flags: DIFlagFwdDecl)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !49, file: !4, line: 346, baseType: !69, size: 16, offset: 1280)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !49, file: !4, line: 346, baseType: !236, size: 48, offset: 1296)
!236 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 48, elements: !237)
!237 = !{!238}
!238 = !DISubrange(count: 3)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !32, file: !31, line: 524, baseType: !240, size: 64, offset: 320)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!241 = !DISubroutineType(types: !242)
!242 = !{!243, !45, !48}
!243 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "invoke", scope: !32, file: !31, line: 530, baseType: !245, size: 64, offset: 384)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!246 = !DISubroutineType(types: !247)
!247 = !{!18, !45, !48, !248}
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!249 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !149)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "cancel", scope: !32, file: !31, line: 531, baseType: !251, size: 64, offset: 448)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!252 = !DISubroutineType(types: !253)
!253 = !{null, !45, !48}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "modal", scope: !32, file: !31, line: 532, baseType: !245, size: 64, offset: 512)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "poll", scope: !32, file: !31, line: 536, baseType: !256, size: 64, offset: 576)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!257 = !DISubroutineType(types: !258)
!258 = !{!18, !45}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "ui", scope: !32, file: !31, line: 539, baseType: !251, size: 64, offset: 640)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "srna", scope: !32, file: !31, line: 542, baseType: !101, size: 64, offset: 704)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "last_properties", scope: !32, file: !31, line: 545, baseType: !64, size: 64, offset: 768)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !32, file: !31, line: 549, baseType: !263, size: 64, offset: 832)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "PropertyRNA", file: !47, line: 333, baseType: !265)
!265 = !DICompositeType(tag: DW_TAG_structure_type, name: "PropertyRNA", file: !47, line: 39, flags: DIFlagFwdDecl)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "macro", scope: !32, file: !31, line: 552, baseType: !78, size: 128, offset: 896)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "modalkeymap", scope: !32, file: !31, line: 555, baseType: !268, size: 64, offset: 1024)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!269 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmKeyMap", file: !4, line: 281, size: 1088, elements: !270)
!270 = !{!271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !269, file: !4, line: 282, baseType: !268, size: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !269, file: !4, line: 282, baseType: !268, size: 64, offset: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "items", scope: !269, file: !4, line: 284, baseType: !78, size: 128, offset: 128)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "diff_items", scope: !269, file: !4, line: 285, baseType: !78, size: 128, offset: 256)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !269, file: !4, line: 287, baseType: !54, size: 512, offset: 384)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "spaceid", scope: !269, file: !4, line: 288, baseType: !69, size: 16, offset: 896)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "regionid", scope: !269, file: !4, line: 289, baseType: !69, size: 16, offset: 912)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !269, file: !4, line: 291, baseType: !69, size: 16, offset: 928)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "kmi_id", scope: !269, file: !4, line: 292, baseType: !69, size: 16, offset: 944)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "poll", scope: !269, file: !4, line: 295, baseType: !256, size: 64, offset: 960)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "modal_items", scope: !269, file: !4, line: 296, baseType: !14, size: 64, offset: 1024)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "pyop_data", scope: !32, file: !31, line: 559, baseType: !14, size: 64, offset: 1088)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "pyop_poll", scope: !32, file: !31, line: 560, baseType: !284, size: 64, offset: 1152)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64)
!285 = !DISubroutineType(types: !286)
!286 = !{!18, !45, !89}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "ext", scope: !32, file: !31, line: 563, baseType: !288, size: 256, offset: 1216)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExtensionRNA", file: !47, line: 436, baseType: !289)
!289 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ExtensionRNA", file: !47, line: 430, size: 256, elements: !290)
!290 = !{!291, !292, !295, !311}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !289, file: !47, line: 431, baseType: !14, size: 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "srna", scope: !289, file: !47, line: 432, baseType: !293, size: 64, offset: 64)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructRNA", file: !47, line: 417, baseType: !102)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !289, file: !47, line: 433, baseType: !296, size: 64, offset: 128)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructCallbackFunc", file: !47, line: 408, baseType: !297)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64)
!298 = !DISubroutineType(types: !299)
!299 = !{!18, !45, !93, !300, !302}
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64)
!301 = !DICompositeType(tag: DW_TAG_structure_type, name: "FunctionRNA", file: !47, line: 38, flags: DIFlagFwdDecl)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "ParameterList", file: !47, line: 348, baseType: !304)
!304 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParameterList", file: !47, line: 337, size: 256, elements: !305)
!305 = !{!306, !307, !308, !309, !310}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !304, file: !47, line: 339, baseType: !14, size: 64)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !304, file: !47, line: 342, baseType: !300, size: 64, offset: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_size", scope: !304, file: !47, line: 345, baseType: !18, size: 32, offset: 128)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !304, file: !47, line: 347, baseType: !18, size: 32, offset: 160)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "ret_count", scope: !304, file: !47, line: 347, baseType: !18, size: 32, offset: 192)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !289, file: !47, line: 434, baseType: !312, size: 64, offset: 192)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructFreeFunc", file: !47, line: 409, baseType: !19)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !32, file: !31, line: 566, baseType: !69, size: 16, offset: 1472)
!314 = !{}
!315 = !DILocalVariable(name: "ot", arg: 1, scope: !26, file: !1, line: 162, type: !29)
!316 = !DILocation(line: 162, column: 42, scope: !26)
!317 = !DILocation(line: 165, column: 2, scope: !26)
!318 = !DILocation(line: 165, column: 6, scope: !26)
!319 = !DILocation(line: 165, column: 11, scope: !26)
!320 = !DILocation(line: 166, column: 2, scope: !26)
!321 = !DILocation(line: 166, column: 6, scope: !26)
!322 = !DILocation(line: 166, column: 18, scope: !26)
!323 = !DILocation(line: 167, column: 2, scope: !26)
!324 = !DILocation(line: 167, column: 6, scope: !26)
!325 = !DILocation(line: 167, column: 13, scope: !26)
!326 = !DILocation(line: 170, column: 2, scope: !26)
!327 = !DILocation(line: 170, column: 6, scope: !26)
!328 = !DILocation(line: 170, column: 11, scope: !26)
!329 = !DILocation(line: 171, column: 2, scope: !26)
!330 = !DILocation(line: 171, column: 6, scope: !26)
!331 = !DILocation(line: 171, column: 11, scope: !26)
!332 = !DILocation(line: 174, column: 2, scope: !26)
!333 = !DILocation(line: 174, column: 6, scope: !26)
!334 = !DILocation(line: 174, column: 11, scope: !26)
!335 = !DILocation(line: 176, column: 18, scope: !26)
!336 = !DILocation(line: 176, column: 22, scope: !26)
!337 = !DILocation(line: 176, column: 2, scope: !26)
!338 = !DILocation(line: 177, column: 1, scope: !26)
!339 = distinct !DISubprogram(name: "ptcache_bake_all_exec", scope: !1, file: !1, line: 100, type: !340, scopeLine: 101, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !314)
!340 = !DISubroutineType(types: !341)
!341 = !{!18, !342, !344}
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "bContext", file: !129, line: 69, baseType: !46)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "wmOperator", file: !4, line: 348, baseType: !49)
!346 = !DILocalVariable(name: "C", arg: 1, scope: !339, file: !1, line: 100, type: !342)
!347 = !DILocation(line: 100, column: 44, scope: !339)
!348 = !DILocalVariable(name: "op", arg: 2, scope: !339, file: !1, line: 100, type: !344)
!349 = !DILocation(line: 100, column: 59, scope: !339)
!350 = !DILocalVariable(name: "bmain", scope: !339, file: !1, line: 102, type: !351)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "Main", file: !353, line: 104, baseType: !354)
!353 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_main.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!354 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Main", file: !353, line: 53, size: 15232, elements: !355)
!355 = !{!356, !358, !359, !363, !364, !365, !366, !367, !373, !377, !378, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !449, !452}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !354, file: !353, line: 54, baseType: !357, size: 64)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !354, file: !353, line: 54, baseType: !357, size: 64, offset: 64)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !354, file: !353, line: 55, baseType: !360, size: 8192, offset: 128)
!360 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 8192, elements: !361)
!361 = !{!362}
!362 = !DISubrange(count: 1024)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "versionfile", scope: !354, file: !353, line: 56, baseType: !69, size: 16, offset: 8320)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "subversionfile", scope: !354, file: !353, line: 56, baseType: !69, size: 16, offset: 8336)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "minversionfile", scope: !354, file: !353, line: 57, baseType: !69, size: 16, offset: 8352)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "minsubversionfile", scope: !354, file: !353, line: 57, baseType: !69, size: 16, offset: 8368)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "build_commit_timestamp", scope: !354, file: !353, line: 58, baseType: !368, size: 64, offset: 8384)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !369, line: 27, baseType: !370)
!369 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !371, line: 45, baseType: !372)
!371 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!372 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "build_hash", scope: !354, file: !353, line: 59, baseType: !374, size: 128, offset: 8448)
!374 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 128, elements: !375)
!375 = !{!376}
!376 = !DISubrange(count: 16)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "recovered", scope: !354, file: !353, line: 60, baseType: !69, size: 16, offset: 8576)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "curlib", scope: !354, file: !353, line: 62, baseType: !379, size: 64, offset: 8640)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!380 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !60, line: 136, size: 17600, elements: !381)
!381 = !{!382, !400, !402, !405, !406, !407, !408}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !380, file: !60, line: 137, baseType: !383, size: 960)
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !60, line: 130, baseType: !384)
!384 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !60, line: 117, size: 960, elements: !385)
!385 = !{!386, !387, !388, !390, !391, !395, !396, !397, !398, !399}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !384, file: !60, line: 118, baseType: !14, size: 64)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !384, file: !60, line: 118, baseType: !14, size: 64, offset: 64)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !384, file: !60, line: 119, baseType: !389, size: 64, offset: 128)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !384, file: !60, line: 120, baseType: !379, size: 64, offset: 192)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !384, file: !60, line: 121, baseType: !392, size: 528, offset: 256)
!392 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 528, elements: !393)
!393 = !{!394}
!394 = !DISubrange(count: 66)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !384, file: !60, line: 126, baseType: !69, size: 16, offset: 784)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !384, file: !60, line: 127, baseType: !18, size: 32, offset: 800)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !384, file: !60, line: 128, baseType: !18, size: 32, offset: 832)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !384, file: !60, line: 128, baseType: !18, size: 32, offset: 864)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !384, file: !60, line: 129, baseType: !58, size: 64, offset: 896)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !380, file: !60, line: 138, baseType: !401, size: 64, offset: 960)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !380, file: !60, line: 139, baseType: !403, size: 64, offset: 1024)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!404 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !60, line: 43, flags: DIFlagFwdDecl)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !380, file: !60, line: 140, baseType: !360, size: 8192, offset: 1088)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !380, file: !60, line: 141, baseType: !360, size: 8192, offset: 9280)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !380, file: !60, line: 148, baseType: !379, size: 64, offset: 17472)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !380, file: !60, line: 150, baseType: !409, size: 64, offset: 17536)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!410 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !60, line: 45, flags: DIFlagFwdDecl)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !354, file: !353, line: 63, baseType: !78, size: 128, offset: 8704)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "library", scope: !354, file: !353, line: 64, baseType: !78, size: 128, offset: 8832)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !354, file: !353, line: 65, baseType: !78, size: 128, offset: 8960)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "mesh", scope: !354, file: !353, line: 66, baseType: !78, size: 128, offset: 9088)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "curve", scope: !354, file: !353, line: 67, baseType: !78, size: 128, offset: 9216)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "mball", scope: !354, file: !353, line: 68, baseType: !78, size: 128, offset: 9344)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !354, file: !353, line: 69, baseType: !78, size: 128, offset: 9472)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "tex", scope: !354, file: !353, line: 70, baseType: !78, size: 128, offset: 9600)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "image", scope: !354, file: !353, line: 71, baseType: !78, size: 128, offset: 9728)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "latt", scope: !354, file: !353, line: 72, baseType: !78, size: 128, offset: 9856)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "lamp", scope: !354, file: !353, line: 73, baseType: !78, size: 128, offset: 9984)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !354, file: !353, line: 74, baseType: !78, size: 128, offset: 10112)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !354, file: !353, line: 75, baseType: !78, size: 128, offset: 10240)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !354, file: !353, line: 76, baseType: !78, size: 128, offset: 10368)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !354, file: !353, line: 77, baseType: !78, size: 128, offset: 10496)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !354, file: !353, line: 78, baseType: !78, size: 128, offset: 10624)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "script", scope: !354, file: !353, line: 79, baseType: !78, size: 128, offset: 10752)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "vfont", scope: !354, file: !353, line: 80, baseType: !78, size: 128, offset: 10880)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !354, file: !353, line: 81, baseType: !78, size: 128, offset: 11008)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "speaker", scope: !354, file: !353, line: 82, baseType: !78, size: 128, offset: 11136)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "sound", scope: !354, file: !353, line: 83, baseType: !78, size: 128, offset: 11264)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !354, file: !353, line: 84, baseType: !78, size: 128, offset: 11392)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "armature", scope: !354, file: !353, line: 85, baseType: !78, size: 128, offset: 11520)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !354, file: !353, line: 86, baseType: !78, size: 128, offset: 11648)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !354, file: !353, line: 87, baseType: !78, size: 128, offset: 11776)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !354, file: !353, line: 88, baseType: !78, size: 128, offset: 11904)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "particle", scope: !354, file: !353, line: 89, baseType: !78, size: 128, offset: 12032)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "palettes", scope: !354, file: !353, line: 90, baseType: !78, size: 128, offset: 12160)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "paintcurves", scope: !354, file: !353, line: 91, baseType: !78, size: 128, offset: 12288)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "wm", scope: !354, file: !353, line: 92, baseType: !78, size: 128, offset: 12416)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "gpencil", scope: !354, file: !353, line: 93, baseType: !78, size: 128, offset: 12544)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "movieclip", scope: !354, file: !353, line: 94, baseType: !78, size: 128, offset: 12672)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !354, file: !353, line: 95, baseType: !78, size: 128, offset: 12800)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "linestyle", scope: !354, file: !353, line: 96, baseType: !78, size: 128, offset: 12928)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "id_tag_update", scope: !354, file: !353, line: 98, baseType: !446, size: 2048, offset: 13056)
!446 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 2048, elements: !447)
!447 = !{!448}
!448 = !DISubrange(count: 256)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "eval_ctx", scope: !354, file: !353, line: 101, baseType: !450, size: 64, offset: 15104)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64)
!451 = !DICompositeType(tag: DW_TAG_structure_type, name: "EvaluationContext", file: !353, line: 49, flags: DIFlagFwdDecl)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !354, file: !353, line: 103, baseType: !453, size: 64, offset: 15168)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!454 = !DICompositeType(tag: DW_TAG_structure_type, name: "MainLock", file: !353, line: 51, flags: DIFlagFwdDecl)
!455 = !DILocation(line: 102, column: 8, scope: !339)
!456 = !DILocation(line: 102, column: 30, scope: !339)
!457 = !DILocation(line: 102, column: 16, scope: !339)
!458 = !DILocalVariable(name: "scene", scope: !339, file: !1, line: 103, type: !459)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "Scene", file: !461, line: 1299, baseType: !462)
!461 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!462 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !461, line: 1216, size: 39680, elements: !463)
!463 = !{!464, !465, !468, !1871, !1874, !1875, !1876, !1888, !1889, !1890, !1891, !1892, !1893, !1894, !1895, !1896, !1897, !1898, !1899, !1900, !1903, !2117, !2120, !2368, !2380, !2381, !2382, !2383, !2384, !2385, !2386, !2387, !2390, !2391, !2392, !2393, !2394, !2402, !2468, !2475, !2476, !2483, !2486, !2487, !2488, !2489, !2490, !2491}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !462, file: !461, line: 1217, baseType: !383, size: 960)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !462, file: !461, line: 1218, baseType: !466, size: 64, offset: 960)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!467 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !461, line: 58, flags: DIFlagFwdDecl)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !462, file: !461, line: 1220, baseType: !469, size: 64, offset: 1024)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64)
!470 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !471, line: 115, size: 11392, elements: !472)
!471 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!472 = !{!473, !474, !475, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !493, !503, !517, !518, !560, !561, !564, !565, !581, !582, !583, !584, !585, !586, !587, !591, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !607, !608, !609, !610, !611, !612, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !704, !705, !706, !707, !708, !709, !710, !711, !712, !1080, !1828, !1829, !1830, !1831, !1832, !1833, !1836, !1839, !1840, !1841, !1842, !1843, !1844, !1845, !1846, !1847, !1849, !1852, !1855, !1856, !1859, !1860}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !470, file: !471, line: 116, baseType: !383, size: 960)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !470, file: !471, line: 117, baseType: !466, size: 64, offset: 960)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !470, file: !471, line: 119, baseType: !476, size: 64, offset: 1024)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64)
!477 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !471, line: 57, flags: DIFlagFwdDecl)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !470, file: !471, line: 121, baseType: !69, size: 16, offset: 1088)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !470, file: !471, line: 121, baseType: !69, size: 16, offset: 1104)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !470, file: !471, line: 122, baseType: !18, size: 32, offset: 1120)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !470, file: !471, line: 122, baseType: !18, size: 32, offset: 1152)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !470, file: !471, line: 122, baseType: !18, size: 32, offset: 1184)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !470, file: !471, line: 123, baseType: !54, size: 512, offset: 1216)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !470, file: !471, line: 124, baseType: !469, size: 64, offset: 1728)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !470, file: !471, line: 124, baseType: !469, size: 64, offset: 1792)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !470, file: !471, line: 127, baseType: !469, size: 64, offset: 1856)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !470, file: !471, line: 127, baseType: !469, size: 64, offset: 1920)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !470, file: !471, line: 127, baseType: !469, size: 64, offset: 1984)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !470, file: !471, line: 128, baseType: !490, size: 64, offset: 2048)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64)
!491 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !492, line: 243, flags: DIFlagFwdDecl)
!492 = !DIFile(filename: "blender/source/blender/makesdna/DNA_particle_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!493 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !470, file: !471, line: 130, baseType: !494, size: 64, offset: 2112)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64)
!495 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !471, line: 97, size: 832, elements: !496)
!496 = !{!497, !501, !502}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !495, file: !471, line: 98, baseType: !498, size: 768)
!498 = !DICompositeType(tag: DW_TAG_array_type, baseType: !188, size: 768, elements: !499)
!499 = !{!500, !238}
!500 = !DISubrange(count: 8)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !495, file: !471, line: 99, baseType: !18, size: 32, offset: 768)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !495, file: !471, line: 99, baseType: !18, size: 32, offset: 800)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !470, file: !471, line: 131, baseType: !504, size: 64, offset: 2176)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64)
!505 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !506, line: 486, size: 1600, elements: !507)
!506 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!507 = !{!508, !509, !510, !511, !512, !513, !514, !515, !516}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !505, file: !506, line: 487, baseType: !383, size: 960)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !505, file: !506, line: 489, baseType: !78, size: 128, offset: 960)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !505, file: !506, line: 490, baseType: !78, size: 128, offset: 1088)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !505, file: !506, line: 491, baseType: !78, size: 128, offset: 1216)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !505, file: !506, line: 492, baseType: !78, size: 128, offset: 1344)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !505, file: !506, line: 494, baseType: !18, size: 32, offset: 1472)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !505, file: !506, line: 495, baseType: !18, size: 32, offset: 1504)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !505, file: !506, line: 497, baseType: !18, size: 32, offset: 1536)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !505, file: !506, line: 498, baseType: !18, size: 32, offset: 1568)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !470, file: !471, line: 132, baseType: !504, size: 64, offset: 2240)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !470, file: !471, line: 133, baseType: !519, size: 64, offset: 2304)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!520 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !506, line: 334, size: 1728, elements: !521)
!521 = !{!522, !523, !526, !527, !528, !529, !530, !531, !533, !534, !535, !536, !537, !538, !539, !559}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !520, file: !506, line: 335, baseType: !78, size: 128)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !520, file: !506, line: 336, baseType: !524, size: 64, offset: 128)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64)
!525 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !506, line: 47, flags: DIFlagFwdDecl)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !520, file: !506, line: 338, baseType: !69, size: 16, offset: 192)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !520, file: !506, line: 338, baseType: !69, size: 16, offset: 208)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !520, file: !506, line: 339, baseType: !5, size: 32, offset: 224)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !520, file: !506, line: 340, baseType: !18, size: 32, offset: 256)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !520, file: !506, line: 342, baseType: !188, size: 32, offset: 288)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !520, file: !506, line: 343, baseType: !532, size: 96, offset: 320)
!532 = !DICompositeType(tag: DW_TAG_array_type, baseType: !188, size: 96, elements: !237)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !520, file: !506, line: 344, baseType: !532, size: 96, offset: 416)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !520, file: !506, line: 347, baseType: !78, size: 128, offset: 512)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !520, file: !506, line: 349, baseType: !18, size: 32, offset: 640)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !520, file: !506, line: 350, baseType: !18, size: 32, offset: 672)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !520, file: !506, line: 351, baseType: !14, size: 64, offset: 704)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !520, file: !506, line: 352, baseType: !14, size: 64, offset: 768)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !520, file: !506, line: 354, baseType: !540, size: 384, offset: 832)
!540 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !506, line: 116, baseType: !541)
!541 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !506, line: 94, size: 384, elements: !542)
!542 = !{!543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !541, file: !506, line: 96, baseType: !18, size: 32)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !541, file: !506, line: 96, baseType: !18, size: 32, offset: 32)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !541, file: !506, line: 97, baseType: !18, size: 32, offset: 64)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !541, file: !506, line: 97, baseType: !18, size: 32, offset: 96)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !541, file: !506, line: 99, baseType: !69, size: 16, offset: 128)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !541, file: !506, line: 100, baseType: !69, size: 16, offset: 144)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !541, file: !506, line: 102, baseType: !69, size: 16, offset: 160)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !541, file: !506, line: 105, baseType: !69, size: 16, offset: 176)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !541, file: !506, line: 108, baseType: !69, size: 16, offset: 192)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !541, file: !506, line: 109, baseType: !69, size: 16, offset: 208)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !541, file: !506, line: 111, baseType: !69, size: 16, offset: 224)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !541, file: !506, line: 112, baseType: !69, size: 16, offset: 240)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !541, file: !506, line: 114, baseType: !18, size: 32, offset: 256)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !541, file: !506, line: 114, baseType: !18, size: 32, offset: 288)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !541, file: !506, line: 115, baseType: !18, size: 32, offset: 320)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !541, file: !506, line: 115, baseType: !18, size: 32, offset: 352)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !520, file: !506, line: 355, baseType: !54, size: 512, offset: 1216)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !470, file: !471, line: 134, baseType: !14, size: 64, offset: 2368)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !470, file: !471, line: 136, baseType: !562, size: 64, offset: 2432)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64)
!563 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !461, line: 61, flags: DIFlagFwdDecl)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !470, file: !471, line: 138, baseType: !540, size: 384, offset: 2496)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !470, file: !471, line: 139, baseType: !566, size: 64, offset: 2880)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64)
!567 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !506, line: 80, baseType: !568)
!568 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !506, line: 72, size: 192, elements: !569)
!569 = !{!570, !577, !578, !579, !580}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !568, file: !506, line: 73, baseType: !571, size: 64)
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64)
!572 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !506, line: 59, baseType: !573)
!573 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !506, line: 56, size: 128, elements: !574)
!574 = !{!575, !576}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !573, file: !506, line: 57, baseType: !532, size: 96)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !573, file: !506, line: 58, baseType: !18, size: 32, offset: 96)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !568, file: !506, line: 74, baseType: !18, size: 32, offset: 64)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !568, file: !506, line: 76, baseType: !18, size: 32, offset: 96)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !568, file: !506, line: 77, baseType: !18, size: 32, offset: 128)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !568, file: !506, line: 79, baseType: !18, size: 32, offset: 160)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !470, file: !471, line: 141, baseType: !78, size: 128, offset: 2944)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !470, file: !471, line: 142, baseType: !78, size: 128, offset: 3072)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !470, file: !471, line: 143, baseType: !78, size: 128, offset: 3200)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !470, file: !471, line: 144, baseType: !78, size: 128, offset: 3328)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !470, file: !471, line: 146, baseType: !18, size: 32, offset: 3456)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !470, file: !471, line: 147, baseType: !18, size: 32, offset: 3488)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !470, file: !471, line: 150, baseType: !588, size: 64, offset: 3520)
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 64)
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 64)
!590 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !461, line: 179, flags: DIFlagFwdDecl)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !470, file: !471, line: 151, baseType: !592, size: 64, offset: 3584)
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !470, file: !471, line: 152, baseType: !18, size: 32, offset: 3648)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !470, file: !471, line: 153, baseType: !18, size: 32, offset: 3680)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !470, file: !471, line: 156, baseType: !532, size: 96, offset: 3712)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !470, file: !471, line: 156, baseType: !532, size: 96, offset: 3808)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !470, file: !471, line: 156, baseType: !532, size: 96, offset: 3904)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !470, file: !471, line: 157, baseType: !532, size: 96, offset: 4000)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !470, file: !471, line: 158, baseType: !532, size: 96, offset: 4096)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !470, file: !471, line: 159, baseType: !532, size: 96, offset: 4192)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !470, file: !471, line: 160, baseType: !532, size: 96, offset: 4288)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !470, file: !471, line: 160, baseType: !532, size: 96, offset: 4384)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !470, file: !471, line: 161, baseType: !604, size: 128, offset: 4480)
!604 = !DICompositeType(tag: DW_TAG_array_type, baseType: !188, size: 128, elements: !605)
!605 = !{!606}
!606 = !DISubrange(count: 4)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !470, file: !471, line: 161, baseType: !604, size: 128, offset: 4608)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !470, file: !471, line: 162, baseType: !532, size: 96, offset: 4736)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !470, file: !471, line: 162, baseType: !532, size: 96, offset: 4832)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !470, file: !471, line: 163, baseType: !188, size: 32, offset: 4928)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !470, file: !471, line: 163, baseType: !188, size: 32, offset: 4960)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !470, file: !471, line: 164, baseType: !613, size: 512, offset: 4992)
!613 = !DICompositeType(tag: DW_TAG_array_type, baseType: !188, size: 512, elements: !614)
!614 = !{!606, !606}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !470, file: !471, line: 165, baseType: !613, size: 512, offset: 5504)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !470, file: !471, line: 166, baseType: !613, size: 512, offset: 6016)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !470, file: !471, line: 167, baseType: !613, size: 512, offset: 6528)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !470, file: !471, line: 176, baseType: !613, size: 512, offset: 7040)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !470, file: !471, line: 178, baseType: !5, size: 32, offset: 7552)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !470, file: !471, line: 180, baseType: !69, size: 16, offset: 7584)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !470, file: !471, line: 181, baseType: !69, size: 16, offset: 7600)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !470, file: !471, line: 183, baseType: !69, size: 16, offset: 7616)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !470, file: !471, line: 183, baseType: !69, size: 16, offset: 7632)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !470, file: !471, line: 184, baseType: !69, size: 16, offset: 7648)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !470, file: !471, line: 184, baseType: !69, size: 16, offset: 7664)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !470, file: !471, line: 185, baseType: !69, size: 16, offset: 7680)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !470, file: !471, line: 186, baseType: !69, size: 16, offset: 7696)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !470, file: !471, line: 187, baseType: !69, size: 16, offset: 7712)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !470, file: !471, line: 188, baseType: !37, size: 8, offset: 7728)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !470, file: !471, line: 189, baseType: !37, size: 8, offset: 7736)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !470, file: !471, line: 192, baseType: !18, size: 32, offset: 7744)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !470, file: !471, line: 192, baseType: !18, size: 32, offset: 7776)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !470, file: !471, line: 192, baseType: !18, size: 32, offset: 7808)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !470, file: !471, line: 192, baseType: !18, size: 32, offset: 7840)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !470, file: !471, line: 194, baseType: !18, size: 32, offset: 7872)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !470, file: !471, line: 202, baseType: !188, size: 32, offset: 7904)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !470, file: !471, line: 202, baseType: !188, size: 32, offset: 7936)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !470, file: !471, line: 202, baseType: !188, size: 32, offset: 7968)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !470, file: !471, line: 211, baseType: !188, size: 32, offset: 8000)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !470, file: !471, line: 212, baseType: !188, size: 32, offset: 8032)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !470, file: !471, line: 213, baseType: !188, size: 32, offset: 8064)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !470, file: !471, line: 214, baseType: !188, size: 32, offset: 8096)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !470, file: !471, line: 215, baseType: !188, size: 32, offset: 8128)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !470, file: !471, line: 216, baseType: !188, size: 32, offset: 8160)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !470, file: !471, line: 219, baseType: !188, size: 32, offset: 8192)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !470, file: !471, line: 220, baseType: !188, size: 32, offset: 8224)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !470, file: !471, line: 221, baseType: !188, size: 32, offset: 8256)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !470, file: !471, line: 224, baseType: !649, size: 16, offset: 8288)
!649 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !470, file: !471, line: 224, baseType: !649, size: 16, offset: 8304)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !470, file: !471, line: 226, baseType: !69, size: 16, offset: 8320)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !470, file: !471, line: 228, baseType: !37, size: 8, offset: 8336)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !470, file: !471, line: 229, baseType: !37, size: 8, offset: 8344)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !470, file: !471, line: 231, baseType: !69, size: 16, offset: 8352)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !470, file: !471, line: 232, baseType: !37, size: 8, offset: 8368)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !470, file: !471, line: 233, baseType: !37, size: 8, offset: 8376)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !470, file: !471, line: 234, baseType: !188, size: 32, offset: 8384)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !470, file: !471, line: 235, baseType: !188, size: 32, offset: 8416)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !470, file: !471, line: 237, baseType: !78, size: 128, offset: 8448)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !470, file: !471, line: 238, baseType: !78, size: 128, offset: 8576)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !470, file: !471, line: 239, baseType: !78, size: 128, offset: 8704)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !470, file: !471, line: 240, baseType: !78, size: 128, offset: 8832)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !470, file: !471, line: 242, baseType: !188, size: 32, offset: 8960)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !470, file: !471, line: 244, baseType: !69, size: 16, offset: 8992)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !470, file: !471, line: 245, baseType: !649, size: 16, offset: 9008)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !470, file: !471, line: 246, baseType: !604, size: 128, offset: 9024)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !470, file: !471, line: 248, baseType: !18, size: 32, offset: 9152)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !470, file: !471, line: 249, baseType: !18, size: 32, offset: 9184)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !470, file: !471, line: 251, baseType: !670, size: 64, offset: 9216)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64)
!671 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !672, line: 215, size: 960, elements: !673)
!672 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_force.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!673 = !{!674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !671, file: !672, line: 216, baseType: !18, size: 32)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "linStiff", scope: !671, file: !672, line: 217, baseType: !188, size: 32, offset: 32)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "angStiff", scope: !671, file: !672, line: 218, baseType: !188, size: 32, offset: 64)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "volume", scope: !671, file: !672, line: 219, baseType: !188, size: 32, offset: 96)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "viterations", scope: !671, file: !672, line: 221, baseType: !18, size: 32, offset: 128)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "piterations", scope: !671, file: !672, line: 222, baseType: !18, size: 32, offset: 160)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "diterations", scope: !671, file: !672, line: 223, baseType: !18, size: 32, offset: 192)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "citerations", scope: !671, file: !672, line: 224, baseType: !18, size: 32, offset: 224)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "kSRHR_CL", scope: !671, file: !672, line: 226, baseType: !188, size: 32, offset: 256)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "kSKHR_CL", scope: !671, file: !672, line: 227, baseType: !188, size: 32, offset: 288)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "kSSHR_CL", scope: !671, file: !672, line: 228, baseType: !188, size: 32, offset: 320)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "kSR_SPLT_CL", scope: !671, file: !672, line: 229, baseType: !188, size: 32, offset: 352)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "kSK_SPLT_CL", scope: !671, file: !672, line: 231, baseType: !188, size: 32, offset: 384)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "kSS_SPLT_CL", scope: !671, file: !672, line: 232, baseType: !188, size: 32, offset: 416)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "kVCF", scope: !671, file: !672, line: 233, baseType: !188, size: 32, offset: 448)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "kDP", scope: !671, file: !672, line: 234, baseType: !188, size: 32, offset: 480)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "kDG", scope: !671, file: !672, line: 236, baseType: !188, size: 32, offset: 512)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "kLF", scope: !671, file: !672, line: 237, baseType: !188, size: 32, offset: 544)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "kPR", scope: !671, file: !672, line: 238, baseType: !188, size: 32, offset: 576)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "kVC", scope: !671, file: !672, line: 239, baseType: !188, size: 32, offset: 608)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "kDF", scope: !671, file: !672, line: 241, baseType: !188, size: 32, offset: 640)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "kMT", scope: !671, file: !672, line: 242, baseType: !188, size: 32, offset: 672)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "kCHR", scope: !671, file: !672, line: 243, baseType: !188, size: 32, offset: 704)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "kKHR", scope: !671, file: !672, line: 244, baseType: !188, size: 32, offset: 736)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "kSHR", scope: !671, file: !672, line: 246, baseType: !188, size: 32, offset: 768)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "kAHR", scope: !671, file: !672, line: 247, baseType: !188, size: 32, offset: 800)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "collisionflags", scope: !671, file: !672, line: 248, baseType: !18, size: 32, offset: 832)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "numclusteriterations", scope: !671, file: !672, line: 249, baseType: !18, size: 32, offset: 864)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "welding", scope: !671, file: !672, line: 250, baseType: !188, size: 32, offset: 896)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !671, file: !672, line: 251, baseType: !188, size: 32, offset: 928)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !470, file: !471, line: 253, baseType: !37, size: 8, offset: 9280)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !470, file: !471, line: 254, baseType: !37, size: 8, offset: 9288)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !470, file: !471, line: 255, baseType: !69, size: 16, offset: 9296)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !470, file: !471, line: 256, baseType: !532, size: 96, offset: 9312)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !470, file: !471, line: 258, baseType: !78, size: 128, offset: 9408)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !470, file: !471, line: 259, baseType: !78, size: 128, offset: 9536)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !470, file: !471, line: 260, baseType: !78, size: 128, offset: 9664)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !470, file: !471, line: 261, baseType: !78, size: 128, offset: 9792)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !470, file: !471, line: 263, baseType: !713, size: 64, offset: 9920)
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !714, size: 64)
!714 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !672, line: 61, size: 1280, elements: !715)
!715 = !{!716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !1073, !1077, !1078, !1079}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !714, file: !672, line: 62, baseType: !18, size: 32)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "deflect", scope: !714, file: !672, line: 63, baseType: !69, size: 16, offset: 32)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "forcefield", scope: !714, file: !672, line: 64, baseType: !69, size: 16, offset: 48)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "falloff", scope: !714, file: !672, line: 65, baseType: !69, size: 16, offset: 64)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !714, file: !672, line: 66, baseType: !69, size: 16, offset: 80)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "tex_mode", scope: !714, file: !672, line: 67, baseType: !69, size: 16, offset: 96)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "kink", scope: !714, file: !672, line: 68, baseType: !69, size: 16, offset: 112)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "kink_axis", scope: !714, file: !672, line: 68, baseType: !69, size: 16, offset: 128)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "zdir", scope: !714, file: !672, line: 69, baseType: !69, size: 16, offset: 144)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "f_strength", scope: !714, file: !672, line: 72, baseType: !188, size: 32, offset: 160)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "f_damp", scope: !714, file: !672, line: 73, baseType: !188, size: 32, offset: 192)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "f_flow", scope: !714, file: !672, line: 74, baseType: !188, size: 32, offset: 224)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "f_size", scope: !714, file: !672, line: 77, baseType: !188, size: 32, offset: 256)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "f_power", scope: !714, file: !672, line: 80, baseType: !188, size: 32, offset: 288)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "maxdist", scope: !714, file: !672, line: 81, baseType: !188, size: 32, offset: 320)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "mindist", scope: !714, file: !672, line: 82, baseType: !188, size: 32, offset: 352)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "f_power_r", scope: !714, file: !672, line: 83, baseType: !188, size: 32, offset: 384)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "maxrad", scope: !714, file: !672, line: 84, baseType: !188, size: 32, offset: 416)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "minrad", scope: !714, file: !672, line: 85, baseType: !188, size: 32, offset: 448)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "pdef_damp", scope: !714, file: !672, line: 88, baseType: !188, size: 32, offset: 480)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "pdef_rdamp", scope: !714, file: !672, line: 89, baseType: !188, size: 32, offset: 512)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "pdef_perm", scope: !714, file: !672, line: 90, baseType: !188, size: 32, offset: 544)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "pdef_frict", scope: !714, file: !672, line: 91, baseType: !188, size: 32, offset: 576)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "pdef_rfrict", scope: !714, file: !672, line: 92, baseType: !188, size: 32, offset: 608)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "pdef_stickness", scope: !714, file: !672, line: 93, baseType: !188, size: 32, offset: 640)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "absorption", scope: !714, file: !672, line: 95, baseType: !188, size: 32, offset: 672)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "pdef_sbdamp", scope: !714, file: !672, line: 98, baseType: !188, size: 32, offset: 704)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "pdef_sbift", scope: !714, file: !672, line: 99, baseType: !188, size: 32, offset: 736)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "pdef_sboft", scope: !714, file: !672, line: 100, baseType: !188, size: 32, offset: 768)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "clump_fac", scope: !714, file: !672, line: 103, baseType: !188, size: 32, offset: 800)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "clump_pow", scope: !714, file: !672, line: 103, baseType: !188, size: 32, offset: 832)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "kink_freq", scope: !714, file: !672, line: 104, baseType: !188, size: 32, offset: 864)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "kink_shape", scope: !714, file: !672, line: 104, baseType: !188, size: 32, offset: 896)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "kink_amp", scope: !714, file: !672, line: 104, baseType: !188, size: 32, offset: 928)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "free_end", scope: !714, file: !672, line: 104, baseType: !188, size: 32, offset: 960)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "tex_nabla", scope: !714, file: !672, line: 107, baseType: !188, size: 32, offset: 992)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "tex", scope: !714, file: !672, line: 108, baseType: !753, size: 64, offset: 1024)
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 64)
!754 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Tex", file: !755, line: 202, size: 3328, elements: !756)
!755 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!756 = !{!757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !827, !830, !831, !912, !938, !964, !965, !1042, !1063, !1071, !1072}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !754, file: !755, line: 203, baseType: !383, size: 960)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !754, file: !755, line: 204, baseType: !466, size: 64, offset: 960)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "noisesize", scope: !754, file: !755, line: 206, baseType: !188, size: 32, offset: 1024)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "turbul", scope: !754, file: !755, line: 206, baseType: !188, size: 32, offset: 1056)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "bright", scope: !754, file: !755, line: 207, baseType: !188, size: 32, offset: 1088)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "contrast", scope: !754, file: !755, line: 207, baseType: !188, size: 32, offset: 1120)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "saturation", scope: !754, file: !755, line: 207, baseType: !188, size: 32, offset: 1152)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "rfac", scope: !754, file: !755, line: 207, baseType: !188, size: 32, offset: 1184)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "gfac", scope: !754, file: !755, line: 207, baseType: !188, size: 32, offset: 1216)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "bfac", scope: !754, file: !755, line: 207, baseType: !188, size: 32, offset: 1248)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "filtersize", scope: !754, file: !755, line: 208, baseType: !188, size: 32, offset: 1280)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !754, file: !755, line: 208, baseType: !188, size: 32, offset: 1312)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "mg_H", scope: !754, file: !755, line: 211, baseType: !188, size: 32, offset: 1344)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "mg_lacunarity", scope: !754, file: !755, line: 211, baseType: !188, size: 32, offset: 1376)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "mg_octaves", scope: !754, file: !755, line: 211, baseType: !188, size: 32, offset: 1408)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "mg_offset", scope: !754, file: !755, line: 211, baseType: !188, size: 32, offset: 1440)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "mg_gain", scope: !754, file: !755, line: 211, baseType: !188, size: 32, offset: 1472)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "dist_amount", scope: !754, file: !755, line: 214, baseType: !188, size: 32, offset: 1504)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "ns_outscale", scope: !754, file: !755, line: 214, baseType: !188, size: 32, offset: 1536)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w1", scope: !754, file: !755, line: 217, baseType: !188, size: 32, offset: 1568)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w2", scope: !754, file: !755, line: 218, baseType: !188, size: 32, offset: 1600)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w3", scope: !754, file: !755, line: 219, baseType: !188, size: 32, offset: 1632)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w4", scope: !754, file: !755, line: 220, baseType: !188, size: 32, offset: 1664)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "vn_mexp", scope: !754, file: !755, line: 221, baseType: !188, size: 32, offset: 1696)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "vn_distm", scope: !754, file: !755, line: 222, baseType: !69, size: 16, offset: 1728)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "vn_coltype", scope: !754, file: !755, line: 222, baseType: !69, size: 16, offset: 1744)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "noisedepth", scope: !754, file: !755, line: 224, baseType: !69, size: 16, offset: 1760)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "noisetype", scope: !754, file: !755, line: 224, baseType: !69, size: 16, offset: 1776)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis", scope: !754, file: !755, line: 227, baseType: !69, size: 16, offset: 1792)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis2", scope: !754, file: !755, line: 227, baseType: !69, size: 16, offset: 1808)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "imaflag", scope: !754, file: !755, line: 229, baseType: !69, size: 16, offset: 1824)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !754, file: !755, line: 229, baseType: !69, size: 16, offset: 1840)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !754, file: !755, line: 230, baseType: !69, size: 16, offset: 1856)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "stype", scope: !754, file: !755, line: 230, baseType: !69, size: 16, offset: 1872)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmin", scope: !754, file: !755, line: 232, baseType: !188, size: 32, offset: 1888)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "cropymin", scope: !754, file: !755, line: 232, baseType: !188, size: 32, offset: 1920)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmax", scope: !754, file: !755, line: 232, baseType: !188, size: 32, offset: 1952)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "cropymax", scope: !754, file: !755, line: 232, baseType: !188, size: 32, offset: 1984)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "texfilter", scope: !754, file: !755, line: 233, baseType: !18, size: 32, offset: 2016)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "afmax", scope: !754, file: !755, line: 234, baseType: !18, size: 32, offset: 2048)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "xrepeat", scope: !754, file: !755, line: 235, baseType: !69, size: 16, offset: 2080)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "yrepeat", scope: !754, file: !755, line: 235, baseType: !69, size: 16, offset: 2096)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "extend", scope: !754, file: !755, line: 236, baseType: !69, size: 16, offset: 2112)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !754, file: !755, line: 239, baseType: !69, size: 16, offset: 2128)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !754, file: !755, line: 240, baseType: !18, size: 32, offset: 2144)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !754, file: !755, line: 241, baseType: !18, size: 32, offset: 2176)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !754, file: !755, line: 241, baseType: !18, size: 32, offset: 2208)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !754, file: !755, line: 241, baseType: !18, size: 32, offset: 2240)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "checkerdist", scope: !754, file: !755, line: 243, baseType: !188, size: 32, offset: 2272)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "nabla", scope: !754, file: !755, line: 243, baseType: !188, size: 32, offset: 2304)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !754, file: !755, line: 244, baseType: !188, size: 32, offset: 2336)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !754, file: !755, line: 246, baseType: !809, size: 320, offset: 2368)
!809 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !810, line: 50, size: 320, elements: !811)
!810 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!811 = !{!812, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !809, file: !810, line: 51, baseType: !813, size: 64)
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !809, file: !810, line: 53, baseType: !18, size: 32, offset: 64)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !809, file: !810, line: 54, baseType: !18, size: 32, offset: 96)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !809, file: !810, line: 55, baseType: !18, size: 32, offset: 128)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !809, file: !810, line: 55, baseType: !18, size: 32, offset: 160)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !809, file: !810, line: 56, baseType: !37, size: 8, offset: 192)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "cycl", scope: !809, file: !810, line: 56, baseType: !37, size: 8, offset: 200)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !809, file: !810, line: 57, baseType: !37, size: 8, offset: 208)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !809, file: !810, line: 57, baseType: !37, size: 8, offset: 216)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "multi_index", scope: !809, file: !810, line: 59, baseType: !69, size: 16, offset: 224)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !809, file: !810, line: 59, baseType: !69, size: 16, offset: 240)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !809, file: !810, line: 59, baseType: !69, size: 16, offset: 256)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !809, file: !810, line: 61, baseType: !69, size: 16, offset: 272)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !809, file: !810, line: 63, baseType: !18, size: 32, offset: 288)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !754, file: !755, line: 248, baseType: !828, size: 64, offset: 2688)
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !829, size: 64)
!829 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !461, line: 57, flags: DIFlagFwdDecl)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !754, file: !755, line: 249, baseType: !490, size: 64, offset: 2752)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "ima", scope: !754, file: !755, line: 250, baseType: !832, size: 64, offset: 2816)
!832 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !833, size: 64)
!833 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !810, line: 77, size: 15424, elements: !834)
!834 = !{!835, !836, !837, !840, !843, !846, !849, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !868, !869, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !901, !902, !906}
!835 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !833, file: !810, line: 78, baseType: !383, size: 960)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !833, file: !810, line: 80, baseType: !360, size: 8192, offset: 960)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !833, file: !810, line: 82, baseType: !838, size: 64, offset: 9152)
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 64)
!839 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !810, line: 43, flags: DIFlagFwdDecl)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !833, file: !810, line: 83, baseType: !841, size: 64, offset: 9216)
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !842, size: 64)
!842 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !60, line: 46, flags: DIFlagFwdDecl)
