; ModuleID = 'blender/source/blender/editors/space_api/spacetypes.c'
source_filename = "blender/source/blender/editors/space_api/spacetypes.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.UserDef = type { i32, i32, i32, i32, i32, [768 x i8], [768 x i8], [1024 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [1024 x i8], [1024 x i8], i32, i16, i16, i16, i16, i16, i16, i32, i32, i32, i16, i16, i32, i32, i32, i32, i32, i32, i32, i16, i16, i16, i16, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, [64 x i8], i16, i16, i16, i16, i16, i16, i16, i16, [3 x %struct.SolidLight], i16, i16, i16, i16, i16, i16, i16, i16, i32, i32, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i8, i8, i8, i8, i16, i16, i16, i16, i16, i16, float, float, i32, i16, i16, float, i16, i16, i16, i16, %struct.ColorBand, [3 x float], [4 x float], i16, i8, i8, [80 x i8], [1024 x i8], i32, i32, float, float, i32, i16, i16, i16, i16, i16, i16, %struct.WalkNavigation }
%struct.ListBase = type { i8*, i8* }
%struct.SolidLight = type { i32, i32, [4 x float], [4 x float], [4 x float] }
%struct.ColorBand = type { i16, i16, i8, i8, i8, [1 x i8], [32 x %struct.CBData] }
%struct.CBData = type { float, float, float, float, float, i32 }
%struct.WalkNavigation = type { float, float, float, float, float, float, i16, [3 x i16] }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "st", scope: !2, file: !3, line: 306, type: !1923, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "ED_spacetype_xxx", scope: !3, file: !3, line: 304, type: !4, scopeLine: 305, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !1922)
!3 = !DIFile(filename: "blender/source/blender/editors/space_api/spacetypes.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !DISubroutineType(types: !5)
!5 = !{null}
!6 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !7, retainedTypes: !34, globals: !1921, splitDebugInlining: false, nameTableKind: None)
!7 = !{!8}
!8 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eSpace_Type", file: !9, line: 1163, baseType: !10, size: 32, elements: !11)
!9 = !DIFile(filename: "blender/source/blender/makesdna/DNA_space_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!10 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!11 = !{!12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33}
!12 = !DIEnumerator(name: "SPACE_EMPTY", value: 0, isUnsigned: true)
!13 = !DIEnumerator(name: "SPACE_VIEW3D", value: 1, isUnsigned: true)
!14 = !DIEnumerator(name: "SPACE_IPO", value: 2, isUnsigned: true)
!15 = !DIEnumerator(name: "SPACE_OUTLINER", value: 3, isUnsigned: true)
!16 = !DIEnumerator(name: "SPACE_BUTS", value: 4, isUnsigned: true)
!17 = !DIEnumerator(name: "SPACE_FILE", value: 5, isUnsigned: true)
!18 = !DIEnumerator(name: "SPACE_IMAGE", value: 6, isUnsigned: true)
!19 = !DIEnumerator(name: "SPACE_INFO", value: 7, isUnsigned: true)
!20 = !DIEnumerator(name: "SPACE_SEQ", value: 8, isUnsigned: true)
!21 = !DIEnumerator(name: "SPACE_TEXT", value: 9, isUnsigned: true)
!22 = !DIEnumerator(name: "SPACE_IMASEL", value: 10, isUnsigned: true)
!23 = !DIEnumerator(name: "SPACE_SOUND", value: 11, isUnsigned: true)
!24 = !DIEnumerator(name: "SPACE_ACTION", value: 12, isUnsigned: true)
!25 = !DIEnumerator(name: "SPACE_NLA", value: 13, isUnsigned: true)
!26 = !DIEnumerator(name: "SPACE_SCRIPT", value: 14, isUnsigned: true)
!27 = !DIEnumerator(name: "SPACE_TIME", value: 15, isUnsigned: true)
!28 = !DIEnumerator(name: "SPACE_NODE", value: 16, isUnsigned: true)
!29 = !DIEnumerator(name: "SPACE_LOGIC", value: 17, isUnsigned: true)
!30 = !DIEnumerator(name: "SPACE_CONSOLE", value: 18, isUnsigned: true)
!31 = !DIEnumerator(name: "SPACE_USERPREF", value: 19, isUnsigned: true)
!32 = !DIEnumerator(name: "SPACE_CLIP", value: 20, isUnsigned: true)
!33 = !DIEnumerator(name: "SPACEICONMAX", value: 20, isUnsigned: true)
!34 = !{!35}
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "RegionDrawCB", file: !3, line: 214, baseType: !37)
!37 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RegionDrawCB", file: !3, line: 206, size: 320, elements: !38)
!38 = !{!39, !41, !42, !1919, !1920}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !37, file: !3, line: 207, baseType: !40, size: 64)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !37, file: !3, line: 207, baseType: !40, size: 64, offset: 64)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "draw", scope: !37, file: !3, line: 209, baseType: !43, size: 64, offset: 128)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = !DISubroutineType(types: !45)
!45 = !{null, !46, !50, !151}
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!47 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !48)
!48 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !49, line: 51, flags: DIFlagFwdDecl)
!49 = !DIFile(filename: "blender/source/blender/makesdna/DNA_windowmanager_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!51 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ARegion", file: !52, line: 230, size: 3072, elements: !53)
!52 = !DIFile(filename: "blender/source/blender/makesdna/DNA_screen_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!53 = !{!54, !55, !56, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !1909, !1910, !1911, !1912, !1913, !1914, !1915, !1916, !1917, !1918}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !51, file: !52, line: 231, baseType: !50, size: 64)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !51, file: !52, line: 231, baseType: !50, size: 64, offset: 64)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "v2d", scope: !51, file: !52, line: 233, baseType: !57, size: 1280, offset: 128)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "View2D", file: !58, line: 71, baseType: !59)
!58 = !DIFile(filename: "blender/source/blender/makesdna/DNA_view2d_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!59 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "View2D", file: !58, line: 40, size: 1280, elements: !60)
!60 = !{!61, !71, !72, !81, !82, !83, !87, !88, !89, !90, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !105, !106, !107, !110}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !59, file: !58, line: 41, baseType: !62, size: 128)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !63, line: 95, baseType: !64)
!63 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!64 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !63, line: 92, size: 128, elements: !65)
!65 = !{!66, !68, !69, !70}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !64, file: !63, line: 93, baseType: !67, size: 32)
!67 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !64, file: !63, line: 93, baseType: !67, size: 32, offset: 32)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !64, file: !63, line: 94, baseType: !67, size: 32, offset: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !64, file: !63, line: 94, baseType: !67, size: 32, offset: 96)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !59, file: !58, line: 41, baseType: !62, size: 128, offset: 128)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "vert", scope: !59, file: !58, line: 42, baseType: !73, size: 128, offset: 256)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "rcti", file: !63, line: 89, baseType: !74)
!74 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rcti", file: !63, line: 86, size: 128, elements: !75)
!75 = !{!76, !78, !79, !80}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !74, file: !63, line: 87, baseType: !77, size: 32)
!77 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !74, file: !63, line: 87, baseType: !77, size: 32, offset: 32)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !74, file: !63, line: 88, baseType: !77, size: 32, offset: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !74, file: !63, line: 88, baseType: !77, size: 32, offset: 96)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "hor", scope: !59, file: !58, line: 42, baseType: !73, size: 128, offset: 384)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !59, file: !58, line: 43, baseType: !73, size: 128, offset: 512)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !59, file: !58, line: 45, baseType: !84, size: 64, offset: 640)
!84 = !DICompositeType(tag: DW_TAG_array_type, baseType: !67, size: 64, elements: !85)
!85 = !{!86}
!86 = !DISubrange(count: 2)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !59, file: !58, line: 45, baseType: !84, size: 64, offset: 704)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "minzoom", scope: !59, file: !58, line: 46, baseType: !67, size: 32, offset: 768)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "maxzoom", scope: !59, file: !58, line: 46, baseType: !67, size: 32, offset: 800)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "scroll", scope: !59, file: !58, line: 48, baseType: !91, size: 16, offset: 832)
!91 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "scroll_ui", scope: !59, file: !58, line: 49, baseType: !91, size: 16, offset: 848)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "keeptot", scope: !59, file: !58, line: 51, baseType: !91, size: 16, offset: 864)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "keepzoom", scope: !59, file: !58, line: 52, baseType: !91, size: 16, offset: 880)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "keepofs", scope: !59, file: !58, line: 53, baseType: !91, size: 16, offset: 896)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !59, file: !58, line: 55, baseType: !91, size: 16, offset: 912)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !59, file: !58, line: 56, baseType: !91, size: 16, offset: 928)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "winx", scope: !59, file: !58, line: 58, baseType: !91, size: 16, offset: 944)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "winy", scope: !59, file: !58, line: 58, baseType: !91, size: 16, offset: 960)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "oldwinx", scope: !59, file: !58, line: 59, baseType: !91, size: 16, offset: 976)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "oldwiny", scope: !59, file: !58, line: 59, baseType: !91, size: 16, offset: 992)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "around", scope: !59, file: !58, line: 61, baseType: !91, size: 16, offset: 1008)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "tab_offset", scope: !59, file: !58, line: 63, baseType: !104, size: 64, offset: 1024)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "tab_num", scope: !59, file: !58, line: 64, baseType: !77, size: 32, offset: 1088)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "tab_cur", scope: !59, file: !58, line: 65, baseType: !77, size: 32, offset: 1120)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "sms", scope: !59, file: !58, line: 68, baseType: !108, size: 64, offset: 1152)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = !DICompositeType(tag: DW_TAG_structure_type, name: "SmoothView2DStore", file: !58, line: 68, flags: DIFlagFwdDecl)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "smooth_timer", scope: !59, file: !58, line: 69, baseType: !111, size: 64, offset: 1216)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!112 = !DICompositeType(tag: DW_TAG_structure_type, name: "wmTimer", file: !58, line: 69, flags: DIFlagFwdDecl)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "winrct", scope: !51, file: !52, line: 234, baseType: !73, size: 128, offset: 1408)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "drawrct", scope: !51, file: !52, line: 235, baseType: !73, size: 128, offset: 1536)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "winx", scope: !51, file: !52, line: 236, baseType: !91, size: 16, offset: 1664)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "winy", scope: !51, file: !52, line: 236, baseType: !91, size: 16, offset: 1680)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "swinid", scope: !51, file: !52, line: 238, baseType: !91, size: 16, offset: 1696)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "regiontype", scope: !51, file: !52, line: 239, baseType: !91, size: 16, offset: 1712)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !51, file: !52, line: 240, baseType: !91, size: 16, offset: 1728)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !51, file: !52, line: 241, baseType: !91, size: 16, offset: 1744)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "fsize", scope: !51, file: !52, line: 243, baseType: !67, size: 32, offset: 1760)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "sizex", scope: !51, file: !52, line: 244, baseType: !91, size: 16, offset: 1792)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "sizey", scope: !51, file: !52, line: 244, baseType: !91, size: 16, offset: 1808)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "do_draw", scope: !51, file: !52, line: 246, baseType: !91, size: 16, offset: 1824)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "do_draw_overlay", scope: !51, file: !52, line: 247, baseType: !91, size: 16, offset: 1840)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "swap", scope: !51, file: !52, line: 248, baseType: !91, size: 16, offset: 1856)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "overlap", scope: !51, file: !52, line: 249, baseType: !91, size: 16, offset: 1872)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "flagfullscreen", scope: !51, file: !52, line: 250, baseType: !91, size: 16, offset: 1888)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !51, file: !52, line: 251, baseType: !91, size: 16, offset: 1904)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !51, file: !52, line: 253, baseType: !131, size: 64, offset: 1920)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ARegionType", file: !133, line: 116, size: 1472, elements: !134)
!133 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_screen.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!134 = !{!135, !136, !137, !138, !1767, !1768, !1772, !1883, !1887, !1891, !1892, !1893, !1897, !1898, !1899, !1900, !1901, !1902, !1903, !1904, !1905, !1906, !1907, !1908}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !132, file: !133, line: 117, baseType: !131, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !132, file: !133, line: 117, baseType: !131, size: 64, offset: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "regionid", scope: !132, file: !133, line: 119, baseType: !77, size: 32, offset: 128)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !132, file: !133, line: 122, baseType: !139, size: 64, offset: 192)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!140 = !DISubroutineType(types: !141)
!141 = !{null, !142, !50}
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!143 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindowManager", file: !49, line: 128, size: 2816, elements: !144)
!144 = !{!145, !215, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1746, !1747, !1748, !1749, !1750, !1761, !1762, !1763, !1764, !1765, !1766}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !143, file: !49, line: 129, baseType: !146, size: 960)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !147, line: 130, baseType: !148)
!147 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!148 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !147, line: 117, size: 960, elements: !149)
!149 = !{!150, !152, !153, !155, !175, !179, !180, !181, !182, !183}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !148, file: !147, line: 118, baseType: !151, size: 64)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !148, file: !147, line: 118, baseType: !151, size: 64, offset: 64)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !148, file: !147, line: 119, baseType: !154, size: 64, offset: 128)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !148, file: !147, line: 120, baseType: !156, size: 64, offset: 192)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !147, line: 136, size: 17600, elements: !158)
!158 = !{!159, !160, !162, !165, !170, !171, !172}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !157, file: !147, line: 137, baseType: !146, size: 960)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !157, file: !147, line: 138, baseType: !161, size: 64, offset: 960)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !157, file: !147, line: 139, baseType: !163, size: 64, offset: 1024)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !147, line: 43, flags: DIFlagFwdDecl)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !157, file: !147, line: 140, baseType: !166, size: 8192, offset: 1088)
!166 = !DICompositeType(tag: DW_TAG_array_type, baseType: !167, size: 8192, elements: !168)
!167 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!168 = !{!169}
!169 = !DISubrange(count: 1024)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !157, file: !147, line: 141, baseType: !166, size: 8192, offset: 9280)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !157, file: !147, line: 148, baseType: !156, size: 64, offset: 17472)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !157, file: !147, line: 150, baseType: !173, size: 64, offset: 17536)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !147, line: 45, flags: DIFlagFwdDecl)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !148, file: !147, line: 121, baseType: !176, size: 528, offset: 256)
!176 = !DICompositeType(tag: DW_TAG_array_type, baseType: !167, size: 528, elements: !177)
!177 = !{!178}
!178 = !DISubrange(count: 66)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !148, file: !147, line: 126, baseType: !91, size: 16, offset: 784)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !148, file: !147, line: 127, baseType: !77, size: 32, offset: 800)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !148, file: !147, line: 128, baseType: !77, size: 32, offset: 832)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !148, file: !147, line: 128, baseType: !77, size: 32, offset: 864)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !148, file: !147, line: 129, baseType: !184, size: 64, offset: 896)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !147, line: 75, baseType: !186)
!186 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !147, line: 62, size: 1024, elements: !187)
!187 = !{!188, !190, !191, !192, !193, !194, !198, !199, !213, !214}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !186, file: !147, line: 63, baseType: !189, size: 64)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !186, file: !147, line: 63, baseType: !189, size: 64, offset: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !186, file: !147, line: 64, baseType: !167, size: 8, offset: 128)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !186, file: !147, line: 64, baseType: !167, size: 8, offset: 136)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !186, file: !147, line: 65, baseType: !91, size: 16, offset: 144)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !186, file: !147, line: 66, baseType: !195, size: 512, offset: 160)
!195 = !DICompositeType(tag: DW_TAG_array_type, baseType: !167, size: 512, elements: !196)
!196 = !{!197}
!197 = !DISubrange(count: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !186, file: !147, line: 67, baseType: !77, size: 32, offset: 672)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !186, file: !147, line: 69, baseType: !200, size: 256, offset: 704)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !147, line: 60, baseType: !201)
!201 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !147, line: 48, size: 256, elements: !202)
!202 = !{!203, !204, !211, !212}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !201, file: !147, line: 49, baseType: !151, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !201, file: !147, line: 58, baseType: !205, size: 128, offset: 64)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !206, line: 71, baseType: !207)
!206 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!207 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !206, line: 69, size: 128, elements: !208)
!208 = !{!209, !210}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !207, file: !206, line: 70, baseType: !151, size: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !207, file: !206, line: 70, baseType: !151, size: 64, offset: 64)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !201, file: !147, line: 59, baseType: !77, size: 32, offset: 192)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !201, file: !147, line: 59, baseType: !77, size: 32, offset: 224)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !186, file: !147, line: 70, baseType: !77, size: 32, offset: 960)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !186, file: !147, line: 74, baseType: !77, size: 32, offset: 992)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "windrawable", scope: !143, file: !49, line: 131, baseType: !216, size: 64, offset: 960)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
!217 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindow", file: !49, line: 169, size: 2048, elements: !218)
!218 = !{!219, !220, !221, !222, !1696, !1697, !1698, !1699, !1700, !1701, !1702, !1703, !1704, !1705, !1706, !1707, !1708, !1709, !1710, !1711, !1712, !1713, !1716, !1719, !1722, !1723, !1724, !1725, !1726, !1727, !1728, !1729}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !217, file: !49, line: 170, baseType: !216, size: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !217, file: !49, line: 170, baseType: !216, size: 64, offset: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "ghostwin", scope: !217, file: !49, line: 172, baseType: !151, size: 64, offset: 128)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !217, file: !49, line: 174, baseType: !223, size: 64, offset: 192)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !52, line: 49, size: 1984, elements: !225)
!225 = !{!226, !227, !228, !229, !230, !231, !1679, !1680, !1681, !1682, !1683, !1684, !1685, !1686, !1687, !1688, !1689, !1690, !1691, !1692, !1693, !1694, !1695}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !224, file: !52, line: 50, baseType: !146, size: 960)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "vertbase", scope: !224, file: !52, line: 52, baseType: !205, size: 128, offset: 960)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "edgebase", scope: !224, file: !52, line: 53, baseType: !205, size: 128, offset: 1088)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "areabase", scope: !224, file: !52, line: 54, baseType: !205, size: 128, offset: 1216)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !224, file: !52, line: 55, baseType: !205, size: 128, offset: 1344)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !224, file: !52, line: 57, baseType: !232, size: 64, offset: 1472)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !234, line: 1216, size: 39680, elements: !235)
!234 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!235 = !{!236, !237, !241, !529, !532, !533, !534, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !560, !626, !1054, !1269, !1272, !1554, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1576, !1577, !1578, !1579, !1580, !1588, !1655, !1662, !1663, !1670, !1671, !1672, !1673, !1674, !1675, !1676}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !233, file: !234, line: 1217, baseType: !146, size: 960)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !233, file: !234, line: 1218, baseType: !238, size: 64, offset: 960)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!239 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !240, line: 45, flags: DIFlagFwdDecl)
!240 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!241 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !233, file: !234, line: 1220, baseType: !242, size: 64, offset: 1024)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!243 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !244, line: 115, size: 11392, elements: !245)
!244 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!245 = !{!246, !247, !248, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !265, !276, !290, !291, !334, !335, !338, !339, !355, !356, !357, !358, !359, !360, !361, !365, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !381, !382, !383, !384, !385, !386, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !446, !447, !448, !449, !450, !451, !452, !453, !454, !457, !460, !463, !464, !465, !466, !467, !470, !473, !476, !477, !483, !484, !485, !486, !487, !488, !490, !493, !496, !497, !517, !518}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !243, file: !244, line: 116, baseType: !146, size: 960)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !243, file: !244, line: 117, baseType: !238, size: 64, offset: 960)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !243, file: !244, line: 119, baseType: !249, size: 64, offset: 1024)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!250 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !244, line: 57, flags: DIFlagFwdDecl)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !243, file: !244, line: 121, baseType: !91, size: 16, offset: 1088)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !243, file: !244, line: 121, baseType: !91, size: 16, offset: 1104)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !243, file: !244, line: 122, baseType: !77, size: 32, offset: 1120)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !243, file: !244, line: 122, baseType: !77, size: 32, offset: 1152)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !243, file: !244, line: 122, baseType: !77, size: 32, offset: 1184)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !243, file: !244, line: 123, baseType: !195, size: 512, offset: 1216)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !243, file: !244, line: 124, baseType: !242, size: 64, offset: 1728)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !243, file: !244, line: 124, baseType: !242, size: 64, offset: 1792)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !243, file: !244, line: 127, baseType: !242, size: 64, offset: 1856)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !243, file: !244, line: 127, baseType: !242, size: 64, offset: 1920)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !243, file: !244, line: 127, baseType: !242, size: 64, offset: 1984)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !243, file: !244, line: 128, baseType: !263, size: 64, offset: 2048)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!264 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !240, line: 46, flags: DIFlagFwdDecl)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !243, file: !244, line: 130, baseType: !266, size: 64, offset: 2112)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!267 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !244, line: 97, size: 832, elements: !268)
!268 = !{!269, !274, !275}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !267, file: !244, line: 98, baseType: !270, size: 768)
!270 = !DICompositeType(tag: DW_TAG_array_type, baseType: !67, size: 768, elements: !271)
!271 = !{!272, !273}
!272 = !DISubrange(count: 8)
!273 = !DISubrange(count: 3)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !267, file: !244, line: 99, baseType: !77, size: 32, offset: 768)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !267, file: !244, line: 99, baseType: !77, size: 32, offset: 800)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !243, file: !244, line: 131, baseType: !277, size: 64, offset: 2176)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!278 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !279, line: 486, size: 1600, elements: !280)
!279 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!280 = !{!281, !282, !283, !284, !285, !286, !287, !288, !289}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !278, file: !279, line: 487, baseType: !146, size: 960)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !278, file: !279, line: 489, baseType: !205, size: 128, offset: 960)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !278, file: !279, line: 490, baseType: !205, size: 128, offset: 1088)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !278, file: !279, line: 491, baseType: !205, size: 128, offset: 1216)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !278, file: !279, line: 492, baseType: !205, size: 128, offset: 1344)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !278, file: !279, line: 494, baseType: !77, size: 32, offset: 1472)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !278, file: !279, line: 495, baseType: !77, size: 32, offset: 1504)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !278, file: !279, line: 497, baseType: !77, size: 32, offset: 1536)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !278, file: !279, line: 498, baseType: !77, size: 32, offset: 1568)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !243, file: !244, line: 132, baseType: !277, size: 64, offset: 2240)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !243, file: !244, line: 133, baseType: !292, size: 64, offset: 2304)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64)
!293 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !279, line: 334, size: 1728, elements: !294)
!294 = !{!295, !296, !299, !300, !301, !302, !303, !304, !307, !308, !309, !310, !311, !312, !313, !333}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !293, file: !279, line: 335, baseType: !205, size: 128)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !293, file: !279, line: 336, baseType: !297, size: 64, offset: 128)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64)
!298 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !279, line: 47, flags: DIFlagFwdDecl)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !293, file: !279, line: 338, baseType: !91, size: 16, offset: 192)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !293, file: !279, line: 338, baseType: !91, size: 16, offset: 208)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !293, file: !279, line: 339, baseType: !10, size: 32, offset: 224)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !293, file: !279, line: 340, baseType: !77, size: 32, offset: 256)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !293, file: !279, line: 342, baseType: !67, size: 32, offset: 288)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !293, file: !279, line: 343, baseType: !305, size: 96, offset: 320)
!305 = !DICompositeType(tag: DW_TAG_array_type, baseType: !67, size: 96, elements: !306)
!306 = !{!273}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !293, file: !279, line: 344, baseType: !305, size: 96, offset: 416)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !293, file: !279, line: 347, baseType: !205, size: 128, offset: 512)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !293, file: !279, line: 349, baseType: !77, size: 32, offset: 640)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !293, file: !279, line: 350, baseType: !77, size: 32, offset: 672)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !293, file: !279, line: 351, baseType: !151, size: 64, offset: 704)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !293, file: !279, line: 352, baseType: !151, size: 64, offset: 768)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !293, file: !279, line: 354, baseType: !314, size: 384, offset: 832)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !279, line: 116, baseType: !315)
!315 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !279, line: 94, size: 384, elements: !316)
!316 = !{!317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !315, file: !279, line: 96, baseType: !77, size: 32)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !315, file: !279, line: 96, baseType: !77, size: 32, offset: 32)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !315, file: !279, line: 97, baseType: !77, size: 32, offset: 64)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !315, file: !279, line: 97, baseType: !77, size: 32, offset: 96)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !315, file: !279, line: 99, baseType: !91, size: 16, offset: 128)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !315, file: !279, line: 100, baseType: !91, size: 16, offset: 144)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !315, file: !279, line: 102, baseType: !91, size: 16, offset: 160)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !315, file: !279, line: 105, baseType: !91, size: 16, offset: 176)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !315, file: !279, line: 108, baseType: !91, size: 16, offset: 192)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !315, file: !279, line: 109, baseType: !91, size: 16, offset: 208)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !315, file: !279, line: 111, baseType: !91, size: 16, offset: 224)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !315, file: !279, line: 112, baseType: !91, size: 16, offset: 240)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !315, file: !279, line: 114, baseType: !77, size: 32, offset: 256)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !315, file: !279, line: 114, baseType: !77, size: 32, offset: 288)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !315, file: !279, line: 115, baseType: !77, size: 32, offset: 320)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !315, file: !279, line: 115, baseType: !77, size: 32, offset: 352)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !293, file: !279, line: 355, baseType: !195, size: 512, offset: 1216)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !243, file: !244, line: 134, baseType: !151, size: 64, offset: 2368)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !243, file: !244, line: 136, baseType: !336, size: 64, offset: 2432)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64)
!337 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !244, line: 58, flags: DIFlagFwdDecl)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !243, file: !244, line: 138, baseType: !314, size: 384, offset: 2496)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !243, file: !244, line: 139, baseType: !340, size: 64, offset: 2880)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64)
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !279, line: 80, baseType: !342)
!342 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !279, line: 72, size: 192, elements: !343)
!343 = !{!344, !351, !352, !353, !354}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !342, file: !279, line: 73, baseType: !345, size: 64)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !279, line: 59, baseType: !347)
!347 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !279, line: 56, size: 128, elements: !348)
!348 = !{!349, !350}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !347, file: !279, line: 57, baseType: !305, size: 96)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !347, file: !279, line: 58, baseType: !77, size: 32, offset: 96)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !342, file: !279, line: 74, baseType: !77, size: 32, offset: 64)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !342, file: !279, line: 76, baseType: !77, size: 32, offset: 96)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !342, file: !279, line: 77, baseType: !77, size: 32, offset: 128)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !342, file: !279, line: 79, baseType: !77, size: 32, offset: 160)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !243, file: !244, line: 141, baseType: !205, size: 128, offset: 2944)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !243, file: !244, line: 142, baseType: !205, size: 128, offset: 3072)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !243, file: !244, line: 143, baseType: !205, size: 128, offset: 3200)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !243, file: !244, line: 144, baseType: !205, size: 128, offset: 3328)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !243, file: !244, line: 146, baseType: !77, size: 32, offset: 3456)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !243, file: !244, line: 147, baseType: !77, size: 32, offset: 3488)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !243, file: !244, line: 150, baseType: !362, size: 64, offset: 3520)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !244, line: 50, flags: DIFlagFwdDecl)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !243, file: !244, line: 151, baseType: !366, size: 64, offset: 3584)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !243, file: !244, line: 152, baseType: !77, size: 32, offset: 3648)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !243, file: !244, line: 153, baseType: !77, size: 32, offset: 3680)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !243, file: !244, line: 156, baseType: !305, size: 96, offset: 3712)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !243, file: !244, line: 156, baseType: !305, size: 96, offset: 3808)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !243, file: !244, line: 156, baseType: !305, size: 96, offset: 3904)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !243, file: !244, line: 157, baseType: !305, size: 96, offset: 4000)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !243, file: !244, line: 158, baseType: !305, size: 96, offset: 4096)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !243, file: !244, line: 159, baseType: !305, size: 96, offset: 4192)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !243, file: !244, line: 160, baseType: !305, size: 96, offset: 4288)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !243, file: !244, line: 160, baseType: !305, size: 96, offset: 4384)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !243, file: !244, line: 161, baseType: !378, size: 128, offset: 4480)
!378 = !DICompositeType(tag: DW_TAG_array_type, baseType: !67, size: 128, elements: !379)
!379 = !{!380}
!380 = !DISubrange(count: 4)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !243, file: !244, line: 161, baseType: !378, size: 128, offset: 4608)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !243, file: !244, line: 162, baseType: !305, size: 96, offset: 4736)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !243, file: !244, line: 162, baseType: !305, size: 96, offset: 4832)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !243, file: !244, line: 163, baseType: !67, size: 32, offset: 4928)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !243, file: !244, line: 163, baseType: !67, size: 32, offset: 4960)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !243, file: !244, line: 164, baseType: !387, size: 512, offset: 4992)
!387 = !DICompositeType(tag: DW_TAG_array_type, baseType: !67, size: 512, elements: !388)
!388 = !{!380, !380}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !243, file: !244, line: 165, baseType: !387, size: 512, offset: 5504)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !243, file: !244, line: 166, baseType: !387, size: 512, offset: 6016)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !243, file: !244, line: 167, baseType: !387, size: 512, offset: 6528)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !243, file: !244, line: 176, baseType: !387, size: 512, offset: 7040)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !243, file: !244, line: 178, baseType: !10, size: 32, offset: 7552)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !243, file: !244, line: 180, baseType: !91, size: 16, offset: 7584)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !243, file: !244, line: 181, baseType: !91, size: 16, offset: 7600)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !243, file: !244, line: 183, baseType: !91, size: 16, offset: 7616)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !243, file: !244, line: 183, baseType: !91, size: 16, offset: 7632)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !243, file: !244, line: 184, baseType: !91, size: 16, offset: 7648)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !243, file: !244, line: 184, baseType: !91, size: 16, offset: 7664)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !243, file: !244, line: 185, baseType: !91, size: 16, offset: 7680)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !243, file: !244, line: 186, baseType: !91, size: 16, offset: 7696)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !243, file: !244, line: 187, baseType: !91, size: 16, offset: 7712)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !243, file: !244, line: 188, baseType: !167, size: 8, offset: 7728)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !243, file: !244, line: 189, baseType: !167, size: 8, offset: 7736)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !243, file: !244, line: 192, baseType: !77, size: 32, offset: 7744)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !243, file: !244, line: 192, baseType: !77, size: 32, offset: 7776)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !243, file: !244, line: 192, baseType: !77, size: 32, offset: 7808)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !243, file: !244, line: 192, baseType: !77, size: 32, offset: 7840)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !243, file: !244, line: 194, baseType: !77, size: 32, offset: 7872)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !243, file: !244, line: 202, baseType: !67, size: 32, offset: 7904)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !243, file: !244, line: 202, baseType: !67, size: 32, offset: 7936)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !243, file: !244, line: 202, baseType: !67, size: 32, offset: 7968)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !243, file: !244, line: 211, baseType: !67, size: 32, offset: 8000)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !243, file: !244, line: 212, baseType: !67, size: 32, offset: 8032)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !243, file: !244, line: 213, baseType: !67, size: 32, offset: 8064)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !243, file: !244, line: 214, baseType: !67, size: 32, offset: 8096)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !243, file: !244, line: 215, baseType: !67, size: 32, offset: 8128)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !243, file: !244, line: 216, baseType: !67, size: 32, offset: 8160)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !243, file: !244, line: 219, baseType: !67, size: 32, offset: 8192)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !243, file: !244, line: 220, baseType: !67, size: 32, offset: 8224)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !243, file: !244, line: 221, baseType: !67, size: 32, offset: 8256)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !243, file: !244, line: 224, baseType: !423, size: 16, offset: 8288)
!423 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !243, file: !244, line: 224, baseType: !423, size: 16, offset: 8304)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !243, file: !244, line: 226, baseType: !91, size: 16, offset: 8320)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !243, file: !244, line: 228, baseType: !167, size: 8, offset: 8336)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !243, file: !244, line: 229, baseType: !167, size: 8, offset: 8344)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !243, file: !244, line: 231, baseType: !91, size: 16, offset: 8352)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !243, file: !244, line: 232, baseType: !167, size: 8, offset: 8368)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !243, file: !244, line: 233, baseType: !167, size: 8, offset: 8376)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !243, file: !244, line: 234, baseType: !67, size: 32, offset: 8384)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !243, file: !244, line: 235, baseType: !67, size: 32, offset: 8416)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !243, file: !244, line: 237, baseType: !205, size: 128, offset: 8448)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !243, file: !244, line: 238, baseType: !205, size: 128, offset: 8576)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !243, file: !244, line: 239, baseType: !205, size: 128, offset: 8704)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !243, file: !244, line: 240, baseType: !205, size: 128, offset: 8832)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !243, file: !244, line: 242, baseType: !67, size: 32, offset: 8960)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !243, file: !244, line: 244, baseType: !91, size: 16, offset: 8992)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !243, file: !244, line: 245, baseType: !423, size: 16, offset: 9008)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !243, file: !244, line: 246, baseType: !378, size: 128, offset: 9024)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !243, file: !244, line: 248, baseType: !77, size: 32, offset: 9152)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !243, file: !244, line: 249, baseType: !77, size: 32, offset: 9184)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !243, file: !244, line: 251, baseType: !444, size: 64, offset: 9216)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!445 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !244, line: 251, flags: DIFlagFwdDecl)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !243, file: !244, line: 253, baseType: !167, size: 8, offset: 9280)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !243, file: !244, line: 254, baseType: !167, size: 8, offset: 9288)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !243, file: !244, line: 255, baseType: !91, size: 16, offset: 9296)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !243, file: !244, line: 256, baseType: !305, size: 96, offset: 9312)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !243, file: !244, line: 258, baseType: !205, size: 128, offset: 9408)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !243, file: !244, line: 259, baseType: !205, size: 128, offset: 9536)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !243, file: !244, line: 260, baseType: !205, size: 128, offset: 9664)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !243, file: !244, line: 261, baseType: !205, size: 128, offset: 9792)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !243, file: !244, line: 263, baseType: !455, size: 64, offset: 9920)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64)
!456 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !244, line: 52, flags: DIFlagFwdDecl)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !243, file: !244, line: 264, baseType: !458, size: 64, offset: 9984)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64)
!459 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !244, line: 53, flags: DIFlagFwdDecl)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !243, file: !244, line: 265, baseType: !461, size: 64, offset: 10048)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!462 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !279, line: 46, flags: DIFlagFwdDecl)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !243, file: !244, line: 267, baseType: !167, size: 8, offset: 10112)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !243, file: !244, line: 268, baseType: !167, size: 8, offset: 10120)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !243, file: !244, line: 269, baseType: !91, size: 16, offset: 10128)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !243, file: !244, line: 270, baseType: !67, size: 32, offset: 10144)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !243, file: !244, line: 272, baseType: !468, size: 64, offset: 10176)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64)
!469 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !244, line: 54, flags: DIFlagFwdDecl)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !243, file: !244, line: 275, baseType: !471, size: 64, offset: 10240)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64)
!472 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !244, line: 275, flags: DIFlagFwdDecl)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !243, file: !244, line: 277, baseType: !474, size: 64, offset: 10304)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64)
!475 = !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !244, line: 56, flags: DIFlagFwdDecl)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !243, file: !244, line: 277, baseType: !474, size: 64, offset: 10368)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !243, file: !244, line: 278, baseType: !478, size: 64, offset: 10432)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !479, line: 27, baseType: !480)
!479 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!480 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !481, line: 45, baseType: !482)
!481 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!482 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_mask", scope: !243, file: !244, line: 279, baseType: !478, size: 64, offset: 10496)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !243, file: !244, line: 280, baseType: !10, size: 32, offset: 10560)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !243, file: !244, line: 281, baseType: !10, size: 32, offset: 10592)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "gpulamp", scope: !243, file: !244, line: 283, baseType: !205, size: 128, offset: 10624)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "pc_ids", scope: !243, file: !244, line: 284, baseType: !205, size: 128, offset: 10752)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "duplilist", scope: !243, file: !244, line: 285, baseType: !489, size: 64, offset: 10880)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_object", scope: !243, file: !244, line: 287, baseType: !491, size: 64, offset: 10944)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64)
!492 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyOb", file: !244, line: 59, flags: DIFlagFwdDecl)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_constraint", scope: !243, file: !244, line: 288, baseType: !494, size: 64, offset: 11008)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64)
!495 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyCon", file: !244, line: 288, flags: DIFlagFwdDecl)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "ima_ofs", scope: !243, file: !244, line: 290, baseType: !84, size: 64, offset: 11072)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !243, file: !244, line: 291, baseType: !498, size: 64, offset: 11136)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64)
!499 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageUser", file: !500, line: 65, baseType: !501)
!500 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!501 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !500, line: 50, size: 320, elements: !502)
!502 = !{!503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !501, file: !500, line: 51, baseType: !232, size: 64)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !501, file: !500, line: 53, baseType: !77, size: 32, offset: 64)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !501, file: !500, line: 54, baseType: !77, size: 32, offset: 96)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !501, file: !500, line: 55, baseType: !77, size: 32, offset: 128)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !501, file: !500, line: 55, baseType: !77, size: 32, offset: 160)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !501, file: !500, line: 56, baseType: !167, size: 8, offset: 192)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "cycl", scope: !501, file: !500, line: 56, baseType: !167, size: 8, offset: 200)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !501, file: !500, line: 57, baseType: !167, size: 8, offset: 208)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !501, file: !500, line: 57, baseType: !167, size: 8, offset: 216)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "multi_index", scope: !501, file: !500, line: 59, baseType: !91, size: 16, offset: 224)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !501, file: !500, line: 59, baseType: !91, size: 16, offset: 240)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !501, file: !500, line: 59, baseType: !91, size: 16, offset: 256)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !501, file: !500, line: 61, baseType: !91, size: 16, offset: 272)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !501, file: !500, line: 63, baseType: !77, size: 32, offset: 288)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "lodlevels", scope: !243, file: !244, line: 293, baseType: !205, size: 128, offset: 11200)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "currentlod", scope: !243, file: !244, line: 294, baseType: !519, size: 64, offset: 11328)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!520 = !DIDerivedType(tag: DW_TAG_typedef, name: "LodLevel", file: !244, line: 113, baseType: !521)
!521 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LodLevel", file: !244, line: 108, size: 256, elements: !522)
!522 = !{!523, !525, !526, !527, !528}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !521, file: !244, line: 109, baseType: !524, size: 64)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 64)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !521, file: !244, line: 109, baseType: !524, size: 64, offset: 64)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !521, file: !244, line: 110, baseType: !242, size: 64, offset: 128)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !521, file: !244, line: 111, baseType: !77, size: 32, offset: 192)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "distance", scope: !521, file: !244, line: 112, baseType: !67, size: 32, offset: 224)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !233, file: !234, line: 1221, baseType: !530, size: 64, offset: 1088)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64)
!531 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !234, line: 52, flags: DIFlagFwdDecl)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !233, file: !234, line: 1223, baseType: !232, size: 64, offset: 1152)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !233, file: !234, line: 1225, baseType: !205, size: 128, offset: 1216)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !233, file: !234, line: 1226, baseType: !535, size: 64, offset: 1344)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64)
!536 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !234, line: 69, size: 320, elements: !537)
!537 = !{!538, !539, !540, !541, !542, !543, !544, !545}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !536, file: !234, line: 70, baseType: !535, size: 64)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !536, file: !234, line: 70, baseType: !535, size: 64, offset: 64)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !536, file: !234, line: 71, baseType: !10, size: 32, offset: 128)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !536, file: !234, line: 71, baseType: !10, size: 32, offset: 160)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !536, file: !234, line: 72, baseType: !77, size: 32, offset: 192)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !536, file: !234, line: 73, baseType: !91, size: 16, offset: 224)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !536, file: !234, line: 73, baseType: !91, size: 16, offset: 240)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !536, file: !234, line: 74, baseType: !242, size: 64, offset: 256)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !233, file: !234, line: 1227, baseType: !242, size: 64, offset: 1408)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !233, file: !234, line: 1229, baseType: !305, size: 96, offset: 1472)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !233, file: !234, line: 1230, baseType: !305, size: 96, offset: 1568)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !233, file: !234, line: 1231, baseType: !305, size: 96, offset: 1664)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !233, file: !234, line: 1231, baseType: !305, size: 96, offset: 1760)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !233, file: !234, line: 1233, baseType: !10, size: 32, offset: 1856)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !233, file: !234, line: 1234, baseType: !77, size: 32, offset: 1888)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !233, file: !234, line: 1235, baseType: !10, size: 32, offset: 1920)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !233, file: !234, line: 1237, baseType: !91, size: 16, offset: 1952)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !233, file: !234, line: 1239, baseType: !167, size: 8, offset: 1968)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !233, file: !234, line: 1240, baseType: !557, size: 8, offset: 1976)
!557 = !DICompositeType(tag: DW_TAG_array_type, baseType: !167, size: 8, elements: !558)
!558 = !{!559}
!559 = !DISubrange(count: 1)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !233, file: !234, line: 1242, baseType: !561, size: 64, offset: 1984)
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64)
!562 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !563, line: 328, size: 3456, elements: !564)
!563 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!564 = !{!565, !566, !567, !571, !572, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !597, !602, !603, !606, !610, !614, !618, !622, !623, !624, !625}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !562, file: !563, line: 329, baseType: !146, size: 960)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !562, file: !563, line: 330, baseType: !238, size: 64, offset: 960)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !562, file: !563, line: 332, baseType: !568, size: 64, offset: 1024)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64)
!569 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !570, line: 45, flags: DIFlagFwdDecl)
!570 = !DIFile(filename: "blender/source/blender/editors/include/ED_node.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!571 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !562, file: !563, line: 333, baseType: !195, size: 512, offset: 1088)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "interface_type", scope: !562, file: !563, line: 335, baseType: !573, size: 64, offset: 1600)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64)
!574 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !49, line: 57, flags: DIFlagFwdDecl)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !562, file: !563, line: 337, baseType: !336, size: 64, offset: 1664)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "view_center", scope: !562, file: !563, line: 338, baseType: !84, size: 64, offset: 1728)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !562, file: !563, line: 340, baseType: !205, size: 128, offset: 1792)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !562, file: !563, line: 340, baseType: !205, size: 128, offset: 1920)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !562, file: !563, line: 342, baseType: !77, size: 32, offset: 2048)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !562, file: !563, line: 342, baseType: !77, size: 32, offset: 2080)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "cur_index", scope: !562, file: !563, line: 343, baseType: !77, size: 32, offset: 2112)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !562, file: !563, line: 345, baseType: !77, size: 32, offset: 2144)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !562, file: !563, line: 346, baseType: !77, size: 32, offset: 2176)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "is_updating", scope: !562, file: !563, line: 347, baseType: !91, size: 16, offset: 2208)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !562, file: !563, line: 348, baseType: !91, size: 16, offset: 2224)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !562, file: !563, line: 349, baseType: !77, size: 32, offset: 2240)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "nodetype", scope: !562, file: !563, line: 351, baseType: !77, size: 32, offset: 2272)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "edit_quality", scope: !562, file: !563, line: 353, baseType: !91, size: 16, offset: 2304)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "render_quality", scope: !562, file: !563, line: 354, baseType: !91, size: 16, offset: 2320)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "chunksize", scope: !562, file: !563, line: 355, baseType: !77, size: 32, offset: 2336)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "viewer_border", scope: !562, file: !563, line: 357, baseType: !62, size: 128, offset: 2368)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !562, file: !563, line: 363, baseType: !205, size: 128, offset: 2496)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !562, file: !563, line: 363, baseType: !205, size: 128, offset: 2624)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "previews", scope: !562, file: !563, line: 368, baseType: !595, size: 64, offset: 2752)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64)
!596 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHash", file: !563, line: 48, flags: DIFlagFwdDecl)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "active_viewer_key", scope: !562, file: !563, line: 372, baseType: !598, size: 32, offset: 2816)
!598 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !563, line: 274, baseType: !599)
!599 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !563, line: 271, size: 32, elements: !600)
!600 = !{!601}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !599, file: !563, line: 273, baseType: !10, size: 32)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !562, file: !563, line: 373, baseType: !77, size: 32, offset: 2848)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "execdata", scope: !562, file: !563, line: 382, baseType: !604, size: 64, offset: 2880)
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 64)
!605 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeExec", file: !563, line: 46, flags: DIFlagFwdDecl)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !562, file: !563, line: 385, baseType: !607, size: 64, offset: 2944)
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64)
!608 = !DISubroutineType(types: !609)
!609 = !{null, !151, !67}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "stats_draw", scope: !562, file: !563, line: 386, baseType: !611, size: 64, offset: 3008)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64)
!612 = !DISubroutineType(types: !613)
!613 = !{null, !151, !366}
!614 = !DIDerivedType(tag: DW_TAG_member, name: "test_break", scope: !562, file: !563, line: 387, baseType: !615, size: 64, offset: 3072)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 64)
!616 = !DISubroutineType(types: !617)
!617 = !{!77, !151}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "update_draw", scope: !562, file: !563, line: 388, baseType: !619, size: 64, offset: 3136)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64)
!620 = !DISubroutineType(types: !621)
!621 = !{null, !151}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "tbh", scope: !562, file: !563, line: 389, baseType: !151, size: 64, offset: 3200)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "prh", scope: !562, file: !563, line: 389, baseType: !151, size: 64, offset: 3264)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "sdh", scope: !562, file: !563, line: 389, baseType: !151, size: 64, offset: 3328)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "udh", scope: !562, file: !563, line: 389, baseType: !151, size: 64, offset: 3392)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !233, file: !234, line: 1244, baseType: !627, size: 64, offset: 2048)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 64)
!628 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !629, line: 200, size: 17024, elements: !630)
!629 = !DIFile(filename: "blender/source/blender/makesdna/DNA_sequence_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!630 = !{!631, !632, !633, !634, !1047, !1048, !1049, !1050, !1051, !1052, !1053}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "seqbasep", scope: !628, file: !629, line: 201, baseType: !489, size: 64)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !628, file: !629, line: 202, baseType: !205, size: 128, offset: 64)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "metastack", scope: !628, file: !629, line: 203, baseType: !205, size: 128, offset: 192)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "act_seq", scope: !628, file: !629, line: 206, baseType: !635, size: 64, offset: 320)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 64)
!636 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sequence", file: !629, line: 190, baseType: !637)
!637 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sequence", file: !629, line: 126, size: 2816, elements: !638)
!638 = !{!639, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !737, !738, !739, !740, !1018, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1046}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !637, file: !629, line: 127, baseType: !640, size: 64)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 64)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !637, file: !629, line: 127, baseType: !640, size: 64, offset: 64)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !637, file: !629, line: 128, baseType: !151, size: 64, offset: 128)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !637, file: !629, line: 129, baseType: !151, size: 64, offset: 192)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !637, file: !629, line: 130, baseType: !195, size: 512, offset: 256)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !637, file: !629, line: 132, baseType: !77, size: 32, offset: 768)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !637, file: !629, line: 132, baseType: !77, size: 32, offset: 800)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !637, file: !629, line: 133, baseType: !77, size: 32, offset: 832)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !637, file: !629, line: 134, baseType: !77, size: 32, offset: 864)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "startofs", scope: !637, file: !629, line: 134, baseType: !77, size: 32, offset: 896)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "endofs", scope: !637, file: !629, line: 134, baseType: !77, size: 32, offset: 928)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !637, file: !629, line: 135, baseType: !77, size: 32, offset: 960)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !637, file: !629, line: 135, baseType: !77, size: 32, offset: 992)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !637, file: !629, line: 136, baseType: !77, size: 32, offset: 1024)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !637, file: !629, line: 136, baseType: !77, size: 32, offset: 1056)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "startdisp", scope: !637, file: !629, line: 137, baseType: !77, size: 32, offset: 1088)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "enddisp", scope: !637, file: !629, line: 137, baseType: !77, size: 32, offset: 1120)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "sat", scope: !637, file: !629, line: 138, baseType: !67, size: 32, offset: 1152)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "mul", scope: !637, file: !629, line: 139, baseType: !67, size: 32, offset: 1184)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "handsize", scope: !637, file: !629, line: 139, baseType: !67, size: 32, offset: 1216)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "anim_preseek", scope: !637, file: !629, line: 141, baseType: !91, size: 16, offset: 1248)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "streamindex", scope: !637, file: !629, line: 142, baseType: !91, size: 16, offset: 1264)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "multicam_source", scope: !637, file: !629, line: 143, baseType: !77, size: 32, offset: 1280)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "clip_flag", scope: !637, file: !629, line: 144, baseType: !77, size: 32, offset: 1312)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "strip", scope: !637, file: !629, line: 146, baseType: !665, size: 64, offset: 1344)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 64)
!666 = !DIDerivedType(tag: DW_TAG_typedef, name: "Strip", file: !629, line: 114, baseType: !667)
!667 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Strip", file: !629, line: 99, size: 7232, elements: !668)
!668 = !{!669, !671, !672, !673, !674, !675, !676, !687, !691, !705, !714, !721, !731}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !667, file: !629, line: 100, baseType: !670, size: 64)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !667, file: !629, line: 100, baseType: !670, size: 64, offset: 64)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !667, file: !629, line: 101, baseType: !77, size: 32, offset: 128)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !667, file: !629, line: 101, baseType: !77, size: 32, offset: 160)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !667, file: !629, line: 102, baseType: !77, size: 32, offset: 192)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !667, file: !629, line: 102, baseType: !77, size: 32, offset: 224)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "stripdata", scope: !667, file: !629, line: 103, baseType: !677, size: 64, offset: 256)
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !678, size: 64)
!678 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripElem", file: !629, line: 59, baseType: !679)
!679 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripElem", file: !629, line: 56, size: 2112, elements: !680)
!680 = !{!681, !685, !686}
!681 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !679, file: !629, line: 57, baseType: !682, size: 2048)
!682 = !DICompositeType(tag: DW_TAG_array_type, baseType: !167, size: 2048, elements: !683)
!683 = !{!684}
!684 = !DISubrange(count: 256)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "orig_width", scope: !679, file: !629, line: 58, baseType: !77, size: 32, offset: 2048)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "orig_height", scope: !679, file: !629, line: 58, baseType: !77, size: 32, offset: 2080)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !667, file: !629, line: 106, baseType: !688, size: 6144, offset: 320)
!688 = !DICompositeType(tag: DW_TAG_array_type, baseType: !167, size: 6144, elements: !689)
!689 = !{!690}
!690 = !DISubrange(count: 768)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !667, file: !629, line: 107, baseType: !692, size: 64, offset: 6464)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64)
!693 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripProxy", file: !629, line: 97, baseType: !694)
!694 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripProxy", file: !629, line: 83, size: 8320, elements: !695)
!695 = !{!696, !697, !698, !701, !702, !703, !704}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !694, file: !629, line: 84, baseType: !688, size: 6144)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !694, file: !629, line: 87, baseType: !682, size: 2048, offset: 6144)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !694, file: !629, line: 88, baseType: !699, size: 64, offset: 8192)
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !700, size: 64)
!700 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !500, line: 41, flags: DIFlagFwdDecl)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !694, file: !629, line: 90, baseType: !91, size: 16, offset: 8256)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !694, file: !629, line: 92, baseType: !91, size: 16, offset: 8272)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flags", scope: !694, file: !629, line: 93, baseType: !91, size: 16, offset: 8288)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flags", scope: !694, file: !629, line: 95, baseType: !91, size: 16, offset: 8304)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !667, file: !629, line: 108, baseType: !706, size: 64, offset: 6528)
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 64)
!707 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripCrop", file: !629, line: 66, baseType: !708)
!708 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripCrop", file: !629, line: 61, size: 128, elements: !709)
!709 = !{!710, !711, !712, !713}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !708, file: !629, line: 62, baseType: !77, size: 32)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !708, file: !629, line: 63, baseType: !77, size: 32, offset: 32)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !708, file: !629, line: 64, baseType: !77, size: 32, offset: 64)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !708, file: !629, line: 65, baseType: !77, size: 32, offset: 96)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !667, file: !629, line: 109, baseType: !715, size: 64, offset: 6592)
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 64)
!716 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripTransform", file: !629, line: 71, baseType: !717)
!717 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripTransform", file: !629, line: 68, size: 64, elements: !718)
!718 = !{!719, !720}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "xofs", scope: !717, file: !629, line: 69, baseType: !77, size: 32)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "yofs", scope: !717, file: !629, line: 70, baseType: !77, size: 32, offset: 32)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "color_balance", scope: !667, file: !629, line: 110, baseType: !722, size: 64, offset: 6656)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 64)
!723 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripColorBalance", file: !629, line: 81, baseType: !724)
!724 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripColorBalance", file: !629, line: 73, size: 352, elements: !725)
!725 = !{!726, !727, !728, !729, !730}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "lift", scope: !724, file: !629, line: 74, baseType: !305, size: 96)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !724, file: !629, line: 75, baseType: !305, size: 96, offset: 96)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "gain", scope: !724, file: !629, line: 76, baseType: !305, size: 96, offset: 192)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !724, file: !629, line: 77, baseType: !77, size: 32, offset: 288)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !724, file: !629, line: 78, baseType: !77, size: 32, offset: 320)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !667, file: !629, line: 113, baseType: !732, size: 512, offset: 6720)
!732 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !733, line: 182, baseType: !734)
!733 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!734 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !733, line: 180, size: 512, elements: !735)
!735 = !{!736}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !734, file: !733, line: 181, baseType: !195, size: 512)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !637, file: !629, line: 148, baseType: !263, size: 64, offset: 1408)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !637, file: !629, line: 151, baseType: !232, size: 64, offset: 1472)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "scene_camera", scope: !637, file: !629, line: 152, baseType: !242, size: 64, offset: 1536)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "clip", scope: !637, file: !629, line: 153, baseType: !741, size: 64, offset: 1600)
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 64)
!742 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClip", file: !743, line: 64, size: 19136, elements: !744)
!743 = !DIFile(filename: "blender/source/blender/makesdna/DNA_movieclip_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!744 = !{!745, !746, !747, !748, !749, !750, !752, !753, !754, !755, !758, !759, !1004, !1005, !1013, !1014, !1015, !1016, !1017}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !742, file: !743, line: 65, baseType: !146, size: 960)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !742, file: !743, line: 66, baseType: !238, size: 64, offset: 960)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !742, file: !743, line: 68, baseType: !166, size: 8192, offset: 1024)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !742, file: !743, line: 70, baseType: !77, size: 32, offset: 9216)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !742, file: !743, line: 71, baseType: !77, size: 32, offset: 9248)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "lastsize", scope: !742, file: !743, line: 72, baseType: !751, size: 64, offset: 9280)
!751 = !DICompositeType(tag: DW_TAG_array_type, baseType: !77, size: 64, elements: !85)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !742, file: !743, line: 74, baseType: !67, size: 32, offset: 9344)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !742, file: !743, line: 74, baseType: !67, size: 32, offset: 9376)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !742, file: !743, line: 76, baseType: !699, size: 64, offset: 9408)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !742, file: !743, line: 77, baseType: !756, size: 64, offset: 9472)
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !757, size: 64)
!757 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipCache", file: !743, line: 77, flags: DIFlagFwdDecl)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !742, file: !743, line: 78, baseType: !336, size: 64, offset: 9536)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "tracking", scope: !742, file: !743, line: 80, baseType: !760, size: 2624, offset: 9600)
!760 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTracking", file: !761, line: 340, size: 2624, elements: !762)
!761 = !DIFile(filename: "blender/source/blender/makesdna/DNA_tracking_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!762 = !{!763, !791, !809, !810, !811, !826, !884, !885, !984, !985, !986, !987, !993}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "settings", scope: !760, file: !761, line: 341, baseType: !764, size: 576)
!764 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingSettings", file: !761, line: 251, baseType: !765)
!765 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingSettings", file: !761, line: 207, size: 576, elements: !766)
!766 = !{!767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790}
!767 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !765, file: !761, line: 208, baseType: !77, size: 32)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "default_motion_model", scope: !765, file: !761, line: 211, baseType: !91, size: 16, offset: 32)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "default_algorithm_flag", scope: !765, file: !761, line: 212, baseType: !91, size: 16, offset: 48)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "default_minimum_correlation", scope: !765, file: !761, line: 213, baseType: !67, size: 32, offset: 64)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_size", scope: !765, file: !761, line: 214, baseType: !91, size: 16, offset: 96)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "default_search_size", scope: !765, file: !761, line: 215, baseType: !91, size: 16, offset: 112)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "default_frames_limit", scope: !765, file: !761, line: 216, baseType: !91, size: 16, offset: 128)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "default_margin", scope: !765, file: !761, line: 217, baseType: !91, size: 16, offset: 144)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_match", scope: !765, file: !761, line: 218, baseType: !91, size: 16, offset: 160)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "default_flag", scope: !765, file: !761, line: 219, baseType: !91, size: 16, offset: 176)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "default_weight", scope: !765, file: !761, line: 220, baseType: !67, size: 32, offset: 192)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "motion_flag", scope: !765, file: !761, line: 222, baseType: !91, size: 16, offset: 224)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "speed", scope: !765, file: !761, line: 225, baseType: !91, size: 16, offset: 240)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe1", scope: !765, file: !761, line: 228, baseType: !77, size: 32, offset: 256)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe2", scope: !765, file: !761, line: 229, baseType: !77, size: 32, offset: 288)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction_flag", scope: !765, file: !761, line: 233, baseType: !77, size: 32, offset: 320)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "refine_camera_intrinsics", scope: !765, file: !761, line: 236, baseType: !91, size: 16, offset: 352)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !765, file: !761, line: 236, baseType: !91, size: 16, offset: 368)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !765, file: !761, line: 241, baseType: !67, size: 32, offset: 384)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "clean_frames", scope: !765, file: !761, line: 244, baseType: !77, size: 32, offset: 416)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "clean_action", scope: !765, file: !761, line: 244, baseType: !77, size: 32, offset: 448)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "clean_error", scope: !765, file: !761, line: 245, baseType: !67, size: 32, offset: 480)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "object_distance", scope: !765, file: !761, line: 248, baseType: !67, size: 32, offset: 512)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !765, file: !761, line: 250, baseType: !77, size: 32, offset: 544)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !760, file: !761, line: 342, baseType: !792, size: 448, offset: 576)
!792 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingCamera", file: !761, line: 79, baseType: !793)
!793 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingCamera", file: !761, line: 61, size: 448, elements: !794)
!794 = !{!795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808}
!795 = !DIDerivedType(tag: DW_TAG_member, name: "intrinsics", scope: !793, file: !761, line: 62, baseType: !151, size: 64)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_model", scope: !793, file: !761, line: 64, baseType: !91, size: 16, offset: 64)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !793, file: !761, line: 65, baseType: !91, size: 16, offset: 80)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "sensor_width", scope: !793, file: !761, line: 67, baseType: !67, size: 32, offset: 96)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_aspect", scope: !793, file: !761, line: 68, baseType: !67, size: 32, offset: 128)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "focal", scope: !793, file: !761, line: 69, baseType: !67, size: 32, offset: 160)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !793, file: !761, line: 70, baseType: !91, size: 16, offset: 192)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !793, file: !761, line: 71, baseType: !91, size: 16, offset: 208)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "principal", scope: !793, file: !761, line: 72, baseType: !84, size: 64, offset: 224)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "k1", scope: !793, file: !761, line: 75, baseType: !67, size: 32, offset: 288)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "k2", scope: !793, file: !761, line: 75, baseType: !67, size: 32, offset: 320)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "k3", scope: !793, file: !761, line: 75, baseType: !67, size: 32, offset: 352)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "division_k1", scope: !793, file: !761, line: 78, baseType: !67, size: 32, offset: 384)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "division_k2", scope: !793, file: !761, line: 78, baseType: !67, size: 32, offset: 416)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "tracks", scope: !760, file: !761, line: 343, baseType: !205, size: 128, offset: 1024)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "plane_tracks", scope: !760, file: !761, line: 344, baseType: !205, size: 128, offset: 1152)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction", scope: !760, file: !761, line: 345, baseType: !812, size: 192, offset: 1280)
!812 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingReconstruction", file: !761, line: 278, baseType: !813)
!813 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingReconstruction", file: !761, line: 270, size: 192, elements: !814)
!814 = !{!815, !816, !817, !818, !819}
!815 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !813, file: !761, line: 271, baseType: !77, size: 32)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !813, file: !761, line: 273, baseType: !67, size: 32, offset: 32)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "last_camera", scope: !813, file: !761, line: 275, baseType: !77, size: 32, offset: 64)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "camnr", scope: !813, file: !761, line: 276, baseType: !77, size: 32, offset: 96)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "cameras", scope: !813, file: !761, line: 277, baseType: !820, size: 64, offset: 128)
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !821, size: 64)
!821 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieReconstructedCamera", file: !761, line: 55, size: 576, elements: !822)
!822 = !{!823, !824, !825}
!823 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !821, file: !761, line: 56, baseType: !77, size: 32)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !821, file: !761, line: 57, baseType: !67, size: 32, offset: 32)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !821, file: !761, line: 58, baseType: !387, size: 512, offset: 64)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "stabilization", scope: !760, file: !761, line: 346, baseType: !827, size: 384, offset: 1472)
!827 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStabilization", file: !761, line: 268, baseType: !828)
!828 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStabilization", file: !761, line: 253, size: 384, elements: !829)
!829 = !{!830, !831, !832, !833, !834, !878, !879, !880, !881, !882, !883}
