; ModuleID = 'blender/source/blender/editors/space_console/space_console.c'
source_filename = "blender/source/blender/editors/space_console/space_console.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.SpaceType = type { %struct.SpaceType*, %struct.SpaceType*, [64 x i8], i32, i32, %struct.SpaceLink* (%struct.bContext*)*, void (%struct.SpaceLink*)*, void (%struct.wmWindowManager*, %struct.ScrArea*)*, void (%struct.wmWindowManager*, %struct.ScrArea*)*, void (%struct.bScreen*, %struct.ScrArea*, %struct.wmNotifier*)*, void (%struct.bContext*, %struct.ScrArea*)*, %struct.SpaceLink* (%struct.SpaceLink*)*, void ()*, void (%struct.wmKeyConfig*)*, void ()*, i32 (%struct.bContext*, i8*, %struct.bContextDataResult*)*, %struct.ListBase, %struct.ListBase, i32 }
%struct.SpaceLink = type { %struct.SpaceLink*, %struct.SpaceLink*, %struct.ListBase, i32, float, [8 x i16] }
%struct.bContext = type opaque
%struct.wmWindowManager = type { %struct.ID, %struct.wmWindow*, %struct.wmWindow*, %struct.ListBase, i32, i16, i16, %struct.ListBase, %struct.ListBase, %struct.ReportList, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.wmKeyConfig*, %struct.wmKeyConfig*, %struct.wmKeyConfig*, %struct.ListBase, %struct.wmTimer*, i8, [7 x i8] }
%struct.ID = type { i8*, i8*, %struct.ID*, %struct.Library*, [66 x i8], i16, i32, i32, i32, %struct.IDProperty* }

!449 = !DIEnumerator(name: "TH_FREESTYLE_FACE_MARK", value: 161, isUnsigned: true)
!450 = !DIEnumerator(name: "TH_MATCH", value: 162, isUnsigned: true)
!451 = !DIEnumerator(name: "TH_SELECT_HIGHLIGHT", value: 163, isUnsigned: true)
!452 = !DIEnumerator(name: "TH_SKIN_ROOT", value: 164, isUnsigned: true)
!453 = !DIEnumerator(name: "TH_ANIM_ACTIVE", value: 165, isUnsigned: true)
!454 = !DIEnumerator(name: "TH_ANIM_INACTIVE", value: 166, isUnsigned: true)
!455 = !DIEnumerator(name: "TH_NLA_TWEAK", value: 167, isUnsigned: true)
!456 = !DIEnumerator(name: "TH_NLA_TWEAK_DUPLI", value: 168, isUnsigned: true)
!457 = !DIEnumerator(name: "TH_NLA_TRANSITION", value: 169, isUnsigned: true)
!458 = !DIEnumerator(name: "TH_NLA_TRANSITION_SEL", value: 170, isUnsigned: true)
!459 = !DIEnumerator(name: "TH_NLA_META", value: 171, isUnsigned: true)
!460 = !DIEnumerator(name: "TH_NLA_META_SEL", value: 172, isUnsigned: true)
!461 = !DIEnumerator(name: "TH_NLA_SOUND", value: 173, isUnsigned: true)
!462 = !DIEnumerator(name: "TH_NLA_SOUND_SEL", value: 174, isUnsigned: true)
!463 = !DIEnumerator(name: "TH_EMBOSS", value: 175, isUnsigned: true)
!464 = !DIEnumerator(name: "TH_AXIS_X", value: 176, isUnsigned: true)
!465 = !DIEnumerator(name: "TH_AXIS_Y", value: 177, isUnsigned: true)
!466 = !DIEnumerator(name: "TH_AXIS_Z", value: 178, isUnsigned: true)
!467 = !DIEnumerator(name: "TH_LOW_GRAD", value: 179, isUnsigned: true)
!468 = !DIEnumerator(name: "TH_HIGH_GRAD", value: 180, isUnsigned: true)
!469 = !DIEnumerator(name: "TH_SHOW_BACK_GRAD", value: 181, isUnsigned: true)
!470 = !DIEnumerator(name: "TH_INFO_SELECTED", value: 182, isUnsigned: true)
!471 = !DIEnumerator(name: "TH_INFO_SELECTED_TEXT", value: 183, isUnsigned: true)
!472 = !DIEnumerator(name: "TH_INFO_ERROR", value: 184, isUnsigned: true)
!473 = !DIEnumerator(name: "TH_INFO_ERROR_TEXT", value: 185, isUnsigned: true)
!474 = !DIEnumerator(name: "TH_INFO_WARNING", value: 186, isUnsigned: true)
!475 = !DIEnumerator(name: "TH_INFO_WARNING_TEXT", value: 187, isUnsigned: true)
!476 = !DIEnumerator(name: "TH_INFO_INFO", value: 188, isUnsigned: true)
!477 = !DIEnumerator(name: "TH_INFO_INFO_TEXT", value: 189, isUnsigned: true)
!478 = !DIEnumerator(name: "TH_INFO_DEBUG", value: 190, isUnsigned: true)
!479 = !DIEnumerator(name: "TH_INFO_DEBUG_TEXT", value: 191, isUnsigned: true)
!480 = !DIEnumerator(name: "TH_VIEW_OVERLAY", value: 192, isUnsigned: true)
!481 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eView2D_Clamp", file: !261, line: 86, baseType: !5, size: 32, elements: !482)
!482 = !{!483, !484}
!483 = !DIEnumerator(name: "V2D_GRID_NOCLAMP", value: 0, isUnsigned: true)
!484 = !DIEnumerator(name: "V2D_GRID_CLAMP", value: 1, isUnsigned: true)
!485 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !486, line: 82, baseType: !5, size: 32, elements: !487)
!486 = !DIFile(filename: "blender/source/blender/windowmanager/wm_cursors.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!487 = !{!488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505}
!488 = !DIEnumerator(name: "BC_NW_ARROWCURSOR", value: 2, isUnsigned: true)
!489 = !DIEnumerator(name: "BC_NS_ARROWCURSOR", value: 3, isUnsigned: true)
!490 = !DIEnumerator(name: "BC_EW_ARROWCURSOR", value: 4, isUnsigned: true)
!491 = !DIEnumerator(name: "BC_WAITCURSOR", value: 5, isUnsigned: true)
!492 = !DIEnumerator(name: "BC_CROSSCURSOR", value: 6, isUnsigned: true)
!493 = !DIEnumerator(name: "BC_EDITCROSSCURSOR", value: 7, isUnsigned: true)
!494 = !DIEnumerator(name: "BC_BOXSELCURSOR", value: 8, isUnsigned: true)
!495 = !DIEnumerator(name: "BC_KNIFECURSOR", value: 9, isUnsigned: true)
!496 = !DIEnumerator(name: "BC_VLOOPCURSOR", value: 10, isUnsigned: true)
!497 = !DIEnumerator(name: "BC_TEXTEDITCURSOR", value: 11, isUnsigned: true)
!498 = !DIEnumerator(name: "BC_PAINTBRUSHCURSOR", value: 12, isUnsigned: true)
!499 = !DIEnumerator(name: "BC_HANDCURSOR", value: 13, isUnsigned: true)
!500 = !DIEnumerator(name: "BC_NSEW_SCROLLCURSOR", value: 14, isUnsigned: true)
!501 = !DIEnumerator(name: "BC_NS_SCROLLCURSOR", value: 15, isUnsigned: true)
!502 = !DIEnumerator(name: "BC_EW_SCROLLCURSOR", value: 16, isUnsigned: true)
!503 = !DIEnumerator(name: "BC_EYEDROPPER_CURSOR", value: 17, isUnsigned: true)
!504 = !DIEnumerator(name: "BC_SWAPAREA_CURSOR", value: 18, isUnsigned: true)
!505 = !DIEnumerator(name: "BC_NUMCURSORS", value: 19, isUnsigned: true)
!506 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !486, line: 43, baseType: !5, size: 32, elements: !507)
!507 = !{!508, !509, !510, !511, !512, !513, !514, !515, !516, !517}
!508 = !DIEnumerator(name: "CURSOR_FACESEL", value: 1000, isUnsigned: true)
!509 = !DIEnumerator(name: "CURSOR_WAIT", value: 1001, isUnsigned: true)
!510 = !DIEnumerator(name: "CURSOR_EDIT", value: 1002, isUnsigned: true)
!511 = !DIEnumerator(name: "CURSOR_X_MOVE", value: 1003, isUnsigned: true)
!512 = !DIEnumerator(name: "CURSOR_Y_MOVE", value: 1004, isUnsigned: true)
!513 = !DIEnumerator(name: "CURSOR_HELP", value: 1005, isUnsigned: true)
!514 = !DIEnumerator(name: "CURSOR_STD", value: 1006, isUnsigned: true)
!515 = !DIEnumerator(name: "CURSOR_NONE", value: 1007, isUnsigned: true)
!516 = !DIEnumerator(name: "CURSOR_PENCIL", value: 1008, isUnsigned: true)
!517 = !DIEnumerator(name: "CURSOR_COPY", value: 1009, isUnsigned: true)
!518 = !{!519, !542, !532, !567}
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!520 = !DIDerivedType(tag: DW_TAG_typedef, name: "SpaceLink", file: !4, line: 91, baseType: !521)
!521 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceLink", file: !4, line: 85, size: 448, elements: !522)
!522 = !{!523, !525, !526, !534, !535, !537}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !521, file: !4, line: 86, baseType: !524, size: 64)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 64)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !521, file: !4, line: 86, baseType: !524, size: 64, offset: 64)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !521, file: !4, line: 87, baseType: !527, size: 128, offset: 128)
!527 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !528, line: 71, baseType: !529)
!528 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!529 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !528, line: 69, size: 128, elements: !530)
!530 = !{!531, !533}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !529, file: !528, line: 70, baseType: !532, size: 64)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !529, file: !528, line: 70, baseType: !532, size: 64, offset: 64)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "spacetype", scope: !521, file: !4, line: 88, baseType: !262, size: 32, offset: 256)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "blockscale", scope: !521, file: !4, line: 89, baseType: !536, size: 32, offset: 288)
!536 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "blockhandler", scope: !521, file: !4, line: 90, baseType: !538, size: 128, offset: 320)
!538 = !DICompositeType(tag: DW_TAG_array_type, baseType: !539, size: 128, elements: !540)
!539 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!540 = !{!541}
!541 = !DISubrange(count: 8)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64)
!543 = !DIDerivedType(tag: DW_TAG_typedef, name: "SpaceConsole", file: !4, line: 1055, baseType: !544)
!544 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceConsole", file: !4, line: 1038, size: 3136, elements: !545)
!545 = !{!546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !561, !565, !566}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !544, file: !4, line: 1039, baseType: !519, size: 64)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !544, file: !4, line: 1039, baseType: !519, size: 64, offset: 64)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !544, file: !4, line: 1040, baseType: !527, size: 128, offset: 128)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "spacetype", scope: !544, file: !4, line: 1041, baseType: !262, size: 32, offset: 256)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "blockscale", scope: !544, file: !4, line: 1042, baseType: !536, size: 32, offset: 288)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "blockhandler", scope: !544, file: !4, line: 1043, baseType: !538, size: 128, offset: 320)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "lheight", scope: !544, file: !4, line: 1046, baseType: !262, size: 32, offset: 448)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !544, file: !4, line: 1046, baseType: !262, size: 32, offset: 480)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "scrollback", scope: !544, file: !4, line: 1048, baseType: !527, size: 128, offset: 512)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "history", scope: !544, file: !4, line: 1049, baseType: !527, size: 128, offset: 640)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "prompt", scope: !544, file: !4, line: 1050, baseType: !557, size: 2048, offset: 768)
!557 = !DICompositeType(tag: DW_TAG_array_type, baseType: !558, size: 2048, elements: !559)
!558 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!559 = !{!560}
!560 = !DISubrange(count: 256)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !544, file: !4, line: 1051, baseType: !562, size: 256, offset: 2816)
!562 = !DICompositeType(tag: DW_TAG_array_type, baseType: !558, size: 256, elements: !563)
!563 = !{!564}
!564 = !DISubrange(count: 32)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "sel_start", scope: !544, file: !4, line: 1053, baseType: !262, size: 32, offset: 3072)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "sel_end", scope: !544, file: !4, line: 1054, baseType: !262, size: 32, offset: 3104)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!568 = !DIDerivedType(tag: DW_TAG_typedef, name: "bContext", file: !569, line: 69, baseType: !570)
!569 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_context.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!570 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !571, line: 44, flags: DIFlagFwdDecl)
!571 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!572 = !{i32 7, !"Dwarf Version", i32 4}
!573 = !{i32 2, !"Debug Info Version", i32 3}
!574 = !{i32 1, !"wchar_size", i32 4}
!575 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!576 = distinct !DISubprogram(name: "ED_spacetype_console", scope: !1, file: !1, line: 388, type: !577, scopeLine: 389, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !579)
!577 = !DISubroutineType(types: !578)
!578 = !{null}
!579 = !{}
!580 = !DILocalVariable(name: "st", scope: !576, file: !1, line: 390, type: !581)
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64)
!582 = !DIDerivedType(tag: DW_TAG_typedef, name: "SpaceType", file: !583, line: 112, baseType: !584)
!583 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_screen.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!584 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceType", file: !583, line: 66, size: 1728, elements: !585)
!585 = !{!586, !588, !589, !593, !594, !595, !601, !605, !2076, !2077, !2094, !2098, !2102, !2104, !2108, !2109, !2115, !2116, !2117}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !584, file: !583, line: 67, baseType: !587, size: 64)
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !584, file: !583, line: 67, baseType: !587, size: 64, offset: 64)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !584, file: !583, line: 69, baseType: !590, size: 512, offset: 128)
!590 = !DICompositeType(tag: DW_TAG_array_type, baseType: !558, size: 512, elements: !591)
!591 = !{!592}
!592 = !DISubrange(count: 64)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "spaceid", scope: !584, file: !583, line: 70, baseType: !262, size: 32, offset: 640)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "iconid", scope: !584, file: !583, line: 71, baseType: !262, size: 32, offset: 672)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "new", scope: !584, file: !583, line: 74, baseType: !596, size: 64, offset: 704)
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 64)
!597 = !DISubroutineType(types: !598)
!598 = !{!524, !599}
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64)
!600 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !570)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !584, file: !583, line: 76, baseType: !602, size: 64, offset: 768)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64)
!603 = !DISubroutineType(types: !604)
!604 = !{null, !524}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !584, file: !583, line: 79, baseType: !606, size: 64, offset: 832)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!607 = !DISubroutineType(types: !608)
!608 = !{null, !609, !2032}
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 64)
!610 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindowManager", file: !611, line: 128, size: 2816, elements: !612)
!611 = !DIFile(filename: "blender/source/blender/makesdna/DNA_windowmanager_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!612 = !{!613, !672, !1995, !1996, !1997, !1998, !1999, !2000, !2001, !2002, !2011, !2012, !2013, !2014, !2015, !2026, !2027, !2028, !2029, !2030, !2031}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !610, file: !611, line: 129, baseType: !614, size: 960)
!614 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !615, line: 130, baseType: !616)
!615 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!616 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !615, line: 117, size: 960, elements: !617)
!617 = !{!618, !619, !620, !622, !641, !645, !646, !647, !648, !649}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !616, file: !615, line: 118, baseType: !532, size: 64)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !616, file: !615, line: 118, baseType: !532, size: 64, offset: 64)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !616, file: !615, line: 119, baseType: !621, size: 64, offset: 128)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 64)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !616, file: !615, line: 120, baseType: !623, size: 64, offset: 192)
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 64)
!624 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !615, line: 136, size: 17600, elements: !625)
!625 = !{!626, !627, !629, !632, !636, !637, !638}
!626 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !624, file: !615, line: 137, baseType: !614, size: 960)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !624, file: !615, line: 138, baseType: !628, size: 64, offset: 960)
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 64)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !624, file: !615, line: 139, baseType: !630, size: 64, offset: 1024)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64)
!631 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !615, line: 43, flags: DIFlagFwdDecl)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !624, file: !615, line: 140, baseType: !633, size: 8192, offset: 1088)
!633 = !DICompositeType(tag: DW_TAG_array_type, baseType: !558, size: 8192, elements: !634)
!634 = !{!635}
!635 = !DISubrange(count: 1024)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !624, file: !615, line: 141, baseType: !633, size: 8192, offset: 9280)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !624, file: !615, line: 148, baseType: !623, size: 64, offset: 17472)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !624, file: !615, line: 150, baseType: !639, size: 64, offset: 17536)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64)
!640 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !615, line: 45, flags: DIFlagFwdDecl)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !616, file: !615, line: 121, baseType: !642, size: 528, offset: 256)
!642 = !DICompositeType(tag: DW_TAG_array_type, baseType: !558, size: 528, elements: !643)
!643 = !{!644}
!644 = !DISubrange(count: 66)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !616, file: !615, line: 126, baseType: !539, size: 16, offset: 784)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !616, file: !615, line: 127, baseType: !262, size: 32, offset: 800)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !616, file: !615, line: 128, baseType: !262, size: 32, offset: 832)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !616, file: !615, line: 128, baseType: !262, size: 32, offset: 864)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !616, file: !615, line: 129, baseType: !650, size: 64, offset: 896)
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 64)
!651 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !615, line: 75, baseType: !652)
!652 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !615, line: 62, size: 1024, elements: !653)
!653 = !{!654, !656, !657, !658, !659, !660, !661, !662, !670, !671}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !652, file: !615, line: 63, baseType: !655, size: 64)
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !652, file: !615, line: 63, baseType: !655, size: 64, offset: 64)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !652, file: !615, line: 64, baseType: !558, size: 8, offset: 128)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !652, file: !615, line: 64, baseType: !558, size: 8, offset: 136)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !652, file: !615, line: 65, baseType: !539, size: 16, offset: 144)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !652, file: !615, line: 66, baseType: !590, size: 512, offset: 160)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !652, file: !615, line: 67, baseType: !262, size: 32, offset: 672)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !652, file: !615, line: 69, baseType: !663, size: 256, offset: 704)
!663 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !615, line: 60, baseType: !664)
!664 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !615, line: 48, size: 256, elements: !665)
!665 = !{!666, !667, !668, !669}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !664, file: !615, line: 49, baseType: !532, size: 64)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !664, file: !615, line: 58, baseType: !527, size: 128, offset: 64)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !664, file: !615, line: 59, baseType: !262, size: 32, offset: 192)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !664, file: !615, line: 59, baseType: !262, size: 32, offset: 224)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !652, file: !615, line: 70, baseType: !262, size: 32, offset: 960)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !652, file: !615, line: 74, baseType: !262, size: 32, offset: 992)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "windrawable", scope: !610, file: !611, line: 131, baseType: !673, size: 64, offset: 960)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64)
!674 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindow", file: !611, line: 169, size: 2048, elements: !675)
!675 = !{!676, !677, !678, !679, !1911, !1912, !1913, !1914, !1915, !1916, !1917, !1918, !1919, !1920, !1921, !1922, !1923, !1924, !1925, !1926, !1927, !1928, !1970, !1973, !1987, !1988, !1989, !1990, !1991, !1992, !1993, !1994}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !674, file: !611, line: 170, baseType: !673, size: 64)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !674, file: !611, line: 170, baseType: !673, size: 64, offset: 64)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "ghostwin", scope: !674, file: !611, line: 172, baseType: !532, size: 64, offset: 128)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !674, file: !611, line: 174, baseType: !680, size: 64, offset: 192)
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !681, size: 64)
!681 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !30, line: 49, size: 1984, elements: !682)
!682 = !{!683, !684, !685, !686, !687, !688, !1878, !1879, !1880, !1881, !1882, !1883, !1884, !1885, !1886, !1887, !1888, !1889, !1890, !1891, !1892, !1893, !1910}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !681, file: !30, line: 50, baseType: !614, size: 960)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "vertbase", scope: !681, file: !30, line: 52, baseType: !527, size: 128, offset: 960)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "edgebase", scope: !681, file: !30, line: 53, baseType: !527, size: 128, offset: 1088)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "areabase", scope: !681, file: !30, line: 54, baseType: !527, size: 128, offset: 1216)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !681, file: !30, line: 55, baseType: !527, size: 128, offset: 1344)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !681, file: !30, line: 57, baseType: !689, size: 64, offset: 1472)
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 64)
!690 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !691, line: 1216, size: 39680, elements: !692)
!691 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!692 = !{!693, !694, !698, !701, !704, !705, !706, !718, !719, !723, !724, !725, !726, !727, !728, !729, !730, !731, !735, !815, !1245, !1460, !1463, !1748, !1760, !1761, !1762, !1763, !1764, !1765, !1766, !1767, !1770, !1771, !1772, !1773, !1774, !1782, !1849, !1856, !1857, !1864, !1865, !1871, !1872, !1873, !1874, !1875}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !690, file: !691, line: 1217, baseType: !614, size: 960)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !690, file: !691, line: 1218, baseType: !695, size: 64, offset: 960)
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 64)
!696 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !697, line: 43, flags: DIFlagFwdDecl)
!697 = !DIFile(filename: "blender/source/blender/makesdna/DNA_movieclip_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!698 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !690, file: !691, line: 1220, baseType: !699, size: 64, offset: 1024)
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !700, size: 64)
!700 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !569, line: 44, flags: DIFlagFwdDecl)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !690, file: !691, line: 1221, baseType: !702, size: 64, offset: 1088)
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !703, size: 64)
!703 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !691, line: 52, flags: DIFlagFwdDecl)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !690, file: !691, line: 1223, baseType: !689, size: 64, offset: 1152)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !690, file: !691, line: 1225, baseType: !527, size: 128, offset: 1216)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !690, file: !691, line: 1226, baseType: !707, size: 64, offset: 1344)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 64)
!708 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !691, line: 69, size: 320, elements: !709)
!709 = !{!710, !711, !712, !713, !714, !715, !716, !717}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !708, file: !691, line: 70, baseType: !707, size: 64)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !708, file: !691, line: 70, baseType: !707, size: 64, offset: 64)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !708, file: !691, line: 71, baseType: !5, size: 32, offset: 128)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !708, file: !691, line: 71, baseType: !5, size: 32, offset: 160)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !708, file: !691, line: 72, baseType: !262, size: 32, offset: 192)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !708, file: !691, line: 73, baseType: !539, size: 16, offset: 224)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !708, file: !691, line: 73, baseType: !539, size: 16, offset: 240)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !708, file: !691, line: 74, baseType: !699, size: 64, offset: 256)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !690, file: !691, line: 1227, baseType: !699, size: 64, offset: 1408)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !690, file: !691, line: 1229, baseType: !720, size: 96, offset: 1472)
!720 = !DICompositeType(tag: DW_TAG_array_type, baseType: !536, size: 96, elements: !721)
!721 = !{!722}
!722 = !DISubrange(count: 3)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !690, file: !691, line: 1230, baseType: !720, size: 96, offset: 1568)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !690, file: !691, line: 1231, baseType: !720, size: 96, offset: 1664)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !690, file: !691, line: 1231, baseType: !720, size: 96, offset: 1760)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !690, file: !691, line: 1233, baseType: !5, size: 32, offset: 1856)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !690, file: !691, line: 1234, baseType: !262, size: 32, offset: 1888)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !690, file: !691, line: 1235, baseType: !5, size: 32, offset: 1920)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !690, file: !691, line: 1237, baseType: !539, size: 16, offset: 1952)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !690, file: !691, line: 1239, baseType: !558, size: 8, offset: 1968)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !690, file: !691, line: 1240, baseType: !732, size: 8, offset: 1976)
!732 = !DICompositeType(tag: DW_TAG_array_type, baseType: !558, size: 8, elements: !733)
!733 = !{!734}
!734 = !DISubrange(count: 1)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !690, file: !691, line: 1242, baseType: !736, size: 64, offset: 1984)
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !737, size: 64)
!737 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !738, line: 328, size: 3456, elements: !739)
!738 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!739 = !{!740, !741, !742, !745, !746, !749, !753, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !780, !781, !782, !785, !790, !791, !794, !798, !803, !807, !811, !812, !813, !814}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !737, file: !738, line: 329, baseType: !614, size: 960)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !737, file: !738, line: 330, baseType: !695, size: 64, offset: 960)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !737, file: !738, line: 332, baseType: !743, size: 64, offset: 1024)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64)
!744 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !738, line: 332, flags: DIFlagFwdDecl)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !737, file: !738, line: 333, baseType: !590, size: 512, offset: 1088)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "interface_type", scope: !737, file: !738, line: 335, baseType: !747, size: 64, offset: 1600)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64)
!748 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !571, line: 41, flags: DIFlagFwdDecl)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !737, file: !738, line: 337, baseType: !750, size: 64, offset: 1664)
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !751, size: 64)
!751 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !752, line: 45, flags: DIFlagFwdDecl)
!752 = !DIFile(filename: "blender/source/blender/makesdna/DNA_tracking_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!753 = !DIDerivedType(tag: DW_TAG_member, name: "view_center", scope: !737, file: !738, line: 338, baseType: !754, size: 64, offset: 1728)
!754 = !DICompositeType(tag: DW_TAG_array_type, baseType: !536, size: 64, elements: !755)
!755 = !{!756}
!756 = !DISubrange(count: 2)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !737, file: !738, line: 340, baseType: !527, size: 128, offset: 1792)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !737, file: !738, line: 340, baseType: !527, size: 128, offset: 1920)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !737, file: !738, line: 342, baseType: !262, size: 32, offset: 2048)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !737, file: !738, line: 342, baseType: !262, size: 32, offset: 2080)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "cur_index", scope: !737, file: !738, line: 343, baseType: !262, size: 32, offset: 2112)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !737, file: !738, line: 345, baseType: !262, size: 32, offset: 2144)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !737, file: !738, line: 346, baseType: !262, size: 32, offset: 2176)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "is_updating", scope: !737, file: !738, line: 347, baseType: !539, size: 16, offset: 2208)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !737, file: !738, line: 348, baseType: !539, size: 16, offset: 2224)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !737, file: !738, line: 349, baseType: !262, size: 32, offset: 2240)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "nodetype", scope: !737, file: !738, line: 351, baseType: !262, size: 32, offset: 2272)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "edit_quality", scope: !737, file: !738, line: 353, baseType: !539, size: 16, offset: 2304)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "render_quality", scope: !737, file: !738, line: 354, baseType: !539, size: 16, offset: 2320)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "chunksize", scope: !737, file: !738, line: 355, baseType: !262, size: 32, offset: 2336)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "viewer_border", scope: !737, file: !738, line: 357, baseType: !772, size: 128, offset: 2368)
!772 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !773, line: 95, baseType: !774)
!773 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!774 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !773, line: 92, size: 128, elements: !775)
!775 = !{!776, !777, !778, !779}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !774, file: !773, line: 93, baseType: !536, size: 32)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !774, file: !773, line: 93, baseType: !536, size: 32, offset: 32)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !774, file: !773, line: 94, baseType: !536, size: 32, offset: 64)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !774, file: !773, line: 94, baseType: !536, size: 32, offset: 96)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !737, file: !738, line: 363, baseType: !527, size: 128, offset: 2496)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !737, file: !738, line: 363, baseType: !527, size: 128, offset: 2624)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "previews", scope: !737, file: !738, line: 368, baseType: !783, size: 64, offset: 2752)
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !784, size: 64)
!784 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHash", file: !738, line: 48, flags: DIFlagFwdDecl)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "active_viewer_key", scope: !737, file: !738, line: 372, baseType: !786, size: 32, offset: 2816)
!786 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !738, line: 274, baseType: !787)
!787 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !738, line: 271, size: 32, elements: !788)
!788 = !{!789}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !787, file: !738, line: 273, baseType: !5, size: 32)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !737, file: !738, line: 373, baseType: !262, size: 32, offset: 2848)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "execdata", scope: !737, file: !738, line: 382, baseType: !792, size: 64, offset: 2880)
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !793, size: 64)
!793 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeExec", file: !738, line: 46, flags: DIFlagFwdDecl)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !737, file: !738, line: 385, baseType: !795, size: 64, offset: 2944)
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 64)
!796 = !DISubroutineType(types: !797)
!797 = !{null, !532, !536}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "stats_draw", scope: !737, file: !738, line: 386, baseType: !799, size: 64, offset: 3008)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 64)
!800 = !DISubroutineType(types: !801)
!801 = !{null, !532, !802}
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "test_break", scope: !737, file: !738, line: 387, baseType: !804, size: 64, offset: 3072)
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 64)
!805 = !DISubroutineType(types: !806)
!806 = !{!262, !532}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "update_draw", scope: !737, file: !738, line: 388, baseType: !808, size: 64, offset: 3136)
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !809, size: 64)
!809 = !DISubroutineType(types: !810)
!810 = !{null, !532}
!811 = !DIDerivedType(tag: DW_TAG_member, name: "tbh", scope: !737, file: !738, line: 389, baseType: !532, size: 64, offset: 3200)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "prh", scope: !737, file: !738, line: 389, baseType: !532, size: 64, offset: 3264)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "sdh", scope: !737, file: !738, line: 389, baseType: !532, size: 64, offset: 3328)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "udh", scope: !737, file: !738, line: 389, baseType: !532, size: 64, offset: 3392)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !690, file: !691, line: 1244, baseType: !816, size: 64, offset: 2048)
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 64)
!817 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !818, line: 200, size: 17024, elements: !819)
!818 = !DIFile(filename: "blender/source/blender/makesdna/DNA_sequence_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!819 = !{!820, !822, !823, !824, !1238, !1239, !1240, !1241, !1242, !1243, !1244}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "seqbasep", scope: !817, file: !818, line: 201, baseType: !821, size: 64)
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !817, file: !818, line: 202, baseType: !527, size: 128, offset: 64)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "metastack", scope: !817, file: !818, line: 203, baseType: !527, size: 128, offset: 192)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "act_seq", scope: !817, file: !818, line: 206, baseType: !825, size: 64, offset: 320)
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !826, size: 64)
!826 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sequence", file: !818, line: 190, baseType: !827)
!827 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sequence", file: !818, line: 126, size: 2816, elements: !828)
!828 = !{!829, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !925, !928, !929, !930, !1210, !1213, !1214, !1215, !1216, !1217, !1218, !1219, !1220, !1223, !1224, !1225, !1226, !1227, !1228, !1229, !1230, !1231, !1232, !1233, !1234, !1235, !1237}
!829 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !827, file: !818, line: 127, baseType: !830, size: 64)
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !827, size: 64)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !827, file: !818, line: 127, baseType: !830, size: 64, offset: 64)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !827, file: !818, line: 128, baseType: !532, size: 64, offset: 128)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !827, file: !818, line: 129, baseType: !532, size: 64, offset: 192)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !827, file: !818, line: 130, baseType: !590, size: 512, offset: 256)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !827, file: !818, line: 132, baseType: !262, size: 32, offset: 768)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !827, file: !818, line: 132, baseType: !262, size: 32, offset: 800)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !827, file: !818, line: 133, baseType: !262, size: 32, offset: 832)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !827, file: !818, line: 134, baseType: !262, size: 32, offset: 864)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "startofs", scope: !827, file: !818, line: 134, baseType: !262, size: 32, offset: 896)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "endofs", scope: !827, file: !818, line: 134, baseType: !262, size: 32, offset: 928)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !827, file: !818, line: 135, baseType: !262, size: 32, offset: 960)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !827, file: !818, line: 135, baseType: !262, size: 32, offset: 992)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !827, file: !818, line: 136, baseType: !262, size: 32, offset: 1024)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !827, file: !818, line: 136, baseType: !262, size: 32, offset: 1056)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "startdisp", scope: !827, file: !818, line: 137, baseType: !262, size: 32, offset: 1088)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "enddisp", scope: !827, file: !818, line: 137, baseType: !262, size: 32, offset: 1120)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "sat", scope: !827, file: !818, line: 138, baseType: !536, size: 32, offset: 1152)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "mul", scope: !827, file: !818, line: 139, baseType: !536, size: 32, offset: 1184)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "handsize", scope: !827, file: !818, line: 139, baseType: !536, size: 32, offset: 1216)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "anim_preseek", scope: !827, file: !818, line: 141, baseType: !539, size: 16, offset: 1248)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "streamindex", scope: !827, file: !818, line: 142, baseType: !539, size: 16, offset: 1264)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "multicam_source", scope: !827, file: !818, line: 143, baseType: !262, size: 32, offset: 1280)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "clip_flag", scope: !827, file: !818, line: 144, baseType: !262, size: 32, offset: 1312)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "strip", scope: !827, file: !818, line: 146, baseType: !855, size: 64, offset: 1344)
!855 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !856, size: 64)
!856 = !DIDerivedType(tag: DW_TAG_typedef, name: "Strip", file: !818, line: 114, baseType: !857)
!857 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Strip", file: !818, line: 99, size: 7232, elements: !858)
!858 = !{!859, !861, !862, !863, !864, !865, !866, !874, !878, !893, !902, !909, !919}
!859 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !857, file: !818, line: 100, baseType: !860, size: 64)
!860 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !857, size: 64)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !857, file: !818, line: 100, baseType: !860, size: 64, offset: 64)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !857, file: !818, line: 101, baseType: !262, size: 32, offset: 128)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !857, file: !818, line: 101, baseType: !262, size: 32, offset: 160)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !857, file: !818, line: 102, baseType: !262, size: 32, offset: 192)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !857, file: !818, line: 102, baseType: !262, size: 32, offset: 224)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "stripdata", scope: !857, file: !818, line: 103, baseType: !867, size: 64, offset: 256)
!867 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !868, size: 64)
!868 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripElem", file: !818, line: 59, baseType: !869)
!869 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripElem", file: !818, line: 56, size: 2112, elements: !870)
!870 = !{!871, !872, !873}
!871 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !869, file: !818, line: 57, baseType: !557, size: 2048)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "orig_width", scope: !869, file: !818, line: 58, baseType: !262, size: 32, offset: 2048)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "orig_height", scope: !869, file: !818, line: 58, baseType: !262, size: 32, offset: 2080)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !857, file: !818, line: 106, baseType: !875, size: 6144, offset: 320)
!875 = !DICompositeType(tag: DW_TAG_array_type, baseType: !558, size: 6144, elements: !876)
!876 = !{!877}
!877 = !DISubrange(count: 768)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !857, file: !818, line: 107, baseType: !879, size: 64, offset: 6464)
!879 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !880, size: 64)
!880 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripProxy", file: !818, line: 97, baseType: !881)
!881 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripProxy", file: !818, line: 83, size: 8320, elements: !882)
!882 = !{!883, !884, !885, !889, !890, !891, !892}
!883 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !881, file: !818, line: 84, baseType: !875, size: 6144)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !881, file: !818, line: 87, baseType: !557, size: 2048, offset: 6144)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !881, file: !818, line: 88, baseType: !886, size: 64, offset: 8192)
!886 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !887, size: 64)
!887 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !888, line: 41, flags: DIFlagFwdDecl)
!888 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!889 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !881, file: !818, line: 90, baseType: !539, size: 16, offset: 8256)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !881, file: !818, line: 92, baseType: !539, size: 16, offset: 8272)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flags", scope: !881, file: !818, line: 93, baseType: !539, size: 16, offset: 8288)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flags", scope: !881, file: !818, line: 95, baseType: !539, size: 16, offset: 8304)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !857, file: !818, line: 108, baseType: !894, size: 64, offset: 6528)
!894 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !895, size: 64)
!895 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripCrop", file: !818, line: 66, baseType: !896)
!896 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripCrop", file: !818, line: 61, size: 128, elements: !897)
!897 = !{!898, !899, !900, !901}
!898 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !896, file: !818, line: 62, baseType: !262, size: 32)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !896, file: !818, line: 63, baseType: !262, size: 32, offset: 32)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !896, file: !818, line: 64, baseType: !262, size: 32, offset: 64)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !896, file: !818, line: 65, baseType: !262, size: 32, offset: 96)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !857, file: !818, line: 109, baseType: !903, size: 64, offset: 6592)
!903 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !904, size: 64)
!904 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripTransform", file: !818, line: 71, baseType: !905)
!905 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripTransform", file: !818, line: 68, size: 64, elements: !906)
!906 = !{!907, !908}
!907 = !DIDerivedType(tag: DW_TAG_member, name: "xofs", scope: !905, file: !818, line: 69, baseType: !262, size: 32)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "yofs", scope: !905, file: !818, line: 70, baseType: !262, size: 32, offset: 32)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "color_balance", scope: !857, file: !818, line: 110, baseType: !910, size: 64, offset: 6656)
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !911, size: 64)
!911 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripColorBalance", file: !818, line: 81, baseType: !912)
!912 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripColorBalance", file: !818, line: 73, size: 352, elements: !913)
!913 = !{!914, !915, !916, !917, !918}
!914 = !DIDerivedType(tag: DW_TAG_member, name: "lift", scope: !912, file: !818, line: 74, baseType: !720, size: 96)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !912, file: !818, line: 75, baseType: !720, size: 96, offset: 96)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "gain", scope: !912, file: !818, line: 76, baseType: !720, size: 96, offset: 192)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !912, file: !818, line: 77, baseType: !262, size: 32, offset: 288)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !912, file: !818, line: 78, baseType: !262, size: 32, offset: 320)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !857, file: !818, line: 113, baseType: !920, size: 512, offset: 6720)
!920 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !921, line: 182, baseType: !922)
!921 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!922 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !921, line: 180, size: 512, elements: !923)
!923 = !{!924}
!924 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !922, file: !921, line: 181, baseType: !590, size: 512)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !827, file: !818, line: 148, baseType: !926, size: 64, offset: 1408)
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 64)
!927 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !818, line: 49, flags: DIFlagFwdDecl)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !827, file: !818, line: 151, baseType: !689, size: 64, offset: 1472)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "scene_camera", scope: !827, file: !818, line: 152, baseType: !699, size: 64, offset: 1536)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "clip", scope: !827, file: !818, line: 153, baseType: !931, size: 64, offset: 1600)
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 64)
!932 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClip", file: !697, line: 64, size: 19136, elements: !933)
!933 = !{!934, !935, !936, !937, !938, !939, !941, !942, !943, !944, !947, !948, !1196, !1197, !1205, !1206, !1207, !1208, !1209}
!934 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !932, file: !697, line: 65, baseType: !614, size: 960)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !932, file: !697, line: 66, baseType: !695, size: 64, offset: 960)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !932, file: !697, line: 68, baseType: !633, size: 8192, offset: 1024)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !932, file: !697, line: 70, baseType: !262, size: 32, offset: 9216)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !932, file: !697, line: 71, baseType: !262, size: 32, offset: 9248)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "lastsize", scope: !932, file: !697, line: 72, baseType: !940, size: 64, offset: 9280)
!940 = !DICompositeType(tag: DW_TAG_array_type, baseType: !262, size: 64, elements: !755)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !932, file: !697, line: 74, baseType: !536, size: 32, offset: 9344)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !932, file: !697, line: 74, baseType: !536, size: 32, offset: 9376)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !932, file: !697, line: 76, baseType: !886, size: 64, offset: 9408)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !932, file: !697, line: 77, baseType: !945, size: 64, offset: 9472)
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64)
!946 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipCache", file: !697, line: 77, flags: DIFlagFwdDecl)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !932, file: !697, line: 78, baseType: !750, size: 64, offset: 9536)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "tracking", scope: !932, file: !697, line: 80, baseType: !949, size: 2624, offset: 9600)
!949 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTracking", file: !752, line: 340, size: 2624, elements: !950)
!950 = !{!951, !979, !997, !998, !999, !1017, !1075, !1076, !1176, !1177, !1178, !1179, !1185}
!951 = !DIDerivedType(tag: DW_TAG_member, name: "settings", scope: !949, file: !752, line: 341, baseType: !952, size: 576)
!952 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingSettings", file: !752, line: 251, baseType: !953)
!953 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingSettings", file: !752, line: 207, size: 576, elements: !954)
!954 = !{!955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978}
!955 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !953, file: !752, line: 208, baseType: !262, size: 32)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "default_motion_model", scope: !953, file: !752, line: 211, baseType: !539, size: 16, offset: 32)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "default_algorithm_flag", scope: !953, file: !752, line: 212, baseType: !539, size: 16, offset: 48)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "default_minimum_correlation", scope: !953, file: !752, line: 213, baseType: !536, size: 32, offset: 64)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_size", scope: !953, file: !752, line: 214, baseType: !539, size: 16, offset: 96)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "default_search_size", scope: !953, file: !752, line: 215, baseType: !539, size: 16, offset: 112)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "default_frames_limit", scope: !953, file: !752, line: 216, baseType: !539, size: 16, offset: 128)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "default_margin", scope: !953, file: !752, line: 217, baseType: !539, size: 16, offset: 144)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_match", scope: !953, file: !752, line: 218, baseType: !539, size: 16, offset: 160)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "default_flag", scope: !953, file: !752, line: 219, baseType: !539, size: 16, offset: 176)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "default_weight", scope: !953, file: !752, line: 220, baseType: !536, size: 32, offset: 192)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "motion_flag", scope: !953, file: !752, line: 222, baseType: !539, size: 16, offset: 224)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "speed", scope: !953, file: !752, line: 225, baseType: !539, size: 16, offset: 240)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe1", scope: !953, file: !752, line: 228, baseType: !262, size: 32, offset: 256)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe2", scope: !953, file: !752, line: 229, baseType: !262, size: 32, offset: 288)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction_flag", scope: !953, file: !752, line: 233, baseType: !262, size: 32, offset: 320)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "refine_camera_intrinsics", scope: !953, file: !752, line: 236, baseType: !539, size: 16, offset: 352)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !953, file: !752, line: 236, baseType: !539, size: 16, offset: 368)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !953, file: !752, line: 241, baseType: !536, size: 32, offset: 384)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "clean_frames", scope: !953, file: !752, line: 244, baseType: !262, size: 32, offset: 416)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "clean_action", scope: !953, file: !752, line: 244, baseType: !262, size: 32, offset: 448)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "clean_error", scope: !953, file: !752, line: 245, baseType: !536, size: 32, offset: 480)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "object_distance", scope: !953, file: !752, line: 248, baseType: !536, size: 32, offset: 512)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !953, file: !752, line: 250, baseType: !262, size: 32, offset: 544)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !949, file: !752, line: 342, baseType: !980, size: 448, offset: 576)
!980 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingCamera", file: !752, line: 79, baseType: !981)
!981 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingCamera", file: !752, line: 61, size: 448, elements: !982)
!982 = !{!983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996}
!983 = !DIDerivedType(tag: DW_TAG_member, name: "intrinsics", scope: !981, file: !752, line: 62, baseType: !532, size: 64)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_model", scope: !981, file: !752, line: 64, baseType: !539, size: 16, offset: 64)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !981, file: !752, line: 65, baseType: !539, size: 16, offset: 80)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "sensor_width", scope: !981, file: !752, line: 67, baseType: !536, size: 32, offset: 96)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_aspect", scope: !981, file: !752, line: 68, baseType: !536, size: 32, offset: 128)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "focal", scope: !981, file: !752, line: 69, baseType: !536, size: 32, offset: 160)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !981, file: !752, line: 70, baseType: !539, size: 16, offset: 192)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !981, file: !752, line: 71, baseType: !539, size: 16, offset: 208)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "principal", scope: !981, file: !752, line: 72, baseType: !754, size: 64, offset: 224)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "k1", scope: !981, file: !752, line: 75, baseType: !536, size: 32, offset: 288)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "k2", scope: !981, file: !752, line: 75, baseType: !536, size: 32, offset: 320)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "k3", scope: !981, file: !752, line: 75, baseType: !536, size: 32, offset: 352)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "division_k1", scope: !981, file: !752, line: 78, baseType: !536, size: 32, offset: 384)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "division_k2", scope: !981, file: !752, line: 78, baseType: !536, size: 32, offset: 416)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "tracks", scope: !949, file: !752, line: 343, baseType: !527, size: 128, offset: 1024)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "plane_tracks", scope: !949, file: !752, line: 344, baseType: !527, size: 128, offset: 1152)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction", scope: !949, file: !752, line: 345, baseType: !1000, size: 192, offset: 1280)
!1000 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingReconstruction", file: !752, line: 278, baseType: !1001)
!1001 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingReconstruction", file: !752, line: 270, size: 192, elements: !1002)
!1002 = !{!1003, !1004, !1005, !1006, !1007}
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1001, file: !752, line: 271, baseType: !262, size: 32)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1001, file: !752, line: 273, baseType: !536, size: 32, offset: 32)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "last_camera", scope: !1001, file: !752, line: 275, baseType: !262, size: 32, offset: 64)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "camnr", scope: !1001, file: !752, line: 276, baseType: !262, size: 32, offset: 96)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "cameras", scope: !1001, file: !752, line: 277, baseType: !1008, size: 64, offset: 128)
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 64)
!1009 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieReconstructedCamera", file: !752, line: 55, size: 576, elements: !1010)
!1010 = !{!1011, !1012, !1013}
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !1009, file: !752, line: 56, baseType: !262, size: 32)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1009, file: !752, line: 57, baseType: !536, size: 32, offset: 32)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !1009, file: !752, line: 58, baseType: !1014, size: 512, offset: 64)
!1014 = !DICompositeType(tag: DW_TAG_array_type, baseType: !536, size: 512, elements: !1015)
!1015 = !{!1016, !1016}
!1016 = !DISubrange(count: 4)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "stabilization", scope: !949, file: !752, line: 346, baseType: !1018, size: 384, offset: 1472)
!1018 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStabilization", file: !752, line: 268, baseType: !1019)
!1019 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStabilization", file: !752, line: 253, size: 384, elements: !1020)
!1020 = !{!1021, !1022, !1023, !1024, !1025, !1069, !1070, !1071, !1072, !1073, !1074}
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1019, file: !752, line: 254, baseType: !262, size: 32)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "tot_track", scope: !1019, file: !752, line: 255, baseType: !262, size: 32, offset: 32)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !1019, file: !752, line: 255, baseType: !262, size: 32, offset: 64)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "maxscale", scope: !1019, file: !752, line: 258, baseType: !536, size: 32, offset: 96)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "rot_track", scope: !1019, file: !752, line: 259, baseType: !1026, size: 64, offset: 128)
!1026 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1027, size: 64)
!1027 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingTrack", file: !752, line: 164, baseType: !1028)
!1028 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingTrack", file: !752, line: 108, size: 1664, elements: !1029)
!1029 = !{!1030, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068}
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1028, file: !752, line: 109, baseType: !1031, size: 64)
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1028, size: 64)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1028, file: !752, line: 109, baseType: !1031, size: 64, offset: 64)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1028, file: !752, line: 111, baseType: !590, size: 512, offset: 128)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "pat_min", scope: !1028, file: !752, line: 119, baseType: !754, size: 64, offset: 640)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "pat_max", scope: !1028, file: !752, line: 119, baseType: !754, size: 64, offset: 704)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !1028, file: !752, line: 125, baseType: !754, size: 64, offset: 768)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !1028, file: !752, line: 125, baseType: !754, size: 64, offset: 832)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1028, file: !752, line: 127, baseType: !754, size: 64, offset: 896)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !1028, file: !752, line: 130, baseType: !262, size: 32, offset: 960)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !1028, file: !752, line: 131, baseType: !262, size: 32, offset: 992)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !1028, file: !752, line: 132, baseType: !1042, size: 64, offset: 1024)
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1043, size: 64)
!1043 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingMarker", file: !752, line: 106, baseType: !1044)
!1044 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingMarker", file: !752, line: 81, size: 512, elements: !1045)
!1045 = !{!1046, !1047, !1050, !1051, !1052, !1053}
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1044, file: !752, line: 82, baseType: !754, size: 64)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_corners", scope: !1044, file: !752, line: 97, baseType: !1048, size: 256, offset: 64)
!1048 = !DICompositeType(tag: DW_TAG_array_type, baseType: !536, size: 256, elements: !1049)
!1049 = !{!1016, !756}
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !1044, file: !752, line: 102, baseType: !754, size: 64, offset: 320)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !1044, file: !752, line: 102, baseType: !754, size: 64, offset: 384)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !1044, file: !752, line: 104, baseType: !262, size: 32, offset: 448)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1044, file: !752, line: 105, baseType: !262, size: 32, offset: 480)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "bundle_pos", scope: !1028, file: !752, line: 135, baseType: !720, size: 96, offset: 1088)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1028, file: !752, line: 136, baseType: !536, size: 32, offset: 1184)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1028, file: !752, line: 139, baseType: !262, size: 32, offset: 1216)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "pat_flag", scope: !1028, file: !752, line: 139, baseType: !262, size: 32, offset: 1248)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "search_flag", scope: !1028, file: !752, line: 139, baseType: !262, size: 32, offset: 1280)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !1028, file: !752, line: 140, baseType: !720, size: 96, offset: 1312)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "frames_limit", scope: !1028, file: !752, line: 143, baseType: !539, size: 16, offset: 1408)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !1028, file: !752, line: 144, baseType: !539, size: 16, offset: 1424)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_match", scope: !1028, file: !752, line: 145, baseType: !539, size: 16, offset: 1440)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "motion_model", scope: !1028, file: !752, line: 148, baseType: !539, size: 16, offset: 1456)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm_flag", scope: !1028, file: !752, line: 149, baseType: !262, size: 32, offset: 1472)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "minimum_correlation", scope: !1028, file: !752, line: 150, baseType: !536, size: 32, offset: 1504)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !1028, file: !752, line: 152, baseType: !750, size: 64, offset: 1536)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !1028, file: !752, line: 163, baseType: !536, size: 32, offset: 1600)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1028, file: !752, line: 163, baseType: !536, size: 32, offset: 1632)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "locinf", scope: !1019, file: !752, line: 261, baseType: !536, size: 32, offset: 192)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "scaleinf", scope: !1019, file: !752, line: 261, baseType: !536, size: 32, offset: 224)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "rotinf", scope: !1019, file: !752, line: 261, baseType: !536, size: 32, offset: 256)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1019, file: !752, line: 263, baseType: !262, size: 32, offset: 288)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !1019, file: !752, line: 266, baseType: !262, size: 32, offset: 320)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !1019, file: !752, line: 267, baseType: !536, size: 32, offset: 352)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !949, file: !752, line: 347, baseType: !1026, size: 64, offset: 1856)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "act_plane_track", scope: !949, file: !752, line: 348, baseType: !1077, size: 64, offset: 1920)
!1077 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1078, size: 64)
!1078 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingPlaneTrack", file: !752, line: 205, baseType: !1079)
!1079 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingPlaneTrack", file: !752, line: 186, size: 1024, elements: !1080)
!1080 = !{!1081, !1083, !1084, !1085, !1087, !1088, !1089, !1097, !1098, !1099, !1174, !1175}
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1079, file: !752, line: 187, baseType: !1082, size: 64)
!1082 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1079, size: 64)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1079, file: !752, line: 187, baseType: !1082, size: 64, offset: 64)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1079, file: !752, line: 189, baseType: !590, size: 512, offset: 128)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "point_tracks", scope: !1079, file: !752, line: 191, baseType: !1086, size: 64, offset: 640)
!1086 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1026, size: 64)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "point_tracksnr", scope: !1079, file: !752, line: 193, baseType: !262, size: 32, offset: 704)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1079, file: !752, line: 193, baseType: !262, size: 32, offset: 736)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !1079, file: !752, line: 195, baseType: !1090, size: 64, offset: 768)
!1090 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1091, size: 64)
!1091 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingPlaneMarker", file: !752, line: 184, baseType: !1092)
!1092 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingPlaneMarker", file: !752, line: 166, size: 320, elements: !1093)
!1093 = !{!1094, !1095, !1096}
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "corners", scope: !1092, file: !752, line: 180, baseType: !1048, size: 256)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !1092, file: !752, line: 182, baseType: !262, size: 32, offset: 256)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1092, file: !752, line: 183, baseType: !262, size: 32, offset: 288)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !1079, file: !752, line: 196, baseType: !262, size: 32, offset: 832)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1079, file: !752, line: 198, baseType: !262, size: 32, offset: 864)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "image", scope: !1079, file: !752, line: 200, baseType: !1100, size: 64, offset: 896)
!1100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1101, size: 64)
!1101 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !888, line: 77, size: 15424, elements: !1102)
!1102 = !{!1103, !1104, !1105, !1108, !1111, !1112, !1115, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1133, !1134, !1148, !1149, !1150, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1160, !1161, !1162, !1163, !1164, !1168}
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1101, file: !888, line: 78, baseType: !614, size: 960)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1101, file: !888, line: 80, baseType: !633, size: 8192, offset: 960)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !1101, file: !888, line: 82, baseType: !1106, size: 64, offset: 9152)
!1106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1107, size: 64)
!1107 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !888, line: 43, flags: DIFlagFwdDecl)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !1101, file: !888, line: 83, baseType: !1109, size: 64, offset: 9216)
!1109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1110, size: 64)
!1110 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !615, line: 46, flags: DIFlagFwdDecl)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !1101, file: !888, line: 86, baseType: !886, size: 64, offset: 9280)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !1101, file: !888, line: 87, baseType: !1113, size: 64, offset: 9344)
!1113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1114, size: 64)
!1114 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !888, line: 44, flags: DIFlagFwdDecl)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !1101, file: !888, line: 89, baseType: !1116, size: 512, offset: 9408)
!1116 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1113, size: 512, elements: !540)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !1101, file: !888, line: 90, baseType: !539, size: 16, offset: 9920)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !1101, file: !888, line: 90, baseType: !539, size: 16, offset: 9936)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !1101, file: !888, line: 92, baseType: !539, size: 16, offset: 9952)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1101, file: !888, line: 92, baseType: !539, size: 16, offset: 9968)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !1101, file: !888, line: 93, baseType: !539, size: 16, offset: 9984)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1101, file: !888, line: 93, baseType: !539, size: 16, offset: 10000)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !1101, file: !888, line: 94, baseType: !262, size: 32, offset: 10016)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !1101, file: !888, line: 97, baseType: !539, size: 16, offset: 10048)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !1101, file: !888, line: 97, baseType: !539, size: 16, offset: 10064)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !1101, file: !888, line: 98, baseType: !539, size: 16, offset: 10080)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !1101, file: !888, line: 98, baseType: !539, size: 16, offset: 10096)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !1101, file: !888, line: 99, baseType: !539, size: 16, offset: 10112)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !1101, file: !888, line: 99, baseType: !539, size: 16, offset: 10128)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !1101, file: !888, line: 100, baseType: !5, size: 32, offset: 10144)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !1101, file: !888, line: 101, baseType: !1132, size: 64, offset: 10176)
!1132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !1101, file: !888, line: 103, baseType: !639, size: 64, offset: 10240)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !1101, file: !888, line: 104, baseType: !1135, size: 64, offset: 10304)
!1135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1136, size: 64)
!1136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !615, line: 159, size: 448, elements: !1137)
!1137 = !{!1138, !1140, !1141, !1143, !1144, !1146}
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1136, file: !615, line: 161, baseType: !1139, size: 64)
!1139 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 64, elements: !755)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1136, file: !615, line: 162, baseType: !1139, size: 64, offset: 64)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !1136, file: !615, line: 163, baseType: !1142, size: 32, offset: 128)
!1142 = !DICompositeType(tag: DW_TAG_array_type, baseType: !539, size: 32, elements: !755)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !1136, file: !615, line: 164, baseType: !1142, size: 32, offset: 160)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !1136, file: !615, line: 165, baseType: !1145, size: 128, offset: 192)
!1145 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1132, size: 128, elements: !755)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !1136, file: !615, line: 166, baseType: !1147, size: 128, offset: 320)
!1147 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1109, size: 128, elements: !755)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !1101, file: !888, line: 107, baseType: !536, size: 32, offset: 10368)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !1101, file: !888, line: 108, baseType: !262, size: 32, offset: 10400)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !1101, file: !888, line: 109, baseType: !539, size: 16, offset: 10432)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1101, file: !888, line: 110, baseType: !539, size: 16, offset: 10448)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !1101, file: !888, line: 113, baseType: !262, size: 32, offset: 10464)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !1101, file: !888, line: 113, baseType: !262, size: 32, offset: 10496)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !1101, file: !888, line: 114, baseType: !558, size: 8, offset: 10528)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !1101, file: !888, line: 114, baseType: !558, size: 8, offset: 10536)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !1101, file: !888, line: 115, baseType: !539, size: 16, offset: 10544)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !1101, file: !888, line: 116, baseType: !1158, size: 128, offset: 10560)
!1158 = !DICompositeType(tag: DW_TAG_array_type, baseType: !536, size: 128, elements: !1159)
!1159 = !{!1016}
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !1101, file: !888, line: 119, baseType: !536, size: 32, offset: 10688)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !1101, file: !888, line: 119, baseType: !536, size: 32, offset: 10720)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !1101, file: !888, line: 122, baseType: !920, size: 512, offset: 10752)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !1101, file: !888, line: 123, baseType: !558, size: 8, offset: 11264)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1101, file: !888, line: 125, baseType: !1165, size: 56, offset: 11272)
!1165 = !DICompositeType(tag: DW_TAG_array_type, baseType: !558, size: 56, elements: !1166)
!1166 = !{!1167}
!1167 = !DISubrange(count: 7)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !1101, file: !888, line: 126, baseType: !1169, size: 4096, offset: 11328)
!1169 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1170, size: 4096, elements: !540)
!1170 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !888, line: 69, baseType: !1171)
!1171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !888, line: 67, size: 512, elements: !1172)
!1172 = !{!1173}
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1171, file: !888, line: 68, baseType: !590, size: 512)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "image_opacity", scope: !1079, file: !752, line: 201, baseType: !536, size: 32, offset: 960)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !1079, file: !752, line: 204, baseType: !262, size: 32, offset: 992)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !949, file: !752, line: 350, baseType: !527, size: 128, offset: 1984)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "objectnr", scope: !949, file: !752, line: 351, baseType: !262, size: 32, offset: 2112)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "tot_object", scope: !949, file: !752, line: 351, baseType: !262, size: 32, offset: 2144)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !949, file: !752, line: 353, baseType: !1180, size: 64, offset: 2176)
!1180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1181, size: 64)
!1181 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStats", file: !752, line: 297, baseType: !1182)
!1182 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStats", file: !752, line: 295, size: 2048, elements: !1183)
!1183 = !{!1184}
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !1182, file: !752, line: 296, baseType: !557, size: 2048)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "dopesheet", scope: !949, file: !752, line: 355, baseType: !1186, size: 384, offset: 2240)
!1186 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingDopesheet", file: !752, line: 338, baseType: !1187)
!1187 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingDopesheet", file: !752, line: 322, size: 384, elements: !1188)
!1188 = !{!1189, !1190, !1191, !1192, !1193, !1194, !1195}
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !1187, file: !752, line: 323, baseType: !262, size: 32)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "sort_method", scope: !1187, file: !752, line: 325, baseType: !539, size: 16, offset: 32)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1187, file: !752, line: 326, baseType: !539, size: 16, offset: 48)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "coverage_segments", scope: !1187, file: !752, line: 331, baseType: !527, size: 128, offset: 64)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1187, file: !752, line: 334, baseType: !527, size: 128, offset: 192)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "tot_channel", scope: !1187, file: !752, line: 335, baseType: !262, size: 32, offset: 320)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1187, file: !752, line: 337, baseType: !262, size: 32, offset: 352)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "tracking_context", scope: !932, file: !697, line: 81, baseType: !532, size: 64, offset: 12224)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !932, file: !697, line: 85, baseType: !1198, size: 6208, offset: 12288)
!1198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipProxy", file: !697, line: 55, size: 6208, elements: !1199)
!1199 = !{!1200, !1201, !1202, !1203, !1204}
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !1198, file: !697, line: 56, baseType: !875, size: 6144)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !1198, file: !697, line: 58, baseType: !539, size: 16, offset: 6144)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1198, file: !697, line: 59, baseType: !539, size: 16, offset: 6160)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flag", scope: !1198, file: !697, line: 60, baseType: !539, size: 16, offset: 6176)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flag", scope: !1198, file: !697, line: 61, baseType: !539, size: 16, offset: 6192)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !932, file: !697, line: 86, baseType: !262, size: 32, offset: 18496)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !932, file: !697, line: 88, baseType: !262, size: 32, offset: 18528)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !932, file: !697, line: 90, baseType: !262, size: 32, offset: 18560)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "frame_offset", scope: !932, file: !697, line: 94, baseType: !262, size: 32, offset: 18592)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !932, file: !697, line: 100, baseType: !920, size: 512, offset: 18624)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !827, file: !818, line: 154, baseType: !1211, size: 64, offset: 1664)
!1211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1212, size: 64)
!1212 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mask", file: !569, line: 264, flags: DIFlagFwdDecl)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !827, file: !818, line: 156, baseType: !886, size: 64, offset: 1728)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "effect_fader", scope: !827, file: !818, line: 158, baseType: !536, size: 32, offset: 1792)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "speed_fader", scope: !827, file: !818, line: 159, baseType: !536, size: 32, offset: 1824)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "seq1", scope: !827, file: !818, line: 162, baseType: !830, size: 64, offset: 1856)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "seq2", scope: !827, file: !818, line: 162, baseType: !830, size: 64, offset: 1920)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "seq3", scope: !827, file: !818, line: 162, baseType: !830, size: 64, offset: 1984)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !827, file: !818, line: 164, baseType: !527, size: 128, offset: 2048)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "sound", scope: !827, file: !818, line: 166, baseType: !1221, size: 64, offset: 2176)
!1221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1222, size: 64)
!1222 = !DICompositeType(tag: DW_TAG_structure_type, name: "bSound", file: !818, line: 51, flags: DIFlagFwdDecl)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "scene_sound", scope: !827, file: !818, line: 167, baseType: !532, size: 64, offset: 2240)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "volume", scope: !827, file: !818, line: 168, baseType: !536, size: 32, offset: 2304)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "pitch", scope: !827, file: !818, line: 170, baseType: !536, size: 32, offset: 2336)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "pan", scope: !827, file: !818, line: 170, baseType: !536, size: 32, offset: 2368)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "strobe", scope: !827, file: !818, line: 171, baseType: !536, size: 32, offset: 2400)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "effectdata", scope: !827, file: !818, line: 173, baseType: !532, size: 64, offset: 2432)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "anim_startofs", scope: !827, file: !818, line: 175, baseType: !262, size: 32, offset: 2496)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "anim_endofs", scope: !827, file: !818, line: 176, baseType: !262, size: 32, offset: 2528)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "blend_mode", scope: !827, file: !818, line: 179, baseType: !262, size: 32, offset: 2560)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "blend_opacity", scope: !827, file: !818, line: 180, baseType: !536, size: 32, offset: 2592)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !827, file: !818, line: 183, baseType: !262, size: 32, offset: 2624)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !827, file: !818, line: 185, baseType: !558, size: 8, offset: 2656)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !827, file: !818, line: 186, baseType: !1236, size: 24, offset: 2664)
!1236 = !DICompositeType(tag: DW_TAG_array_type, baseType: !558, size: 24, elements: !721)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !827, file: !818, line: 189, baseType: !527, size: 128, offset: 2688)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "act_imagedir", scope: !817, file: !818, line: 207, baseType: !633, size: 8192, offset: 384)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "act_sounddir", scope: !817, file: !818, line: 208, baseType: !633, size: 8192, offset: 8576)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "over_ofs", scope: !817, file: !818, line: 210, baseType: !262, size: 32, offset: 16768)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "over_cfra", scope: !817, file: !818, line: 210, baseType: !262, size: 32, offset: 16800)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "over_flag", scope: !817, file: !818, line: 211, baseType: !262, size: 32, offset: 16832)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !817, file: !818, line: 211, baseType: !262, size: 32, offset: 16864)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "over_border", scope: !817, file: !818, line: 212, baseType: !772, size: 128, offset: 16896)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "toolsettings", scope: !690, file: !691, line: 1246, baseType: !1246, size: 64, offset: 2112)
!1246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1247, size: 64)
!1247 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolSettings", file: !691, line: 1067, size: 5184, elements: !1248)
!1248 = !{!1249, !1279, !1280, !1295, !1301, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1317, !1333, !1360, !1361, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1406, !1407, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1443}
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint", scope: !1247, file: !691, line: 1068, baseType: !1250, size: 64)
!1250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1251, size: 64)
!1251 = !DIDerivedType(tag: DW_TAG_typedef, name: "VPaint", file: !691, line: 934, baseType: !1252)
!1252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VPaint", file: !691, line: 925, size: 576, elements: !1253)
!1253 = !{!1254, !1271, !1272, !1273, !1274, !1275, !1278}
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !1252, file: !691, line: 926, baseType: !1255, size: 320)
!1255 = !DIDerivedType(tag: DW_TAG_typedef, name: "Paint", file: !691, line: 830, baseType: !1256)
!1256 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Paint", file: !691, line: 813, size: 320, elements: !1257)
!1257 = !{!1258, !1261, !1264, !1265, !1268, !1269, !1270}
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !1256, file: !691, line: 814, baseType: !1259, size: 64)
!1259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1260, size: 64)
!1260 = !DICompositeType(tag: DW_TAG_structure_type, name: "Brush", file: !691, line: 51, flags: DIFlagFwdDecl)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "palette", scope: !1256, file: !691, line: 815, baseType: !1262, size: 64, offset: 64)
!1262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1263, size: 64)
!1263 = !DICompositeType(tag: DW_TAG_structure_type, name: "Palette", file: !691, line: 815, flags: DIFlagFwdDecl)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor", scope: !1256, file: !691, line: 818, baseType: !532, size: 64, offset: 128)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor_col", scope: !1256, file: !691, line: 819, baseType: !1266, size: 32, offset: 192)
!1266 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1267, size: 32, elements: !1159)
!1267 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1256, file: !691, line: 822, baseType: !262, size: 32, offset: 224)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "num_input_samples", scope: !1256, file: !691, line: 826, baseType: !262, size: 32, offset: 256)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "symmetry_flags", scope: !1256, file: !691, line: 829, baseType: !262, size: 32, offset: 288)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1252, file: !691, line: 928, baseType: !539, size: 16, offset: 320)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1252, file: !691, line: 928, baseType: !539, size: 16, offset: 336)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !1252, file: !691, line: 929, baseType: !262, size: 32, offset: 352)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint_prev", scope: !1252, file: !691, line: 930, baseType: !1132, size: 64, offset: 384)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint_prev", scope: !1252, file: !691, line: 931, baseType: !1276, size: 64, offset: 448)
!1276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1277, size: 64)
!1277 = !DICompositeType(tag: DW_TAG_structure_type, name: "MDeformVert", file: !691, line: 931, flags: DIFlagFwdDecl)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !1252, file: !691, line: 933, baseType: !532, size: 64, offset: 512)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint", scope: !1247, file: !691, line: 1069, baseType: !1250, size: 64, offset: 64)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !1247, file: !691, line: 1070, baseType: !1281, size: 64, offset: 128)
!1281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1282, size: 64)
!1282 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sculpt", file: !691, line: 916, baseType: !1283)
!1283 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sculpt", file: !691, line: 891, size: 704, elements: !1284)
!1284 = !{!1285, !1286, !1287, !1289, !1290, !1291, !1292, !1293, !1294}
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !1283, file: !691, line: 892, baseType: !1255, size: 320)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1283, file: !691, line: 896, baseType: !262, size: 32, offset: 320)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "radial_symm", scope: !1283, file: !691, line: 900, baseType: !1288, size: 96, offset: 352)
!1288 = !DICompositeType(tag: DW_TAG_array_type, baseType: !262, size: 96, elements: !721)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "detail_size", scope: !1283, file: !691, line: 903, baseType: !536, size: 32, offset: 448)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "symmetrize_direction", scope: !1283, file: !691, line: 906, baseType: !262, size: 32, offset: 480)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "gravity_factor", scope: !1283, file: !691, line: 909, baseType: !536, size: 32, offset: 512)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "constant_detail", scope: !1283, file: !691, line: 912, baseType: !536, size: 32, offset: 544)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "gravity_object", scope: !1283, file: !691, line: 914, baseType: !699, size: 64, offset: 576)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1283, file: !691, line: 915, baseType: !532, size: 64, offset: 640)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "uvsculpt", scope: !1247, file: !691, line: 1071, baseType: !1296, size: 64, offset: 192)
!1296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1297, size: 64)
!1297 = !DIDerivedType(tag: DW_TAG_typedef, name: "UvSculpt", file: !691, line: 920, baseType: !1298)
!1298 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UvSculpt", file: !691, line: 918, size: 320, elements: !1299)
!1299 = !{!1300}
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !1298, file: !691, line: 919, baseType: !1255, size: 320)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "vgroup_weight", scope: !1247, file: !691, line: 1075, baseType: !536, size: 32, offset: 256)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "doublimit", scope: !1247, file: !691, line: 1077, baseType: !536, size: 32, offset: 288)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "normalsize", scope: !1247, file: !691, line: 1078, baseType: !536, size: 32, offset: 320)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "automerge", scope: !1247, file: !691, line: 1079, baseType: !539, size: 16, offset: 352)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !1247, file: !691, line: 1082, baseType: !539, size: 16, offset: 368)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "unwrapper", scope: !1247, file: !691, line: 1085, baseType: !558, size: 8, offset: 384)
