; ModuleID = 'blender/source/blender/editors/animation/anim_ops.c'
source_filename = "blender/source/blender/editors/animation/anim_ops.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.UserDef = type { i32, i32, i32, i32, i32, [768 x i8], [768 x i8], [1024 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [1024 x i8], [1024 x i8], i32, i16, i16, i16, i16, i16, i16, i32, i32, i32, i16, i16, i32, i32, i32, i32, i32, i32, i32, i16, i16, i16, i16, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, [64 x i8], i16, i16, i16, i16, i16, i16, i16, i16, [3 x %struct.SolidLight], i16, i16, i16, i16, i16, i16, i16, i16, i32, i32, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i8, i8, i8, i8, i16, i16, i16, i16, i16, i16, float, float, i32, i16, i16, float, i16, i16, i16, i16, %struct.ColorBand, [3 x float], [4 x float], i16, i8, i8, [80 x i8], [1024 x i8], i32, i32, float, float, i32, i16, i16, i16, i16, i16, i16, %struct.WalkNavigation }
%struct.ListBase = type { i8*, i8* }
%struct.SolidLight = type { i32, i32, [4 x float], [4 x float], [4 x float] }
%struct.ColorBand = type { i16, i16, i8, i8, i8, [1 x i8], [32 x %struct.CBData] }
%struct.CBData = type { float, float, float, float, float, i32 }
%struct.WalkNavigation = type { float, float, float, float, float, float, i16, [3 x i16] }

!228 = !DIEnumerator(name: "USER_ADD_EDITMODE", value: 262144, isUnsigned: true)
!229 = !DIEnumerator(name: "USER_ADD_VIEWALIGNED", value: 524288, isUnsigned: true)
!230 = !DIEnumerator(name: "USER_RELPATHS", value: 1048576, isUnsigned: true)
!231 = !DIEnumerator(name: "USER_RELEASECONFIRM", value: 2097152, isUnsigned: true)
!232 = !DIEnumerator(name: "USER_SCRIPT_AUTOEXEC_DISABLE", value: 4194304, isUnsigned: true)
!233 = !DIEnumerator(name: "USER_FILENOUI", value: 8388608, isUnsigned: true)
!234 = !DIEnumerator(name: "USER_NONEGFRAMES", value: 16777216, isUnsigned: true)
!235 = !DIEnumerator(name: "USER_TXT_TABSTOSPACES_DISABLE", value: 33554432, isUnsigned: true)
!236 = !DIEnumerator(name: "USER_TOOLTIPS_PYTHON", value: 67108864, isUnsigned: true)
!237 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eSpace_Type", file: !238, line: 1163, baseType: !5, size: 32, elements: !239)
!238 = !DIFile(filename: "blender/source/blender/makesdna/DNA_space_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!239 = !{!240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261}
!240 = !DIEnumerator(name: "SPACE_EMPTY", value: 0, isUnsigned: true)
!241 = !DIEnumerator(name: "SPACE_VIEW3D", value: 1, isUnsigned: true)
!242 = !DIEnumerator(name: "SPACE_IPO", value: 2, isUnsigned: true)
!243 = !DIEnumerator(name: "SPACE_OUTLINER", value: 3, isUnsigned: true)
!244 = !DIEnumerator(name: "SPACE_BUTS", value: 4, isUnsigned: true)
!245 = !DIEnumerator(name: "SPACE_FILE", value: 5, isUnsigned: true)
!246 = !DIEnumerator(name: "SPACE_IMAGE", value: 6, isUnsigned: true)
!247 = !DIEnumerator(name: "SPACE_INFO", value: 7, isUnsigned: true)
!248 = !DIEnumerator(name: "SPACE_SEQ", value: 8, isUnsigned: true)
!249 = !DIEnumerator(name: "SPACE_TEXT", value: 9, isUnsigned: true)
!250 = !DIEnumerator(name: "SPACE_IMASEL", value: 10, isUnsigned: true)
!251 = !DIEnumerator(name: "SPACE_SOUND", value: 11, isUnsigned: true)
!252 = !DIEnumerator(name: "SPACE_ACTION", value: 12, isUnsigned: true)
!253 = !DIEnumerator(name: "SPACE_NLA", value: 13, isUnsigned: true)
!254 = !DIEnumerator(name: "SPACE_SCRIPT", value: 14, isUnsigned: true)
!255 = !DIEnumerator(name: "SPACE_TIME", value: 15, isUnsigned: true)
!256 = !DIEnumerator(name: "SPACE_NODE", value: 16, isUnsigned: true)
!257 = !DIEnumerator(name: "SPACE_LOGIC", value: 17, isUnsigned: true)
!258 = !DIEnumerator(name: "SPACE_CONSOLE", value: 18, isUnsigned: true)
!259 = !DIEnumerator(name: "SPACE_USERPREF", value: 19, isUnsigned: true)
!260 = !DIEnumerator(name: "SPACE_CLIP", value: 20, isUnsigned: true)
!261 = !DIEnumerator(name: "SPACEICONMAX", value: 20, isUnsigned: true)
!262 = !{!263, !264}
!263 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!265 = !{i32 7, !"Dwarf Version", i32 4}
!266 = !{i32 2, !"Debug Info Version", i32 3}
!267 = !{i32 1, !"wchar_size", i32 4}
!268 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!269 = distinct !DISubprogram(name: "ED_operatortypes_anim", scope: !1, file: !1, line: 305, type: !270, scopeLine: 306, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !272)
!270 = !DISubroutineType(types: !271)
!271 = !{null}
!272 = !{}
!273 = !DILocation(line: 308, column: 2, scope: !269)
!274 = !DILocation(line: 310, column: 2, scope: !269)
!275 = !DILocation(line: 311, column: 2, scope: !269)
!276 = !DILocation(line: 314, column: 2, scope: !269)
!277 = !DILocation(line: 315, column: 2, scope: !269)
!278 = !DILocation(line: 316, column: 2, scope: !269)
!279 = !DILocation(line: 317, column: 2, scope: !269)
!280 = !DILocation(line: 318, column: 2, scope: !269)
!281 = !DILocation(line: 319, column: 2, scope: !269)
!282 = !DILocation(line: 320, column: 2, scope: !269)
!283 = !DILocation(line: 321, column: 2, scope: !269)
!284 = !DILocation(line: 324, column: 2, scope: !269)
!285 = !DILocation(line: 325, column: 2, scope: !269)
!286 = !DILocation(line: 326, column: 2, scope: !269)
!287 = !DILocation(line: 327, column: 2, scope: !269)
!288 = !DILocation(line: 330, column: 2, scope: !269)
!289 = !DILocation(line: 331, column: 2, scope: !269)
!290 = !DILocation(line: 333, column: 2, scope: !269)
!291 = !DILocation(line: 334, column: 2, scope: !269)
!292 = !DILocation(line: 335, column: 2, scope: !269)
!293 = !DILocation(line: 336, column: 2, scope: !269)
!294 = !DILocation(line: 338, column: 2, scope: !269)
!295 = !DILocation(line: 339, column: 1, scope: !269)
!296 = distinct !DISubprogram(name: "ANIM_OT_change_frame", scope: !1, file: !1, line: 183, type: !297, scopeLine: 184, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !272)
!297 = !DISubroutineType(types: !298)
!298 = !{null, !299}
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "wmOperatorType", file: !301, line: 568, baseType: !302)
!301 = !DIFile(filename: "blender/source/blender/windowmanager/WM_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!302 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmOperatorType", file: !301, line: 508, size: 1536, elements: !303)
!303 = !{!304, !308, !309, !310, !311, !1823, !1827, !1833, !1837, !1838, !1842, !1843, !1844, !1845, !1849, !1850, !1865, !1866, !1870, !1896}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !302, file: !301, line: 509, baseType: !305, size: 64)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!306 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !307)
!307 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !302, file: !301, line: 510, baseType: !305, size: 64, offset: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "translation_context", scope: !302, file: !301, line: 511, baseType: !305, size: 64, offset: 128)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !302, file: !301, line: 512, baseType: !305, size: 64, offset: 192)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !302, file: !301, line: 518, baseType: !312, size: 64, offset: 256)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!313 = !DISubroutineType(types: !314)
!314 = !{!263, !315, !318}
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!316 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !317, line: 44, flags: DIFlagFwdDecl)
!317 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!319 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmOperator", file: !206, line: 328, size: 1344, elements: !320)
!320 = !{!321, !322, !323, !327, !358, !360, !361, !362, !374, !1816, !1817, !1818, !1821, !1822}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !319, file: !206, line: 329, baseType: !318, size: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !319, file: !206, line: 329, baseType: !318, size: 64, offset: 64)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !319, file: !206, line: 332, baseType: !324, size: 512, offset: 128)
!324 = !DICompositeType(tag: DW_TAG_array_type, baseType: !307, size: 512, elements: !325)
!325 = !{!326}
!326 = !DISubrange(count: 64)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !319, file: !206, line: 333, baseType: !328, size: 64, offset: 640)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !330, line: 75, baseType: !331)
!330 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!331 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !330, line: 62, size: 1024, elements: !332)
!332 = !{!333, !335, !336, !337, !338, !340, !341, !342, !356, !357}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !331, file: !330, line: 63, baseType: !334, size: 64)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !331, file: !330, line: 63, baseType: !334, size: 64, offset: 64)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !331, file: !330, line: 64, baseType: !307, size: 8, offset: 128)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !331, file: !330, line: 64, baseType: !307, size: 8, offset: 136)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !331, file: !330, line: 65, baseType: !339, size: 16, offset: 144)
!339 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !331, file: !330, line: 66, baseType: !324, size: 512, offset: 160)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !331, file: !330, line: 67, baseType: !263, size: 32, offset: 672)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !331, file: !330, line: 69, baseType: !343, size: 256, offset: 704)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !330, line: 60, baseType: !344)
!344 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !330, line: 48, size: 256, elements: !345)
!345 = !{!346, !347, !354, !355}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !344, file: !330, line: 49, baseType: !264, size: 64)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !344, file: !330, line: 58, baseType: !348, size: 128, offset: 64)
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !349, line: 71, baseType: !350)
!349 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!350 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !349, line: 69, size: 128, elements: !351)
!351 = !{!352, !353}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !350, file: !349, line: 70, baseType: !264, size: 64)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !350, file: !349, line: 70, baseType: !264, size: 64, offset: 64)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !344, file: !330, line: 59, baseType: !263, size: 32, offset: 192)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !344, file: !330, line: 59, baseType: !263, size: 32, offset: 224)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !331, file: !330, line: 70, baseType: !263, size: 32, offset: 960)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !331, file: !330, line: 74, baseType: !263, size: 32, offset: 992)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !319, file: !206, line: 336, baseType: !359, size: 64, offset: 704)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !319, file: !206, line: 337, baseType: !264, size: 64, offset: 768)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "py_instance", scope: !319, file: !206, line: 338, baseType: !264, size: 64, offset: 832)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !319, file: !206, line: 340, baseType: !363, size: 64, offset: 896)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !317, line: 55, size: 192, elements: !365)
!365 = !{!366, !370, !373}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !364, file: !317, line: 58, baseType: !367, size: 64)
!367 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !364, file: !317, line: 56, size: 64, elements: !368)
!368 = !{!369}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !367, file: !317, line: 57, baseType: !264, size: 64)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !364, file: !317, line: 60, baseType: !371, size: 64, offset: 64)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!372 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !317, line: 41, flags: DIFlagFwdDecl)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !364, file: !317, line: 61, baseType: !264, size: 64, offset: 128)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "reports", scope: !319, file: !206, line: 341, baseType: !375, size: 64, offset: 960)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64)
!376 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ReportList", file: !206, line: 106, size: 320, elements: !377)
!377 = !{!378, !379, !380, !381, !382, !383}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !376, file: !206, line: 107, baseType: !348, size: 128)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "printlevel", scope: !376, file: !206, line: 108, baseType: !263, size: 32, offset: 128)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "storelevel", scope: !376, file: !206, line: 109, baseType: !263, size: 32, offset: 160)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !376, file: !206, line: 110, baseType: !263, size: 32, offset: 192)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !376, file: !206, line: 110, baseType: !263, size: 32, offset: 224)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "reporttimer", scope: !376, file: !206, line: 111, baseType: !384, size: 64, offset: 256)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64)
!385 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTimer", file: !301, line: 490, size: 768, elements: !386)
!386 = !{!387, !388, !389, !1807, !1808, !1809, !1810, !1811, !1812, !1813, !1814, !1815}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !385, file: !301, line: 491, baseType: !384, size: 64)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !385, file: !301, line: 491, baseType: !384, size: 64, offset: 64)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "win", scope: !385, file: !301, line: 493, baseType: !390, size: 64, offset: 128)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!391 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindow", file: !206, line: 169, size: 2048, elements: !392)
!392 = !{!393, !394, !395, !396, !1724, !1725, !1726, !1727, !1728, !1729, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1739, !1740, !1741, !1782, !1785, !1799, !1800, !1801, !1802, !1803, !1804, !1805, !1806}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !391, file: !206, line: 170, baseType: !390, size: 64)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !391, file: !206, line: 170, baseType: !390, size: 64, offset: 64)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "ghostwin", scope: !391, file: !206, line: 172, baseType: !264, size: 64, offset: 128)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !391, file: !206, line: 174, baseType: !397, size: 64, offset: 192)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !399, line: 49, size: 1984, elements: !400)
!399 = !DIFile(filename: "blender/source/blender/makesdna/DNA_screen_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!400 = !{!401, !437, !438, !439, !440, !441, !1707, !1708, !1709, !1710, !1711, !1712, !1713, !1714, !1715, !1716, !1717, !1718, !1719, !1720, !1721, !1722, !1723}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !398, file: !399, line: 50, baseType: !402, size: 960)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !330, line: 130, baseType: !403)
!403 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !330, line: 117, size: 960, elements: !404)
!404 = !{!405, !406, !407, !409, !428, !432, !433, !434, !435, !436}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !403, file: !330, line: 118, baseType: !264, size: 64)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !403, file: !330, line: 118, baseType: !264, size: 64, offset: 64)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !403, file: !330, line: 119, baseType: !408, size: 64, offset: 128)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !403, file: !330, line: 120, baseType: !410, size: 64, offset: 192)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!411 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !330, line: 136, size: 17600, elements: !412)
!412 = !{!413, !414, !416, !419, !423, !424, !425}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !411, file: !330, line: 137, baseType: !402, size: 960)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !411, file: !330, line: 138, baseType: !415, size: 64, offset: 960)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !411, file: !330, line: 139, baseType: !417, size: 64, offset: 1024)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64)
!418 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !330, line: 43, flags: DIFlagFwdDecl)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !411, file: !330, line: 140, baseType: !420, size: 8192, offset: 1088)
!420 = !DICompositeType(tag: DW_TAG_array_type, baseType: !307, size: 8192, elements: !421)
!421 = !{!422}
!422 = !DISubrange(count: 1024)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !411, file: !330, line: 141, baseType: !420, size: 8192, offset: 9280)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !411, file: !330, line: 148, baseType: !410, size: 64, offset: 17472)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !411, file: !330, line: 150, baseType: !426, size: 64, offset: 17536)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!427 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !330, line: 45, flags: DIFlagFwdDecl)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !403, file: !330, line: 121, baseType: !429, size: 528, offset: 256)
!429 = !DICompositeType(tag: DW_TAG_array_type, baseType: !307, size: 528, elements: !430)
!430 = !{!431}
!431 = !DISubrange(count: 66)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !403, file: !330, line: 126, baseType: !339, size: 16, offset: 784)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !403, file: !330, line: 127, baseType: !263, size: 32, offset: 800)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !403, file: !330, line: 128, baseType: !263, size: 32, offset: 832)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !403, file: !330, line: 128, baseType: !263, size: 32, offset: 864)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !403, file: !330, line: 129, baseType: !328, size: 64, offset: 896)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "vertbase", scope: !398, file: !399, line: 52, baseType: !348, size: 128, offset: 960)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "edgebase", scope: !398, file: !399, line: 53, baseType: !348, size: 128, offset: 1088)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "areabase", scope: !398, file: !399, line: 54, baseType: !348, size: 128, offset: 1216)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !398, file: !399, line: 55, baseType: !348, size: 128, offset: 1344)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !398, file: !399, line: 57, baseType: !442, size: 64, offset: 1472)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64)
!443 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !444, line: 1216, size: 39680, elements: !445)
!444 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!445 = !{!446, !447, !518, !522, !525, !526, !527, !539, !540, !544, !545, !546, !547, !548, !549, !550, !551, !552, !556, !632, !1071, !1286, !1289, !1577, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1599, !1600, !1601, !1602, !1603, !1611, !1678, !1685, !1686, !1693, !1694, !1700, !1701, !1702, !1703, !1704}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !443, file: !444, line: 1217, baseType: !402, size: 960)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !443, file: !444, line: 1218, baseType: !448, size: 64, offset: 960)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64)
!449 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !450, line: 838, size: 768, elements: !451)
!450 = !DIFile(filename: "blender/source/blender/makesdna/DNA_anim_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!451 = !{!452, !467, !468, !478, !479, !511, !512, !513, !514, !515, !516, !517}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !449, file: !450, line: 840, baseType: !453, size: 64)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAction", file: !455, line: 499, baseType: !456)
!455 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!456 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !455, line: 486, size: 1600, elements: !457)
!457 = !{!458, !459, !460, !461, !462, !463, !464, !465, !466}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !456, file: !455, line: 487, baseType: !402, size: 960)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !456, file: !455, line: 489, baseType: !348, size: 128, offset: 960)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !456, file: !455, line: 490, baseType: !348, size: 128, offset: 1088)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !456, file: !455, line: 491, baseType: !348, size: 128, offset: 1216)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !456, file: !455, line: 492, baseType: !348, size: 128, offset: 1344)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !456, file: !455, line: 494, baseType: !263, size: 32, offset: 1472)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !456, file: !455, line: 495, baseType: !263, size: 32, offset: 1504)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !456, file: !455, line: 497, baseType: !263, size: 32, offset: 1536)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !456, file: !455, line: 498, baseType: !263, size: 32, offset: 1568)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "tmpact", scope: !449, file: !450, line: 844, baseType: !453, size: 64, offset: 64)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "remap", scope: !449, file: !450, line: 848, baseType: !469, size: 64, offset: 128)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64)
!470 = !DIDerivedType(tag: DW_TAG_typedef, name: "AnimMapper", file: !450, line: 549, baseType: !471)
!471 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AnimMapper", file: !450, line: 544, size: 320, elements: !472)
!472 = !{!473, !475, !476, !477}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !471, file: !450, line: 545, baseType: !474, size: 64)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !471, file: !450, line: 545, baseType: !474, size: 64, offset: 64)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !471, file: !450, line: 547, baseType: !453, size: 64, offset: 128)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "mappings", scope: !471, file: !450, line: 548, baseType: !348, size: 128, offset: 192)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "nla_tracks", scope: !449, file: !450, line: 851, baseType: !348, size: 128, offset: 192)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "actstrip", scope: !449, file: !450, line: 853, baseType: !480, size: 64, offset: 320)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64)
!481 = !DIDerivedType(tag: DW_TAG_typedef, name: "NlaStrip", file: !450, line: 594, baseType: !482)
!482 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NlaStrip", file: !450, line: 561, size: 1664, elements: !483)
!483 = !{!484, !486, !487, !488, !489, !490, !491, !492, !493, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !482, file: !450, line: 562, baseType: !485, size: 64)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !482, file: !450, line: 562, baseType: !485, size: 64, offset: 64)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "strips", scope: !482, file: !450, line: 564, baseType: !348, size: 128, offset: 128)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "act", scope: !482, file: !450, line: 565, baseType: !453, size: 64, offset: 256)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "remap", scope: !482, file: !450, line: 566, baseType: !469, size: 64, offset: 320)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "fcurves", scope: !482, file: !450, line: 568, baseType: !348, size: 128, offset: 384)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !482, file: !450, line: 569, baseType: !348, size: 128, offset: 512)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !482, file: !450, line: 571, baseType: !324, size: 512, offset: 640)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "influence", scope: !482, file: !450, line: 573, baseType: !494, size: 32, offset: 1152)
!494 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "strip_time", scope: !482, file: !450, line: 574, baseType: !494, size: 32, offset: 1184)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !482, file: !450, line: 576, baseType: !494, size: 32, offset: 1216)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !482, file: !450, line: 576, baseType: !494, size: 32, offset: 1248)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "actstart", scope: !482, file: !450, line: 577, baseType: !494, size: 32, offset: 1280)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "actend", scope: !482, file: !450, line: 577, baseType: !494, size: 32, offset: 1312)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "repeat", scope: !482, file: !450, line: 579, baseType: !494, size: 32, offset: 1344)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !482, file: !450, line: 580, baseType: !494, size: 32, offset: 1376)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "blendin", scope: !482, file: !450, line: 582, baseType: !494, size: 32, offset: 1408)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "blendout", scope: !482, file: !450, line: 582, baseType: !494, size: 32, offset: 1440)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "blendmode", scope: !482, file: !450, line: 583, baseType: !339, size: 16, offset: 1472)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "extendmode", scope: !482, file: !450, line: 585, baseType: !339, size: 16, offset: 1488)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !482, file: !450, line: 586, baseType: !339, size: 16, offset: 1504)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !482, file: !450, line: 588, baseType: !339, size: 16, offset: 1520)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "speaker_handle", scope: !482, file: !450, line: 590, baseType: !264, size: 64, offset: 1536)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !482, file: !450, line: 592, baseType: !263, size: 32, offset: 1600)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !482, file: !450, line: 593, baseType: !263, size: 32, offset: 1632)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "drivers", scope: !449, file: !450, line: 858, baseType: !348, size: 128, offset: 384)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "overrides", scope: !449, file: !450, line: 859, baseType: !348, size: 128, offset: 512)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !449, file: !450, line: 862, baseType: !263, size: 32, offset: 640)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !449, file: !450, line: 863, baseType: !263, size: 32, offset: 672)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "act_blendmode", scope: !449, file: !450, line: 866, baseType: !339, size: 16, offset: 704)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "act_extendmode", scope: !449, file: !450, line: 867, baseType: !339, size: 16, offset: 720)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "act_influence", scope: !449, file: !450, line: 868, baseType: !494, size: 32, offset: 736)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !443, file: !444, line: 1220, baseType: !519, size: 64, offset: 1024)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!520 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !521, line: 49, flags: DIFlagFwdDecl)
!521 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!522 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !443, file: !444, line: 1221, baseType: !523, size: 64, offset: 1088)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 64)
!524 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !444, line: 52, flags: DIFlagFwdDecl)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !443, file: !444, line: 1223, baseType: !442, size: 64, offset: 1152)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !443, file: !444, line: 1225, baseType: !348, size: 128, offset: 1216)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !443, file: !444, line: 1226, baseType: !528, size: 64, offset: 1344)
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 64)
!529 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !444, line: 69, size: 320, elements: !530)
!530 = !{!531, !532, !533, !534, !535, !536, !537, !538}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !529, file: !444, line: 70, baseType: !528, size: 64)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !529, file: !444, line: 70, baseType: !528, size: 64, offset: 64)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !529, file: !444, line: 71, baseType: !5, size: 32, offset: 128)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !529, file: !444, line: 71, baseType: !5, size: 32, offset: 160)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !529, file: !444, line: 72, baseType: !263, size: 32, offset: 192)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !529, file: !444, line: 73, baseType: !339, size: 16, offset: 224)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !529, file: !444, line: 73, baseType: !339, size: 16, offset: 240)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !529, file: !444, line: 74, baseType: !519, size: 64, offset: 256)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !443, file: !444, line: 1227, baseType: !519, size: 64, offset: 1408)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !443, file: !444, line: 1229, baseType: !541, size: 96, offset: 1472)
!541 = !DICompositeType(tag: DW_TAG_array_type, baseType: !494, size: 96, elements: !542)
!542 = !{!543}
!543 = !DISubrange(count: 3)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !443, file: !444, line: 1230, baseType: !541, size: 96, offset: 1568)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !443, file: !444, line: 1231, baseType: !541, size: 96, offset: 1664)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !443, file: !444, line: 1231, baseType: !541, size: 96, offset: 1760)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !443, file: !444, line: 1233, baseType: !5, size: 32, offset: 1856)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !443, file: !444, line: 1234, baseType: !263, size: 32, offset: 1888)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !443, file: !444, line: 1235, baseType: !5, size: 32, offset: 1920)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !443, file: !444, line: 1237, baseType: !339, size: 16, offset: 1952)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !443, file: !444, line: 1239, baseType: !307, size: 8, offset: 1968)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !443, file: !444, line: 1240, baseType: !553, size: 8, offset: 1976)
!553 = !DICompositeType(tag: DW_TAG_array_type, baseType: !307, size: 8, elements: !554)
!554 = !{!555}
!555 = !DISubrange(count: 1)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !443, file: !444, line: 1242, baseType: !557, size: 64, offset: 1984)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64)
!558 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !559, line: 328, size: 3456, elements: !560)
!559 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!560 = !{!561, !562, !563, !566, !567, !568, !571, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !598, !599, !600, !603, !608, !609, !612, !616, !621, !624, !628, !629, !630, !631}
!561 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !558, file: !559, line: 329, baseType: !402, size: 960)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !558, file: !559, line: 330, baseType: !448, size: 64, offset: 960)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !558, file: !559, line: 332, baseType: !564, size: 64, offset: 1024)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64)
!565 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !559, line: 332, flags: DIFlagFwdDecl)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !558, file: !559, line: 333, baseType: !324, size: 512, offset: 1088)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "interface_type", scope: !558, file: !559, line: 335, baseType: !371, size: 64, offset: 1600)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !558, file: !559, line: 337, baseType: !569, size: 64, offset: 1664)
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 64)
!570 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !444, line: 61, flags: DIFlagFwdDecl)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "view_center", scope: !558, file: !559, line: 338, baseType: !572, size: 64, offset: 1728)
!572 = !DICompositeType(tag: DW_TAG_array_type, baseType: !494, size: 64, elements: !573)
!573 = !{!574}
!574 = !DISubrange(count: 2)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !558, file: !559, line: 340, baseType: !348, size: 128, offset: 1792)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !558, file: !559, line: 340, baseType: !348, size: 128, offset: 1920)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !558, file: !559, line: 342, baseType: !263, size: 32, offset: 2048)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !558, file: !559, line: 342, baseType: !263, size: 32, offset: 2080)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "cur_index", scope: !558, file: !559, line: 343, baseType: !263, size: 32, offset: 2112)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !558, file: !559, line: 345, baseType: !263, size: 32, offset: 2144)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !558, file: !559, line: 346, baseType: !263, size: 32, offset: 2176)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "is_updating", scope: !558, file: !559, line: 347, baseType: !339, size: 16, offset: 2208)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !558, file: !559, line: 348, baseType: !339, size: 16, offset: 2224)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !558, file: !559, line: 349, baseType: !263, size: 32, offset: 2240)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "nodetype", scope: !558, file: !559, line: 351, baseType: !263, size: 32, offset: 2272)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "edit_quality", scope: !558, file: !559, line: 353, baseType: !339, size: 16, offset: 2304)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "render_quality", scope: !558, file: !559, line: 354, baseType: !339, size: 16, offset: 2320)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "chunksize", scope: !558, file: !559, line: 355, baseType: !263, size: 32, offset: 2336)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "viewer_border", scope: !558, file: !559, line: 357, baseType: !590, size: 128, offset: 2368)
!590 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !591, line: 95, baseType: !592)
!591 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!592 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !591, line: 92, size: 128, elements: !593)
!593 = !{!594, !595, !596, !597}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !592, file: !591, line: 93, baseType: !494, size: 32)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !592, file: !591, line: 93, baseType: !494, size: 32, offset: 32)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !592, file: !591, line: 94, baseType: !494, size: 32, offset: 64)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !592, file: !591, line: 94, baseType: !494, size: 32, offset: 96)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !558, file: !559, line: 363, baseType: !348, size: 128, offset: 2496)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !558, file: !559, line: 363, baseType: !348, size: 128, offset: 2624)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "previews", scope: !558, file: !559, line: 368, baseType: !601, size: 64, offset: 2752)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64)
!602 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHash", file: !559, line: 48, flags: DIFlagFwdDecl)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "active_viewer_key", scope: !558, file: !559, line: 372, baseType: !604, size: 32, offset: 2816)
!604 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !559, line: 274, baseType: !605)
!605 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !559, line: 271, size: 32, elements: !606)
!606 = !{!607}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !605, file: !559, line: 273, baseType: !5, size: 32)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !558, file: !559, line: 373, baseType: !263, size: 32, offset: 2848)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "execdata", scope: !558, file: !559, line: 382, baseType: !610, size: 64, offset: 2880)
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64)
!611 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeExec", file: !559, line: 46, flags: DIFlagFwdDecl)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !558, file: !559, line: 385, baseType: !613, size: 64, offset: 2944)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 64)
!614 = !DISubroutineType(types: !615)
!615 = !{null, !264, !494}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "stats_draw", scope: !558, file: !559, line: 386, baseType: !617, size: 64, offset: 3008)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64)
!618 = !DISubroutineType(types: !619)
!619 = !{null, !264, !620}
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "test_break", scope: !558, file: !559, line: 387, baseType: !622, size: 64, offset: 3072)
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 64)
!623 = !DISubroutineType(types: !262)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "update_draw", scope: !558, file: !559, line: 388, baseType: !625, size: 64, offset: 3136)
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 64)
!626 = !DISubroutineType(types: !627)
!627 = !{null, !264}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "tbh", scope: !558, file: !559, line: 389, baseType: !264, size: 64, offset: 3200)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "prh", scope: !558, file: !559, line: 389, baseType: !264, size: 64, offset: 3264)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "sdh", scope: !558, file: !559, line: 389, baseType: !264, size: 64, offset: 3328)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "udh", scope: !558, file: !559, line: 389, baseType: !264, size: 64, offset: 3392)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !443, file: !444, line: 1244, baseType: !633, size: 64, offset: 2048)
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 64)
!634 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !635, line: 200, size: 17024, elements: !636)
!635 = !DIFile(filename: "blender/source/blender/makesdna/DNA_sequence_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!636 = !{!637, !639, !640, !641, !1064, !1065, !1066, !1067, !1068, !1069, !1070}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "seqbasep", scope: !634, file: !635, line: 201, baseType: !638, size: 64)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !634, file: !635, line: 202, baseType: !348, size: 128, offset: 64)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "metastack", scope: !634, file: !635, line: 203, baseType: !348, size: 128, offset: 192)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "act_seq", scope: !634, file: !635, line: 206, baseType: !642, size: 64, offset: 320)
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 64)
!643 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sequence", file: !635, line: 190, baseType: !644)
!644 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sequence", file: !635, line: 126, size: 2816, elements: !645)
!645 = !{!646, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !745, !748, !749, !750, !1034, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1063}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !644, file: !635, line: 127, baseType: !647, size: 64)
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 64)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !644, file: !635, line: 127, baseType: !647, size: 64, offset: 64)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !644, file: !635, line: 128, baseType: !264, size: 64, offset: 128)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !644, file: !635, line: 129, baseType: !264, size: 64, offset: 192)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !644, file: !635, line: 130, baseType: !324, size: 512, offset: 256)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !644, file: !635, line: 132, baseType: !263, size: 32, offset: 768)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !644, file: !635, line: 132, baseType: !263, size: 32, offset: 800)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !644, file: !635, line: 133, baseType: !263, size: 32, offset: 832)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !644, file: !635, line: 134, baseType: !263, size: 32, offset: 864)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "startofs", scope: !644, file: !635, line: 134, baseType: !263, size: 32, offset: 896)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "endofs", scope: !644, file: !635, line: 134, baseType: !263, size: 32, offset: 928)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !644, file: !635, line: 135, baseType: !263, size: 32, offset: 960)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !644, file: !635, line: 135, baseType: !263, size: 32, offset: 992)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !644, file: !635, line: 136, baseType: !263, size: 32, offset: 1024)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !644, file: !635, line: 136, baseType: !263, size: 32, offset: 1056)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "startdisp", scope: !644, file: !635, line: 137, baseType: !263, size: 32, offset: 1088)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "enddisp", scope: !644, file: !635, line: 137, baseType: !263, size: 32, offset: 1120)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "sat", scope: !644, file: !635, line: 138, baseType: !494, size: 32, offset: 1152)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "mul", scope: !644, file: !635, line: 139, baseType: !494, size: 32, offset: 1184)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "handsize", scope: !644, file: !635, line: 139, baseType: !494, size: 32, offset: 1216)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "anim_preseek", scope: !644, file: !635, line: 141, baseType: !339, size: 16, offset: 1248)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "streamindex", scope: !644, file: !635, line: 142, baseType: !339, size: 16, offset: 1264)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "multicam_source", scope: !644, file: !635, line: 143, baseType: !263, size: 32, offset: 1280)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "clip_flag", scope: !644, file: !635, line: 144, baseType: !263, size: 32, offset: 1312)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "strip", scope: !644, file: !635, line: 146, baseType: !672, size: 64, offset: 1344)
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 64)
!673 = !DIDerivedType(tag: DW_TAG_typedef, name: "Strip", file: !635, line: 114, baseType: !674)
!674 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Strip", file: !635, line: 99, size: 7232, elements: !675)
!675 = !{!676, !678, !679, !680, !681, !682, !683, !694, !698, !713, !722, !729, !739}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !674, file: !635, line: 100, baseType: !677, size: 64)
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !674, file: !635, line: 100, baseType: !677, size: 64, offset: 64)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !674, file: !635, line: 101, baseType: !263, size: 32, offset: 128)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !674, file: !635, line: 101, baseType: !263, size: 32, offset: 160)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !674, file: !635, line: 102, baseType: !263, size: 32, offset: 192)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !674, file: !635, line: 102, baseType: !263, size: 32, offset: 224)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "stripdata", scope: !674, file: !635, line: 103, baseType: !684, size: 64, offset: 256)
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 64)
!685 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripElem", file: !635, line: 59, baseType: !686)
!686 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripElem", file: !635, line: 56, size: 2112, elements: !687)
!687 = !{!688, !692, !693}
!688 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !686, file: !635, line: 57, baseType: !689, size: 2048)
!689 = !DICompositeType(tag: DW_TAG_array_type, baseType: !307, size: 2048, elements: !690)
!690 = !{!691}
!691 = !DISubrange(count: 256)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "orig_width", scope: !686, file: !635, line: 58, baseType: !263, size: 32, offset: 2048)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "orig_height", scope: !686, file: !635, line: 58, baseType: !263, size: 32, offset: 2080)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !674, file: !635, line: 106, baseType: !695, size: 6144, offset: 320)
!695 = !DICompositeType(tag: DW_TAG_array_type, baseType: !307, size: 6144, elements: !696)
!696 = !{!697}
!697 = !DISubrange(count: 768)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !674, file: !635, line: 107, baseType: !699, size: 64, offset: 6464)
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !700, size: 64)
!700 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripProxy", file: !635, line: 97, baseType: !701)
!701 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripProxy", file: !635, line: 83, size: 8320, elements: !702)
!702 = !{!703, !704, !705, !709, !710, !711, !712}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !701, file: !635, line: 84, baseType: !695, size: 6144)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !701, file: !635, line: 87, baseType: !689, size: 2048, offset: 6144)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !701, file: !635, line: 88, baseType: !706, size: 64, offset: 8192)
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 64)
!707 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !708, line: 41, flags: DIFlagFwdDecl)
!708 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!709 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !701, file: !635, line: 90, baseType: !339, size: 16, offset: 8256)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !701, file: !635, line: 92, baseType: !339, size: 16, offset: 8272)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flags", scope: !701, file: !635, line: 93, baseType: !339, size: 16, offset: 8288)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flags", scope: !701, file: !635, line: 95, baseType: !339, size: 16, offset: 8304)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !674, file: !635, line: 108, baseType: !714, size: 64, offset: 6528)
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 64)
!715 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripCrop", file: !635, line: 66, baseType: !716)
!716 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripCrop", file: !635, line: 61, size: 128, elements: !717)
!717 = !{!718, !719, !720, !721}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !716, file: !635, line: 62, baseType: !263, size: 32)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !716, file: !635, line: 63, baseType: !263, size: 32, offset: 32)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !716, file: !635, line: 64, baseType: !263, size: 32, offset: 64)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !716, file: !635, line: 65, baseType: !263, size: 32, offset: 96)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !674, file: !635, line: 109, baseType: !723, size: 64, offset: 6592)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 64)
!724 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripTransform", file: !635, line: 71, baseType: !725)
!725 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripTransform", file: !635, line: 68, size: 64, elements: !726)
!726 = !{!727, !728}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "xofs", scope: !725, file: !635, line: 69, baseType: !263, size: 32)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "yofs", scope: !725, file: !635, line: 70, baseType: !263, size: 32, offset: 32)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "color_balance", scope: !674, file: !635, line: 110, baseType: !730, size: 64, offset: 6656)
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 64)
!731 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripColorBalance", file: !635, line: 81, baseType: !732)
!732 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripColorBalance", file: !635, line: 73, size: 352, elements: !733)
!733 = !{!734, !735, !736, !737, !738}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "lift", scope: !732, file: !635, line: 74, baseType: !541, size: 96)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !732, file: !635, line: 75, baseType: !541, size: 96, offset: 96)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "gain", scope: !732, file: !635, line: 76, baseType: !541, size: 96, offset: 192)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !732, file: !635, line: 77, baseType: !263, size: 32, offset: 288)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !732, file: !635, line: 78, baseType: !263, size: 32, offset: 320)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !674, file: !635, line: 113, baseType: !740, size: 512, offset: 6720)
!740 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !741, line: 182, baseType: !742)
!741 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!742 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !741, line: 180, size: 512, elements: !743)
!743 = !{!744}
!744 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !742, file: !741, line: 181, baseType: !324, size: 512)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !644, file: !635, line: 148, baseType: !746, size: 64, offset: 1408)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 64)
!747 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !521, line: 46, flags: DIFlagFwdDecl)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !644, file: !635, line: 151, baseType: !442, size: 64, offset: 1472)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "scene_camera", scope: !644, file: !635, line: 152, baseType: !519, size: 64, offset: 1536)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "clip", scope: !644, file: !635, line: 153, baseType: !751, size: 64, offset: 1600)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64)
!752 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClip", file: !753, line: 64, size: 19136, elements: !754)
!753 = !DIFile(filename: "blender/source/blender/makesdna/DNA_movieclip_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!754 = !{!755, !756, !757, !758, !759, !760, !762, !763, !764, !765, !768, !769, !1020, !1021, !1029, !1030, !1031, !1032, !1033}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !752, file: !753, line: 65, baseType: !402, size: 960)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !752, file: !753, line: 66, baseType: !448, size: 64, offset: 960)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !752, file: !753, line: 68, baseType: !420, size: 8192, offset: 1024)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !752, file: !753, line: 70, baseType: !263, size: 32, offset: 9216)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !752, file: !753, line: 71, baseType: !263, size: 32, offset: 9248)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "lastsize", scope: !752, file: !753, line: 72, baseType: !761, size: 64, offset: 9280)
!761 = !DICompositeType(tag: DW_TAG_array_type, baseType: !263, size: 64, elements: !573)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !752, file: !753, line: 74, baseType: !494, size: 32, offset: 9344)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !752, file: !753, line: 74, baseType: !494, size: 32, offset: 9376)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !752, file: !753, line: 76, baseType: !706, size: 64, offset: 9408)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !752, file: !753, line: 77, baseType: !766, size: 64, offset: 9472)
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64)
!767 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipCache", file: !753, line: 77, flags: DIFlagFwdDecl)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !752, file: !753, line: 78, baseType: !569, size: 64, offset: 9536)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "tracking", scope: !752, file: !753, line: 80, baseType: !770, size: 2624, offset: 9600)
!770 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTracking", file: !771, line: 340, size: 2624, elements: !772)
!771 = !DIFile(filename: "blender/source/blender/makesdna/DNA_tracking_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!772 = !{!773, !801, !819, !820, !821, !839, !897, !898, !1000, !1001, !1002, !1003, !1009}
!773 = !DIDerivedType(tag: DW_TAG_member, name: "settings", scope: !770, file: !771, line: 341, baseType: !774, size: 576)
!774 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingSettings", file: !771, line: 251, baseType: !775)
!775 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingSettings", file: !771, line: 207, size: 576, elements: !776)
!776 = !{!777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800}
!777 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !775, file: !771, line: 208, baseType: !263, size: 32)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "default_motion_model", scope: !775, file: !771, line: 211, baseType: !339, size: 16, offset: 32)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "default_algorithm_flag", scope: !775, file: !771, line: 212, baseType: !339, size: 16, offset: 48)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "default_minimum_correlation", scope: !775, file: !771, line: 213, baseType: !494, size: 32, offset: 64)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_size", scope: !775, file: !771, line: 214, baseType: !339, size: 16, offset: 96)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "default_search_size", scope: !775, file: !771, line: 215, baseType: !339, size: 16, offset: 112)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "default_frames_limit", scope: !775, file: !771, line: 216, baseType: !339, size: 16, offset: 128)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "default_margin", scope: !775, file: !771, line: 217, baseType: !339, size: 16, offset: 144)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_match", scope: !775, file: !771, line: 218, baseType: !339, size: 16, offset: 160)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "default_flag", scope: !775, file: !771, line: 219, baseType: !339, size: 16, offset: 176)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "default_weight", scope: !775, file: !771, line: 220, baseType: !494, size: 32, offset: 192)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "motion_flag", scope: !775, file: !771, line: 222, baseType: !339, size: 16, offset: 224)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "speed", scope: !775, file: !771, line: 225, baseType: !339, size: 16, offset: 240)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe1", scope: !775, file: !771, line: 228, baseType: !263, size: 32, offset: 256)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe2", scope: !775, file: !771, line: 229, baseType: !263, size: 32, offset: 288)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction_flag", scope: !775, file: !771, line: 233, baseType: !263, size: 32, offset: 320)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "refine_camera_intrinsics", scope: !775, file: !771, line: 236, baseType: !339, size: 16, offset: 352)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !775, file: !771, line: 236, baseType: !339, size: 16, offset: 368)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !775, file: !771, line: 241, baseType: !494, size: 32, offset: 384)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "clean_frames", scope: !775, file: !771, line: 244, baseType: !263, size: 32, offset: 416)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "clean_action", scope: !775, file: !771, line: 244, baseType: !263, size: 32, offset: 448)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "clean_error", scope: !775, file: !771, line: 245, baseType: !494, size: 32, offset: 480)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "object_distance", scope: !775, file: !771, line: 248, baseType: !494, size: 32, offset: 512)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !775, file: !771, line: 250, baseType: !263, size: 32, offset: 544)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !770, file: !771, line: 342, baseType: !802, size: 448, offset: 576)
!802 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingCamera", file: !771, line: 79, baseType: !803)
!803 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingCamera", file: !771, line: 61, size: 448, elements: !804)
!804 = !{!805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "intrinsics", scope: !803, file: !771, line: 62, baseType: !264, size: 64)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_model", scope: !803, file: !771, line: 64, baseType: !339, size: 16, offset: 64)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !803, file: !771, line: 65, baseType: !339, size: 16, offset: 80)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "sensor_width", scope: !803, file: !771, line: 67, baseType: !494, size: 32, offset: 96)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_aspect", scope: !803, file: !771, line: 68, baseType: !494, size: 32, offset: 128)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "focal", scope: !803, file: !771, line: 69, baseType: !494, size: 32, offset: 160)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !803, file: !771, line: 70, baseType: !339, size: 16, offset: 192)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !803, file: !771, line: 71, baseType: !339, size: 16, offset: 208)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "principal", scope: !803, file: !771, line: 72, baseType: !572, size: 64, offset: 224)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "k1", scope: !803, file: !771, line: 75, baseType: !494, size: 32, offset: 288)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "k2", scope: !803, file: !771, line: 75, baseType: !494, size: 32, offset: 320)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "k3", scope: !803, file: !771, line: 75, baseType: !494, size: 32, offset: 352)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "division_k1", scope: !803, file: !771, line: 78, baseType: !494, size: 32, offset: 384)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "division_k2", scope: !803, file: !771, line: 78, baseType: !494, size: 32, offset: 416)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "tracks", scope: !770, file: !771, line: 343, baseType: !348, size: 128, offset: 1024)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "plane_tracks", scope: !770, file: !771, line: 344, baseType: !348, size: 128, offset: 1152)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction", scope: !770, file: !771, line: 345, baseType: !822, size: 192, offset: 1280)
!822 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingReconstruction", file: !771, line: 278, baseType: !823)
!823 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingReconstruction", file: !771, line: 270, size: 192, elements: !824)
!824 = !{!825, !826, !827, !828, !829}
!825 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !823, file: !771, line: 271, baseType: !263, size: 32)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !823, file: !771, line: 273, baseType: !494, size: 32, offset: 32)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "last_camera", scope: !823, file: !771, line: 275, baseType: !263, size: 32, offset: 64)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "camnr", scope: !823, file: !771, line: 276, baseType: !263, size: 32, offset: 96)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "cameras", scope: !823, file: !771, line: 277, baseType: !830, size: 64, offset: 128)
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !831, size: 64)
!831 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieReconstructedCamera", file: !771, line: 55, size: 576, elements: !832)
!832 = !{!833, !834, !835}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !831, file: !771, line: 56, baseType: !263, size: 32)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !831, file: !771, line: 57, baseType: !494, size: 32, offset: 32)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !831, file: !771, line: 58, baseType: !836, size: 512, offset: 64)
!836 = !DICompositeType(tag: DW_TAG_array_type, baseType: !494, size: 512, elements: !837)
!837 = !{!838, !838}
!838 = !DISubrange(count: 4)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "stabilization", scope: !770, file: !771, line: 346, baseType: !840, size: 384, offset: 1472)
!840 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStabilization", file: !771, line: 268, baseType: !841)
!841 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStabilization", file: !771, line: 253, size: 384, elements: !842)
!842 = !{!843, !844, !845, !846, !847, !891, !892, !893, !894, !895, !896}
!843 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !841, file: !771, line: 254, baseType: !263, size: 32)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "tot_track", scope: !841, file: !771, line: 255, baseType: !263, size: 32, offset: 32)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !841, file: !771, line: 255, baseType: !263, size: 32, offset: 64)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "maxscale", scope: !841, file: !771, line: 258, baseType: !494, size: 32, offset: 96)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "rot_track", scope: !841, file: !771, line: 259, baseType: !848, size: 64, offset: 128)
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !849, size: 64)
!849 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingTrack", file: !771, line: 164, baseType: !850)
!850 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingTrack", file: !771, line: 108, size: 1664, elements: !851)
!851 = !{!852, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890}
!852 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !850, file: !771, line: 109, baseType: !853, size: 64)
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !850, size: 64)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !850, file: !771, line: 109, baseType: !853, size: 64, offset: 64)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !850, file: !771, line: 111, baseType: !324, size: 512, offset: 128)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "pat_min", scope: !850, file: !771, line: 119, baseType: !572, size: 64, offset: 640)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "pat_max", scope: !850, file: !771, line: 119, baseType: !572, size: 64, offset: 704)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !850, file: !771, line: 125, baseType: !572, size: 64, offset: 768)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !850, file: !771, line: 125, baseType: !572, size: 64, offset: 832)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !850, file: !771, line: 127, baseType: !572, size: 64, offset: 896)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !850, file: !771, line: 130, baseType: !263, size: 32, offset: 960)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !850, file: !771, line: 131, baseType: !263, size: 32, offset: 992)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !850, file: !771, line: 132, baseType: !864, size: 64, offset: 1024)
!864 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !865, size: 64)
!865 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingMarker", file: !771, line: 106, baseType: !866)
!866 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingMarker", file: !771, line: 81, size: 512, elements: !867)
!867 = !{!868, !869, !872, !873, !874, !875}
!868 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !866, file: !771, line: 82, baseType: !572, size: 64)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_corners", scope: !866, file: !771, line: 97, baseType: !870, size: 256, offset: 64)
!870 = !DICompositeType(tag: DW_TAG_array_type, baseType: !494, size: 256, elements: !871)
!871 = !{!838, !574}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !866, file: !771, line: 102, baseType: !572, size: 64, offset: 320)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !866, file: !771, line: 102, baseType: !572, size: 64, offset: 384)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !866, file: !771, line: 104, baseType: !263, size: 32, offset: 448)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !866, file: !771, line: 105, baseType: !263, size: 32, offset: 480)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "bundle_pos", scope: !850, file: !771, line: 135, baseType: !541, size: 96, offset: 1088)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !850, file: !771, line: 136, baseType: !494, size: 32, offset: 1184)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !850, file: !771, line: 139, baseType: !263, size: 32, offset: 1216)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "pat_flag", scope: !850, file: !771, line: 139, baseType: !263, size: 32, offset: 1248)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "search_flag", scope: !850, file: !771, line: 139, baseType: !263, size: 32, offset: 1280)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !850, file: !771, line: 140, baseType: !541, size: 96, offset: 1312)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "frames_limit", scope: !850, file: !771, line: 143, baseType: !339, size: 16, offset: 1408)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !850, file: !771, line: 144, baseType: !339, size: 16, offset: 1424)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_match", scope: !850, file: !771, line: 145, baseType: !339, size: 16, offset: 1440)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "motion_model", scope: !850, file: !771, line: 148, baseType: !339, size: 16, offset: 1456)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm_flag", scope: !850, file: !771, line: 149, baseType: !263, size: 32, offset: 1472)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "minimum_correlation", scope: !850, file: !771, line: 150, baseType: !494, size: 32, offset: 1504)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !850, file: !771, line: 152, baseType: !569, size: 64, offset: 1536)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !850, file: !771, line: 163, baseType: !494, size: 32, offset: 1600)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !850, file: !771, line: 163, baseType: !494, size: 32, offset: 1632)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "locinf", scope: !841, file: !771, line: 261, baseType: !494, size: 32, offset: 192)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "scaleinf", scope: !841, file: !771, line: 261, baseType: !494, size: 32, offset: 224)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "rotinf", scope: !841, file: !771, line: 261, baseType: !494, size: 32, offset: 256)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !841, file: !771, line: 263, baseType: !263, size: 32, offset: 288)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !841, file: !771, line: 266, baseType: !263, size: 32, offset: 320)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !841, file: !771, line: 267, baseType: !494, size: 32, offset: 352)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !770, file: !771, line: 347, baseType: !848, size: 64, offset: 1856)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "act_plane_track", scope: !770, file: !771, line: 348, baseType: !899, size: 64, offset: 1920)
!899 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !900, size: 64)
!900 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingPlaneTrack", file: !771, line: 205, baseType: !901)
!901 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingPlaneTrack", file: !771, line: 186, size: 1024, elements: !902)
!902 = !{!903, !905, !906, !907, !909, !910, !911, !919, !920, !921, !998, !999}
!903 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !901, file: !771, line: 187, baseType: !904, size: 64)
!904 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !901, size: 64)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !901, file: !771, line: 187, baseType: !904, size: 64, offset: 64)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !901, file: !771, line: 189, baseType: !324, size: 512, offset: 128)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "point_tracks", scope: !901, file: !771, line: 191, baseType: !908, size: 64, offset: 640)
!908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !848, size: 64)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "point_tracksnr", scope: !901, file: !771, line: 193, baseType: !263, size: 32, offset: 704)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !901, file: !771, line: 193, baseType: !263, size: 32, offset: 736)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !901, file: !771, line: 195, baseType: !912, size: 64, offset: 768)
!912 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !913, size: 64)
!913 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingPlaneMarker", file: !771, line: 184, baseType: !914)
!914 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingPlaneMarker", file: !771, line: 166, size: 320, elements: !915)
!915 = !{!916, !917, !918}
!916 = !DIDerivedType(tag: DW_TAG_member, name: "corners", scope: !914, file: !771, line: 180, baseType: !870, size: 256)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !914, file: !771, line: 182, baseType: !263, size: 32, offset: 256)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !914, file: !771, line: 183, baseType: !263, size: 32, offset: 288)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !901, file: !771, line: 196, baseType: !263, size: 32, offset: 832)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !901, file: !771, line: 198, baseType: !263, size: 32, offset: 864)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "image", scope: !901, file: !771, line: 200, baseType: !922, size: 64, offset: 896)
!922 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !923, size: 64)
!923 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !708, line: 77, size: 15424, elements: !924)
!924 = !{!925, !926, !927, !930, !933, !934, !937, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !957, !958, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !984, !985, !986, !987, !988, !992}
!925 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !923, file: !708, line: 78, baseType: !402, size: 960)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !923, file: !708, line: 80, baseType: !420, size: 8192, offset: 960)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !923, file: !708, line: 82, baseType: !928, size: 64, offset: 9152)
!928 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 64)
!929 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !708, line: 43, flags: DIFlagFwdDecl)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !923, file: !708, line: 83, baseType: !931, size: 64, offset: 9216)
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 64)
!932 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !330, line: 46, flags: DIFlagFwdDecl)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !923, file: !708, line: 86, baseType: !706, size: 64, offset: 9280)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !923, file: !708, line: 87, baseType: !935, size: 64, offset: 9344)
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 64)
!936 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !708, line: 44, flags: DIFlagFwdDecl)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !923, file: !708, line: 89, baseType: !938, size: 512, offset: 9408)
!938 = !DICompositeType(tag: DW_TAG_array_type, baseType: !935, size: 512, elements: !939)
!939 = !{!940}
!940 = !DISubrange(count: 8)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !923, file: !708, line: 90, baseType: !339, size: 16, offset: 9920)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !923, file: !708, line: 90, baseType: !339, size: 16, offset: 9936)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !923, file: !708, line: 92, baseType: !339, size: 16, offset: 9952)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !923, file: !708, line: 92, baseType: !339, size: 16, offset: 9968)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !923, file: !708, line: 93, baseType: !339, size: 16, offset: 9984)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !923, file: !708, line: 93, baseType: !339, size: 16, offset: 10000)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !923, file: !708, line: 94, baseType: !263, size: 32, offset: 10016)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !923, file: !708, line: 97, baseType: !339, size: 16, offset: 10048)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !923, file: !708, line: 97, baseType: !339, size: 16, offset: 10064)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !923, file: !708, line: 98, baseType: !339, size: 16, offset: 10080)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !923, file: !708, line: 98, baseType: !339, size: 16, offset: 10096)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !923, file: !708, line: 99, baseType: !339, size: 16, offset: 10112)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !923, file: !708, line: 99, baseType: !339, size: 16, offset: 10128)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !923, file: !708, line: 100, baseType: !5, size: 32, offset: 10144)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !923, file: !708, line: 101, baseType: !956, size: 64, offset: 10176)
!956 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !923, file: !708, line: 103, baseType: !426, size: 64, offset: 10240)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !923, file: !708, line: 104, baseType: !959, size: 64, offset: 10304)
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 64)
!960 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !330, line: 159, size: 448, elements: !961)
!961 = !{!962, !964, !965, !967, !968, !970}
!962 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !960, file: !330, line: 161, baseType: !963, size: 64)
!963 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 64, elements: !573)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !960, file: !330, line: 162, baseType: !963, size: 64, offset: 64)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !960, file: !330, line: 163, baseType: !966, size: 32, offset: 128)
!966 = !DICompositeType(tag: DW_TAG_array_type, baseType: !339, size: 32, elements: !573)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !960, file: !330, line: 164, baseType: !966, size: 32, offset: 160)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !960, file: !330, line: 165, baseType: !969, size: 128, offset: 192)
!969 = !DICompositeType(tag: DW_TAG_array_type, baseType: !956, size: 128, elements: !573)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !960, file: !330, line: 166, baseType: !971, size: 128, offset: 320)
!971 = !DICompositeType(tag: DW_TAG_array_type, baseType: !931, size: 128, elements: !573)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !923, file: !708, line: 107, baseType: !494, size: 32, offset: 10368)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !923, file: !708, line: 108, baseType: !263, size: 32, offset: 10400)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !923, file: !708, line: 109, baseType: !339, size: 16, offset: 10432)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !923, file: !708, line: 110, baseType: !339, size: 16, offset: 10448)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !923, file: !708, line: 113, baseType: !263, size: 32, offset: 10464)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !923, file: !708, line: 113, baseType: !263, size: 32, offset: 10496)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !923, file: !708, line: 114, baseType: !307, size: 8, offset: 10528)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !923, file: !708, line: 114, baseType: !307, size: 8, offset: 10536)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !923, file: !708, line: 115, baseType: !339, size: 16, offset: 10544)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !923, file: !708, line: 116, baseType: !982, size: 128, offset: 10560)
!982 = !DICompositeType(tag: DW_TAG_array_type, baseType: !494, size: 128, elements: !983)
!983 = !{!838}
!984 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !923, file: !708, line: 119, baseType: !494, size: 32, offset: 10688)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !923, file: !708, line: 119, baseType: !494, size: 32, offset: 10720)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !923, file: !708, line: 122, baseType: !740, size: 512, offset: 10752)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !923, file: !708, line: 123, baseType: !307, size: 8, offset: 11264)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !923, file: !708, line: 125, baseType: !989, size: 56, offset: 11272)
!989 = !DICompositeType(tag: DW_TAG_array_type, baseType: !307, size: 56, elements: !990)
!990 = !{!991}
!991 = !DISubrange(count: 7)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !923, file: !708, line: 126, baseType: !993, size: 4096, offset: 11328)
!993 = !DICompositeType(tag: DW_TAG_array_type, baseType: !994, size: 4096, elements: !939)
!994 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !708, line: 69, baseType: !995)
!995 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !708, line: 67, size: 512, elements: !996)
!996 = !{!997}
!997 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !995, file: !708, line: 68, baseType: !324, size: 512)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "image_opacity", scope: !901, file: !771, line: 201, baseType: !494, size: 32, offset: 960)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !901, file: !771, line: 204, baseType: !263, size: 32, offset: 992)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !770, file: !771, line: 350, baseType: !348, size: 128, offset: 1984)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "objectnr", scope: !770, file: !771, line: 351, baseType: !263, size: 32, offset: 2112)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "tot_object", scope: !770, file: !771, line: 351, baseType: !263, size: 32, offset: 2144)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !770, file: !771, line: 353, baseType: !1004, size: 64, offset: 2176)
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 64)
!1005 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStats", file: !771, line: 297, baseType: !1006)
!1006 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStats", file: !771, line: 295, size: 2048, elements: !1007)
!1007 = !{!1008}
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !1006, file: !771, line: 296, baseType: !689, size: 2048)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "dopesheet", scope: !770, file: !771, line: 355, baseType: !1010, size: 384, offset: 2240)
!1010 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingDopesheet", file: !771, line: 338, baseType: !1011)
!1011 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingDopesheet", file: !771, line: 322, size: 384, elements: !1012)
!1012 = !{!1013, !1014, !1015, !1016, !1017, !1018, !1019}
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !1011, file: !771, line: 323, baseType: !263, size: 32)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "sort_method", scope: !1011, file: !771, line: 325, baseType: !339, size: 16, offset: 32)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1011, file: !771, line: 326, baseType: !339, size: 16, offset: 48)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "coverage_segments", scope: !1011, file: !771, line: 331, baseType: !348, size: 128, offset: 64)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1011, file: !771, line: 334, baseType: !348, size: 128, offset: 192)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "tot_channel", scope: !1011, file: !771, line: 335, baseType: !263, size: 32, offset: 320)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1011, file: !771, line: 337, baseType: !263, size: 32, offset: 352)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "tracking_context", scope: !752, file: !753, line: 81, baseType: !264, size: 64, offset: 12224)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !752, file: !753, line: 85, baseType: !1022, size: 6208, offset: 12288)
!1022 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipProxy", file: !753, line: 55, size: 6208, elements: !1023)
!1023 = !{!1024, !1025, !1026, !1027, !1028}
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !1022, file: !753, line: 56, baseType: !695, size: 6144)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !1022, file: !753, line: 58, baseType: !339, size: 16, offset: 6144)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1022, file: !753, line: 59, baseType: !339, size: 16, offset: 6160)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flag", scope: !1022, file: !753, line: 60, baseType: !339, size: 16, offset: 6176)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flag", scope: !1022, file: !753, line: 61, baseType: !339, size: 16, offset: 6192)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !752, file: !753, line: 86, baseType: !263, size: 32, offset: 18496)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !752, file: !753, line: 88, baseType: !263, size: 32, offset: 18528)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !752, file: !753, line: 90, baseType: !263, size: 32, offset: 18560)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "frame_offset", scope: !752, file: !753, line: 94, baseType: !263, size: 32, offset: 18592)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !752, file: !753, line: 100, baseType: !740, size: 512, offset: 18624)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !644, file: !635, line: 154, baseType: !1035, size: 64, offset: 1664)
!1035 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1036, size: 64)
!1036 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mask", file: !1037, line: 264, flags: DIFlagFwdDecl)
!1037 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_context.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !644, file: !635, line: 156, baseType: !706, size: 64, offset: 1728)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "effect_fader", scope: !644, file: !635, line: 158, baseType: !494, size: 32, offset: 1792)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "speed_fader", scope: !644, file: !635, line: 159, baseType: !494, size: 32, offset: 1824)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "seq1", scope: !644, file: !635, line: 162, baseType: !647, size: 64, offset: 1856)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "seq2", scope: !644, file: !635, line: 162, baseType: !647, size: 64, offset: 1920)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "seq3", scope: !644, file: !635, line: 162, baseType: !647, size: 64, offset: 1984)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !644, file: !635, line: 164, baseType: !348, size: 128, offset: 2048)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "sound", scope: !644, file: !635, line: 166, baseType: !1046, size: 64, offset: 2176)
!1046 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1047, size: 64)
!1047 = !DICompositeType(tag: DW_TAG_structure_type, name: "bSound", file: !1048, line: 39, flags: DIFlagFwdDecl)
!1048 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_sound.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "scene_sound", scope: !644, file: !635, line: 167, baseType: !264, size: 64, offset: 2240)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "volume", scope: !644, file: !635, line: 168, baseType: !494, size: 32, offset: 2304)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "pitch", scope: !644, file: !635, line: 170, baseType: !494, size: 32, offset: 2336)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "pan", scope: !644, file: !635, line: 170, baseType: !494, size: 32, offset: 2368)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "strobe", scope: !644, file: !635, line: 171, baseType: !494, size: 32, offset: 2400)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "effectdata", scope: !644, file: !635, line: 173, baseType: !264, size: 64, offset: 2432)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "anim_startofs", scope: !644, file: !635, line: 175, baseType: !263, size: 32, offset: 2496)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "anim_endofs", scope: !644, file: !635, line: 176, baseType: !263, size: 32, offset: 2528)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "blend_mode", scope: !644, file: !635, line: 179, baseType: !263, size: 32, offset: 2560)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "blend_opacity", scope: !644, file: !635, line: 180, baseType: !494, size: 32, offset: 2592)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !644, file: !635, line: 183, baseType: !263, size: 32, offset: 2624)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !644, file: !635, line: 185, baseType: !307, size: 8, offset: 2656)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !644, file: !635, line: 186, baseType: !1062, size: 24, offset: 2664)
!1062 = !DICompositeType(tag: DW_TAG_array_type, baseType: !307, size: 24, elements: !542)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !644, file: !635, line: 189, baseType: !348, size: 128, offset: 2688)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "act_imagedir", scope: !634, file: !635, line: 207, baseType: !420, size: 8192, offset: 384)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "act_sounddir", scope: !634, file: !635, line: 208, baseType: !420, size: 8192, offset: 8576)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "over_ofs", scope: !634, file: !635, line: 210, baseType: !263, size: 32, offset: 16768)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "over_cfra", scope: !634, file: !635, line: 210, baseType: !263, size: 32, offset: 16800)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "over_flag", scope: !634, file: !635, line: 211, baseType: !263, size: 32, offset: 16832)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !634, file: !635, line: 211, baseType: !263, size: 32, offset: 16864)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "over_border", scope: !634, file: !635, line: 212, baseType: !590, size: 128, offset: 16896)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "toolsettings", scope: !443, file: !444, line: 1246, baseType: !1072, size: 64, offset: 2112)
!1072 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1073, size: 64)
!1073 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolSettings", file: !444, line: 1067, size: 5184, elements: !1074)
!1074 = !{!1075, !1105, !1106, !1121, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1143, !1159, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1193, !1194, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1216, !1217, !1218, !1219, !1220, !1221, !1222, !1223, !1224, !1225, !1226, !1227, !1228, !1229, !1230, !1231, !1232, !1233, !1234, !1235, !1236, !1237, !1238, !1239, !1240, !1241, !1269}
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint", scope: !1073, file: !444, line: 1068, baseType: !1076, size: 64)
!1076 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1077, size: 64)
!1077 = !DIDerivedType(tag: DW_TAG_typedef, name: "VPaint", file: !444, line: 934, baseType: !1078)
!1078 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VPaint", file: !444, line: 925, size: 576, elements: !1079)
!1079 = !{!1080, !1097, !1098, !1099, !1100, !1101, !1104}
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !1078, file: !444, line: 926, baseType: !1081, size: 320)
