; ModuleID = 'blender/source/blender/blenkernel/intern/report.c'
source_filename = "blender/source/blender/blenkernel/intern/report.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.Global = type { %struct.Main*, [1024 x i8], [1024 x i8], i8, i8, i8, %struct.ListBase, i8, i8, i8, i16, i16, i16, i8, i16, i32, i32, i8, i32, i32, [200 x i8] }
%struct.Main = type opaque
%struct.ListBase = type { i8*, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.ReportList = type { %struct.ListBase, i32, i32, i32, i32, %struct.wmTimer* }
%struct.wmTimer = type opaque
%struct.Report = type { %struct.Report*, %struct.Report*, i16, i16, i32, i8*, i8* }
%struct.DynStr = type opaque
%struct.__va_list_tag = type { i32, i32, i8*, i8* }

@MEM_freeN = external dso_local global void (i8*)*, align 8
@G = external dso_local global %struct.Global, align 8
@.str = private unnamed_addr constant [8 x i8] c"%s: %s\0A\00", align 1
@stdout = external dso_local global %struct._IO_FILE*, align 8
@MEM_callocN = external dso_local global i8* (i64, i8*)*, align 8

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !22, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "blender/source/blender/blenkernel/intern/report.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!2 = !{!3, !16}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ReportType", file: !4, line: 67, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "blender/source/blender/makesdna/DNA_windowmanager_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9, !10, !11, !12, !13, !14, !15}
!7 = !DIEnumerator(name: "RPT_DEBUG", value: 1, isUnsigned: true)
!8 = !DIEnumerator(name: "RPT_INFO", value: 2, isUnsigned: true)
!9 = !DIEnumerator(name: "RPT_OPERATOR", value: 4, isUnsigned: true)
!10 = !DIEnumerator(name: "RPT_PROPERTY", value: 8, isUnsigned: true)
!11 = !DIEnumerator(name: "RPT_WARNING", value: 16, isUnsigned: true)
!12 = !DIEnumerator(name: "RPT_ERROR", value: 32, isUnsigned: true)
!13 = !DIEnumerator(name: "RPT_ERROR_INVALID_INPUT", value: 64, isUnsigned: true)
!14 = !DIEnumerator(name: "RPT_ERROR_INVALID_CONTEXT", value: 128, isUnsigned: true)
!15 = !DIEnumerator(name: "RPT_ERROR_OUT_OF_MEMORY", value: 256, isUnsigned: true)
!16 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ReportListFlags", file: !4, line: 86, baseType: !5, size: 32, elements: !17)
!17 = !{!18, !19, !20, !21}
!18 = !DIEnumerator(name: "RPT_PRINT", value: 1, isUnsigned: true)
!19 = !DIEnumerator(name: "RPT_STORE", value: 2, isUnsigned: true)
!20 = !DIEnumerator(name: "RPT_FREE", value: 4, isUnsigned: true)
!21 = !DIEnumerator(name: "RPT_OP_HOLD", value: 8, isUnsigned: true)
!22 = !{!23, !24}
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !26, line: 7, baseType: !27)
!26 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!27 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !28, line: 49, size: 1728, elements: !29)
!28 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!29 = !{!30, !32, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !48, !50, !51, !52, !56, !58, !60, !64, !67, !69, !72, !75, !76, !77, !81, !82}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !27, file: !28, line: 51, baseType: !31, size: 32)
!31 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !27, file: !28, line: 54, baseType: !33, size: 64, offset: 64)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!34 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !27, file: !28, line: 55, baseType: !33, size: 64, offset: 128)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !27, file: !28, line: 56, baseType: !33, size: 64, offset: 192)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !27, file: !28, line: 57, baseType: !33, size: 64, offset: 256)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !27, file: !28, line: 58, baseType: !33, size: 64, offset: 320)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !27, file: !28, line: 59, baseType: !33, size: 64, offset: 384)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !27, file: !28, line: 60, baseType: !33, size: 64, offset: 448)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !27, file: !28, line: 61, baseType: !33, size: 64, offset: 512)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !27, file: !28, line: 64, baseType: !33, size: 64, offset: 576)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !27, file: !28, line: 65, baseType: !33, size: 64, offset: 640)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !27, file: !28, line: 66, baseType: !33, size: 64, offset: 704)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !27, file: !28, line: 68, baseType: !46, size: 64, offset: 768)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!47 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !28, line: 36, flags: DIFlagFwdDecl)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !27, file: !28, line: 70, baseType: !49, size: 64, offset: 832)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !27, file: !28, line: 72, baseType: !31, size: 32, offset: 896)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !27, file: !28, line: 73, baseType: !31, size: 32, offset: 928)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !27, file: !28, line: 74, baseType: !53, size: 64, offset: 960)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !54, line: 152, baseType: !55)
!54 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!55 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !27, file: !28, line: 77, baseType: !57, size: 16, offset: 1024)
!57 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !27, file: !28, line: 78, baseType: !59, size: 8, offset: 1040)
!59 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !27, file: !28, line: 79, baseType: !61, size: 8, offset: 1048)
!61 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 8, elements: !62)
!62 = !{!63}
!63 = !DISubrange(count: 1)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !27, file: !28, line: 81, baseType: !65, size: 64, offset: 1088)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !28, line: 43, baseType: null)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !27, file: !28, line: 89, baseType: !68, size: 64, offset: 1152)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !54, line: 153, baseType: !55)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !27, file: !28, line: 91, baseType: !70, size: 64, offset: 1216)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !28, line: 37, flags: DIFlagFwdDecl)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !27, file: !28, line: 92, baseType: !73, size: 64, offset: 1280)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !28, line: 38, flags: DIFlagFwdDecl)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !27, file: !28, line: 93, baseType: !49, size: 64, offset: 1344)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !27, file: !28, line: 94, baseType: !23, size: 64, offset: 1408)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !27, file: !28, line: 95, baseType: !78, size: 64, offset: 1472)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !79, line: 46, baseType: !80)
!79 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!80 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !27, file: !28, line: 96, baseType: !31, size: 32, offset: 1536)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !27, file: !28, line: 98, baseType: !83, size: 160, offset: 1568)
!83 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 160, elements: !84)
!84 = !{!85}
!85 = !DISubrange(count: 20)
!86 = !{i32 7, !"Dwarf Version", i32 4}
!87 = !{i32 2, !"Debug Info Version", i32 3}
!88 = !{i32 1, !"wchar_size", i32 4}
!89 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!90 = distinct !DISubprogram(name: "BKE_reports_init", scope: !1, file: !1, line: 72, type: !91, scopeLine: 73, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !111)
!91 = !DISubroutineType(types: !92)
!92 = !{null, !93, !31}
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "ReportList", file: !4, line: 112, baseType: !95)
!95 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ReportList", file: !4, line: 106, size: 320, elements: !96)
!96 = !{!97, !104, !105, !106, !107, !108}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !95, file: !4, line: 107, baseType: !98, size: 128)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !99, line: 71, baseType: !100)
!99 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !99, line: 69, size: 128, elements: !101)
!101 = !{!102, !103}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !100, file: !99, line: 70, baseType: !23, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !100, file: !99, line: 70, baseType: !23, size: 64, offset: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "printlevel", scope: !95, file: !4, line: 108, baseType: !31, size: 32, offset: 128)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "storelevel", scope: !95, file: !4, line: 109, baseType: !31, size: 32, offset: 160)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !95, file: !4, line: 110, baseType: !31, size: 32, offset: 192)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !95, file: !4, line: 110, baseType: !31, size: 32, offset: 224)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "reporttimer", scope: !95, file: !4, line: 111, baseType: !109, size: 64, offset: 256)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = !DICompositeType(tag: DW_TAG_structure_type, name: "wmTimer", file: !4, line: 56, flags: DIFlagFwdDecl)
!111 = !{}
!112 = !DILocalVariable(name: "reports", arg: 1, scope: !90, file: !1, line: 72, type: !93)
!113 = !DILocation(line: 72, column: 35, scope: !90)
!114 = !DILocalVariable(name: "flag", arg: 2, scope: !90, file: !1, line: 72, type: !31)
!115 = !DILocation(line: 72, column: 48, scope: !90)
!116 = !DILocation(line: 74, column: 7, scope: !117)
!117 = distinct !DILexicalBlock(scope: !90, file: !1, line: 74, column: 6)
!118 = !DILocation(line: 74, column: 6, scope: !90)
!119 = !DILocation(line: 75, column: 3, scope: !117)
!120 = !DILocation(line: 77, column: 9, scope: !90)
!121 = !DILocation(line: 77, column: 2, scope: !90)
!122 = !DILocation(line: 79, column: 2, scope: !90)
!123 = !DILocation(line: 79, column: 11, scope: !90)
!124 = !DILocation(line: 79, column: 22, scope: !90)
!125 = !DILocation(line: 80, column: 2, scope: !90)
!126 = !DILocation(line: 80, column: 11, scope: !90)
!127 = !DILocation(line: 80, column: 22, scope: !90)
!128 = !DILocation(line: 81, column: 18, scope: !90)
!129 = !DILocation(line: 81, column: 2, scope: !90)
!130 = !DILocation(line: 81, column: 11, scope: !90)
!131 = !DILocation(line: 81, column: 16, scope: !90)
!132 = !DILocation(line: 82, column: 1, scope: !90)
!133 = distinct !DISubprogram(name: "BKE_reports_clear", scope: !1, file: !1, line: 84, type: !134, scopeLine: 85, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !111)
!134 = !DISubroutineType(types: !135)
!135 = !{null, !93}
!136 = !DILocalVariable(name: "reports", arg: 1, scope: !133, file: !1, line: 84, type: !93)
!137 = !DILocation(line: 84, column: 36, scope: !133)
!138 = !DILocalVariable(name: "report", scope: !133, file: !1, line: 86, type: !139)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "Report", file: !4, line: 103, baseType: !141)
!141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Report", file: !4, line: 96, size: 320, elements: !142)
!142 = !{!143, !145, !146, !148, !149, !150, !153}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !141, file: !4, line: 97, baseType: !144, size: 64)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !141, file: !4, line: 97, baseType: !144, size: 64, offset: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !141, file: !4, line: 98, baseType: !147, size: 16, offset: 128)
!147 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !141, file: !4, line: 99, baseType: !147, size: 16, offset: 144)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !141, file: !4, line: 100, baseType: !31, size: 32, offset: 160)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "typestr", scope: !141, file: !4, line: 101, baseType: !151, size: 64, offset: 192)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !34)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !141, file: !4, line: 102, baseType: !151, size: 64, offset: 256)
!154 = !DILocation(line: 86, column: 10, scope: !133)
!155 = !DILocalVariable(name: "report_next", scope: !133, file: !1, line: 86, type: !139)
!156 = !DILocation(line: 86, column: 19, scope: !133)
!157 = !DILocation(line: 88, column: 7, scope: !158)
!158 = distinct !DILexicalBlock(scope: !133, file: !1, line: 88, column: 6)
!159 = !DILocation(line: 88, column: 6, scope: !133)
!160 = !DILocation(line: 89, column: 3, scope: !158)
!161 = !DILocation(line: 91, column: 11, scope: !133)
!162 = !DILocation(line: 91, column: 20, scope: !133)
!163 = !DILocation(line: 91, column: 25, scope: !133)
!164 = !DILocation(line: 91, column: 9, scope: !133)
!165 = !DILocation(line: 93, column: 2, scope: !133)
!166 = !DILocation(line: 93, column: 9, scope: !133)
!167 = !DILocation(line: 94, column: 17, scope: !168)
!168 = distinct !DILexicalBlock(scope: !133, file: !1, line: 93, column: 17)
!169 = !DILocation(line: 94, column: 25, scope: !168)
!170 = !DILocation(line: 94, column: 15, scope: !168)
!171 = !DILocation(line: 95, column: 3, scope: !168)
!172 = !DILocation(line: 95, column: 21, scope: !168)
!173 = !DILocation(line: 95, column: 29, scope: !168)
!174 = !DILocation(line: 96, column: 3, scope: !168)
!175 = !DILocation(line: 96, column: 13, scope: !168)
!176 = !DILocation(line: 97, column: 12, scope: !168)
!177 = !DILocation(line: 97, column: 10, scope: !168)
!178 = distinct !{!178, !165, !179}
!179 = !DILocation(line: 98, column: 2, scope: !133)
!180 = !DILocation(line: 100, column: 22, scope: !133)
!181 = !DILocation(line: 100, column: 31, scope: !133)
!182 = !DILocation(line: 100, column: 2, scope: !133)
!183 = !DILocation(line: 101, column: 1, scope: !133)
!184 = distinct !DISubprogram(name: "BLI_listbase_clear", scope: !185, file: !185, line: 89, type: !186, scopeLine: 89, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !111)
!185 = !DIFile(filename: "blender/source/blender/blenlib/BLI_listbase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!186 = !DISubroutineType(types: !187)
!187 = !{null, !188}
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!189 = !DILocalVariable(name: "lb", arg: 1, scope: !184, file: !185, line: 89, type: !188)
!190 = !DILocation(line: 89, column: 53, scope: !184)
!191 = !DILocation(line: 89, column: 71, scope: !184)
!192 = !DILocation(line: 89, column: 75, scope: !184)
!193 = !DILocation(line: 89, column: 80, scope: !184)
!194 = !DILocation(line: 89, column: 59, scope: !184)
!195 = !DILocation(line: 89, column: 63, scope: !184)
!196 = !DILocation(line: 89, column: 69, scope: !184)
!197 = !DILocation(line: 89, column: 93, scope: !184)
!198 = distinct !DISubprogram(name: "BKE_report", scope: !1, file: !1, line: 103, type: !199, scopeLine: 104, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !111)
!199 = !DISubroutineType(types: !200)
!200 = !{null, !93, !201, !151}
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "ReportType", file: !4, line: 77, baseType: !3)
!202 = !DILocalVariable(name: "reports", arg: 1, scope: !198, file: !1, line: 103, type: !93)
!203 = !DILocation(line: 103, column: 29, scope: !198)
!204 = !DILocalVariable(name: "type", arg: 2, scope: !198, file: !1, line: 103, type: !201)
!205 = !DILocation(line: 103, column: 49, scope: !198)
!206 = !DILocalVariable(name: "_message", arg: 3, scope: !198, file: !1, line: 103, type: !151)
!207 = !DILocation(line: 103, column: 67, scope: !198)
!208 = !DILocalVariable(name: "report", scope: !198, file: !1, line: 105, type: !139)
!209 = !DILocation(line: 105, column: 10, scope: !198)
!210 = !DILocalVariable(name: "len", scope: !198, file: !1, line: 106, type: !31)
!211 = !DILocation(line: 106, column: 6, scope: !198)
!212 = !DILocalVariable(name: "message", scope: !198, file: !1, line: 107, type: !151)
!213 = !DILocation(line: 107, column: 14, scope: !198)
!214 = !DILocation(line: 107, column: 24, scope: !198)
!215 = !DILocation(line: 111, column: 8, scope: !216)
!216 = distinct !DILexicalBlock(scope: !198, file: !1, line: 111, column: 6)
!217 = !DILocation(line: 111, column: 6, scope: !216)
!218 = !DILocation(line: 111, column: 19, scope: !216)
!219 = !DILocation(line: 111, column: 23, scope: !216)
!220 = !DILocation(line: 111, column: 31, scope: !216)
!221 = !DILocation(line: 111, column: 36, scope: !216)
!222 = !DILocation(line: 111, column: 45, scope: !216)
!223 = !DILocation(line: 111, column: 50, scope: !216)
!224 = !DILocation(line: 111, column: 63, scope: !216)
!225 = !DILocation(line: 111, column: 67, scope: !216)
!226 = !DILocation(line: 111, column: 75, scope: !216)
!227 = !DILocation(line: 111, column: 84, scope: !216)
!228 = !DILocation(line: 111, column: 72, scope: !216)
!229 = !DILocation(line: 111, column: 6, scope: !198)
!230 = !DILocation(line: 112, column: 38, scope: !231)
!231 = distinct !DILexicalBlock(scope: !216, file: !1, line: 111, column: 98)
!232 = !DILocation(line: 112, column: 22, scope: !231)
!233 = !DILocation(line: 112, column: 45, scope: !231)
!234 = !DILocation(line: 112, column: 3, scope: !231)
!235 = !DILocation(line: 113, column: 10, scope: !231)
!236 = !DILocation(line: 113, column: 3, scope: !231)
!237 = !DILocation(line: 114, column: 2, scope: !231)
!238 = !DILocation(line: 116, column: 6, scope: !239)
!239 = distinct !DILexicalBlock(scope: !198, file: !1, line: 116, column: 6)
!240 = !DILocation(line: 116, column: 14, scope: !239)
!241 = !DILocation(line: 116, column: 18, scope: !239)
!242 = !DILocation(line: 116, column: 27, scope: !239)
!243 = !DILocation(line: 116, column: 32, scope: !239)
!244 = !DILocation(line: 116, column: 45, scope: !239)
!245 = !DILocation(line: 116, column: 49, scope: !239)
!246 = !DILocation(line: 116, column: 57, scope: !239)
!247 = !DILocation(line: 116, column: 66, scope: !239)
!248 = !DILocation(line: 116, column: 54, scope: !239)
!249 = !DILocation(line: 116, column: 6, scope: !198)
!250 = !DILocalVariable(name: "message_alloc", scope: !251, file: !1, line: 117, type: !33)
!251 = distinct !DILexicalBlock(scope: !239, file: !1, line: 116, column: 79)
!252 = !DILocation(line: 117, column: 9, scope: !251)
!253 = !DILocation(line: 118, column: 12, scope: !251)
!254 = !DILocation(line: 118, column: 10, scope: !251)
!255 = !DILocation(line: 119, column: 18, scope: !251)
!256 = !DILocation(line: 119, column: 3, scope: !251)
!257 = !DILocation(line: 119, column: 11, scope: !251)
!258 = !DILocation(line: 119, column: 16, scope: !251)
!259 = !DILocation(line: 120, column: 37, scope: !251)
!260 = !DILocation(line: 120, column: 21, scope: !251)
!261 = !DILocation(line: 120, column: 3, scope: !251)
!262 = !DILocation(line: 120, column: 11, scope: !251)
!263 = !DILocation(line: 120, column: 19, scope: !251)
!264 = !DILocation(line: 122, column: 16, scope: !251)
!265 = !DILocation(line: 122, column: 9, scope: !251)
!266 = !DILocation(line: 122, column: 7, scope: !251)
!267 = !DILocation(line: 123, column: 19, scope: !251)
!268 = !DILocation(line: 123, column: 47, scope: !251)
!269 = !DILocation(line: 123, column: 51, scope: !251)
!270 = !DILocation(line: 123, column: 46, scope: !251)
!271 = !DILocation(line: 123, column: 44, scope: !251)
!272 = !DILocation(line: 123, column: 17, scope: !251)
!273 = !DILocation(line: 124, column: 10, scope: !251)
!274 = !DILocation(line: 124, column: 25, scope: !251)
!275 = !DILocation(line: 124, column: 50, scope: !251)
!276 = !DILocation(line: 124, column: 54, scope: !251)
!277 = !DILocation(line: 124, column: 49, scope: !251)
!278 = !DILocation(line: 124, column: 47, scope: !251)
!279 = !DILocation(line: 124, column: 3, scope: !251)
!280 = !DILocation(line: 125, column: 21, scope: !251)
!281 = !DILocation(line: 125, column: 3, scope: !251)
!282 = !DILocation(line: 125, column: 11, scope: !251)
!283 = !DILocation(line: 125, column: 19, scope: !251)
!284 = !DILocation(line: 126, column: 17, scope: !251)
!285 = !DILocation(line: 126, column: 3, scope: !251)
!286 = !DILocation(line: 126, column: 11, scope: !251)
!287 = !DILocation(line: 126, column: 15, scope: !251)
!288 = !DILocation(line: 127, column: 16, scope: !251)
!289 = !DILocation(line: 127, column: 25, scope: !251)
!290 = !DILocation(line: 127, column: 31, scope: !251)
!291 = !DILocation(line: 127, column: 3, scope: !251)
!292 = !DILocation(line: 128, column: 2, scope: !251)
!293 = !DILocation(line: 129, column: 1, scope: !198)
!294 = distinct !DISubprogram(name: "report_type_str", scope: !1, file: !1, line: 46, type: !295, scopeLine: 47, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !111)
!295 = !DISubroutineType(types: !296)
!296 = !{!151, !31}
!297 = !DILocalVariable(name: "type", arg: 1, scope: !294, file: !1, line: 46, type: !31)
!298 = !DILocation(line: 46, column: 40, scope: !294)
!299 = !DILocation(line: 48, column: 10, scope: !294)
!300 = !DILocation(line: 48, column: 2, scope: !294)
!301 = !DILocation(line: 50, column: 4, scope: !302)
!302 = distinct !DILexicalBlock(scope: !294, file: !1, line: 48, column: 16)
!303 = !DILocation(line: 52, column: 4, scope: !302)
!304 = !DILocation(line: 54, column: 4, scope: !302)
!305 = !DILocation(line: 56, column: 4, scope: !302)
!306 = !DILocation(line: 58, column: 4, scope: !302)
!307 = !DILocation(line: 60, column: 4, scope: !302)
!308 = !DILocation(line: 62, column: 4, scope: !302)
!309 = !DILocation(line: 64, column: 4, scope: !302)
!310 = !DILocation(line: 66, column: 4, scope: !302)
!311 = !DILocation(line: 68, column: 4, scope: !302)
!312 = !DILocation(line: 70, column: 1, scope: !294)
!313 = distinct !DISubprogram(name: "BKE_reportf", scope: !1, file: !1, line: 131, type: !314, scopeLine: 132, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !111)
!314 = !DISubroutineType(types: !315)
!315 = !{null, !93, !201, !151, null}
!316 = !DILocalVariable(name: "reports", arg: 1, scope: !313, file: !1, line: 131, type: !93)
!317 = !DILocation(line: 131, column: 30, scope: !313)
!318 = !DILocalVariable(name: "type", arg: 2, scope: !313, file: !1, line: 131, type: !201)
!319 = !DILocation(line: 131, column: 50, scope: !313)
!320 = !DILocalVariable(name: "_format", arg: 3, scope: !313, file: !1, line: 131, type: !151)
!321 = !DILocation(line: 131, column: 68, scope: !313)
!322 = !DILocalVariable(name: "ds", scope: !313, file: !1, line: 133, type: !323)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "DynStr", file: !325, line: 48, baseType: !326)
!325 = !DIFile(filename: "blender/source/blender/blenlib/BLI_dynstr.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!326 = !DICompositeType(tag: DW_TAG_structure_type, name: "DynStr", file: !325, line: 45, flags: DIFlagFwdDecl)
!327 = !DILocation(line: 133, column: 10, scope: !313)
!328 = !DILocalVariable(name: "report", scope: !313, file: !1, line: 134, type: !139)
!329 = !DILocation(line: 134, column: 10, scope: !313)
!330 = !DILocalVariable(name: "args", scope: !313, file: !1, line: 135, type: !331)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !332, line: 52, baseType: !333)
!332 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !334, line: 32, baseType: !335)
!334 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stdarg.h", directory: "/home/venkat/IF-DV")
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !1, line: 135, baseType: !336)
!336 = !DICompositeType(tag: DW_TAG_array_type, baseType: !337, size: 192, elements: !62)
!337 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, line: 135, size: 192, elements: !338)
!338 = !{!339, !340, !341, !342}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !337, file: !1, line: 135, baseType: !5, size: 32)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !337, file: !1, line: 135, baseType: !5, size: 32, offset: 32)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !337, file: !1, line: 135, baseType: !23, size: 64, offset: 64)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !337, file: !1, line: 135, baseType: !23, size: 64, offset: 128)
!343 = !DILocation(line: 135, column: 10, scope: !313)
!344 = !DILocalVariable(name: "format", scope: !313, file: !1, line: 136, type: !151)
!345 = !DILocation(line: 136, column: 14, scope: !313)
!346 = !DILocation(line: 136, column: 23, scope: !313)
!347 = !DILocation(line: 138, column: 8, scope: !348)
!348 = distinct !DILexicalBlock(scope: !313, file: !1, line: 138, column: 6)
!349 = !DILocation(line: 138, column: 6, scope: !348)
!350 = !DILocation(line: 138, column: 19, scope: !348)
!351 = !DILocation(line: 138, column: 23, scope: !348)
!352 = !DILocation(line: 138, column: 31, scope: !348)
!353 = !DILocation(line: 138, column: 36, scope: !348)
!354 = !DILocation(line: 138, column: 45, scope: !348)
!355 = !DILocation(line: 138, column: 50, scope: !348)
!356 = !DILocation(line: 138, column: 63, scope: !348)
!357 = !DILocation(line: 138, column: 67, scope: !348)
!358 = !DILocation(line: 138, column: 75, scope: !348)
!359 = !DILocation(line: 138, column: 84, scope: !348)
!360 = !DILocation(line: 138, column: 72, scope: !348)
!361 = !DILocation(line: 138, column: 6, scope: !313)
!362 = !DILocation(line: 139, column: 34, scope: !363)
!363 = distinct !DILexicalBlock(scope: !348, file: !1, line: 138, column: 98)
!364 = !DILocation(line: 139, column: 18, scope: !363)
!365 = !DILocation(line: 139, column: 3, scope: !363)
!366 = !DILocation(line: 140, column: 3, scope: !363)
!367 = !DILocation(line: 141, column: 11, scope: !363)
!368 = !DILocation(line: 141, column: 19, scope: !363)
!369 = !DILocation(line: 141, column: 3, scope: !363)
!370 = !DILocation(line: 142, column: 3, scope: !363)
!371 = !DILocation(line: 143, column: 11, scope: !363)
!372 = !DILocation(line: 143, column: 3, scope: !363)
!373 = !DILocation(line: 144, column: 10, scope: !363)
!374 = !DILocation(line: 144, column: 3, scope: !363)
!375 = !DILocation(line: 145, column: 2, scope: !363)
!376 = !DILocation(line: 147, column: 6, scope: !377)
!377 = distinct !DILexicalBlock(scope: !313, file: !1, line: 147, column: 6)
!378 = !DILocation(line: 147, column: 14, scope: !377)
!379 = !DILocation(line: 147, column: 18, scope: !377)
!380 = !DILocation(line: 147, column: 27, scope: !377)
!381 = !DILocation(line: 147, column: 32, scope: !377)
!382 = !DILocation(line: 147, column: 45, scope: !377)
!383 = !DILocation(line: 147, column: 49, scope: !377)
!384 = !DILocation(line: 147, column: 57, scope: !377)
!385 = !DILocation(line: 147, column: 66, scope: !377)
!386 = !DILocation(line: 147, column: 54, scope: !377)
!387 = !DILocation(line: 147, column: 6, scope: !313)
!388 = !DILocation(line: 148, column: 12, scope: !389)
!389 = distinct !DILexicalBlock(scope: !377, file: !1, line: 147, column: 79)
!390 = !DILocation(line: 148, column: 10, scope: !389)
!391 = !DILocation(line: 150, column: 8, scope: !389)
!392 = !DILocation(line: 150, column: 6, scope: !389)
!393 = !DILocation(line: 151, column: 3, scope: !389)
!394 = !DILocation(line: 152, column: 23, scope: !389)
!395 = !DILocation(line: 152, column: 27, scope: !389)
!396 = !DILocation(line: 152, column: 35, scope: !389)
!397 = !DILocation(line: 152, column: 3, scope: !389)
!398 = !DILocation(line: 153, column: 3, scope: !389)
!399 = !DILocation(line: 155, column: 44, scope: !389)
!400 = !DILocation(line: 155, column: 21, scope: !389)
!401 = !DILocation(line: 155, column: 3, scope: !389)
!402 = !DILocation(line: 155, column: 11, scope: !389)
!403 = !DILocation(line: 155, column: 19, scope: !389)
!404 = !DILocation(line: 156, column: 36, scope: !389)
!405 = !DILocation(line: 156, column: 17, scope: !389)
!406 = !DILocation(line: 156, column: 3, scope: !389)
!407 = !DILocation(line: 156, column: 11, scope: !389)
!408 = !DILocation(line: 156, column: 15, scope: !389)
!409 = !DILocation(line: 157, column: 19, scope: !389)
!410 = !DILocation(line: 157, column: 3, scope: !389)
