; ModuleID = 'blender/source/blender/blenkernel/intern/multires.c'
source_filename = "blender/source/blender/blenkernel/intern/multires.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.Mesh = type { %struct.ID, %struct.AnimData*, %struct.BoundBox*, %struct.Ipo*, %struct.Key*, %struct.Material**, %struct.MSelect*, %struct.MPoly*, %struct.MTexPoly*, %struct.MLoop*, %struct.MLoopUV*, %struct.MLoopCol*, %struct.MFace*, %struct.MTFace*, %struct.TFace*, %struct.MVert*, %struct.MEdge*, %struct.MDeformVert*, %struct.MCol*, %struct.Mesh*, %struct.BMEditMesh*, %struct.CustomData, %struct.CustomData, %struct.CustomData, %struct.CustomData, %struct.CustomData, i32, i32, i32, i32, i32, i32, i32, [3 x float], [3 x float], [3 x float], i32, i16, i16, float, i32, i8, i8, i8, i8, i8, i8, i16, %struct.Multires* }
%struct.ID = type { i8*, i8*, %struct.ID*, %struct.Library*, [66 x i8], i16, i32, i32, i32, %struct.IDProperty* }
%struct.Library = type { %struct.ID, %struct.ID*, %struct.FileData*, [1024 x i8], [1024 x i8], %struct.Library*, %struct.PackedFile* }
%struct.FileData = type opaque
%struct.PackedFile = type opaque
%struct.IDProperty = type { %struct.IDProperty*, %struct.IDProperty*, i8, i8, i16, [64 x i8], i32, %struct.IDPropertyData, i32, i32 }
%struct.IDPropertyData = type { i8*, %struct.ListBase, i32, i32 }
%struct.ListBase = type { i8*, i8* }
%struct.AnimData = type opaque

!201 = !DIEnumerator(name: "eModifierMode_OnCage", value: 8)
!202 = !DIEnumerator(name: "eModifierMode_Expanded", value: 16)
!203 = !DIEnumerator(name: "eModifierMode_Virtual", value: 32)
!204 = !DIEnumerator(name: "eModifierMode_ApplyOnSpline", value: 64)
!205 = !DIEnumerator(name: "eModifierMode_DisableTemporary", value: -2147483648)
!206 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ObjectMode", file: !207, line: 666, baseType: !7, size: 32, elements: !208)
!207 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!208 = !{!209, !210, !211, !212, !213, !214, !215, !216}
!209 = !DIEnumerator(name: "OB_MODE_OBJECT", value: 0, isUnsigned: true)
!210 = !DIEnumerator(name: "OB_MODE_EDIT", value: 1, isUnsigned: true)
!211 = !DIEnumerator(name: "OB_MODE_SCULPT", value: 2, isUnsigned: true)
!212 = !DIEnumerator(name: "OB_MODE_VERTEX_PAINT", value: 4, isUnsigned: true)
!213 = !DIEnumerator(name: "OB_MODE_WEIGHT_PAINT", value: 8, isUnsigned: true)
!214 = !DIEnumerator(name: "OB_MODE_TEXTURE_PAINT", value: 16, isUnsigned: true)
!215 = !DIEnumerator(name: "OB_MODE_PARTICLE_EDIT", value: 32, isUnsigned: true)
!216 = !DIEnumerator(name: "OB_MODE_POSE", value: 64, isUnsigned: true)
!217 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "MultiresModifiedFlags", file: !218, line: 90, baseType: !7, size: 32, elements: !219)
!218 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_subsurf.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!219 = !{!220, !221}
!220 = !DIEnumerator(name: "MULTIRES_COORDS_MODIFIED", value: 1, isUnsigned: true)
!221 = !DIEnumerator(name: "MULTIRES_HIDDEN_MODIFIED", value: 2, isUnsigned: true)
!222 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !143, line: 724, baseType: !7, size: 32, elements: !223)
!223 = !{!224, !225}
!224 = !DIEnumerator(name: "eMultiresModifierFlag_ControlEdges", value: 1, isUnsigned: true)
!225 = !DIEnumerator(name: "eMultiresModifierFlag_PlainUv", value: 2, isUnsigned: true)
!226 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 73, baseType: !7, size: 32, elements: !227)
!227 = !{!228, !229, !230}
!228 = !DIEnumerator(name: "APPLY_DISPLACEMENTS", value: 0, isUnsigned: true)
!229 = !DIEnumerator(name: "CALC_DISPLACEMENTS", value: 1, isUnsigned: true)
!230 = !DIEnumerator(name: "ADD_DISPLACEMENTS", value: 2, isUnsigned: true)
!231 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !232, line: 101, baseType: !7, size: 32, elements: !233)
!232 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_multires.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!233 = !{!234, !235, !236}
!234 = !DIEnumerator(name: "MULTIRES_SPACE_TANGENT", value: 0, isUnsigned: true)
!235 = !DIEnumerator(name: "MULTIRES_SPACE_OBJECT", value: 1, isUnsigned: true)
!236 = !DIEnumerator(name: "MULTIRES_SPACE_ABSOLUTE", value: 2, isUnsigned: true)
!237 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !232, line: 70, baseType: !7, size: 32, elements: !238)
!238 = !{!239, !240, !241, !242}
!239 = !DIEnumerator(name: "MULTIRES_USE_LOCAL_MMD", value: 1, isUnsigned: true)
!240 = !DIEnumerator(name: "MULTIRES_USE_RENDER_PARAMS", value: 2, isUnsigned: true)
!241 = !DIEnumerator(name: "MULTIRES_ALLOC_PAINT_MASK", value: 4, isUnsigned: true)
!242 = !DIEnumerator(name: "MULTIRES_IGNORE_SIMPLIFY", value: 8, isUnsigned: true)
!243 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !218, line: 58, baseType: !7, size: 32, elements: !244)
!244 = !{!245, !246, !247, !248, !249}
!245 = !DIEnumerator(name: "SUBSURF_USE_RENDER_PARAMS", value: 1, isUnsigned: true)
!246 = !DIEnumerator(name: "SUBSURF_IS_FINAL_CALC", value: 2, isUnsigned: true)
!247 = !DIEnumerator(name: "SUBSURF_FOR_EDIT_MODE", value: 4, isUnsigned: true)
!248 = !DIEnumerator(name: "SUBSURF_IN_EDIT_MODE", value: 8, isUnsigned: true)
!249 = !DIEnumerator(name: "SUBSURF_ALLOC_PAINT_MASK", value: 16, isUnsigned: true)
!250 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !143, line: 112, baseType: !7, size: 32, elements: !251)
!251 = !{!252, !253, !254, !255}
!252 = !DIEnumerator(name: "eSubsurfModifierFlag_Incremental", value: 1, isUnsigned: true)
!253 = !DIEnumerator(name: "eSubsurfModifierFlag_DebugIncr", value: 2, isUnsigned: true)
!254 = !DIEnumerator(name: "eSubsurfModifierFlag_ControlEdges", value: 4, isUnsigned: true)
!255 = !DIEnumerator(name: "eSubsurfModifierFlag_SubsurfUv", value: 8, isUnsigned: true)
!256 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !257, line: 304, baseType: !7, size: 32, elements: !258)
!257 = !DIFile(filename: "blender/source/blender/makesdna/DNA_meshdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!258 = !{!259, !260, !261, !262}
!259 = !DIEnumerator(name: "ME_VERT_TMP_TAG", value: 4, isUnsigned: true)
!260 = !DIEnumerator(name: "ME_HIDE", value: 16, isUnsigned: true)
!261 = !DIEnumerator(name: "ME_VERT_MERGED", value: 64, isUnsigned: true)
!262 = !DIEnumerator(name: "ME_VERT_PBVH_UPDATE", value: 128, isUnsigned: true)
!263 = !{!264, !2391, !2393, !2395, !915, !2465, !291, !2466, !2611, !418, !771, !2614, !7}
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "ModifierData", file: !143, line: 110, baseType: !266)
!266 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ModifierData", file: !143, line: 99, size: 896, elements: !267)
!267 = !{!268, !270, !271, !272, !273, !274, !275, !280, !2390}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !266, file: !143, line: 100, baseType: !269, size: 64)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !266, file: !143, line: 100, baseType: !269, size: 64, offset: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !266, file: !143, line: 102, baseType: !196, size: 32, offset: 128)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !266, file: !143, line: 102, baseType: !196, size: 32, offset: 160)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "stackindex", scope: !266, file: !143, line: 103, baseType: !196, size: 32, offset: 192)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !266, file: !143, line: 103, baseType: !196, size: 32, offset: 224)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !266, file: !143, line: 104, baseType: !276, size: 512, offset: 256)
!276 = !DICompositeType(tag: DW_TAG_array_type, baseType: !277, size: 512, elements: !278)
!277 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!278 = !{!279}
!279 = !DISubrange(count: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !266, file: !143, line: 107, baseType: !281, size: 64, offset: 768)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64)
!282 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !283, line: 1216, size: 39680, elements: !284)
!283 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!284 = !{!285, !352, !356, !1363, !1366, !1367, !1368, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1394, !1398, !1401, !2011, !2014, !2264, !2276, !2277, !2278, !2279, !2280, !2281, !2282, !2283, !2286, !2287, !2288, !2289, !2290, !2298, !2364, !2371, !2372, !2379, !2382, !2383, !2384, !2385, !2386, !2387}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !282, file: !283, line: 1217, baseType: !286, size: 960)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !287, line: 130, baseType: !288)
!287 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!288 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !287, line: 117, size: 960, elements: !289)
!289 = !{!290, !292, !293, !295, !314, !318, !320, !321, !322, !323}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !288, file: !287, line: 118, baseType: !291, size: 64)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !288, file: !287, line: 118, baseType: !291, size: 64, offset: 64)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !288, file: !287, line: 119, baseType: !294, size: 64, offset: 128)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !288, file: !287, line: 120, baseType: !296, size: 64, offset: 192)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64)
!297 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !287, line: 136, size: 17600, elements: !298)
!298 = !{!299, !300, !302, !305, !309, !310, !311}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !297, file: !287, line: 137, baseType: !286, size: 960)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !297, file: !287, line: 138, baseType: !301, size: 64, offset: 960)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !297, file: !287, line: 139, baseType: !303, size: 64, offset: 1024)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64)
!304 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !287, line: 43, flags: DIFlagFwdDecl)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !297, file: !287, line: 140, baseType: !306, size: 8192, offset: 1088)
!306 = !DICompositeType(tag: DW_TAG_array_type, baseType: !277, size: 8192, elements: !307)
!307 = !{!308}
!308 = !DISubrange(count: 1024)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !297, file: !287, line: 141, baseType: !306, size: 8192, offset: 9280)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !297, file: !287, line: 148, baseType: !296, size: 64, offset: 17472)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !297, file: !287, line: 150, baseType: !312, size: 64, offset: 17536)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!313 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !287, line: 45, flags: DIFlagFwdDecl)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !288, file: !287, line: 121, baseType: !315, size: 528, offset: 256)
!315 = !DICompositeType(tag: DW_TAG_array_type, baseType: !277, size: 528, elements: !316)
!316 = !{!317}
!317 = !DISubrange(count: 66)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !288, file: !287, line: 126, baseType: !319, size: 16, offset: 784)
!319 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !288, file: !287, line: 127, baseType: !196, size: 32, offset: 800)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !288, file: !287, line: 128, baseType: !196, size: 32, offset: 832)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !288, file: !287, line: 128, baseType: !196, size: 32, offset: 864)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !288, file: !287, line: 129, baseType: !324, size: 64, offset: 896)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !287, line: 75, baseType: !326)
!326 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !287, line: 62, size: 1024, elements: !327)
!327 = !{!328, !330, !331, !332, !333, !334, !335, !336, !350, !351}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !326, file: !287, line: 63, baseType: !329, size: 64)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !326, file: !287, line: 63, baseType: !329, size: 64, offset: 64)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !326, file: !287, line: 64, baseType: !277, size: 8, offset: 128)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !326, file: !287, line: 64, baseType: !277, size: 8, offset: 136)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !326, file: !287, line: 65, baseType: !319, size: 16, offset: 144)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !326, file: !287, line: 66, baseType: !276, size: 512, offset: 160)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !326, file: !287, line: 67, baseType: !196, size: 32, offset: 672)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !326, file: !287, line: 69, baseType: !337, size: 256, offset: 704)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !287, line: 60, baseType: !338)
!338 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !287, line: 48, size: 256, elements: !339)
!339 = !{!340, !341, !348, !349}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !338, file: !287, line: 49, baseType: !291, size: 64)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !338, file: !287, line: 58, baseType: !342, size: 128, offset: 64)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !343, line: 71, baseType: !344)
!343 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!344 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !343, line: 69, size: 128, elements: !345)
!345 = !{!346, !347}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !344, file: !343, line: 70, baseType: !291, size: 64)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !344, file: !343, line: 70, baseType: !291, size: 64, offset: 64)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !338, file: !287, line: 59, baseType: !196, size: 32, offset: 192)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !338, file: !287, line: 59, baseType: !196, size: 32, offset: 224)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !326, file: !287, line: 70, baseType: !196, size: 32, offset: 960)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !326, file: !287, line: 74, baseType: !196, size: 32, offset: 992)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !282, file: !283, line: 1218, baseType: !353, size: 64, offset: 960)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!354 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !355, line: 39, flags: DIFlagFwdDecl)
!355 = !DIFile(filename: "blender/source/blender/makesdna/DNA_mesh_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!356 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !282, file: !283, line: 1220, baseType: !357, size: 64, offset: 1024)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!358 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !207, line: 115, size: 11392, elements: !359)
!359 = !{!360, !361, !362, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !675, !685, !698, !699, !739, !740, !743, !744, !760, !761, !762, !763, !764, !765, !766, !770, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !786, !787, !788, !789, !790, !791, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !851, !852, !853, !854, !855, !856, !857, !858, !859, !862, !865, !868, !869, !870, !871, !872, !875, !878, !1310, !1311, !1317, !1318, !1319, !1320, !1321, !1322, !1324, !1327, !1330, !1332, !1351, !1352}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !358, file: !207, line: 116, baseType: !286, size: 960)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !358, file: !207, line: 117, baseType: !353, size: 64, offset: 960)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !358, file: !207, line: 119, baseType: !363, size: 64, offset: 1024)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !365, line: 155, size: 1856, elements: !366)
!365 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_paint.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!366 = !{!367, !382, !395, !404, !410, !411, !412, !414, !417, !419, !428, !623, !624, !625, !627, !631, !634, !635, !636, !637, !638, !642, !643, !644, !646, !647, !650, !651, !654, !657, !658, !659, !660}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "multires", scope: !364, file: !365, line: 157, baseType: !368, size: 64)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!369 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MultiresModifierData", file: !143, line: 717, size: 960, elements: !370)
!370 = !{!371, !372, !373, !374, !375, !376, !377, !378}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "modifier", scope: !369, file: !143, line: 718, baseType: !265, size: 896)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "lvl", scope: !369, file: !143, line: 720, baseType: !277, size: 8, offset: 896)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "sculptlvl", scope: !369, file: !143, line: 720, baseType: !277, size: 8, offset: 904)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "renderlvl", scope: !369, file: !143, line: 720, baseType: !277, size: 8, offset: 912)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "totlvl", scope: !369, file: !143, line: 720, baseType: !277, size: 8, offset: 920)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "simple", scope: !369, file: !143, line: 721, baseType: !277, size: 8, offset: 928)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !369, file: !143, line: 721, baseType: !277, size: 8, offset: 936)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !369, file: !143, line: 721, baseType: !379, size: 16, offset: 944)
!379 = !DICompositeType(tag: DW_TAG_array_type, baseType: !277, size: 16, elements: !380)
!380 = !{!381}
!381 = !DISubrange(count: 2)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "mvert", scope: !364, file: !365, line: 158, baseType: !383, size: 64, offset: 64)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!384 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MVert", file: !257, line: 65, size: 160, elements: !385)
!385 = !{!386, !391, !393, !394}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !384, file: !257, line: 66, baseType: !387, size: 96)
!387 = !DICompositeType(tag: DW_TAG_array_type, baseType: !388, size: 96, elements: !389)
!388 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!389 = !{!390}
!390 = !DISubrange(count: 3)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !384, file: !257, line: 67, baseType: !392, size: 48, offset: 96)
!392 = !DICompositeType(tag: DW_TAG_array_type, baseType: !319, size: 48, elements: !389)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !384, file: !257, line: 68, baseType: !277, size: 8, offset: 144)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "bweight", scope: !384, file: !257, line: 68, baseType: !277, size: 8, offset: 152)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "mpoly", scope: !364, file: !365, line: 159, baseType: !396, size: 64, offset: 128)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!397 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MPoly", file: !257, line: 79, size: 96, elements: !398)
!398 = !{!399, !400, !401, !402, !403}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "loopstart", scope: !397, file: !257, line: 81, baseType: !196, size: 32)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !397, file: !257, line: 82, baseType: !196, size: 32, offset: 32)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !397, file: !257, line: 83, baseType: !319, size: 16, offset: 64)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !397, file: !257, line: 84, baseType: !277, size: 8, offset: 80)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !397, file: !257, line: 84, baseType: !277, size: 8, offset: 88)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "mloop", scope: !364, file: !365, line: 160, baseType: !405, size: 64, offset: 192)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!406 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MLoop", file: !257, line: 88, size: 64, elements: !407)
!407 = !{!408, !409}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !406, file: !257, line: 89, baseType: !7, size: 32)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !406, file: !257, line: 90, baseType: !7, size: 32, offset: 32)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "totvert", scope: !364, file: !365, line: 161, baseType: !196, size: 32, offset: 256)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "totpoly", scope: !364, file: !365, line: 161, baseType: !196, size: 32, offset: 288)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "face_normals", scope: !364, file: !365, line: 162, baseType: !413, size: 64, offset: 320)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "kb", scope: !364, file: !365, line: 163, baseType: !415, size: 64, offset: 384)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!416 = !DICompositeType(tag: DW_TAG_structure_type, name: "KeyBlock", file: !45, line: 92, flags: DIFlagFwdDecl)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "vmask", scope: !364, file: !365, line: 164, baseType: !418, size: 64, offset: 448)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "pmap", scope: !364, file: !365, line: 167, baseType: !420, size: 64, offset: 512)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64)
!421 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !422)
!422 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MeshElemMap", file: !423, line: 96, size: 128, elements: !424)
!423 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_mesh_mapping.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!424 = !{!425, !427}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "indices", scope: !422, file: !423, line: 97, baseType: !426, size: 64)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !422, file: !423, line: 98, baseType: !196, size: 32, offset: 64)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "bm", scope: !364, file: !365, line: 170, baseType: !429, size: 64, offset: 576)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!430 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMesh", file: !431, line: 186, size: 8064, elements: !432)
!431 = !DIFile(filename: "blender/source/blender/bmesh/bmesh_class.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!432 = !{!433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !445, !446, !447, !448, !509, !513, !517, !518, !519, !520, !521, !522, !523, !524, !579, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "totvert", scope: !430, file: !431, line: 187, baseType: !196, size: 32)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "totedge", scope: !430, file: !431, line: 187, baseType: !196, size: 32, offset: 32)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !430, file: !431, line: 187, baseType: !196, size: 32, offset: 64)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "totface", scope: !430, file: !431, line: 187, baseType: !196, size: 32, offset: 96)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "totvertsel", scope: !430, file: !431, line: 188, baseType: !196, size: 32, offset: 128)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "totedgesel", scope: !430, file: !431, line: 188, baseType: !196, size: 32, offset: 160)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "totfacesel", scope: !430, file: !431, line: 188, baseType: !196, size: 32, offset: 192)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "elem_index_dirty", scope: !430, file: !431, line: 193, baseType: !277, size: 8, offset: 224)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "elem_table_dirty", scope: !430, file: !431, line: 197, baseType: !277, size: 8, offset: 232)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "vpool", scope: !430, file: !431, line: 201, baseType: !443, size: 64, offset: 256)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64)
!444 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool", file: !72, line: 71, flags: DIFlagFwdDecl)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "epool", scope: !430, file: !431, line: 201, baseType: !443, size: 64, offset: 320)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "lpool", scope: !430, file: !431, line: 201, baseType: !443, size: 64, offset: 384)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "fpool", scope: !430, file: !431, line: 201, baseType: !443, size: 64, offset: 448)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !430, file: !431, line: 208, baseType: !449, size: 64, offset: 512)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64)
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMVert", file: !431, line: 103, baseType: !452)
!452 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMVert", file: !431, line: 90, size: 448, elements: !453)
!453 = !{!454, !463, !468, !469, !470}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !452, file: !431, line: 91, baseType: !455, size: 128)
!455 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMHeader", file: !431, line: 82, baseType: !456)
!456 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMHeader", file: !431, line: 64, size: 128, elements: !457)
!457 = !{!458, !459, !460, !461, !462}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !456, file: !431, line: 65, baseType: !291, size: 64)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !456, file: !431, line: 66, baseType: !196, size: 32, offset: 64)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !456, file: !431, line: 73, baseType: !277, size: 8, offset: 96)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "hflag", scope: !456, file: !431, line: 74, baseType: !277, size: 8, offset: 104)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "api_flag", scope: !456, file: !431, line: 80, baseType: !277, size: 8, offset: 112)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !452, file: !431, line: 92, baseType: !464, size: 64, offset: 128)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!465 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFlagLayer", file: !431, line: 180, size: 16, elements: !466)
!466 = !{!467}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !465, file: !431, line: 181, baseType: !319, size: 16)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !452, file: !431, line: 94, baseType: !387, size: 96, offset: 192)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !452, file: !431, line: 95, baseType: !387, size: 96, offset: 288)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !452, file: !431, line: 102, baseType: !471, size: 64, offset: 384)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64)
!472 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMEdge", file: !431, line: 110, size: 640, elements: !473)
!473 = !{!474, !475, !476, !478, !479, !502, !508}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !472, file: !431, line: 111, baseType: !455, size: 128)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !472, file: !431, line: 112, baseType: !464, size: 64, offset: 128)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !472, file: !431, line: 114, baseType: !477, size: 64, offset: 192)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !472, file: !431, line: 114, baseType: !477, size: 64, offset: 256)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !472, file: !431, line: 118, baseType: !480, size: 64, offset: 320)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64)
!481 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMLoop", file: !431, line: 125, size: 576, elements: !482)
!482 = !{!483, !484, !485, !486, !498, !499, !500, !501}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !481, file: !431, line: 126, baseType: !455, size: 128)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !481, file: !431, line: 129, baseType: !477, size: 64, offset: 128)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !481, file: !431, line: 130, baseType: !471, size: 64, offset: 192)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !481, file: !431, line: 131, baseType: !487, size: 64, offset: 256)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!488 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFace", file: !431, line: 164, size: 448, elements: !489)
!489 = !{!490, !491, !492, !495, !496, !497}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !488, file: !431, line: 165, baseType: !455, size: 128)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !488, file: !431, line: 166, baseType: !464, size: 64, offset: 128)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !488, file: !431, line: 172, baseType: !493, size: 64, offset: 192)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64)
!494 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMLoop", file: !431, line: 140, baseType: !481)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !488, file: !431, line: 174, baseType: !196, size: 32, offset: 256)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !488, file: !431, line: 175, baseType: !387, size: 96, offset: 288)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !488, file: !431, line: 176, baseType: !319, size: 16, offset: 384)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "radial_next", scope: !481, file: !431, line: 135, baseType: !480, size: 64, offset: 320)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "radial_prev", scope: !481, file: !431, line: 135, baseType: !480, size: 64, offset: 384)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !481, file: !431, line: 139, baseType: !480, size: 64, offset: 448)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !481, file: !431, line: 139, baseType: !480, size: 64, offset: 512)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "v1_disk_link", scope: !472, file: !431, line: 122, baseType: !503, size: 128, offset: 384)
!503 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMDiskLink", file: !431, line: 108, baseType: !504)
!504 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMDiskLink", file: !431, line: 106, size: 128, elements: !505)
!505 = !{!506, !507}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !504, file: !431, line: 107, baseType: !471, size: 64)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !504, file: !431, line: 107, baseType: !471, size: 64, offset: 64)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "v2_disk_link", scope: !472, file: !431, line: 122, baseType: !503, size: 128, offset: 512)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "etable", scope: !430, file: !431, line: 209, baseType: !510, size: 64, offset: 576)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 64)
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 64)
!512 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMEdge", file: !431, line: 123, baseType: !472)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "ftable", scope: !430, file: !431, line: 210, baseType: !514, size: 64, offset: 640)
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 64)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 64)
!516 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMFace", file: !431, line: 178, baseType: !488)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "vtable_tot", scope: !430, file: !431, line: 213, baseType: !196, size: 32, offset: 704)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "etable_tot", scope: !430, file: !431, line: 214, baseType: !196, size: 32, offset: 736)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "ftable_tot", scope: !430, file: !431, line: 215, baseType: !196, size: 32, offset: 768)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "vtoolflagpool", scope: !430, file: !431, line: 218, baseType: !443, size: 64, offset: 832)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "etoolflagpool", scope: !430, file: !431, line: 218, baseType: !443, size: 64, offset: 896)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "ftoolflagpool", scope: !430, file: !431, line: 218, baseType: !443, size: 64, offset: 960)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "stackdepth", scope: !430, file: !431, line: 220, baseType: !196, size: 32, offset: 1024)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "currentop", scope: !430, file: !431, line: 221, baseType: !525, size: 64, offset: 1088)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64)
!526 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOperator", file: !6, line: 190, size: 10496, elements: !527)
!527 = !{!528, !565, !566, !572, !575, !576, !578}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "slots_in", scope: !526, file: !6, line: 191, baseType: !529, size: 5120)
!529 = !DICompositeType(tag: DW_TAG_array_type, baseType: !530, size: 5120, elements: !563)
!530 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOpSlot", file: !6, line: 147, size: 320, elements: !531)
!531 = !{!532, !535, !537, !547, !548}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "slot_name", scope: !530, file: !6, line: 148, baseType: !533, size: 64)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64)
!534 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !277)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "slot_type", scope: !530, file: !6, line: 149, baseType: !536, size: 32, offset: 64)
!536 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotType", file: !6, line: 112, baseType: !5)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "slot_subtype", scope: !530, file: !6, line: 150, baseType: !538, size: 32, offset: 96)
!538 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Union", file: !6, line: 142, baseType: !539)
!539 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eBMOpSlotSubType_Union", file: !6, line: 138, size: 32, elements: !540)
!540 = !{!541, !543, !545}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !539, file: !6, line: 139, baseType: !542, size: 32)
!542 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Elem", file: !6, line: 122, baseType: !17)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !539, file: !6, line: 140, baseType: !544, size: 32)
!544 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Ptr", file: !6, line: 136, baseType: !23)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !539, file: !6, line: 141, baseType: !546, size: 32)
!546 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Map", file: !6, line: 130, baseType: !29)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !530, file: !6, line: 152, baseType: !196, size: 32, offset: 128)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !530, file: !6, line: 162, baseType: !549, size: 128, offset: 192)
!549 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !530, file: !6, line: 155, size: 128, elements: !550)
!550 = !{!551, !552, !553, !554, !555, !557}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !549, file: !6, line: 156, baseType: !196, size: 32)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !549, file: !6, line: 157, baseType: !388, size: 32)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !549, file: !6, line: 158, baseType: !291, size: 64)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !549, file: !6, line: 159, baseType: !387, size: 96)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !549, file: !6, line: 160, baseType: !556, size: 64)
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "ghash", scope: !549, file: !6, line: 161, baseType: !558, size: 64)
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 64)
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHash", file: !560, line: 48, baseType: !561)
!560 = !DIFile(filename: "blender/source/blender/blenlib/BLI_ghash.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!561 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !562, line: 47, flags: DIFlagFwdDecl)
!562 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!563 = !{!564}
!564 = !DISubrange(count: 16)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "slots_out", scope: !526, file: !6, line: 192, baseType: !529, size: 5120, offset: 5120)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !526, file: !6, line: 193, baseType: !567, size: 64, offset: 10240)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!568 = !DISubroutineType(types: !569)
!569 = !{null, !570, !525}
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64)
!571 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMesh", file: !431, line: 246, baseType: !430)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "arena", scope: !526, file: !6, line: 194, baseType: !573, size: 64, offset: 10304)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64)
!574 = !DICompositeType(tag: DW_TAG_structure_type, name: "MemArena", file: !6, line: 194, flags: DIFlagFwdDecl)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !526, file: !6, line: 195, baseType: !196, size: 32, offset: 10368)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "type_flag", scope: !526, file: !6, line: 196, baseType: !577, size: 32, offset: 10400)
!577 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMOpTypeFlag", file: !6, line: 188, baseType: !37)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !526, file: !6, line: 197, baseType: !196, size: 32, offset: 10432)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !430, file: !431, line: 223, baseType: !580, size: 1600, offset: 1152)
!580 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomData", file: !72, line: 73, baseType: !581)
!581 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomData", file: !72, line: 64, size: 1600, elements: !582)
!582 = !{!583, !598, !602, !603, !604, !605, !606}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !581, file: !72, line: 65, baseType: !584, size: 64)
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64)
!585 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataLayer", file: !72, line: 53, baseType: !586)
!586 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataLayer", file: !72, line: 42, size: 832, elements: !587)
!587 = !{!588, !589, !590, !591, !592, !593, !594, !595, !596, !597}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !586, file: !72, line: 43, baseType: !196, size: 32)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !586, file: !72, line: 44, baseType: !196, size: 32, offset: 32)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !586, file: !72, line: 45, baseType: !196, size: 32, offset: 64)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !586, file: !72, line: 46, baseType: !196, size: 32, offset: 96)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "active_rnd", scope: !586, file: !72, line: 47, baseType: !196, size: 32, offset: 128)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "active_clone", scope: !586, file: !72, line: 48, baseType: !196, size: 32, offset: 160)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "active_mask", scope: !586, file: !72, line: 49, baseType: !196, size: 32, offset: 192)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !586, file: !72, line: 50, baseType: !196, size: 32, offset: 224)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !586, file: !72, line: 51, baseType: !276, size: 512, offset: 256)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !586, file: !72, line: 52, baseType: !291, size: 64, offset: 768)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "typemap", scope: !581, file: !72, line: 66, baseType: !599, size: 1312, offset: 64)
!599 = !DICompositeType(tag: DW_TAG_array_type, baseType: !196, size: 1312, elements: !600)
!600 = !{!601}
!601 = !DISubrange(count: 41)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "totlayer", scope: !581, file: !72, line: 69, baseType: !196, size: 32, offset: 1376)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "maxlayer", scope: !581, file: !72, line: 69, baseType: !196, size: 32, offset: 1408)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "totsize", scope: !581, file: !72, line: 70, baseType: !196, size: 32, offset: 1440)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !581, file: !72, line: 71, baseType: !443, size: 64, offset: 1472)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !581, file: !72, line: 72, baseType: !607, size: 64, offset: 1536)
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64)
!608 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataExternal", file: !72, line: 59, baseType: !609)
!609 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataExternal", file: !72, line: 57, size: 8192, elements: !610)
!610 = !{!611}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !609, file: !72, line: 58, baseType: !306, size: 8192)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !430, file: !431, line: 223, baseType: !580, size: 1600, offset: 2752)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "ldata", scope: !430, file: !431, line: 223, baseType: !580, size: 1600, offset: 4352)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !430, file: !431, line: 223, baseType: !580, size: 1600, offset: 5952)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !430, file: !431, line: 233, baseType: !319, size: 16, offset: 7552)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !430, file: !431, line: 236, baseType: !196, size: 32, offset: 7584)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "walkers", scope: !430, file: !431, line: 238, baseType: !196, size: 32, offset: 7616)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "totflags", scope: !430, file: !431, line: 238, baseType: !196, size: 32, offset: 7648)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "selected", scope: !430, file: !431, line: 239, baseType: !342, size: 128, offset: 7680)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "act_face", scope: !430, file: !431, line: 241, baseType: !515, size: 64, offset: 7808)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "errorstack", scope: !430, file: !431, line: 243, baseType: !342, size: 128, offset: 7872)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "py_handle", scope: !430, file: !431, line: 245, baseType: !291, size: 64, offset: 8000)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "cd_vert_node_offset", scope: !364, file: !365, line: 171, baseType: !196, size: 32, offset: 640)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "cd_face_node_offset", scope: !364, file: !365, line: 172, baseType: !196, size: 32, offset: 672)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "bm_smooth_shading", scope: !364, file: !365, line: 173, baseType: !626, size: 8, offset: 704)
!626 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "bm_log", scope: !364, file: !365, line: 175, baseType: !628, size: 64, offset: 768)
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 64)
!629 = !DICompositeType(tag: DW_TAG_structure_type, name: "BMLog", file: !630, line: 44, flags: DIFlagFwdDecl)
!630 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_pbvh.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!631 = !DIDerivedType(tag: DW_TAG_member, name: "pbvh", scope: !364, file: !365, line: 178, baseType: !632, size: 64, offset: 832)
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !633, size: 64)
!633 = !DICompositeType(tag: DW_TAG_structure_type, name: "PBVH", file: !630, line: 41, flags: DIFlagFwdDecl)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "show_diffuse_color", scope: !364, file: !365, line: 179, baseType: !626, size: 8, offset: 896)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers_active", scope: !364, file: !365, line: 182, baseType: !626, size: 8, offset: 904)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "orig_cos", scope: !364, file: !365, line: 183, baseType: !413, size: 64, offset: 960)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "deform_cos", scope: !364, file: !365, line: 184, baseType: !413, size: 64, offset: 1024)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "deform_imats", scope: !364, file: !365, line: 185, baseType: !639, size: 64, offset: 1088)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64)
!640 = !DICompositeType(tag: DW_TAG_array_type, baseType: !388, size: 288, elements: !641)
!641 = !{!390, !390}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "partial_redraw", scope: !364, file: !365, line: 188, baseType: !626, size: 8, offset: 1152)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "texcache_side", scope: !364, file: !365, line: 191, baseType: !7, size: 32, offset: 1184)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "texcache", scope: !364, file: !365, line: 191, baseType: !645, size: 64, offset: 1216)
!645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "texcache_actual", scope: !364, file: !365, line: 191, baseType: !7, size: 32, offset: 1280)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "tex_pool", scope: !364, file: !365, line: 192, baseType: !648, size: 64, offset: 1344)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 64)
!649 = !DICompositeType(tag: DW_TAG_structure_type, name: "ImagePool", file: !365, line: 61, flags: DIFlagFwdDecl)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "layer_co", scope: !364, file: !365, line: 195, baseType: !413, size: 64, offset: 1408)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "stroke", scope: !364, file: !365, line: 197, baseType: !652, size: 64, offset: 1472)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 64)
!653 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptStroke", file: !365, line: 197, flags: DIFlagFwdDecl)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !364, file: !365, line: 198, baseType: !655, size: 64, offset: 1536)
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 64)
!656 = !DICompositeType(tag: DW_TAG_structure_type, name: "StrokeCache", file: !365, line: 59, flags: DIFlagFwdDecl)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "last_stroke_valid", scope: !364, file: !365, line: 201, baseType: !626, size: 8, offset: 1600)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "last_stroke", scope: !364, file: !365, line: 202, baseType: !387, size: 96, offset: 1632)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "average_stroke_accum", scope: !364, file: !365, line: 204, baseType: !387, size: 96, offset: 1728)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "average_stroke_counter", scope: !364, file: !365, line: 205, baseType: !196, size: 32, offset: 1824)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !358, file: !207, line: 121, baseType: !319, size: 16, offset: 1088)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !358, file: !207, line: 121, baseType: !319, size: 16, offset: 1104)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !358, file: !207, line: 122, baseType: !196, size: 32, offset: 1120)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !358, file: !207, line: 122, baseType: !196, size: 32, offset: 1152)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !358, file: !207, line: 122, baseType: !196, size: 32, offset: 1184)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !358, file: !207, line: 123, baseType: !276, size: 512, offset: 1216)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !358, file: !207, line: 124, baseType: !357, size: 64, offset: 1728)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !358, file: !207, line: 124, baseType: !357, size: 64, offset: 1792)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !358, file: !207, line: 127, baseType: !357, size: 64, offset: 1856)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !358, file: !207, line: 127, baseType: !357, size: 64, offset: 1920)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !358, file: !207, line: 127, baseType: !357, size: 64, offset: 1984)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !358, file: !207, line: 128, baseType: !673, size: 64, offset: 2048)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64)
!674 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !355, line: 41, flags: DIFlagFwdDecl)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !358, file: !207, line: 130, baseType: !676, size: 64, offset: 2112)
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 64)
!677 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !207, line: 97, size: 832, elements: !678)
!678 = !{!679, !683, !684}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !677, file: !207, line: 98, baseType: !680, size: 768)
!680 = !DICompositeType(tag: DW_TAG_array_type, baseType: !388, size: 768, elements: !681)
!681 = !{!682, !390}
!682 = !DISubrange(count: 8)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !677, file: !207, line: 99, baseType: !196, size: 32, offset: 768)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !677, file: !207, line: 99, baseType: !196, size: 32, offset: 800)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !358, file: !207, line: 131, baseType: !686, size: 64, offset: 2176)
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !687, size: 64)
!687 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !562, line: 486, size: 1600, elements: !688)
!688 = !{!689, !690, !691, !692, !693, !694, !695, !696, !697}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !687, file: !562, line: 487, baseType: !286, size: 960)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !687, file: !562, line: 489, baseType: !342, size: 128, offset: 960)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !687, file: !562, line: 490, baseType: !342, size: 128, offset: 1088)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !687, file: !562, line: 491, baseType: !342, size: 128, offset: 1216)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !687, file: !562, line: 492, baseType: !342, size: 128, offset: 1344)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !687, file: !562, line: 494, baseType: !196, size: 32, offset: 1472)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !687, file: !562, line: 495, baseType: !196, size: 32, offset: 1504)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !687, file: !562, line: 497, baseType: !196, size: 32, offset: 1536)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !687, file: !562, line: 498, baseType: !196, size: 32, offset: 1568)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !358, file: !207, line: 132, baseType: !686, size: 64, offset: 2240)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !358, file: !207, line: 133, baseType: !700, size: 64, offset: 2304)
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !701, size: 64)
!701 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !562, line: 334, size: 1728, elements: !702)
!702 = !{!703, !704, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !738}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !701, file: !562, line: 335, baseType: !342, size: 128)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !701, file: !562, line: 336, baseType: !705, size: 64, offset: 128)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !701, file: !562, line: 338, baseType: !319, size: 16, offset: 192)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !701, file: !562, line: 338, baseType: !319, size: 16, offset: 208)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !701, file: !562, line: 339, baseType: !7, size: 32, offset: 224)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !701, file: !562, line: 340, baseType: !196, size: 32, offset: 256)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !701, file: !562, line: 342, baseType: !388, size: 32, offset: 288)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !701, file: !562, line: 343, baseType: !387, size: 96, offset: 320)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !701, file: !562, line: 344, baseType: !387, size: 96, offset: 416)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !701, file: !562, line: 347, baseType: !342, size: 128, offset: 512)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !701, file: !562, line: 349, baseType: !196, size: 32, offset: 640)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !701, file: !562, line: 350, baseType: !196, size: 32, offset: 672)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !701, file: !562, line: 351, baseType: !291, size: 64, offset: 704)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !701, file: !562, line: 352, baseType: !291, size: 64, offset: 768)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !701, file: !562, line: 354, baseType: !719, size: 384, offset: 832)
!719 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !562, line: 116, baseType: !720)
!720 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !562, line: 94, size: 384, elements: !721)
!721 = !{!722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !720, file: !562, line: 96, baseType: !196, size: 32)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !720, file: !562, line: 96, baseType: !196, size: 32, offset: 32)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !720, file: !562, line: 97, baseType: !196, size: 32, offset: 64)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !720, file: !562, line: 97, baseType: !196, size: 32, offset: 96)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !720, file: !562, line: 99, baseType: !319, size: 16, offset: 128)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !720, file: !562, line: 100, baseType: !319, size: 16, offset: 144)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !720, file: !562, line: 102, baseType: !319, size: 16, offset: 160)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !720, file: !562, line: 105, baseType: !319, size: 16, offset: 176)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !720, file: !562, line: 108, baseType: !319, size: 16, offset: 192)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !720, file: !562, line: 109, baseType: !319, size: 16, offset: 208)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !720, file: !562, line: 111, baseType: !319, size: 16, offset: 224)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !720, file: !562, line: 112, baseType: !319, size: 16, offset: 240)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !720, file: !562, line: 114, baseType: !196, size: 32, offset: 256)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !720, file: !562, line: 114, baseType: !196, size: 32, offset: 288)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !720, file: !562, line: 115, baseType: !196, size: 32, offset: 320)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !720, file: !562, line: 115, baseType: !196, size: 32, offset: 352)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !701, file: !562, line: 355, baseType: !276, size: 512, offset: 1216)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !358, file: !207, line: 134, baseType: !291, size: 64, offset: 2368)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !358, file: !207, line: 136, baseType: !741, size: 64, offset: 2432)
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 64)
!742 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !207, line: 58, flags: DIFlagFwdDecl)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !358, file: !207, line: 138, baseType: !719, size: 384, offset: 2496)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !358, file: !207, line: 139, baseType: !745, size: 64, offset: 2880)
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 64)
!746 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !562, line: 80, baseType: !747)
!747 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !562, line: 72, size: 192, elements: !748)
!748 = !{!749, !756, !757, !758, !759}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !747, file: !562, line: 73, baseType: !750, size: 64)
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !751, size: 64)
!751 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !562, line: 59, baseType: !752)
!752 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !562, line: 56, size: 128, elements: !753)
!753 = !{!754, !755}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !752, file: !562, line: 57, baseType: !387, size: 96)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !752, file: !562, line: 58, baseType: !196, size: 32, offset: 96)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !747, file: !562, line: 74, baseType: !196, size: 32, offset: 64)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !747, file: !562, line: 76, baseType: !196, size: 32, offset: 96)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !747, file: !562, line: 77, baseType: !196, size: 32, offset: 128)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !747, file: !562, line: 79, baseType: !196, size: 32, offset: 160)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !358, file: !207, line: 141, baseType: !342, size: 128, offset: 2944)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !358, file: !207, line: 142, baseType: !342, size: 128, offset: 3072)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !358, file: !207, line: 143, baseType: !342, size: 128, offset: 3200)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !358, file: !207, line: 144, baseType: !342, size: 128, offset: 3328)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !358, file: !207, line: 146, baseType: !196, size: 32, offset: 3456)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !358, file: !207, line: 147, baseType: !196, size: 32, offset: 3488)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !358, file: !207, line: 150, baseType: !767, size: 64, offset: 3520)
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 64)
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 64)
!769 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !355, line: 53, flags: DIFlagFwdDecl)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !358, file: !207, line: 151, baseType: !771, size: 64, offset: 3584)
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !358, file: !207, line: 152, baseType: !196, size: 32, offset: 3648)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !358, file: !207, line: 153, baseType: !196, size: 32, offset: 3680)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !358, file: !207, line: 156, baseType: !387, size: 96, offset: 3712)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !358, file: !207, line: 156, baseType: !387, size: 96, offset: 3808)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !358, file: !207, line: 156, baseType: !387, size: 96, offset: 3904)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !358, file: !207, line: 157, baseType: !387, size: 96, offset: 4000)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !358, file: !207, line: 158, baseType: !387, size: 96, offset: 4096)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !358, file: !207, line: 159, baseType: !387, size: 96, offset: 4192)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !358, file: !207, line: 160, baseType: !387, size: 96, offset: 4288)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !358, file: !207, line: 160, baseType: !387, size: 96, offset: 4384)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !358, file: !207, line: 161, baseType: !783, size: 128, offset: 4480)
!783 = !DICompositeType(tag: DW_TAG_array_type, baseType: !388, size: 128, elements: !784)
!784 = !{!785}
!785 = !DISubrange(count: 4)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !358, file: !207, line: 161, baseType: !783, size: 128, offset: 4608)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !358, file: !207, line: 162, baseType: !387, size: 96, offset: 4736)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !358, file: !207, line: 162, baseType: !387, size: 96, offset: 4832)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !358, file: !207, line: 163, baseType: !388, size: 32, offset: 4928)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !358, file: !207, line: 163, baseType: !388, size: 32, offset: 4960)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !358, file: !207, line: 164, baseType: !792, size: 512, offset: 4992)
!792 = !DICompositeType(tag: DW_TAG_array_type, baseType: !388, size: 512, elements: !793)
!793 = !{!785, !785}
!794 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !358, file: !207, line: 165, baseType: !792, size: 512, offset: 5504)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !358, file: !207, line: 166, baseType: !792, size: 512, offset: 6016)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !358, file: !207, line: 167, baseType: !792, size: 512, offset: 6528)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !358, file: !207, line: 176, baseType: !792, size: 512, offset: 7040)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !358, file: !207, line: 178, baseType: !7, size: 32, offset: 7552)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !358, file: !207, line: 180, baseType: !319, size: 16, offset: 7584)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !358, file: !207, line: 181, baseType: !319, size: 16, offset: 7600)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !358, file: !207, line: 183, baseType: !319, size: 16, offset: 7616)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !358, file: !207, line: 183, baseType: !319, size: 16, offset: 7632)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !358, file: !207, line: 184, baseType: !319, size: 16, offset: 7648)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !358, file: !207, line: 184, baseType: !319, size: 16, offset: 7664)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !358, file: !207, line: 185, baseType: !319, size: 16, offset: 7680)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !358, file: !207, line: 186, baseType: !319, size: 16, offset: 7696)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !358, file: !207, line: 187, baseType: !319, size: 16, offset: 7712)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !358, file: !207, line: 188, baseType: !277, size: 8, offset: 7728)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !358, file: !207, line: 189, baseType: !277, size: 8, offset: 7736)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !358, file: !207, line: 192, baseType: !196, size: 32, offset: 7744)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !358, file: !207, line: 192, baseType: !196, size: 32, offset: 7776)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !358, file: !207, line: 192, baseType: !196, size: 32, offset: 7808)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !358, file: !207, line: 192, baseType: !196, size: 32, offset: 7840)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !358, file: !207, line: 194, baseType: !196, size: 32, offset: 7872)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !358, file: !207, line: 202, baseType: !388, size: 32, offset: 7904)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !358, file: !207, line: 202, baseType: !388, size: 32, offset: 7936)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !358, file: !207, line: 202, baseType: !388, size: 32, offset: 7968)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !358, file: !207, line: 211, baseType: !388, size: 32, offset: 8000)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !358, file: !207, line: 212, baseType: !388, size: 32, offset: 8032)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !358, file: !207, line: 213, baseType: !388, size: 32, offset: 8064)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !358, file: !207, line: 214, baseType: !388, size: 32, offset: 8096)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !358, file: !207, line: 215, baseType: !388, size: 32, offset: 8128)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !358, file: !207, line: 216, baseType: !388, size: 32, offset: 8160)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !358, file: !207, line: 219, baseType: !388, size: 32, offset: 8192)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !358, file: !207, line: 220, baseType: !388, size: 32, offset: 8224)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !358, file: !207, line: 221, baseType: !388, size: 32, offset: 8256)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !358, file: !207, line: 224, baseType: !828, size: 16, offset: 8288)
!828 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !358, file: !207, line: 224, baseType: !828, size: 16, offset: 8304)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !358, file: !207, line: 226, baseType: !319, size: 16, offset: 8320)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !358, file: !207, line: 228, baseType: !277, size: 8, offset: 8336)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !358, file: !207, line: 229, baseType: !277, size: 8, offset: 8344)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !358, file: !207, line: 231, baseType: !319, size: 16, offset: 8352)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !358, file: !207, line: 232, baseType: !277, size: 8, offset: 8368)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !358, file: !207, line: 233, baseType: !277, size: 8, offset: 8376)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !358, file: !207, line: 234, baseType: !388, size: 32, offset: 8384)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !358, file: !207, line: 235, baseType: !388, size: 32, offset: 8416)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !358, file: !207, line: 237, baseType: !342, size: 128, offset: 8448)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !358, file: !207, line: 238, baseType: !342, size: 128, offset: 8576)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !358, file: !207, line: 239, baseType: !342, size: 128, offset: 8704)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !358, file: !207, line: 240, baseType: !342, size: 128, offset: 8832)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !358, file: !207, line: 242, baseType: !388, size: 32, offset: 8960)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !358, file: !207, line: 244, baseType: !319, size: 16, offset: 8992)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !358, file: !207, line: 245, baseType: !828, size: 16, offset: 9008)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !358, file: !207, line: 246, baseType: !783, size: 128, offset: 9024)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !358, file: !207, line: 248, baseType: !196, size: 32, offset: 9152)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !358, file: !207, line: 249, baseType: !196, size: 32, offset: 9184)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !358, file: !207, line: 251, baseType: !849, size: 64, offset: 9216)
!849 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !850, size: 64)
!850 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !207, line: 251, flags: DIFlagFwdDecl)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !358, file: !207, line: 253, baseType: !277, size: 8, offset: 9280)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !358, file: !207, line: 254, baseType: !277, size: 8, offset: 9288)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !358, file: !207, line: 255, baseType: !319, size: 16, offset: 9296)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !358, file: !207, line: 256, baseType: !387, size: 96, offset: 9312)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !358, file: !207, line: 258, baseType: !342, size: 128, offset: 9408)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !358, file: !207, line: 259, baseType: !342, size: 128, offset: 9536)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !358, file: !207, line: 260, baseType: !342, size: 128, offset: 9664)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !358, file: !207, line: 261, baseType: !342, size: 128, offset: 9792)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !358, file: !207, line: 263, baseType: !860, size: 64, offset: 9920)
!860 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !861, size: 64)
!861 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !207, line: 52, flags: DIFlagFwdDecl)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !358, file: !207, line: 264, baseType: !863, size: 64, offset: 9984)
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !864, size: 64)
!864 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !207, line: 53, flags: DIFlagFwdDecl)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !358, file: !207, line: 265, baseType: !866, size: 64, offset: 10048)
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !867, size: 64)
!867 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !562, line: 46, flags: DIFlagFwdDecl)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !358, file: !207, line: 267, baseType: !277, size: 8, offset: 10112)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !358, file: !207, line: 268, baseType: !277, size: 8, offset: 10120)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !358, file: !207, line: 269, baseType: !319, size: 16, offset: 10128)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !358, file: !207, line: 270, baseType: !388, size: 32, offset: 10144)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !358, file: !207, line: 272, baseType: !873, size: 64, offset: 10176)
!873 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !874, size: 64)
!874 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !207, line: 54, flags: DIFlagFwdDecl)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !358, file: !207, line: 275, baseType: !876, size: 64, offset: 10240)
!876 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !877, size: 64)
!877 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !207, line: 275, flags: DIFlagFwdDecl)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !358, file: !207, line: 277, baseType: !879, size: 64, offset: 10304)
!879 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !880, size: 64)
!880 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !45, line: 178, size: 13504, elements: !881)
!881 = !{!882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !900, !903, !905, !906, !908, !909, !910, !911, !917, !922, !923, !927, !928, !929, !930, !931, !935, !947, !961, !965, !969, !973, !977, !981, !985, !989, !993, !997, !1001, !1002, !1003, !1004, !1005, !1006, !1010, !1011, !1012, !1013, !1017, !1018, !1019, !1020, !1021, !1026, !1027, !1028, !1029, !1030, !1034, !1035, !1036, !1037, !1038, !1045, !1056, !1060, !1078, !1088, !1093, !1104, !1111, !1118, !1122, !1126, !1130, !1134, !1135, !1136, !1140, !1144, !1145, !1146, !1150, !1151, !1160, !1267, !1271, !1279, !1283, !1287, !1291, !1299, !1309}
!882 = !DIDerivedType(tag: DW_TAG_member, name: "vertData", scope: !880, file: !45, line: 180, baseType: !580, size: 1600)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "edgeData", scope: !880, file: !45, line: 180, baseType: !580, size: 1600, offset: 1600)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "faceData", scope: !880, file: !45, line: 180, baseType: !580, size: 1600, offset: 3200)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "loopData", scope: !880, file: !45, line: 180, baseType: !580, size: 1600, offset: 4800)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "polyData", scope: !880, file: !45, line: 180, baseType: !580, size: 1600, offset: 6400)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "numVertData", scope: !880, file: !45, line: 181, baseType: !196, size: 32, offset: 8000)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "numEdgeData", scope: !880, file: !45, line: 181, baseType: !196, size: 32, offset: 8032)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "numTessFaceData", scope: !880, file: !45, line: 181, baseType: !196, size: 32, offset: 8064)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "numLoopData", scope: !880, file: !45, line: 181, baseType: !196, size: 32, offset: 8096)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "numPolyData", scope: !880, file: !45, line: 181, baseType: !196, size: 32, offset: 8128)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "needsFree", scope: !880, file: !45, line: 182, baseType: !196, size: 32, offset: 8160)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "deformedOnly", scope: !880, file: !45, line: 183, baseType: !196, size: 32, offset: 8192)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "bvhCache", scope: !880, file: !45, line: 184, baseType: !895, size: 64, offset: 8256)
!895 = !DIDerivedType(tag: DW_TAG_typedef, name: "BVHCache", file: !896, line: 124, baseType: !897)
!896 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_bvhutils.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!897 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !898, size: 64)
!898 = !DICompositeType(tag: DW_TAG_structure_type, name: "LinkNode", file: !899, line: 118, flags: DIFlagFwdDecl)
!899 = !DIFile(filename: "blender/source/blender/blenlib/BLI_fileops.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!900 = !DIDerivedType(tag: DW_TAG_member, name: "drawObject", scope: !880, file: !45, line: 185, baseType: !901, size: 64, offset: 8320)
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !902, size: 64)
!902 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUDrawObject", file: !45, line: 97, flags: DIFlagFwdDecl)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !880, file: !45, line: 186, baseType: !904, size: 32, offset: 8384)
!904 = !DIDerivedType(tag: DW_TAG_typedef, name: "DerivedMeshType", file: !45, line: 132, baseType: !44)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "auto_bump_scale", scope: !880, file: !45, line: 187, baseType: !388, size: 32, offset: 8416)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "dirty", scope: !880, file: !45, line: 188, baseType: !907, size: 32, offset: 8448)
!907 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMDirtyFlag", file: !45, line: 175, baseType: !50)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "totmat", scope: !880, file: !45, line: 189, baseType: !196, size: 32, offset: 8480)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !880, file: !45, line: 190, baseType: !767, size: 64, offset: 8512)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "cd_flag", scope: !880, file: !45, line: 193, baseType: !277, size: 8, offset: 8576)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "calcNormals", scope: !880, file: !45, line: 196, baseType: !912, size: 64, offset: 8640)
!912 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !913, size: 64)
!913 = !DISubroutineType(types: !914)
!914 = !{null, !915}
!915 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !916, size: 64)
!916 = !DIDerivedType(tag: DW_TAG_typedef, name: "DerivedMesh", file: !45, line: 177, baseType: !880)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "calcLoopNormals", scope: !880, file: !45, line: 199, baseType: !918, size: 64, offset: 8704)
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !919, size: 64)
!919 = !DISubroutineType(types: !920)
!920 = !{null, !915, !921}
!921 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !388)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "recalcTessellation", scope: !880, file: !45, line: 202, baseType: !912, size: 64, offset: 8768)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "getNumVerts", scope: !880, file: !45, line: 207, baseType: !924, size: 64, offset: 8832)
!924 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !925, size: 64)
!925 = !DISubroutineType(types: !926)
!926 = !{!196, !915}
!927 = !DIDerivedType(tag: DW_TAG_member, name: "getNumEdges", scope: !880, file: !45, line: 208, baseType: !924, size: 64, offset: 8896)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "getNumTessFaces", scope: !880, file: !45, line: 209, baseType: !924, size: 64, offset: 8960)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "getNumLoops", scope: !880, file: !45, line: 210, baseType: !924, size: 64, offset: 9024)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "getNumPolys", scope: !880, file: !45, line: 211, baseType: !924, size: 64, offset: 9088)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "getVert", scope: !880, file: !45, line: 218, baseType: !932, size: 64, offset: 9152)
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 64)
!933 = !DISubroutineType(types: !934)
!934 = !{null, !915, !196, !383}
!935 = !DIDerivedType(tag: DW_TAG_member, name: "getEdge", scope: !880, file: !45, line: 219, baseType: !936, size: 64, offset: 9216)
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 64)
!937 = !DISubroutineType(types: !938)
!938 = !{null, !915, !196, !939}
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 64)
!940 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MEdge", file: !257, line: 48, size: 96, elements: !941)
!941 = !{!942, !943, !944, !945, !946}
!942 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !940, file: !257, line: 49, baseType: !7, size: 32)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !940, file: !257, line: 49, baseType: !7, size: 32, offset: 32)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "crease", scope: !940, file: !257, line: 50, baseType: !277, size: 8, offset: 64)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "bweight", scope: !940, file: !257, line: 50, baseType: !277, size: 8, offset: 72)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !940, file: !257, line: 51, baseType: !319, size: 16, offset: 80)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFace", scope: !880, file: !45, line: 220, baseType: !948, size: 64, offset: 9280)
!948 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 64)
!949 = !DISubroutineType(types: !950)
!950 = !{null, !915, !196, !951}
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64)
!952 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MFace", file: !257, line: 42, size: 160, elements: !953)
!953 = !{!954, !955, !956, !957, !958, !959, !960}
!954 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !952, file: !257, line: 43, baseType: !7, size: 32)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !952, file: !257, line: 43, baseType: !7, size: 32, offset: 32)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !952, file: !257, line: 43, baseType: !7, size: 32, offset: 64)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !952, file: !257, line: 43, baseType: !7, size: 32, offset: 96)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !952, file: !257, line: 44, baseType: !319, size: 16, offset: 128)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "edcode", scope: !952, file: !257, line: 45, baseType: !277, size: 8, offset: 144)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !952, file: !257, line: 45, baseType: !277, size: 8, offset: 152)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "getVertArray", scope: !880, file: !45, line: 227, baseType: !962, size: 64, offset: 9344)
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 64)
!963 = !DISubroutineType(types: !964)
!964 = !{!383, !915}
!965 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeArray", scope: !880, file: !45, line: 228, baseType: !966, size: 64, offset: 9408)
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 64)
!967 = !DISubroutineType(types: !968)
!968 = !{!939, !915}
!969 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceArray", scope: !880, file: !45, line: 229, baseType: !970, size: 64, offset: 9472)
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64)
!971 = !DISubroutineType(types: !972)
!972 = !{!951, !915}
!973 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopArray", scope: !880, file: !45, line: 230, baseType: !974, size: 64, offset: 9536)
!974 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !975, size: 64)
!975 = !DISubroutineType(types: !976)
!976 = !{!405, !915}
!977 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyArray", scope: !880, file: !45, line: 231, baseType: !978, size: 64, offset: 9600)
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 64)
!979 = !DISubroutineType(types: !980)
!980 = !{!396, !915}
!981 = !DIDerivedType(tag: DW_TAG_member, name: "copyVertArray", scope: !880, file: !45, line: 236, baseType: !982, size: 64, offset: 9664)
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64)
!983 = !DISubroutineType(types: !984)
!984 = !{null, !915, !383}
!985 = !DIDerivedType(tag: DW_TAG_member, name: "copyEdgeArray", scope: !880, file: !45, line: 237, baseType: !986, size: 64, offset: 9728)
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 64)
!987 = !DISubroutineType(types: !988)
!988 = !{null, !915, !939}
!989 = !DIDerivedType(tag: DW_TAG_member, name: "copyTessFaceArray", scope: !880, file: !45, line: 238, baseType: !990, size: 64, offset: 9792)
!990 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !991, size: 64)
!991 = !DISubroutineType(types: !992)
!992 = !{null, !915, !951}
!993 = !DIDerivedType(tag: DW_TAG_member, name: "copyLoopArray", scope: !880, file: !45, line: 239, baseType: !994, size: 64, offset: 9856)
!994 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !995, size: 64)
!995 = !DISubroutineType(types: !996)
!996 = !{null, !915, !405}
!997 = !DIDerivedType(tag: DW_TAG_member, name: "copyPolyArray", scope: !880, file: !45, line: 240, baseType: !998, size: 64, offset: 9920)
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !999, size: 64)
!999 = !DISubroutineType(types: !1000)
!1000 = !{null, !915, !396}
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "dupVertArray", scope: !880, file: !45, line: 245, baseType: !962, size: 64, offset: 9984)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "dupEdgeArray", scope: !880, file: !45, line: 246, baseType: !966, size: 64, offset: 10048)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "dupTessFaceArray", scope: !880, file: !45, line: 247, baseType: !970, size: 64, offset: 10112)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "dupLoopArray", scope: !880, file: !45, line: 248, baseType: !974, size: 64, offset: 10176)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "dupPolyArray", scope: !880, file: !45, line: 249, baseType: !978, size: 64, offset: 10240)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "getVertData", scope: !880, file: !45, line: 255, baseType: !1007, size: 64, offset: 10304)
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1008, size: 64)
!1008 = !DISubroutineType(types: !1009)
!1009 = !{!291, !915, !196, !196}
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeData", scope: !880, file: !45, line: 256, baseType: !1007, size: 64, offset: 10368)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceData", scope: !880, file: !45, line: 257, baseType: !1007, size: 64, offset: 10432)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyData", scope: !880, file: !45, line: 258, baseType: !1007, size: 64, offset: 10496)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "getVertDataArray", scope: !880, file: !45, line: 264, baseType: !1014, size: 64, offset: 10560)
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64)
!1015 = !DISubroutineType(types: !1016)
!1016 = !{!291, !915, !196}
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeDataArray", scope: !880, file: !45, line: 265, baseType: !1014, size: 64, offset: 10624)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceDataArray", scope: !880, file: !45, line: 266, baseType: !1014, size: 64, offset: 10688)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopDataArray", scope: !880, file: !45, line: 267, baseType: !1014, size: 64, offset: 10752)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyDataArray", scope: !880, file: !45, line: 268, baseType: !1014, size: 64, offset: 10816)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "getVertDataLayout", scope: !880, file: !45, line: 272, baseType: !1022, size: 64, offset: 10880)
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 64)
!1023 = !DISubroutineType(types: !1024)
!1024 = !{!1025, !915}
!1025 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeDataLayout", scope: !880, file: !45, line: 273, baseType: !1022, size: 64, offset: 10944)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceDataLayout", scope: !880, file: !45, line: 274, baseType: !1022, size: 64, offset: 11008)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopDataLayout", scope: !880, file: !45, line: 275, baseType: !1022, size: 64, offset: 11072)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyDataLayout", scope: !880, file: !45, line: 276, baseType: !1022, size: 64, offset: 11136)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromVertCData", scope: !880, file: !45, line: 279, baseType: !1031, size: 64, offset: 11200)
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1032, size: 64)
!1032 = !DISubroutineType(types: !1033)
!1033 = !{null, !915, !196, !1025, !196}
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromEdgeCData", scope: !880, file: !45, line: 280, baseType: !1031, size: 64, offset: 11264)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromFaceCData", scope: !880, file: !45, line: 281, baseType: !1031, size: 64, offset: 11328)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "getNumGrids", scope: !880, file: !45, line: 284, baseType: !924, size: 64, offset: 11392)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "getGridSize", scope: !880, file: !45, line: 285, baseType: !924, size: 64, offset: 11456)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "getGridData", scope: !880, file: !45, line: 286, baseType: !1039, size: 64, offset: 11520)
!1039 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1040, size: 64)
!1040 = !DISubroutineType(types: !1041)
!1041 = !{!1042, !915}
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1043, size: 64)
!1043 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1044, size: 64)
!1044 = !DICompositeType(tag: DW_TAG_structure_type, name: "CCGElem", file: !630, line: 33, flags: DIFlagFwdDecl)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "getGridAdjacency", scope: !880, file: !45, line: 287, baseType: !1046, size: 64, offset: 11584)
!1046 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1047, size: 64)
!1047 = !DISubroutineType(types: !1048)
!1048 = !{!1049, !915}
!1049 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1050, size: 64)
!1050 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMGridAdjacency", file: !45, line: 120, baseType: !1051)
!1051 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DMGridAdjacency", file: !45, line: 117, size: 256, elements: !1052)
!1052 = !{!1053, !1055}
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1051, file: !45, line: 118, baseType: !1054, size: 128)
!1054 = !DICompositeType(tag: DW_TAG_array_type, baseType: !196, size: 128, elements: !784)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "rotation", scope: !1051, file: !45, line: 119, baseType: !1054, size: 128, offset: 128)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "getGridOffset", scope: !880, file: !45, line: 288, baseType: !1057, size: 64, offset: 11648)
!1057 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1058, size: 64)
!1058 = !DISubroutineType(types: !1059)
!1059 = !{!426, !915}
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "getGridKey", scope: !880, file: !45, line: 289, baseType: !1061, size: 64, offset: 11712)
!1061 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1062, size: 64)
!1062 = !DISubroutineType(types: !1063)
!1063 = !{null, !915, !1064}
!1064 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1065, size: 64)
!1065 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CCGKey", file: !1066, line: 53, size: 320, elements: !1067)
!1066 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_ccg.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1067 = !{!1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077}
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1065, file: !1066, line: 54, baseType: !196, size: 32)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "elem_size", scope: !1065, file: !1066, line: 58, baseType: !196, size: 32, offset: 32)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "grid_size", scope: !1065, file: !1066, line: 61, baseType: !196, size: 32, offset: 64)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "grid_area", scope: !1065, file: !1066, line: 63, baseType: !196, size: 32, offset: 96)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "grid_bytes", scope: !1065, file: !1066, line: 65, baseType: !196, size: 32, offset: 128)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "normal_offset", scope: !1065, file: !1066, line: 69, baseType: !196, size: 32, offset: 160)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "mask_offset", scope: !1065, file: !1066, line: 73, baseType: !196, size: 32, offset: 192)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "num_layers", scope: !1065, file: !1066, line: 75, baseType: !196, size: 32, offset: 224)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "has_normals", scope: !1065, file: !1066, line: 76, baseType: !196, size: 32, offset: 256)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "has_mask", scope: !1065, file: !1066, line: 77, baseType: !196, size: 32, offset: 288)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "getGridFlagMats", scope: !880, file: !45, line: 290, baseType: !1079, size: 64, offset: 11776)
!1079 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1080, size: 64)
!1080 = !DISubroutineType(types: !1081)
!1081 = !{!1082, !915}
!1082 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1083, size: 64)
!1083 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMFlagMat", file: !45, line: 126, baseType: !1084)
!1084 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DMFlagMat", file: !45, line: 123, size: 32, elements: !1085)
!1085 = !{!1086, !1087}
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !1084, file: !45, line: 124, baseType: !319, size: 16)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1084, file: !45, line: 125, baseType: !277, size: 8, offset: 16)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "getGridHidden", scope: !880, file: !45, line: 291, baseType: !1089, size: 64, offset: 11840)
