; ModuleID = 'blender/source/blender/imbuf/intern/moviecache.c'
source_filename = "blender/source/blender/imbuf/intern/moviecache.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.MEM_CacheLimiter_s = type opaque
%struct.MovieCacheItem = type { %struct.MovieCache*, %struct.ImBuf*, %struct.MEM_CacheLimiterHandle_s*, i8* }
%struct.MovieCache = type { [64 x i8], %struct.GHash*, i32 (i8*)*, i8 (i8*, i8*)*, void (i8*, i32*, i32*, i32*)*, i8* (i8*)*, i32 (i8*, i8*)*, void (i8*)*, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BLI_mempool*, i32, i8*, i32, i32*, i32, i32, i32 }
%struct.GHash = type opaque
%struct.BLI_mempool = type opaque
%struct.ImBuf = type { %struct.ImBuf*, %struct.ImBuf*, i32, i32, i8, i32, i32, i32, i32*, float*, [2 x double], i32, i32, i32, i32, i32**, i32*, float*, float, [20 x %struct.ImBuf*], i32, i32, i32, i32, %struct.ImMetaData*, i8*, i32, [1024 x i8], [1024 x i8], %struct.MEM_CacheLimiterHandle_s*, i32, i8*, i32, i32, %struct.ColorSpace*, %struct.ColorSpace*, i32*, %struct.ColormanageCache*, i32, %struct.rcti, %struct.DDSData }
%struct.ImMetaData = type opaque
%struct.ColorSpace = type opaque
%struct.ColormanageCache = type opaque
%struct.rcti = type { i32, i32, i32, i32 }
%struct.DDSData = type { i32, i32, i8*, i32 }
%struct.MEM_CacheLimiterHandle_s = type opaque
%struct.MovieCacheKey = type { %struct.MovieCache*, i8* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "limitor", scope: !2, file: !3, line: 61, type: !202, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !11, globals: !193, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "blender/source/blender/imbuf/intern/moviecache.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 83, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "blender/source/blender/blenlib/BLI_mempool.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10}
!9 = !DIEnumerator(name: "BLI_MEMPOOL_NOP", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "BLI_MEMPOOL_ALLOW_ITER", value: 1, isUnsigned: true)
!11 = !{!12, !50, !170, !172, !181, !187, !51}
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieCacheItem", file: !3, line: 102, baseType: !14)
!14 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCacheItem", file: !3, line: 97, size: 256, elements: !15)
!15 = !{!16, !80, !166, !169}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "cache_owner", scope: !14, file: !3, line: 98, baseType: !17, size: 64)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieCache", file: !3, line: 90, baseType: !19)
!19 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !3, line: 68, size: 1536, elements: !20)
!20 = !{!21, !26, !31, !38, !44, !53, !58, !63, !68, !71, !72, !73, !74, !75, !76, !77, !78, !79}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !19, file: !3, line: 69, baseType: !22, size: 512)
!22 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 512, elements: !24)
!23 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!24 = !{!25}
!25 = !DISubrange(count: 64)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !19, file: !3, line: 71, baseType: !27, size: 64, offset: 512)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHash", file: !29, line: 48, baseType: !30)
!29 = !DIFile(filename: "blender/source/blender/blenlib/BLI_ghash.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!30 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !29, line: 48, flags: DIFlagFwdDecl)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "hashfp", scope: !19, file: !3, line: 72, baseType: !32, size: 64, offset: 576)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashHashFP", file: !29, line: 43, baseType: !33)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!34 = !DISubroutineType(types: !35)
!35 = !{!7, !36}
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "cmpfp", scope: !19, file: !3, line: 73, baseType: !39, size: 64, offset: 640)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashCmpFP", file: !29, line: 44, baseType: !40)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!41 = !DISubroutineType(types: !42)
!42 = !{!43, !36, !36}
!43 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "getdatafp", scope: !19, file: !3, line: 74, baseType: !45, size: 64, offset: 704)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieCacheGetKeyDataFP", file: !46, line: 45, baseType: !47)
!46 = !DIFile(filename: "blender/source/blender/imbuf/IMB_moviecache.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!48 = !DISubroutineType(types: !49)
!49 = !{null, !50, !51, !51, !51}
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!52 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "getprioritydatafp", scope: !19, file: !3, line: 76, baseType: !54, size: 64, offset: 768)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieCacheGetPriorityDataFP", file: !46, line: 47, baseType: !55)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!56 = !DISubroutineType(types: !57)
!57 = !{!50, !50}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "getitempriorityfp", scope: !19, file: !3, line: 77, baseType: !59, size: 64, offset: 832)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieCacheGetItemPriorityFP", file: !46, line: 48, baseType: !60)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = !DISubroutineType(types: !62)
!62 = !{!52, !50, !50}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "prioritydeleterfp", scope: !19, file: !3, line: 78, baseType: !64, size: 64, offset: 896)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieCachePriorityDeleterFP", file: !46, line: 49, baseType: !65)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!66 = !DISubroutineType(types: !67)
!67 = !{null, !50}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "keys_pool", scope: !19, file: !3, line: 80, baseType: !69, size: 64, offset: 960)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool", file: !6, line: 44, flags: DIFlagFwdDecl)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "items_pool", scope: !19, file: !3, line: 81, baseType: !69, size: 64, offset: 1024)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "userkeys_pool", scope: !19, file: !3, line: 82, baseType: !69, size: 64, offset: 1088)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "keysize", scope: !19, file: !3, line: 84, baseType: !52, size: 32, offset: 1152)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "last_userkey", scope: !19, file: !3, line: 86, baseType: !50, size: 64, offset: 1216)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "totseg", scope: !19, file: !3, line: 88, baseType: !52, size: 32, offset: 1280)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !19, file: !3, line: 88, baseType: !51, size: 64, offset: 1344)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !19, file: !3, line: 88, baseType: !52, size: 32, offset: 1408)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "render_flags", scope: !19, file: !3, line: 88, baseType: !52, size: 32, offset: 1440)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !19, file: !3, line: 89, baseType: !52, size: 32, offset: 1472)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "ibuf", scope: !14, file: !3, line: 99, baseType: !81, size: 64, offset: 64)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImBuf", file: !83, line: 141, baseType: !84)
!83 = !DIFile(filename: "blender/source/blender/imbuf/IMB_imbuf_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!84 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImBuf", file: !83, line: 70, size: 19840, elements: !85)
!85 = !{!86, !88, !89, !90, !91, !92, !93, !94, !95, !97, !100, !105, !106, !107, !108, !109, !111, !112, !113, !114, !118, !119, !120, !121, !122, !125, !126, !127, !131, !132, !136, !137, !139, !140, !141, !144, !145, !146, !149, !150, !159}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !84, file: !83, line: 71, baseType: !87, size: 64)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !84, file: !83, line: 71, baseType: !87, size: 64, offset: 64)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !84, file: !83, line: 74, baseType: !52, size: 32, offset: 128)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !84, file: !83, line: 74, baseType: !52, size: 32, offset: 160)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !84, file: !83, line: 79, baseType: !43, size: 8, offset: 192)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !84, file: !83, line: 80, baseType: !52, size: 32, offset: 224)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !84, file: !83, line: 83, baseType: !52, size: 32, offset: 256)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "mall", scope: !84, file: !83, line: 84, baseType: !52, size: 32, offset: 288)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !84, file: !83, line: 87, baseType: !96, size: 64, offset: 320)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "rect_float", scope: !84, file: !83, line: 88, baseType: !98, size: 64, offset: 384)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "ppm", scope: !84, file: !83, line: 93, baseType: !101, size: 128, offset: 448)
!101 = !DICompositeType(tag: DW_TAG_array_type, baseType: !102, size: 128, elements: !103)
!102 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!103 = !{!104}
!104 = !DISubrange(count: 2)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "tilex", scope: !84, file: !83, line: 96, baseType: !52, size: 32, offset: 576)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "tiley", scope: !84, file: !83, line: 96, baseType: !52, size: 32, offset: 608)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "xtiles", scope: !84, file: !83, line: 97, baseType: !52, size: 32, offset: 640)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "ytiles", scope: !84, file: !83, line: 97, baseType: !52, size: 32, offset: 672)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "tiles", scope: !84, file: !83, line: 98, baseType: !110, size: 64, offset: 704)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "zbuf", scope: !84, file: !83, line: 101, baseType: !51, size: 64, offset: 768)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "zbuf_float", scope: !84, file: !83, line: 102, baseType: !98, size: 64, offset: 832)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !84, file: !83, line: 105, baseType: !99, size: 32, offset: 896)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "mipmap", scope: !84, file: !83, line: 108, baseType: !115, size: 1280, offset: 960)
!115 = !DICompositeType(tag: DW_TAG_array_type, baseType: !87, size: 1280, elements: !116)
!116 = !{!117}
!117 = !DISubrange(count: 20)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "miptot", scope: !84, file: !83, line: 109, baseType: !52, size: 32, offset: 2240)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "miplevel", scope: !84, file: !83, line: 109, baseType: !52, size: 32, offset: 2272)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !84, file: !83, line: 112, baseType: !52, size: 32, offset: 2304)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "userflags", scope: !84, file: !83, line: 113, baseType: !52, size: 32, offset: 2336)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !84, file: !83, line: 114, baseType: !123, size: 64, offset: 2368)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = !DICompositeType(tag: DW_TAG_structure_type, name: "ImMetaData", file: !83, line: 50, flags: DIFlagFwdDecl)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "userdata", scope: !84, file: !83, line: 115, baseType: !50, size: 64, offset: 2432)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "ftype", scope: !84, file: !83, line: 118, baseType: !52, size: 32, offset: 2496)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !84, file: !83, line: 119, baseType: !128, size: 8192, offset: 2528)
!128 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 8192, elements: !129)
!129 = !{!130}
!130 = !DISubrange(count: 1024)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "cachename", scope: !84, file: !83, line: 120, baseType: !128, size: 8192, offset: 10720)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "c_handle", scope: !84, file: !83, line: 123, baseType: !133, size: 64, offset: 18944)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = !DICompositeType(tag: DW_TAG_structure_type, name: "MEM_CacheLimiterHandle_s", file: !135, line: 36, flags: DIFlagFwdDecl)
!135 = !DIFile(filename: "blender/intern/memutil/MEM_CacheLimiterC-Api.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!136 = !DIDerivedType(tag: DW_TAG_member, name: "refcounter", scope: !84, file: !83, line: 124, baseType: !52, size: 32, offset: 19008)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "encodedbuffer", scope: !84, file: !83, line: 127, baseType: !138, size: 64, offset: 19072)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "encodedsize", scope: !84, file: !83, line: 128, baseType: !7, size: 32, offset: 19136)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "encodedbuffersize", scope: !84, file: !83, line: 129, baseType: !7, size: 32, offset: 19168)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "rect_colorspace", scope: !84, file: !83, line: 132, baseType: !142, size: 64, offset: 19200)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!143 = !DICompositeType(tag: DW_TAG_structure_type, name: "ColorSpace", file: !83, line: 132, flags: DIFlagFwdDecl)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "float_colorspace", scope: !84, file: !83, line: 133, baseType: !142, size: 64, offset: 19264)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "display_buffer_flags", scope: !84, file: !83, line: 134, baseType: !96, size: 64, offset: 19328)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "colormanage_cache", scope: !84, file: !83, line: 135, baseType: !147, size: 64, offset: 19392)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!148 = !DICompositeType(tag: DW_TAG_structure_type, name: "ColormanageCache", file: !83, line: 135, flags: DIFlagFwdDecl)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "colormanage_flag", scope: !84, file: !83, line: 136, baseType: !52, size: 32, offset: 19456)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "invalid_rect", scope: !84, file: !83, line: 137, baseType: !151, size: 128, offset: 19488)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "rcti", file: !152, line: 89, baseType: !153)
!152 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rcti", file: !152, line: 86, size: 128, elements: !154)
!154 = !{!155, !156, !157, !158}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !153, file: !152, line: 87, baseType: !52, size: 32)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !153, file: !152, line: 87, baseType: !52, size: 32, offset: 32)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !153, file: !152, line: 88, baseType: !52, size: 32, offset: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !153, file: !152, line: 88, baseType: !52, size: 32, offset: 96)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "dds_data", scope: !84, file: !83, line: 140, baseType: !160, size: 192, offset: 19648)
!160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DDSData", file: !83, line: 55, size: 192, elements: !161)
!161 = !{!162, !163, !164, !165}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "fourcc", scope: !160, file: !83, line: 56, baseType: !7, size: 32)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "nummipmaps", scope: !160, file: !83, line: 57, baseType: !7, size: 32, offset: 32)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !160, file: !83, line: 58, baseType: !138, size: 64, offset: 64)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !160, file: !83, line: 59, baseType: !7, size: 32, offset: 128)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "c_handle", scope: !14, file: !3, line: 100, baseType: !167, size: 64, offset: 128)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "MEM_CacheLimiterHandleC", file: !135, line: 39, baseType: !134)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "priority_data", scope: !14, file: !3, line: 101, baseType: !50, size: 64, offset: 192)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCacheIter", file: !46, line: 72, flags: DIFlagFwdDecl)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashIterator", file: !29, line: 54, baseType: !174)
!174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GHashIterator", file: !29, line: 50, size: 192, elements: !175)
!175 = !{!176, !177, !180}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "gh", scope: !174, file: !29, line: 51, baseType: !27, size: 64)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "curEntry", scope: !174, file: !29, line: 52, baseType: !178, size: 64, offset: 64)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry", file: !29, line: 52, flags: DIFlagFwdDecl)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "curBucket", scope: !174, file: !29, line: 53, baseType: !7, size: 32, offset: 128)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieCacheKey", file: !3, line: 95, baseType: !183)
!183 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCacheKey", file: !3, line: 92, size: 128, elements: !184)
!184 = !{!185, !186}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "cache_owner", scope: !183, file: !3, line: 93, baseType: !17, size: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "userkey", scope: !183, file: !3, line: 94, baseType: !50, size: 64, offset: 64)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_gh_Entry", file: !29, line: 94, size: 192, elements: !189)
!189 = !{!190, !191, !192}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !188, file: !29, line: 94, baseType: !50, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !188, file: !29, line: 94, baseType: !50, size: 64, offset: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !188, file: !29, line: 94, baseType: !50, size: 64, offset: 128)
!193 = !{!0, !194}
!194 = !DIGlobalVariableExpression(var: !195, expr: !DIExpression())
!195 = distinct !DIGlobalVariable(name: "limitor_lock", scope: !2, file: !3, line: 63, type: !196, isLocal: true, isDefinition: true)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "spec_null_mutex_t", file: !197, line: 6, baseType: !198)
!197 = !DIFile(filename: "include/spec_pthread.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !199, line: 26, baseType: !200)
!199 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !201, line: 42, baseType: !7)
!201 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "MEM_CacheLimiterC", file: !135, line: 38, baseType: !204)
!204 = !DICompositeType(tag: DW_TAG_structure_type, name: "MEM_CacheLimiter_s", file: !135, line: 35, flags: DIFlagFwdDecl)
!205 = !{i32 7, !"Dwarf Version", i32 4}
!206 = !{i32 2, !"Debug Info Version", i32 3}
!207 = !{i32 1, !"wchar_size", i32 4}
!208 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!209 = distinct !DISubprogram(name: "IMB_moviecache_init", scope: !3, file: !3, line: 289, type: !210, scopeLine: 290, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !212)
!210 = !DISubroutineType(types: !211)
!211 = !{null}
!212 = !{}
!213 = !DILocation(line: 291, column: 12, scope: !209)
!214 = !DILocation(line: 291, column: 10, scope: !209)
!215 = !DILocation(line: 293, column: 41, scope: !209)
!216 = !DILocation(line: 293, column: 2, scope: !209)
!217 = !DILocation(line: 294, column: 44, scope: !209)
!218 = !DILocation(line: 294, column: 2, scope: !209)
!219 = !DILocation(line: 295, column: 1, scope: !209)
!220 = distinct !DISubprogram(name: "IMB_moviecache_destructor", scope: !3, file: !3, line: 179, type: !66, scopeLine: 180, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !212)
!221 = !DILocalVariable(name: "p", arg: 1, scope: !220, file: !3, line: 179, type: !50)
!222 = !DILocation(line: 179, column: 45, scope: !220)
!223 = !DILocalVariable(name: "item", scope: !220, file: !3, line: 181, type: !12)
!224 = !DILocation(line: 181, column: 18, scope: !220)
!225 = !DILocation(line: 181, column: 43, scope: !220)
!226 = !DILocation(line: 181, column: 25, scope: !220)
!227 = !DILocation(line: 183, column: 6, scope: !228)
!228 = distinct !DILexicalBlock(scope: !220, file: !3, line: 183, column: 6)
!229 = !DILocation(line: 183, column: 11, scope: !228)
!230 = !DILocation(line: 183, column: 14, scope: !228)
!231 = !DILocation(line: 183, column: 20, scope: !228)
!232 = !DILocation(line: 183, column: 6, scope: !220)
!233 = !DILocalVariable(name: "cache", scope: !234, file: !3, line: 184, type: !17)
!234 = distinct !DILexicalBlock(scope: !228, file: !3, line: 183, column: 26)
!235 = !DILocation(line: 184, column: 15, scope: !234)
!236 = !DILocation(line: 184, column: 23, scope: !234)
!237 = !DILocation(line: 184, column: 29, scope: !234)
!238 = !DILocation(line: 188, column: 17, scope: !234)
!239 = !DILocation(line: 188, column: 23, scope: !234)
!240 = !DILocation(line: 188, column: 3, scope: !234)
!241 = !DILocation(line: 190, column: 3, scope: !234)
!242 = !DILocation(line: 190, column: 9, scope: !234)
!243 = !DILocation(line: 190, column: 14, scope: !234)
!244 = !DILocation(line: 191, column: 3, scope: !234)
!245 = !DILocation(line: 191, column: 9, scope: !234)
!246 = !DILocation(line: 191, column: 18, scope: !234)
