; ModuleID = 'blender/source/blender/bmesh/operators/bmo_subdivide_edgering.c'
source_filename = "blender/source/blender/bmesh/operators/bmo_subdivide_edgering.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.BMesh = type { i32, i32, i32, i32, i32, i32, i32, i8, i8, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BMVert**, %struct.BMEdge**, %struct.BMFace**, i32, i32, i32, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BLI_mempool*, i32, %struct.BMOperator*, %struct.CustomData, %struct.CustomData, %struct.CustomData, %struct.CustomData, i16, i32, i32, i32, %struct.ListBase, %struct.BMFace*, %struct.ListBase, i8* }
%struct.BMVert = type { %struct.BMHeader, %struct.BMFlagLayer*, [3 x float], [3 x float], %struct.BMEdge* }
%struct.BMHeader = type { i8*, i32, i8, i8, i8 }
%struct.BMFlagLayer = type { i16 }
%struct.BMEdge = type { %struct.BMHeader, %struct.BMFlagLayer*, %struct.BMVert*, %struct.BMVert*, %struct.BMLoop*, %struct.BMDiskLink, %struct.BMDiskLink }
%struct.BMLoop = type { %struct.BMHeader, %struct.BMVert*, %struct.BMEdge*, %struct.BMFace*, %struct.BMLoop*, %struct.BMLoop*, %struct.BMLoop*, %struct.BMLoop* }
%struct.BMDiskLink = type { %struct.BMEdge*, %struct.BMEdge* }
%struct.BLI_mempool = type opaque

!43 = !DIFile(filename: "blender/source/blender/bmesh/bmesh_class.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!44 = !{!45, !46, !47, !48}
!45 = !DIEnumerator(name: "BM_VERT", value: 1, isUnsigned: true)
!46 = !DIEnumerator(name: "BM_EDGE", value: 2, isUnsigned: true)
!47 = !DIEnumerator(name: "BM_LOOP", value: 4, isUnsigned: true)
!48 = !DIEnumerator(name: "BM_FACE", value: 8, isUnsigned: true)
!49 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !43, line: 260, baseType: !5, size: 32, elements: !50)
!50 = !{!51, !52, !53, !54, !55, !56, !57}
!51 = !DIEnumerator(name: "BM_ELEM_SELECT", value: 1, isUnsigned: true)
!52 = !DIEnumerator(name: "BM_ELEM_HIDDEN", value: 2, isUnsigned: true)
!53 = !DIEnumerator(name: "BM_ELEM_SEAM", value: 4, isUnsigned: true)
!54 = !DIEnumerator(name: "BM_ELEM_SMOOTH", value: 8, isUnsigned: true)
!55 = !DIEnumerator(name: "BM_ELEM_TAG", value: 16, isUnsigned: true)
!56 = !DIEnumerator(name: "BM_ELEM_DRAW", value: 32, isUnsigned: true)
!57 = !DIEnumerator(name: "BM_ELEM_INTERNAL_TAG", value: 128, isUnsigned: true)
!58 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "BMIterType", file: !59, line: 57, baseType: !5, size: 32, elements: !60)
!59 = !DIFile(filename: "blender/source/blender/bmesh/intern/bmesh_iterators.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!60 = !{!61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74}
!61 = !DIEnumerator(name: "BM_VERTS_OF_MESH", value: 1, isUnsigned: true)
!62 = !DIEnumerator(name: "BM_EDGES_OF_MESH", value: 2, isUnsigned: true)
!63 = !DIEnumerator(name: "BM_FACES_OF_MESH", value: 3, isUnsigned: true)
!64 = !DIEnumerator(name: "BM_EDGES_OF_VERT", value: 4, isUnsigned: true)
!65 = !DIEnumerator(name: "BM_FACES_OF_VERT", value: 5, isUnsigned: true)
!66 = !DIEnumerator(name: "BM_LOOPS_OF_VERT", value: 6, isUnsigned: true)
!67 = !DIEnumerator(name: "BM_VERTS_OF_EDGE", value: 7, isUnsigned: true)
!68 = !DIEnumerator(name: "BM_FACES_OF_EDGE", value: 8, isUnsigned: true)
!69 = !DIEnumerator(name: "BM_VERTS_OF_FACE", value: 9, isUnsigned: true)
!70 = !DIEnumerator(name: "BM_EDGES_OF_FACE", value: 10, isUnsigned: true)
!71 = !DIEnumerator(name: "BM_LOOPS_OF_FACE", value: 11, isUnsigned: true)
!72 = !DIEnumerator(name: "BM_ALL_LOOPS_OF_FACE", value: 12, isUnsigned: true)
!73 = !DIEnumerator(name: "BM_LOOPS_OF_LOOP", value: 13, isUnsigned: true)
!74 = !DIEnumerator(name: "BM_LOOPS_OF_EDGE", value: 14, isUnsigned: true)
!75 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !76, line: 62, baseType: !5, size: 32, elements: !77)
!76 = !DIFile(filename: "blender/source/blender/bmesh/intern/bmesh_error.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!77 = !{!78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88}
!78 = !DIEnumerator(name: "BMERR_SELF_INTERSECTING", value: 1, isUnsigned: true)
!79 = !DIEnumerator(name: "BMERR_DISSOLVEDISK_FAILED", value: 2, isUnsigned: true)
!80 = !DIEnumerator(name: "BMERR_CONNECTVERT_FAILED", value: 3, isUnsigned: true)
!81 = !DIEnumerator(name: "BMERR_WALKER_FAILED", value: 4, isUnsigned: true)
!82 = !DIEnumerator(name: "BMERR_DISSOLVEFACES_FAILED", value: 5, isUnsigned: true)
!83 = !DIEnumerator(name: "BMERR_TESSELLATION", value: 6, isUnsigned: true)
!84 = !DIEnumerator(name: "BMERR_NONMANIFOLD", value: 7, isUnsigned: true)
!85 = !DIEnumerator(name: "BMERR_INVALID_SELECTION", value: 8, isUnsigned: true)
!86 = !DIEnumerator(name: "BMERR_MESH_ERROR", value: 9, isUnsigned: true)
!87 = !DIEnumerator(name: "BMERR_CONVEX_HULL_FAILED", value: 10, isUnsigned: true)
!88 = !DIEnumerator(name: "BMERR_TOTAL", value: 11, isUnsigned: true)
!89 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !90, line: 65, baseType: !5, size: 32, elements: !91)
!90 = !DIFile(filename: "blender/source/blender/bmesh/intern/bmesh_operators.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!91 = !{!92, !93, !94}
!92 = !DIEnumerator(name: "SUBD_RING_INTERP_LINEAR", value: 0, isUnsigned: true)
!93 = !DIEnumerator(name: "SUBD_RING_INTERP_PATH", value: 1, isUnsigned: true)
!94 = !DIEnumerator(name: "SUBD_RING_INTERP_SURF", value: 2, isUnsigned: true)
!95 = !{!96, !97, !98, !99, !103, !107, !172, !174, !156, !119, !176, !127, !179, !188, !191, !5, !192, !198, !205}
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!97 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIterType", file: !59, line: 79, baseType: !58)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter__begin_cb", file: !59, line: 158, baseType: !100)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = !DISubroutineType(types: !102)
!102 = !{null, !96}
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter__step_cb", file: !59, line: 159, baseType: !104)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!105 = !DISubroutineType(types: !106)
!106 = !{!96, !96}
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMVert", file: !43, line: 103, baseType: !109)
!109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMVert", file: !43, line: 90, size: 448, elements: !110)
!110 = !{!111, !122, !128, !132, !133}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !109, file: !43, line: 91, baseType: !112, size: 128)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMHeader", file: !43, line: 82, baseType: !113)
!113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMHeader", file: !43, line: 64, size: 128, elements: !114)
!114 = !{!115, !116, !118, !120, !121}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !113, file: !43, line: 65, baseType: !96, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !113, file: !43, line: 66, baseType: !117, size: 32, offset: 64)
!117 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !113, file: !43, line: 73, baseType: !119, size: 8, offset: 96)
!119 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "hflag", scope: !113, file: !43, line: 74, baseType: !119, size: 8, offset: 104)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "api_flag", scope: !113, file: !43, line: 80, baseType: !119, size: 8, offset: 112)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !109, file: !43, line: 92, baseType: !123, size: 64, offset: 128)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFlagLayer", file: !43, line: 180, size: 16, elements: !125)
!125 = !{!126}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !124, file: !43, line: 181, baseType: !127, size: 16)
!127 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !109, file: !43, line: 94, baseType: !129, size: 96, offset: 192)
!129 = !DICompositeType(tag: DW_TAG_array_type, baseType: !97, size: 96, elements: !130)
!130 = !{!131}
!131 = !DISubrange(count: 3)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !109, file: !43, line: 95, baseType: !129, size: 96, offset: 288)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !109, file: !43, line: 102, baseType: !134, size: 64, offset: 384)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMEdge", file: !43, line: 110, size: 640, elements: !136)
!136 = !{!137, !138, !139, !141, !142, !165, !171}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !135, file: !43, line: 111, baseType: !112, size: 128)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !135, file: !43, line: 112, baseType: !123, size: 64, offset: 128)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !135, file: !43, line: 114, baseType: !140, size: 64, offset: 192)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !135, file: !43, line: 114, baseType: !140, size: 64, offset: 256)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !135, file: !43, line: 118, baseType: !143, size: 64, offset: 320)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMLoop", file: !43, line: 125, size: 576, elements: !145)
!145 = !{!146, !147, !148, !149, !161, !162, !163, !164}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !144, file: !43, line: 126, baseType: !112, size: 128)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !144, file: !43, line: 129, baseType: !140, size: 64, offset: 128)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !144, file: !43, line: 130, baseType: !134, size: 64, offset: 192)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !144, file: !43, line: 131, baseType: !150, size: 64, offset: 256)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFace", file: !43, line: 164, size: 448, elements: !152)
!152 = !{!153, !154, !155, !158, !159, !160}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !151, file: !43, line: 165, baseType: !112, size: 128)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !151, file: !43, line: 166, baseType: !123, size: 64, offset: 128)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !151, file: !43, line: 172, baseType: !156, size: 64, offset: 192)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMLoop", file: !43, line: 140, baseType: !144)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !151, file: !43, line: 174, baseType: !117, size: 32, offset: 256)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !151, file: !43, line: 175, baseType: !129, size: 96, offset: 288)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !151, file: !43, line: 176, baseType: !127, size: 16, offset: 384)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "radial_next", scope: !144, file: !43, line: 135, baseType: !143, size: 64, offset: 320)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "radial_prev", scope: !144, file: !43, line: 135, baseType: !143, size: 64, offset: 384)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !144, file: !43, line: 139, baseType: !143, size: 64, offset: 448)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !144, file: !43, line: 139, baseType: !143, size: 64, offset: 512)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "v1_disk_link", scope: !135, file: !43, line: 122, baseType: !166, size: 128, offset: 384)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMDiskLink", file: !43, line: 108, baseType: !167)
!167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMDiskLink", file: !43, line: 106, size: 128, elements: !168)
!168 = !{!169, !170}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !167, file: !43, line: 107, baseType: !134, size: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !167, file: !43, line: 107, baseType: !134, size: 64, offset: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "v2_disk_link", scope: !135, file: !43, line: 122, baseType: !166, size: 128, offset: 512)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMEdge", file: !43, line: 123, baseType: !135)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMFace", file: !43, line: 178, baseType: !151)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !177, line: 90, baseType: !178)
!177 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!178 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "LinkData", file: !181, line: 66, baseType: !182)
!181 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!182 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LinkData", file: !181, line: 63, size: 192, elements: !183)
!183 = !{!184, !186, !187}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !182, file: !181, line: 64, baseType: !185, size: 64)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !182, file: !181, line: 64, baseType: !185, size: 64, offset: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !182, file: !181, line: 65, baseType: !96, size: 64, offset: 128)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = !DICompositeType(tag: DW_TAG_structure_type, name: "BMEdgeLoopStore", file: !190, line: 32, flags: DIFlagFwdDecl)
!190 = !DIFile(filename: "blender/source/blender/bmesh/intern/bmesh_edgeloop.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashIterator", file: !194, line: 54, baseType: !195)
!194 = !DIFile(filename: "blender/source/blender/blenlib/BLI_ghash.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!195 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GHashIterator", file: !194, line: 50, size: 192, elements: !196)
!196 = !{!197, !201, !204}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "gh", scope: !195, file: !194, line: 51, baseType: !198, size: 64)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHash", file: !194, line: 48, baseType: !200)
!200 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !194, line: 48, flags: DIFlagFwdDecl)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "curEntry", scope: !195, file: !194, line: 52, baseType: !202, size: 64, offset: 64)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!203 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry", file: !194, line: 52, flags: DIFlagFwdDecl)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "curBucket", scope: !195, file: !194, line: 53, baseType: !5, size: 32, offset: 128)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_gh_Entry", file: !194, line: 94, size: 192, elements: !207)
!207 = !{!208, !209, !210}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !206, file: !194, line: 94, baseType: !96, size: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !206, file: !194, line: 94, baseType: !96, size: 64, offset: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !206, file: !194, line: 94, baseType: !96, size: 64, offset: 128)
!211 = !{i32 7, !"Dwarf Version", i32 4}
!212 = !{i32 2, !"Debug Info Version", i32 3}
!213 = !{i32 1, !"wchar_size", i32 4}
!214 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!215 = distinct !DISubprogram(name: "bmo_subdivide_edgering_exec", scope: !1, file: !1, line: 1068, type: !216, scopeLine: 1069, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !356)
!216 = !DISubroutineType(types: !217)
!217 = !{null, !218, !354}
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMesh", file: !43, line: 246, baseType: !220)
!220 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMesh", file: !43, line: 186, size: 8064, elements: !221)
!221 = !{!222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !235, !236, !237, !238, !240, !242, !244, !245, !246, !247, !248, !249, !250, !251, !299, !338, !339, !340, !341, !342, !343, !344, !345, !351, !352, !353}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "totvert", scope: !220, file: !43, line: 187, baseType: !117, size: 32)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "totedge", scope: !220, file: !43, line: 187, baseType: !117, size: 32, offset: 32)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !220, file: !43, line: 187, baseType: !117, size: 32, offset: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "totface", scope: !220, file: !43, line: 187, baseType: !117, size: 32, offset: 96)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "totvertsel", scope: !220, file: !43, line: 188, baseType: !117, size: 32, offset: 128)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "totedgesel", scope: !220, file: !43, line: 188, baseType: !117, size: 32, offset: 160)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "totfacesel", scope: !220, file: !43, line: 188, baseType: !117, size: 32, offset: 192)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "elem_index_dirty", scope: !220, file: !43, line: 193, baseType: !119, size: 8, offset: 224)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "elem_table_dirty", scope: !220, file: !43, line: 197, baseType: !119, size: 8, offset: 232)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "vpool", scope: !220, file: !43, line: 201, baseType: !232, size: 64, offset: 256)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool", file: !234, line: 71, flags: DIFlagFwdDecl)
!234 = !DIFile(filename: "blender/source/blender/makesdna/DNA_customdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!235 = !DIDerivedType(tag: DW_TAG_member, name: "epool", scope: !220, file: !43, line: 201, baseType: !232, size: 64, offset: 320)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "lpool", scope: !220, file: !43, line: 201, baseType: !232, size: 64, offset: 384)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "fpool", scope: !220, file: !43, line: 201, baseType: !232, size: 64, offset: 448)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !220, file: !43, line: 208, baseType: !239, size: 64, offset: 512)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "etable", scope: !220, file: !43, line: 209, baseType: !241, size: 64, offset: 576)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "ftable", scope: !220, file: !43, line: 210, baseType: !243, size: 64, offset: 640)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "vtable_tot", scope: !220, file: !43, line: 213, baseType: !117, size: 32, offset: 704)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "etable_tot", scope: !220, file: !43, line: 214, baseType: !117, size: 32, offset: 736)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "ftable_tot", scope: !220, file: !43, line: 215, baseType: !117, size: 32, offset: 768)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "vtoolflagpool", scope: !220, file: !43, line: 218, baseType: !232, size: 64, offset: 832)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "etoolflagpool", scope: !220, file: !43, line: 218, baseType: !232, size: 64, offset: 896)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "ftoolflagpool", scope: !220, file: !43, line: 218, baseType: !232, size: 64, offset: 960)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "stackdepth", scope: !220, file: !43, line: 220, baseType: !117, size: 32, offset: 1024)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "currentop", scope: !220, file: !43, line: 221, baseType: !252, size: 64, offset: 1088)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!253 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOperator", file: !4, line: 190, size: 10496, elements: !254)
!254 = !{!255, !287, !288, !292, !295, !296, !298}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "slots_in", scope: !253, file: !4, line: 191, baseType: !256, size: 5120)
!256 = !DICompositeType(tag: DW_TAG_array_type, baseType: !257, size: 5120, elements: !285)
!257 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOpSlot", file: !4, line: 147, size: 320, elements: !258)
!258 = !{!259, !262, !264, !274, !275}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "slot_name", scope: !257, file: !4, line: 148, baseType: !260, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!261 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !119)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "slot_type", scope: !257, file: !4, line: 149, baseType: !263, size: 32, offset: 64)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotType", file: !4, line: 112, baseType: !3)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "slot_subtype", scope: !257, file: !4, line: 150, baseType: !265, size: 32, offset: 96)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Union", file: !4, line: 142, baseType: !266)
!266 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eBMOpSlotSubType_Union", file: !4, line: 138, size: 32, elements: !267)
!267 = !{!268, !270, !272}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !266, file: !4, line: 139, baseType: !269, size: 32)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Elem", file: !4, line: 122, baseType: !15)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !266, file: !4, line: 140, baseType: !271, size: 32)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Ptr", file: !4, line: 136, baseType: !21)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !266, file: !4, line: 141, baseType: !273, size: 32)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Map", file: !4, line: 130, baseType: !27)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !257, file: !4, line: 152, baseType: !117, size: 32, offset: 128)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !257, file: !4, line: 162, baseType: !276, size: 128, offset: 192)
!276 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !257, file: !4, line: 155, size: 128, elements: !277)
!277 = !{!278, !279, !280, !281, !282, !284}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !276, file: !4, line: 156, baseType: !117, size: 32)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !276, file: !4, line: 157, baseType: !97, size: 32)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !276, file: !4, line: 158, baseType: !96, size: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !276, file: !4, line: 159, baseType: !129, size: 96)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !276, file: !4, line: 160, baseType: !283, size: 64)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "ghash", scope: !276, file: !4, line: 161, baseType: !198, size: 64)
!285 = !{!286}
!286 = !DISubrange(count: 16)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "slots_out", scope: !253, file: !4, line: 192, baseType: !256, size: 5120, offset: 5120)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !253, file: !4, line: 193, baseType: !289, size: 64, offset: 10240)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64)
!290 = !DISubroutineType(types: !291)
!291 = !{null, !218, !252}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "arena", scope: !253, file: !4, line: 194, baseType: !293, size: 64, offset: 10304)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64)
!294 = !DICompositeType(tag: DW_TAG_structure_type, name: "MemArena", file: !4, line: 194, flags: DIFlagFwdDecl)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !253, file: !4, line: 195, baseType: !117, size: 32, offset: 10368)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "type_flag", scope: !253, file: !4, line: 196, baseType: !297, size: 32, offset: 10400)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMOpTypeFlag", file: !4, line: 188, baseType: !35)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !253, file: !4, line: 197, baseType: !117, size: 32, offset: 10432)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !220, file: !43, line: 223, baseType: !300, size: 1600, offset: 1152)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomData", file: !234, line: 73, baseType: !301)
!301 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomData", file: !234, line: 64, size: 1600, elements: !302)
!302 = !{!303, !321, !325, !326, !327, !328, !329}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !301, file: !234, line: 65, baseType: !304, size: 64)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataLayer", file: !234, line: 53, baseType: !306)
!306 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataLayer", file: !234, line: 42, size: 832, elements: !307)
!307 = !{!308, !309, !310, !311, !312, !313, !314, !315, !316, !320}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !306, file: !234, line: 43, baseType: !117, size: 32)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !306, file: !234, line: 44, baseType: !117, size: 32, offset: 32)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !306, file: !234, line: 45, baseType: !117, size: 32, offset: 64)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !306, file: !234, line: 46, baseType: !117, size: 32, offset: 96)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "active_rnd", scope: !306, file: !234, line: 47, baseType: !117, size: 32, offset: 128)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "active_clone", scope: !306, file: !234, line: 48, baseType: !117, size: 32, offset: 160)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "active_mask", scope: !306, file: !234, line: 49, baseType: !117, size: 32, offset: 192)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !306, file: !234, line: 50, baseType: !117, size: 32, offset: 224)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !306, file: !234, line: 51, baseType: !317, size: 512, offset: 256)
!317 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 512, elements: !318)
!318 = !{!319}
!319 = !DISubrange(count: 64)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !306, file: !234, line: 52, baseType: !96, size: 64, offset: 768)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "typemap", scope: !301, file: !234, line: 66, baseType: !322, size: 1312, offset: 64)
!322 = !DICompositeType(tag: DW_TAG_array_type, baseType: !117, size: 1312, elements: !323)
!323 = !{!324}
!324 = !DISubrange(count: 41)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "totlayer", scope: !301, file: !234, line: 69, baseType: !117, size: 32, offset: 1376)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "maxlayer", scope: !301, file: !234, line: 69, baseType: !117, size: 32, offset: 1408)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "totsize", scope: !301, file: !234, line: 70, baseType: !117, size: 32, offset: 1440)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !301, file: !234, line: 71, baseType: !232, size: 64, offset: 1472)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !301, file: !234, line: 72, baseType: !330, size: 64, offset: 1536)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataExternal", file: !234, line: 59, baseType: !332)
!332 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataExternal", file: !234, line: 57, size: 8192, elements: !333)
!333 = !{!334}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !332, file: !234, line: 58, baseType: !335, size: 8192)
!335 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 8192, elements: !336)
!336 = !{!337}
!337 = !DISubrange(count: 1024)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !220, file: !43, line: 223, baseType: !300, size: 1600, offset: 2752)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "ldata", scope: !220, file: !43, line: 223, baseType: !300, size: 1600, offset: 4352)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !220, file: !43, line: 223, baseType: !300, size: 1600, offset: 5952)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !220, file: !43, line: 233, baseType: !127, size: 16, offset: 7552)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !220, file: !43, line: 236, baseType: !117, size: 32, offset: 7584)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "walkers", scope: !220, file: !43, line: 238, baseType: !117, size: 32, offset: 7616)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "totflags", scope: !220, file: !43, line: 238, baseType: !117, size: 32, offset: 7648)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "selected", scope: !220, file: !43, line: 239, baseType: !346, size: 128, offset: 7680)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !181, line: 71, baseType: !347)
!347 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !181, line: 69, size: 128, elements: !348)
!348 = !{!349, !350}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !347, file: !181, line: 70, baseType: !96, size: 64)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !347, file: !181, line: 70, baseType: !96, size: 64, offset: 64)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "act_face", scope: !220, file: !43, line: 241, baseType: !174, size: 64, offset: 7808)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "errorstack", scope: !220, file: !43, line: 243, baseType: !346, size: 128, offset: 7872)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "py_handle", scope: !220, file: !43, line: 245, baseType: !96, size: 64, offset: 8000)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMOperator", file: !4, line: 198, baseType: !253)
!356 = !{}
!357 = !DILocalVariable(name: "bm", arg: 1, scope: !215, file: !1, line: 1068, type: !218)
!358 = !DILocation(line: 1068, column: 41, scope: !215)
!359 = !DILocalVariable(name: "op", arg: 2, scope: !215, file: !1, line: 1068, type: !354)
!360 = !DILocation(line: 1068, column: 57, scope: !215)
!361 = !DILocalVariable(name: "eloops_rim", scope: !215, file: !1, line: 1070, type: !346)
!362 = !DILocation(line: 1070, column: 11, scope: !215)
!363 = !DILocalVariable(name: "siter", scope: !215, file: !1, line: 1071, type: !364)
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMOIter", file: !4, line: 463, baseType: !365)
!365 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOIter", file: !4, line: 457, size: 448, elements: !366)
!366 = !{!367, !370, !371, !372, !373}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "slot", scope: !365, file: !4, line: 458, baseType: !368, size: 64)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMOpSlot", file: !4, line: 163, baseType: !257)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !365, file: !4, line: 459, baseType: !117, size: 32, offset: 64)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "giter", scope: !365, file: !4, line: 460, baseType: !193, size: 192, offset: 128)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !365, file: !4, line: 461, baseType: !283, size: 64, offset: 320)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "restrictmask", scope: !365, file: !4, line: 462, baseType: !119, size: 8, offset: 384)
!374 = !DILocation(line: 1071, column: 10, scope: !215)
!375 = !DILocalVariable(name: "e", scope: !215, file: !1, line: 1072, type: !172)
!376 = !DILocation(line: 1072, column: 10, scope: !215)
!377 = !DILocalVariable(name: "count", scope: !215, file: !1, line: 1073, type: !117)
!378 = !DILocation(line: 1073, column: 6, scope: !215)
!379 = !DILocalVariable(name: "changed", scope: !215, file: !1, line: 1074, type: !380)
!380 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!381 = !DILocation(line: 1074, column: 7, scope: !215)
!382 = !DILocalVariable(name: "cuts", scope: !215, file: !1, line: 1076, type: !383)
!383 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !117)
!384 = !DILocation(line: 1076, column: 12, scope: !215)
!385 = !DILocation(line: 1076, column: 36, scope: !215)
!386 = !DILocation(line: 1076, column: 40, scope: !215)
!387 = !DILocation(line: 1076, column: 19, scope: !215)
!388 = !DILocalVariable(name: "interp_mode", scope: !215, file: !1, line: 1077, type: !383)
!389 = !DILocation(line: 1077, column: 12, scope: !215)
!390 = !DILocation(line: 1077, column: 43, scope: !215)
!391 = !DILocation(line: 1077, column: 47, scope: !215)
!392 = !DILocation(line: 1077, column: 26, scope: !215)
!393 = !DILocalVariable(name: "smooth", scope: !215, file: !1, line: 1078, type: !394)
!394 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !97)
!395 = !DILocation(line: 1078, column: 14, scope: !215)
!396 = !DILocation(line: 1078, column: 42, scope: !215)
!397 = !DILocation(line: 1078, column: 46, scope: !215)
!398 = !DILocation(line: 1078, column: 23, scope: !215)
!399 = !DILocalVariable(name: "resolu", scope: !215, file: !1, line: 1079, type: !383)
!400 = !DILocation(line: 1079, column: 12, scope: !215)
!401 = !DILocation(line: 1079, column: 21, scope: !215)
!402 = !DILocation(line: 1079, column: 26, scope: !215)
!403 = !DILocalVariable(name: "profile_shape", scope: !215, file: !1, line: 1082, type: !383)
!404 = !DILocation(line: 1082, column: 12, scope: !215)
!405 = !DILocation(line: 1082, column: 45, scope: !215)
!406 = !DILocation(line: 1082, column: 49, scope: !215)
!407 = !DILocation(line: 1082, column: 28, scope: !215)
!408 = !DILocalVariable(name: "profile_shape_factor", scope: !215, file: !1, line: 1083, type: !394)
!409 = !DILocation(line: 1083, column: 14, scope: !215)
!410 = !DILocation(line: 1083, column: 56, scope: !215)
!411 = !DILocation(line: 1083, column: 60, scope: !215)
!412 = !DILocation(line: 1083, column: 37, scope: !215)
!413 = !DILocalVariable(name: "falloff_cache", scope: !215, file: !1, line: 1084, type: !191)
!414 = !DILocation(line: 1084, column: 9, scope: !215)
!415 = !DILocation(line: 1084, column: 26, scope: !215)
!416 = !DILocation(line: 1084, column: 47, scope: !215)
!417 = !DILocation(line: 1084, column: 25, scope: !215)
!418 = !DILocation(line: 1084, column: 58, scope: !215)
!419 = !DILocation(line: 1086, column: 30, scope: !215)
!420 = !DILocation(line: 1086, column: 34, scope: !215)
!421 = !DILocation(line: 1086, column: 38, scope: !215)
!422 = !DILocation(line: 1086, column: 2, scope: !215)
!423 = !DILocation(line: 1088, column: 33, scope: !215)
!424 = !DILocation(line: 1088, column: 2, scope: !215)
!425 = !DILocation(line: 1093, column: 2, scope: !426)
!426 = distinct !DILexicalBlock(scope: !215, file: !1, line: 1093, column: 2)
!427 = !DILocation(line: 1093, column: 2, scope: !428)
!428 = distinct !DILexicalBlock(scope: !426, file: !1, line: 1093, column: 2)
!429 = !DILocalVariable(name: "fiter", scope: !430, file: !1, line: 1094, type: !431)
!430 = distinct !DILexicalBlock(scope: !428, file: !1, line: 1093, column: 55)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter", file: !59, line: 186, baseType: !432)
!432 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter", file: !59, line: 164, size: 512, elements: !433)
!433 = !{!434, !514, !515, !516, !517}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !432, file: !59, line: 179, baseType: !435, size: 320)
!435 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !432, file: !59, line: 166, size: 320, elements: !436)
!436 = !{!437, !452, !458, !466, !474, !480, !486, !492, !496, !502, !508}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "elem_of_mesh", scope: !435, file: !59, line: 167, baseType: !438, size: 192)
!438 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__elem_of_mesh", file: !59, line: 113, size: 192, elements: !439)
!439 = !{!440}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "pooliter", scope: !438, file: !59, line: 114, baseType: !441, size: 192)
!441 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLI_mempool_iter", file: !442, line: 80, baseType: !443)
!442 = !DIFile(filename: "blender/source/blender/blenlib/BLI_mempool.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!443 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool_iter", file: !442, line: 76, size: 192, elements: !444)
!444 = !{!445, !448, !451}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !443, file: !442, line: 77, baseType: !446, size: 64)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!447 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLI_mempool", file: !442, line: 47, baseType: !233)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "curchunk", scope: !443, file: !442, line: 78, baseType: !449, size: 64, offset: 64)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!450 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool_chunk", file: !442, line: 45, flags: DIFlagFwdDecl)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "curindex", scope: !443, file: !442, line: 79, baseType: !5, size: 32, offset: 128)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "edge_of_vert", scope: !435, file: !59, line: 169, baseType: !453, size: 192)
!453 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__edge_of_vert", file: !59, line: 116, size: 192, elements: !454)
!454 = !{!455, !456, !457}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !453, file: !59, line: 117, baseType: !107, size: 64)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "e_first", scope: !453, file: !59, line: 118, baseType: !172, size: 64, offset: 64)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "e_next", scope: !453, file: !59, line: 118, baseType: !172, size: 64, offset: 128)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "face_of_vert", scope: !435, file: !59, line: 170, baseType: !459, size: 320)
!459 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__face_of_vert", file: !59, line: 120, size: 320, elements: !460)
!460 = !{!461, !462, !463, !464, !465}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !459, file: !59, line: 121, baseType: !107, size: 64)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !459, file: !59, line: 122, baseType: !156, size: 64, offset: 64)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !459, file: !59, line: 122, baseType: !156, size: 64, offset: 128)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "e_first", scope: !459, file: !59, line: 123, baseType: !172, size: 64, offset: 192)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "e_next", scope: !459, file: !59, line: 123, baseType: !172, size: 64, offset: 256)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_vert", scope: !435, file: !59, line: 171, baseType: !467, size: 320)
!467 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_vert", file: !59, line: 125, size: 320, elements: !468)
!468 = !{!469, !470, !471, !472, !473}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !467, file: !59, line: 126, baseType: !107, size: 64)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !467, file: !59, line: 127, baseType: !156, size: 64, offset: 64)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !467, file: !59, line: 127, baseType: !156, size: 64, offset: 128)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "e_first", scope: !467, file: !59, line: 128, baseType: !172, size: 64, offset: 192)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "e_next", scope: !467, file: !59, line: 128, baseType: !172, size: 64, offset: 256)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_edge", scope: !435, file: !59, line: 172, baseType: !475, size: 192)
!475 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_edge", file: !59, line: 130, size: 192, elements: !476)
!476 = !{!477, !478, !479}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !475, file: !59, line: 131, baseType: !172, size: 64)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !475, file: !59, line: 132, baseType: !156, size: 64, offset: 64)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !475, file: !59, line: 132, baseType: !156, size: 64, offset: 128)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_loop", scope: !435, file: !59, line: 173, baseType: !481, size: 192)
!481 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_loop", file: !59, line: 134, size: 192, elements: !482)
!482 = !{!483, !484, !485}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "ldata", scope: !481, file: !59, line: 135, baseType: !156, size: 64)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !481, file: !59, line: 136, baseType: !156, size: 64, offset: 64)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !481, file: !59, line: 136, baseType: !156, size: 64, offset: 128)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "face_of_edge", scope: !435, file: !59, line: 174, baseType: !487, size: 192)
!487 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__face_of_edge", file: !59, line: 138, size: 192, elements: !488)
!488 = !{!489, !490, !491}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !487, file: !59, line: 139, baseType: !172, size: 64)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !487, file: !59, line: 140, baseType: !156, size: 64, offset: 64)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !487, file: !59, line: 140, baseType: !156, size: 64, offset: 128)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "vert_of_edge", scope: !435, file: !59, line: 175, baseType: !493, size: 64)
!493 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__vert_of_edge", file: !59, line: 142, size: 64, elements: !494)
!494 = !{!495}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !493, file: !59, line: 143, baseType: !172, size: 64)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "vert_of_face", scope: !435, file: !59, line: 176, baseType: !497, size: 192)
!497 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__vert_of_face", file: !59, line: 145, size: 192, elements: !498)
!498 = !{!499, !500, !501}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !497, file: !59, line: 146, baseType: !174, size: 64)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !497, file: !59, line: 147, baseType: !156, size: 64, offset: 64)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !497, file: !59, line: 147, baseType: !156, size: 64, offset: 128)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "edge_of_face", scope: !435, file: !59, line: 177, baseType: !503, size: 192)
!503 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__edge_of_face", file: !59, line: 149, size: 192, elements: !504)
!504 = !{!505, !506, !507}
!505 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !503, file: !59, line: 150, baseType: !174, size: 64)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !503, file: !59, line: 151, baseType: !156, size: 64, offset: 64)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !503, file: !59, line: 151, baseType: !156, size: 64, offset: 128)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_face", scope: !435, file: !59, line: 178, baseType: !509, size: 192)
!509 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_face", file: !59, line: 153, size: 192, elements: !510)
!510 = !{!511, !512, !513}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !509, file: !59, line: 154, baseType: !174, size: 64)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !509, file: !59, line: 155, baseType: !156, size: 64, offset: 64)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !509, file: !59, line: 155, baseType: !156, size: 64, offset: 128)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "begin", scope: !432, file: !59, line: 181, baseType: !99, size: 64, offset: 320)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !432, file: !59, line: 182, baseType: !103, size: 64, offset: 384)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !432, file: !59, line: 184, baseType: !117, size: 32, offset: 448)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "itype", scope: !432, file: !59, line: 185, baseType: !119, size: 8, offset: 480)
!518 = !DILocation(line: 1094, column: 10, scope: !430)
!519 = !DILocalVariable(name: "f", scope: !430, file: !1, line: 1095, type: !174)
!520 = !DILocation(line: 1095, column: 11, scope: !430)
!521 = !DILocation(line: 1097, column: 3, scope: !522)
!522 = distinct !DILexicalBlock(scope: !430, file: !1, line: 1097, column: 3)
!523 = !DILocation(line: 1097, column: 3, scope: !524)
!524 = distinct !DILexicalBlock(scope: !522, file: !1, line: 1097, column: 3)
!525 = !DILocation(line: 1098, column: 9, scope: !526)
!526 = distinct !DILexicalBlock(scope: !527, file: !1, line: 1098, column: 8)
!527 = distinct !DILexicalBlock(scope: !524, file: !1, line: 1097, column: 49)
!528 = !DILocation(line: 1098, column: 8, scope: !527)
!529 = !DILocalVariable(name: "liter", scope: !530, file: !1, line: 1099, type: !431)
!530 = distinct !DILexicalBlock(scope: !526, file: !1, line: 1098, column: 46)
!531 = !DILocation(line: 1099, column: 12, scope: !530)
!532 = !DILocalVariable(name: "l", scope: !530, file: !1, line: 1100, type: !156)
!533 = !DILocation(line: 1100, column: 13, scope: !530)
!534 = !DILocalVariable(name: "ok", scope: !530, file: !1, line: 1101, type: !380)
!535 = !DILocation(line: 1101, column: 10, scope: !530)
!536 = !DILocation(line: 1104, column: 5, scope: !537)
!537 = distinct !DILexicalBlock(scope: !530, file: !1, line: 1104, column: 5)
!538 = !DILocation(line: 1104, column: 5, scope: !539)
!539 = distinct !DILexicalBlock(scope: !537, file: !1, line: 1104, column: 5)
!540 = !DILocation(line: 1105, column: 10, scope: !541)
!541 = distinct !DILexicalBlock(scope: !542, file: !1, line: 1105, column: 10)
!542 = distinct !DILexicalBlock(scope: !539, file: !1, line: 1104, column: 51)
!543 = !DILocation(line: 1105, column: 50, scope: !541)
!544 = !DILocation(line: 1105, column: 53, scope: !541)
!545 = !DILocation(line: 1105, column: 58, scope: !541)
!546 = !DILocation(line: 1105, column: 61, scope: !541)
!547 = !DILocation(line: 1105, column: 55, scope: !541)
!548 = !DILocation(line: 1105, column: 10, scope: !542)
!549 = !DILocation(line: 1106, column: 10, scope: !550)
!550 = distinct !DILexicalBlock(scope: !541, file: !1, line: 1105, column: 64)
!551 = !DILocation(line: 1107, column: 7, scope: !550)
!552 = !DILocation(line: 1109, column: 5, scope: !542)
!553 = distinct !{!553, !536, !554}
!554 = !DILocation(line: 1109, column: 5, scope: !537)
!555 = !DILocation(line: 1111, column: 9, scope: !556)
!556 = distinct !DILexicalBlock(scope: !530, file: !1, line: 1111, column: 9)
!557 = !DILocation(line: 1111, column: 9, scope: !530)
!558 = !DILocation(line: 1112, column: 6, scope: !559)
!559 = distinct !DILexicalBlock(scope: !556, file: !1, line: 1111, column: 13)
!560 = !DILocation(line: 1114, column: 6, scope: !561)
!561 = distinct !DILexicalBlock(scope: !559, file: !1, line: 1114, column: 6)
!562 = !DILocation(line: 1114, column: 6, scope: !563)
!563 = distinct !DILexicalBlock(scope: !561, file: !1, line: 1114, column: 6)
!564 = !DILocation(line: 1115, column: 12, scope: !565)
!565 = distinct !DILexicalBlock(scope: !566, file: !1, line: 1115, column: 11)
!566 = distinct !DILexicalBlock(scope: !563, file: !1, line: 1114, column: 52)
!567 = !DILocation(line: 1115, column: 11, scope: !566)
!568 = !DILocation(line: 1116, column: 8, scope: !569)
!569 = distinct !DILexicalBlock(scope: !565, file: !1, line: 1115, column: 53)
!570 = !DILocation(line: 1117, column: 7, scope: !569)
!571 = !DILocation(line: 1118, column: 6, scope: !566)
!572 = distinct !{!572, !560, !573}
!573 = !DILocation(line: 1118, column: 6, scope: !561)
!574 = !DILocation(line: 1119, column: 5, scope: !559)
!575 = !DILocation(line: 1120, column: 4, scope: !530)
!576 = !DILocation(line: 1121, column: 3, scope: !527)
!577 = distinct !{!577, !521, !578}
!578 = !DILocation(line: 1121, column: 3, scope: !522)
!579 = !DILocation(line: 1122, column: 2, scope: !430)
!580 = distinct !{!580, !425, !581}
!581 = !DILocation(line: 1122, column: 2, scope: !426)
!582 = !DILocation(line: 1128, column: 6, scope: !583)
!583 = distinct !DILexicalBlock(scope: !215, file: !1, line: 1128, column: 6)
!584 = !DILocation(line: 1128, column: 6, scope: !215)
!585 = !DILocalVariable(name: "i", scope: !586, file: !1, line: 1129, type: !117)
!586 = distinct !DILexicalBlock(scope: !583, file: !1, line: 1128, column: 21)
!587 = !DILocation(line: 1129, column: 7, scope: !586)
!588 = !DILocation(line: 1130, column: 10, scope: !589)
!589 = distinct !DILexicalBlock(scope: !586, file: !1, line: 1130, column: 3)
!590 = !DILocation(line: 1130, column: 8, scope: !589)
!591 = !DILocation(line: 1130, column: 15, scope: !592)
!592 = distinct !DILexicalBlock(scope: !589, file: !1, line: 1130, column: 3)
!593 = !DILocation(line: 1130, column: 19, scope: !592)
!594 = !DILocation(line: 1130, column: 17, scope: !592)
!595 = !DILocation(line: 1130, column: 3, scope: !589)
!596 = !DILocalVariable(name: "shape_size", scope: !597, file: !1, line: 1131, type: !97)
!597 = distinct !DILexicalBlock(scope: !592, file: !1, line: 1130, column: 32)
!598 = !DILocation(line: 1131, column: 10, scope: !597)
!599 = !DILocalVariable(name: "fac", scope: !597, file: !1, line: 1132, type: !97)
!600 = !DILocation(line: 1132, column: 10, scope: !597)
!601 = !DILocation(line: 1132, column: 23, scope: !597)
!602 = !DILocation(line: 1132, column: 16, scope: !597)
!603 = !DILocation(line: 1132, column: 35, scope: !597)
!604 = !DILocation(line: 1132, column: 42, scope: !597)
!605 = !DILocation(line: 1132, column: 27, scope: !597)
!606 = !DILocation(line: 1132, column: 25, scope: !597)
!607 = !DILocation(line: 1133, column: 43, scope: !597)
!608 = !DILocation(line: 1133, column: 41, scope: !597)
!609 = !DILocation(line: 1133, column: 30, scope: !597)
!610 = !DILocation(line: 1133, column: 28, scope: !597)
!611 = !DILocation(line: 1133, column: 21, scope: !597)
!612 = !DILocation(line: 1133, column: 10, scope: !597)
!613 = !DILocation(line: 1133, column: 8, scope: !597)
!614 = !DILocation(line: 1134, column: 34, scope: !597)
!615 = !DILocation(line: 1134, column: 49, scope: !597)
!616 = !DILocation(line: 1134, column: 10, scope: !597)
!617 = !DILocation(line: 1134, column: 8, scope: !597)
!618 = !DILocation(line: 1135, column: 18, scope: !597)
!619 = !DILocation(line: 1135, column: 24, scope: !597)
!620 = !DILocation(line: 1135, column: 22, scope: !597)
!621 = !DILocation(line: 1135, column: 15, scope: !597)
!622 = !DILocation(line: 1137, column: 23, scope: !597)
!623 = !DILocation(line: 1137, column: 4, scope: !597)
!624 = !DILocation(line: 1137, column: 18, scope: !597)
!625 = !DILocation(line: 1137, column: 21, scope: !597)
!626 = !DILocation(line: 1138, column: 3, scope: !597)
!627 = !DILocation(line: 1130, column: 28, scope: !592)
!628 = !DILocation(line: 1130, column: 3, scope: !592)
!629 = distinct !{!629, !595, !630}
!630 = !DILocation(line: 1138, column: 3, scope: !589)
!631 = !DILocation(line: 1139, column: 2, scope: !586)
!632 = !DILocation(line: 1145, column: 33, scope: !215)
!633 = !DILocation(line: 1145, column: 79, scope: !215)
!634 = !DILocation(line: 1145, column: 71, scope: !215)
!635 = !DILocation(line: 1145, column: 10, scope: !215)
!636 = !DILocation(line: 1145, column: 8, scope: !215)
!637 = !DILocation(line: 1147, column: 6, scope: !638)
!638 = distinct !DILexicalBlock(scope: !215, file: !1, line: 1147, column: 6)
!639 = !DILocation(line: 1147, column: 12, scope: !638)
!640 = !DILocation(line: 1147, column: 6, scope: !215)
!641 = !DILocation(line: 1148, column: 19, scope: !642)
!642 = distinct !DILexicalBlock(scope: !638, file: !1, line: 1147, column: 17)
!643 = !DILocation(line: 1148, column: 23, scope: !642)
!644 = !DILocation(line: 1148, column: 3, scope: !642)
!645 = !DILocation(line: 1150, column: 3, scope: !642)
!646 = !DILocation(line: 1152, column: 11, scope: !647)
!647 = distinct !DILexicalBlock(scope: !638, file: !1, line: 1152, column: 11)
!648 = !DILocation(line: 1152, column: 17, scope: !647)
!649 = !DILocation(line: 1152, column: 11, scope: !638)
!650 = !DILocalVariable(name: "el_store_a", scope: !651, file: !1, line: 1155, type: !188)
!651 = distinct !DILexicalBlock(scope: !647, file: !1, line: 1152, column: 23)
!652 = !DILocation(line: 1155, column: 27, scope: !651)
!653 = !DILocation(line: 1155, column: 51, scope: !651)
!654 = !DILocation(line: 1155, column: 40, scope: !651)
!655 = !DILocalVariable(name: "el_store_b", scope: !651, file: !1, line: 1156, type: !188)
!656 = !DILocation(line: 1156, column: 27, scope: !651)
!657 = !DILocation(line: 1156, column: 51, scope: !651)
!658 = !DILocation(line: 1156, column: 40, scope: !651)
!659 = !DILocalVariable(name: "lpair", scope: !651, file: !1, line: 1157, type: !660)
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 64)
!661 = !DIDerivedType(tag: DW_TAG_typedef, name: "LoopPairStore", file: !1, line: 446, baseType: !662)
!662 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LoopPairStore", file: !1, line: 437, size: 256, elements: !663)
!663 = !{!664, !666, !667, !668}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "nors_a", scope: !662, file: !1, line: 439, baseType: !665, size: 64)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "nors_b", scope: !662, file: !1, line: 440, baseType: !665, size: 64, offset: 64)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "nors_gh_a", scope: !662, file: !1, line: 444, baseType: !198, size: 64, offset: 128)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "nors_gh_b", scope: !662, file: !1, line: 445, baseType: !198, size: 64, offset: 192)
!669 = !DILocation(line: 1157, column: 18, scope: !651)
!670 = !DILocation(line: 1159, column: 37, scope: !671)
!671 = distinct !DILexicalBlock(scope: !651, file: !1, line: 1159, column: 7)
!672 = !DILocation(line: 1159, column: 41, scope: !671)
!673 = !DILocation(line: 1159, column: 53, scope: !671)
!674 = !DILocation(line: 1159, column: 7, scope: !671)
!675 = !DILocation(line: 1159, column: 7, scope: !651)
!676 = !DILocation(line: 1160, column: 42, scope: !677)
!677 = distinct !DILexicalBlock(scope: !671, file: !1, line: 1159, column: 66)
!678 = !DILocation(line: 1160, column: 46, scope: !677)
!679 = !DILocation(line: 1160, column: 58, scope: !677)
!680 = !DILocation(line: 1160, column: 70, scope: !677)
!681 = !DILocation(line: 1160, column: 12, scope: !677)
!682 = !DILocation(line: 1160, column: 10, scope: !677)
!683 = !DILocation(line: 1161, column: 3, scope: !677)
!684 = !DILocation(line: 1163, column: 10, scope: !685)
!685 = distinct !DILexicalBlock(scope: !671, file: !1, line: 1162, column: 8)
!686 = !DILocation(line: 1166, column: 7, scope: !687)
!687 = distinct !DILexicalBlock(scope: !651, file: !1, line: 1166, column: 7)
!688 = !DILocation(line: 1166, column: 7, scope: !651)
!689 = !DILocation(line: 1167, column: 30, scope: !690)
!690 = distinct !DILexicalBlock(scope: !687, file: !1, line: 1166, column: 14)
!691 = !DILocation(line: 1167, column: 34, scope: !690)
!692 = !DILocation(line: 1167, column: 41, scope: !690)
!693 = !DILocation(line: 1167, column: 53, scope: !690)
!694 = !DILocation(line: 1168, column: 30, scope: !690)
!695 = !DILocation(line: 1168, column: 43, scope: !690)
!696 = !DILocation(line: 1168, column: 49, scope: !690)
!697 = !DILocation(line: 1168, column: 57, scope: !690)
!698 = !DILocation(line: 1167, column: 4, scope: !690)
!699 = !DILocation(line: 1169, column: 32, scope: !690)
!700 = !DILocation(line: 1169, column: 39, scope: !690)
!701 = !DILocation(line: 1169, column: 4, scope: !690)
!702 = !DILocation(line: 1170, column: 12, scope: !690)
!703 = !DILocation(line: 1171, column: 3, scope: !690)
!704 = !DILocation(line: 1173, column: 20, scope: !705)
!705 = distinct !DILexicalBlock(scope: !687, file: !1, line: 1172, column: 8)
!706 = !DILocation(line: 1173, column: 24, scope: !705)
!707 = !DILocation(line: 1173, column: 4, scope: !705)
!708 = !DILocation(line: 1175, column: 4, scope: !705)
!709 = !DILocation(line: 1177, column: 2, scope: !651)
!710 = !DILocalVariable(name: "gs_iter", scope: !711, file: !1, line: 1179, type: !712)
!711 = distinct !DILexicalBlock(scope: !647, file: !1, line: 1178, column: 7)
!712 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSetIterator", file: !194, line: 189, baseType: !713)
!713 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GSetIterator", file: !194, line: 183, size: 192, elements: !714)
!714 = !{!715}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "_ghi", scope: !713, file: !194, line: 184, baseType: !193, size: 192)
!716 = !DILocation(line: 1179, column: 16, scope: !711)
!717 = !DILocalVariable(name: "i", scope: !711, file: !1, line: 1180, type: !117)
!718 = !DILocation(line: 1180, column: 7, scope: !711)
!719 = !DILocalVariable(name: "eloop_pairs_gs", scope: !711, file: !1, line: 1182, type: !720)
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !721, size: 64)
!721 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSet", file: !194, line: 176, baseType: !722)
!722 = !DICompositeType(tag: DW_TAG_structure_type, name: "GSet", file: !194, line: 176, flags: DIFlagFwdDecl)
!723 = !DILocation(line: 1182, column: 9, scope: !711)
!724 = !DILocation(line: 1182, column: 48, scope: !711)
!725 = !DILocation(line: 1182, column: 26, scope: !711)
!726 = !DILocalVariable(name: "lpair_arr", scope: !711, file: !1, line: 1183, type: !727)
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 64)
!728 = !DILocation(line: 1183, column: 19, scope: !711)
!729 = !DILocation(line: 1185, column: 7, scope: !730)
!730 = distinct !DILexicalBlock(scope: !711, file: !1, line: 1185, column: 7)
!731 = !DILocation(line: 1185, column: 22, scope: !730)
!732 = !DILocation(line: 1185, column: 7, scope: !711)
!733 = !DILocation(line: 1186, column: 20, scope: !734)
!734 = distinct !DILexicalBlock(scope: !730, file: !1, line: 1185, column: 31)
!735 = !DILocation(line: 1186, column: 24, scope: !734)
!736 = !DILocation(line: 1186, column: 4, scope: !734)
!737 = !DILocation(line: 1188, column: 4, scope: !734)
!738 = !DILocation(line: 1191, column: 15, scope: !711)
!739 = !DILocation(line: 1191, column: 13, scope: !711)
!740 = !DILocation(line: 1194, column: 3, scope: !741)
!741 = distinct !DILexicalBlock(scope: !711, file: !1, line: 1194, column: 3)
!742 = !DILocation(line: 1194, column: 3, scope: !743)
!743 = distinct !DILexicalBlock(scope: !741, file: !1, line: 1194, column: 3)
!744 = !DILocalVariable(name: "eloop_pair", scope: !745, file: !1, line: 1195, type: !746)
!745 = distinct !DILexicalBlock(scope: !743, file: !1, line: 1194, column: 48)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 64)
!747 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashPair", file: !194, line: 166, baseType: !748)
!748 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GHashPair", file: !194, line: 163, size: 128, elements: !749)
!749 = !{!750, !753}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !748, file: !194, line: 164, baseType: !751, size: 64)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64)
!752 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "second", scope: !748, file: !194, line: 165, baseType: !751, size: 64, offset: 64)
!754 = !DILocation(line: 1195, column: 15, scope: !745)
!755 = !DILocation(line: 1195, column: 28, scope: !745)
!756 = !DILocalVariable(name: "el_store_a", scope: !745, file: !1, line: 1196, type: !188)
!757 = !DILocation(line: 1196, column: 28, scope: !745)
!758 = !DILocation(line: 1196, column: 49, scope: !745)
!759 = !DILocation(line: 1196, column: 61, scope: !745)
!760 = !DILocation(line: 1196, column: 41, scope: !745)
!761 = !DILocalVariable(name: "el_store_b", scope: !745, file: !1, line: 1197, type: !188)
!762 = !DILocation(line: 1197, column: 28, scope: !745)
!763 = !DILocation(line: 1197, column: 49, scope: !745)
!764 = !DILocation(line: 1197, column: 61, scope: !745)
!765 = !DILocation(line: 1197, column: 41, scope: !745)
!766 = !DILocalVariable(name: "lpair", scope: !745, file: !1, line: 1198, type: !660)
!767 = !DILocation(line: 1198, column: 19, scope: !745)
!768 = !DILocation(line: 1200, column: 38, scope: !769)
!769 = distinct !DILexicalBlock(scope: !745, file: !1, line: 1200, column: 8)
!770 = !DILocation(line: 1200, column: 42, scope: !769)
!771 = !DILocation(line: 1200, column: 54, scope: !769)
!772 = !DILocation(line: 1200, column: 8, scope: !769)
!773 = !DILocation(line: 1200, column: 8, scope: !745)
!774 = !DILocation(line: 1201, column: 43, scope: !775)
!775 = distinct !DILexicalBlock(scope: !769, file: !1, line: 1200, column: 67)
!776 = !DILocation(line: 1201, column: 47, scope: !775)
!777 = !DILocation(line: 1201, column: 59, scope: !775)
!778 = !DILocation(line: 1201, column: 71, scope: !775)
!779 = !DILocation(line: 1201, column: 13, scope: !775)
!780 = !DILocation(line: 1201, column: 11, scope: !775)
!781 = !DILocation(line: 1202, column: 4, scope: !775)
!782 = !DILocation(line: 1204, column: 11, scope: !783)
!783 = distinct !DILexicalBlock(scope: !769, file: !1, line: 1203, column: 9)
!784 = !DILocation(line: 1206, column: 19, scope: !745)
!785 = !DILocation(line: 1206, column: 4, scope: !745)
!786 = !DILocation(line: 1206, column: 14, scope: !745)
!787 = !DILocation(line: 1206, column: 17, scope: !745)
!788 = !DILocation(line: 1209, column: 3, scope: !745)
!789 = distinct !{!789, !740, !790}
!790 = !DILocation(line: 1209, column: 3, scope: !741)
!791 = !DILocation(line: 1211, column: 3, scope: !792)
!792 = distinct !DILexicalBlock(scope: !711, file: !1, line: 1211, column: 3)
!793 = !DILocation(line: 1211, column: 3, scope: !794)
!794 = distinct !DILexicalBlock(scope: !792, file: !1, line: 1211, column: 3)
!795 = !DILocalVariable(name: "eloop_pair", scope: !796, file: !1, line: 1212, type: !746)
!796 = distinct !DILexicalBlock(scope: !794, file: !1, line: 1211, column: 48)
!797 = !DILocation(line: 1212, column: 15, scope: !796)
!798 = !DILocation(line: 1212, column: 28, scope: !796)
!799 = !DILocalVariable(name: "el_store_a", scope: !796, file: !1, line: 1213, type: !188)
!800 = !DILocation(line: 1213, column: 28, scope: !796)
!801 = !DILocation(line: 1213, column: 49, scope: !796)
!802 = !DILocation(line: 1213, column: 61, scope: !796)
!803 = !DILocation(line: 1213, column: 41, scope: !796)
!804 = !DILocalVariable(name: "el_store_b", scope: !796, file: !1, line: 1214, type: !188)
!805 = !DILocation(line: 1214, column: 28, scope: !796)
!806 = !DILocation(line: 1214, column: 49, scope: !796)
!807 = !DILocation(line: 1214, column: 61, scope: !796)
!808 = !DILocation(line: 1214, column: 41, scope: !796)
!809 = !DILocalVariable(name: "lpair", scope: !796, file: !1, line: 1215, type: !660)
!810 = !DILocation(line: 1215, column: 19, scope: !796)
!811 = !DILocation(line: 1215, column: 27, scope: !796)
!812 = !DILocation(line: 1215, column: 37, scope: !796)
!813 = !DILocation(line: 1217, column: 8, scope: !814)
!814 = distinct !DILexicalBlock(scope: !796, file: !1, line: 1217, column: 8)
!815 = !DILocation(line: 1217, column: 8, scope: !796)
!816 = !DILocation(line: 1218, column: 31, scope: !817)
