; ModuleID = 'blender/source/blender/editors/animation/anim_markers.c'
source_filename = "blender/source/blender/editors/animation/anim_markers.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.UserDef = type { i32, i32, i32, i32, i32, [768 x i8], [768 x i8], [1024 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [1024 x i8], [1024 x i8], i32, i16, i16, i16, i16, i16, i16, i32, i32, i32, i16, i16, i32, i32, i32, i32, i32, i32, i32, i16, i16, i16, i16, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, [64 x i8], i16, i16, i16, i16, i16, i16, i16, i16, [3 x %struct.SolidLight], i16, i16, i16, i16, i16, i16, i16, i16, i32, i32, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i8, i8, i8, i8, i16, i16, i16, i16, i16, i16, float, float, i32, i16, i16, float, i16, i16, i16, i16, %struct.ColorBand, [3 x float], [4 x float], i16, i8, i8, [80 x i8], [1024 x i8], i32, i32, float, float, i32, i16, i16, i16, i16, i16, i16, %struct.WalkNavigation }
%struct.ListBase = type { i8*, i8* }
%struct.SolidLight = type { i32, i32, [4 x float], [4 x float], [4 x float] }
%struct.ColorBand = type { i16, i16, i8, i8, i8, [1 x i8], [32 x %struct.CBData] }
%struct.CBData = type { float, float, float, float, float, i32 }
%struct.WalkNavigation = type { float, float, float, float, float, float, i16, [3 x i16] }

!1363 = !{!1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378}
!1364 = !DIEnumerator(name: "SIPO_NOTRANSKEYCULL", value: 2, isUnsigned: true)
!1365 = !DIEnumerator(name: "SIPO_NOHANDLES", value: 4, isUnsigned: true)
!1366 = !DIEnumerator(name: "SIPO_NODRAWCFRANUM", value: 8, isUnsigned: true)
!1367 = !DIEnumerator(name: "SIPO_DRAWTIME", value: 16, isUnsigned: true)
!1368 = !DIEnumerator(name: "SIPO_SELCUVERTSONLY", value: 32, isUnsigned: true)
!1369 = !DIEnumerator(name: "SIPO_DRAWNAMES", value: 64, isUnsigned: true)
!1370 = !DIEnumerator(name: "SIPO_SLIDERS", value: 128, isUnsigned: true)
!1371 = !DIEnumerator(name: "SIPO_NODRAWCURSOR", value: 256, isUnsigned: true)
!1372 = !DIEnumerator(name: "SIPO_SELVHANDLESONLY", value: 512, isUnsigned: true)
!1373 = !DIEnumerator(name: "SIPO_TEMP_NEEDCHANSYNC", value: 1024, isUnsigned: true)
!1374 = !DIEnumerator(name: "SIPO_NOREALTIMEUPDATES", value: 2048, isUnsigned: true)
!1375 = !DIEnumerator(name: "SIPO_BEAUTYDRAW_OFF", value: 4096, isUnsigned: true)
!1376 = !DIEnumerator(name: "SIPO_NODRAWGCOLORS", value: 8192, isUnsigned: true)
!1377 = !DIEnumerator(name: "SIPO_NORMALIZE", value: 16384, isUnsigned: true)
!1378 = !DIEnumerator(name: "SIPO_NORMALIZE_FREEZE", value: 32768, isUnsigned: true)
!1379 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eSpaceNla_Flag", file: !212, line: 402, baseType: !5, size: 32, elements: !1380)
!1380 = !{!1381, !1382, !1383, !1384}
!1381 = !DIEnumerator(name: "SNLA_DRAWTIME", value: 4, isUnsigned: true)
!1382 = !DIEnumerator(name: "SNLA_NODRAWCFRANUM", value: 16, isUnsigned: true)
!1383 = !DIEnumerator(name: "SNLA_NOSTRIPCURVES", value: 32, isUnsigned: true)
!1384 = !DIEnumerator(name: "SNLA_NOREALTIMEUPDATES", value: 64, isUnsigned: true)
!1385 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PropertyFlag", file: !1386, line: 151, baseType: !5, size: 32, elements: !1387)
!1386 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1387 = !{!1388, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1406, !1407, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1416, !1417, !1418}
!1388 = !DIEnumerator(name: "PROP_EDITABLE", value: 1, isUnsigned: true)
!1389 = !DIEnumerator(name: "PROP_LIB_EXCEPTION", value: 65536, isUnsigned: true)
!1390 = !DIEnumerator(name: "PROP_ANIMATABLE", value: 2, isUnsigned: true)
!1391 = !DIEnumerator(name: "PROP_ICONS_CONSECUTIVE", value: 4096, isUnsigned: true)
!1392 = !DIEnumerator(name: "PROP_HIDDEN", value: 524288, isUnsigned: true)
!1393 = !DIEnumerator(name: "PROP_SKIP_SAVE", value: 268435456, isUnsigned: true)
!1394 = !DIEnumerator(name: "PROP_REQUIRED", value: 4, isUnsigned: true)
!1395 = !DIEnumerator(name: "PROP_OUTPUT", value: 8, isUnsigned: true)
!1396 = !DIEnumerator(name: "PROP_RNAPTR", value: 2048, isUnsigned: true)
!1397 = !DIEnumerator(name: "PROP_PYFUNC_OPTIONAL", value: 1073741824, isUnsigned: true)
!1398 = !DIEnumerator(name: "PROP_REGISTER", value: 16, isUnsigned: true)
!1399 = !DIEnumerator(name: "PROP_REGISTER_OPTIONAL", value: 48, isUnsigned: true)
!1400 = !DIEnumerator(name: "PROP_PROPORTIONAL", value: 67108864, isUnsigned: true)
!1401 = !DIEnumerator(name: "PROP_ID_REFCOUNT", value: 64, isUnsigned: true)
!1402 = !DIEnumerator(name: "PROP_ID_SELF_CHECK", value: 1048576, isUnsigned: true)
!1403 = !DIEnumerator(name: "PROP_NEVER_NULL", value: 262144, isUnsigned: true)
!1404 = !DIEnumerator(name: "PROP_NEVER_UNLINK", value: 33554432, isUnsigned: true)
!1405 = !DIEnumerator(name: "PROP_ENUM_FLAG", value: 2097152, isUnsigned: true)
!1406 = !DIEnumerator(name: "PROP_CONTEXT_UPDATE", value: 4194304, isUnsigned: true)
!1407 = !DIEnumerator(name: "PROP_CONTEXT_PROPERTY_UPDATE", value: 138412032, isUnsigned: true)
!1408 = !DIEnumerator(name: "PROP_THICK_WRAP", value: 8388608, isUnsigned: true)
!1409 = !DIEnumerator(name: "PROP_BUILTIN", value: 128, isUnsigned: true)
!1410 = !DIEnumerator(name: "PROP_EXPORT", value: 256, isUnsigned: true)
!1411 = !DIEnumerator(name: "PROP_RUNTIME", value: 512, isUnsigned: true)
!1412 = !DIEnumerator(name: "PROP_IDPROPERTY", value: 1024, isUnsigned: true)
!1413 = !DIEnumerator(name: "PROP_RAW_ACCESS", value: 8192, isUnsigned: true)
!1414 = !DIEnumerator(name: "PROP_RAW_ARRAY", value: 16384, isUnsigned: true)
!1415 = !DIEnumerator(name: "PROP_FREE_POINTERS", value: 32768, isUnsigned: true)
!1416 = !DIEnumerator(name: "PROP_DYNAMIC", value: 131072, isUnsigned: true)
!1417 = !DIEnumerator(name: "PROP_ENUM_NO_CONTEXT", value: 16777216, isUnsigned: true)
!1418 = !DIEnumerator(name: "PROP_ENUM_NO_TRANSLATE", value: 536870912, isUnsigned: true)
!1419 = !{!1420, !1421, !1422, !1440, !3163, !3178, !3211, !3230, !3086}
!1420 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!1421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!1422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1423, size: 64)
!1423 = !DIDerivedType(tag: DW_TAG_typedef, name: "SpaceAction", file: !237, line: 605, baseType: !1424)
!1424 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceAction", file: !237, line: 589, size: 2752, elements: !1425)
!1425 = !{!1426, !1447, !1448, !1449, !1450, !1451, !1452, !3144, !3147, !3159, !3160, !3161, !3162}
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1424, file: !237, line: 590, baseType: !1427, size: 64)
!1427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1428, size: 64)
!1428 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceLink", file: !212, line: 85, size: 448, elements: !1429)
!1429 = !{!1430, !1431, !1432, !1439, !1441, !1442}
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1428, file: !212, line: 86, baseType: !1427, size: 64)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1428, file: !212, line: 86, baseType: !1427, size: 64, offset: 64)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !1428, file: !212, line: 87, baseType: !1433, size: 128, offset: 128)
!1433 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !1434, line: 71, baseType: !1435)
!1434 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1435 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !1434, line: 69, size: 128, elements: !1436)
!1436 = !{!1437, !1438}
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !1435, file: !1434, line: 70, baseType: !1421, size: 64)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !1435, file: !1434, line: 70, baseType: !1421, size: 64, offset: 64)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "spacetype", scope: !1428, file: !212, line: 88, baseType: !1440, size: 32, offset: 256)
!1440 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "blockscale", scope: !1428, file: !212, line: 89, baseType: !1420, size: 32, offset: 288)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "blockhandler", scope: !1428, file: !212, line: 90, baseType: !1443, size: 128, offset: 320)
!1443 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1444, size: 128, elements: !1445)
!1444 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!1445 = !{!1446}
!1446 = !DISubrange(count: 8)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1424, file: !237, line: 590, baseType: !1427, size: 64, offset: 64)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !1424, file: !237, line: 591, baseType: !1433, size: 128, offset: 128)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "spacetype", scope: !1424, file: !237, line: 592, baseType: !1440, size: 32, offset: 256)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "blockscale", scope: !1424, file: !237, line: 593, baseType: !1420, size: 32, offset: 288)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "blockhandler", scope: !1424, file: !237, line: 595, baseType: !1443, size: 128, offset: 320)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "v2d", scope: !1424, file: !237, line: 597, baseType: !1453, size: 1280, offset: 448)
!1453 = !DIDerivedType(tag: DW_TAG_typedef, name: "View2D", file: !1454, line: 71, baseType: !1455)
!1454 = !DIFile(filename: "blender/source/blender/makesdna/DNA_view2d_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1455 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "View2D", file: !1454, line: 40, size: 1280, elements: !1456)
!1456 = !{!1457, !1466, !1467, !1475, !1476, !1477, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1498, !1499, !1500, !1503}
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !1455, file: !1454, line: 41, baseType: !1458, size: 128)
!1458 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !1459, line: 95, baseType: !1460)
!1459 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1460 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !1459, line: 92, size: 128, elements: !1461)
!1461 = !{!1462, !1463, !1464, !1465}
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !1460, file: !1459, line: 93, baseType: !1420, size: 32)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !1460, file: !1459, line: 93, baseType: !1420, size: 32, offset: 32)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !1460, file: !1459, line: 94, baseType: !1420, size: 32, offset: 64)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !1460, file: !1459, line: 94, baseType: !1420, size: 32, offset: 96)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !1455, file: !1454, line: 41, baseType: !1458, size: 128, offset: 128)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "vert", scope: !1455, file: !1454, line: 42, baseType: !1468, size: 128, offset: 256)
!1468 = !DIDerivedType(tag: DW_TAG_typedef, name: "rcti", file: !1459, line: 89, baseType: !1469)
!1469 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rcti", file: !1459, line: 86, size: 128, elements: !1470)
!1470 = !{!1471, !1472, !1473, !1474}
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !1469, file: !1459, line: 87, baseType: !1440, size: 32)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !1469, file: !1459, line: 87, baseType: !1440, size: 32, offset: 32)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !1469, file: !1459, line: 88, baseType: !1440, size: 32, offset: 64)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !1469, file: !1459, line: 88, baseType: !1440, size: 32, offset: 96)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "hor", scope: !1455, file: !1454, line: 42, baseType: !1468, size: 128, offset: 384)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !1455, file: !1454, line: 43, baseType: !1468, size: 128, offset: 512)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !1455, file: !1454, line: 45, baseType: !1478, size: 64, offset: 640)
!1478 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1420, size: 64, elements: !1479)
!1479 = !{!1480}
!1480 = !DISubrange(count: 2)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !1455, file: !1454, line: 45, baseType: !1478, size: 64, offset: 704)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "minzoom", scope: !1455, file: !1454, line: 46, baseType: !1420, size: 32, offset: 768)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "maxzoom", scope: !1455, file: !1454, line: 46, baseType: !1420, size: 32, offset: 800)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "scroll", scope: !1455, file: !1454, line: 48, baseType: !1444, size: 16, offset: 832)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "scroll_ui", scope: !1455, file: !1454, line: 49, baseType: !1444, size: 16, offset: 848)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "keeptot", scope: !1455, file: !1454, line: 51, baseType: !1444, size: 16, offset: 864)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "keepzoom", scope: !1455, file: !1454, line: 52, baseType: !1444, size: 16, offset: 880)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "keepofs", scope: !1455, file: !1454, line: 53, baseType: !1444, size: 16, offset: 896)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1455, file: !1454, line: 55, baseType: !1444, size: 16, offset: 912)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1455, file: !1454, line: 56, baseType: !1444, size: 16, offset: 928)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "winx", scope: !1455, file: !1454, line: 58, baseType: !1444, size: 16, offset: 944)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "winy", scope: !1455, file: !1454, line: 58, baseType: !1444, size: 16, offset: 960)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "oldwinx", scope: !1455, file: !1454, line: 59, baseType: !1444, size: 16, offset: 976)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "oldwiny", scope: !1455, file: !1454, line: 59, baseType: !1444, size: 16, offset: 992)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "around", scope: !1455, file: !1454, line: 61, baseType: !1444, size: 16, offset: 1008)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "tab_offset", scope: !1455, file: !1454, line: 63, baseType: !1497, size: 64, offset: 1024)
!1497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1420, size: 64)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "tab_num", scope: !1455, file: !1454, line: 64, baseType: !1440, size: 32, offset: 1088)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "tab_cur", scope: !1455, file: !1454, line: 65, baseType: !1440, size: 32, offset: 1120)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "sms", scope: !1455, file: !1454, line: 68, baseType: !1501, size: 64, offset: 1152)
!1501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1502, size: 64)
!1502 = !DICompositeType(tag: DW_TAG_structure_type, name: "SmoothView2DStore", file: !1454, line: 68, flags: DIFlagFwdDecl)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "smooth_timer", scope: !1455, file: !1454, line: 69, baseType: !1504, size: 64, offset: 1216)
!1504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1505, size: 64)
!1505 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTimer", file: !1506, line: 490, size: 768, elements: !1507)
!1506 = !DIFile(filename: "blender/source/blender/windowmanager/WM_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1507 = !{!1508, !1509, !1510, !3135, !3136, !3137, !3138, !3139, !3140, !3141, !3142, !3143}
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1505, file: !1506, line: 491, baseType: !1504, size: 64)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1505, file: !1506, line: 491, baseType: !1504, size: 64, offset: 64)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "win", scope: !1505, file: !1506, line: 493, baseType: !1511, size: 64, offset: 128)
!1511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1512, size: 64)
!1512 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindow", file: !1308, line: 169, size: 2048, elements: !1513)
!1513 = !{!1514, !1515, !1516, !1517, !3050, !3051, !3052, !3053, !3054, !3055, !3056, !3057, !3058, !3059, !3060, !3061, !3062, !3063, !3064, !3065, !3066, !3067, !3110, !3113, !3127, !3128, !3129, !3130, !3131, !3132, !3133, !3134}
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1512, file: !1308, line: 170, baseType: !1511, size: 64)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1512, file: !1308, line: 170, baseType: !1511, size: 64, offset: 64)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "ghostwin", scope: !1512, file: !1308, line: 172, baseType: !1421, size: 64, offset: 128)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !1512, file: !1308, line: 174, baseType: !1518, size: 64, offset: 192)
!1518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1519, size: 64)
!1519 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !1520, line: 49, size: 1984, elements: !1521)
!1520 = !DIFile(filename: "blender/source/blender/makesdna/DNA_screen_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1521 = !{!1522, !1585, !1586, !1587, !1588, !1589, !3033, !3034, !3035, !3036, !3037, !3038, !3039, !3040, !3041, !3042, !3043, !3044, !3045, !3046, !3047, !3048, !3049}
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1519, file: !1520, line: 50, baseType: !1523, size: 960)
!1523 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !1524, line: 130, baseType: !1525)
!1524 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1525 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !1524, line: 117, size: 960, elements: !1526)
!1526 = !{!1527, !1528, !1529, !1531, !1551, !1555, !1556, !1557, !1558, !1559}
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1525, file: !1524, line: 118, baseType: !1421, size: 64)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1525, file: !1524, line: 118, baseType: !1421, size: 64, offset: 64)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !1525, file: !1524, line: 119, baseType: !1530, size: 64, offset: 128)
!1530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1525, size: 64)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !1525, file: !1524, line: 120, baseType: !1532, size: 64, offset: 192)
!1532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1533, size: 64)
!1533 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !1524, line: 136, size: 17600, elements: !1534)
!1534 = !{!1535, !1536, !1538, !1541, !1546, !1547, !1548}
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1533, file: !1524, line: 137, baseType: !1523, size: 960)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !1533, file: !1524, line: 138, baseType: !1537, size: 64, offset: 960)
!1537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1523, size: 64)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !1533, file: !1524, line: 139, baseType: !1539, size: 64, offset: 1024)
!1539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1540, size: 64)
!1540 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !1524, line: 43, flags: DIFlagFwdDecl)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1533, file: !1524, line: 140, baseType: !1542, size: 8192, offset: 1088)
!1542 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1543, size: 8192, elements: !1544)
!1543 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!1544 = !{!1545}
!1545 = !DISubrange(count: 1024)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !1533, file: !1524, line: 141, baseType: !1542, size: 8192, offset: 9280)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !1533, file: !1524, line: 148, baseType: !1532, size: 64, offset: 17472)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !1533, file: !1524, line: 150, baseType: !1549, size: 64, offset: 17536)
!1549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1550, size: 64)
!1550 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !1524, line: 45, flags: DIFlagFwdDecl)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1525, file: !1524, line: 121, baseType: !1552, size: 528, offset: 256)
!1552 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1543, size: 528, elements: !1553)
!1553 = !{!1554}
!1554 = !DISubrange(count: 66)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1525, file: !1524, line: 126, baseType: !1444, size: 16, offset: 784)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !1525, file: !1524, line: 127, baseType: !1440, size: 32, offset: 800)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !1525, file: !1524, line: 128, baseType: !1440, size: 32, offset: 832)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1525, file: !1524, line: 128, baseType: !1440, size: 32, offset: 864)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !1525, file: !1524, line: 129, baseType: !1560, size: 64, offset: 896)
!1560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1561, size: 64)
!1561 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !1524, line: 75, baseType: !1562)
!1562 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !1524, line: 62, size: 1024, elements: !1563)
!1563 = !{!1564, !1566, !1567, !1568, !1569, !1570, !1574, !1575, !1583, !1584}
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1562, file: !1524, line: 63, baseType: !1565, size: 64)
!1565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1562, size: 64)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1562, file: !1524, line: 63, baseType: !1565, size: 64, offset: 64)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1562, file: !1524, line: 64, baseType: !1543, size: 8, offset: 128)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !1562, file: !1524, line: 64, baseType: !1543, size: 8, offset: 136)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1562, file: !1524, line: 65, baseType: !1444, size: 16, offset: 144)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1562, file: !1524, line: 66, baseType: !1571, size: 512, offset: 160)
!1571 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1543, size: 512, elements: !1572)
!1572 = !{!1573}
!1573 = !DISubrange(count: 64)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !1562, file: !1524, line: 67, baseType: !1440, size: 32, offset: 672)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1562, file: !1524, line: 69, baseType: !1576, size: 256, offset: 704)
!1576 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !1524, line: 60, baseType: !1577)
!1577 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !1524, line: 48, size: 256, elements: !1578)
!1578 = !{!1579, !1580, !1581, !1582}
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !1577, file: !1524, line: 49, baseType: !1421, size: 64)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !1577, file: !1524, line: 58, baseType: !1433, size: 128, offset: 64)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1577, file: !1524, line: 59, baseType: !1440, size: 32, offset: 192)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !1577, file: !1524, line: 59, baseType: !1440, size: 32, offset: 224)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1562, file: !1524, line: 70, baseType: !1440, size: 32, offset: 960)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !1562, file: !1524, line: 74, baseType: !1440, size: 32, offset: 992)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "vertbase", scope: !1519, file: !1520, line: 52, baseType: !1433, size: 128, offset: 960)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "edgebase", scope: !1519, file: !1520, line: 53, baseType: !1433, size: 128, offset: 1088)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "areabase", scope: !1519, file: !1520, line: 54, baseType: !1433, size: 128, offset: 1216)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !1519, file: !1520, line: 55, baseType: !1433, size: 128, offset: 1344)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !1519, file: !1520, line: 57, baseType: !1590, size: 64, offset: 1472)
!1590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1591, size: 64)
!1591 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !1592, line: 1216, size: 39680, elements: !1593)
!1592 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1593 = !{!1594, !1595, !1598, !1885, !1888, !1889, !1890, !1902, !1903, !1904, !1905, !1906, !1907, !1908, !1909, !1910, !1911, !1912, !1916, !1982, !2409, !2624, !2627, !2908, !2920, !2921, !2922, !2923, !2924, !2925, !2926, !2927, !2930, !2931, !2932, !2933, !2934, !2942, !3009, !3016, !3017, !3024, !3025, !3026, !3027, !3028, !3029, !3030}
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1591, file: !1592, line: 1217, baseType: !1523, size: 960)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1591, file: !1592, line: 1218, baseType: !1596, size: 64, offset: 960)
!1596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1597, size: 64)
!1597 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !1592, line: 58, flags: DIFlagFwdDecl)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !1591, file: !1592, line: 1220, baseType: !1599, size: 64, offset: 1024)
!1599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1600, size: 64)
!1600 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !1302, line: 115, size: 11392, elements: !1601)
!1601 = !{!1602, !1603, !1604, !1607, !1608, !1609, !1610, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1618, !1622, !1632, !1645, !1646, !1689, !1690, !1693, !1694, !1710, !1711, !1712, !1713, !1714, !1715, !1716, !1720, !1722, !1723, !1724, !1725, !1726, !1727, !1728, !1729, !1730, !1731, !1732, !1736, !1737, !1738, !1739, !1740, !1741, !1744, !1745, !1746, !1747, !1748, !1749, !1750, !1751, !1752, !1753, !1754, !1755, !1756, !1757, !1758, !1759, !1760, !1761, !1762, !1763, !1764, !1765, !1766, !1767, !1768, !1769, !1770, !1771, !1772, !1773, !1774, !1775, !1776, !1777, !1779, !1780, !1781, !1782, !1783, !1784, !1785, !1786, !1787, !1788, !1789, !1790, !1791, !1792, !1793, !1794, !1795, !1796, !1797, !1798, !1801, !1802, !1803, !1804, !1805, !1806, !1807, !1808, !1809, !1812, !1815, !1819, !1820, !1821, !1822, !1823, !1826, !1829, !1832, !1833, !1839, !1840, !1841, !1842, !1843, !1844, !1846, !1849, !1852, !1853, !1873, !1874}
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1600, file: !1302, line: 116, baseType: !1523, size: 960)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1600, file: !1302, line: 117, baseType: !1596, size: 64, offset: 960)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !1600, file: !1302, line: 119, baseType: !1605, size: 64, offset: 1024)
!1605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1606, size: 64)
!1606 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !1302, line: 57, flags: DIFlagFwdDecl)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1600, file: !1302, line: 121, baseType: !1444, size: 16, offset: 1088)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !1600, file: !1302, line: 121, baseType: !1444, size: 16, offset: 1104)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !1600, file: !1302, line: 122, baseType: !1440, size: 32, offset: 1120)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !1600, file: !1302, line: 122, baseType: !1440, size: 32, offset: 1152)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !1600, file: !1302, line: 122, baseType: !1440, size: 32, offset: 1184)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !1600, file: !1302, line: 123, baseType: !1571, size: 512, offset: 1216)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !1600, file: !1302, line: 124, baseType: !1599, size: 64, offset: 1728)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !1600, file: !1302, line: 124, baseType: !1599, size: 64, offset: 1792)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !1600, file: !1302, line: 127, baseType: !1599, size: 64, offset: 1856)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !1600, file: !1302, line: 127, baseType: !1599, size: 64, offset: 1920)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !1600, file: !1302, line: 127, baseType: !1599, size: 64, offset: 1984)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !1600, file: !1302, line: 128, baseType: !1619, size: 64, offset: 2048)
!1619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1620, size: 64)
!1620 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !1621, line: 46, flags: DIFlagFwdDecl)
!1621 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !1600, file: !1302, line: 130, baseType: !1623, size: 64, offset: 2112)
!1623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1624, size: 64)
!1624 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !1302, line: 97, size: 832, elements: !1625)
!1625 = !{!1626, !1630, !1631}
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1624, file: !1302, line: 98, baseType: !1627, size: 768)
!1627 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1420, size: 768, elements: !1628)
!1628 = !{!1446, !1629}
!1629 = !DISubrange(count: 3)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1624, file: !1302, line: 99, baseType: !1440, size: 32, offset: 768)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1624, file: !1302, line: 99, baseType: !1440, size: 32, offset: 800)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !1600, file: !1302, line: 131, baseType: !1633, size: 64, offset: 2176)
!1633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1634, size: 64)
!1634 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !237, line: 486, size: 1600, elements: !1635)
!1635 = !{!1636, !1637, !1638, !1639, !1640, !1641, !1642, !1643, !1644}
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1634, file: !237, line: 487, baseType: !1523, size: 960)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !1634, file: !237, line: 489, baseType: !1433, size: 128, offset: 960)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !1634, file: !237, line: 490, baseType: !1433, size: 128, offset: 1088)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !1634, file: !237, line: 491, baseType: !1433, size: 128, offset: 1216)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !1634, file: !237, line: 492, baseType: !1433, size: 128, offset: 1344)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1634, file: !237, line: 494, baseType: !1440, size: 32, offset: 1472)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !1634, file: !237, line: 495, baseType: !1440, size: 32, offset: 1504)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !1634, file: !237, line: 497, baseType: !1440, size: 32, offset: 1536)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1634, file: !237, line: 498, baseType: !1440, size: 32, offset: 1568)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !1600, file: !1302, line: 132, baseType: !1633, size: 64, offset: 2240)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !1600, file: !1302, line: 133, baseType: !1647, size: 64, offset: 2304)
!1647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1648, size: 64)
!1648 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !237, line: 334, size: 1728, elements: !1649)
!1649 = !{!1650, !1651, !1654, !1655, !1656, !1657, !1658, !1659, !1662, !1663, !1664, !1665, !1666, !1667, !1668, !1688}
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !1648, file: !237, line: 335, baseType: !1433, size: 128)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !1648, file: !237, line: 336, baseType: !1652, size: 64, offset: 128)
!1652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1653, size: 64)
!1653 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !237, line: 47, flags: DIFlagFwdDecl)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1648, file: !237, line: 338, baseType: !1444, size: 16, offset: 192)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1648, file: !237, line: 338, baseType: !1444, size: 16, offset: 208)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !1648, file: !237, line: 339, baseType: !5, size: 32, offset: 224)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !1648, file: !237, line: 340, baseType: !1440, size: 32, offset: 256)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !1648, file: !237, line: 342, baseType: !1420, size: 32, offset: 288)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !1648, file: !237, line: 343, baseType: !1660, size: 96, offset: 320)
!1660 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1420, size: 96, elements: !1661)
!1661 = !{!1629}
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !1648, file: !237, line: 344, baseType: !1660, size: 96, offset: 416)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !1648, file: !237, line: 347, baseType: !1433, size: 128, offset: 512)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !1648, file: !237, line: 349, baseType: !1440, size: 32, offset: 640)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !1648, file: !237, line: 350, baseType: !1440, size: 32, offset: 672)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !1648, file: !237, line: 351, baseType: !1421, size: 64, offset: 704)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !1648, file: !237, line: 352, baseType: !1421, size: 64, offset: 768)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !1648, file: !237, line: 354, baseType: !1669, size: 384, offset: 832)
!1669 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !237, line: 116, baseType: !1670)
!1670 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !237, line: 94, size: 384, elements: !1671)
!1671 = !{!1672, !1673, !1674, !1675, !1676, !1677, !1678, !1679, !1680, !1681, !1682, !1683, !1684, !1685, !1686, !1687}
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !1670, file: !237, line: 96, baseType: !1440, size: 32)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !1670, file: !237, line: 96, baseType: !1440, size: 32, offset: 32)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !1670, file: !237, line: 97, baseType: !1440, size: 32, offset: 64)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !1670, file: !237, line: 97, baseType: !1440, size: 32, offset: 96)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !1670, file: !237, line: 99, baseType: !1444, size: 16, offset: 128)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !1670, file: !237, line: 100, baseType: !1444, size: 16, offset: 144)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !1670, file: !237, line: 102, baseType: !1444, size: 16, offset: 160)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !1670, file: !237, line: 105, baseType: !1444, size: 16, offset: 176)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !1670, file: !237, line: 108, baseType: !1444, size: 16, offset: 192)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !1670, file: !237, line: 109, baseType: !1444, size: 16, offset: 208)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !1670, file: !237, line: 111, baseType: !1444, size: 16, offset: 224)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !1670, file: !237, line: 112, baseType: !1444, size: 16, offset: 240)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !1670, file: !237, line: 114, baseType: !1440, size: 32, offset: 256)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !1670, file: !237, line: 114, baseType: !1440, size: 32, offset: 288)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !1670, file: !237, line: 115, baseType: !1440, size: 32, offset: 320)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !1670, file: !237, line: 115, baseType: !1440, size: 32, offset: 352)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !1648, file: !237, line: 355, baseType: !1571, size: 512, offset: 1216)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1600, file: !1302, line: 134, baseType: !1421, size: 64, offset: 2368)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !1600, file: !1302, line: 136, baseType: !1691, size: 64, offset: 2432)
!1691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1692, size: 64)
!1692 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !1592, line: 61, flags: DIFlagFwdDecl)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !1600, file: !1302, line: 138, baseType: !1669, size: 384, offset: 2496)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !1600, file: !1302, line: 139, baseType: !1695, size: 64, offset: 2880)
!1695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1696, size: 64)
!1696 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !237, line: 80, baseType: !1697)
!1697 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !237, line: 72, size: 192, elements: !1698)
!1698 = !{!1699, !1706, !1707, !1708, !1709}
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !1697, file: !237, line: 73, baseType: !1700, size: 64)
!1700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1701, size: 64)
!1701 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !237, line: 59, baseType: !1702)
!1702 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !237, line: 56, size: 128, elements: !1703)
!1703 = !{!1704, !1705}
!1704 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !1702, file: !237, line: 57, baseType: !1660, size: 96)
!1705 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1702, file: !237, line: 58, baseType: !1440, size: 32, offset: 96)
!1706 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1697, file: !237, line: 74, baseType: !1440, size: 32, offset: 64)
!1707 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1697, file: !237, line: 76, baseType: !1440, size: 32, offset: 96)
!1708 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1697, file: !237, line: 77, baseType: !1440, size: 32, offset: 128)
!1709 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1697, file: !237, line: 79, baseType: !1440, size: 32, offset: 160)
!1710 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !1600, file: !1302, line: 141, baseType: !1433, size: 128, offset: 2944)
!1711 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !1600, file: !1302, line: 142, baseType: !1433, size: 128, offset: 3072)
!1712 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !1600, file: !1302, line: 143, baseType: !1433, size: 128, offset: 3200)
!1713 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !1600, file: !1302, line: 144, baseType: !1433, size: 128, offset: 3328)
!1714 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1600, file: !1302, line: 146, baseType: !1440, size: 32, offset: 3456)
!1715 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !1600, file: !1302, line: 147, baseType: !1440, size: 32, offset: 3488)
!1716 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !1600, file: !1302, line: 150, baseType: !1717, size: 64, offset: 3520)
!1717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1718, size: 64)
!1718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1719, size: 64)
!1719 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !1592, line: 179, flags: DIFlagFwdDecl)
!1720 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !1600, file: !1302, line: 151, baseType: !1721, size: 64, offset: 3584)
!1721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1543, size: 64)
!1722 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !1600, file: !1302, line: 152, baseType: !1440, size: 32, offset: 3648)
!1723 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !1600, file: !1302, line: 153, baseType: !1440, size: 32, offset: 3680)
!1724 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !1600, file: !1302, line: 156, baseType: !1660, size: 96, offset: 3712)
!1725 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !1600, file: !1302, line: 156, baseType: !1660, size: 96, offset: 3808)
!1726 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !1600, file: !1302, line: 156, baseType: !1660, size: 96, offset: 3904)
!1727 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1600, file: !1302, line: 157, baseType: !1660, size: 96, offset: 4000)
!1728 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !1600, file: !1302, line: 158, baseType: !1660, size: 96, offset: 4096)
!1729 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !1600, file: !1302, line: 159, baseType: !1660, size: 96, offset: 4192)
!1730 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !1600, file: !1302, line: 160, baseType: !1660, size: 96, offset: 4288)
!1731 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !1600, file: !1302, line: 160, baseType: !1660, size: 96, offset: 4384)
!1732 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !1600, file: !1302, line: 161, baseType: !1733, size: 128, offset: 4480)
!1733 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1420, size: 128, elements: !1734)
!1734 = !{!1735}
!1735 = !DISubrange(count: 4)
!1736 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !1600, file: !1302, line: 161, baseType: !1733, size: 128, offset: 4608)
!1737 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !1600, file: !1302, line: 162, baseType: !1660, size: 96, offset: 4736)
!1738 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !1600, file: !1302, line: 162, baseType: !1660, size: 96, offset: 4832)
!1739 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !1600, file: !1302, line: 163, baseType: !1420, size: 32, offset: 4928)
!1740 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !1600, file: !1302, line: 163, baseType: !1420, size: 32, offset: 4960)
!1741 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !1600, file: !1302, line: 164, baseType: !1742, size: 512, offset: 4992)
!1742 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1420, size: 512, elements: !1743)
!1743 = !{!1735, !1735}
!1744 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !1600, file: !1302, line: 165, baseType: !1742, size: 512, offset: 5504)
!1745 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !1600, file: !1302, line: 166, baseType: !1742, size: 512, offset: 6016)
!1746 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !1600, file: !1302, line: 167, baseType: !1742, size: 512, offset: 6528)
!1747 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !1600, file: !1302, line: 176, baseType: !1742, size: 512, offset: 7040)
!1748 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !1600, file: !1302, line: 178, baseType: !5, size: 32, offset: 7552)
!1749 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1600, file: !1302, line: 180, baseType: !1444, size: 16, offset: 7584)
!1750 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !1600, file: !1302, line: 181, baseType: !1444, size: 16, offset: 7600)
!1751 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !1600, file: !1302, line: 183, baseType: !1444, size: 16, offset: 7616)
!1752 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !1600, file: !1302, line: 183, baseType: !1444, size: 16, offset: 7632)
!1753 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !1600, file: !1302, line: 184, baseType: !1444, size: 16, offset: 7648)
!1754 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !1600, file: !1302, line: 184, baseType: !1444, size: 16, offset: 7664)
!1755 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !1600, file: !1302, line: 185, baseType: !1444, size: 16, offset: 7680)
!1756 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !1600, file: !1302, line: 186, baseType: !1444, size: 16, offset: 7696)
!1757 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !1600, file: !1302, line: 187, baseType: !1444, size: 16, offset: 7712)
!1758 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !1600, file: !1302, line: 188, baseType: !1543, size: 8, offset: 7728)
!1759 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !1600, file: !1302, line: 189, baseType: !1543, size: 8, offset: 7736)
!1760 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !1600, file: !1302, line: 192, baseType: !1440, size: 32, offset: 7744)
!1761 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !1600, file: !1302, line: 192, baseType: !1440, size: 32, offset: 7776)
!1762 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !1600, file: !1302, line: 192, baseType: !1440, size: 32, offset: 7808)
!1763 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !1600, file: !1302, line: 192, baseType: !1440, size: 32, offset: 7840)
!1764 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1600, file: !1302, line: 194, baseType: !1440, size: 32, offset: 7872)
!1765 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !1600, file: !1302, line: 202, baseType: !1420, size: 32, offset: 7904)
!1766 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !1600, file: !1302, line: 202, baseType: !1420, size: 32, offset: 7936)
!1767 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !1600, file: !1302, line: 202, baseType: !1420, size: 32, offset: 7968)
!1768 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !1600, file: !1302, line: 211, baseType: !1420, size: 32, offset: 8000)
!1769 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !1600, file: !1302, line: 212, baseType: !1420, size: 32, offset: 8032)
!1770 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !1600, file: !1302, line: 213, baseType: !1420, size: 32, offset: 8064)
!1771 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !1600, file: !1302, line: 214, baseType: !1420, size: 32, offset: 8096)
!1772 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !1600, file: !1302, line: 215, baseType: !1420, size: 32, offset: 8128)
!1773 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !1600, file: !1302, line: 216, baseType: !1420, size: 32, offset: 8160)
!1774 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !1600, file: !1302, line: 219, baseType: !1420, size: 32, offset: 8192)
!1775 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !1600, file: !1302, line: 220, baseType: !1420, size: 32, offset: 8224)
!1776 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !1600, file: !1302, line: 221, baseType: !1420, size: 32, offset: 8256)
!1777 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !1600, file: !1302, line: 224, baseType: !1778, size: 16, offset: 8288)
!1778 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!1779 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !1600, file: !1302, line: 224, baseType: !1778, size: 16, offset: 8304)
!1780 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !1600, file: !1302, line: 226, baseType: !1444, size: 16, offset: 8320)
!1781 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !1600, file: !1302, line: 228, baseType: !1543, size: 8, offset: 8336)
!1782 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !1600, file: !1302, line: 229, baseType: !1543, size: 8, offset: 8344)
!1783 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !1600, file: !1302, line: 231, baseType: !1444, size: 16, offset: 8352)
!1784 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !1600, file: !1302, line: 232, baseType: !1543, size: 8, offset: 8368)
!1785 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !1600, file: !1302, line: 233, baseType: !1543, size: 8, offset: 8376)
!1786 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !1600, file: !1302, line: 234, baseType: !1420, size: 32, offset: 8384)
!1787 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !1600, file: !1302, line: 235, baseType: !1420, size: 32, offset: 8416)
!1788 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !1600, file: !1302, line: 237, baseType: !1433, size: 128, offset: 8448)
!1789 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !1600, file: !1302, line: 238, baseType: !1433, size: 128, offset: 8576)
!1790 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !1600, file: !1302, line: 239, baseType: !1433, size: 128, offset: 8704)
!1791 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !1600, file: !1302, line: 240, baseType: !1433, size: 128, offset: 8832)
!1792 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !1600, file: !1302, line: 242, baseType: !1420, size: 32, offset: 8960)
!1793 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1600, file: !1302, line: 244, baseType: !1444, size: 16, offset: 8992)
!1794 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !1600, file: !1302, line: 245, baseType: !1778, size: 16, offset: 9008)
!1795 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !1600, file: !1302, line: 246, baseType: !1733, size: 128, offset: 9024)
!1796 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !1600, file: !1302, line: 248, baseType: !1440, size: 32, offset: 9152)
!1797 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !1600, file: !1302, line: 249, baseType: !1440, size: 32, offset: 9184)
!1798 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !1600, file: !1302, line: 251, baseType: !1799, size: 64, offset: 9216)
!1799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1800, size: 64)
!1800 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !1302, line: 251, flags: DIFlagFwdDecl)
!1801 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !1600, file: !1302, line: 253, baseType: !1543, size: 8, offset: 9280)
!1802 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !1600, file: !1302, line: 254, baseType: !1543, size: 8, offset: 9288)
!1803 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !1600, file: !1302, line: 255, baseType: !1444, size: 16, offset: 9296)
!1804 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !1600, file: !1302, line: 256, baseType: !1660, size: 96, offset: 9312)
!1805 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !1600, file: !1302, line: 258, baseType: !1433, size: 128, offset: 9408)
!1806 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !1600, file: !1302, line: 259, baseType: !1433, size: 128, offset: 9536)
!1807 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !1600, file: !1302, line: 260, baseType: !1433, size: 128, offset: 9664)
!1808 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !1600, file: !1302, line: 261, baseType: !1433, size: 128, offset: 9792)
!1809 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !1600, file: !1302, line: 263, baseType: !1810, size: 64, offset: 9920)
!1810 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1811, size: 64)
!1811 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !1302, line: 52, flags: DIFlagFwdDecl)
!1812 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !1600, file: !1302, line: 264, baseType: !1813, size: 64, offset: 9984)
!1813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1814, size: 64)
!1814 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !1302, line: 53, flags: DIFlagFwdDecl)
!1815 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !1600, file: !1302, line: 265, baseType: !1816, size: 64, offset: 10048)
!1816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1817, size: 64)
!1817 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !1818, line: 43, flags: DIFlagFwdDecl)
!1818 = !DIFile(filename: "blender/source/blender/makesdna/DNA_freestyle_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1819 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !1600, file: !1302, line: 267, baseType: !1543, size: 8, offset: 10112)
!1820 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !1600, file: !1302, line: 268, baseType: !1543, size: 8, offset: 10120)
!1821 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !1600, file: !1302, line: 269, baseType: !1444, size: 16, offset: 10128)
!1822 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !1600, file: !1302, line: 270, baseType: !1420, size: 32, offset: 10144)
!1823 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !1600, file: !1302, line: 272, baseType: !1824, size: 64, offset: 10176)
!1824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1825, size: 64)
!1825 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !1302, line: 54, flags: DIFlagFwdDecl)
!1826 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !1600, file: !1302, line: 275, baseType: !1827, size: 64, offset: 10240)
!1827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1828, size: 64)
!1828 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !1302, line: 275, flags: DIFlagFwdDecl)
!1829 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !1600, file: !1302, line: 277, baseType: !1830, size: 64, offset: 10304)
!1830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1831, size: 64)
!1831 = !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !1302, line: 56, flags: DIFlagFwdDecl)
!1832 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !1600, file: !1302, line: 277, baseType: !1830, size: 64, offset: 10368)
!1833 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !1600, file: !1302, line: 278, baseType: !1834, size: 64, offset: 10432)
!1834 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !1835, line: 27, baseType: !1836)
!1835 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!1836 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !1837, line: 45, baseType: !1838)
!1837 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!1838 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!1839 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_mask", scope: !1600, file: !1302, line: 279, baseType: !1834, size: 64, offset: 10496)
!1840 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1600, file: !1302, line: 280, baseType: !5, size: 32, offset: 10560)
!1841 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !1600, file: !1302, line: 281, baseType: !5, size: 32, offset: 10592)
!1842 = !DIDerivedType(tag: DW_TAG_member, name: "gpulamp", scope: !1600, file: !1302, line: 283, baseType: !1433, size: 128, offset: 10624)
!1843 = !DIDerivedType(tag: DW_TAG_member, name: "pc_ids", scope: !1600, file: !1302, line: 284, baseType: !1433, size: 128, offset: 10752)
!1844 = !DIDerivedType(tag: DW_TAG_member, name: "duplilist", scope: !1600, file: !1302, line: 285, baseType: !1845, size: 64, offset: 10880)
!1845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1433, size: 64)
!1846 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_object", scope: !1600, file: !1302, line: 287, baseType: !1847, size: 64, offset: 10944)
!1847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1848, size: 64)
!1848 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyOb", file: !1302, line: 59, flags: DIFlagFwdDecl)
!1849 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_constraint", scope: !1600, file: !1302, line: 288, baseType: !1850, size: 64, offset: 11008)
!1850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1851, size: 64)
!1851 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyCon", file: !1302, line: 288, flags: DIFlagFwdDecl)
!1852 = !DIDerivedType(tag: DW_TAG_member, name: "ima_ofs", scope: !1600, file: !1302, line: 290, baseType: !1478, size: 64, offset: 11072)
!1853 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !1600, file: !1302, line: 291, baseType: !1854, size: 64, offset: 11136)
!1854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1855, size: 64)
!1855 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageUser", file: !1856, line: 65, baseType: !1857)
!1856 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1857 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !1856, line: 50, size: 320, elements: !1858)
!1858 = !{!1859, !1860, !1861, !1862, !1863, !1864, !1865, !1866, !1867, !1868, !1869, !1870, !1871, !1872}
!1859 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !1857, file: !1856, line: 51, baseType: !1590, size: 64)
!1860 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !1857, file: !1856, line: 53, baseType: !1440, size: 32, offset: 64)
!1861 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !1857, file: !1856, line: 54, baseType: !1440, size: 32, offset: 96)
!1862 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1857, file: !1856, line: 55, baseType: !1440, size: 32, offset: 128)
!1863 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !1857, file: !1856, line: 55, baseType: !1440, size: 32, offset: 160)
!1864 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !1857, file: !1856, line: 56, baseType: !1543, size: 8, offset: 192)
!1865 = !DIDerivedType(tag: DW_TAG_member, name: "cycl", scope: !1857, file: !1856, line: 56, baseType: !1543, size: 8, offset: 200)
!1866 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !1857, file: !1856, line: 57, baseType: !1543, size: 8, offset: 208)
!1867 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1857, file: !1856, line: 57, baseType: !1543, size: 8, offset: 216)
!1868 = !DIDerivedType(tag: DW_TAG_member, name: "multi_index", scope: !1857, file: !1856, line: 59, baseType: !1444, size: 16, offset: 224)
!1869 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !1857, file: !1856, line: 59, baseType: !1444, size: 16, offset: 240)
!1870 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !1857, file: !1856, line: 59, baseType: !1444, size: 16, offset: 256)
!1871 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1857, file: !1856, line: 61, baseType: !1444, size: 16, offset: 272)
!1872 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1857, file: !1856, line: 63, baseType: !1440, size: 32, offset: 288)
!1873 = !DIDerivedType(tag: DW_TAG_member, name: "lodlevels", scope: !1600, file: !1302, line: 293, baseType: !1433, size: 128, offset: 11200)
!1874 = !DIDerivedType(tag: DW_TAG_member, name: "currentlod", scope: !1600, file: !1302, line: 294, baseType: !1875, size: 64, offset: 11328)
!1875 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1876, size: 64)
!1876 = !DIDerivedType(tag: DW_TAG_typedef, name: "LodLevel", file: !1302, line: 113, baseType: !1877)
!1877 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LodLevel", file: !1302, line: 108, size: 256, elements: !1878)
!1878 = !{!1879, !1881, !1882, !1883, !1884}
!1879 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1877, file: !1302, line: 109, baseType: !1880, size: 64)
!1880 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1877, size: 64)
!1881 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1877, file: !1302, line: 109, baseType: !1880, size: 64, offset: 64)
!1882 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !1877, file: !1302, line: 110, baseType: !1599, size: 64, offset: 128)
!1883 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1877, file: !1302, line: 111, baseType: !1440, size: 32, offset: 192)
!1884 = !DIDerivedType(tag: DW_TAG_member, name: "distance", scope: !1877, file: !1302, line: 112, baseType: !1420, size: 32, offset: 224)
!1885 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !1591, file: !1592, line: 1221, baseType: !1886, size: 64, offset: 1088)
!1886 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1887, size: 64)
!1887 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !1592, line: 52, flags: DIFlagFwdDecl)
!1888 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !1591, file: !1592, line: 1223, baseType: !1590, size: 64, offset: 1152)
!1889 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1591, file: !1592, line: 1225, baseType: !1433, size: 128, offset: 1216)
!1890 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !1591, file: !1592, line: 1226, baseType: !1891, size: 64, offset: 1344)
!1891 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1892, size: 64)
!1892 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !1592, line: 69, size: 320, elements: !1893)
!1893 = !{!1894, !1895, !1896, !1897, !1898, !1899, !1900, !1901}
!1894 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1892, file: !1592, line: 70, baseType: !1891, size: 64)
!1895 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1892, file: !1592, line: 70, baseType: !1891, size: 64, offset: 64)
!1896 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !1892, file: !1592, line: 71, baseType: !5, size: 32, offset: 128)
!1897 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !1892, file: !1592, line: 71, baseType: !5, size: 32, offset: 160)
!1898 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1892, file: !1592, line: 72, baseType: !1440, size: 32, offset: 192)
!1899 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !1892, file: !1592, line: 73, baseType: !1444, size: 16, offset: 224)
!1900 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !1892, file: !1592, line: 73, baseType: !1444, size: 16, offset: 240)
!1901 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !1892, file: !1592, line: 74, baseType: !1599, size: 64, offset: 256)
!1902 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !1591, file: !1592, line: 1227, baseType: !1599, size: 64, offset: 1408)
!1903 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !1591, file: !1592, line: 1229, baseType: !1660, size: 96, offset: 1472)
!1904 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !1591, file: !1592, line: 1230, baseType: !1660, size: 96, offset: 1568)
!1905 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !1591, file: !1592, line: 1231, baseType: !1660, size: 96, offset: 1664)
!1906 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !1591, file: !1592, line: 1231, baseType: !1660, size: 96, offset: 1760)
!1907 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !1591, file: !1592, line: 1233, baseType: !5, size: 32, offset: 1856)
!1908 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !1591, file: !1592, line: 1234, baseType: !1440, size: 32, offset: 1888)
!1909 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !1591, file: !1592, line: 1235, baseType: !5, size: 32, offset: 1920)
!1910 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1591, file: !1592, line: 1237, baseType: !1444, size: 16, offset: 1952)
!1911 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !1591, file: !1592, line: 1239, baseType: !1543, size: 8, offset: 1968)
!1912 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1591, file: !1592, line: 1240, baseType: !1913, size: 8, offset: 1976)
!1913 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1543, size: 8, elements: !1914)
!1914 = !{!1915}
!1915 = !DISubrange(count: 1)
!1916 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !1591, file: !1592, line: 1242, baseType: !1917, size: 64, offset: 1984)
!1917 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1918, size: 64)
!1918 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !1919, line: 328, size: 3456, elements: !1920)
!1919 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1920 = !{!1921, !1922, !1923, !1927, !1928, !1931, !1932, !1933, !1934, !1935, !1936, !1937, !1938, !1939, !1940, !1941, !1942, !1943, !1944, !1945, !1946, !1947, !1948, !1949, !1950, !1953, !1958, !1959, !1962, !1966, !1970, !1974, !1978, !1979, !1980, !1981}
!1921 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1918, file: !1919, line: 329, baseType: !1523, size: 960)
!1922 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1918, file: !1919, line: 330, baseType: !1596, size: 64, offset: 960)
!1923 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !1918, file: !1919, line: 332, baseType: !1924, size: 64, offset: 1024)
!1924 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1925, size: 64)
!1925 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !1926, line: 32, flags: DIFlagFwdDecl)
!1926 = !DIFile(filename: "blender/source/blender/makesrna/RNA_enum_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1927 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !1918, file: !1919, line: 333, baseType: !1571, size: 512, offset: 1088)
!1928 = !DIDerivedType(tag: DW_TAG_member, name: "interface_type", scope: !1918, file: !1919, line: 335, baseType: !1929, size: 64, offset: 1600)
!1929 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1930, size: 64)
!1930 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !1386, line: 41, flags: DIFlagFwdDecl)
!1931 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !1918, file: !1919, line: 337, baseType: !1691, size: 64, offset: 1664)
!1932 = !DIDerivedType(tag: DW_TAG_member, name: "view_center", scope: !1918, file: !1919, line: 338, baseType: !1478, size: 64, offset: 1728)
!1933 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !1918, file: !1919, line: 340, baseType: !1433, size: 128, offset: 1792)
!1934 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !1918, file: !1919, line: 340, baseType: !1433, size: 128, offset: 1920)
!1935 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1918, file: !1919, line: 342, baseType: !1440, size: 32, offset: 2048)
!1936 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1918, file: !1919, line: 342, baseType: !1440, size: 32, offset: 2080)
!1937 = !DIDerivedType(tag: DW_TAG_member, name: "cur_index", scope: !1918, file: !1919, line: 343, baseType: !1440, size: 32, offset: 2112)
!1938 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1918, file: !1919, line: 345, baseType: !1440, size: 32, offset: 2144)
!1939 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !1918, file: !1919, line: 346, baseType: !1440, size: 32, offset: 2176)
!1940 = !DIDerivedType(tag: DW_TAG_member, name: "is_updating", scope: !1918, file: !1919, line: 347, baseType: !1444, size: 16, offset: 2208)
!1941 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !1918, file: !1919, line: 348, baseType: !1444, size: 16, offset: 2224)
!1942 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1918, file: !1919, line: 349, baseType: !1440, size: 32, offset: 2240)
!1943 = !DIDerivedType(tag: DW_TAG_member, name: "nodetype", scope: !1918, file: !1919, line: 351, baseType: !1440, size: 32, offset: 2272)
!1944 = !DIDerivedType(tag: DW_TAG_member, name: "edit_quality", scope: !1918, file: !1919, line: 353, baseType: !1444, size: 16, offset: 2304)
!1945 = !DIDerivedType(tag: DW_TAG_member, name: "render_quality", scope: !1918, file: !1919, line: 354, baseType: !1444, size: 16, offset: 2320)
!1946 = !DIDerivedType(tag: DW_TAG_member, name: "chunksize", scope: !1918, file: !1919, line: 355, baseType: !1440, size: 32, offset: 2336)
!1947 = !DIDerivedType(tag: DW_TAG_member, name: "viewer_border", scope: !1918, file: !1919, line: 357, baseType: !1458, size: 128, offset: 2368)
!1948 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !1918, file: !1919, line: 363, baseType: !1433, size: 128, offset: 2496)
!1949 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !1918, file: !1919, line: 363, baseType: !1433, size: 128, offset: 2624)
!1950 = !DIDerivedType(tag: DW_TAG_member, name: "previews", scope: !1918, file: !1919, line: 368, baseType: !1951, size: 64, offset: 2752)
!1951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1952, size: 64)
!1952 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHash", file: !1919, line: 48, flags: DIFlagFwdDecl)
!1953 = !DIDerivedType(tag: DW_TAG_member, name: "active_viewer_key", scope: !1918, file: !1919, line: 372, baseType: !1954, size: 32, offset: 2816)
!1954 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !1919, line: 274, baseType: !1955)
!1955 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !1919, line: 271, size: 32, elements: !1956)
!1956 = !{!1957}
!1957 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1955, file: !1919, line: 273, baseType: !5, size: 32)
!1958 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1918, file: !1919, line: 373, baseType: !1440, size: 32, offset: 2848)
!1959 = !DIDerivedType(tag: DW_TAG_member, name: "execdata", scope: !1918, file: !1919, line: 382, baseType: !1960, size: 64, offset: 2880)
!1960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1961, size: 64)
!1961 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeExec", file: !1919, line: 46, flags: DIFlagFwdDecl)
!1962 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !1918, file: !1919, line: 385, baseType: !1963, size: 64, offset: 2944)
!1963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1964, size: 64)
!1964 = !DISubroutineType(types: !1965)
!1965 = !{null, !1421, !1420}
!1966 = !DIDerivedType(tag: DW_TAG_member, name: "stats_draw", scope: !1918, file: !1919, line: 386, baseType: !1967, size: 64, offset: 3008)
!1967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1968, size: 64)
!1968 = !DISubroutineType(types: !1969)
!1969 = !{null, !1421, !1721}
!1970 = !DIDerivedType(tag: DW_TAG_member, name: "test_break", scope: !1918, file: !1919, line: 387, baseType: !1971, size: 64, offset: 3072)
!1971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1972, size: 64)
!1972 = !DISubroutineType(types: !1973)
!1973 = !{!1440, !1421}
!1974 = !DIDerivedType(tag: DW_TAG_member, name: "update_draw", scope: !1918, file: !1919, line: 388, baseType: !1975, size: 64, offset: 3136)
!1975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1976, size: 64)
!1976 = !DISubroutineType(types: !1977)
!1977 = !{null, !1421}
!1978 = !DIDerivedType(tag: DW_TAG_member, name: "tbh", scope: !1918, file: !1919, line: 389, baseType: !1421, size: 64, offset: 3200)
!1979 = !DIDerivedType(tag: DW_TAG_member, name: "prh", scope: !1918, file: !1919, line: 389, baseType: !1421, size: 64, offset: 3264)
!1980 = !DIDerivedType(tag: DW_TAG_member, name: "sdh", scope: !1918, file: !1919, line: 389, baseType: !1421, size: 64, offset: 3328)
!1981 = !DIDerivedType(tag: DW_TAG_member, name: "udh", scope: !1918, file: !1919, line: 389, baseType: !1421, size: 64, offset: 3392)
!1982 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !1591, file: !1592, line: 1244, baseType: !1983, size: 64, offset: 2048)
!1983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1984, size: 64)
!1984 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !1985, line: 200, size: 17024, elements: !1986)
!1985 = !DIFile(filename: "blender/source/blender/makesdna/DNA_sequence_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1986 = !{!1987, !1988, !1989, !1990, !2402, !2403, !2404, !2405, !2406, !2407, !2408}
!1987 = !DIDerivedType(tag: DW_TAG_member, name: "seqbasep", scope: !1984, file: !1985, line: 201, baseType: !1845, size: 64)
!1988 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !1984, file: !1985, line: 202, baseType: !1433, size: 128, offset: 64)
!1989 = !DIDerivedType(tag: DW_TAG_member, name: "metastack", scope: !1984, file: !1985, line: 203, baseType: !1433, size: 128, offset: 192)
!1990 = !DIDerivedType(tag: DW_TAG_member, name: "act_seq", scope: !1984, file: !1985, line: 206, baseType: !1991, size: 64, offset: 320)
!1991 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1992, size: 64)
!1992 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sequence", file: !1985, line: 190, baseType: !1993)
!1993 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sequence", file: !1985, line: 126, size: 2816, elements: !1994)
!1994 = !{!1995, !1997, !1998, !1999, !2000, !2001, !2002, !2003, !2004, !2005, !2006, !2007, !2008, !2009, !2010, !2011, !2012, !2013, !2014, !2015, !2016, !2017, !2018, !2019, !2020, !2093, !2094, !2095, !2096, !2373, !2377, !2378, !2379, !2380, !2381, !2382, !2383, !2384, !2387, !2388, !2389, !2390, !2391, !2392, !2393, !2394, !2395, !2396, !2397, !2398, !2399, !2401}
!1995 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1993, file: !1985, line: 127, baseType: !1996, size: 64)
!1996 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1993, size: 64)
!1997 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1993, file: !1985, line: 127, baseType: !1996, size: 64, offset: 64)
!1998 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !1993, file: !1985, line: 128, baseType: !1421, size: 64, offset: 128)
!1999 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !1993, file: !1985, line: 129, baseType: !1421, size: 64, offset: 192)
!2000 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1993, file: !1985, line: 130, baseType: !1571, size: 512, offset: 256)
!2001 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1993, file: !1985, line: 132, baseType: !1440, size: 32, offset: 768)
!2002 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1993, file: !1985, line: 132, baseType: !1440, size: 32, offset: 800)
!2003 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1993, file: !1985, line: 133, baseType: !1440, size: 32, offset: 832)
!2004 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !1993, file: !1985, line: 134, baseType: !1440, size: 32, offset: 864)
!2005 = !DIDerivedType(tag: DW_TAG_member, name: "startofs", scope: !1993, file: !1985, line: 134, baseType: !1440, size: 32, offset: 896)
!2006 = !DIDerivedType(tag: DW_TAG_member, name: "endofs", scope: !1993, file: !1985, line: 134, baseType: !1440, size: 32, offset: 928)
!2007 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !1993, file: !1985, line: 135, baseType: !1440, size: 32, offset: 960)
!2008 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !1993, file: !1985, line: 135, baseType: !1440, size: 32, offset: 992)
!2009 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !1993, file: !1985, line: 136, baseType: !1440, size: 32, offset: 1024)
!2010 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !1993, file: !1985, line: 136, baseType: !1440, size: 32, offset: 1056)
!2011 = !DIDerivedType(tag: DW_TAG_member, name: "startdisp", scope: !1993, file: !1985, line: 137, baseType: !1440, size: 32, offset: 1088)
!2012 = !DIDerivedType(tag: DW_TAG_member, name: "enddisp", scope: !1993, file: !1985, line: 137, baseType: !1440, size: 32, offset: 1120)
!2013 = !DIDerivedType(tag: DW_TAG_member, name: "sat", scope: !1993, file: !1985, line: 138, baseType: !1420, size: 32, offset: 1152)
!2014 = !DIDerivedType(tag: DW_TAG_member, name: "mul", scope: !1993, file: !1985, line: 139, baseType: !1420, size: 32, offset: 1184)
!2015 = !DIDerivedType(tag: DW_TAG_member, name: "handsize", scope: !1993, file: !1985, line: 139, baseType: !1420, size: 32, offset: 1216)
!2016 = !DIDerivedType(tag: DW_TAG_member, name: "anim_preseek", scope: !1993, file: !1985, line: 141, baseType: !1444, size: 16, offset: 1248)
!2017 = !DIDerivedType(tag: DW_TAG_member, name: "streamindex", scope: !1993, file: !1985, line: 142, baseType: !1444, size: 16, offset: 1264)
!2018 = !DIDerivedType(tag: DW_TAG_member, name: "multicam_source", scope: !1993, file: !1985, line: 143, baseType: !1440, size: 32, offset: 1280)
!2019 = !DIDerivedType(tag: DW_TAG_member, name: "clip_flag", scope: !1993, file: !1985, line: 144, baseType: !1440, size: 32, offset: 1312)
!2020 = !DIDerivedType(tag: DW_TAG_member, name: "strip", scope: !1993, file: !1985, line: 146, baseType: !2021, size: 64, offset: 1344)
!2021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2022, size: 64)
!2022 = !DIDerivedType(tag: DW_TAG_typedef, name: "Strip", file: !1985, line: 114, baseType: !2023)
!2023 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Strip", file: !1985, line: 99, size: 7232, elements: !2024)
!2024 = !{!2025, !2027, !2028, !2029, !2030, !2031, !2032, !2043, !2047, !2061, !2070, !2077, !2087}
!2025 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !2023, file: !1985, line: 100, baseType: !2026, size: 64)
!2026 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2023, size: 64)
!2027 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !2023, file: !1985, line: 100, baseType: !2026, size: 64, offset: 64)
!2028 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !2023, file: !1985, line: 101, baseType: !1440, size: 32, offset: 128)
!2029 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !2023, file: !1985, line: 101, baseType: !1440, size: 32, offset: 160)
!2030 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !2023, file: !1985, line: 102, baseType: !1440, size: 32, offset: 192)
!2031 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !2023, file: !1985, line: 102, baseType: !1440, size: 32, offset: 224)
!2032 = !DIDerivedType(tag: DW_TAG_member, name: "stripdata", scope: !2023, file: !1985, line: 103, baseType: !2033, size: 64, offset: 256)
!2033 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2034, size: 64)
!2034 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripElem", file: !1985, line: 59, baseType: !2035)
!2035 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripElem", file: !1985, line: 56, size: 2112, elements: !2036)
!2036 = !{!2037, !2041, !2042}
!2037 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !2035, file: !1985, line: 57, baseType: !2038, size: 2048)
!2038 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1543, size: 2048, elements: !2039)
!2039 = !{!2040}
!2040 = !DISubrange(count: 256)
!2041 = !DIDerivedType(tag: DW_TAG_member, name: "orig_width", scope: !2035, file: !1985, line: 58, baseType: !1440, size: 32, offset: 2048)
!2042 = !DIDerivedType(tag: DW_TAG_member, name: "orig_height", scope: !2035, file: !1985, line: 58, baseType: !1440, size: 32, offset: 2080)
!2043 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !2023, file: !1985, line: 106, baseType: !2044, size: 6144, offset: 320)
!2044 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1543, size: 6144, elements: !2045)
!2045 = !{!2046}
!2046 = !DISubrange(count: 768)
!2047 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !2023, file: !1985, line: 107, baseType: !2048, size: 64, offset: 6464)
!2048 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2049, size: 64)
!2049 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripProxy", file: !1985, line: 97, baseType: !2050)
!2050 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripProxy", file: !1985, line: 83, size: 8320, elements: !2051)
!2051 = !{!2052, !2053, !2054, !2057, !2058, !2059, !2060}
!2052 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !2050, file: !1985, line: 84, baseType: !2044, size: 6144)
!2053 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !2050, file: !1985, line: 87, baseType: !2038, size: 2048, offset: 6144)
!2054 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !2050, file: !1985, line: 88, baseType: !2055, size: 64, offset: 8192)
!2055 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2056, size: 64)
!2056 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !1856, line: 41, flags: DIFlagFwdDecl)
!2057 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !2050, file: !1985, line: 90, baseType: !1444, size: 16, offset: 8256)
!2058 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !2050, file: !1985, line: 92, baseType: !1444, size: 16, offset: 8272)
!2059 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flags", scope: !2050, file: !1985, line: 93, baseType: !1444, size: 16, offset: 8288)
!2060 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flags", scope: !2050, file: !1985, line: 95, baseType: !1444, size: 16, offset: 8304)
!2061 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !2023, file: !1985, line: 108, baseType: !2062, size: 64, offset: 6528)
!2062 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2063, size: 64)
!2063 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripCrop", file: !1985, line: 66, baseType: !2064)
!2064 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripCrop", file: !1985, line: 61, size: 128, elements: !2065)
!2065 = !{!2066, !2067, !2068, !2069}
!2066 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !2064, file: !1985, line: 62, baseType: !1440, size: 32)
!2067 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !2064, file: !1985, line: 63, baseType: !1440, size: 32, offset: 32)
!2068 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !2064, file: !1985, line: 64, baseType: !1440, size: 32, offset: 64)
!2069 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !2064, file: !1985, line: 65, baseType: !1440, size: 32, offset: 96)
!2070 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !2023, file: !1985, line: 109, baseType: !2071, size: 64, offset: 6592)
!2071 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2072, size: 64)
!2072 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripTransform", file: !1985, line: 71, baseType: !2073)
!2073 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripTransform", file: !1985, line: 68, size: 64, elements: !2074)
!2074 = !{!2075, !2076}
!2075 = !DIDerivedType(tag: DW_TAG_member, name: "xofs", scope: !2073, file: !1985, line: 69, baseType: !1440, size: 32)
!2076 = !DIDerivedType(tag: DW_TAG_member, name: "yofs", scope: !2073, file: !1985, line: 70, baseType: !1440, size: 32, offset: 32)
!2077 = !DIDerivedType(tag: DW_TAG_member, name: "color_balance", scope: !2023, file: !1985, line: 110, baseType: !2078, size: 64, offset: 6656)
!2078 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2079, size: 64)
!2079 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripColorBalance", file: !1985, line: 81, baseType: !2080)
!2080 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripColorBalance", file: !1985, line: 73, size: 352, elements: !2081)
!2081 = !{!2082, !2083, !2084, !2085, !2086}
!2082 = !DIDerivedType(tag: DW_TAG_member, name: "lift", scope: !2080, file: !1985, line: 74, baseType: !1660, size: 96)
!2083 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !2080, file: !1985, line: 75, baseType: !1660, size: 96, offset: 96)
!2084 = !DIDerivedType(tag: DW_TAG_member, name: "gain", scope: !2080, file: !1985, line: 76, baseType: !1660, size: 96, offset: 192)
!2085 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !2080, file: !1985, line: 77, baseType: !1440, size: 32, offset: 288)
!2086 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !2080, file: !1985, line: 78, baseType: !1440, size: 32, offset: 320)
!2087 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !2023, file: !1985, line: 113, baseType: !2088, size: 512, offset: 6720)
!2088 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !2089, line: 182, baseType: !2090)
!2089 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!2090 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !2089, line: 180, size: 512, elements: !2091)
!2091 = !{!2092}
!2092 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !2090, file: !2089, line: 181, baseType: !1571, size: 512)
!2093 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !1993, file: !1985, line: 148, baseType: !1619, size: 64, offset: 1408)
!2094 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !1993, file: !1985, line: 151, baseType: !1590, size: 64, offset: 1472)
!2095 = !DIDerivedType(tag: DW_TAG_member, name: "scene_camera", scope: !1993, file: !1985, line: 152, baseType: !1599, size: 64, offset: 1536)
!2096 = !DIDerivedType(tag: DW_TAG_member, name: "clip", scope: !1993, file: !1985, line: 153, baseType: !2097, size: 64, offset: 1600)
!2097 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2098, size: 64)
!2098 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClip", file: !2099, line: 64, size: 19136, elements: !2100)
!2099 = !DIFile(filename: "blender/source/blender/makesdna/DNA_movieclip_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!2100 = !{!2101, !2102, !2103, !2104, !2105, !2106, !2108, !2109, !2110, !2111, !2114, !2115, !2359, !2360, !2368, !2369, !2370, !2371, !2372}
!2101 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !2098, file: !2099, line: 65, baseType: !1523, size: 960)
!2102 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !2098, file: !2099, line: 66, baseType: !1596, size: 64, offset: 960)
!2103 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !2098, file: !2099, line: 68, baseType: !1542, size: 8192, offset: 1024)
!2104 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !2098, file: !2099, line: 70, baseType: !1440, size: 32, offset: 9216)
!2105 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !2098, file: !2099, line: 71, baseType: !1440, size: 32, offset: 9248)
!2106 = !DIDerivedType(tag: DW_TAG_member, name: "lastsize", scope: !2098, file: !2099, line: 72, baseType: !2107, size: 64, offset: 9280)
!2107 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1440, size: 64, elements: !1479)
!2108 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !2098, file: !2099, line: 74, baseType: !1420, size: 32, offset: 9344)
!2109 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !2098, file: !2099, line: 74, baseType: !1420, size: 32, offset: 9376)
!2110 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !2098, file: !2099, line: 76, baseType: !2055, size: 64, offset: 9408)
!2111 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !2098, file: !2099, line: 77, baseType: !2112, size: 64, offset: 9472)
!2112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2113, size: 64)
!2113 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipCache", file: !2099, line: 77, flags: DIFlagFwdDecl)
!2114 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !2098, file: !2099, line: 78, baseType: !1691, size: 64, offset: 9536)
!2115 = !DIDerivedType(tag: DW_TAG_member, name: "tracking", scope: !2098, file: !2099, line: 80, baseType: !2116, size: 2624, offset: 9600)
!2116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTracking", file: !2117, line: 340, size: 2624, elements: !2118)
!2117 = !DIFile(filename: "blender/source/blender/makesdna/DNA_tracking_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!2118 = !{!2119, !2147, !2165, !2166, !2167, !2182, !2240, !2241, !2339, !2340, !2341, !2342, !2348}
!2119 = !DIDerivedType(tag: DW_TAG_member, name: "settings", scope: !2116, file: !2117, line: 341, baseType: !2120, size: 576)
!2120 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingSettings", file: !2117, line: 251, baseType: !2121)
!2121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingSettings", file: !2117, line: 207, size: 576, elements: !2122)
!2122 = !{!2123, !2124, !2125, !2126, !2127, !2128, !2129, !2130, !2131, !2132, !2133, !2134, !2135, !2136, !2137, !2138, !2139, !2140, !2141, !2142, !2143, !2144, !2145, !2146}
!2123 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !2121, file: !2117, line: 208, baseType: !1440, size: 32)
!2124 = !DIDerivedType(tag: DW_TAG_member, name: "default_motion_model", scope: !2121, file: !2117, line: 211, baseType: !1444, size: 16, offset: 32)
!2125 = !DIDerivedType(tag: DW_TAG_member, name: "default_algorithm_flag", scope: !2121, file: !2117, line: 212, baseType: !1444, size: 16, offset: 48)
!2126 = !DIDerivedType(tag: DW_TAG_member, name: "default_minimum_correlation", scope: !2121, file: !2117, line: 213, baseType: !1420, size: 32, offset: 64)
!2127 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_size", scope: !2121, file: !2117, line: 214, baseType: !1444, size: 16, offset: 96)
!2128 = !DIDerivedType(tag: DW_TAG_member, name: "default_search_size", scope: !2121, file: !2117, line: 215, baseType: !1444, size: 16, offset: 112)
!2129 = !DIDerivedType(tag: DW_TAG_member, name: "default_frames_limit", scope: !2121, file: !2117, line: 216, baseType: !1444, size: 16, offset: 128)
!2130 = !DIDerivedType(tag: DW_TAG_member, name: "default_margin", scope: !2121, file: !2117, line: 217, baseType: !1444, size: 16, offset: 144)
!2131 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_match", scope: !2121, file: !2117, line: 218, baseType: !1444, size: 16, offset: 160)
!2132 = !DIDerivedType(tag: DW_TAG_member, name: "default_flag", scope: !2121, file: !2117, line: 219, baseType: !1444, size: 16, offset: 176)
!2133 = !DIDerivedType(tag: DW_TAG_member, name: "default_weight", scope: !2121, file: !2117, line: 220, baseType: !1420, size: 32, offset: 192)
!2134 = !DIDerivedType(tag: DW_TAG_member, name: "motion_flag", scope: !2121, file: !2117, line: 222, baseType: !1444, size: 16, offset: 224)
!2135 = !DIDerivedType(tag: DW_TAG_member, name: "speed", scope: !2121, file: !2117, line: 225, baseType: !1444, size: 16, offset: 240)
!2136 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe1", scope: !2121, file: !2117, line: 228, baseType: !1440, size: 32, offset: 256)
!2137 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe2", scope: !2121, file: !2117, line: 229, baseType: !1440, size: 32, offset: 288)
!2138 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction_flag", scope: !2121, file: !2117, line: 233, baseType: !1440, size: 32, offset: 320)
!2139 = !DIDerivedType(tag: DW_TAG_member, name: "refine_camera_intrinsics", scope: !2121, file: !2117, line: 236, baseType: !1444, size: 16, offset: 352)
!2140 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !2121, file: !2117, line: 236, baseType: !1444, size: 16, offset: 368)
!2141 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !2121, file: !2117, line: 241, baseType: !1420, size: 32, offset: 384)
!2142 = !DIDerivedType(tag: DW_TAG_member, name: "clean_frames", scope: !2121, file: !2117, line: 244, baseType: !1440, size: 32, offset: 416)
!2143 = !DIDerivedType(tag: DW_TAG_member, name: "clean_action", scope: !2121, file: !2117, line: 244, baseType: !1440, size: 32, offset: 448)
!2144 = !DIDerivedType(tag: DW_TAG_member, name: "clean_error", scope: !2121, file: !2117, line: 245, baseType: !1420, size: 32, offset: 480)
!2145 = !DIDerivedType(tag: DW_TAG_member, name: "object_distance", scope: !2121, file: !2117, line: 248, baseType: !1420, size: 32, offset: 512)
!2146 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !2121, file: !2117, line: 250, baseType: !1440, size: 32, offset: 544)
!2147 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !2116, file: !2117, line: 342, baseType: !2148, size: 448, offset: 576)
!2148 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingCamera", file: !2117, line: 79, baseType: !2149)
!2149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingCamera", file: !2117, line: 61, size: 448, elements: !2150)
!2150 = !{!2151, !2152, !2153, !2154, !2155, !2156, !2157, !2158, !2159, !2160, !2161, !2162, !2163, !2164}
!2151 = !DIDerivedType(tag: DW_TAG_member, name: "intrinsics", scope: !2149, file: !2117, line: 62, baseType: !1421, size: 64)
!2152 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_model", scope: !2149, file: !2117, line: 64, baseType: !1444, size: 16, offset: 64)
!2153 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !2149, file: !2117, line: 65, baseType: !1444, size: 16, offset: 80)
!2154 = !DIDerivedType(tag: DW_TAG_member, name: "sensor_width", scope: !2149, file: !2117, line: 67, baseType: !1420, size: 32, offset: 96)
!2155 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_aspect", scope: !2149, file: !2117, line: 68, baseType: !1420, size: 32, offset: 128)
!2156 = !DIDerivedType(tag: DW_TAG_member, name: "focal", scope: !2149, file: !2117, line: 69, baseType: !1420, size: 32, offset: 160)
!2157 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !2149, file: !2117, line: 70, baseType: !1444, size: 16, offset: 192)
!2158 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !2149, file: !2117, line: 71, baseType: !1444, size: 16, offset: 208)
!2159 = !DIDerivedType(tag: DW_TAG_member, name: "principal", scope: !2149, file: !2117, line: 72, baseType: !1478, size: 64, offset: 224)
!2160 = !DIDerivedType(tag: DW_TAG_member, name: "k1", scope: !2149, file: !2117, line: 75, baseType: !1420, size: 32, offset: 288)
!2161 = !DIDerivedType(tag: DW_TAG_member, name: "k2", scope: !2149, file: !2117, line: 75, baseType: !1420, size: 32, offset: 320)
!2162 = !DIDerivedType(tag: DW_TAG_member, name: "k3", scope: !2149, file: !2117, line: 75, baseType: !1420, size: 32, offset: 352)
!2163 = !DIDerivedType(tag: DW_TAG_member, name: "division_k1", scope: !2149, file: !2117, line: 78, baseType: !1420, size: 32, offset: 384)
!2164 = !DIDerivedType(tag: DW_TAG_member, name: "division_k2", scope: !2149, file: !2117, line: 78, baseType: !1420, size: 32, offset: 416)
!2165 = !DIDerivedType(tag: DW_TAG_member, name: "tracks", scope: !2116, file: !2117, line: 343, baseType: !1433, size: 128, offset: 1024)
!2166 = !DIDerivedType(tag: DW_TAG_member, name: "plane_tracks", scope: !2116, file: !2117, line: 344, baseType: !1433, size: 128, offset: 1152)
!2167 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction", scope: !2116, file: !2117, line: 345, baseType: !2168, size: 192, offset: 1280)
!2168 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingReconstruction", file: !2117, line: 278, baseType: !2169)
!2169 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingReconstruction", file: !2117, line: 270, size: 192, elements: !2170)
!2170 = !{!2171, !2172, !2173, !2174, !2175}
