; ModuleID = 'blender/source/blender/editors/mesh/editmesh_bisect.c'
source_filename = "blender/source/blender/editors/mesh/editmesh_bisect.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.Global = type { %struct.Main*, [1024 x i8], [1024 x i8], i8, i8, i8, %struct.ListBase, i8, i8, i8, i16, i16, i16, i8, i16, i32, i32, i8, i32, i32, [200 x i8] }
%struct.Main = type opaque
%struct.ListBase = type { i8*, i8* }
%struct.wmOperatorType = type { i8*, i8*, i8*, i8*, i32 (%struct.bContext*, %struct.wmOperator*)*, i8 (%struct.bContext*, %struct.wmOperator*)*, i32 (%struct.bContext*, %struct.wmOperator*, %struct.wmEvent*)*, void (%struct.bContext*, %struct.wmOperator*)*, i32 (%struct.bContext*, %struct.wmOperator*, %struct.wmEvent*)*, i32 (%struct.bContext*)*, void (%struct.bContext*, %struct.wmOperator*)*, %struct.StructRNA*, %struct.IDProperty*, %struct.PropertyRNA*, %struct.ListBase, %struct.wmKeyMap*, i8*, i32 (%struct.bContext*, %struct.wmOperatorType*)*, %struct.ExtensionRNA, i16 }
%struct.bContext = type opaque
%struct.wmOperator = type { %struct.wmOperator*, %struct.wmOperator*, [64 x i8], %struct.IDProperty*, %struct.wmOperatorType*, i8*, i8*, %struct.PointerRNA*, %struct.ReportList*, %struct.ListBase, %struct.wmOperator*, %struct.uiLayout*, i16, [3 x i16] }
%struct.PointerRNA = type { %struct.anon, %struct.StructRNA*, i8* }
%struct.anon = type { i8* }

!280 = !DIEnumerator(name: "NDOF_BUTTON_DOMINANT", value: 419, isUnsigned: true)
!281 = !DIEnumerator(name: "NDOF_BUTTON_PLUS", value: 420, isUnsigned: true)
!282 = !DIEnumerator(name: "NDOF_BUTTON_MINUS", value: 421, isUnsigned: true)
!283 = !DIEnumerator(name: "NDOF_BUTTON_ESC", value: 422, isUnsigned: true)
!284 = !DIEnumerator(name: "NDOF_BUTTON_ALT", value: 423, isUnsigned: true)
!285 = !DIEnumerator(name: "NDOF_BUTTON_SHIFT", value: 424, isUnsigned: true)
!286 = !DIEnumerator(name: "NDOF_BUTTON_CTRL", value: 425, isUnsigned: true)
!287 = !DIEnumerator(name: "NDOF_BUTTON_1", value: 426, isUnsigned: true)
!288 = !DIEnumerator(name: "NDOF_BUTTON_2", value: 427, isUnsigned: true)
!289 = !DIEnumerator(name: "NDOF_BUTTON_3", value: 428, isUnsigned: true)
!290 = !DIEnumerator(name: "NDOF_BUTTON_4", value: 429, isUnsigned: true)
!291 = !DIEnumerator(name: "NDOF_BUTTON_5", value: 430, isUnsigned: true)
!292 = !DIEnumerator(name: "NDOF_BUTTON_6", value: 431, isUnsigned: true)
!293 = !DIEnumerator(name: "NDOF_BUTTON_7", value: 432, isUnsigned: true)
!294 = !DIEnumerator(name: "NDOF_BUTTON_8", value: 433, isUnsigned: true)
!295 = !DIEnumerator(name: "NDOF_BUTTON_9", value: 434, isUnsigned: true)
!296 = !DIEnumerator(name: "NDOF_BUTTON_10", value: 435, isUnsigned: true)
!297 = !DIEnumerator(name: "NDOF_BUTTON_A", value: 436, isUnsigned: true)
!298 = !DIEnumerator(name: "NDOF_BUTTON_B", value: 437, isUnsigned: true)
!299 = !DIEnumerator(name: "NDOF_BUTTON_C", value: 438, isUnsigned: true)
!300 = !DIEnumerator(name: "NDOF_LAST", value: 439, isUnsigned: true)
!301 = !DIEnumerator(name: "INPUTCHANGE", value: 259, isUnsigned: true)
!302 = !DIEnumerator(name: "WINDEACTIVATE", value: 260, isUnsigned: true)
!303 = !DIEnumerator(name: "TIMER", value: 272, isUnsigned: true)
!304 = !DIEnumerator(name: "TIMER0", value: 273, isUnsigned: true)
!305 = !DIEnumerator(name: "TIMER1", value: 274, isUnsigned: true)
!306 = !DIEnumerator(name: "TIMER2", value: 275, isUnsigned: true)
!307 = !DIEnumerator(name: "TIMERJOBS", value: 276, isUnsigned: true)
!308 = !DIEnumerator(name: "TIMERAUTOSAVE", value: 277, isUnsigned: true)
!309 = !DIEnumerator(name: "TIMERREPORT", value: 278, isUnsigned: true)
!310 = !DIEnumerator(name: "TIMERREGION", value: 279, isUnsigned: true)
!311 = !DIEnumerator(name: "TIMERF", value: 287, isUnsigned: true)
!312 = !DIEnumerator(name: "EVT_ACTIONZONE_AREA", value: 20480, isUnsigned: true)
!313 = !DIEnumerator(name: "EVT_ACTIONZONE_REGION", value: 20481, isUnsigned: true)
!314 = !DIEnumerator(name: "EVT_ACTIONZONE_FULLSCREEN", value: 20482, isUnsigned: true)
!315 = !DIEnumerator(name: "EVT_TWEAK_L", value: 20483, isUnsigned: true)
!316 = !DIEnumerator(name: "EVT_TWEAK_M", value: 20484, isUnsigned: true)
!317 = !DIEnumerator(name: "EVT_TWEAK_R", value: 20485, isUnsigned: true)
!318 = !DIEnumerator(name: "EVT_TWEAK_A", value: 20486, isUnsigned: true)
!319 = !DIEnumerator(name: "EVT_TWEAK_S", value: 20487, isUnsigned: true)
!320 = !DIEnumerator(name: "EVT_GESTURE", value: 20496, isUnsigned: true)
!321 = !DIEnumerator(name: "EVT_FILESELECT", value: 20512, isUnsigned: true)
!322 = !DIEnumerator(name: "EVT_BUT_OPEN", value: 20513, isUnsigned: true)
!323 = !DIEnumerator(name: "EVT_MODAL_MAP", value: 20514, isUnsigned: true)
!324 = !DIEnumerator(name: "EVT_DROP", value: 20515, isUnsigned: true)
!325 = !DIEnumerator(name: "EVT_BUT_CANCEL", value: 20516, isUnsigned: true)
!326 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !126, line: 394, baseType: !5, size: 32, elements: !327)
!327 = !{!328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338}
!328 = !DIEnumerator(name: "GESTURE_MODAL_CANCEL", value: 1, isUnsigned: true)
!329 = !DIEnumerator(name: "GESTURE_MODAL_CONFIRM", value: 2, isUnsigned: true)
!330 = !DIEnumerator(name: "GESTURE_MODAL_SELECT", value: 3, isUnsigned: true)
!331 = !DIEnumerator(name: "GESTURE_MODAL_DESELECT", value: 4, isUnsigned: true)
!332 = !DIEnumerator(name: "GESTURE_MODAL_NOP", value: 5, isUnsigned: true)
!333 = !DIEnumerator(name: "GESTURE_MODAL_CIRCLE_ADD", value: 6, isUnsigned: true)
!334 = !DIEnumerator(name: "GESTURE_MODAL_CIRCLE_SUB", value: 7, isUnsigned: true)
!335 = !DIEnumerator(name: "GESTURE_MODAL_BEGIN", value: 8, isUnsigned: true)
!336 = !DIEnumerator(name: "GESTURE_MODAL_IN", value: 9, isUnsigned: true)
!337 = !DIEnumerator(name: "GESTURE_MODAL_OUT", value: 10, isUnsigned: true)
!338 = !DIEnumerator(name: "GESTURE_MODAL_CIRCLE_SIZE", value: 11, isUnsigned: true)
!339 = !{!340}
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!341 = !{i32 7, !"Dwarf Version", i32 4}
!342 = !{i32 2, !"Debug Info Version", i32 3}
!343 = !{i32 1, !"wchar_size", i32 4}
!344 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!345 = distinct !DISubprogram(name: "MESH_OT_bisect", scope: !1, file: !1, line: 318, type: !346, scopeLine: 319, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2142)
!346 = !DISubroutineType(types: !347)
!347 = !{null, !348}
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64)
!349 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmOperatorType", file: !350, line: 508, size: 1536, elements: !351)
!350 = !DIFile(filename: "blender/source/blender/windowmanager/WM_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!351 = !{!352, !356, !357, !358, !359, !2068, !2072, !2078, !2082, !2083, !2087, !2088, !2089, !2090, !2094, !2095, !2110, !2111, !2115, !2141}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !349, file: !350, line: 509, baseType: !353, size: 64)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!354 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !355)
!355 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !349, file: !350, line: 510, baseType: !353, size: 64, offset: 64)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "translation_context", scope: !349, file: !350, line: 511, baseType: !353, size: 64, offset: 128)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !349, file: !350, line: 512, baseType: !353, size: 64, offset: 192)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !349, file: !350, line: 518, baseType: !360, size: 64, offset: 256)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!361 = !DISubroutineType(types: !362)
!362 = !{!363, !364, !366}
!363 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!365 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !4, line: 44, flags: DIFlagFwdDecl)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!367 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmOperator", file: !106, line: 328, size: 1344, elements: !368)
!368 = !{!369, !370, !371, !375, !406, !407, !408, !409, !421, !2061, !2062, !2063, !2066, !2067}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !367, file: !106, line: 329, baseType: !366, size: 64)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !367, file: !106, line: 329, baseType: !366, size: 64, offset: 64)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !367, file: !106, line: 332, baseType: !372, size: 512, offset: 128)
!372 = !DICompositeType(tag: DW_TAG_array_type, baseType: !355, size: 512, elements: !373)
!373 = !{!374}
!374 = !DISubrange(count: 64)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !367, file: !106, line: 333, baseType: !376, size: 64, offset: 640)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !378, line: 75, baseType: !379)
!378 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!379 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !378, line: 62, size: 1024, elements: !380)
!380 = !{!381, !383, !384, !385, !386, !388, !389, !390, !404, !405}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !379, file: !378, line: 63, baseType: !382, size: 64)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !379, file: !378, line: 63, baseType: !382, size: 64, offset: 64)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !379, file: !378, line: 64, baseType: !355, size: 8, offset: 128)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !379, file: !378, line: 64, baseType: !355, size: 8, offset: 136)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !379, file: !378, line: 65, baseType: !387, size: 16, offset: 144)
!387 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !379, file: !378, line: 66, baseType: !372, size: 512, offset: 160)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !379, file: !378, line: 67, baseType: !363, size: 32, offset: 672)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !379, file: !378, line: 69, baseType: !391, size: 256, offset: 704)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !378, line: 60, baseType: !392)
!392 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !378, line: 48, size: 256, elements: !393)
!393 = !{!394, !395, !402, !403}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !392, file: !378, line: 49, baseType: !340, size: 64)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !392, file: !378, line: 58, baseType: !396, size: 128, offset: 64)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !397, line: 71, baseType: !398)
!397 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!398 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !397, line: 69, size: 128, elements: !399)
!399 = !{!400, !401}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !398, file: !397, line: 70, baseType: !340, size: 64)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !398, file: !397, line: 70, baseType: !340, size: 64, offset: 64)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !392, file: !378, line: 59, baseType: !363, size: 32, offset: 192)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !392, file: !378, line: 59, baseType: !363, size: 32, offset: 224)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !379, file: !378, line: 70, baseType: !363, size: 32, offset: 960)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !379, file: !378, line: 74, baseType: !363, size: 32, offset: 992)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !367, file: !106, line: 336, baseType: !348, size: 64, offset: 704)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !367, file: !106, line: 337, baseType: !340, size: 64, offset: 768)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "py_instance", scope: !367, file: !106, line: 338, baseType: !340, size: 64, offset: 832)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !367, file: !106, line: 340, baseType: !410, size: 64, offset: 896)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!411 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !4, line: 55, size: 192, elements: !412)
!412 = !{!413, !417, !420}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !411, file: !4, line: 58, baseType: !414, size: 64)
!414 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !411, file: !4, line: 56, size: 64, elements: !415)
!415 = !{!416}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !414, file: !4, line: 57, baseType: !340, size: 64)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !411, file: !4, line: 60, baseType: !418, size: 64, offset: 64)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!419 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !4, line: 41, flags: DIFlagFwdDecl)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !411, file: !4, line: 61, baseType: !340, size: 64, offset: 128)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "reports", scope: !367, file: !106, line: 341, baseType: !422, size: 64, offset: 960)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!423 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ReportList", file: !106, line: 106, size: 320, elements: !424)
!424 = !{!425, !426, !427, !428, !429, !430}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !423, file: !106, line: 107, baseType: !396, size: 128)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "printlevel", scope: !423, file: !106, line: 108, baseType: !363, size: 32, offset: 128)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "storelevel", scope: !423, file: !106, line: 109, baseType: !363, size: 32, offset: 160)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !423, file: !106, line: 110, baseType: !363, size: 32, offset: 192)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !423, file: !106, line: 110, baseType: !363, size: 32, offset: 224)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "reporttimer", scope: !423, file: !106, line: 111, baseType: !431, size: 64, offset: 256)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTimer", file: !350, line: 490, size: 768, elements: !433)
!433 = !{!434, !435, !436, !2052, !2053, !2054, !2055, !2056, !2057, !2058, !2059, !2060}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !432, file: !350, line: 491, baseType: !431, size: 64)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !432, file: !350, line: 491, baseType: !431, size: 64, offset: 64)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "win", scope: !432, file: !350, line: 493, baseType: !437, size: 64, offset: 128)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindow", file: !106, line: 169, size: 2048, elements: !439)
!439 = !{!440, !441, !442, !443, !1969, !1970, !1971, !1972, !1973, !1974, !1975, !1976, !1977, !1978, !1979, !1980, !1981, !1982, !1983, !1984, !1985, !1986, !2027, !2030, !2044, !2045, !2046, !2047, !2048, !2049, !2050, !2051}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !438, file: !106, line: 170, baseType: !437, size: 64)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !438, file: !106, line: 170, baseType: !437, size: 64, offset: 64)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "ghostwin", scope: !438, file: !106, line: 172, baseType: !340, size: 64, offset: 128)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !438, file: !106, line: 174, baseType: !444, size: 64, offset: 192)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!445 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !446, line: 49, size: 1984, elements: !447)
!446 = !DIFile(filename: "blender/source/blender/makesdna/DNA_screen_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!447 = !{!448, !484, !485, !486, !487, !488, !1952, !1953, !1954, !1955, !1956, !1957, !1958, !1959, !1960, !1961, !1962, !1963, !1964, !1965, !1966, !1967, !1968}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !445, file: !446, line: 50, baseType: !449, size: 960)
!449 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !378, line: 130, baseType: !450)
!450 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !378, line: 117, size: 960, elements: !451)
!451 = !{!452, !453, !454, !456, !475, !479, !480, !481, !482, !483}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !450, file: !378, line: 118, baseType: !340, size: 64)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !450, file: !378, line: 118, baseType: !340, size: 64, offset: 64)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !450, file: !378, line: 119, baseType: !455, size: 64, offset: 128)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !450, file: !378, line: 120, baseType: !457, size: 64, offset: 192)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !378, line: 136, size: 17600, elements: !459)
!459 = !{!460, !461, !463, !466, !470, !471, !472}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !458, file: !378, line: 137, baseType: !449, size: 960)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !458, file: !378, line: 138, baseType: !462, size: 64, offset: 960)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !458, file: !378, line: 139, baseType: !464, size: 64, offset: 1024)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!465 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !378, line: 43, flags: DIFlagFwdDecl)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !458, file: !378, line: 140, baseType: !467, size: 8192, offset: 1088)
!467 = !DICompositeType(tag: DW_TAG_array_type, baseType: !355, size: 8192, elements: !468)
!468 = !{!469}
!469 = !DISubrange(count: 1024)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !458, file: !378, line: 141, baseType: !467, size: 8192, offset: 9280)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !458, file: !378, line: 148, baseType: !457, size: 64, offset: 17472)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !458, file: !378, line: 150, baseType: !473, size: 64, offset: 17536)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64)
!474 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !378, line: 45, flags: DIFlagFwdDecl)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !450, file: !378, line: 121, baseType: !476, size: 528, offset: 256)
!476 = !DICompositeType(tag: DW_TAG_array_type, baseType: !355, size: 528, elements: !477)
!477 = !{!478}
!478 = !DISubrange(count: 66)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !450, file: !378, line: 126, baseType: !387, size: 16, offset: 784)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !450, file: !378, line: 127, baseType: !363, size: 32, offset: 800)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !450, file: !378, line: 128, baseType: !363, size: 32, offset: 832)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !450, file: !378, line: 128, baseType: !363, size: 32, offset: 864)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !450, file: !378, line: 129, baseType: !376, size: 64, offset: 896)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "vertbase", scope: !445, file: !446, line: 52, baseType: !396, size: 128, offset: 960)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "edgebase", scope: !445, file: !446, line: 53, baseType: !396, size: 128, offset: 1088)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "areabase", scope: !445, file: !446, line: 54, baseType: !396, size: 128, offset: 1216)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !445, file: !446, line: 55, baseType: !396, size: 128, offset: 1344)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !445, file: !446, line: 57, baseType: !489, size: 64, offset: 1472)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64)
!490 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !491, line: 1216, size: 39680, elements: !492)
!491 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!492 = !{!493, !494, !498, !790, !793, !794, !795, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !821, !892, !1320, !1536, !1539, !1827, !1839, !1840, !1841, !1842, !1843, !1844, !1845, !1846, !1849, !1850, !1851, !1852, !1853, !1861, !1928, !1935, !1936, !1943, !1944, !1945, !1946, !1947, !1948, !1949}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !490, file: !491, line: 1217, baseType: !449, size: 960)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !490, file: !491, line: 1218, baseType: !495, size: 64, offset: 960)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64)
!496 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !497, line: 45, flags: DIFlagFwdDecl)
!497 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!498 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !490, file: !491, line: 1220, baseType: !499, size: 64, offset: 1024)
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64)
!500 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !501, line: 115, size: 11392, elements: !502)
!501 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!502 = !{!503, !504, !505, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !522, !534, !548, !549, !592, !593, !596, !597, !613, !614, !615, !616, !617, !618, !619, !623, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !639, !640, !641, !642, !643, !644, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !704, !705, !706, !707, !708, !709, !710, !711, !712, !715, !718, !721, !722, !723, !724, !725, !728, !731, !734, !735, !741, !742, !743, !744, !745, !746, !748, !751, !754, !758, !778, !779}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !500, file: !501, line: 116, baseType: !449, size: 960)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !500, file: !501, line: 117, baseType: !495, size: 64, offset: 960)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !500, file: !501, line: 119, baseType: !506, size: 64, offset: 1024)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!507 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !501, line: 57, flags: DIFlagFwdDecl)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !500, file: !501, line: 121, baseType: !387, size: 16, offset: 1088)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !500, file: !501, line: 121, baseType: !387, size: 16, offset: 1104)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !500, file: !501, line: 122, baseType: !363, size: 32, offset: 1120)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !500, file: !501, line: 122, baseType: !363, size: 32, offset: 1152)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !500, file: !501, line: 122, baseType: !363, size: 32, offset: 1184)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !500, file: !501, line: 123, baseType: !372, size: 512, offset: 1216)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !500, file: !501, line: 124, baseType: !499, size: 64, offset: 1728)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !500, file: !501, line: 124, baseType: !499, size: 64, offset: 1792)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !500, file: !501, line: 127, baseType: !499, size: 64, offset: 1856)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !500, file: !501, line: 127, baseType: !499, size: 64, offset: 1920)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !500, file: !501, line: 127, baseType: !499, size: 64, offset: 1984)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !500, file: !501, line: 128, baseType: !520, size: 64, offset: 2048)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 64)
!521 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !497, line: 46, flags: DIFlagFwdDecl)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !500, file: !501, line: 130, baseType: !523, size: 64, offset: 2112)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 64)
!524 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !501, line: 97, size: 832, elements: !525)
!525 = !{!526, !532, !533}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !524, file: !501, line: 98, baseType: !527, size: 768)
!527 = !DICompositeType(tag: DW_TAG_array_type, baseType: !528, size: 768, elements: !529)
!528 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!529 = !{!530, !531}
!530 = !DISubrange(count: 8)
!531 = !DISubrange(count: 3)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !524, file: !501, line: 99, baseType: !363, size: 32, offset: 768)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !524, file: !501, line: 99, baseType: !363, size: 32, offset: 800)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !500, file: !501, line: 131, baseType: !535, size: 64, offset: 2176)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64)
!536 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !537, line: 486, size: 1600, elements: !538)
!537 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!538 = !{!539, !540, !541, !542, !543, !544, !545, !546, !547}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !536, file: !537, line: 487, baseType: !449, size: 960)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !536, file: !537, line: 489, baseType: !396, size: 128, offset: 960)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !536, file: !537, line: 490, baseType: !396, size: 128, offset: 1088)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !536, file: !537, line: 491, baseType: !396, size: 128, offset: 1216)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !536, file: !537, line: 492, baseType: !396, size: 128, offset: 1344)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !536, file: !537, line: 494, baseType: !363, size: 32, offset: 1472)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !536, file: !537, line: 495, baseType: !363, size: 32, offset: 1504)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !536, file: !537, line: 497, baseType: !363, size: 32, offset: 1536)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !536, file: !537, line: 498, baseType: !363, size: 32, offset: 1568)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !500, file: !501, line: 132, baseType: !535, size: 64, offset: 2240)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !500, file: !501, line: 133, baseType: !550, size: 64, offset: 2304)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64)
!551 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !537, line: 334, size: 1728, elements: !552)
!552 = !{!553, !554, !557, !558, !559, !560, !561, !562, !565, !566, !567, !568, !569, !570, !571, !591}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !551, file: !537, line: 335, baseType: !396, size: 128)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !551, file: !537, line: 336, baseType: !555, size: 64, offset: 128)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64)
!556 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !537, line: 47, flags: DIFlagFwdDecl)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !551, file: !537, line: 338, baseType: !387, size: 16, offset: 192)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !551, file: !537, line: 338, baseType: !387, size: 16, offset: 208)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !551, file: !537, line: 339, baseType: !5, size: 32, offset: 224)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !551, file: !537, line: 340, baseType: !363, size: 32, offset: 256)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !551, file: !537, line: 342, baseType: !528, size: 32, offset: 288)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !551, file: !537, line: 343, baseType: !563, size: 96, offset: 320)
!563 = !DICompositeType(tag: DW_TAG_array_type, baseType: !528, size: 96, elements: !564)
!564 = !{!531}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !551, file: !537, line: 344, baseType: !563, size: 96, offset: 416)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !551, file: !537, line: 347, baseType: !396, size: 128, offset: 512)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !551, file: !537, line: 349, baseType: !363, size: 32, offset: 640)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !551, file: !537, line: 350, baseType: !363, size: 32, offset: 672)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !551, file: !537, line: 351, baseType: !340, size: 64, offset: 704)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !551, file: !537, line: 352, baseType: !340, size: 64, offset: 768)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !551, file: !537, line: 354, baseType: !572, size: 384, offset: 832)
!572 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !537, line: 116, baseType: !573)
!573 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !537, line: 94, size: 384, elements: !574)
!574 = !{!575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !573, file: !537, line: 96, baseType: !363, size: 32)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !573, file: !537, line: 96, baseType: !363, size: 32, offset: 32)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !573, file: !537, line: 97, baseType: !363, size: 32, offset: 64)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !573, file: !537, line: 97, baseType: !363, size: 32, offset: 96)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !573, file: !537, line: 99, baseType: !387, size: 16, offset: 128)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !573, file: !537, line: 100, baseType: !387, size: 16, offset: 144)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !573, file: !537, line: 102, baseType: !387, size: 16, offset: 160)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !573, file: !537, line: 105, baseType: !387, size: 16, offset: 176)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !573, file: !537, line: 108, baseType: !387, size: 16, offset: 192)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !573, file: !537, line: 109, baseType: !387, size: 16, offset: 208)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !573, file: !537, line: 111, baseType: !387, size: 16, offset: 224)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !573, file: !537, line: 112, baseType: !387, size: 16, offset: 240)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !573, file: !537, line: 114, baseType: !363, size: 32, offset: 256)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !573, file: !537, line: 114, baseType: !363, size: 32, offset: 288)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !573, file: !537, line: 115, baseType: !363, size: 32, offset: 320)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !573, file: !537, line: 115, baseType: !363, size: 32, offset: 352)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !551, file: !537, line: 355, baseType: !372, size: 512, offset: 1216)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !500, file: !501, line: 134, baseType: !340, size: 64, offset: 2368)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !500, file: !501, line: 136, baseType: !594, size: 64, offset: 2432)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 64)
!595 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !501, line: 58, flags: DIFlagFwdDecl)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !500, file: !501, line: 138, baseType: !572, size: 384, offset: 2496)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !500, file: !501, line: 139, baseType: !598, size: 64, offset: 2880)
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !599, size: 64)
!599 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !537, line: 80, baseType: !600)
!600 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !537, line: 72, size: 192, elements: !601)
!601 = !{!602, !609, !610, !611, !612}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !600, file: !537, line: 73, baseType: !603, size: 64)
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 64)
!604 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !537, line: 59, baseType: !605)
!605 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !537, line: 56, size: 128, elements: !606)
!606 = !{!607, !608}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !605, file: !537, line: 57, baseType: !563, size: 96)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !605, file: !537, line: 58, baseType: !363, size: 32, offset: 96)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !600, file: !537, line: 74, baseType: !363, size: 32, offset: 64)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !600, file: !537, line: 76, baseType: !363, size: 32, offset: 96)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !600, file: !537, line: 77, baseType: !363, size: 32, offset: 128)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !600, file: !537, line: 79, baseType: !363, size: 32, offset: 160)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !500, file: !501, line: 141, baseType: !396, size: 128, offset: 2944)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !500, file: !501, line: 142, baseType: !396, size: 128, offset: 3072)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !500, file: !501, line: 143, baseType: !396, size: 128, offset: 3200)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !500, file: !501, line: 144, baseType: !396, size: 128, offset: 3328)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !500, file: !501, line: 146, baseType: !363, size: 32, offset: 3456)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !500, file: !501, line: 147, baseType: !363, size: 32, offset: 3488)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !500, file: !501, line: 150, baseType: !620, size: 64, offset: 3520)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 64)
!622 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !501, line: 50, flags: DIFlagFwdDecl)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !500, file: !501, line: 151, baseType: !624, size: 64, offset: 3584)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !500, file: !501, line: 152, baseType: !363, size: 32, offset: 3648)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !500, file: !501, line: 153, baseType: !363, size: 32, offset: 3680)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !500, file: !501, line: 156, baseType: !563, size: 96, offset: 3712)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !500, file: !501, line: 156, baseType: !563, size: 96, offset: 3808)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !500, file: !501, line: 156, baseType: !563, size: 96, offset: 3904)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !500, file: !501, line: 157, baseType: !563, size: 96, offset: 4000)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !500, file: !501, line: 158, baseType: !563, size: 96, offset: 4096)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !500, file: !501, line: 159, baseType: !563, size: 96, offset: 4192)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !500, file: !501, line: 160, baseType: !563, size: 96, offset: 4288)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !500, file: !501, line: 160, baseType: !563, size: 96, offset: 4384)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !500, file: !501, line: 161, baseType: !636, size: 128, offset: 4480)
!636 = !DICompositeType(tag: DW_TAG_array_type, baseType: !528, size: 128, elements: !637)
!637 = !{!638}
!638 = !DISubrange(count: 4)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !500, file: !501, line: 161, baseType: !636, size: 128, offset: 4608)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !500, file: !501, line: 162, baseType: !563, size: 96, offset: 4736)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !500, file: !501, line: 162, baseType: !563, size: 96, offset: 4832)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !500, file: !501, line: 163, baseType: !528, size: 32, offset: 4928)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !500, file: !501, line: 163, baseType: !528, size: 32, offset: 4960)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !500, file: !501, line: 164, baseType: !645, size: 512, offset: 4992)
!645 = !DICompositeType(tag: DW_TAG_array_type, baseType: !528, size: 512, elements: !646)
!646 = !{!638, !638}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !500, file: !501, line: 165, baseType: !645, size: 512, offset: 5504)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !500, file: !501, line: 166, baseType: !645, size: 512, offset: 6016)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !500, file: !501, line: 167, baseType: !645, size: 512, offset: 6528)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !500, file: !501, line: 176, baseType: !645, size: 512, offset: 7040)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !500, file: !501, line: 178, baseType: !5, size: 32, offset: 7552)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !500, file: !501, line: 180, baseType: !387, size: 16, offset: 7584)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !500, file: !501, line: 181, baseType: !387, size: 16, offset: 7600)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !500, file: !501, line: 183, baseType: !387, size: 16, offset: 7616)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !500, file: !501, line: 183, baseType: !387, size: 16, offset: 7632)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !500, file: !501, line: 184, baseType: !387, size: 16, offset: 7648)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !500, file: !501, line: 184, baseType: !387, size: 16, offset: 7664)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !500, file: !501, line: 185, baseType: !387, size: 16, offset: 7680)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !500, file: !501, line: 186, baseType: !387, size: 16, offset: 7696)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !500, file: !501, line: 187, baseType: !387, size: 16, offset: 7712)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !500, file: !501, line: 188, baseType: !355, size: 8, offset: 7728)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !500, file: !501, line: 189, baseType: !355, size: 8, offset: 7736)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !500, file: !501, line: 192, baseType: !363, size: 32, offset: 7744)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !500, file: !501, line: 192, baseType: !363, size: 32, offset: 7776)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !500, file: !501, line: 192, baseType: !363, size: 32, offset: 7808)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !500, file: !501, line: 192, baseType: !363, size: 32, offset: 7840)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !500, file: !501, line: 194, baseType: !363, size: 32, offset: 7872)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !500, file: !501, line: 202, baseType: !528, size: 32, offset: 7904)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !500, file: !501, line: 202, baseType: !528, size: 32, offset: 7936)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !500, file: !501, line: 202, baseType: !528, size: 32, offset: 7968)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !500, file: !501, line: 211, baseType: !528, size: 32, offset: 8000)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !500, file: !501, line: 212, baseType: !528, size: 32, offset: 8032)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !500, file: !501, line: 213, baseType: !528, size: 32, offset: 8064)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !500, file: !501, line: 214, baseType: !528, size: 32, offset: 8096)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !500, file: !501, line: 215, baseType: !528, size: 32, offset: 8128)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !500, file: !501, line: 216, baseType: !528, size: 32, offset: 8160)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !500, file: !501, line: 219, baseType: !528, size: 32, offset: 8192)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !500, file: !501, line: 220, baseType: !528, size: 32, offset: 8224)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !500, file: !501, line: 221, baseType: !528, size: 32, offset: 8256)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !500, file: !501, line: 224, baseType: !681, size: 16, offset: 8288)
!681 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !500, file: !501, line: 224, baseType: !681, size: 16, offset: 8304)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !500, file: !501, line: 226, baseType: !387, size: 16, offset: 8320)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !500, file: !501, line: 228, baseType: !355, size: 8, offset: 8336)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !500, file: !501, line: 229, baseType: !355, size: 8, offset: 8344)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !500, file: !501, line: 231, baseType: !387, size: 16, offset: 8352)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !500, file: !501, line: 232, baseType: !355, size: 8, offset: 8368)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !500, file: !501, line: 233, baseType: !355, size: 8, offset: 8376)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !500, file: !501, line: 234, baseType: !528, size: 32, offset: 8384)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !500, file: !501, line: 235, baseType: !528, size: 32, offset: 8416)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !500, file: !501, line: 237, baseType: !396, size: 128, offset: 8448)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !500, file: !501, line: 238, baseType: !396, size: 128, offset: 8576)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !500, file: !501, line: 239, baseType: !396, size: 128, offset: 8704)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !500, file: !501, line: 240, baseType: !396, size: 128, offset: 8832)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !500, file: !501, line: 242, baseType: !528, size: 32, offset: 8960)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !500, file: !501, line: 244, baseType: !387, size: 16, offset: 8992)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !500, file: !501, line: 245, baseType: !681, size: 16, offset: 9008)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !500, file: !501, line: 246, baseType: !636, size: 128, offset: 9024)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !500, file: !501, line: 248, baseType: !363, size: 32, offset: 9152)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !500, file: !501, line: 249, baseType: !363, size: 32, offset: 9184)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !500, file: !501, line: 251, baseType: !702, size: 64, offset: 9216)
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !703, size: 64)
!703 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !501, line: 251, flags: DIFlagFwdDecl)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !500, file: !501, line: 253, baseType: !355, size: 8, offset: 9280)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !500, file: !501, line: 254, baseType: !355, size: 8, offset: 9288)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !500, file: !501, line: 255, baseType: !387, size: 16, offset: 9296)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !500, file: !501, line: 256, baseType: !563, size: 96, offset: 9312)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !500, file: !501, line: 258, baseType: !396, size: 128, offset: 9408)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !500, file: !501, line: 259, baseType: !396, size: 128, offset: 9536)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !500, file: !501, line: 260, baseType: !396, size: 128, offset: 9664)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !500, file: !501, line: 261, baseType: !396, size: 128, offset: 9792)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !500, file: !501, line: 263, baseType: !713, size: 64, offset: 9920)
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !714, size: 64)
!714 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !501, line: 52, flags: DIFlagFwdDecl)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !500, file: !501, line: 264, baseType: !716, size: 64, offset: 9984)
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 64)
!717 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !501, line: 53, flags: DIFlagFwdDecl)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !500, file: !501, line: 265, baseType: !719, size: 64, offset: 10048)
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 64)
!720 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !537, line: 46, flags: DIFlagFwdDecl)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !500, file: !501, line: 267, baseType: !355, size: 8, offset: 10112)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !500, file: !501, line: 268, baseType: !355, size: 8, offset: 10120)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !500, file: !501, line: 269, baseType: !387, size: 16, offset: 10128)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !500, file: !501, line: 270, baseType: !528, size: 32, offset: 10144)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !500, file: !501, line: 272, baseType: !726, size: 64, offset: 10176)
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 64)
!727 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !501, line: 54, flags: DIFlagFwdDecl)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !500, file: !501, line: 275, baseType: !729, size: 64, offset: 10240)
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64)
!730 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !501, line: 275, flags: DIFlagFwdDecl)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !500, file: !501, line: 277, baseType: !732, size: 64, offset: 10304)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 64)
!733 = !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !501, line: 56, flags: DIFlagFwdDecl)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !500, file: !501, line: 277, baseType: !732, size: 64, offset: 10368)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !500, file: !501, line: 278, baseType: !736, size: 64, offset: 10432)
!736 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !737, line: 27, baseType: !738)
!737 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!738 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !739, line: 45, baseType: !740)
!739 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!740 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_mask", scope: !500, file: !501, line: 279, baseType: !736, size: 64, offset: 10496)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !500, file: !501, line: 280, baseType: !5, size: 32, offset: 10560)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !500, file: !501, line: 281, baseType: !5, size: 32, offset: 10592)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "gpulamp", scope: !500, file: !501, line: 283, baseType: !396, size: 128, offset: 10624)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "pc_ids", scope: !500, file: !501, line: 284, baseType: !396, size: 128, offset: 10752)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "duplilist", scope: !500, file: !501, line: 285, baseType: !747, size: 64, offset: 10880)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_object", scope: !500, file: !501, line: 287, baseType: !749, size: 64, offset: 10944)
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 64)
!750 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyOb", file: !501, line: 59, flags: DIFlagFwdDecl)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_constraint", scope: !500, file: !501, line: 288, baseType: !752, size: 64, offset: 11008)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 64)
!753 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyCon", file: !501, line: 288, flags: DIFlagFwdDecl)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "ima_ofs", scope: !500, file: !501, line: 290, baseType: !755, size: 64, offset: 11072)
!755 = !DICompositeType(tag: DW_TAG_array_type, baseType: !528, size: 64, elements: !756)
!756 = !{!757}
!757 = !DISubrange(count: 2)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !500, file: !501, line: 291, baseType: !759, size: 64, offset: 11136)
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !760, size: 64)
!760 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageUser", file: !761, line: 65, baseType: !762)
!761 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!762 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !761, line: 50, size: 320, elements: !763)
!763 = !{!764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !762, file: !761, line: 51, baseType: !489, size: 64)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !762, file: !761, line: 53, baseType: !363, size: 32, offset: 64)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !762, file: !761, line: 54, baseType: !363, size: 32, offset: 96)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !762, file: !761, line: 55, baseType: !363, size: 32, offset: 128)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !762, file: !761, line: 55, baseType: !363, size: 32, offset: 160)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !762, file: !761, line: 56, baseType: !355, size: 8, offset: 192)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "cycl", scope: !762, file: !761, line: 56, baseType: !355, size: 8, offset: 200)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !762, file: !761, line: 57, baseType: !355, size: 8, offset: 208)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !762, file: !761, line: 57, baseType: !355, size: 8, offset: 216)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "multi_index", scope: !762, file: !761, line: 59, baseType: !387, size: 16, offset: 224)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !762, file: !761, line: 59, baseType: !387, size: 16, offset: 240)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !762, file: !761, line: 59, baseType: !387, size: 16, offset: 256)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !762, file: !761, line: 61, baseType: !387, size: 16, offset: 272)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !762, file: !761, line: 63, baseType: !363, size: 32, offset: 288)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "lodlevels", scope: !500, file: !501, line: 293, baseType: !396, size: 128, offset: 11200)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "currentlod", scope: !500, file: !501, line: 294, baseType: !780, size: 64, offset: 11328)
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 64)
!781 = !DIDerivedType(tag: DW_TAG_typedef, name: "LodLevel", file: !501, line: 113, baseType: !782)
!782 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LodLevel", file: !501, line: 108, size: 256, elements: !783)
!783 = !{!784, !786, !787, !788, !789}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !782, file: !501, line: 109, baseType: !785, size: 64)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !782, size: 64)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !782, file: !501, line: 109, baseType: !785, size: 64, offset: 64)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !782, file: !501, line: 110, baseType: !499, size: 64, offset: 128)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !782, file: !501, line: 111, baseType: !363, size: 32, offset: 192)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "distance", scope: !782, file: !501, line: 112, baseType: !528, size: 32, offset: 224)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !490, file: !491, line: 1221, baseType: !791, size: 64, offset: 1088)
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 64)
!792 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !491, line: 52, flags: DIFlagFwdDecl)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !490, file: !491, line: 1223, baseType: !489, size: 64, offset: 1152)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !490, file: !491, line: 1225, baseType: !396, size: 128, offset: 1216)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !490, file: !491, line: 1226, baseType: !796, size: 64, offset: 1344)
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !797, size: 64)
!797 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !491, line: 69, size: 320, elements: !798)
!798 = !{!799, !800, !801, !802, !803, !804, !805, !806}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !797, file: !491, line: 70, baseType: !796, size: 64)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !797, file: !491, line: 70, baseType: !796, size: 64, offset: 64)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !797, file: !491, line: 71, baseType: !5, size: 32, offset: 128)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !797, file: !491, line: 71, baseType: !5, size: 32, offset: 160)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !797, file: !491, line: 72, baseType: !363, size: 32, offset: 192)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !797, file: !491, line: 73, baseType: !387, size: 16, offset: 224)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !797, file: !491, line: 73, baseType: !387, size: 16, offset: 240)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !797, file: !491, line: 74, baseType: !499, size: 64, offset: 256)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !490, file: !491, line: 1227, baseType: !499, size: 64, offset: 1408)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !490, file: !491, line: 1229, baseType: !563, size: 96, offset: 1472)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !490, file: !491, line: 1230, baseType: !563, size: 96, offset: 1568)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !490, file: !491, line: 1231, baseType: !563, size: 96, offset: 1664)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !490, file: !491, line: 1231, baseType: !563, size: 96, offset: 1760)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !490, file: !491, line: 1233, baseType: !5, size: 32, offset: 1856)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !490, file: !491, line: 1234, baseType: !363, size: 32, offset: 1888)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !490, file: !491, line: 1235, baseType: !5, size: 32, offset: 1920)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !490, file: !491, line: 1237, baseType: !387, size: 16, offset: 1952)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !490, file: !491, line: 1239, baseType: !355, size: 8, offset: 1968)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !490, file: !491, line: 1240, baseType: !818, size: 8, offset: 1976)
!818 = !DICompositeType(tag: DW_TAG_array_type, baseType: !355, size: 8, elements: !819)
!819 = !{!820}
!820 = !DISubrange(count: 1)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !490, file: !491, line: 1242, baseType: !822, size: 64, offset: 1984)
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !823, size: 64)
!823 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !824, line: 328, size: 3456, elements: !825)
!824 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!825 = !{!826, !827, !828, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !858, !859, !860, !863, !868, !869, !872, !876, !880, !884, !888, !889, !890, !891}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !823, file: !824, line: 329, baseType: !449, size: 960)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !823, file: !824, line: 330, baseType: !495, size: 64, offset: 960)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !823, file: !824, line: 332, baseType: !829, size: 64, offset: 1024)
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 64)
!830 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !824, line: 332, flags: DIFlagFwdDecl)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !823, file: !824, line: 333, baseType: !372, size: 512, offset: 1088)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "interface_type", scope: !823, file: !824, line: 335, baseType: !418, size: 64, offset: 1600)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !823, file: !824, line: 337, baseType: !594, size: 64, offset: 1664)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "view_center", scope: !823, file: !824, line: 338, baseType: !755, size: 64, offset: 1728)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !823, file: !824, line: 340, baseType: !396, size: 128, offset: 1792)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !823, file: !824, line: 340, baseType: !396, size: 128, offset: 1920)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !823, file: !824, line: 342, baseType: !363, size: 32, offset: 2048)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !823, file: !824, line: 342, baseType: !363, size: 32, offset: 2080)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "cur_index", scope: !823, file: !824, line: 343, baseType: !363, size: 32, offset: 2112)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !823, file: !824, line: 345, baseType: !363, size: 32, offset: 2144)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !823, file: !824, line: 346, baseType: !363, size: 32, offset: 2176)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "is_updating", scope: !823, file: !824, line: 347, baseType: !387, size: 16, offset: 2208)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !823, file: !824, line: 348, baseType: !387, size: 16, offset: 2224)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !823, file: !824, line: 349, baseType: !363, size: 32, offset: 2240)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "nodetype", scope: !823, file: !824, line: 351, baseType: !363, size: 32, offset: 2272)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "edit_quality", scope: !823, file: !824, line: 353, baseType: !387, size: 16, offset: 2304)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "render_quality", scope: !823, file: !824, line: 354, baseType: !387, size: 16, offset: 2320)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "chunksize", scope: !823, file: !824, line: 355, baseType: !363, size: 32, offset: 2336)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "viewer_border", scope: !823, file: !824, line: 357, baseType: !850, size: 128, offset: 2368)
!850 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !851, line: 95, baseType: !852)
!851 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!852 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !851, line: 92, size: 128, elements: !853)
!853 = !{!854, !855, !856, !857}
!854 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !852, file: !851, line: 93, baseType: !528, size: 32)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !852, file: !851, line: 93, baseType: !528, size: 32, offset: 32)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !852, file: !851, line: 94, baseType: !528, size: 32, offset: 64)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !852, file: !851, line: 94, baseType: !528, size: 32, offset: 96)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !823, file: !824, line: 363, baseType: !396, size: 128, offset: 2496)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !823, file: !824, line: 363, baseType: !396, size: 128, offset: 2624)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "previews", scope: !823, file: !824, line: 368, baseType: !861, size: 64, offset: 2752)
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !862, size: 64)
!862 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHash", file: !824, line: 48, flags: DIFlagFwdDecl)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "active_viewer_key", scope: !823, file: !824, line: 372, baseType: !864, size: 32, offset: 2816)
!864 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !824, line: 274, baseType: !865)
!865 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !824, line: 271, size: 32, elements: !866)
!866 = !{!867}
!867 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !865, file: !824, line: 273, baseType: !5, size: 32)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !823, file: !824, line: 373, baseType: !363, size: 32, offset: 2848)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "execdata", scope: !823, file: !824, line: 382, baseType: !870, size: 64, offset: 2880)
!870 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !871, size: 64)
!871 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeExec", file: !824, line: 46, flags: DIFlagFwdDecl)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !823, file: !824, line: 385, baseType: !873, size: 64, offset: 2944)
!873 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !874, size: 64)
!874 = !DISubroutineType(types: !875)
!875 = !{null, !340, !528}
!876 = !DIDerivedType(tag: DW_TAG_member, name: "stats_draw", scope: !823, file: !824, line: 386, baseType: !877, size: 64, offset: 3008)
!877 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !878, size: 64)
!878 = !DISubroutineType(types: !879)
!879 = !{null, !340, !624}
!880 = !DIDerivedType(tag: DW_TAG_member, name: "test_break", scope: !823, file: !824, line: 387, baseType: !881, size: 64, offset: 3072)
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !882, size: 64)
!882 = !DISubroutineType(types: !883)
!883 = !{!363, !340}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "update_draw", scope: !823, file: !824, line: 388, baseType: !885, size: 64, offset: 3136)
!885 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !886, size: 64)
!886 = !DISubroutineType(types: !887)
!887 = !{null, !340}
!888 = !DIDerivedType(tag: DW_TAG_member, name: "tbh", scope: !823, file: !824, line: 389, baseType: !340, size: 64, offset: 3200)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "prh", scope: !823, file: !824, line: 389, baseType: !340, size: 64, offset: 3264)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "sdh", scope: !823, file: !824, line: 389, baseType: !340, size: 64, offset: 3328)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "udh", scope: !823, file: !824, line: 389, baseType: !340, size: 64, offset: 3392)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !490, file: !491, line: 1244, baseType: !893, size: 64, offset: 2048)
!893 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !894, size: 64)
!894 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !895, line: 200, size: 17024, elements: !896)
!895 = !DIFile(filename: "blender/source/blender/makesdna/DNA_sequence_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!896 = !{!897, !898, !899, !900, !1313, !1314, !1315, !1316, !1317, !1318, !1319}
!897 = !DIDerivedType(tag: DW_TAG_member, name: "seqbasep", scope: !894, file: !895, line: 201, baseType: !747, size: 64)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !894, file: !895, line: 202, baseType: !396, size: 128, offset: 64)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "metastack", scope: !894, file: !895, line: 203, baseType: !396, size: 128, offset: 192)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "act_seq", scope: !894, file: !895, line: 206, baseType: !901, size: 64, offset: 320)
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !902, size: 64)
!902 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sequence", file: !895, line: 190, baseType: !903)
!903 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sequence", file: !895, line: 126, size: 2816, elements: !904)
!904 = !{!905, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !1003, !1004, !1005, !1006, !1284, !1288, !1289, !1290, !1291, !1292, !1293, !1294, !1295, !1298, !1299, !1300, !1301, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1309, !1310, !1312}
!905 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !903, file: !895, line: 127, baseType: !906, size: 64)
!906 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !903, size: 64)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !903, file: !895, line: 127, baseType: !906, size: 64, offset: 64)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !903, file: !895, line: 128, baseType: !340, size: 64, offset: 128)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !903, file: !895, line: 129, baseType: !340, size: 64, offset: 192)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !903, file: !895, line: 130, baseType: !372, size: 512, offset: 256)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !903, file: !895, line: 132, baseType: !363, size: 32, offset: 768)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !903, file: !895, line: 132, baseType: !363, size: 32, offset: 800)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !903, file: !895, line: 133, baseType: !363, size: 32, offset: 832)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !903, file: !895, line: 134, baseType: !363, size: 32, offset: 864)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "startofs", scope: !903, file: !895, line: 134, baseType: !363, size: 32, offset: 896)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "endofs", scope: !903, file: !895, line: 134, baseType: !363, size: 32, offset: 928)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !903, file: !895, line: 135, baseType: !363, size: 32, offset: 960)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !903, file: !895, line: 135, baseType: !363, size: 32, offset: 992)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !903, file: !895, line: 136, baseType: !363, size: 32, offset: 1024)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !903, file: !895, line: 136, baseType: !363, size: 32, offset: 1056)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "startdisp", scope: !903, file: !895, line: 137, baseType: !363, size: 32, offset: 1088)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "enddisp", scope: !903, file: !895, line: 137, baseType: !363, size: 32, offset: 1120)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "sat", scope: !903, file: !895, line: 138, baseType: !528, size: 32, offset: 1152)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "mul", scope: !903, file: !895, line: 139, baseType: !528, size: 32, offset: 1184)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "handsize", scope: !903, file: !895, line: 139, baseType: !528, size: 32, offset: 1216)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "anim_preseek", scope: !903, file: !895, line: 141, baseType: !387, size: 16, offset: 1248)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "streamindex", scope: !903, file: !895, line: 142, baseType: !387, size: 16, offset: 1264)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "multicam_source", scope: !903, file: !895, line: 143, baseType: !363, size: 32, offset: 1280)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "clip_flag", scope: !903, file: !895, line: 144, baseType: !363, size: 32, offset: 1312)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "strip", scope: !903, file: !895, line: 146, baseType: !931, size: 64, offset: 1344)
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 64)
!932 = !DIDerivedType(tag: DW_TAG_typedef, name: "Strip", file: !895, line: 114, baseType: !933)
!933 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Strip", file: !895, line: 99, size: 7232, elements: !934)
!934 = !{!935, !937, !938, !939, !940, !941, !942, !953, !957, !971, !980, !987, !997}
!935 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !933, file: !895, line: 100, baseType: !936, size: 64)
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 64)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !933, file: !895, line: 100, baseType: !936, size: 64, offset: 64)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !933, file: !895, line: 101, baseType: !363, size: 32, offset: 128)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !933, file: !895, line: 101, baseType: !363, size: 32, offset: 160)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !933, file: !895, line: 102, baseType: !363, size: 32, offset: 192)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !933, file: !895, line: 102, baseType: !363, size: 32, offset: 224)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "stripdata", scope: !933, file: !895, line: 103, baseType: !943, size: 64, offset: 256)
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 64)
!944 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripElem", file: !895, line: 59, baseType: !945)
!945 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripElem", file: !895, line: 56, size: 2112, elements: !946)
!946 = !{!947, !951, !952}
!947 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !945, file: !895, line: 57, baseType: !948, size: 2048)
!948 = !DICompositeType(tag: DW_TAG_array_type, baseType: !355, size: 2048, elements: !949)
!949 = !{!950}
!950 = !DISubrange(count: 256)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "orig_width", scope: !945, file: !895, line: 58, baseType: !363, size: 32, offset: 2048)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "orig_height", scope: !945, file: !895, line: 58, baseType: !363, size: 32, offset: 2080)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !933, file: !895, line: 106, baseType: !954, size: 6144, offset: 320)
!954 = !DICompositeType(tag: DW_TAG_array_type, baseType: !355, size: 6144, elements: !955)
!955 = !{!956}
!956 = !DISubrange(count: 768)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !933, file: !895, line: 107, baseType: !958, size: 64, offset: 6464)
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64)
!959 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripProxy", file: !895, line: 97, baseType: !960)
!960 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripProxy", file: !895, line: 83, size: 8320, elements: !961)
!961 = !{!962, !963, !964, !967, !968, !969, !970}
!962 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !960, file: !895, line: 84, baseType: !954, size: 6144)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !960, file: !895, line: 87, baseType: !948, size: 2048, offset: 6144)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !960, file: !895, line: 88, baseType: !965, size: 64, offset: 8192)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64)
!966 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !761, line: 41, flags: DIFlagFwdDecl)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !960, file: !895, line: 90, baseType: !387, size: 16, offset: 8256)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !960, file: !895, line: 92, baseType: !387, size: 16, offset: 8272)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flags", scope: !960, file: !895, line: 93, baseType: !387, size: 16, offset: 8288)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flags", scope: !960, file: !895, line: 95, baseType: !387, size: 16, offset: 8304)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !933, file: !895, line: 108, baseType: !972, size: 64, offset: 6528)
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 64)
!973 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripCrop", file: !895, line: 66, baseType: !974)
!974 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripCrop", file: !895, line: 61, size: 128, elements: !975)
!975 = !{!976, !977, !978, !979}
!976 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !974, file: !895, line: 62, baseType: !363, size: 32)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !974, file: !895, line: 63, baseType: !363, size: 32, offset: 32)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !974, file: !895, line: 64, baseType: !363, size: 32, offset: 64)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !974, file: !895, line: 65, baseType: !363, size: 32, offset: 96)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !933, file: !895, line: 109, baseType: !981, size: 64, offset: 6592)
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 64)
!982 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripTransform", file: !895, line: 71, baseType: !983)
!983 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripTransform", file: !895, line: 68, size: 64, elements: !984)
!984 = !{!985, !986}
!985 = !DIDerivedType(tag: DW_TAG_member, name: "xofs", scope: !983, file: !895, line: 69, baseType: !363, size: 32)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "yofs", scope: !983, file: !895, line: 70, baseType: !363, size: 32, offset: 32)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "color_balance", scope: !933, file: !895, line: 110, baseType: !988, size: 64, offset: 6656)
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 64)
!989 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripColorBalance", file: !895, line: 81, baseType: !990)
!990 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripColorBalance", file: !895, line: 73, size: 352, elements: !991)
!991 = !{!992, !993, !994, !995, !996}
!992 = !DIDerivedType(tag: DW_TAG_member, name: "lift", scope: !990, file: !895, line: 74, baseType: !563, size: 96)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !990, file: !895, line: 75, baseType: !563, size: 96, offset: 96)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "gain", scope: !990, file: !895, line: 76, baseType: !563, size: 96, offset: 192)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !990, file: !895, line: 77, baseType: !363, size: 32, offset: 288)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !990, file: !895, line: 78, baseType: !363, size: 32, offset: 320)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !933, file: !895, line: 113, baseType: !998, size: 512, offset: 6720)
!998 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !999, line: 182, baseType: !1000)
!999 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1000 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !999, line: 180, size: 512, elements: !1001)
!1001 = !{!1002}
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1000, file: !999, line: 181, baseType: !372, size: 512)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !903, file: !895, line: 148, baseType: !520, size: 64, offset: 1408)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !903, file: !895, line: 151, baseType: !489, size: 64, offset: 1472)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "scene_camera", scope: !903, file: !895, line: 152, baseType: !499, size: 64, offset: 1536)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "clip", scope: !903, file: !895, line: 153, baseType: !1007, size: 64, offset: 1600)
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1008, size: 64)
!1008 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClip", file: !1009, line: 64, size: 19136, elements: !1010)
!1009 = !DIFile(filename: "blender/source/blender/makesdna/DNA_movieclip_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1010 = !{!1011, !1012, !1013, !1014, !1015, !1016, !1018, !1019, !1020, !1021, !1024, !1025, !1270, !1271, !1279, !1280, !1281, !1282, !1283}
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1008, file: !1009, line: 65, baseType: !449, size: 960)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1008, file: !1009, line: 66, baseType: !495, size: 64, offset: 960)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1008, file: !1009, line: 68, baseType: !467, size: 8192, offset: 1024)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !1008, file: !1009, line: 70, baseType: !363, size: 32, offset: 9216)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !1008, file: !1009, line: 71, baseType: !363, size: 32, offset: 9248)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "lastsize", scope: !1008, file: !1009, line: 72, baseType: !1017, size: 64, offset: 9280)
!1017 = !DICompositeType(tag: DW_TAG_array_type, baseType: !363, size: 64, elements: !756)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !1008, file: !1009, line: 74, baseType: !528, size: 32, offset: 9344)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !1008, file: !1009, line: 74, baseType: !528, size: 32, offset: 9376)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !1008, file: !1009, line: 76, baseType: !965, size: 64, offset: 9408)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !1008, file: !1009, line: 77, baseType: !1022, size: 64, offset: 9472)
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 64)
!1023 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipCache", file: !1009, line: 77, flags: DIFlagFwdDecl)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !1008, file: !1009, line: 78, baseType: !594, size: 64, offset: 9536)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "tracking", scope: !1008, file: !1009, line: 80, baseType: !1026, size: 2624, offset: 9600)
!1026 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTracking", file: !1027, line: 340, size: 2624, elements: !1028)
!1027 = !DIFile(filename: "blender/source/blender/makesdna/DNA_tracking_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1028 = !{!1029, !1057, !1075, !1076, !1077, !1092, !1150, !1151, !1250, !1251, !1252, !1253, !1259}
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "settings", scope: !1026, file: !1027, line: 341, baseType: !1030, size: 576)
!1030 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingSettings", file: !1027, line: 251, baseType: !1031)
!1031 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingSettings", file: !1027, line: 207, size: 576, elements: !1032)
!1032 = !{!1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056}
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1031, file: !1027, line: 208, baseType: !363, size: 32)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "default_motion_model", scope: !1031, file: !1027, line: 211, baseType: !387, size: 16, offset: 32)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "default_algorithm_flag", scope: !1031, file: !1027, line: 212, baseType: !387, size: 16, offset: 48)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "default_minimum_correlation", scope: !1031, file: !1027, line: 213, baseType: !528, size: 32, offset: 64)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_size", scope: !1031, file: !1027, line: 214, baseType: !387, size: 16, offset: 96)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "default_search_size", scope: !1031, file: !1027, line: 215, baseType: !387, size: 16, offset: 112)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "default_frames_limit", scope: !1031, file: !1027, line: 216, baseType: !387, size: 16, offset: 128)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "default_margin", scope: !1031, file: !1027, line: 217, baseType: !387, size: 16, offset: 144)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_match", scope: !1031, file: !1027, line: 218, baseType: !387, size: 16, offset: 160)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "default_flag", scope: !1031, file: !1027, line: 219, baseType: !387, size: 16, offset: 176)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "default_weight", scope: !1031, file: !1027, line: 220, baseType: !528, size: 32, offset: 192)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "motion_flag", scope: !1031, file: !1027, line: 222, baseType: !387, size: 16, offset: 224)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "speed", scope: !1031, file: !1027, line: 225, baseType: !387, size: 16, offset: 240)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe1", scope: !1031, file: !1027, line: 228, baseType: !363, size: 32, offset: 256)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe2", scope: !1031, file: !1027, line: 229, baseType: !363, size: 32, offset: 288)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction_flag", scope: !1031, file: !1027, line: 233, baseType: !363, size: 32, offset: 320)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "refine_camera_intrinsics", scope: !1031, file: !1027, line: 236, baseType: !387, size: 16, offset: 352)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1031, file: !1027, line: 236, baseType: !387, size: 16, offset: 368)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !1031, file: !1027, line: 241, baseType: !528, size: 32, offset: 384)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "clean_frames", scope: !1031, file: !1027, line: 244, baseType: !363, size: 32, offset: 416)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "clean_action", scope: !1031, file: !1027, line: 244, baseType: !363, size: 32, offset: 448)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "clean_error", scope: !1031, file: !1027, line: 245, baseType: !528, size: 32, offset: 480)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "object_distance", scope: !1031, file: !1027, line: 248, baseType: !528, size: 32, offset: 512)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !1031, file: !1027, line: 250, baseType: !363, size: 32, offset: 544)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !1026, file: !1027, line: 342, baseType: !1058, size: 448, offset: 576)
!1058 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingCamera", file: !1027, line: 79, baseType: !1059)
!1059 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingCamera", file: !1027, line: 61, size: 448, elements: !1060)
!1060 = !{!1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074}
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "intrinsics", scope: !1059, file: !1027, line: 62, baseType: !340, size: 64)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_model", scope: !1059, file: !1027, line: 64, baseType: !387, size: 16, offset: 64)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1059, file: !1027, line: 65, baseType: !387, size: 16, offset: 80)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "sensor_width", scope: !1059, file: !1027, line: 67, baseType: !528, size: 32, offset: 96)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_aspect", scope: !1059, file: !1027, line: 68, baseType: !528, size: 32, offset: 128)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "focal", scope: !1059, file: !1027, line: 69, baseType: !528, size: 32, offset: 160)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !1059, file: !1027, line: 70, baseType: !387, size: 16, offset: 192)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !1059, file: !1027, line: 71, baseType: !387, size: 16, offset: 208)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "principal", scope: !1059, file: !1027, line: 72, baseType: !755, size: 64, offset: 224)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "k1", scope: !1059, file: !1027, line: 75, baseType: !528, size: 32, offset: 288)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "k2", scope: !1059, file: !1027, line: 75, baseType: !528, size: 32, offset: 320)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "k3", scope: !1059, file: !1027, line: 75, baseType: !528, size: 32, offset: 352)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "division_k1", scope: !1059, file: !1027, line: 78, baseType: !528, size: 32, offset: 384)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "division_k2", scope: !1059, file: !1027, line: 78, baseType: !528, size: 32, offset: 416)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "tracks", scope: !1026, file: !1027, line: 343, baseType: !396, size: 128, offset: 1024)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "plane_tracks", scope: !1026, file: !1027, line: 344, baseType: !396, size: 128, offset: 1152)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction", scope: !1026, file: !1027, line: 345, baseType: !1078, size: 192, offset: 1280)
!1078 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingReconstruction", file: !1027, line: 278, baseType: !1079)
!1079 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingReconstruction", file: !1027, line: 270, size: 192, elements: !1080)
!1080 = !{!1081, !1082, !1083, !1084, !1085}
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1079, file: !1027, line: 271, baseType: !363, size: 32)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1079, file: !1027, line: 273, baseType: !528, size: 32, offset: 32)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "last_camera", scope: !1079, file: !1027, line: 275, baseType: !363, size: 32, offset: 64)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "camnr", scope: !1079, file: !1027, line: 276, baseType: !363, size: 32, offset: 96)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "cameras", scope: !1079, file: !1027, line: 277, baseType: !1086, size: 64, offset: 128)
!1086 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1087, size: 64)
!1087 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieReconstructedCamera", file: !1027, line: 55, size: 576, elements: !1088)
!1088 = !{!1089, !1090, !1091}
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !1087, file: !1027, line: 56, baseType: !363, size: 32)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1087, file: !1027, line: 57, baseType: !528, size: 32, offset: 32)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !1087, file: !1027, line: 58, baseType: !645, size: 512, offset: 64)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "stabilization", scope: !1026, file: !1027, line: 346, baseType: !1093, size: 384, offset: 1472)
!1093 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStabilization", file: !1027, line: 268, baseType: !1094)
!1094 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStabilization", file: !1027, line: 253, size: 384, elements: !1095)
!1095 = !{!1096, !1097, !1098, !1099, !1100, !1144, !1145, !1146, !1147, !1148, !1149}
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1094, file: !1027, line: 254, baseType: !363, size: 32)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "tot_track", scope: !1094, file: !1027, line: 255, baseType: !363, size: 32, offset: 32)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !1094, file: !1027, line: 255, baseType: !363, size: 32, offset: 64)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "maxscale", scope: !1094, file: !1027, line: 258, baseType: !528, size: 32, offset: 96)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "rot_track", scope: !1094, file: !1027, line: 259, baseType: !1101, size: 64, offset: 128)
!1101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1102, size: 64)
!1102 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingTrack", file: !1027, line: 164, baseType: !1103)
!1103 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingTrack", file: !1027, line: 108, size: 1664, elements: !1104)
!1104 = !{!1105, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143}
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1103, file: !1027, line: 109, baseType: !1106, size: 64)
!1106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1103, size: 64)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1103, file: !1027, line: 109, baseType: !1106, size: 64, offset: 64)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1103, file: !1027, line: 111, baseType: !372, size: 512, offset: 128)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "pat_min", scope: !1103, file: !1027, line: 119, baseType: !755, size: 64, offset: 640)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "pat_max", scope: !1103, file: !1027, line: 119, baseType: !755, size: 64, offset: 704)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !1103, file: !1027, line: 125, baseType: !755, size: 64, offset: 768)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !1103, file: !1027, line: 125, baseType: !755, size: 64, offset: 832)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1103, file: !1027, line: 127, baseType: !755, size: 64, offset: 896)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !1103, file: !1027, line: 130, baseType: !363, size: 32, offset: 960)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !1103, file: !1027, line: 131, baseType: !363, size: 32, offset: 992)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !1103, file: !1027, line: 132, baseType: !1117, size: 64, offset: 1024)
!1117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1118, size: 64)
!1118 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingMarker", file: !1027, line: 106, baseType: !1119)
!1119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingMarker", file: !1027, line: 81, size: 512, elements: !1120)
!1120 = !{!1121, !1122, !1125, !1126, !1127, !1128}
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1119, file: !1027, line: 82, baseType: !755, size: 64)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_corners", scope: !1119, file: !1027, line: 97, baseType: !1123, size: 256, offset: 64)
