; ModuleID = 'blender/source/blender/editors/space_node/node_select.c'
source_filename = "blender/source/blender/editors/space_node/node_select.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.EnumPropertyItem = type { i32, i8*, i32, i8*, i8* }
%struct.StructRNA = type opaque
%struct.UserDef = type { i32, i32, i32, i32, i32, [768 x i8], [768 x i8], [1024 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [1024 x i8], [1024 x i8], i32, i16, i16, i16, i16, i16, i16, i32, i32, i32, i16, i16, i32, i32, i32, i32, i32, i32, i32, i16, i16, i16, i16, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, [64 x i8], i16, i16, i16, i16, i16, i16, i16, i16, [3 x %struct.SolidLight], i16, i16, i16, i16, i16, i16, i16, i16, i32, i32, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i8, i8, i8, i8, i16, i16, i16, i16, i16, i16, float, float, i32, i16, i16, float, i16, i16, i16, i16, %struct.ColorBand, [3 x float], [4 x float], i16, i8, i8, [80 x i8], [1024 x i8], i32, i32, float, float, i32, i16, i16, i16, i16, i16, i16, %struct.WalkNavigation }
%struct.ListBase = type { i8*, i8* }
%struct.SolidLight = type { i32, i32, [4 x float], [4 x float], [4 x float] }
%struct.ColorBand = type { i16, i16, i8, i8, i8, [1 x i8], [32 x %struct.CBData] }
%struct.CBData = type { float, float, float, float, float, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "prop_select_grouped_types", scope: !2, file: !3, line: 336, type: !3457, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "NODE_OT_select_grouped", scope: !3, file: !3, line: 334, type: !4, scopeLine: 335, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2316, retainedNodes: !3456)
!3 = !DIFile(filename: "blender/source/blender/editors/space_node/node_select.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !DISubroutineType(types: !5)
!5 = !{null, !6}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "wmOperatorType", file: !8, line: 568, baseType: !9)
!8 = !DIFile(filename: "blender/source/blender/windowmanager/WM_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmOperatorType", file: !8, line: 508, size: 1536, elements: !10)
!10 = !{!11, !15, !16, !17, !18, !2267, !2271, !2277, !2281, !2282, !2286, !2287, !2288, !2289, !2293, !2294, !2309, !2310, !2314, !2315}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !9, file: !8, line: 509, baseType: !12, size: 64)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!13 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !14)
!14 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !9, file: !8, line: 510, baseType: !12, size: 64, offset: 64)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "translation_context", scope: !9, file: !8, line: 511, baseType: !12, size: 64, offset: 128)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !9, file: !8, line: 512, baseType: !12, size: 64, offset: 192)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !9, file: !8, line: 518, baseType: !19, size: 64, offset: 256)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!20 = !DISubroutineType(types: !21)
!21 = !{!22, !23, !26}
!22 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!24 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !25, line: 44, flags: DIFlagFwdDecl)
!25 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!27 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmOperator", file: !28, line: 328, size: 1344, elements: !29)
!28 = !DIFile(filename: "blender/source/blender/makesdna/DNA_windowmanager_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!29 = !{!30, !31, !32, !36, !68, !70, !71, !72, !85, !2262, !2263, !2264, !2265, !2266}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !27, file: !28, line: 329, baseType: !26, size: 64)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !27, file: !28, line: 329, baseType: !26, size: 64, offset: 64)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !27, file: !28, line: 332, baseType: !33, size: 512, offset: 128)
!33 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 512, elements: !34)
!34 = !{!35}
!35 = !DISubrange(count: 64)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !27, file: !28, line: 333, baseType: !37, size: 64, offset: 640)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !39, line: 75, baseType: !40)
!39 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!40 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !39, line: 62, size: 1024, elements: !41)
!41 = !{!42, !44, !45, !46, !47, !49, !50, !51, !66, !67}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !40, file: !39, line: 63, baseType: !43, size: 64)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !40, file: !39, line: 63, baseType: !43, size: 64, offset: 64)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !40, file: !39, line: 64, baseType: !14, size: 8, offset: 128)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !40, file: !39, line: 64, baseType: !14, size: 8, offset: 136)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !40, file: !39, line: 65, baseType: !48, size: 16, offset: 144)
!48 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !40, file: !39, line: 66, baseType: !33, size: 512, offset: 160)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !40, file: !39, line: 67, baseType: !22, size: 32, offset: 672)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !40, file: !39, line: 69, baseType: !52, size: 256, offset: 704)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !39, line: 60, baseType: !53)
!53 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !39, line: 48, size: 256, elements: !54)
!54 = !{!55, !57, !64, !65}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !53, file: !39, line: 49, baseType: !56, size: 64)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !53, file: !39, line: 58, baseType: !58, size: 128, offset: 64)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !59, line: 71, baseType: !60)
!59 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!60 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !59, line: 69, size: 128, elements: !61)
!61 = !{!62, !63}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !60, file: !59, line: 70, baseType: !56, size: 64)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !60, file: !59, line: 70, baseType: !56, size: 64, offset: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !53, file: !39, line: 59, baseType: !22, size: 32, offset: 192)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !53, file: !39, line: 59, baseType: !22, size: 32, offset: 224)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !40, file: !39, line: 70, baseType: !22, size: 32, offset: 960)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !40, file: !39, line: 74, baseType: !22, size: 32, offset: 992)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !27, file: !28, line: 336, baseType: !69, size: 64, offset: 704)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !27, file: !28, line: 337, baseType: !56, size: 64, offset: 768)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "py_instance", scope: !27, file: !28, line: 338, baseType: !56, size: 64, offset: 832)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !27, file: !28, line: 340, baseType: !73, size: 64, offset: 896)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !25, line: 55, size: 192, elements: !75)
!75 = !{!76, !80, !84}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !74, file: !25, line: 58, baseType: !77, size: 64)
!77 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !74, file: !25, line: 56, size: 64, elements: !78)
!78 = !{!79}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !77, file: !25, line: 57, baseType: !56, size: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !74, file: !25, line: 60, baseType: !81, size: 64, offset: 64)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!82 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !83, line: 335, flags: DIFlagFwdDecl)
!83 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!84 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !74, file: !25, line: 61, baseType: !56, size: 64, offset: 128)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "reports", scope: !27, file: !28, line: 341, baseType: !86, size: 64, offset: 960)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ReportList", file: !28, line: 106, size: 320, elements: !88)
!88 = !{!89, !90, !91, !92, !93, !94}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !87, file: !28, line: 107, baseType: !58, size: 128)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "printlevel", scope: !87, file: !28, line: 108, baseType: !22, size: 32, offset: 128)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "storelevel", scope: !87, file: !28, line: 109, baseType: !22, size: 32, offset: 160)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !87, file: !28, line: 110, baseType: !22, size: 32, offset: 192)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !87, file: !28, line: 110, baseType: !22, size: 32, offset: 224)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "reporttimer", scope: !87, file: !28, line: 111, baseType: !95, size: 64, offset: 256)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTimer", file: !8, line: 490, size: 768, elements: !97)
!97 = !{!98, !99, !100, !2253, !2254, !2255, !2256, !2257, !2258, !2259, !2260, !2261}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !96, file: !8, line: 491, baseType: !95, size: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !96, file: !8, line: 491, baseType: !95, size: 64, offset: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "win", scope: !96, file: !8, line: 493, baseType: !101, size: 64, offset: 128)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindow", file: !28, line: 169, size: 2048, elements: !103)
!103 = !{!104, !105, !106, !107, !2170, !2171, !2172, !2173, !2174, !2175, !2176, !2177, !2178, !2179, !2180, !2181, !2182, !2183, !2184, !2185, !2186, !2187, !2228, !2231, !2245, !2246, !2247, !2248, !2249, !2250, !2251, !2252}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !102, file: !28, line: 170, baseType: !101, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !102, file: !28, line: 170, baseType: !101, size: 64, offset: 64)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "ghostwin", scope: !102, file: !28, line: 172, baseType: !56, size: 64, offset: 128)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !102, file: !28, line: 174, baseType: !108, size: 64, offset: 192)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !110, line: 49, size: 1984, elements: !111)
!110 = !DIFile(filename: "blender/source/blender/makesdna/DNA_screen_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!111 = !{!112, !148, !149, !150, !151, !152, !2153, !2154, !2155, !2156, !2157, !2158, !2159, !2160, !2161, !2162, !2163, !2164, !2165, !2166, !2167, !2168, !2169}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !109, file: !110, line: 50, baseType: !113, size: 960)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !39, line: 130, baseType: !114)
!114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !39, line: 117, size: 960, elements: !115)
!115 = !{!116, !117, !118, !120, !139, !143, !144, !145, !146, !147}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !114, file: !39, line: 118, baseType: !56, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !114, file: !39, line: 118, baseType: !56, size: 64, offset: 64)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !114, file: !39, line: 119, baseType: !119, size: 64, offset: 128)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !114, file: !39, line: 120, baseType: !121, size: 64, offset: 192)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !39, line: 136, size: 17600, elements: !123)
!123 = !{!124, !125, !127, !130, !134, !135, !136}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !122, file: !39, line: 137, baseType: !113, size: 960)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !122, file: !39, line: 138, baseType: !126, size: 64, offset: 960)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !122, file: !39, line: 139, baseType: !128, size: 64, offset: 1024)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !39, line: 43, flags: DIFlagFwdDecl)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !122, file: !39, line: 140, baseType: !131, size: 8192, offset: 1088)
!131 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 8192, elements: !132)
!132 = !{!133}
!133 = !DISubrange(count: 1024)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !122, file: !39, line: 141, baseType: !131, size: 8192, offset: 9280)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !122, file: !39, line: 148, baseType: !121, size: 64, offset: 17472)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !122, file: !39, line: 150, baseType: !137, size: 64, offset: 17536)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !39, line: 45, flags: DIFlagFwdDecl)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !114, file: !39, line: 121, baseType: !140, size: 528, offset: 256)
!140 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 528, elements: !141)
!141 = !{!142}
!142 = !DISubrange(count: 66)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !114, file: !39, line: 126, baseType: !48, size: 16, offset: 784)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !114, file: !39, line: 127, baseType: !22, size: 32, offset: 800)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !114, file: !39, line: 128, baseType: !22, size: 32, offset: 832)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !114, file: !39, line: 128, baseType: !22, size: 32, offset: 864)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !114, file: !39, line: 129, baseType: !37, size: 64, offset: 896)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "vertbase", scope: !109, file: !110, line: 52, baseType: !58, size: 128, offset: 960)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "edgebase", scope: !109, file: !110, line: 53, baseType: !58, size: 128, offset: 1088)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "areabase", scope: !109, file: !110, line: 54, baseType: !58, size: 128, offset: 1216)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !109, file: !110, line: 55, baseType: !58, size: 128, offset: 1344)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !109, file: !110, line: 57, baseType: !153, size: 64, offset: 1472)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !155, line: 1216, size: 39680, elements: !156)
!155 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!156 = !{!157, !158, !162, !165, !1195, !1196, !1197, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1218, !1219, !1220, !1221, !1567, !1781, !1784, !2024, !2036, !2037, !2038, !2039, !2040, !2041, !2042, !2043, !2046, !2047, !2048, !2049, !2050, !2058, !2124, !2131, !2132, !2139, !2140, !2146, !2147, !2148, !2149, !2150}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !154, file: !155, line: 1217, baseType: !113, size: 960)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !154, file: !155, line: 1218, baseType: !159, size: 64, offset: 960)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!160 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !161, line: 45, flags: DIFlagFwdDecl)
!161 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!162 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !154, file: !155, line: 1220, baseType: !163, size: 64, offset: 1024)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !161, line: 49, flags: DIFlagFwdDecl)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !154, file: !155, line: 1221, baseType: !166, size: 64, offset: 1088)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !168, line: 52, size: 4224, elements: !169)
!168 = !DIFile(filename: "blender/source/blender/makesdna/DNA_world_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!169 = !{!170, !171, !172, !173, !174, !175, !176, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !240, !241, !244, !1190, !1191, !1192, !1193, !1194}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !167, file: !168, line: 53, baseType: !113, size: 960)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !167, file: !168, line: 54, baseType: !159, size: 64, offset: 960)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "colormodel", scope: !167, file: !168, line: 56, baseType: !48, size: 16, offset: 1024)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "totex", scope: !167, file: !168, line: 56, baseType: !48, size: 16, offset: 1040)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "texact", scope: !167, file: !168, line: 57, baseType: !48, size: 16, offset: 1056)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "mistype", scope: !167, file: !168, line: 57, baseType: !48, size: 16, offset: 1072)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "horr", scope: !167, file: !168, line: 59, baseType: !177, size: 32, offset: 1088)
!177 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "horg", scope: !167, file: !168, line: 59, baseType: !177, size: 32, offset: 1120)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "horb", scope: !167, file: !168, line: 59, baseType: !177, size: 32, offset: 1152)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "zenr", scope: !167, file: !168, line: 60, baseType: !177, size: 32, offset: 1184)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "zeng", scope: !167, file: !168, line: 60, baseType: !177, size: 32, offset: 1216)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "zenb", scope: !167, file: !168, line: 60, baseType: !177, size: 32, offset: 1248)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "ambr", scope: !167, file: !168, line: 61, baseType: !177, size: 32, offset: 1280)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "ambg", scope: !167, file: !168, line: 61, baseType: !177, size: 32, offset: 1312)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "ambb", scope: !167, file: !168, line: 61, baseType: !177, size: 32, offset: 1344)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "exposure", scope: !167, file: !168, line: 68, baseType: !177, size: 32, offset: 1376)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !167, file: !168, line: 68, baseType: !177, size: 32, offset: 1408)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !167, file: !168, line: 68, baseType: !177, size: 32, offset: 1440)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "linfac", scope: !167, file: !168, line: 69, baseType: !177, size: 32, offset: 1472)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "logfac", scope: !167, file: !168, line: 69, baseType: !177, size: 32, offset: 1504)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !167, file: !168, line: 74, baseType: !177, size: 32, offset: 1536)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "activityBoxRadius", scope: !167, file: !168, line: 79, baseType: !177, size: 32, offset: 1568)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "skytype", scope: !167, file: !168, line: 81, baseType: !48, size: 16, offset: 1600)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !167, file: !168, line: 91, baseType: !48, size: 16, offset: 1616)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "occlusionRes", scope: !167, file: !168, line: 92, baseType: !48, size: 16, offset: 1632)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "physicsEngine", scope: !167, file: !168, line: 93, baseType: !48, size: 16, offset: 1648)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "ticrate", scope: !167, file: !168, line: 94, baseType: !48, size: 16, offset: 1664)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "maxlogicstep", scope: !167, file: !168, line: 94, baseType: !48, size: 16, offset: 1680)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "physubstep", scope: !167, file: !168, line: 94, baseType: !48, size: 16, offset: 1696)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "maxphystep", scope: !167, file: !168, line: 94, baseType: !48, size: 16, offset: 1712)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "misi", scope: !167, file: !168, line: 96, baseType: !177, size: 32, offset: 1728)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "miststa", scope: !167, file: !168, line: 96, baseType: !177, size: 32, offset: 1760)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "mistdist", scope: !167, file: !168, line: 96, baseType: !177, size: 32, offset: 1792)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "misthi", scope: !167, file: !168, line: 96, baseType: !177, size: 32, offset: 1824)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "starr", scope: !167, file: !168, line: 98, baseType: !177, size: 32, offset: 1856)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "starg", scope: !167, file: !168, line: 98, baseType: !177, size: 32, offset: 1888)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "starb", scope: !167, file: !168, line: 98, baseType: !177, size: 32, offset: 1920)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "stark", scope: !167, file: !168, line: 98, baseType: !177, size: 32, offset: 1952)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "starsize", scope: !167, file: !168, line: 99, baseType: !177, size: 32, offset: 1984)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "starmindist", scope: !167, file: !168, line: 99, baseType: !177, size: 32, offset: 2016)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "stardist", scope: !167, file: !168, line: 100, baseType: !177, size: 32, offset: 2048)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "starcolnoise", scope: !167, file: !168, line: 100, baseType: !177, size: 32, offset: 2080)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "dofsta", scope: !167, file: !168, line: 103, baseType: !48, size: 16, offset: 2112)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "dofend", scope: !167, file: !168, line: 103, baseType: !48, size: 16, offset: 2128)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "dofmin", scope: !167, file: !168, line: 103, baseType: !48, size: 16, offset: 2144)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "dofmax", scope: !167, file: !168, line: 103, baseType: !48, size: 16, offset: 2160)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "aodist", scope: !167, file: !168, line: 106, baseType: !177, size: 32, offset: 2176)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "aodistfac", scope: !167, file: !168, line: 106, baseType: !177, size: 32, offset: 2208)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "aoenergy", scope: !167, file: !168, line: 106, baseType: !177, size: 32, offset: 2240)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "aobias", scope: !167, file: !168, line: 106, baseType: !177, size: 32, offset: 2272)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "aomode", scope: !167, file: !168, line: 107, baseType: !48, size: 16, offset: 2304)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "aosamp", scope: !167, file: !168, line: 107, baseType: !48, size: 16, offset: 2320)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "aomix", scope: !167, file: !168, line: 107, baseType: !48, size: 16, offset: 2336)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "aocolor", scope: !167, file: !168, line: 107, baseType: !48, size: 16, offset: 2352)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "ao_adapt_thresh", scope: !167, file: !168, line: 108, baseType: !177, size: 32, offset: 2368)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "ao_adapt_speed_fac", scope: !167, file: !168, line: 108, baseType: !177, size: 32, offset: 2400)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_error", scope: !167, file: !168, line: 109, baseType: !177, size: 32, offset: 2432)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_correction", scope: !167, file: !168, line: 109, baseType: !177, size: 32, offset: 2464)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "ao_indirect_energy", scope: !167, file: !168, line: 110, baseType: !177, size: 32, offset: 2496)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "ao_env_energy", scope: !167, file: !168, line: 110, baseType: !177, size: 32, offset: 2528)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "ao_pad2", scope: !167, file: !168, line: 110, baseType: !177, size: 32, offset: 2560)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "ao_indirect_bounces", scope: !167, file: !168, line: 111, baseType: !48, size: 16, offset: 2592)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "ao_pad", scope: !167, file: !168, line: 111, baseType: !48, size: 16, offset: 2608)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "ao_samp_method", scope: !167, file: !168, line: 112, baseType: !48, size: 16, offset: 2624)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "ao_gather_method", scope: !167, file: !168, line: 112, baseType: !48, size: 16, offset: 2640)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_passes", scope: !167, file: !168, line: 112, baseType: !48, size: 16, offset: 2656)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !167, file: !168, line: 115, baseType: !48, size: 16, offset: 2672)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "aosphere", scope: !167, file: !168, line: 118, baseType: !239, size: 64, offset: 2688)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "aotables", scope: !167, file: !168, line: 118, baseType: !239, size: 64, offset: 2752)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !167, file: !168, line: 121, baseType: !242, size: 64, offset: 2816)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!243 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !161, line: 46, flags: DIFlagFwdDecl)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "mtex", scope: !167, file: !168, line: 122, baseType: !245, size: 1152, offset: 2880)
!245 = !DICompositeType(tag: DW_TAG_array_type, baseType: !246, size: 1152, elements: !1188)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTex", file: !161, line: 57, size: 2496, elements: !248)
!248 = !{!249, !250, !251, !252, !253, !254, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1159, !1160, !1161, !1162, !1163, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !247, file: !161, line: 59, baseType: !48, size: 16)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !247, file: !161, line: 59, baseType: !48, size: 16, offset: 16)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "maptoneg", scope: !247, file: !161, line: 59, baseType: !48, size: 16, offset: 32)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "blendtype", scope: !247, file: !161, line: 59, baseType: !48, size: 16, offset: 48)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !247, file: !161, line: 60, baseType: !163, size: 64, offset: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "tex", scope: !247, file: !161, line: 61, baseType: !255, size: 64, offset: 128)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Tex", file: !161, line: 202, size: 3328, elements: !257)
!257 = !{!258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !327, !896, !897, !975, !1001, !1029, !1030, !1098, !1119, !1127, !1128}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !256, file: !161, line: 203, baseType: !113, size: 960)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !256, file: !161, line: 204, baseType: !159, size: 64, offset: 960)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "noisesize", scope: !256, file: !161, line: 206, baseType: !177, size: 32, offset: 1024)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "turbul", scope: !256, file: !161, line: 206, baseType: !177, size: 32, offset: 1056)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "bright", scope: !256, file: !161, line: 207, baseType: !177, size: 32, offset: 1088)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "contrast", scope: !256, file: !161, line: 207, baseType: !177, size: 32, offset: 1120)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "saturation", scope: !256, file: !161, line: 207, baseType: !177, size: 32, offset: 1152)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "rfac", scope: !256, file: !161, line: 207, baseType: !177, size: 32, offset: 1184)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "gfac", scope: !256, file: !161, line: 207, baseType: !177, size: 32, offset: 1216)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "bfac", scope: !256, file: !161, line: 207, baseType: !177, size: 32, offset: 1248)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "filtersize", scope: !256, file: !161, line: 208, baseType: !177, size: 32, offset: 1280)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !256, file: !161, line: 208, baseType: !177, size: 32, offset: 1312)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "mg_H", scope: !256, file: !161, line: 211, baseType: !177, size: 32, offset: 1344)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "mg_lacunarity", scope: !256, file: !161, line: 211, baseType: !177, size: 32, offset: 1376)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "mg_octaves", scope: !256, file: !161, line: 211, baseType: !177, size: 32, offset: 1408)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "mg_offset", scope: !256, file: !161, line: 211, baseType: !177, size: 32, offset: 1440)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "mg_gain", scope: !256, file: !161, line: 211, baseType: !177, size: 32, offset: 1472)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "dist_amount", scope: !256, file: !161, line: 214, baseType: !177, size: 32, offset: 1504)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "ns_outscale", scope: !256, file: !161, line: 214, baseType: !177, size: 32, offset: 1536)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w1", scope: !256, file: !161, line: 217, baseType: !177, size: 32, offset: 1568)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w2", scope: !256, file: !161, line: 218, baseType: !177, size: 32, offset: 1600)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w3", scope: !256, file: !161, line: 219, baseType: !177, size: 32, offset: 1632)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w4", scope: !256, file: !161, line: 220, baseType: !177, size: 32, offset: 1664)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "vn_mexp", scope: !256, file: !161, line: 221, baseType: !177, size: 32, offset: 1696)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "vn_distm", scope: !256, file: !161, line: 222, baseType: !48, size: 16, offset: 1728)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "vn_coltype", scope: !256, file: !161, line: 222, baseType: !48, size: 16, offset: 1744)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "noisedepth", scope: !256, file: !161, line: 224, baseType: !48, size: 16, offset: 1760)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "noisetype", scope: !256, file: !161, line: 224, baseType: !48, size: 16, offset: 1776)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis", scope: !256, file: !161, line: 227, baseType: !48, size: 16, offset: 1792)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis2", scope: !256, file: !161, line: 227, baseType: !48, size: 16, offset: 1808)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "imaflag", scope: !256, file: !161, line: 229, baseType: !48, size: 16, offset: 1824)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !256, file: !161, line: 229, baseType: !48, size: 16, offset: 1840)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !256, file: !161, line: 230, baseType: !48, size: 16, offset: 1856)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "stype", scope: !256, file: !161, line: 230, baseType: !48, size: 16, offset: 1872)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmin", scope: !256, file: !161, line: 232, baseType: !177, size: 32, offset: 1888)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "cropymin", scope: !256, file: !161, line: 232, baseType: !177, size: 32, offset: 1920)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmax", scope: !256, file: !161, line: 232, baseType: !177, size: 32, offset: 1952)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "cropymax", scope: !256, file: !161, line: 232, baseType: !177, size: 32, offset: 1984)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "texfilter", scope: !256, file: !161, line: 233, baseType: !22, size: 32, offset: 2016)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "afmax", scope: !256, file: !161, line: 234, baseType: !22, size: 32, offset: 2048)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "xrepeat", scope: !256, file: !161, line: 235, baseType: !48, size: 16, offset: 2080)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "yrepeat", scope: !256, file: !161, line: 235, baseType: !48, size: 16, offset: 2096)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "extend", scope: !256, file: !161, line: 236, baseType: !48, size: 16, offset: 2112)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !256, file: !161, line: 239, baseType: !48, size: 16, offset: 2128)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !256, file: !161, line: 240, baseType: !22, size: 32, offset: 2144)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !256, file: !161, line: 241, baseType: !22, size: 32, offset: 2176)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !256, file: !161, line: 241, baseType: !22, size: 32, offset: 2208)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !256, file: !161, line: 241, baseType: !22, size: 32, offset: 2240)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "checkerdist", scope: !256, file: !161, line: 243, baseType: !177, size: 32, offset: 2272)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "nabla", scope: !256, file: !161, line: 243, baseType: !177, size: 32, offset: 2304)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !256, file: !161, line: 244, baseType: !177, size: 32, offset: 2336)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !256, file: !161, line: 246, baseType: !310, size: 320, offset: 2368)
!310 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !311, line: 50, size: 320, elements: !312)
!311 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!312 = !{!313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !310, file: !311, line: 51, baseType: !153, size: 64)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !310, file: !311, line: 53, baseType: !22, size: 32, offset: 64)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !310, file: !311, line: 54, baseType: !22, size: 32, offset: 96)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !310, file: !311, line: 55, baseType: !22, size: 32, offset: 128)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !310, file: !311, line: 55, baseType: !22, size: 32, offset: 160)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !310, file: !311, line: 56, baseType: !14, size: 8, offset: 192)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "cycl", scope: !310, file: !311, line: 56, baseType: !14, size: 8, offset: 200)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !310, file: !311, line: 57, baseType: !14, size: 8, offset: 208)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !310, file: !311, line: 57, baseType: !14, size: 8, offset: 216)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "multi_index", scope: !310, file: !311, line: 59, baseType: !48, size: 16, offset: 224)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !310, file: !311, line: 59, baseType: !48, size: 16, offset: 240)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !310, file: !311, line: 59, baseType: !48, size: 16, offset: 256)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !310, file: !311, line: 61, baseType: !48, size: 16, offset: 272)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !310, file: !311, line: 63, baseType: !22, size: 32, offset: 288)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !256, file: !161, line: 248, baseType: !328, size: 64, offset: 2688)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!329 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !83, line: 328, size: 3456, elements: !330)
!330 = !{!331, !332, !333, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !874, !875, !876, !879, !883, !887, !891, !892, !893, !894, !895}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !329, file: !83, line: 329, baseType: !113, size: 960)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !329, file: !83, line: 330, baseType: !159, size: 64, offset: 960)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !329, file: !83, line: 332, baseType: !334, size: 64, offset: 1024)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64)
!335 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !336, line: 283, size: 4096, elements: !337)
!336 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_node.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!337 = !{!338, !339, !340, !341, !345, !346, !350, !813, !821, !825, !831, !835, !836, !837, !838, !842, !843}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !335, file: !336, line: 284, baseType: !22, size: 32)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !335, file: !336, line: 285, baseType: !33, size: 512, offset: 32)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "ui_name", scope: !335, file: !336, line: 287, baseType: !33, size: 512, offset: 544)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "ui_description", scope: !335, file: !336, line: 288, baseType: !342, size: 2048, offset: 1056)
!342 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 2048, elements: !343)
!343 = !{!344}
!344 = !DISubrange(count: 256)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "ui_icon", scope: !335, file: !336, line: 289, baseType: !22, size: 32, offset: 3104)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "free_cache", scope: !335, file: !336, line: 292, baseType: !347, size: 64, offset: 3136)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!348 = !DISubroutineType(types: !349)
!349 = !{null, !328}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "free_node_cache", scope: !335, file: !336, line: 293, baseType: !351, size: 64, offset: 3200)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!352 = !DISubroutineType(types: !353)
!353 = !{null, !328, !354}
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!355 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNode", file: !83, line: 167, size: 3712, elements: !356)
!356 = !{!357, !358, !359, !360, !361, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !355, file: !83, line: 168, baseType: !354, size: 64)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !355, file: !83, line: 168, baseType: !354, size: 64, offset: 64)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "new_node", scope: !355, file: !83, line: 168, baseType: !354, size: 64, offset: 128)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !355, file: !83, line: 170, baseType: !37, size: 64, offset: 192)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !355, file: !83, line: 172, baseType: !362, size: 64, offset: 256)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeType", file: !336, line: 144, size: 6016, elements: !364)
!364 = !{!365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !530, !531, !532, !677, !681, !685, !686, !693, !697, !701, !702, !703, !704, !708, !709, !713, !717, !721, !725, !729, !733, !737, !738, !745, !747, !756, !765}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !363, file: !336, line: 145, baseType: !56, size: 64)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !363, file: !336, line: 145, baseType: !56, size: 64, offset: 64)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "needs_free", scope: !363, file: !336, line: 146, baseType: !48, size: 16, offset: 128)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !363, file: !336, line: 148, baseType: !33, size: 512, offset: 144)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !363, file: !336, line: 149, baseType: !22, size: 32, offset: 672)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "ui_name", scope: !363, file: !336, line: 151, baseType: !33, size: 512, offset: 704)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "ui_description", scope: !363, file: !336, line: 152, baseType: !342, size: 2048, offset: 1216)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "ui_icon", scope: !363, file: !336, line: 153, baseType: !22, size: 32, offset: 3264)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !363, file: !336, line: 155, baseType: !177, size: 32, offset: 3296)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "minwidth", scope: !363, file: !336, line: 155, baseType: !177, size: 32, offset: 3328)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "maxwidth", scope: !363, file: !336, line: 155, baseType: !177, size: 32, offset: 3360)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !363, file: !336, line: 156, baseType: !177, size: 32, offset: 3392)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "minheight", scope: !363, file: !336, line: 156, baseType: !177, size: 32, offset: 3424)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "maxheight", scope: !363, file: !336, line: 156, baseType: !177, size: 32, offset: 3456)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "nclass", scope: !363, file: !336, line: 157, baseType: !48, size: 16, offset: 3488)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !363, file: !336, line: 157, baseType: !48, size: 16, offset: 3504)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "compatibility", scope: !363, file: !336, line: 157, baseType: !48, size: 16, offset: 3520)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !363, file: !336, line: 160, baseType: !383, size: 64, offset: 3584)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeSocketTemplate", file: !336, line: 109, baseType: !385)
!385 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocketTemplate", file: !336, line: 98, size: 1408, elements: !386)
!386 = !{!387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !529}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !385, file: !336, line: 99, baseType: !22, size: 32)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !385, file: !336, line: 99, baseType: !22, size: 32, offset: 32)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !385, file: !336, line: 100, baseType: !33, size: 512, offset: 64)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "val1", scope: !385, file: !336, line: 101, baseType: !177, size: 32, offset: 576)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !385, file: !336, line: 101, baseType: !177, size: 32, offset: 608)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "val3", scope: !385, file: !336, line: 101, baseType: !177, size: 32, offset: 640)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "val4", scope: !385, file: !336, line: 101, baseType: !177, size: 32, offset: 672)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !385, file: !336, line: 102, baseType: !177, size: 32, offset: 704)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !385, file: !336, line: 102, baseType: !177, size: 32, offset: 736)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !385, file: !336, line: 103, baseType: !22, size: 32, offset: 768)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !385, file: !336, line: 104, baseType: !22, size: 32, offset: 800)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "sock", scope: !385, file: !336, line: 107, baseType: !399, size: 64, offset: 832)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocket", file: !83, line: 87, size: 2816, elements: !401)
!401 = !{!402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !508}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !400, file: !83, line: 88, baseType: !399, size: 64)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !400, file: !83, line: 88, baseType: !399, size: 64, offset: 64)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "new_sock", scope: !400, file: !83, line: 88, baseType: !399, size: 64, offset: 128)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !400, file: !83, line: 90, baseType: !37, size: 64, offset: 192)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !400, file: !83, line: 92, baseType: !33, size: 512, offset: 256)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !400, file: !83, line: 94, baseType: !33, size: 512, offset: 768)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !400, file: !83, line: 99, baseType: !56, size: 64, offset: 1280)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !400, file: !83, line: 101, baseType: !48, size: 16, offset: 1344)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !400, file: !83, line: 101, baseType: !48, size: 16, offset: 1360)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !400, file: !83, line: 102, baseType: !48, size: 16, offset: 1376)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "in_out", scope: !400, file: !83, line: 103, baseType: !48, size: 16, offset: 1392)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !400, file: !83, line: 104, baseType: !414, size: 64, offset: 1408)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!415 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocketType", file: !336, line: 114, size: 1600, elements: !416)
!416 = !{!417, !418, !424, !428, !432, !436, !440, !444, !445, !449, !478, !479, !480}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !415, file: !336, line: 115, baseType: !33, size: 512)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "draw", scope: !415, file: !336, line: 117, baseType: !419, size: 64, offset: 512)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64)
!420 = !DISubroutineType(types: !421)
!421 = !{null, !23, !422, !73, !73, !12}
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!423 = !DICompositeType(tag: DW_TAG_structure_type, name: "uiLayout", file: !336, line: 73, flags: DIFlagFwdDecl)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "draw_color", scope: !415, file: !336, line: 118, baseType: !425, size: 64, offset: 576)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!426 = !DISubroutineType(types: !427)
!427 = !{null, !23, !73, !73, !239}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "interface_draw", scope: !415, file: !336, line: 120, baseType: !429, size: 64, offset: 640)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!430 = !DISubroutineType(types: !431)
!431 = !{null, !23, !422, !73}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "interface_draw_color", scope: !415, file: !336, line: 121, baseType: !433, size: 64, offset: 704)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!434 = !DISubroutineType(types: !435)
!435 = !{null, !23, !73, !239}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "interface_register_properties", scope: !415, file: !336, line: 122, baseType: !437, size: 64, offset: 768)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = !DISubroutineType(types: !439)
!439 = !{null, !328, !399, !81}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "interface_init_socket", scope: !415, file: !336, line: 123, baseType: !441, size: 64, offset: 832)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64)
!442 = !DISubroutineType(types: !443)
!443 = !{null, !328, !399, !354, !399, !12}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "interface_verify_socket", scope: !415, file: !336, line: 124, baseType: !441, size: 64, offset: 896)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "interface_from_socket", scope: !415, file: !336, line: 125, baseType: !446, size: 64, offset: 960)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!447 = !DISubroutineType(types: !448)
!448 = !{null, !328, !399, !354, !399}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "ext_socket", scope: !415, file: !336, line: 128, baseType: !450, size: 256, offset: 1024)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExtensionRNA", file: !25, line: 436, baseType: !451)
!451 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ExtensionRNA", file: !25, line: 430, size: 256, elements: !452)
!452 = !{!453, !454, !457, !473}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !451, file: !25, line: 431, baseType: !56, size: 64)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "srna", scope: !451, file: !25, line: 432, baseType: !455, size: 64, offset: 64)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64)
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructRNA", file: !25, line: 417, baseType: !82)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !451, file: !25, line: 433, baseType: !458, size: 64, offset: 128)
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructCallbackFunc", file: !25, line: 408, baseType: !459)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64)
!460 = !DISubroutineType(types: !461)
!461 = !{!22, !23, !73, !462, !464}
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!463 = !DICompositeType(tag: DW_TAG_structure_type, name: "FunctionRNA", file: !25, line: 38, flags: DIFlagFwdDecl)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!465 = !DIDerivedType(tag: DW_TAG_typedef, name: "ParameterList", file: !25, line: 348, baseType: !466)
!466 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParameterList", file: !25, line: 337, size: 256, elements: !467)
!467 = !{!468, !469, !470, !471, !472}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !466, file: !25, line: 339, baseType: !56, size: 64)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !466, file: !25, line: 342, baseType: !462, size: 64, offset: 64)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_size", scope: !466, file: !25, line: 345, baseType: !22, size: 32, offset: 128)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !466, file: !25, line: 347, baseType: !22, size: 32, offset: 160)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "ret_count", scope: !466, file: !25, line: 347, baseType: !22, size: 32, offset: 192)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !451, file: !25, line: 434, baseType: !474, size: 64, offset: 192)
!474 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructFreeFunc", file: !25, line: 409, baseType: !475)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64)
!476 = !DISubroutineType(types: !477)
!477 = !{null, !56}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "ext_interface", scope: !415, file: !336, line: 129, baseType: !450, size: 256, offset: 1280)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !415, file: !336, line: 132, baseType: !22, size: 32, offset: 1536)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !415, file: !336, line: 132, baseType: !22, size: 32, offset: 1568)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !400, file: !83, line: 105, baseType: !33, size: 512, offset: 1472)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "locx", scope: !400, file: !83, line: 107, baseType: !177, size: 32, offset: 1984)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "locy", scope: !400, file: !83, line: 107, baseType: !177, size: 32, offset: 2016)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "default_value", scope: !400, file: !83, line: 109, baseType: !56, size: 64, offset: 2048)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "stack_index", scope: !400, file: !83, line: 112, baseType: !48, size: 16, offset: 2112)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "stack_type", scope: !400, file: !83, line: 114, baseType: !48, size: 16, offset: 2128)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !400, file: !83, line: 115, baseType: !22, size: 32, offset: 2144)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !400, file: !83, line: 117, baseType: !56, size: 64, offset: 2176)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "own_index", scope: !400, file: !83, line: 122, baseType: !22, size: 32, offset: 2240)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "to_index", scope: !400, file: !83, line: 124, baseType: !22, size: 32, offset: 2272)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "groupsock", scope: !400, file: !83, line: 126, baseType: !399, size: 64, offset: 2304)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !400, file: !83, line: 128, baseType: !493, size: 64, offset: 2368)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64)
!494 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeLink", file: !83, line: 298, size: 448, elements: !495)
!495 = !{!496, !497, !498, !501, !502, !505, !506, !507}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !494, file: !83, line: 299, baseType: !493, size: 64)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !494, file: !83, line: 299, baseType: !493, size: 64, offset: 64)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "fromnode", scope: !494, file: !83, line: 301, baseType: !499, size: 64, offset: 128)
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64)
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNode", file: !83, line: 218, baseType: !355)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "tonode", scope: !494, file: !83, line: 301, baseType: !499, size: 64, offset: 192)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "fromsock", scope: !494, file: !83, line: 302, baseType: !503, size: 64, offset: 256)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64)
!504 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeSocket", file: !83, line: 132, baseType: !400)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "tosock", scope: !494, file: !83, line: 302, baseType: !503, size: 64, offset: 320)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !494, file: !83, line: 304, baseType: !22, size: 32, offset: 384)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !494, file: !83, line: 305, baseType: !22, size: 32, offset: 416)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "ns", scope: !400, file: !83, line: 131, baseType: !509, size: 384, offset: 2432)
!509 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeStack", file: !83, line: 73, baseType: !510)
!510 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeStack", file: !83, line: 62, size: 384, elements: !511)
!511 = !{!512, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525}
!512 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !510, file: !83, line: 63, baseType: !513, size: 128)
!513 = !DICompositeType(tag: DW_TAG_array_type, baseType: !177, size: 128, elements: !514)
!514 = !{!515}
!515 = !DISubrange(count: 4)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !510, file: !83, line: 64, baseType: !177, size: 32, offset: 128)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !510, file: !83, line: 64, baseType: !177, size: 32, offset: 160)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !510, file: !83, line: 65, baseType: !56, size: 64, offset: 192)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "hasinput", scope: !510, file: !83, line: 66, baseType: !48, size: 16, offset: 256)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "hasoutput", scope: !510, file: !83, line: 67, baseType: !48, size: 16, offset: 272)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "datatype", scope: !510, file: !83, line: 68, baseType: !48, size: 16, offset: 288)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "sockettype", scope: !510, file: !83, line: 69, baseType: !48, size: 16, offset: 304)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !510, file: !83, line: 70, baseType: !48, size: 16, offset: 320)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !510, file: !83, line: 71, baseType: !48, size: 16, offset: 336)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !510, file: !83, line: 72, baseType: !526, size: 32, offset: 352)
!526 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 32, elements: !527)
!527 = !{!528}
!528 = !DISubrange(count: 2)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !385, file: !336, line: 108, baseType: !33, size: 512, offset: 896)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !363, file: !336, line: 160, baseType: !383, size: 64, offset: 3648)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "storagename", scope: !363, file: !336, line: 162, baseType: !33, size: 512, offset: 3712)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "draw_nodetype", scope: !363, file: !336, line: 165, baseType: !533, size: 64, offset: 4224)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64)
!534 = !DISubroutineType(types: !535)
!535 = !{null, !536, !538, !623, !328, !354, !672}
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !24)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64)
!539 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ARegion", file: !110, line: 230, size: 3072, elements: !540)
!540 = !{!541, !542, !543, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !612, !613, !614, !615, !616, !617, !618, !619, !620, !622}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !539, file: !110, line: 231, baseType: !538, size: 64)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !539, file: !110, line: 231, baseType: !538, size: 64, offset: 64)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "v2d", scope: !539, file: !110, line: 233, baseType: !544, size: 1280, offset: 128)
!544 = !DIDerivedType(tag: DW_TAG_typedef, name: "View2D", file: !545, line: 71, baseType: !546)
!545 = !DIFile(filename: "blender/source/blender/makesdna/DNA_view2d_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!546 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "View2D", file: !545, line: 40, size: 1280, elements: !547)
!547 = !{!548, !557, !558, !566, !567, !568, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !591}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !546, file: !545, line: 41, baseType: !549, size: 128)
!549 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !550, line: 95, baseType: !551)
!550 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!551 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !550, line: 92, size: 128, elements: !552)
!552 = !{!553, !554, !555, !556}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !551, file: !550, line: 93, baseType: !177, size: 32)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !551, file: !550, line: 93, baseType: !177, size: 32, offset: 32)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !551, file: !550, line: 94, baseType: !177, size: 32, offset: 64)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !551, file: !550, line: 94, baseType: !177, size: 32, offset: 96)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !546, file: !545, line: 41, baseType: !549, size: 128, offset: 128)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "vert", scope: !546, file: !545, line: 42, baseType: !559, size: 128, offset: 256)
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "rcti", file: !550, line: 89, baseType: !560)
!560 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rcti", file: !550, line: 86, size: 128, elements: !561)
!561 = !{!562, !563, !564, !565}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !560, file: !550, line: 87, baseType: !22, size: 32)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !560, file: !550, line: 87, baseType: !22, size: 32, offset: 32)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !560, file: !550, line: 88, baseType: !22, size: 32, offset: 64)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !560, file: !550, line: 88, baseType: !22, size: 32, offset: 96)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "hor", scope: !546, file: !545, line: 42, baseType: !559, size: 128, offset: 384)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !546, file: !545, line: 43, baseType: !559, size: 128, offset: 512)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !546, file: !545, line: 45, baseType: !569, size: 64, offset: 640)
!569 = !DICompositeType(tag: DW_TAG_array_type, baseType: !177, size: 64, elements: !527)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !546, file: !545, line: 45, baseType: !569, size: 64, offset: 704)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "minzoom", scope: !546, file: !545, line: 46, baseType: !177, size: 32, offset: 768)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "maxzoom", scope: !546, file: !545, line: 46, baseType: !177, size: 32, offset: 800)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "scroll", scope: !546, file: !545, line: 48, baseType: !48, size: 16, offset: 832)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "scroll_ui", scope: !546, file: !545, line: 49, baseType: !48, size: 16, offset: 848)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "keeptot", scope: !546, file: !545, line: 51, baseType: !48, size: 16, offset: 864)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "keepzoom", scope: !546, file: !545, line: 52, baseType: !48, size: 16, offset: 880)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "keepofs", scope: !546, file: !545, line: 53, baseType: !48, size: 16, offset: 896)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !546, file: !545, line: 55, baseType: !48, size: 16, offset: 912)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !546, file: !545, line: 56, baseType: !48, size: 16, offset: 928)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "winx", scope: !546, file: !545, line: 58, baseType: !48, size: 16, offset: 944)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "winy", scope: !546, file: !545, line: 58, baseType: !48, size: 16, offset: 960)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "oldwinx", scope: !546, file: !545, line: 59, baseType: !48, size: 16, offset: 976)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "oldwiny", scope: !546, file: !545, line: 59, baseType: !48, size: 16, offset: 992)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "around", scope: !546, file: !545, line: 61, baseType: !48, size: 16, offset: 1008)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "tab_offset", scope: !546, file: !545, line: 63, baseType: !239, size: 64, offset: 1024)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "tab_num", scope: !546, file: !545, line: 64, baseType: !22, size: 32, offset: 1088)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "tab_cur", scope: !546, file: !545, line: 65, baseType: !22, size: 32, offset: 1120)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "sms", scope: !546, file: !545, line: 68, baseType: !589, size: 64, offset: 1152)
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 64)
!590 = !DICompositeType(tag: DW_TAG_structure_type, name: "SmoothView2DStore", file: !545, line: 68, flags: DIFlagFwdDecl)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "smooth_timer", scope: !546, file: !545, line: 69, baseType: !95, size: 64, offset: 1216)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "winrct", scope: !539, file: !110, line: 234, baseType: !559, size: 128, offset: 1408)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "drawrct", scope: !539, file: !110, line: 235, baseType: !559, size: 128, offset: 1536)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "winx", scope: !539, file: !110, line: 236, baseType: !48, size: 16, offset: 1664)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "winy", scope: !539, file: !110, line: 236, baseType: !48, size: 16, offset: 1680)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "swinid", scope: !539, file: !110, line: 238, baseType: !48, size: 16, offset: 1696)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "regiontype", scope: !539, file: !110, line: 239, baseType: !48, size: 16, offset: 1712)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !539, file: !110, line: 240, baseType: !48, size: 16, offset: 1728)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !539, file: !110, line: 241, baseType: !48, size: 16, offset: 1744)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "fsize", scope: !539, file: !110, line: 243, baseType: !177, size: 32, offset: 1760)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "sizex", scope: !539, file: !110, line: 244, baseType: !48, size: 16, offset: 1792)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "sizey", scope: !539, file: !110, line: 244, baseType: !48, size: 16, offset: 1808)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "do_draw", scope: !539, file: !110, line: 246, baseType: !48, size: 16, offset: 1824)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "do_draw_overlay", scope: !539, file: !110, line: 247, baseType: !48, size: 16, offset: 1840)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "swap", scope: !539, file: !110, line: 248, baseType: !48, size: 16, offset: 1856)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "overlap", scope: !539, file: !110, line: 249, baseType: !48, size: 16, offset: 1872)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "flagfullscreen", scope: !539, file: !110, line: 250, baseType: !48, size: 16, offset: 1888)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !539, file: !110, line: 251, baseType: !48, size: 16, offset: 1904)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !539, file: !110, line: 253, baseType: !610, size: 64, offset: 1920)
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64)
!611 = !DICompositeType(tag: DW_TAG_structure_type, name: "ARegionType", file: !110, line: 42, flags: DIFlagFwdDecl)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "uiblocks", scope: !539, file: !110, line: 255, baseType: !58, size: 128, offset: 1984)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "panels", scope: !539, file: !110, line: 256, baseType: !58, size: 128, offset: 2112)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "panels_category_active", scope: !539, file: !110, line: 257, baseType: !58, size: 128, offset: 2240)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "ui_lists", scope: !539, file: !110, line: 258, baseType: !58, size: 128, offset: 2368)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "ui_previews", scope: !539, file: !110, line: 259, baseType: !58, size: 128, offset: 2496)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "handlers", scope: !539, file: !110, line: 260, baseType: !58, size: 128, offset: 2624)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "panels_category", scope: !539, file: !110, line: 261, baseType: !58, size: 128, offset: 2752)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "regiontimer", scope: !539, file: !110, line: 263, baseType: !95, size: 64, offset: 2880)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "headerstr", scope: !539, file: !110, line: 265, baseType: !621, size: 64, offset: 2944)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "regiondata", scope: !539, file: !110, line: 266, baseType: !56, size: 64, offset: 3008)
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 64)
!624 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceNode", file: !625, line: 925, size: 3200, elements: !626)
!625 = !DIFile(filename: "blender/source/blender/makesdna/DNA_space_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!626 = !{!627, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !624, file: !625, line: 926, baseType: !628, size: 64)
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 64)
!629 = !DIDerivedType(tag: DW_TAG_typedef, name: "SpaceLink", file: !625, line: 91, baseType: !630)
!630 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceLink", file: !625, line: 85, size: 448, elements: !631)
!631 = !{!632, !634, !635, !636, !637, !638}
!632 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !630, file: !625, line: 86, baseType: !633, size: 64)
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 64)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !630, file: !625, line: 86, baseType: !633, size: 64, offset: 64)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !630, file: !625, line: 87, baseType: !58, size: 128, offset: 128)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "spacetype", scope: !630, file: !625, line: 88, baseType: !22, size: 32, offset: 256)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "blockscale", scope: !630, file: !625, line: 89, baseType: !177, size: 32, offset: 288)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "blockhandler", scope: !630, file: !625, line: 90, baseType: !639, size: 128, offset: 320)
!639 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 128, elements: !640)
!640 = !{!641}
!641 = !DISubrange(count: 8)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !624, file: !625, line: 926, baseType: !628, size: 64, offset: 64)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !624, file: !625, line: 927, baseType: !58, size: 128, offset: 128)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "spacetype", scope: !624, file: !625, line: 928, baseType: !22, size: 32, offset: 256)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "blockscale", scope: !624, file: !625, line: 929, baseType: !177, size: 32, offset: 288)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "blockhandler", scope: !624, file: !625, line: 930, baseType: !639, size: 128, offset: 320)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "v2d", scope: !624, file: !625, line: 932, baseType: !544, size: 1280, offset: 448)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !624, file: !625, line: 934, baseType: !119, size: 64, offset: 1728)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "from", scope: !624, file: !625, line: 934, baseType: !119, size: 64, offset: 1792)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !624, file: !625, line: 935, baseType: !48, size: 16, offset: 1856)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !624, file: !625, line: 935, baseType: !48, size: 16, offset: 1872)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "aspect", scope: !624, file: !625, line: 936, baseType: !177, size: 32, offset: 1888)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !624, file: !625, line: 936, baseType: !177, size: 32, offset: 1920)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "xof", scope: !624, file: !625, line: 938, baseType: !177, size: 32, offset: 1952)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "yof", scope: !624, file: !625, line: 938, baseType: !177, size: 32, offset: 1984)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "zoom", scope: !624, file: !625, line: 939, baseType: !177, size: 32, offset: 2016)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !624, file: !625, line: 940, baseType: !569, size: 64, offset: 2048)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "treepath", scope: !624, file: !625, line: 947, baseType: !58, size: 128, offset: 2112)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !624, file: !625, line: 949, baseType: !328, size: 64, offset: 2240)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "edittree", scope: !624, file: !625, line: 949, baseType: !328, size: 64, offset: 2304)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "tree_idname", scope: !624, file: !625, line: 952, baseType: !33, size: 512, offset: 2368)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "treetype", scope: !624, file: !625, line: 953, baseType: !22, size: 32, offset: 2880)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !624, file: !625, line: 954, baseType: !22, size: 32, offset: 2912)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "texfrom", scope: !624, file: !625, line: 956, baseType: !48, size: 16, offset: 2944)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "shaderfrom", scope: !624, file: !625, line: 957, baseType: !48, size: 16, offset: 2960)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !624, file: !625, line: 958, baseType: !48, size: 16, offset: 2976)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "pad4", scope: !624, file: !625, line: 959, baseType: !48, size: 16, offset: 2992)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "linkdrag", scope: !624, file: !625, line: 960, baseType: !58, size: 128, offset: 3008)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !624, file: !625, line: 962, baseType: !670, size: 64, offset: 3136)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64)
!671 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !155, line: 61, flags: DIFlagFwdDecl)
!672 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !83, line: 274, baseType: !673)
!673 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !83, line: 271, size: 32, elements: !674)
!674 = !{!675}
!675 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !673, file: !83, line: 273, baseType: !676, size: 32)
!676 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "draw_nodetype_prepare", scope: !363, file: !336, line: 168, baseType: !678, size: 64, offset: 4288)
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 64)
!679 = !DISubroutineType(types: !680)
!680 = !{null, !536, !328, !354}
!681 = !DIDerivedType(tag: DW_TAG_member, name: "draw_buttons", scope: !363, file: !336, line: 171, baseType: !682, size: 64, offset: 4352)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 64)
!683 = !DISubroutineType(types: !684)
!684 = !{null, !422, !23, !73}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "draw_buttons_ex", scope: !363, file: !336, line: 173, baseType: !682, size: 64, offset: 4416)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "draw_backdrop", scope: !363, file: !336, line: 176, baseType: !687, size: 64, offset: 4480)
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 64)
!688 = !DISubroutineType(types: !689)
!689 = !{null, !623, !690, !354, !22, !22}
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 64)
!691 = !DICompositeType(tag: DW_TAG_structure_type, name: "ImBuf", file: !692, line: 136, flags: DIFlagFwdDecl)
!692 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!693 = !DIDerivedType(tag: DW_TAG_member, name: "labelfunc", scope: !363, file: !336, line: 179, baseType: !694, size: 64, offset: 4544)
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 64)
!695 = !DISubroutineType(types: !696)
!696 = !{null, !328, !354, !621, !22}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "resize_area_func", scope: !363, file: !336, line: 181, baseType: !698, size: 64, offset: 4608)
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 64)
!699 = !DISubroutineType(types: !700)
!700 = !{!22, !354, !22, !22}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "select_area_func", scope: !363, file: !336, line: 183, baseType: !698, size: 64, offset: 4672)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "tweak_area_func", scope: !363, file: !336, line: 185, baseType: !698, size: 64, offset: 4736)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "updatefunc", scope: !363, file: !336, line: 188, baseType: !351, size: 64, offset: 4800)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "verifyfunc", scope: !363, file: !336, line: 190, baseType: !705, size: 64, offset: 4864)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 64)
!706 = !DISubroutineType(types: !707)
!707 = !{null, !328, !354, !119}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "initfunc", scope: !363, file: !336, line: 193, baseType: !351, size: 64, offset: 4928)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "freefunc", scope: !363, file: !336, line: 195, baseType: !710, size: 64, offset: 4992)
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 64)
!711 = !DISubroutineType(types: !712)
!712 = !{null, !354}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "copyfunc", scope: !363, file: !336, line: 197, baseType: !714, size: 64, offset: 5056)
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 64)
!715 = !DISubroutineType(types: !716)
!716 = !{null, !328, !354, !354}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "initfunc_api", scope: !363, file: !336, line: 200, baseType: !718, size: 64, offset: 5120)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 64)
!719 = !DISubroutineType(types: !720)
!720 = !{null, !536, !73}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "freefunc_api", scope: !363, file: !336, line: 201, baseType: !722, size: 64, offset: 5184)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 64)
!723 = !DISubroutineType(types: !724)
!724 = !{null, !73}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "copyfunc_api", scope: !363, file: !336, line: 202, baseType: !726, size: 64, offset: 5248)
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 64)
!727 = !DISubroutineType(types: !728)
!728 = !{null, !73, !354}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "poll", scope: !363, file: !336, line: 205, baseType: !730, size: 64, offset: 5312)
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 64)
!731 = !DISubroutineType(types: !732)
!732 = !{!22, !362, !328}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "poll_instance", scope: !363, file: !336, line: 207, baseType: !734, size: 64, offset: 5376)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64)
!735 = !DISubroutineType(types: !736)
!736 = !{!22, !354, !328}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "update_internal_links", scope: !363, file: !336, line: 210, baseType: !351, size: 64, offset: 5440)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "initexecfunc", scope: !363, file: !336, line: 213, baseType: !739, size: 64, offset: 5504)
!739 = !DIDerivedType(tag: DW_TAG_typedef, name: "NodeInitExecFunction", file: !336, line: 135, baseType: !740)
!740 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !741, size: 64)
!741 = !DISubroutineType(types: !742)
!742 = !{!56, !743, !354, !672}
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64)
!744 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeExecContext", file: !336, line: 62, flags: DIFlagFwdDecl)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "freeexecfunc", scope: !363, file: !336, line: 214, baseType: !746, size: 64, offset: 5568)
!746 = !DIDerivedType(tag: DW_TAG_typedef, name: "NodeFreeExecFunction", file: !336, line: 136, baseType: !475)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "execfunc", scope: !363, file: !336, line: 215, baseType: !748, size: 64, offset: 5632)
!748 = !DIDerivedType(tag: DW_TAG_typedef, name: "NodeExecFunction", file: !336, line: 137, baseType: !749)
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 64)
!750 = !DISubroutineType(types: !751)
!751 = !{null, !56, !22, !354, !752, !754, !754}
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 64)
!753 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeExecData", file: !336, line: 63, flags: DIFlagFwdDecl)
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 64)
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 64)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "gpufunc", scope: !363, file: !336, line: 217, baseType: !757, size: 64, offset: 5696)
!757 = !DIDerivedType(tag: DW_TAG_typedef, name: "NodeGPUExecFunction", file: !336, line: 138, baseType: !758)
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !759, size: 64)
!759 = !DISubroutineType(types: !760)
!760 = !{!22, !761, !354, !752, !763, !763}
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 64)
!762 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUMaterial", file: !336, line: 64, flags: DIFlagFwdDecl)
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 64)
!764 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUNodeStack", file: !336, line: 66, flags: DIFlagFwdDecl)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "ext", scope: !363, file: !336, line: 220, baseType: !450, size: 256, offset: 5760)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !355, file: !83, line: 173, baseType: !33, size: 512, offset: 320)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !355, file: !83, line: 175, baseType: !33, size: 512, offset: 832)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !355, file: !83, line: 176, baseType: !22, size: 32, offset: 1344)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !355, file: !83, line: 177, baseType: !48, size: 16, offset: 1376)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !355, file: !83, line: 177, baseType: !48, size: 16, offset: 1392)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !355, file: !83, line: 178, baseType: !48, size: 16, offset: 1408)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !355, file: !83, line: 178, baseType: !48, size: 16, offset: 1424)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "lasty", scope: !355, file: !83, line: 179, baseType: !48, size: 16, offset: 1440)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "menunr", scope: !355, file: !83, line: 179, baseType: !48, size: 16, offset: 1456)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "stack_index", scope: !355, file: !83, line: 180, baseType: !48, size: 16, offset: 1472)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !355, file: !83, line: 181, baseType: !48, size: 16, offset: 1488)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !355, file: !83, line: 182, baseType: !778, size: 96, offset: 1504)
!778 = !DICompositeType(tag: DW_TAG_array_type, baseType: !177, size: 96, elements: !779)
!779 = !{!780}
!780 = !DISubrange(count: 3)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !355, file: !83, line: 184, baseType: !58, size: 128, offset: 1600)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !355, file: !83, line: 184, baseType: !58, size: 128, offset: 1728)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !355, file: !83, line: 185, baseType: !354, size: 64, offset: 1856)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !355, file: !83, line: 186, baseType: !119, size: 64, offset: 1920)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !355, file: !83, line: 187, baseType: !56, size: 64, offset: 1984)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "original", scope: !355, file: !83, line: 188, baseType: !354, size: 64, offset: 2048)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "internal_links", scope: !355, file: !83, line: 189, baseType: !58, size: 128, offset: 2112)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "locx", scope: !355, file: !83, line: 191, baseType: !177, size: 32, offset: 2240)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "locy", scope: !355, file: !83, line: 191, baseType: !177, size: 32, offset: 2272)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !355, file: !83, line: 192, baseType: !177, size: 32, offset: 2304)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !355, file: !83, line: 192, baseType: !177, size: 32, offset: 2336)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "miniwidth", scope: !355, file: !83, line: 193, baseType: !177, size: 32, offset: 2368)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "offsetx", scope: !355, file: !83, line: 194, baseType: !177, size: 32, offset: 2400)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "offsety", scope: !355, file: !83, line: 194, baseType: !177, size: 32, offset: 2432)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !355, file: !83, line: 196, baseType: !22, size: 32, offset: 2464)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !355, file: !83, line: 198, baseType: !33, size: 512, offset: 2496)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "custom1", scope: !355, file: !83, line: 199, baseType: !48, size: 16, offset: 3008)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "custom2", scope: !355, file: !83, line: 199, baseType: !48, size: 16, offset: 3024)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "custom3", scope: !355, file: !83, line: 200, baseType: !177, size: 32, offset: 3040)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "custom4", scope: !355, file: !83, line: 200, baseType: !177, size: 32, offset: 3072)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "need_exec", scope: !355, file: !83, line: 202, baseType: !48, size: 16, offset: 3104)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !355, file: !83, line: 202, baseType: !48, size: 16, offset: 3120)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "threaddata", scope: !355, file: !83, line: 203, baseType: !56, size: 64, offset: 3136)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "totr", scope: !355, file: !83, line: 204, baseType: !549, size: 128, offset: 3200)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "butr", scope: !355, file: !83, line: 205, baseType: !549, size: 128, offset: 3328)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "prvr", scope: !355, file: !83, line: 206, baseType: !549, size: 128, offset: 3456)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "preview_xsize", scope: !355, file: !83, line: 215, baseType: !48, size: 16, offset: 3584)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "preview_ysize", scope: !355, file: !83, line: 215, baseType: !48, size: 16, offset: 3600)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !355, file: !83, line: 216, baseType: !22, size: 32, offset: 3616)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !355, file: !83, line: 217, baseType: !811, size: 64, offset: 3648)
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !812, size: 64)
!812 = !DICompositeType(tag: DW_TAG_structure_type, name: "uiBlock", file: !83, line: 51, flags: DIFlagFwdDecl)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "foreach_nodeclass", scope: !335, file: !336, line: 294, baseType: !814, size: 64, offset: 3264)
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !815, size: 64)
!815 = !DISubroutineType(types: !816)
!816 = !{null, !153, !56, !817}
!817 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeClassCallback", file: !336, line: 282, baseType: !818)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 64)
!819 = !DISubroutineType(types: !820)
!820 = !{null, !56, !22, !12}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "poll", scope: !335, file: !336, line: 296, baseType: !822, size: 64, offset: 3328)
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !823, size: 64)
!823 = !DISubroutineType(types: !824)
!824 = !{!22, !536, !334}
!825 = !DIDerivedType(tag: DW_TAG_member, name: "get_from_context", scope: !335, file: !336, line: 298, baseType: !826, size: 64, offset: 3392)
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !827, size: 64)
!827 = !DISubroutineType(types: !828)
!828 = !{null, !536, !334, !829, !830, !830}
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64)
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "localize", scope: !335, file: !336, line: 302, baseType: !832, size: 64, offset: 3456)
!832 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !833, size: 64)
!833 = !DISubroutineType(types: !834)
!834 = !{null, !328, !328}
!835 = !DIDerivedType(tag: DW_TAG_member, name: "local_sync", scope: !335, file: !336, line: 303, baseType: !832, size: 64, offset: 3520)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "local_merge", scope: !335, file: !336, line: 304, baseType: !832, size: 64, offset: 3584)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !335, file: !336, line: 307, baseType: !347, size: 64, offset: 3648)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "validate_link", scope: !335, file: !336, line: 309, baseType: !839, size: 64, offset: 3712)
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !840, size: 64)
!840 = !DISubroutineType(types: !841)
!841 = !{!22, !328, !493}
!842 = !DIDerivedType(tag: DW_TAG_member, name: "node_add_init", scope: !335, file: !336, line: 311, baseType: !351, size: 64, offset: 3776)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "ext", scope: !335, file: !336, line: 314, baseType: !450, size: 256, offset: 3840)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !329, file: !83, line: 333, baseType: !33, size: 512, offset: 1088)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "interface_type", scope: !329, file: !83, line: 335, baseType: !81, size: 64, offset: 1600)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !329, file: !83, line: 337, baseType: !670, size: 64, offset: 1664)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "view_center", scope: !329, file: !83, line: 338, baseType: !569, size: 64, offset: 1728)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !329, file: !83, line: 340, baseType: !58, size: 128, offset: 1792)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !329, file: !83, line: 340, baseType: !58, size: 128, offset: 1920)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !329, file: !83, line: 342, baseType: !22, size: 32, offset: 2048)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !329, file: !83, line: 342, baseType: !22, size: 32, offset: 2080)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "cur_index", scope: !329, file: !83, line: 343, baseType: !22, size: 32, offset: 2112)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !329, file: !83, line: 345, baseType: !22, size: 32, offset: 2144)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !329, file: !83, line: 346, baseType: !22, size: 32, offset: 2176)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "is_updating", scope: !329, file: !83, line: 347, baseType: !48, size: 16, offset: 2208)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !329, file: !83, line: 348, baseType: !48, size: 16, offset: 2224)
