; ModuleID = 'blender/source/blender/editors/transform/transform_manipulator.c'
source_filename = "blender/source/blender/editors/transform/transform_manipulator.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.UserDef = type { i32, i32, i32, i32, i32, [768 x i8], [768 x i8], [1024 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [1024 x i8], [1024 x i8], i32, i16, i16, i16, i16, i16, i16, i32, i32, i32, i16, i16, i32, i32, i32, i32, i32, i32, i32, i16, i16, i16, i16, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, [64 x i8], i16, i16, i16, i16, i16, i16, i16, i16, [3 x %struct.SolidLight], i16, i16, i16, i16, i16, i16, i16, i16, i32, i32, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i8, i8, i8, i8, i16, i16, i16, i16, i16, i16, float, float, i32, i16, i16, float, i16, i16, i16, i16, %struct.ColorBand, [3 x float], [4 x float], i16, i8, i8, [80 x i8], [1024 x i8], i32, i32, float, float, i32, i16, i16, i16, i16, i16, i16, %struct.WalkNavigation }
%struct.ListBase = type { i8*, i8* }
%struct.SolidLight = type { i32, i32, [4 x float], [4 x float], [4 x float] }
%struct.ColorBand = type { i16, i16, i8, i8, i8, [1 x i8], [32 x %struct.CBData] }
%struct.CBData = type { float, float, float, float, float, i32 }

!352 = !DIEnumerator(name: "TH_ACT_MARKER", value: 142, isUnsigned: true)
!353 = !DIEnumerator(name: "TH_SEL_MARKER", value: 143, isUnsigned: true)
!354 = !DIEnumerator(name: "TH_BUNDLE_SOLID", value: 144, isUnsigned: true)
!355 = !DIEnumerator(name: "TH_DIS_MARKER", value: 145, isUnsigned: true)
!356 = !DIEnumerator(name: "TH_PATH_BEFORE", value: 146, isUnsigned: true)
!357 = !DIEnumerator(name: "TH_PATH_AFTER", value: 147, isUnsigned: true)
!358 = !DIEnumerator(name: "TH_CAMERA_PATH", value: 148, isUnsigned: true)
!359 = !DIEnumerator(name: "TH_LOCK_MARKER", value: 149, isUnsigned: true)
!360 = !DIEnumerator(name: "TH_STITCH_PREVIEW_FACE", value: 150, isUnsigned: true)
!361 = !DIEnumerator(name: "TH_STITCH_PREVIEW_EDGE", value: 151, isUnsigned: true)
!362 = !DIEnumerator(name: "TH_STITCH_PREVIEW_VERT", value: 152, isUnsigned: true)
!363 = !DIEnumerator(name: "TH_STITCH_PREVIEW_STITCHABLE", value: 153, isUnsigned: true)
!364 = !DIEnumerator(name: "TH_STITCH_PREVIEW_UNSTITCHABLE", value: 154, isUnsigned: true)
!365 = !DIEnumerator(name: "TH_STITCH_PREVIEW_ACTIVE", value: 155, isUnsigned: true)
!366 = !DIEnumerator(name: "TH_PAINT_CURVE_HANDLE", value: 156, isUnsigned: true)
!367 = !DIEnumerator(name: "TH_PAINT_CURVE_PIVOT", value: 157, isUnsigned: true)
!368 = !DIEnumerator(name: "TH_UV_SHADOW", value: 158, isUnsigned: true)
!369 = !DIEnumerator(name: "TH_UV_OTHERS", value: 159, isUnsigned: true)
!370 = !DIEnumerator(name: "TH_FREESTYLE_EDGE_MARK", value: 160, isUnsigned: true)
!371 = !DIEnumerator(name: "TH_FREESTYLE_FACE_MARK", value: 161, isUnsigned: true)
!372 = !DIEnumerator(name: "TH_MATCH", value: 162, isUnsigned: true)
!373 = !DIEnumerator(name: "TH_SELECT_HIGHLIGHT", value: 163, isUnsigned: true)
!374 = !DIEnumerator(name: "TH_SKIN_ROOT", value: 164, isUnsigned: true)
!375 = !DIEnumerator(name: "TH_ANIM_ACTIVE", value: 165, isUnsigned: true)
!376 = !DIEnumerator(name: "TH_ANIM_INACTIVE", value: 166, isUnsigned: true)
!377 = !DIEnumerator(name: "TH_NLA_TWEAK", value: 167, isUnsigned: true)
!378 = !DIEnumerator(name: "TH_NLA_TWEAK_DUPLI", value: 168, isUnsigned: true)
!379 = !DIEnumerator(name: "TH_NLA_TRANSITION", value: 169, isUnsigned: true)
!380 = !DIEnumerator(name: "TH_NLA_TRANSITION_SEL", value: 170, isUnsigned: true)
!381 = !DIEnumerator(name: "TH_NLA_META", value: 171, isUnsigned: true)
!382 = !DIEnumerator(name: "TH_NLA_META_SEL", value: 172, isUnsigned: true)
!383 = !DIEnumerator(name: "TH_NLA_SOUND", value: 173, isUnsigned: true)
!384 = !DIEnumerator(name: "TH_NLA_SOUND_SEL", value: 174, isUnsigned: true)
!385 = !DIEnumerator(name: "TH_EMBOSS", value: 175, isUnsigned: true)
!386 = !DIEnumerator(name: "TH_AXIS_X", value: 176, isUnsigned: true)
!387 = !DIEnumerator(name: "TH_AXIS_Y", value: 177, isUnsigned: true)
!388 = !DIEnumerator(name: "TH_AXIS_Z", value: 178, isUnsigned: true)
!389 = !DIEnumerator(name: "TH_LOW_GRAD", value: 179, isUnsigned: true)
!390 = !DIEnumerator(name: "TH_HIGH_GRAD", value: 180, isUnsigned: true)
!391 = !DIEnumerator(name: "TH_SHOW_BACK_GRAD", value: 181, isUnsigned: true)
!392 = !DIEnumerator(name: "TH_INFO_SELECTED", value: 182, isUnsigned: true)
!393 = !DIEnumerator(name: "TH_INFO_SELECTED_TEXT", value: 183, isUnsigned: true)
!394 = !DIEnumerator(name: "TH_INFO_ERROR", value: 184, isUnsigned: true)
!395 = !DIEnumerator(name: "TH_INFO_ERROR_TEXT", value: 185, isUnsigned: true)
!396 = !DIEnumerator(name: "TH_INFO_WARNING", value: 186, isUnsigned: true)
!397 = !DIEnumerator(name: "TH_INFO_WARNING_TEXT", value: 187, isUnsigned: true)
!398 = !DIEnumerator(name: "TH_INFO_INFO", value: 188, isUnsigned: true)
!399 = !DIEnumerator(name: "TH_INFO_INFO_TEXT", value: 189, isUnsigned: true)
!400 = !DIEnumerator(name: "TH_INFO_DEBUG", value: 190, isUnsigned: true)
!401 = !DIEnumerator(name: "TH_INFO_DEBUG_TEXT", value: 191, isUnsigned: true)
!402 = !DIEnumerator(name: "TH_VIEW_OVERLAY", value: 192, isUnsigned: true)
!403 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !404, line: 37, baseType: !7, size: 32, elements: !405)
!404 = !DIFile(filename: "blender/source/blender/gpu/GPU_select.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!405 = !{!406, !407, !408}
!406 = !DIEnumerator(name: "GPU_SELECT_ALL", value: 1, isUnsigned: true)
!407 = !DIEnumerator(name: "GPU_SELECT_NEAREST_FIRST_PASS", value: 2, isUnsigned: true)
!408 = !DIEnumerator(name: "GPU_SELECT_NEAREST_SECOND_PASS", value: 3, isUnsigned: true)
!409 = !{!410, !411, !412, !413, !585, !587, !654, !708, !709, !713, !717, !776, !778, !760, !652, !438, !780}
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!411 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!412 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64)
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "bArmature", file: !126, line: 114, baseType: !415)
!415 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bArmature", file: !126, line: 78, size: 2048, elements: !416)
!416 = !{!417, !486, !489, !490, !491, !493, !538, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !415, file: !126, line: 79, baseType: !418, size: 960)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !419, line: 130, baseType: !420)
!419 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!420 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !419, line: 117, size: 960, elements: !421)
!421 = !{!422, !423, !424, !426, !446, !450, !451, !452, !453, !454}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !420, file: !419, line: 118, baseType: !410, size: 64)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !420, file: !419, line: 118, baseType: !410, size: 64, offset: 64)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !420, file: !419, line: 119, baseType: !425, size: 64, offset: 128)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !420, file: !419, line: 120, baseType: !427, size: 64, offset: 192)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!428 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !419, line: 136, size: 17600, elements: !429)
!429 = !{!430, !431, !433, !436, !441, !442, !443}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !428, file: !419, line: 137, baseType: !418, size: 960)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !428, file: !419, line: 138, baseType: !432, size: 64, offset: 960)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !428, file: !419, line: 139, baseType: !434, size: 64, offset: 1024)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!435 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !419, line: 43, flags: DIFlagFwdDecl)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !428, file: !419, line: 140, baseType: !437, size: 8192, offset: 1088)
!437 = !DICompositeType(tag: DW_TAG_array_type, baseType: !438, size: 8192, elements: !439)
!438 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!439 = !{!440}
!440 = !DISubrange(count: 1024)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !428, file: !419, line: 141, baseType: !437, size: 8192, offset: 9280)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !428, file: !419, line: 148, baseType: !427, size: 64, offset: 17472)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !428, file: !419, line: 150, baseType: !444, size: 64, offset: 17536)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!445 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !419, line: 45, flags: DIFlagFwdDecl)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !420, file: !419, line: 121, baseType: !447, size: 528, offset: 256)
!447 = !DICompositeType(tag: DW_TAG_array_type, baseType: !438, size: 528, elements: !448)
!448 = !{!449}
!449 = !DISubrange(count: 66)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !420, file: !419, line: 126, baseType: !412, size: 16, offset: 784)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !420, file: !419, line: 127, baseType: !19, size: 32, offset: 800)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !420, file: !419, line: 128, baseType: !19, size: 32, offset: 832)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !420, file: !419, line: 128, baseType: !19, size: 32, offset: 864)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !420, file: !419, line: 129, baseType: !455, size: 64, offset: 896)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64)
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !419, line: 75, baseType: !457)
!457 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !419, line: 62, size: 1024, elements: !458)
!458 = !{!459, !461, !462, !463, !464, !465, !469, !470, !484, !485}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !457, file: !419, line: 63, baseType: !460, size: 64)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !457, file: !419, line: 63, baseType: !460, size: 64, offset: 64)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !457, file: !419, line: 64, baseType: !438, size: 8, offset: 128)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !457, file: !419, line: 64, baseType: !438, size: 8, offset: 136)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !457, file: !419, line: 65, baseType: !412, size: 16, offset: 144)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !457, file: !419, line: 66, baseType: !466, size: 512, offset: 160)
!466 = !DICompositeType(tag: DW_TAG_array_type, baseType: !438, size: 512, elements: !467)
!467 = !{!468}
!468 = !DISubrange(count: 64)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !457, file: !419, line: 67, baseType: !19, size: 32, offset: 672)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !457, file: !419, line: 69, baseType: !471, size: 256, offset: 704)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !419, line: 60, baseType: !472)
!472 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !419, line: 48, size: 256, elements: !473)
!473 = !{!474, !475, !482, !483}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !472, file: !419, line: 49, baseType: !410, size: 64)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !472, file: !419, line: 58, baseType: !476, size: 128, offset: 64)
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !477, line: 71, baseType: !478)
!477 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!478 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !477, line: 69, size: 128, elements: !479)
!479 = !{!480, !481}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !478, file: !477, line: 70, baseType: !410, size: 64)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !478, file: !477, line: 70, baseType: !410, size: 64, offset: 64)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !472, file: !419, line: 59, baseType: !19, size: 32, offset: 192)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !472, file: !419, line: 59, baseType: !19, size: 32, offset: 224)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !457, file: !419, line: 70, baseType: !19, size: 32, offset: 960)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !457, file: !419, line: 74, baseType: !19, size: 32, offset: 992)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !415, file: !126, line: 80, baseType: !487, size: 64, offset: 960)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!488 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !126, line: 37, flags: DIFlagFwdDecl)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "bonebase", scope: !415, file: !126, line: 82, baseType: !476, size: 128, offset: 1024)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "chainbase", scope: !415, file: !126, line: 83, baseType: !476, size: 128, offset: 1152)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "edbo", scope: !415, file: !126, line: 84, baseType: !492, size: 64, offset: 1280)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "act_bone", scope: !415, file: !126, line: 92, baseType: !494, size: 64, offset: 1344)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64)
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bone", file: !126, line: 76, baseType: !496)
!496 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Bone", file: !126, line: 48, size: 2624, elements: !497)
!497 = !{!498, !500, !501, !502, !503, !504, !505, !506, !510, !511, !514, !515, !516, !517, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !496, file: !126, line: 49, baseType: !499, size: 64)
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !496, file: !126, line: 49, baseType: !499, size: 64, offset: 64)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !496, file: !126, line: 50, baseType: !455, size: 64, offset: 128)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !496, file: !126, line: 51, baseType: !499, size: 64, offset: 192)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "childbase", scope: !496, file: !126, line: 52, baseType: !476, size: 128, offset: 256)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !496, file: !126, line: 53, baseType: !466, size: 512, offset: 384)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "roll", scope: !496, file: !126, line: 55, baseType: !411, size: 32, offset: 896)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !496, file: !126, line: 56, baseType: !507, size: 96, offset: 928)
!507 = !DICompositeType(tag: DW_TAG_array_type, baseType: !411, size: 96, elements: !508)
!508 = !{!509}
!509 = !DISubrange(count: 3)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !496, file: !126, line: 57, baseType: !507, size: 96, offset: 1024)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "bone_mat", scope: !496, file: !126, line: 58, baseType: !512, size: 288, offset: 1120)
!512 = !DICompositeType(tag: DW_TAG_array_type, baseType: !411, size: 288, elements: !513)
!513 = !{!509, !509}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !496, file: !126, line: 60, baseType: !19, size: 32, offset: 1408)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "arm_head", scope: !496, file: !126, line: 62, baseType: !507, size: 96, offset: 1440)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "arm_tail", scope: !496, file: !126, line: 63, baseType: !507, size: 96, offset: 1536)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "arm_mat", scope: !496, file: !126, line: 64, baseType: !518, size: 512, offset: 1632)
!518 = !DICompositeType(tag: DW_TAG_array_type, baseType: !411, size: 512, elements: !519)
!519 = !{!520, !520}
!520 = !DISubrange(count: 4)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "arm_roll", scope: !496, file: !126, line: 65, baseType: !411, size: 32, offset: 2144)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !496, file: !126, line: 67, baseType: !411, size: 32, offset: 2176)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !496, file: !126, line: 67, baseType: !411, size: 32, offset: 2208)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "xwidth", scope: !496, file: !126, line: 68, baseType: !411, size: 32, offset: 2240)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !496, file: !126, line: 68, baseType: !411, size: 32, offset: 2272)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "zwidth", scope: !496, file: !126, line: 68, baseType: !411, size: 32, offset: 2304)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "ease1", scope: !496, file: !126, line: 69, baseType: !411, size: 32, offset: 2336)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "ease2", scope: !496, file: !126, line: 69, baseType: !411, size: 32, offset: 2368)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "rad_head", scope: !496, file: !126, line: 70, baseType: !411, size: 32, offset: 2400)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "rad_tail", scope: !496, file: !126, line: 70, baseType: !411, size: 32, offset: 2432)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !496, file: !126, line: 72, baseType: !507, size: 96, offset: 2464)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !496, file: !126, line: 73, baseType: !19, size: 32, offset: 2560)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "segments", scope: !496, file: !126, line: 74, baseType: !412, size: 16, offset: 2592)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !496, file: !126, line: 75, baseType: !535, size: 16, offset: 2608)
!535 = !DICompositeType(tag: DW_TAG_array_type, baseType: !412, size: 16, elements: !536)
!536 = !{!537}
!537 = !DISubrange(count: 1)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "act_edbone", scope: !415, file: !126, line: 93, baseType: !539, size: 64, offset: 1408)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64)
!540 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EditBone", file: !541, line: 56, size: 1472, elements: !542)
!541 = !DIFile(filename: "blender/source/blender/editors/include/ED_armature.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!542 = !{!543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !540, file: !541, line: 57, baseType: !539, size: 64)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !540, file: !541, line: 57, baseType: !539, size: 64, offset: 64)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !540, file: !541, line: 58, baseType: !460, size: 64, offset: 128)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !540, file: !541, line: 59, baseType: !539, size: 64, offset: 192)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !540, file: !541, line: 62, baseType: !410, size: 64, offset: 256)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !540, file: !541, line: 64, baseType: !466, size: 512, offset: 320)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "roll", scope: !540, file: !541, line: 65, baseType: !411, size: 32, offset: 832)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !540, file: !541, line: 70, baseType: !507, size: 96, offset: 864)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !540, file: !541, line: 71, baseType: !507, size: 96, offset: 960)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !540, file: !541, line: 75, baseType: !19, size: 32, offset: 1056)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !540, file: !541, line: 76, baseType: !19, size: 32, offset: 1088)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !540, file: !541, line: 78, baseType: !411, size: 32, offset: 1120)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !540, file: !541, line: 78, baseType: !411, size: 32, offset: 1152)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "xwidth", scope: !540, file: !541, line: 79, baseType: !411, size: 32, offset: 1184)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !540, file: !541, line: 79, baseType: !411, size: 32, offset: 1216)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "zwidth", scope: !540, file: !541, line: 79, baseType: !411, size: 32, offset: 1248)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "ease1", scope: !540, file: !541, line: 80, baseType: !411, size: 32, offset: 1280)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "ease2", scope: !540, file: !541, line: 80, baseType: !411, size: 32, offset: 1312)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "rad_head", scope: !540, file: !541, line: 81, baseType: !411, size: 32, offset: 1344)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "rad_tail", scope: !540, file: !541, line: 81, baseType: !411, size: 32, offset: 1376)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "oldlength", scope: !540, file: !541, line: 83, baseType: !411, size: 32, offset: 1408)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "segments", scope: !540, file: !541, line: 85, baseType: !412, size: 16, offset: 1440)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "sketch", scope: !415, file: !126, line: 95, baseType: !410, size: 64, offset: 1472)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !415, file: !126, line: 97, baseType: !19, size: 32, offset: 1536)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "drawtype", scope: !415, file: !126, line: 98, baseType: !19, size: 32, offset: 1568)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "gevertdeformer", scope: !415, file: !126, line: 99, baseType: !19, size: 32, offset: 1600)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !415, file: !126, line: 100, baseType: !19, size: 32, offset: 1632)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "deformflag", scope: !415, file: !126, line: 101, baseType: !412, size: 16, offset: 1664)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "pathflag", scope: !415, file: !126, line: 102, baseType: !412, size: 16, offset: 1680)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "layer_used", scope: !415, file: !126, line: 104, baseType: !7, size: 32, offset: 1696)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !415, file: !126, line: 105, baseType: !7, size: 32, offset: 1728)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "layer_protected", scope: !415, file: !126, line: 105, baseType: !7, size: 32, offset: 1760)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "ghostep", scope: !415, file: !126, line: 108, baseType: !412, size: 16, offset: 1792)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "ghostsize", scope: !415, file: !126, line: 108, baseType: !412, size: 16, offset: 1808)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "ghosttype", scope: !415, file: !126, line: 109, baseType: !412, size: 16, offset: 1824)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "pathsize", scope: !415, file: !126, line: 109, baseType: !412, size: 16, offset: 1840)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "ghostsf", scope: !415, file: !126, line: 110, baseType: !19, size: 32, offset: 1856)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "ghostef", scope: !415, file: !126, line: 110, baseType: !19, size: 32, offset: 1888)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "pathsf", scope: !415, file: !126, line: 111, baseType: !19, size: 32, offset: 1920)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "pathef", scope: !415, file: !126, line: 111, baseType: !19, size: 32, offset: 1952)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "pathbc", scope: !415, file: !126, line: 112, baseType: !19, size: 32, offset: 1984)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "pathac", scope: !415, file: !126, line: 112, baseType: !19, size: 32, offset: 2016)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64)
!586 = !DIDerivedType(tag: DW_TAG_typedef, name: "EditBone", file: !541, line: 86, baseType: !540)
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 64)
!588 = !DIDerivedType(tag: DW_TAG_typedef, name: "MetaBall", file: !589, line: 95, baseType: !590)
!589 = !DIFile(filename: "blender/source/blender/makesdna/DNA_meta_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!590 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MetaBall", file: !589, line: 64, size: 1984, elements: !591)
!591 = !{!592, !593, !594, !595, !596, !597, !601, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616}
!592 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !590, file: !589, line: 65, baseType: !418, size: 960)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !590, file: !589, line: 66, baseType: !487, size: 64, offset: 960)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "elems", scope: !590, file: !589, line: 68, baseType: !476, size: 128, offset: 1024)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "disp", scope: !590, file: !589, line: 69, baseType: !476, size: 128, offset: 1152)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "editelems", scope: !590, file: !589, line: 70, baseType: !492, size: 64, offset: 1280)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !590, file: !589, line: 71, baseType: !598, size: 64, offset: 1344)
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !599, size: 64)
!599 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !600, line: 44, flags: DIFlagFwdDecl)
!600 = !DIFile(filename: "blender/source/blender/makesdna/DNA_curve_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!601 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !590, file: !589, line: 74, baseType: !602, size: 64, offset: 1408)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64)
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 64)
!604 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !600, line: 46, flags: DIFlagFwdDecl)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !590, file: !589, line: 76, baseType: !438, size: 8, offset: 1472)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "flag2", scope: !590, file: !589, line: 76, baseType: !438, size: 8, offset: 1480)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !590, file: !589, line: 77, baseType: !412, size: 16, offset: 1488)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "texflag", scope: !590, file: !589, line: 78, baseType: !412, size: 16, offset: 1504)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !590, file: !589, line: 78, baseType: !412, size: 16, offset: 1520)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !590, file: !589, line: 81, baseType: !507, size: 96, offset: 1536)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !590, file: !589, line: 82, baseType: !507, size: 96, offset: 1632)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !590, file: !589, line: 83, baseType: !507, size: 96, offset: 1728)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "wiresize", scope: !590, file: !589, line: 85, baseType: !411, size: 32, offset: 1824)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "rendersize", scope: !590, file: !589, line: 85, baseType: !411, size: 32, offset: 1856)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "thresh", scope: !590, file: !589, line: 90, baseType: !411, size: 32, offset: 1888)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "lastelem", scope: !590, file: !589, line: 94, baseType: !617, size: 64, offset: 1920)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64)
!618 = !DIDerivedType(tag: DW_TAG_typedef, name: "MetaElem", file: !589, line: 62, baseType: !619)
!619 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MetaElem", file: !589, line: 44, size: 832, elements: !620)
!620 = !{!621, !623, !624, !634, !635, !636, !637, !638, !639, !640, !641, !644, !645, !646, !647, !648, !649, !650, !651, !653}
!621 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !619, file: !589, line: 45, baseType: !622, size: 64)
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !619, size: 64)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !619, file: !589, line: 45, baseType: !622, size: 64, offset: 64)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !619, file: !589, line: 47, baseType: !625, size: 64, offset: 128)
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 64)
!626 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !6, line: 97, size: 832, elements: !627)
!627 = !{!628, !632, !633}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !626, file: !6, line: 98, baseType: !629, size: 768)
!629 = !DICompositeType(tag: DW_TAG_array_type, baseType: !411, size: 768, elements: !630)
!630 = !{!631, !509}
!631 = !DISubrange(count: 8)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !626, file: !6, line: 99, baseType: !19, size: 32, offset: 768)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !626, file: !6, line: 99, baseType: !19, size: 32, offset: 800)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !619, file: !589, line: 49, baseType: !412, size: 16, offset: 192)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !619, file: !589, line: 49, baseType: !412, size: 16, offset: 208)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "selcol1", scope: !619, file: !589, line: 49, baseType: !412, size: 16, offset: 224)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "selcol2", scope: !619, file: !589, line: 49, baseType: !412, size: 16, offset: 240)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !619, file: !589, line: 50, baseType: !411, size: 32, offset: 256)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !619, file: !589, line: 50, baseType: !411, size: 32, offset: 288)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !619, file: !589, line: 50, baseType: !411, size: 32, offset: 320)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !619, file: !589, line: 51, baseType: !642, size: 128, offset: 352)
!642 = !DICompositeType(tag: DW_TAG_array_type, baseType: !411, size: 128, elements: !643)
!643 = !{!520}
!644 = !DIDerivedType(tag: DW_TAG_member, name: "expx", scope: !619, file: !589, line: 52, baseType: !411, size: 32, offset: 480)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "expy", scope: !619, file: !589, line: 53, baseType: !411, size: 32, offset: 512)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "expz", scope: !619, file: !589, line: 54, baseType: !411, size: 32, offset: 544)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "rad", scope: !619, file: !589, line: 55, baseType: !411, size: 32, offset: 576)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "rad2", scope: !619, file: !589, line: 56, baseType: !411, size: 32, offset: 608)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !619, file: !589, line: 57, baseType: !411, size: 32, offset: 640)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !619, file: !589, line: 58, baseType: !411, size: 32, offset: 672)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !619, file: !589, line: 60, baseType: !652, size: 64, offset: 704)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !619, file: !589, line: 60, baseType: !652, size: 64, offset: 768)
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 64)
!655 = !DIDerivedType(tag: DW_TAG_typedef, name: "Lattice", file: !656, line: 72, baseType: !657)
!656 = !DIFile(filename: "blender/source/blender/makesdna/DNA_lattice_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!657 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Lattice", file: !656, line: 52, size: 2240, elements: !658)
!658 = !{!659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !691, !692, !695, !698, !699}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !657, file: !656, line: 53, baseType: !418, size: 960)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !657, file: !656, line: 54, baseType: !487, size: 64, offset: 960)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "pntsu", scope: !657, file: !656, line: 56, baseType: !412, size: 16, offset: 1024)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "pntsv", scope: !657, file: !656, line: 56, baseType: !412, size: 16, offset: 1040)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "pntsw", scope: !657, file: !656, line: 56, baseType: !412, size: 16, offset: 1056)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !657, file: !656, line: 56, baseType: !412, size: 16, offset: 1072)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "opntsu", scope: !657, file: !656, line: 57, baseType: !412, size: 16, offset: 1088)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "opntsv", scope: !657, file: !656, line: 57, baseType: !412, size: 16, offset: 1104)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "opntsw", scope: !657, file: !656, line: 57, baseType: !412, size: 16, offset: 1120)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !657, file: !656, line: 57, baseType: !412, size: 16, offset: 1136)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "typeu", scope: !657, file: !656, line: 58, baseType: !438, size: 8, offset: 1152)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "typev", scope: !657, file: !656, line: 58, baseType: !438, size: 8, offset: 1160)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "typew", scope: !657, file: !656, line: 58, baseType: !438, size: 8, offset: 1168)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !657, file: !656, line: 58, baseType: !438, size: 8, offset: 1176)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "actbp", scope: !657, file: !656, line: 59, baseType: !19, size: 32, offset: 1184)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "fu", scope: !657, file: !656, line: 61, baseType: !411, size: 32, offset: 1216)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "fv", scope: !657, file: !656, line: 61, baseType: !411, size: 32, offset: 1248)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "fw", scope: !657, file: !656, line: 61, baseType: !411, size: 32, offset: 1280)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "du", scope: !657, file: !656, line: 61, baseType: !411, size: 32, offset: 1312)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "dv", scope: !657, file: !656, line: 61, baseType: !411, size: 32, offset: 1344)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "dw", scope: !657, file: !656, line: 61, baseType: !411, size: 32, offset: 1376)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "def", scope: !657, file: !656, line: 63, baseType: !681, size: 64, offset: 1408)
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64)
!682 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BPoint", file: !600, line: 136, size: 288, elements: !683)
!683 = !{!684, !685, !686, !687, !688, !689, !690}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !682, file: !600, line: 137, baseType: !642, size: 128)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "alfa", scope: !682, file: !600, line: 138, baseType: !411, size: 32, offset: 128)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !682, file: !600, line: 138, baseType: !411, size: 32, offset: 160)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "f1", scope: !682, file: !600, line: 139, baseType: !412, size: 16, offset: 192)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "hide", scope: !682, file: !600, line: 139, baseType: !412, size: 16, offset: 208)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "radius", scope: !682, file: !600, line: 140, baseType: !411, size: 32, offset: 224)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !682, file: !600, line: 140, baseType: !411, size: 32, offset: 256)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !657, file: !656, line: 65, baseType: !598, size: 64, offset: 1472)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !657, file: !656, line: 66, baseType: !693, size: 64, offset: 1536)
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 64)
!694 = !DICompositeType(tag: DW_TAG_structure_type, name: "Key", file: !600, line: 45, flags: DIFlagFwdDecl)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "dvert", scope: !657, file: !656, line: 68, baseType: !696, size: 64, offset: 1600)
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 64)
!697 = !DICompositeType(tag: DW_TAG_structure_type, name: "MDeformVert", file: !656, line: 42, flags: DIFlagFwdDecl)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "vgroup", scope: !657, file: !656, line: 69, baseType: !466, size: 512, offset: 1664)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "editlatt", scope: !657, file: !656, line: 71, baseType: !700, size: 64, offset: 2176)
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !701, size: 64)
!701 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EditLatt", file: !656, line: 44, size: 128, elements: !702)
!702 = !{!703, !705, !706}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "latt", scope: !701, file: !656, line: 45, baseType: !704, size: 64)
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 64)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !701, file: !656, line: 47, baseType: !19, size: 32, offset: 64)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !701, file: !656, line: 49, baseType: !707, size: 32, offset: 96)
!707 = !DICompositeType(tag: DW_TAG_array_type, baseType: !438, size: 32, elements: !643)
!708 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIterType", file: !99, line: 79, baseType: !98)
!709 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter__begin_cb", file: !99, line: 158, baseType: !710)
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 64)
!711 = !DISubroutineType(types: !712)
!712 = !{null, !410}
!713 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter__step_cb", file: !99, line: 159, baseType: !714)
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 64)
!715 = !DISubroutineType(types: !716)
!716 = !{!410, !410}
!717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !718, size: 64)
!718 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMVert", file: !116, line: 103, baseType: !719)
!719 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMVert", file: !116, line: 90, size: 448, elements: !720)
!720 = !{!721, !730, !735, !736, !737}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !719, file: !116, line: 91, baseType: !722, size: 128)
!722 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMHeader", file: !116, line: 82, baseType: !723)
!723 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMHeader", file: !116, line: 64, size: 128, elements: !724)
!724 = !{!725, !726, !727, !728, !729}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !723, file: !116, line: 65, baseType: !410, size: 64)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !723, file: !116, line: 66, baseType: !19, size: 32, offset: 64)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !723, file: !116, line: 73, baseType: !438, size: 8, offset: 96)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "hflag", scope: !723, file: !116, line: 74, baseType: !438, size: 8, offset: 104)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "api_flag", scope: !723, file: !116, line: 80, baseType: !438, size: 8, offset: 112)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !719, file: !116, line: 92, baseType: !731, size: 64, offset: 128)
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !732, size: 64)
!732 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFlagLayer", file: !116, line: 180, size: 16, elements: !733)
!733 = !{!734}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !732, file: !116, line: 181, baseType: !412, size: 16)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !719, file: !116, line: 94, baseType: !507, size: 96, offset: 192)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !719, file: !116, line: 95, baseType: !507, size: 96, offset: 288)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !719, file: !116, line: 102, baseType: !738, size: 64, offset: 384)
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 64)
!739 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMEdge", file: !116, line: 110, size: 640, elements: !740)
!740 = !{!741, !742, !743, !745, !746, !769, !775}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !739, file: !116, line: 111, baseType: !722, size: 128)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !739, file: !116, line: 112, baseType: !731, size: 64, offset: 128)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !739, file: !116, line: 114, baseType: !744, size: 64, offset: 192)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 64)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !739, file: !116, line: 114, baseType: !744, size: 64, offset: 256)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !739, file: !116, line: 118, baseType: !747, size: 64, offset: 320)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64)
!748 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMLoop", file: !116, line: 125, size: 576, elements: !749)
!749 = !{!750, !751, !752, !753, !765, !766, !767, !768}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !748, file: !116, line: 126, baseType: !722, size: 128)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !748, file: !116, line: 129, baseType: !744, size: 64, offset: 128)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !748, file: !116, line: 130, baseType: !738, size: 64, offset: 192)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !748, file: !116, line: 131, baseType: !754, size: 64, offset: 256)
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 64)
!755 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFace", file: !116, line: 164, size: 448, elements: !756)
!756 = !{!757, !758, !759, !762, !763, !764}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !755, file: !116, line: 165, baseType: !722, size: 128)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !755, file: !116, line: 166, baseType: !731, size: 64, offset: 128)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !755, file: !116, line: 172, baseType: !760, size: 64, offset: 192)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64)
!761 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMLoop", file: !116, line: 140, baseType: !748)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !755, file: !116, line: 174, baseType: !19, size: 32, offset: 256)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !755, file: !116, line: 175, baseType: !507, size: 96, offset: 288)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !755, file: !116, line: 176, baseType: !412, size: 16, offset: 384)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "radial_next", scope: !748, file: !116, line: 135, baseType: !747, size: 64, offset: 320)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "radial_prev", scope: !748, file: !116, line: 135, baseType: !747, size: 64, offset: 384)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !748, file: !116, line: 139, baseType: !747, size: 64, offset: 448)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !748, file: !116, line: 139, baseType: !747, size: 64, offset: 512)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "v1_disk_link", scope: !739, file: !116, line: 122, baseType: !770, size: 128, offset: 384)
!770 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMDiskLink", file: !116, line: 108, baseType: !771)
!771 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMDiskLink", file: !116, line: 106, size: 128, elements: !772)
!772 = !{!773, !774}
!773 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !771, file: !116, line: 107, baseType: !738, size: 64)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !771, file: !116, line: 107, baseType: !738, size: 64, offset: 64)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "v2_disk_link", scope: !739, file: !116, line: 122, baseType: !770, size: 128, offset: 512)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 64)
!777 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMEdge", file: !116, line: 123, baseType: !739)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 64)
!779 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMFace", file: !116, line: 178, baseType: !755)
!780 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!781 = !{!0}
!782 = !{i32 7, !"Dwarf Version", i32 4}
!783 = !{i32 2, !"Debug Info Version", i32 3}
!784 = !{i32 1, !"wchar_size", i32 4}
!785 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!786 = distinct !DISubprogram(name: "gimbal_axis", scope: !3, file: !3, line: 196, type: !787, scopeLine: 197, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !3031)
!787 = !DISubroutineType(types: !788)
!788 = !{!789, !790, !3030}
!789 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !791, size: 64)
!791 = !DIDerivedType(tag: DW_TAG_typedef, name: "Object", file: !6, line: 295, baseType: !792)
!792 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !6, line: 115, size: 11392, elements: !793)
!793 = !{!794, !795, !796, !799, !800, !801, !802, !803, !804, !805, !807, !808, !809, !810, !811, !812, !813, !826, !827, !868, !869, !873, !874, !890, !891, !892, !893, !894, !895, !896, !897, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !2219, !2969, !2970, !2971, !2972, !2973, !2974, !2977, !2999, !3000, !3001, !3002, !3003, !3004, !3005, !3006, !3007, !3008, !3011, !3014, !3015, !3018, !3019}
!794 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !792, file: !6, line: 116, baseType: !418, size: 960)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !792, file: !6, line: 117, baseType: !487, size: 64, offset: 960)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !792, file: !6, line: 119, baseType: !797, size: 64, offset: 1024)
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !798, size: 64)
!798 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !6, line: 57, flags: DIFlagFwdDecl)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !792, file: !6, line: 121, baseType: !412, size: 16, offset: 1088)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !792, file: !6, line: 121, baseType: !412, size: 16, offset: 1104)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !792, file: !6, line: 122, baseType: !19, size: 32, offset: 1120)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !792, file: !6, line: 122, baseType: !19, size: 32, offset: 1152)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !792, file: !6, line: 122, baseType: !19, size: 32, offset: 1184)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !792, file: !6, line: 123, baseType: !466, size: 512, offset: 1216)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !792, file: !6, line: 124, baseType: !806, size: 64, offset: 1728)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 64)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !792, file: !6, line: 124, baseType: !806, size: 64, offset: 1792)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !792, file: !6, line: 127, baseType: !806, size: 64, offset: 1856)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !792, file: !6, line: 127, baseType: !806, size: 64, offset: 1920)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !792, file: !6, line: 127, baseType: !806, size: 64, offset: 1984)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !792, file: !6, line: 128, baseType: !598, size: 64, offset: 2048)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !792, file: !6, line: 130, baseType: !625, size: 64, offset: 2112)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !792, file: !6, line: 131, baseType: !814, size: 64, offset: 2176)
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !815, size: 64)
!815 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !18, line: 486, size: 1600, elements: !816)
!816 = !{!817, !818, !819, !820, !821, !822, !823, !824, !825}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !815, file: !18, line: 487, baseType: !418, size: 960)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !815, file: !18, line: 489, baseType: !476, size: 128, offset: 960)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !815, file: !18, line: 490, baseType: !476, size: 128, offset: 1088)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !815, file: !18, line: 491, baseType: !476, size: 128, offset: 1216)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !815, file: !18, line: 492, baseType: !476, size: 128, offset: 1344)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !815, file: !18, line: 494, baseType: !19, size: 32, offset: 1472)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !815, file: !18, line: 495, baseType: !19, size: 32, offset: 1504)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !815, file: !18, line: 497, baseType: !19, size: 32, offset: 1536)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !815, file: !18, line: 498, baseType: !19, size: 32, offset: 1568)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !792, file: !6, line: 132, baseType: !814, size: 64, offset: 2240)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !792, file: !6, line: 133, baseType: !828, size: 64, offset: 2304)
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !829, size: 64)
!829 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !18, line: 334, size: 1728, elements: !830)
!830 = !{!831, !832, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !867}
!831 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !829, file: !18, line: 335, baseType: !476, size: 128)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !829, file: !18, line: 336, baseType: !833, size: 64, offset: 128)
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !834, size: 64)
!834 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !600, line: 51, flags: DIFlagFwdDecl)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !829, file: !18, line: 338, baseType: !412, size: 16, offset: 192)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !829, file: !18, line: 338, baseType: !412, size: 16, offset: 208)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !829, file: !18, line: 339, baseType: !7, size: 32, offset: 224)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !829, file: !18, line: 340, baseType: !19, size: 32, offset: 256)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !829, file: !18, line: 342, baseType: !411, size: 32, offset: 288)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !829, file: !18, line: 343, baseType: !507, size: 96, offset: 320)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !829, file: !18, line: 344, baseType: !507, size: 96, offset: 416)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !829, file: !18, line: 347, baseType: !476, size: 128, offset: 512)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !829, file: !18, line: 349, baseType: !19, size: 32, offset: 640)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !829, file: !18, line: 350, baseType: !19, size: 32, offset: 672)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !829, file: !18, line: 351, baseType: !410, size: 64, offset: 704)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !829, file: !18, line: 352, baseType: !410, size: 64, offset: 768)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !829, file: !18, line: 354, baseType: !848, size: 384, offset: 832)
!848 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !18, line: 116, baseType: !849)
!849 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !18, line: 94, size: 384, elements: !850)
!850 = !{!851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866}
!851 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !849, file: !18, line: 96, baseType: !19, size: 32)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !849, file: !18, line: 96, baseType: !19, size: 32, offset: 32)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !849, file: !18, line: 97, baseType: !19, size: 32, offset: 64)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !849, file: !18, line: 97, baseType: !19, size: 32, offset: 96)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !849, file: !18, line: 99, baseType: !412, size: 16, offset: 128)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !849, file: !18, line: 100, baseType: !412, size: 16, offset: 144)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !849, file: !18, line: 102, baseType: !412, size: 16, offset: 160)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !849, file: !18, line: 105, baseType: !412, size: 16, offset: 176)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !849, file: !18, line: 108, baseType: !412, size: 16, offset: 192)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !849, file: !18, line: 109, baseType: !412, size: 16, offset: 208)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !849, file: !18, line: 111, baseType: !412, size: 16, offset: 224)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !849, file: !18, line: 112, baseType: !412, size: 16, offset: 240)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !849, file: !18, line: 114, baseType: !19, size: 32, offset: 256)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !849, file: !18, line: 114, baseType: !19, size: 32, offset: 288)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !849, file: !18, line: 115, baseType: !19, size: 32, offset: 320)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !849, file: !18, line: 115, baseType: !19, size: 32, offset: 352)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !829, file: !18, line: 355, baseType: !466, size: 512, offset: 1216)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !792, file: !6, line: 134, baseType: !410, size: 64, offset: 2368)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !792, file: !6, line: 136, baseType: !870, size: 64, offset: 2432)
!870 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !871, size: 64)
!871 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !872, line: 61, flags: DIFlagFwdDecl)
!872 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!873 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !792, file: !6, line: 138, baseType: !848, size: 384, offset: 2496)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !792, file: !6, line: 139, baseType: !875, size: 64, offset: 2880)
!875 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !876, size: 64)
!876 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !18, line: 80, baseType: !877)
!877 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !18, line: 72, size: 192, elements: !878)
!878 = !{!879, !886, !887, !888, !889}
!879 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !877, file: !18, line: 73, baseType: !880, size: 64)
!880 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !881, size: 64)
!881 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !18, line: 59, baseType: !882)
!882 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !18, line: 56, size: 128, elements: !883)
!883 = !{!884, !885}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !882, file: !18, line: 57, baseType: !507, size: 96)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !882, file: !18, line: 58, baseType: !19, size: 32, offset: 96)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !877, file: !18, line: 74, baseType: !19, size: 32, offset: 64)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !877, file: !18, line: 76, baseType: !19, size: 32, offset: 96)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !877, file: !18, line: 77, baseType: !19, size: 32, offset: 128)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !877, file: !18, line: 79, baseType: !19, size: 32, offset: 160)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !792, file: !6, line: 141, baseType: !476, size: 128, offset: 2944)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !792, file: !6, line: 142, baseType: !476, size: 128, offset: 3072)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !792, file: !6, line: 143, baseType: !476, size: 128, offset: 3200)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !792, file: !6, line: 144, baseType: !476, size: 128, offset: 3328)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !792, file: !6, line: 146, baseType: !19, size: 32, offset: 3456)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !792, file: !6, line: 147, baseType: !19, size: 32, offset: 3488)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !792, file: !6, line: 150, baseType: !602, size: 64, offset: 3520)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !792, file: !6, line: 151, baseType: !898, size: 64, offset: 3584)
!898 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !792, file: !6, line: 152, baseType: !19, size: 32, offset: 3648)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !792, file: !6, line: 153, baseType: !19, size: 32, offset: 3680)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !792, file: !6, line: 156, baseType: !507, size: 96, offset: 3712)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !792, file: !6, line: 156, baseType: !507, size: 96, offset: 3808)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !792, file: !6, line: 156, baseType: !507, size: 96, offset: 3904)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !792, file: !6, line: 157, baseType: !507, size: 96, offset: 4000)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !792, file: !6, line: 158, baseType: !507, size: 96, offset: 4096)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !792, file: !6, line: 159, baseType: !507, size: 96, offset: 4192)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !792, file: !6, line: 160, baseType: !507, size: 96, offset: 4288)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !792, file: !6, line: 160, baseType: !507, size: 96, offset: 4384)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !792, file: !6, line: 161, baseType: !642, size: 128, offset: 4480)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !792, file: !6, line: 161, baseType: !642, size: 128, offset: 4608)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !792, file: !6, line: 162, baseType: !507, size: 96, offset: 4736)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !792, file: !6, line: 162, baseType: !507, size: 96, offset: 4832)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !792, file: !6, line: 163, baseType: !411, size: 32, offset: 4928)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !792, file: !6, line: 163, baseType: !411, size: 32, offset: 4960)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !792, file: !6, line: 164, baseType: !518, size: 512, offset: 4992)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !792, file: !6, line: 165, baseType: !518, size: 512, offset: 5504)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !792, file: !6, line: 166, baseType: !518, size: 512, offset: 6016)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !792, file: !6, line: 167, baseType: !518, size: 512, offset: 6528)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !792, file: !6, line: 176, baseType: !518, size: 512, offset: 7040)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !792, file: !6, line: 178, baseType: !7, size: 32, offset: 7552)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !792, file: !6, line: 180, baseType: !412, size: 16, offset: 7584)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !792, file: !6, line: 181, baseType: !412, size: 16, offset: 7600)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !792, file: !6, line: 183, baseType: !412, size: 16, offset: 7616)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !792, file: !6, line: 183, baseType: !412, size: 16, offset: 7632)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !792, file: !6, line: 184, baseType: !412, size: 16, offset: 7648)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !792, file: !6, line: 184, baseType: !412, size: 16, offset: 7664)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !792, file: !6, line: 185, baseType: !412, size: 16, offset: 7680)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !792, file: !6, line: 186, baseType: !412, size: 16, offset: 7696)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !792, file: !6, line: 187, baseType: !412, size: 16, offset: 7712)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !792, file: !6, line: 188, baseType: !438, size: 8, offset: 7728)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !792, file: !6, line: 189, baseType: !438, size: 8, offset: 7736)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !792, file: !6, line: 192, baseType: !19, size: 32, offset: 7744)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !792, file: !6, line: 192, baseType: !19, size: 32, offset: 7776)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !792, file: !6, line: 192, baseType: !19, size: 32, offset: 7808)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !792, file: !6, line: 192, baseType: !19, size: 32, offset: 7840)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !792, file: !6, line: 194, baseType: !19, size: 32, offset: 7872)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !792, file: !6, line: 202, baseType: !411, size: 32, offset: 7904)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !792, file: !6, line: 202, baseType: !411, size: 32, offset: 7936)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !792, file: !6, line: 202, baseType: !411, size: 32, offset: 7968)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !792, file: !6, line: 211, baseType: !411, size: 32, offset: 8000)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !792, file: !6, line: 212, baseType: !411, size: 32, offset: 8032)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !792, file: !6, line: 213, baseType: !411, size: 32, offset: 8064)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !792, file: !6, line: 214, baseType: !411, size: 32, offset: 8096)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !792, file: !6, line: 215, baseType: !411, size: 32, offset: 8128)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !792, file: !6, line: 216, baseType: !411, size: 32, offset: 8160)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !792, file: !6, line: 219, baseType: !411, size: 32, offset: 8192)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !792, file: !6, line: 220, baseType: !411, size: 32, offset: 8224)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !792, file: !6, line: 221, baseType: !411, size: 32, offset: 8256)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !792, file: !6, line: 224, baseType: !950, size: 16, offset: 8288)
!950 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !792, file: !6, line: 224, baseType: !950, size: 16, offset: 8304)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !792, file: !6, line: 226, baseType: !412, size: 16, offset: 8320)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !792, file: !6, line: 228, baseType: !438, size: 8, offset: 8336)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !792, file: !6, line: 229, baseType: !438, size: 8, offset: 8344)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !792, file: !6, line: 231, baseType: !412, size: 16, offset: 8352)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !792, file: !6, line: 232, baseType: !438, size: 8, offset: 8368)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !792, file: !6, line: 233, baseType: !438, size: 8, offset: 8376)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !792, file: !6, line: 234, baseType: !411, size: 32, offset: 8384)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !792, file: !6, line: 235, baseType: !411, size: 32, offset: 8416)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !792, file: !6, line: 237, baseType: !476, size: 128, offset: 8448)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !792, file: !6, line: 238, baseType: !476, size: 128, offset: 8576)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !792, file: !6, line: 239, baseType: !476, size: 128, offset: 8704)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !792, file: !6, line: 240, baseType: !476, size: 128, offset: 8832)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !792, file: !6, line: 242, baseType: !411, size: 32, offset: 8960)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !792, file: !6, line: 244, baseType: !412, size: 16, offset: 8992)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !792, file: !6, line: 245, baseType: !950, size: 16, offset: 9008)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !792, file: !6, line: 246, baseType: !642, size: 128, offset: 9024)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !792, file: !6, line: 248, baseType: !19, size: 32, offset: 9152)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !792, file: !6, line: 249, baseType: !19, size: 32, offset: 9184)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !792, file: !6, line: 251, baseType: !971, size: 64, offset: 9216)
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64)
!972 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !973, line: 215, size: 960, elements: !974)
!973 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_force.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!974 = !{!975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004}
!975 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !972, file: !973, line: 216, baseType: !19, size: 32)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "linStiff", scope: !972, file: !973, line: 217, baseType: !411, size: 32, offset: 32)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "angStiff", scope: !972, file: !973, line: 218, baseType: !411, size: 32, offset: 64)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "volume", scope: !972, file: !973, line: 219, baseType: !411, size: 32, offset: 96)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "viterations", scope: !972, file: !973, line: 221, baseType: !19, size: 32, offset: 128)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "piterations", scope: !972, file: !973, line: 222, baseType: !19, size: 32, offset: 160)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "diterations", scope: !972, file: !973, line: 223, baseType: !19, size: 32, offset: 192)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "citerations", scope: !972, file: !973, line: 224, baseType: !19, size: 32, offset: 224)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "kSRHR_CL", scope: !972, file: !973, line: 226, baseType: !411, size: 32, offset: 256)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "kSKHR_CL", scope: !972, file: !973, line: 227, baseType: !411, size: 32, offset: 288)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "kSSHR_CL", scope: !972, file: !973, line: 228, baseType: !411, size: 32, offset: 320)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "kSR_SPLT_CL", scope: !972, file: !973, line: 229, baseType: !411, size: 32, offset: 352)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "kSK_SPLT_CL", scope: !972, file: !973, line: 231, baseType: !411, size: 32, offset: 384)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "kSS_SPLT_CL", scope: !972, file: !973, line: 232, baseType: !411, size: 32, offset: 416)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "kVCF", scope: !972, file: !973, line: 233, baseType: !411, size: 32, offset: 448)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "kDP", scope: !972, file: !973, line: 234, baseType: !411, size: 32, offset: 480)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "kDG", scope: !972, file: !973, line: 236, baseType: !411, size: 32, offset: 512)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "kLF", scope: !972, file: !973, line: 237, baseType: !411, size: 32, offset: 544)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "kPR", scope: !972, file: !973, line: 238, baseType: !411, size: 32, offset: 576)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "kVC", scope: !972, file: !973, line: 239, baseType: !411, size: 32, offset: 608)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "kDF", scope: !972, file: !973, line: 241, baseType: !411, size: 32, offset: 640)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "kMT", scope: !972, file: !973, line: 242, baseType: !411, size: 32, offset: 672)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "kCHR", scope: !972, file: !973, line: 243, baseType: !411, size: 32, offset: 704)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "kKHR", scope: !972, file: !973, line: 244, baseType: !411, size: 32, offset: 736)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "kSHR", scope: !972, file: !973, line: 246, baseType: !411, size: 32, offset: 768)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "kAHR", scope: !972, file: !973, line: 247, baseType: !411, size: 32, offset: 800)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "collisionflags", scope: !972, file: !973, line: 248, baseType: !19, size: 32, offset: 832)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "numclusteriterations", scope: !972, file: !973, line: 249, baseType: !19, size: 32, offset: 864)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "welding", scope: !972, file: !973, line: 250, baseType: !411, size: 32, offset: 896)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !972, file: !973, line: 251, baseType: !411, size: 32, offset: 928)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !792, file: !6, line: 253, baseType: !438, size: 8, offset: 9280)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !792, file: !6, line: 254, baseType: !438, size: 8, offset: 9288)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !792, file: !6, line: 255, baseType: !412, size: 16, offset: 9296)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !792, file: !6, line: 256, baseType: !507, size: 96, offset: 9312)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !792, file: !6, line: 258, baseType: !476, size: 128, offset: 9408)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !792, file: !6, line: 259, baseType: !476, size: 128, offset: 9536)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !792, file: !6, line: 260, baseType: !476, size: 128, offset: 9664)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !792, file: !6, line: 261, baseType: !476, size: 128, offset: 9792)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !792, file: !6, line: 263, baseType: !1014, size: 64, offset: 9920)
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64)
!1015 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !973, line: 61, size: 1280, elements: !1016)
!1016 = !{!1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !2212, !2216, !2217, !2218}
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1015, file: !973, line: 62, baseType: !19, size: 32)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "deflect", scope: !1015, file: !973, line: 63, baseType: !412, size: 16, offset: 32)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "forcefield", scope: !1015, file: !973, line: 64, baseType: !412, size: 16, offset: 48)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "falloff", scope: !1015, file: !973, line: 65, baseType: !412, size: 16, offset: 64)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "shape", scope: !1015, file: !973, line: 66, baseType: !412, size: 16, offset: 80)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "tex_mode", scope: !1015, file: !973, line: 67, baseType: !412, size: 16, offset: 96)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "kink", scope: !1015, file: !973, line: 68, baseType: !412, size: 16, offset: 112)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "kink_axis", scope: !1015, file: !973, line: 68, baseType: !412, size: 16, offset: 128)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "zdir", scope: !1015, file: !973, line: 69, baseType: !412, size: 16, offset: 144)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "f_strength", scope: !1015, file: !973, line: 72, baseType: !411, size: 32, offset: 160)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "f_damp", scope: !1015, file: !973, line: 73, baseType: !411, size: 32, offset: 192)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "f_flow", scope: !1015, file: !973, line: 74, baseType: !411, size: 32, offset: 224)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "f_size", scope: !1015, file: !973, line: 77, baseType: !411, size: 32, offset: 256)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "f_power", scope: !1015, file: !973, line: 80, baseType: !411, size: 32, offset: 288)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "maxdist", scope: !1015, file: !973, line: 81, baseType: !411, size: 32, offset: 320)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "mindist", scope: !1015, file: !973, line: 82, baseType: !411, size: 32, offset: 352)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "f_power_r", scope: !1015, file: !973, line: 83, baseType: !411, size: 32, offset: 384)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "maxrad", scope: !1015, file: !973, line: 84, baseType: !411, size: 32, offset: 416)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "minrad", scope: !1015, file: !973, line: 85, baseType: !411, size: 32, offset: 448)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "pdef_damp", scope: !1015, file: !973, line: 88, baseType: !411, size: 32, offset: 480)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "pdef_rdamp", scope: !1015, file: !973, line: 89, baseType: !411, size: 32, offset: 512)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "pdef_perm", scope: !1015, file: !973, line: 90, baseType: !411, size: 32, offset: 544)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "pdef_frict", scope: !1015, file: !973, line: 91, baseType: !411, size: 32, offset: 576)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "pdef_rfrict", scope: !1015, file: !973, line: 92, baseType: !411, size: 32, offset: 608)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "pdef_stickness", scope: !1015, file: !973, line: 93, baseType: !411, size: 32, offset: 640)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "absorption", scope: !1015, file: !973, line: 95, baseType: !411, size: 32, offset: 672)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "pdef_sbdamp", scope: !1015, file: !973, line: 98, baseType: !411, size: 32, offset: 704)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "pdef_sbift", scope: !1015, file: !973, line: 99, baseType: !411, size: 32, offset: 736)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "pdef_sboft", scope: !1015, file: !973, line: 100, baseType: !411, size: 32, offset: 768)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "clump_fac", scope: !1015, file: !973, line: 103, baseType: !411, size: 32, offset: 800)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "clump_pow", scope: !1015, file: !973, line: 103, baseType: !411, size: 32, offset: 832)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "kink_freq", scope: !1015, file: !973, line: 104, baseType: !411, size: 32, offset: 864)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "kink_shape", scope: !1015, file: !973, line: 104, baseType: !411, size: 32, offset: 896)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "kink_amp", scope: !1015, file: !973, line: 104, baseType: !411, size: 32, offset: 928)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "free_end", scope: !1015, file: !973, line: 104, baseType: !411, size: 32, offset: 960)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "tex_nabla", scope: !1015, file: !973, line: 107, baseType: !411, size: 32, offset: 992)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "tex", scope: !1015, file: !973, line: 108, baseType: !1054, size: 64, offset: 1024)
!1054 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1055, size: 64)
!1055 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Tex", file: !1056, line: 202, size: 3328, elements: !1057)
!1056 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1057 = !{!1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !2104, !2105, !2106, !2107, !2128, !2152, !2153, !2182, !2202, !2210, !2211}
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1055, file: !1056, line: 203, baseType: !418, size: 960)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1055, file: !1056, line: 204, baseType: !487, size: 64, offset: 960)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "noisesize", scope: !1055, file: !1056, line: 206, baseType: !411, size: 32, offset: 1024)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "turbul", scope: !1055, file: !1056, line: 206, baseType: !411, size: 32, offset: 1056)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "bright", scope: !1055, file: !1056, line: 207, baseType: !411, size: 32, offset: 1088)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "contrast", scope: !1055, file: !1056, line: 207, baseType: !411, size: 32, offset: 1120)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "saturation", scope: !1055, file: !1056, line: 207, baseType: !411, size: 32, offset: 1152)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "rfac", scope: !1055, file: !1056, line: 207, baseType: !411, size: 32, offset: 1184)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "gfac", scope: !1055, file: !1056, line: 207, baseType: !411, size: 32, offset: 1216)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "bfac", scope: !1055, file: !1056, line: 207, baseType: !411, size: 32, offset: 1248)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "filtersize", scope: !1055, file: !1056, line: 208, baseType: !411, size: 32, offset: 1280)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1055, file: !1056, line: 208, baseType: !411, size: 32, offset: 1312)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "mg_H", scope: !1055, file: !1056, line: 211, baseType: !411, size: 32, offset: 1344)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "mg_lacunarity", scope: !1055, file: !1056, line: 211, baseType: !411, size: 32, offset: 1376)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "mg_octaves", scope: !1055, file: !1056, line: 211, baseType: !411, size: 32, offset: 1408)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "mg_offset", scope: !1055, file: !1056, line: 211, baseType: !411, size: 32, offset: 1440)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "mg_gain", scope: !1055, file: !1056, line: 211, baseType: !411, size: 32, offset: 1472)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "dist_amount", scope: !1055, file: !1056, line: 214, baseType: !411, size: 32, offset: 1504)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "ns_outscale", scope: !1055, file: !1056, line: 214, baseType: !411, size: 32, offset: 1536)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w1", scope: !1055, file: !1056, line: 217, baseType: !411, size: 32, offset: 1568)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w2", scope: !1055, file: !1056, line: 218, baseType: !411, size: 32, offset: 1600)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w3", scope: !1055, file: !1056, line: 219, baseType: !411, size: 32, offset: 1632)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w4", scope: !1055, file: !1056, line: 220, baseType: !411, size: 32, offset: 1664)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "vn_mexp", scope: !1055, file: !1056, line: 221, baseType: !411, size: 32, offset: 1696)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "vn_distm", scope: !1055, file: !1056, line: 222, baseType: !412, size: 16, offset: 1728)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "vn_coltype", scope: !1055, file: !1056, line: 222, baseType: !412, size: 16, offset: 1744)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "noisedepth", scope: !1055, file: !1056, line: 224, baseType: !412, size: 16, offset: 1760)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "noisetype", scope: !1055, file: !1056, line: 224, baseType: !412, size: 16, offset: 1776)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis", scope: !1055, file: !1056, line: 227, baseType: !412, size: 16, offset: 1792)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis2", scope: !1055, file: !1056, line: 227, baseType: !412, size: 16, offset: 1808)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "imaflag", scope: !1055, file: !1056, line: 229, baseType: !412, size: 16, offset: 1824)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1055, file: !1056, line: 229, baseType: !412, size: 16, offset: 1840)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1055, file: !1056, line: 230, baseType: !412, size: 16, offset: 1856)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "stype", scope: !1055, file: !1056, line: 230, baseType: !412, size: 16, offset: 1872)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmin", scope: !1055, file: !1056, line: 232, baseType: !411, size: 32, offset: 1888)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "cropymin", scope: !1055, file: !1056, line: 232, baseType: !411, size: 32, offset: 1920)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmax", scope: !1055, file: !1056, line: 232, baseType: !411, size: 32, offset: 1952)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "cropymax", scope: !1055, file: !1056, line: 232, baseType: !411, size: 32, offset: 1984)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "texfilter", scope: !1055, file: !1056, line: 233, baseType: !19, size: 32, offset: 2016)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "afmax", scope: !1055, file: !1056, line: 234, baseType: !19, size: 32, offset: 2048)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "xrepeat", scope: !1055, file: !1056, line: 235, baseType: !412, size: 16, offset: 2080)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "yrepeat", scope: !1055, file: !1056, line: 235, baseType: !412, size: 16, offset: 2096)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "extend", scope: !1055, file: !1056, line: 236, baseType: !412, size: 16, offset: 2112)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !1055, file: !1056, line: 239, baseType: !412, size: 16, offset: 2128)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1055, file: !1056, line: 240, baseType: !19, size: 32, offset: 2144)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !1055, file: !1056, line: 241, baseType: !19, size: 32, offset: 2176)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1055, file: !1056, line: 241, baseType: !19, size: 32, offset: 2208)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !1055, file: !1056, line: 241, baseType: !19, size: 32, offset: 2240)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "checkerdist", scope: !1055, file: !1056, line: 243, baseType: !411, size: 32, offset: 2272)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "nabla", scope: !1055, file: !1056, line: 243, baseType: !411, size: 32, offset: 2304)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !1055, file: !1056, line: 244, baseType: !411, size: 32, offset: 2336)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !1055, file: !1056, line: 246, baseType: !1110, size: 320, offset: 2368)
!1110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !1111, line: 50, size: 320, elements: !1112)
!1111 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1112 = !{!1113, !2091, !2092, !2093, !2094, !2095, !2096, !2097, !2098, !2099, !2100, !2101, !2102, !2103}
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !1110, file: !1111, line: 51, baseType: !1114, size: 64)
!1114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1115, size: 64)
!1115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !872, line: 1216, size: 39680, elements: !1116)
!1116 = !{!1117, !1118, !1119, !1120, !1123, !1124, !1125, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1149, !1152, !1155, !1451, !1454, !1754, !1766, !1767, !1768, !1769, !1770, !1771, !1772, !1773, !1776, !1777, !1778, !1779, !1780, !1788, !1855, !1862, !1863, !1870, !2078, !2084, !2085, !2086, !2087, !2088}
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1115, file: !872, line: 1217, baseType: !418, size: 960)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1115, file: !872, line: 1218, baseType: !487, size: 64, offset: 960)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !1115, file: !872, line: 1220, baseType: !806, size: 64, offset: 1024)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !1115, file: !872, line: 1221, baseType: !1121, size: 64, offset: 1088)
!1121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1122, size: 64)
!1122 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !872, line: 52, flags: DIFlagFwdDecl)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !1115, file: !872, line: 1223, baseType: !1114, size: 64, offset: 1152)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1115, file: !872, line: 1225, baseType: !476, size: 128, offset: 1216)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !1115, file: !872, line: 1226, baseType: !1126, size: 64, offset: 1344)
!1126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1127, size: 64)
!1127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !872, line: 69, size: 320, elements: !1128)
!1128 = !{!1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136}
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1127, file: !872, line: 70, baseType: !1126, size: 64)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1127, file: !872, line: 70, baseType: !1126, size: 64, offset: 64)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !1127, file: !872, line: 71, baseType: !7, size: 32, offset: 128)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !1127, file: !872, line: 71, baseType: !7, size: 32, offset: 160)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1127, file: !872, line: 72, baseType: !19, size: 32, offset: 192)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !1127, file: !872, line: 73, baseType: !412, size: 16, offset: 224)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !1127, file: !872, line: 73, baseType: !412, size: 16, offset: 240)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !1127, file: !872, line: 74, baseType: !806, size: 64, offset: 256)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !1115, file: !872, line: 1227, baseType: !806, size: 64, offset: 1408)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !1115, file: !872, line: 1229, baseType: !507, size: 96, offset: 1472)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !1115, file: !872, line: 1230, baseType: !507, size: 96, offset: 1568)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !1115, file: !872, line: 1231, baseType: !507, size: 96, offset: 1664)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !1115, file: !872, line: 1231, baseType: !507, size: 96, offset: 1760)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !1115, file: !872, line: 1233, baseType: !7, size: 32, offset: 1856)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !1115, file: !872, line: 1234, baseType: !19, size: 32, offset: 1888)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !1115, file: !872, line: 1235, baseType: !7, size: 32, offset: 1920)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1115, file: !872, line: 1237, baseType: !412, size: 16, offset: 1952)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !1115, file: !872, line: 1239, baseType: !438, size: 8, offset: 1968)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1115, file: !872, line: 1240, baseType: !1148, size: 8, offset: 1976)
!1148 = !DICompositeType(tag: DW_TAG_array_type, baseType: !438, size: 8, elements: !536)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !1115, file: !872, line: 1242, baseType: !1150, size: 64, offset: 1984)
!1150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1151, size: 64)
!1151 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !872, line: 57, flags: DIFlagFwdDecl)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !1115, file: !872, line: 1244, baseType: !1153, size: 64, offset: 2048)
!1153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1154, size: 64)
!1154 = !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !872, line: 59, flags: DIFlagFwdDecl)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "toolsettings", scope: !1115, file: !872, line: 1246, baseType: !1156, size: 64, offset: 2112)
!1156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1157, size: 64)
!1157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolSettings", file: !872, line: 1067, size: 5184, elements: !1158)
!1158 = !{!1159, !1187, !1188, !1203, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1218, !1219, !1220, !1221, !1225, !1322, !1349, !1350, !1351, !1352, !1353, !1354, !1355, !1356, !1357, !1358, !1359, !1360, !1361, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1434}
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint", scope: !1157, file: !872, line: 1068, baseType: !1160, size: 64)
!1160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1161, size: 64)
!1161 = !DIDerivedType(tag: DW_TAG_typedef, name: "VPaint", file: !872, line: 934, baseType: !1162)
!1162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VPaint", file: !872, line: 925, size: 576, elements: !1163)
!1163 = !{!1164, !1180, !1181, !1182, !1183, !1185, !1186}
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !1162, file: !872, line: 926, baseType: !1165, size: 320)
!1165 = !DIDerivedType(tag: DW_TAG_typedef, name: "Paint", file: !872, line: 830, baseType: !1166)
!1166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Paint", file: !872, line: 813, size: 320, elements: !1167)
!1167 = !{!1168, !1171, !1174, !1175, !1177, !1178, !1179}
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !1166, file: !872, line: 814, baseType: !1169, size: 64)
!1169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1170, size: 64)
!1170 = !DICompositeType(tag: DW_TAG_structure_type, name: "Brush", file: !872, line: 51, flags: DIFlagFwdDecl)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "palette", scope: !1166, file: !872, line: 815, baseType: !1172, size: 64, offset: 64)
!1172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1173, size: 64)
!1173 = !DICompositeType(tag: DW_TAG_structure_type, name: "Palette", file: !872, line: 815, flags: DIFlagFwdDecl)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor", scope: !1166, file: !872, line: 818, baseType: !410, size: 64, offset: 128)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor_col", scope: !1166, file: !872, line: 819, baseType: !1176, size: 32, offset: 192)
