; ModuleID = 'blender/source/blender/editors/armature/armature_utils.c'
source_filename = "blender/source/blender/editors/armature/armature_utils.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.Global = type { %struct.Main*, [1024 x i8], [1024 x i8], i8, i8, i8, %struct.ListBase, i8, i8, i8, i16, i16, i16, i8, i16, i32, i32, i8, i32, i32, [200 x i8] }
%struct.Main = type { %struct.Main*, %struct.Main*, [1024 x i8], i16, i16, i16, i16, i64, [16 x i8], i16, %struct.Library*, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, [256 x i8], %struct.EvaluationContext*, %struct.MainLock* }
%struct.Library = type { %struct.ID, %struct.ID*, %struct.FileData*, [1024 x i8], [1024 x i8], %struct.Library*, %struct.PackedFile* }
%struct.ID = type { i8*, i8*, %struct.ID*, %struct.Library*, [66 x i8], i16, i32, i32, i32, %struct.IDProperty* }

!7 = !DIEnumerator(name: "BONE_SELECTED", value: 1, isUnsigned: true)
!8 = !DIEnumerator(name: "BONE_ROOTSEL", value: 2, isUnsigned: true)
!9 = !DIEnumerator(name: "BONE_TIPSEL", value: 4, isUnsigned: true)
!10 = !DIEnumerator(name: "BONE_TRANSFORM", value: 8, isUnsigned: true)
!11 = !DIEnumerator(name: "BONE_CONNECTED", value: 16, isUnsigned: true)
!12 = !DIEnumerator(name: "BONE_HIDDEN_P", value: 64, isUnsigned: true)
!13 = !DIEnumerator(name: "BONE_DONE", value: 128, isUnsigned: true)
!14 = !DIEnumerator(name: "BONE_DRAW_ACTIVE", value: 256, isUnsigned: true)
!15 = !DIEnumerator(name: "BONE_HINGE", value: 512, isUnsigned: true)
!16 = !DIEnumerator(name: "BONE_HIDDEN_A", value: 1024, isUnsigned: true)
!17 = !DIEnumerator(name: "BONE_MULT_VG_ENV", value: 2048, isUnsigned: true)
!18 = !DIEnumerator(name: "BONE_NO_DEFORM", value: 4096, isUnsigned: true)
!19 = !DIEnumerator(name: "BONE_UNKEYED", value: 8192, isUnsigned: true)
!20 = !DIEnumerator(name: "BONE_HINGE_CHILD_TRANSFORM", value: 16384, isUnsigned: true)
!21 = !DIEnumerator(name: "BONE_NO_SCALE", value: 32768, isUnsigned: true)
!22 = !DIEnumerator(name: "BONE_HIDDEN_PG", value: 65536, isUnsigned: true)
!23 = !DIEnumerator(name: "BONE_DRAWWIRE", value: 131072, isUnsigned: true)
!24 = !DIEnumerator(name: "BONE_NO_CYCLICOFFSET", value: 262144, isUnsigned: true)
!25 = !DIEnumerator(name: "BONE_EDITMODE_LOCKED", value: 524288, isUnsigned: true)
!26 = !DIEnumerator(name: "BONE_TRANSFORM_CHILD", value: 1048576, isUnsigned: true)
!27 = !DIEnumerator(name: "BONE_UNSELECTABLE", value: 2097152, isUnsigned: true)
!28 = !DIEnumerator(name: "BONE_NO_LOCAL_LOCATION", value: 4194304, isUnsigned: true)
!29 = !DIEnumerator(name: "BONE_RELATIVE_PARENTING", value: 8388608, isUnsigned: true)
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eArmature_Flag", file: !4, line: 118, baseType: !5, size: 32, elements: !31)
!31 = !{!32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46}
!32 = !DIEnumerator(name: "ARM_RESTPOS", value: 1, isUnsigned: true)
!33 = !DIEnumerator(name: "ARM_DRAWXRAY", value: 2, isUnsigned: true)
!34 = !DIEnumerator(name: "ARM_DRAWAXES", value: 4, isUnsigned: true)
!35 = !DIEnumerator(name: "ARM_DRAWNAMES", value: 8, isUnsigned: true)
!36 = !DIEnumerator(name: "ARM_POSEMODE", value: 16, isUnsigned: true)
!37 = !DIEnumerator(name: "ARM_EDITMODE", value: 32, isUnsigned: true)
!38 = !DIEnumerator(name: "ARM_DELAYDEFORM", value: 64, isUnsigned: true)
!39 = !DIEnumerator(name: "ARM_DONT_USE", value: 128, isUnsigned: true)
!40 = !DIEnumerator(name: "ARM_MIRROR_EDIT", value: 256, isUnsigned: true)
!41 = !DIEnumerator(name: "ARM_AUTO_IK", value: 512, isUnsigned: true)
!42 = !DIEnumerator(name: "ARM_NO_CUSTOM", value: 1024, isUnsigned: true)
!43 = !DIEnumerator(name: "ARM_COL_CUSTOM", value: 2048, isUnsigned: true)
!44 = !DIEnumerator(name: "ARM_GHOST_ONLYSEL", value: 4096, isUnsigned: true)
!45 = !DIEnumerator(name: "ARM_DS_EXPAND", value: 8192, isUnsigned: true)
!46 = !DIEnumerator(name: "ARM_HAS_VIZ_DEPS", value: 16384, isUnsigned: true)
!47 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !48, line: 123, baseType: !5, size: 32, elements: !49)
!48 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_global.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!49 = !{!50, !51, !52, !53, !54, !55, !56, !57, !58}
!50 = !DIEnumerator(name: "G_DEBUG", value: 1, isUnsigned: true)
!51 = !DIEnumerator(name: "G_DEBUG_FFMPEG", value: 2, isUnsigned: true)
!52 = !DIEnumerator(name: "G_DEBUG_PYTHON", value: 4, isUnsigned: true)
!53 = !DIEnumerator(name: "G_DEBUG_EVENTS", value: 8, isUnsigned: true)
!54 = !DIEnumerator(name: "G_DEBUG_HANDLERS", value: 16, isUnsigned: true)
!55 = !DIEnumerator(name: "G_DEBUG_WM", value: 32, isUnsigned: true)
!56 = !DIEnumerator(name: "G_DEBUG_JOBS", value: 64, isUnsigned: true)
!57 = !DIEnumerator(name: "G_DEBUG_FREESTYLE", value: 128, isUnsigned: true)
!58 = !DIEnumerator(name: "G_DEBUG_DEPSGRAPH", value: 256, isUnsigned: true)
!59 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !60, line: 339, baseType: !5, size: 32, elements: !61)
!60 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!61 = !{!62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72}
!62 = !DIEnumerator(name: "OB_EMPTY", value: 0, isUnsigned: true)
!63 = !DIEnumerator(name: "OB_MESH", value: 1, isUnsigned: true)
!64 = !DIEnumerator(name: "OB_CURVE", value: 2, isUnsigned: true)
!65 = !DIEnumerator(name: "OB_SURF", value: 3, isUnsigned: true)
!66 = !DIEnumerator(name: "OB_FONT", value: 4, isUnsigned: true)
!67 = !DIEnumerator(name: "OB_MBALL", value: 5, isUnsigned: true)
!68 = !DIEnumerator(name: "OB_LAMP", value: 10, isUnsigned: true)
!69 = !DIEnumerator(name: "OB_CAMERA", value: 11, isUnsigned: true)
!70 = !DIEnumerator(name: "OB_SPEAKER", value: 12, isUnsigned: true)
!71 = !DIEnumerator(name: "OB_LATTICE", value: 22, isUnsigned: true)
!72 = !DIEnumerator(name: "OB_ARMATURE", value: 25, isUnsigned: true)
!73 = !{!74, !75, !76}
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bone", file: !4, line: 76, baseType: !78)
!78 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Bone", file: !4, line: 48, size: 2624, elements: !79)
!79 = !{!80, !82, !83, !119, !120, !121, !122, !124, !128, !129, !132, !133, !134, !135, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !78, file: !4, line: 49, baseType: !81, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !78, file: !4, line: 49, baseType: !81, size: 64, offset: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !78, file: !4, line: 50, baseType: !84, size: 64, offset: 128)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !86, line: 75, baseType: !87)
!86 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!87 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !86, line: 62, size: 1024, elements: !88)
!88 = !{!89, !91, !92, !94, !95, !97, !101, !103, !117, !118}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !87, file: !86, line: 63, baseType: !90, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !87, file: !86, line: 63, baseType: !90, size: 64, offset: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !87, file: !86, line: 64, baseType: !93, size: 8, offset: 128)
!93 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !87, file: !86, line: 64, baseType: !93, size: 8, offset: 136)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !87, file: !86, line: 65, baseType: !96, size: 16, offset: 144)
!96 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !87, file: !86, line: 66, baseType: !98, size: 512, offset: 160)
!98 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, size: 512, elements: !99)
!99 = !{!100}
!100 = !DISubrange(count: 64)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !87, file: !86, line: 67, baseType: !102, size: 32, offset: 672)
!102 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !87, file: !86, line: 69, baseType: !104, size: 256, offset: 704)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !86, line: 60, baseType: !105)
!105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !86, line: 48, size: 256, elements: !106)
!106 = !{!107, !108, !115, !116}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !105, file: !86, line: 49, baseType: !75, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !105, file: !86, line: 58, baseType: !109, size: 128, offset: 64)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !110, line: 71, baseType: !111)
!110 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!111 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !110, line: 69, size: 128, elements: !112)
!112 = !{!113, !114}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !111, file: !110, line: 70, baseType: !75, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !111, file: !110, line: 70, baseType: !75, size: 64, offset: 64)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !105, file: !86, line: 59, baseType: !102, size: 32, offset: 192)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !105, file: !86, line: 59, baseType: !102, size: 32, offset: 224)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !87, file: !86, line: 70, baseType: !102, size: 32, offset: 960)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !87, file: !86, line: 74, baseType: !102, size: 32, offset: 992)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !78, file: !4, line: 51, baseType: !81, size: 64, offset: 192)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "childbase", scope: !78, file: !4, line: 52, baseType: !109, size: 128, offset: 256)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !78, file: !4, line: 53, baseType: !98, size: 512, offset: 384)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "roll", scope: !78, file: !4, line: 55, baseType: !123, size: 32, offset: 896)
!123 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !78, file: !4, line: 56, baseType: !125, size: 96, offset: 928)
!125 = !DICompositeType(tag: DW_TAG_array_type, baseType: !123, size: 96, elements: !126)
!126 = !{!127}
!127 = !DISubrange(count: 3)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !78, file: !4, line: 57, baseType: !125, size: 96, offset: 1024)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "bone_mat", scope: !78, file: !4, line: 58, baseType: !130, size: 288, offset: 1120)
!130 = !DICompositeType(tag: DW_TAG_array_type, baseType: !123, size: 288, elements: !131)
!131 = !{!127, !127}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !78, file: !4, line: 60, baseType: !102, size: 32, offset: 1408)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "arm_head", scope: !78, file: !4, line: 62, baseType: !125, size: 96, offset: 1440)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "arm_tail", scope: !78, file: !4, line: 63, baseType: !125, size: 96, offset: 1536)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "arm_mat", scope: !78, file: !4, line: 64, baseType: !136, size: 512, offset: 1632)
!136 = !DICompositeType(tag: DW_TAG_array_type, baseType: !123, size: 512, elements: !137)
!137 = !{!138, !138}
!138 = !DISubrange(count: 4)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "arm_roll", scope: !78, file: !4, line: 65, baseType: !123, size: 32, offset: 2144)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !78, file: !4, line: 67, baseType: !123, size: 32, offset: 2176)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !78, file: !4, line: 67, baseType: !123, size: 32, offset: 2208)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "xwidth", scope: !78, file: !4, line: 68, baseType: !123, size: 32, offset: 2240)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !78, file: !4, line: 68, baseType: !123, size: 32, offset: 2272)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "zwidth", scope: !78, file: !4, line: 68, baseType: !123, size: 32, offset: 2304)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "ease1", scope: !78, file: !4, line: 69, baseType: !123, size: 32, offset: 2336)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "ease2", scope: !78, file: !4, line: 69, baseType: !123, size: 32, offset: 2368)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "rad_head", scope: !78, file: !4, line: 70, baseType: !123, size: 32, offset: 2400)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "rad_tail", scope: !78, file: !4, line: 70, baseType: !123, size: 32, offset: 2432)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !78, file: !4, line: 72, baseType: !125, size: 96, offset: 2464)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !78, file: !4, line: 73, baseType: !102, size: 32, offset: 2560)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "segments", scope: !78, file: !4, line: 74, baseType: !96, size: 16, offset: 2592)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !78, file: !4, line: 75, baseType: !153, size: 16, offset: 2608)
!153 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 16, elements: !154)
!154 = !{!155}
!155 = !DISubrange(count: 1)
!156 = !{i32 7, !"Dwarf Version", i32 4}
!157 = !{i32 2, !"Debug Info Version", i32 3}
!158 = !{i32 1, !"wchar_size", i32 4}
!159 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!160 = distinct !DISubprogram(name: "ED_armature_sync_selection", scope: !1, file: !1, line: 55, type: !161, scopeLine: 56, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !164)
!161 = !DISubroutineType(types: !162)
!162 = !{null, !163}
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!164 = !{}
!165 = !DILocalVariable(name: "edbo", arg: 1, scope: !160, file: !1, line: 55, type: !163)
!166 = !DILocation(line: 55, column: 43, scope: !160)
!167 = !DILocalVariable(name: "ebo", scope: !160, file: !1, line: 57, type: !168)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "EditBone", file: !170, line: 86, baseType: !171)
!170 = !DIFile(filename: "blender/source/blender/editors/include/ED_armature.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EditBone", file: !170, line: 56, size: 1472, elements: !172)
!172 = !{!173, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !171, file: !170, line: 57, baseType: !174, size: 64)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !171, file: !170, line: 57, baseType: !174, size: 64, offset: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !171, file: !170, line: 58, baseType: !90, size: 64, offset: 128)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !171, file: !170, line: 59, baseType: !174, size: 64, offset: 192)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !171, file: !170, line: 62, baseType: !75, size: 64, offset: 256)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !171, file: !170, line: 64, baseType: !98, size: 512, offset: 320)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "roll", scope: !171, file: !170, line: 65, baseType: !123, size: 32, offset: 832)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !171, file: !170, line: 70, baseType: !125, size: 96, offset: 864)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !171, file: !170, line: 71, baseType: !125, size: 96, offset: 960)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !171, file: !170, line: 75, baseType: !102, size: 32, offset: 1056)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !171, file: !170, line: 76, baseType: !102, size: 32, offset: 1088)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !171, file: !170, line: 78, baseType: !123, size: 32, offset: 1120)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !171, file: !170, line: 78, baseType: !123, size: 32, offset: 1152)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "xwidth", scope: !171, file: !170, line: 79, baseType: !123, size: 32, offset: 1184)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !171, file: !170, line: 79, baseType: !123, size: 32, offset: 1216)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "zwidth", scope: !171, file: !170, line: 79, baseType: !123, size: 32, offset: 1248)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "ease1", scope: !171, file: !170, line: 80, baseType: !123, size: 32, offset: 1280)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "ease2", scope: !171, file: !170, line: 80, baseType: !123, size: 32, offset: 1312)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "rad_head", scope: !171, file: !170, line: 81, baseType: !123, size: 32, offset: 1344)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "rad_tail", scope: !171, file: !170, line: 81, baseType: !123, size: 32, offset: 1376)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "oldlength", scope: !171, file: !170, line: 83, baseType: !123, size: 32, offset: 1408)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "segments", scope: !171, file: !170, line: 85, baseType: !96, size: 16, offset: 1440)
!196 = !DILocation(line: 57, column: 12, scope: !160)
!197 = !DILocation(line: 59, column: 13, scope: !198)
!198 = distinct !DILexicalBlock(scope: !160, file: !1, line: 59, column: 2)
!199 = !DILocation(line: 59, column: 19, scope: !198)
!200 = !DILocation(line: 59, column: 11, scope: !198)
!201 = !DILocation(line: 59, column: 7, scope: !198)
!202 = !DILocation(line: 59, column: 26, scope: !203)
!203 = distinct !DILexicalBlock(scope: !198, file: !1, line: 59, column: 2)
!204 = !DILocation(line: 59, column: 2, scope: !198)
!205 = !DILocation(line: 61, column: 8, scope: !206)
!206 = distinct !DILexicalBlock(scope: !207, file: !1, line: 61, column: 7)
!207 = distinct !DILexicalBlock(scope: !203, file: !1, line: 59, column: 48)
!208 = !DILocation(line: 61, column: 13, scope: !206)
!209 = !DILocation(line: 61, column: 18, scope: !206)
!210 = !DILocation(line: 61, column: 39, scope: !206)
!211 = !DILocation(line: 61, column: 7, scope: !207)
!212 = !DILocation(line: 62, column: 9, scope: !213)
!213 = distinct !DILexicalBlock(scope: !214, file: !1, line: 62, column: 8)
!214 = distinct !DILexicalBlock(scope: !206, file: !1, line: 61, column: 45)
!215 = !DILocation(line: 62, column: 14, scope: !213)
!216 = !DILocation(line: 62, column: 19, scope: !213)
!217 = !DILocation(line: 62, column: 37, scope: !213)
!218 = !DILocation(line: 62, column: 41, scope: !213)
!219 = !DILocation(line: 62, column: 46, scope: !213)
!220 = !DILocation(line: 62, column: 40, scope: !213)
!221 = !DILocation(line: 62, column: 8, scope: !214)
!222 = !DILocation(line: 63, column: 9, scope: !223)
!223 = distinct !DILexicalBlock(scope: !224, file: !1, line: 63, column: 9)
!224 = distinct !DILexicalBlock(scope: !213, file: !1, line: 62, column: 55)
!225 = !DILocation(line: 63, column: 14, scope: !223)
!226 = !DILocation(line: 63, column: 22, scope: !223)
!227 = !DILocation(line: 63, column: 27, scope: !223)
!228 = !DILocation(line: 63, column: 9, scope: !224)
!229 = !DILocation(line: 64, column: 6, scope: !223)
!230 = !DILocation(line: 64, column: 11, scope: !223)
!231 = !DILocation(line: 64, column: 16, scope: !223)
!232 = !DILocation(line: 66, column: 6, scope: !223)
!233 = !DILocation(line: 66, column: 11, scope: !223)
!234 = !DILocation(line: 66, column: 16, scope: !223)
!235 = !DILocation(line: 67, column: 4, scope: !224)
!236 = !DILocation(line: 69, column: 9, scope: !237)
!237 = distinct !DILexicalBlock(scope: !214, file: !1, line: 69, column: 8)
!238 = !DILocation(line: 69, column: 14, scope: !237)
!239 = !DILocation(line: 69, column: 19, scope: !237)
!240 = !DILocation(line: 69, column: 34, scope: !237)
!241 = !DILocation(line: 69, column: 38, scope: !237)
!242 = !DILocation(line: 69, column: 43, scope: !237)
!243 = !DILocation(line: 69, column: 48, scope: !237)
!244 = !DILocation(line: 69, column: 8, scope: !214)
!245 = !DILocation(line: 70, column: 5, scope: !237)
!246 = !DILocation(line: 70, column: 10, scope: !237)
!247 = !DILocation(line: 70, column: 15, scope: !237)
!248 = !DILocation(line: 72, column: 5, scope: !237)
!249 = !DILocation(line: 72, column: 10, scope: !237)
!250 = !DILocation(line: 72, column: 15, scope: !237)
!251 = !DILocation(line: 73, column: 3, scope: !214)
!252 = !DILocation(line: 74, column: 2, scope: !207)
!253 = !DILocation(line: 59, column: 37, scope: !203)
!254 = !DILocation(line: 59, column: 42, scope: !203)
!255 = !DILocation(line: 59, column: 35, scope: !203)
!256 = !DILocation(line: 59, column: 2, scope: !203)
!257 = distinct !{!257, !204, !258}
!258 = !DILocation(line: 74, column: 2, scope: !198)
!259 = !DILocation(line: 75, column: 1, scope: !160)
!260 = distinct !DISubprogram(name: "ED_armature_validate_active", scope: !1, file: !1, line: 77, type: !261, scopeLine: 78, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !164)
!261 = !DISubroutineType(types: !262)
!262 = !{null, !263}
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!264 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bArmature", file: !4, line: 78, size: 2048, elements: !265)
!265 = !{!266, !302, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !264, file: !4, line: 79, baseType: !267, size: 960)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !86, line: 130, baseType: !268)
!268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !86, line: 117, size: 960, elements: !269)
!269 = !{!270, !271, !272, !274, !293, !297, !298, !299, !300, !301}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !268, file: !86, line: 118, baseType: !75, size: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !268, file: !86, line: 118, baseType: !75, size: 64, offset: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !268, file: !86, line: 119, baseType: !273, size: 64, offset: 128)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !268, file: !86, line: 120, baseType: !275, size: 64, offset: 192)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !86, line: 136, size: 17600, elements: !277)
!277 = !{!278, !279, !281, !284, !288, !289, !290}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !276, file: !86, line: 137, baseType: !267, size: 960)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !276, file: !86, line: 138, baseType: !280, size: 64, offset: 960)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !276, file: !86, line: 139, baseType: !282, size: 64, offset: 1024)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!283 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !86, line: 43, flags: DIFlagFwdDecl)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !276, file: !86, line: 140, baseType: !285, size: 8192, offset: 1088)
!285 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, size: 8192, elements: !286)
!286 = !{!287}
!287 = !DISubrange(count: 1024)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !276, file: !86, line: 141, baseType: !285, size: 8192, offset: 9280)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !276, file: !86, line: 148, baseType: !275, size: 64, offset: 17472)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !276, file: !86, line: 150, baseType: !291, size: 64, offset: 17536)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!292 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !86, line: 45, flags: DIFlagFwdDecl)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !268, file: !86, line: 121, baseType: !294, size: 528, offset: 256)
!294 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, size: 528, elements: !295)
!295 = !{!296}
!296 = !DISubrange(count: 66)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !268, file: !86, line: 126, baseType: !96, size: 16, offset: 784)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !268, file: !86, line: 127, baseType: !102, size: 32, offset: 800)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !268, file: !86, line: 128, baseType: !102, size: 32, offset: 832)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !268, file: !86, line: 128, baseType: !102, size: 32, offset: 864)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !268, file: !86, line: 129, baseType: !84, size: 64, offset: 896)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !264, file: !4, line: 80, baseType: !303, size: 64, offset: 960)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64)
!304 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !4, line: 37, flags: DIFlagFwdDecl)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "bonebase", scope: !264, file: !4, line: 82, baseType: !109, size: 128, offset: 1024)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "chainbase", scope: !264, file: !4, line: 83, baseType: !109, size: 128, offset: 1152)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "edbo", scope: !264, file: !4, line: 84, baseType: !163, size: 64, offset: 1280)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "act_bone", scope: !264, file: !4, line: 92, baseType: !76, size: 64, offset: 1344)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "act_edbone", scope: !264, file: !4, line: 93, baseType: !174, size: 64, offset: 1408)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "sketch", scope: !264, file: !4, line: 95, baseType: !75, size: 64, offset: 1472)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !264, file: !4, line: 97, baseType: !102, size: 32, offset: 1536)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "drawtype", scope: !264, file: !4, line: 98, baseType: !102, size: 32, offset: 1568)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "gevertdeformer", scope: !264, file: !4, line: 99, baseType: !102, size: 32, offset: 1600)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !264, file: !4, line: 100, baseType: !102, size: 32, offset: 1632)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "deformflag", scope: !264, file: !4, line: 101, baseType: !96, size: 16, offset: 1664)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "pathflag", scope: !264, file: !4, line: 102, baseType: !96, size: 16, offset: 1680)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "layer_used", scope: !264, file: !4, line: 104, baseType: !5, size: 32, offset: 1696)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !264, file: !4, line: 105, baseType: !5, size: 32, offset: 1728)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "layer_protected", scope: !264, file: !4, line: 105, baseType: !5, size: 32, offset: 1760)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "ghostep", scope: !264, file: !4, line: 108, baseType: !96, size: 16, offset: 1792)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "ghostsize", scope: !264, file: !4, line: 108, baseType: !96, size: 16, offset: 1808)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "ghosttype", scope: !264, file: !4, line: 109, baseType: !96, size: 16, offset: 1824)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "pathsize", scope: !264, file: !4, line: 109, baseType: !96, size: 16, offset: 1840)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "ghostsf", scope: !264, file: !4, line: 110, baseType: !102, size: 32, offset: 1856)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "ghostef", scope: !264, file: !4, line: 110, baseType: !102, size: 32, offset: 1888)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "pathsf", scope: !264, file: !4, line: 111, baseType: !102, size: 32, offset: 1920)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "pathef", scope: !264, file: !4, line: 111, baseType: !102, size: 32, offset: 1952)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "pathbc", scope: !264, file: !4, line: 112, baseType: !102, size: 32, offset: 1984)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "pathac", scope: !264, file: !4, line: 112, baseType: !102, size: 32, offset: 2016)
!330 = !DILocalVariable(name: "arm", arg: 1, scope: !260, file: !1, line: 77, type: !263)
!331 = !DILocation(line: 77, column: 52, scope: !260)
!332 = !DILocalVariable(name: "ebone", scope: !260, file: !1, line: 79, type: !168)
!333 = !DILocation(line: 79, column: 12, scope: !260)
!334 = !DILocation(line: 79, column: 20, scope: !260)
!335 = !DILocation(line: 79, column: 25, scope: !260)
!336 = !DILocation(line: 81, column: 6, scope: !337)
!337 = distinct !DILexicalBlock(scope: !260, file: !1, line: 81, column: 6)
!338 = !DILocation(line: 81, column: 6, scope: !260)
!339 = !DILocation(line: 82, column: 7, scope: !340)
!340 = distinct !DILexicalBlock(scope: !341, file: !1, line: 82, column: 7)
!341 = distinct !DILexicalBlock(scope: !337, file: !1, line: 81, column: 13)
!342 = !DILocation(line: 82, column: 14, scope: !340)
!343 = !DILocation(line: 82, column: 19, scope: !340)
!344 = !DILocation(line: 82, column: 7, scope: !341)
!345 = !DILocation(line: 83, column: 4, scope: !340)
!346 = !DILocation(line: 83, column: 9, scope: !340)
!347 = !DILocation(line: 83, column: 20, scope: !340)
!348 = !DILocation(line: 84, column: 2, scope: !341)
!349 = !DILocation(line: 85, column: 1, scope: !260)
!350 = distinct !DISubprogram(name: "bone_looper", scope: !1, file: !1, line: 92, type: !351, scopeLine: 94, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !164)
!351 = !DISubroutineType(types: !352)
!352 = !{!102, !353, !76, !75, !640}
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "Object", file: !60, line: 295, baseType: !355)
!355 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !60, line: 115, size: 11392, elements: !356)
!356 = !{!357, !358, !359, !362, !363, !364, !365, !366, !367, !368, !370, !371, !372, !373, !374, !378, !388, !402, !403, !444, !445, !448, !449, !465, !466, !467, !468, !469, !470, !471, !475, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !553, !554, !555, !556, !557, !558, !559, !560, !561, !564, !567, !570, !571, !572, !573, !574, !577, !580, !583, !584, !590, !591, !592, !593, !594, !595, !596, !599, !602, !606, !628, !629}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !355, file: !60, line: 116, baseType: !267, size: 960)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !355, file: !60, line: 117, baseType: !303, size: 64, offset: 960)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !355, file: !60, line: 119, baseType: !360, size: 64, offset: 1024)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!361 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !60, line: 57, flags: DIFlagFwdDecl)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !355, file: !60, line: 121, baseType: !96, size: 16, offset: 1088)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !355, file: !60, line: 121, baseType: !96, size: 16, offset: 1104)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !355, file: !60, line: 122, baseType: !102, size: 32, offset: 1120)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !355, file: !60, line: 122, baseType: !102, size: 32, offset: 1152)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !355, file: !60, line: 122, baseType: !102, size: 32, offset: 1184)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !355, file: !60, line: 123, baseType: !98, size: 512, offset: 1216)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !355, file: !60, line: 124, baseType: !369, size: 64, offset: 1728)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !355, file: !60, line: 124, baseType: !369, size: 64, offset: 1792)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !355, file: !60, line: 127, baseType: !369, size: 64, offset: 1856)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !355, file: !60, line: 127, baseType: !369, size: 64, offset: 1920)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !355, file: !60, line: 127, baseType: !369, size: 64, offset: 1984)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !355, file: !60, line: 128, baseType: !375, size: 64, offset: 2048)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64)
!376 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !377, line: 46, flags: DIFlagFwdDecl)
!377 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!378 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !355, file: !60, line: 130, baseType: !379, size: 64, offset: 2112)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!380 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !60, line: 97, size: 832, elements: !381)
!381 = !{!382, !386, !387}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !380, file: !60, line: 98, baseType: !383, size: 768)
!383 = !DICompositeType(tag: DW_TAG_array_type, baseType: !123, size: 768, elements: !384)
!384 = !{!385, !127}
!385 = !DISubrange(count: 8)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !380, file: !60, line: 99, baseType: !102, size: 32, offset: 768)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !380, file: !60, line: 99, baseType: !102, size: 32, offset: 800)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !355, file: !60, line: 131, baseType: !389, size: 64, offset: 2176)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !391, line: 486, size: 1600, elements: !392)
!391 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!392 = !{!393, !394, !395, !396, !397, !398, !399, !400, !401}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !390, file: !391, line: 487, baseType: !267, size: 960)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !390, file: !391, line: 489, baseType: !109, size: 128, offset: 960)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !390, file: !391, line: 490, baseType: !109, size: 128, offset: 1088)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !390, file: !391, line: 491, baseType: !109, size: 128, offset: 1216)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !390, file: !391, line: 492, baseType: !109, size: 128, offset: 1344)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !390, file: !391, line: 494, baseType: !102, size: 32, offset: 1472)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !390, file: !391, line: 495, baseType: !102, size: 32, offset: 1504)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !390, file: !391, line: 497, baseType: !102, size: 32, offset: 1536)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !390, file: !391, line: 498, baseType: !102, size: 32, offset: 1568)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !355, file: !60, line: 132, baseType: !389, size: 64, offset: 2240)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !355, file: !60, line: 133, baseType: !404, size: 64, offset: 2304)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64)
!405 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !391, line: 334, size: 1728, elements: !406)
!406 = !{!407, !408, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !443}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !405, file: !391, line: 335, baseType: !109, size: 128)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !405, file: !391, line: 336, baseType: !409, size: 64, offset: 128)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!410 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !391, line: 47, flags: DIFlagFwdDecl)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !405, file: !391, line: 338, baseType: !96, size: 16, offset: 192)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !405, file: !391, line: 338, baseType: !96, size: 16, offset: 208)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !405, file: !391, line: 339, baseType: !5, size: 32, offset: 224)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !405, file: !391, line: 340, baseType: !102, size: 32, offset: 256)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !405, file: !391, line: 342, baseType: !123, size: 32, offset: 288)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !405, file: !391, line: 343, baseType: !125, size: 96, offset: 320)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !405, file: !391, line: 344, baseType: !125, size: 96, offset: 416)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !405, file: !391, line: 347, baseType: !109, size: 128, offset: 512)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !405, file: !391, line: 349, baseType: !102, size: 32, offset: 640)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !405, file: !391, line: 350, baseType: !102, size: 32, offset: 672)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !405, file: !391, line: 351, baseType: !75, size: 64, offset: 704)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !405, file: !391, line: 352, baseType: !75, size: 64, offset: 768)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !405, file: !391, line: 354, baseType: !424, size: 384, offset: 832)
!424 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !391, line: 116, baseType: !425)
!425 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !391, line: 94, size: 384, elements: !426)
!426 = !{!427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !425, file: !391, line: 96, baseType: !102, size: 32)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !425, file: !391, line: 96, baseType: !102, size: 32, offset: 32)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !425, file: !391, line: 97, baseType: !102, size: 32, offset: 64)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !425, file: !391, line: 97, baseType: !102, size: 32, offset: 96)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !425, file: !391, line: 99, baseType: !96, size: 16, offset: 128)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !425, file: !391, line: 100, baseType: !96, size: 16, offset: 144)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !425, file: !391, line: 102, baseType: !96, size: 16, offset: 160)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !425, file: !391, line: 105, baseType: !96, size: 16, offset: 176)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !425, file: !391, line: 108, baseType: !96, size: 16, offset: 192)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !425, file: !391, line: 109, baseType: !96, size: 16, offset: 208)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !425, file: !391, line: 111, baseType: !96, size: 16, offset: 224)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !425, file: !391, line: 112, baseType: !96, size: 16, offset: 240)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !425, file: !391, line: 114, baseType: !102, size: 32, offset: 256)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !425, file: !391, line: 114, baseType: !102, size: 32, offset: 288)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !425, file: !391, line: 115, baseType: !102, size: 32, offset: 320)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !425, file: !391, line: 115, baseType: !102, size: 32, offset: 352)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !405, file: !391, line: 355, baseType: !98, size: 512, offset: 1216)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !355, file: !60, line: 134, baseType: !75, size: 64, offset: 2368)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !355, file: !60, line: 136, baseType: !446, size: 64, offset: 2432)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!447 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !60, line: 58, flags: DIFlagFwdDecl)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !355, file: !60, line: 138, baseType: !424, size: 384, offset: 2496)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !355, file: !60, line: 139, baseType: !450, size: 64, offset: 2880)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64)
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !391, line: 80, baseType: !452)
!452 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !391, line: 72, size: 192, elements: !453)
!453 = !{!454, !461, !462, !463, !464}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !452, file: !391, line: 73, baseType: !455, size: 64)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64)
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !391, line: 59, baseType: !457)
!457 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !391, line: 56, size: 128, elements: !458)
!458 = !{!459, !460}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !457, file: !391, line: 57, baseType: !125, size: 96)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !457, file: !391, line: 58, baseType: !102, size: 32, offset: 96)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !452, file: !391, line: 74, baseType: !102, size: 32, offset: 64)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !452, file: !391, line: 76, baseType: !102, size: 32, offset: 96)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !452, file: !391, line: 77, baseType: !102, size: 32, offset: 128)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !452, file: !391, line: 79, baseType: !102, size: 32, offset: 160)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !355, file: !60, line: 141, baseType: !109, size: 128, offset: 2944)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !355, file: !60, line: 142, baseType: !109, size: 128, offset: 3072)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !355, file: !60, line: 143, baseType: !109, size: 128, offset: 3200)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !355, file: !60, line: 144, baseType: !109, size: 128, offset: 3328)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !355, file: !60, line: 146, baseType: !102, size: 32, offset: 3456)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !355, file: !60, line: 147, baseType: !102, size: 32, offset: 3488)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !355, file: !60, line: 150, baseType: !472, size: 64, offset: 3520)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64)
!474 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !60, line: 50, flags: DIFlagFwdDecl)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !355, file: !60, line: 151, baseType: !476, size: 64, offset: 3584)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !355, file: !60, line: 152, baseType: !102, size: 32, offset: 3648)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !355, file: !60, line: 153, baseType: !102, size: 32, offset: 3680)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !355, file: !60, line: 156, baseType: !125, size: 96, offset: 3712)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !355, file: !60, line: 156, baseType: !125, size: 96, offset: 3808)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !355, file: !60, line: 156, baseType: !125, size: 96, offset: 3904)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !355, file: !60, line: 157, baseType: !125, size: 96, offset: 4000)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !355, file: !60, line: 158, baseType: !125, size: 96, offset: 4096)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !355, file: !60, line: 159, baseType: !125, size: 96, offset: 4192)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !355, file: !60, line: 160, baseType: !125, size: 96, offset: 4288)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !355, file: !60, line: 160, baseType: !125, size: 96, offset: 4384)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !355, file: !60, line: 161, baseType: !488, size: 128, offset: 4480)
!488 = !DICompositeType(tag: DW_TAG_array_type, baseType: !123, size: 128, elements: !489)
!489 = !{!138}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !355, file: !60, line: 161, baseType: !488, size: 128, offset: 4608)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !355, file: !60, line: 162, baseType: !125, size: 96, offset: 4736)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !355, file: !60, line: 162, baseType: !125, size: 96, offset: 4832)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !355, file: !60, line: 163, baseType: !123, size: 32, offset: 4928)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !355, file: !60, line: 163, baseType: !123, size: 32, offset: 4960)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !355, file: !60, line: 164, baseType: !136, size: 512, offset: 4992)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !355, file: !60, line: 165, baseType: !136, size: 512, offset: 5504)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !355, file: !60, line: 166, baseType: !136, size: 512, offset: 6016)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !355, file: !60, line: 167, baseType: !136, size: 512, offset: 6528)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !355, file: !60, line: 176, baseType: !136, size: 512, offset: 7040)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !355, file: !60, line: 178, baseType: !5, size: 32, offset: 7552)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !355, file: !60, line: 180, baseType: !96, size: 16, offset: 7584)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !355, file: !60, line: 181, baseType: !96, size: 16, offset: 7600)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !355, file: !60, line: 183, baseType: !96, size: 16, offset: 7616)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !355, file: !60, line: 183, baseType: !96, size: 16, offset: 7632)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !355, file: !60, line: 184, baseType: !96, size: 16, offset: 7648)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !355, file: !60, line: 184, baseType: !96, size: 16, offset: 7664)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !355, file: !60, line: 185, baseType: !96, size: 16, offset: 7680)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !355, file: !60, line: 186, baseType: !96, size: 16, offset: 7696)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !355, file: !60, line: 187, baseType: !96, size: 16, offset: 7712)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !355, file: !60, line: 188, baseType: !93, size: 8, offset: 7728)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !355, file: !60, line: 189, baseType: !93, size: 8, offset: 7736)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !355, file: !60, line: 192, baseType: !102, size: 32, offset: 7744)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !355, file: !60, line: 192, baseType: !102, size: 32, offset: 7776)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !355, file: !60, line: 192, baseType: !102, size: 32, offset: 7808)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !355, file: !60, line: 192, baseType: !102, size: 32, offset: 7840)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !355, file: !60, line: 194, baseType: !102, size: 32, offset: 7872)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !355, file: !60, line: 202, baseType: !123, size: 32, offset: 7904)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !355, file: !60, line: 202, baseType: !123, size: 32, offset: 7936)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !355, file: !60, line: 202, baseType: !123, size: 32, offset: 7968)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !355, file: !60, line: 211, baseType: !123, size: 32, offset: 8000)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !355, file: !60, line: 212, baseType: !123, size: 32, offset: 8032)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !355, file: !60, line: 213, baseType: !123, size: 32, offset: 8064)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !355, file: !60, line: 214, baseType: !123, size: 32, offset: 8096)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !355, file: !60, line: 215, baseType: !123, size: 32, offset: 8128)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !355, file: !60, line: 216, baseType: !123, size: 32, offset: 8160)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !355, file: !60, line: 219, baseType: !123, size: 32, offset: 8192)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !355, file: !60, line: 220, baseType: !123, size: 32, offset: 8224)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !355, file: !60, line: 221, baseType: !123, size: 32, offset: 8256)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !355, file: !60, line: 224, baseType: !530, size: 16, offset: 8288)
!530 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !355, file: !60, line: 224, baseType: !530, size: 16, offset: 8304)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !355, file: !60, line: 226, baseType: !96, size: 16, offset: 8320)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !355, file: !60, line: 228, baseType: !93, size: 8, offset: 8336)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !355, file: !60, line: 229, baseType: !93, size: 8, offset: 8344)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !355, file: !60, line: 231, baseType: !96, size: 16, offset: 8352)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !355, file: !60, line: 232, baseType: !93, size: 8, offset: 8368)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !355, file: !60, line: 233, baseType: !93, size: 8, offset: 8376)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !355, file: !60, line: 234, baseType: !123, size: 32, offset: 8384)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !355, file: !60, line: 235, baseType: !123, size: 32, offset: 8416)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !355, file: !60, line: 237, baseType: !109, size: 128, offset: 8448)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !355, file: !60, line: 238, baseType: !109, size: 128, offset: 8576)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !355, file: !60, line: 239, baseType: !109, size: 128, offset: 8704)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !355, file: !60, line: 240, baseType: !109, size: 128, offset: 8832)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !355, file: !60, line: 242, baseType: !123, size: 32, offset: 8960)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !355, file: !60, line: 244, baseType: !96, size: 16, offset: 8992)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !355, file: !60, line: 245, baseType: !530, size: 16, offset: 9008)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !355, file: !60, line: 246, baseType: !488, size: 128, offset: 9024)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !355, file: !60, line: 248, baseType: !102, size: 32, offset: 9152)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !355, file: !60, line: 249, baseType: !102, size: 32, offset: 9184)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !355, file: !60, line: 251, baseType: !551, size: 64, offset: 9216)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64)
!552 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !60, line: 251, flags: DIFlagFwdDecl)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !355, file: !60, line: 253, baseType: !93, size: 8, offset: 9280)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !355, file: !60, line: 254, baseType: !93, size: 8, offset: 9288)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !355, file: !60, line: 255, baseType: !96, size: 16, offset: 9296)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !355, file: !60, line: 256, baseType: !125, size: 96, offset: 9312)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !355, file: !60, line: 258, baseType: !109, size: 128, offset: 9408)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !355, file: !60, line: 259, baseType: !109, size: 128, offset: 9536)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !355, file: !60, line: 260, baseType: !109, size: 128, offset: 9664)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !355, file: !60, line: 261, baseType: !109, size: 128, offset: 9792)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !355, file: !60, line: 263, baseType: !562, size: 64, offset: 9920)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64)
!563 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !60, line: 52, flags: DIFlagFwdDecl)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !355, file: !60, line: 264, baseType: !565, size: 64, offset: 9984)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64)
!566 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !60, line: 53, flags: DIFlagFwdDecl)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !355, file: !60, line: 265, baseType: !568, size: 64, offset: 10048)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64)
!569 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !391, line: 46, flags: DIFlagFwdDecl)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !355, file: !60, line: 267, baseType: !93, size: 8, offset: 10112)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !355, file: !60, line: 268, baseType: !93, size: 8, offset: 10120)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !355, file: !60, line: 269, baseType: !96, size: 16, offset: 10128)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !355, file: !60, line: 270, baseType: !123, size: 32, offset: 10144)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !355, file: !60, line: 272, baseType: !575, size: 64, offset: 10176)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64)
!576 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !60, line: 54, flags: DIFlagFwdDecl)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !355, file: !60, line: 275, baseType: !578, size: 64, offset: 10240)
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64)
!579 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !60, line: 275, flags: DIFlagFwdDecl)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !355, file: !60, line: 277, baseType: !581, size: 64, offset: 10304)
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64)
!582 = !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !60, line: 56, flags: DIFlagFwdDecl)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !355, file: !60, line: 277, baseType: !581, size: 64, offset: 10368)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !355, file: !60, line: 278, baseType: !585, size: 64, offset: 10432)
!585 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !586, line: 27, baseType: !587)
!586 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!587 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !588, line: 45, baseType: !589)
!588 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!589 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_mask", scope: !355, file: !60, line: 279, baseType: !585, size: 64, offset: 10496)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !355, file: !60, line: 280, baseType: !5, size: 32, offset: 10560)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !355, file: !60, line: 281, baseType: !5, size: 32, offset: 10592)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "gpulamp", scope: !355, file: !60, line: 283, baseType: !109, size: 128, offset: 10624)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "pc_ids", scope: !355, file: !60, line: 284, baseType: !109, size: 128, offset: 10752)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "duplilist", scope: !355, file: !60, line: 285, baseType: !163, size: 64, offset: 10880)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_object", scope: !355, file: !60, line: 287, baseType: !597, size: 64, offset: 10944)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 64)
!598 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyOb", file: !60, line: 59, flags: DIFlagFwdDecl)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_constraint", scope: !355, file: !60, line: 288, baseType: !600, size: 64, offset: 11008)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64)
!601 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyCon", file: !60, line: 288, flags: DIFlagFwdDecl)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "ima_ofs", scope: !355, file: !60, line: 290, baseType: !603, size: 64, offset: 11072)
!603 = !DICompositeType(tag: DW_TAG_array_type, baseType: !123, size: 64, elements: !604)
!604 = !{!605}
!605 = !DISubrange(count: 2)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !355, file: !60, line: 291, baseType: !607, size: 64, offset: 11136)
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64)
!608 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageUser", file: !609, line: 65, baseType: !610)
!609 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!610 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !609, line: 50, size: 320, elements: !611)
!611 = !{!612, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !610, file: !609, line: 51, baseType: !613, size: 64)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 64)
!614 = !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !609, line: 40, flags: DIFlagFwdDecl)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !610, file: !609, line: 53, baseType: !102, size: 32, offset: 64)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !610, file: !609, line: 54, baseType: !102, size: 32, offset: 96)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !610, file: !609, line: 55, baseType: !102, size: 32, offset: 128)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !610, file: !609, line: 55, baseType: !102, size: 32, offset: 160)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !610, file: !609, line: 56, baseType: !93, size: 8, offset: 192)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "cycl", scope: !610, file: !609, line: 56, baseType: !93, size: 8, offset: 200)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !610, file: !609, line: 57, baseType: !93, size: 8, offset: 208)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !610, file: !609, line: 57, baseType: !93, size: 8, offset: 216)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "multi_index", scope: !610, file: !609, line: 59, baseType: !96, size: 16, offset: 224)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !610, file: !609, line: 59, baseType: !96, size: 16, offset: 240)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !610, file: !609, line: 59, baseType: !96, size: 16, offset: 256)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !610, file: !609, line: 61, baseType: !96, size: 16, offset: 272)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !610, file: !609, line: 63, baseType: !102, size: 32, offset: 288)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "lodlevels", scope: !355, file: !60, line: 293, baseType: !109, size: 128, offset: 11200)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "currentlod", scope: !355, file: !60, line: 294, baseType: !630, size: 64, offset: 11328)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64)
!631 = !DIDerivedType(tag: DW_TAG_typedef, name: "LodLevel", file: !60, line: 113, baseType: !632)
!632 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LodLevel", file: !60, line: 108, size: 256, elements: !633)
!633 = !{!634, !636, !637, !638, !639}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !632, file: !60, line: 109, baseType: !635, size: 64)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !632, file: !60, line: 109, baseType: !635, size: 64, offset: 64)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !632, file: !60, line: 110, baseType: !369, size: 64, offset: 128)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !632, file: !60, line: 111, baseType: !102, size: 32, offset: 192)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "distance", scope: !632, file: !60, line: 112, baseType: !123, size: 32, offset: 224)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64)
!641 = !DISubroutineType(types: !642)
!642 = !{!102, !353, !76, !75}
!643 = !DILocalVariable(name: "ob", arg: 1, scope: !350, file: !1, line: 92, type: !353)
!644 = !DILocation(line: 92, column: 25, scope: !350)
!645 = !DILocalVariable(name: "bone", arg: 2, scope: !350, file: !1, line: 92, type: !76)
!646 = !DILocation(line: 92, column: 35, scope: !350)
!647 = !DILocalVariable(name: "data", arg: 3, scope: !350, file: !1, line: 92, type: !75)
!648 = !DILocation(line: 92, column: 47, scope: !350)
!649 = !DILocalVariable(name: "bone_func", arg: 4, scope: !350, file: !1, line: 93, type: !640)
!650 = !DILocation(line: 93, column: 23, scope: !350)
!651 = !DILocalVariable(name: "count", scope: !350, file: !1, line: 101, type: !102)
!652 = !DILocation(line: 101, column: 6, scope: !350)
!653 = !DILocation(line: 103, column: 6, scope: !654)
!654 = distinct !DILexicalBlock(scope: !350, file: !1, line: 103, column: 6)
!655 = !DILocation(line: 103, column: 6, scope: !350)
!656 = !DILocation(line: 105, column: 12, scope: !657)
!657 = distinct !DILexicalBlock(scope: !654, file: !1, line: 103, column: 12)
!658 = !DILocation(line: 105, column: 22, scope: !657)
!659 = !DILocation(line: 105, column: 26, scope: !657)
!660 = !DILocation(line: 105, column: 32, scope: !657)
!661 = !DILocation(line: 105, column: 9, scope: !657)
!662 = !DILocation(line: 108, column: 24, scope: !657)
!663 = !DILocation(line: 108, column: 28, scope: !657)
!664 = !DILocation(line: 108, column: 34, scope: !657)
!665 = !DILocation(line: 108, column: 44, scope: !657)
!666 = !DILocation(line: 108, column: 51, scope: !657)
!667 = !DILocation(line: 108, column: 57, scope: !657)
!668 = !DILocation(line: 108, column: 12, scope: !657)
!669 = !DILocation(line: 108, column: 9, scope: !657)
!670 = !DILocation(line: 113, column: 24, scope: !657)
!671 = !DILocation(line: 113, column: 28, scope: !657)
!672 = !DILocation(line: 113, column: 34, scope: !657)
!673 = !DILocation(line: 113, column: 40, scope: !657)
!674 = !DILocation(line: 113, column: 46, scope: !657)
!675 = !DILocation(line: 113, column: 12, scope: !657)
!676 = !DILocation(line: 113, column: 9, scope: !657)
!677 = !DILocation(line: 114, column: 2, scope: !657)
!678 = !DILocation(line: 116, column: 9, scope: !350)
!679 = !DILocation(line: 116, column: 2, scope: !350)
!680 = distinct !DISubprogram(name: "bone_free", scope: !1, file: !1, line: 122, type: !681, scopeLine: 123, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !164)
!681 = !DISubroutineType(types: !682)
!682 = !{null, !683, !168}
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 64)
!684 = !DIDerivedType(tag: DW_TAG_typedef, name: "bArmature", file: !4, line: 114, baseType: !264)
!685 = !DILocalVariable(name: "arm", arg: 1, scope: !680, file: !1, line: 122, type: !683)
!686 = !DILocation(line: 122, column: 27, scope: !680)
!687 = !DILocalVariable(name: "bone", arg: 2, scope: !680, file: !1, line: 122, type: !168)
!688 = !DILocation(line: 122, column: 42, scope: !680)
!689 = !DILocation(line: 124, column: 6, scope: !690)
!690 = distinct !DILexicalBlock(scope: !680, file: !1, line: 124, column: 6)
!691 = !DILocation(line: 124, column: 11, scope: !690)
!692 = !DILocation(line: 124, column: 25, scope: !690)
!693 = !DILocation(line: 124, column: 22, scope: !690)
!694 = !DILocation(line: 124, column: 6, scope: !680)
!695 = !DILocation(line: 125, column: 3, scope: !690)
!696 = !DILocation(line: 125, column: 8, scope: !690)
!697 = !DILocation(line: 125, column: 19, scope: !690)
!698 = !DILocation(line: 127, column: 6, scope: !699)
!699 = distinct !DILexicalBlock(scope: !680, file: !1, line: 127, column: 6)
!700 = !DILocation(line: 127, column: 12, scope: !699)
!701 = !DILocation(line: 127, column: 6, scope: !680)
!702 = !DILocation(line: 128, column: 20, scope: !703)
!703 = distinct !DILexicalBlock(scope: !699, file: !1, line: 127, column: 18)
!704 = !DILocation(line: 128, column: 26, scope: !703)
!705 = !DILocation(line: 128, column: 3, scope: !703)
!706 = !DILocation(line: 129, column: 3, scope: !703)
!707 = !DILocation(line: 129, column: 13, scope: !703)
!708 = !DILocation(line: 129, column: 19, scope: !703)
!709 = !DILocation(line: 130, column: 2, scope: !703)
!710 = !DILocation(line: 132, column: 16, scope: !680)
!711 = !DILocation(line: 132, column: 21, scope: !680)
!712 = !DILocation(line: 132, column: 27, scope: !680)
!713 = !DILocation(line: 132, column: 2, scope: !680)
!714 = !DILocation(line: 133, column: 1, scope: !680)
!715 = distinct !DISubprogram(name: "ED_armature_edit_bone_remove", scope: !1, file: !1, line: 135, type: !681, scopeLine: 136, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !164)
!716 = !DILocalVariable(name: "arm", arg: 1, scope: !715, file: !1, line: 135, type: !683)
!717 = !DILocation(line: 135, column: 46, scope: !715)
!718 = !DILocalVariable(name: "exBone", arg: 2, scope: !715, file: !1, line: 135, type: !168)
!719 = !DILocation(line: 135, column: 61, scope: !715)
!720 = !DILocalVariable(name: "curBone", scope: !715, file: !1, line: 137, type: !168)
!721 = !DILocation(line: 137, column: 12, scope: !715)
!722 = !DILocation(line: 140, column: 17, scope: !723)
!723 = distinct !DILexicalBlock(scope: !715, file: !1, line: 140, column: 2)
!724 = !DILocation(line: 140, column: 22, scope: !723)
!725 = !DILocation(line: 140, column: 28, scope: !723)
!726 = !DILocation(line: 140, column: 15, scope: !723)
!727 = !DILocation(line: 140, column: 7, scope: !723)
!728 = !DILocation(line: 140, column: 35, scope: !729)
!729 = distinct !DILexicalBlock(scope: !723, file: !1, line: 140, column: 2)
!730 = !DILocation(line: 140, column: 2, scope: !723)
!731 = !DILocation(line: 141, column: 7, scope: !732)
!732 = distinct !DILexicalBlock(scope: !733, file: !1, line: 141, column: 7)
!733 = distinct !DILexicalBlock(scope: !729, file: !1, line: 140, column: 69)
!734 = !DILocation(line: 141, column: 16, scope: !732)
!735 = !DILocation(line: 141, column: 26, scope: !732)
!736 = !DILocation(line: 141, column: 23, scope: !732)
!737 = !DILocation(line: 141, column: 7, scope: !733)
!738 = !DILocation(line: 142, column: 22, scope: !739)
!739 = distinct !DILexicalBlock(scope: !732, file: !1, line: 141, column: 34)
!740 = !DILocation(line: 142, column: 30, scope: !739)
!741 = !DILocation(line: 142, column: 4, scope: !739)
!742 = !DILocation(line: 142, column: 13, scope: !739)
!743 = !DILocation(line: 142, column: 20, scope: !739)
!744 = !DILocation(line: 143, column: 4, scope: !739)
!745 = !DILocation(line: 143, column: 13, scope: !739)
!746 = !DILocation(line: 143, column: 18, scope: !739)
!747 = !DILocation(line: 144, column: 3, scope: !739)
!748 = !DILocation(line: 145, column: 2, scope: !733)
!749 = !DILocation(line: 140, column: 54, scope: !729)
!750 = !DILocation(line: 140, column: 63, scope: !729)
!751 = !DILocation(line: 140, column: 52, scope: !729)
!752 = !DILocation(line: 140, column: 2, scope: !729)
!753 = distinct !{!753, !730, !754}
!754 = !DILocation(line: 145, column: 2, scope: !723)
!755 = !DILocation(line: 147, column: 12, scope: !715)
!756 = !DILocation(line: 147, column: 17, scope: !715)
!757 = !DILocation(line: 147, column: 2, scope: !715)
!758 = !DILocation(line: 148, column: 1, scope: !715)
!759 = distinct !DISubprogram(name: "ED_armature_ebone_is_child_recursive", scope: !1, file: !1, line: 150, type: !760, scopeLine: 151, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !164)
!760 = !DISubroutineType(types: !761)
!761 = !{!762, !168, !168}
!762 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!763 = !DILocalVariable(name: "ebone_parent", arg: 1, scope: !759, file: !1, line: 150, type: !168)
!764 = !DILocation(line: 150, column: 53, scope: !759)
!765 = !DILocalVariable(name: "ebone_child", arg: 2, scope: !759, file: !1, line: 150, type: !168)
!766 = !DILocation(line: 150, column: 77, scope: !759)
!767 = !DILocation(line: 152, column: 21, scope: !768)
!768 = distinct !DILexicalBlock(scope: !759, file: !1, line: 152, column: 2)
!769 = !DILocation(line: 152, column: 34, scope: !768)
!770 = !DILocation(line: 152, column: 19, scope: !768)
!771 = !DILocation(line: 152, column: 7, scope: !768)
!772 = !DILocation(line: 152, column: 42, scope: !773)
!773 = distinct !DILexicalBlock(scope: !768, file: !1, line: 152, column: 2)
!774 = !DILocation(line: 152, column: 2, scope: !768)
!775 = !DILocation(line: 153, column: 7, scope: !776)
!776 = distinct !DILexicalBlock(scope: !777, file: !1, line: 153, column: 7)
!777 = distinct !DILexicalBlock(scope: !773, file: !1, line: 152, column: 90)
!778 = !DILocation(line: 153, column: 22, scope: !776)
!779 = !DILocation(line: 153, column: 19, scope: !776)
!780 = !DILocation(line: 153, column: 7, scope: !777)
!781 = !DILocation(line: 154, column: 4, scope: !776)
!782 = !DILocation(line: 155, column: 2, scope: !777)
!783 = !DILocation(line: 152, column: 69, scope: !773)
!784 = !DILocation(line: 152, column: 82, scope: !773)
!785 = !DILocation(line: 152, column: 67, scope: !773)
!786 = !DILocation(line: 152, column: 2, scope: !773)
!787 = distinct !{!787, !774, !788}
!788 = !DILocation(line: 155, column: 2, scope: !768)
!789 = !DILocation(line: 156, column: 2, scope: !759)
!790 = !DILocation(line: 157, column: 1, scope: !759)
!791 = distinct !DISubprogram(name: "ED_armature_bone_find_shared_parent", scope: !1, file: !1, line: 166, type: !792, scopeLine: 167, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !164)
!792 = !DISubroutineType(types: !793)
!793 = !{!168, !794, !795}
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!795 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!796 = !DILocalVariable(name: "ebone_child", arg: 1, scope: !791, file: !1, line: 166, type: !794)
!797 = !DILocation(line: 166, column: 57, scope: !791)
!798 = !DILocalVariable(name: "ebone_child_tot", arg: 2, scope: !791, file: !1, line: 166, type: !795)
!799 = !DILocation(line: 166, column: 91, scope: !791)
!800 = !DILocalVariable(name: "i", scope: !791, file: !1, line: 168, type: !5)
!801 = !DILocation(line: 168, column: 15, scope: !791)
!802 = !DILocalVariable(name: "ebone_iter", scope: !791, file: !1, line: 169, type: !168)
!803 = !DILocation(line: 169, column: 12, scope: !791)
!804 = !DILocation(line: 174, column: 9, scope: !805)
!805 = distinct !DILexicalBlock(scope: !791, file: !1, line: 174, column: 2)
!806 = !DILocation(line: 174, column: 7, scope: !805)
!807 = !DILocation(line: 174, column: 14, scope: !808)
!808 = distinct !DILexicalBlock(scope: !805, file: !1, line: 174, column: 2)
!809 = !DILocation(line: 174, column: 18, scope: !808)
!810 = !DILocation(line: 174, column: 16, scope: !808)
!811 = !DILocation(line: 174, column: 2, scope: !805)
!812 = !DILocation(line: 175, column: 21, scope: !813)
!813 = distinct !DILexicalBlock(scope: !814, file: !1, line: 175, column: 3)
!814 = distinct !DILexicalBlock(scope: !808, file: !1, line: 174, column: 40)
!815 = !DILocation(line: 175, column: 33, scope: !813)
!816 = !DILocation(line: 175, column: 19, scope: !813)
!817 = !DILocation(line: 175, column: 8, scope: !813)
!818 = !DILocation(line: 175, column: 37, scope: !819)
!819 = distinct !DILexicalBlock(scope: !813, file: !1, line: 175, column: 3)
!820 = !DILocation(line: 175, column: 3, scope: !813)
!821 = !DILocation(line: 176, column: 4, scope: !822)
!822 = distinct !DILexicalBlock(scope: !819, file: !1, line: 175, column: 82)
!823 = !DILocation(line: 176, column: 32, scope: !822)
!824 = !DILocation(line: 177, column: 3, scope: !822)
!825 = !DILocation(line: 175, column: 62, scope: !819)
!826 = !DILocation(line: 175, column: 74, scope: !819)
!827 = !DILocation(line: 175, column: 60, scope: !819)
!828 = !DILocation(line: 175, column: 3, scope: !819)
!829 = distinct !{!829, !820, !830}
!830 = !DILocation(line: 177, column: 3, scope: !813)
!831 = !DILocation(line: 178, column: 2, scope: !814)
!832 = !DILocation(line: 174, column: 36, scope: !808)
!833 = !DILocation(line: 174, column: 2, scope: !808)
!834 = distinct !{!834, !811, !835}
!835 = !DILocation(line: 178, column: 2, scope: !805)
!836 = !DILocation(line: 181, column: 9, scope: !837)
!837 = distinct !DILexicalBlock(scope: !791, file: !1, line: 181, column: 2)
!838 = !DILocation(line: 181, column: 7, scope: !837)
!839 = !DILocation(line: 181, column: 14, scope: !840)
!840 = distinct !DILexicalBlock(scope: !837, file: !1, line: 181, column: 2)
!841 = !DILocation(line: 181, column: 18, scope: !840)
!842 = !DILocation(line: 181, column: 16, scope: !840)
!843 = !DILocation(line: 181, column: 2, scope: !837)
!844 = !DILocation(line: 182, column: 16, scope: !845)
!845 = distinct !DILexicalBlock(scope: !840, file: !1, line: 181, column: 40)
!846 = !DILocation(line: 182, column: 28, scope: !845)
!847 = !DILocation(line: 182, column: 14, scope: !845)
!848 = !DILocation(line: 183, column: 21, scope: !849)
!849 = distinct !DILexicalBlock(scope: !845, file: !1, line: 183, column: 3)
!850 = !DILocation(line: 183, column: 33, scope: !849)
!851 = !DILocation(line: 183, column: 37, scope: !849)
!852 = !DILocation(line: 183, column: 19, scope: !849)
!853 = !DILocation(line: 183, column: 8, scope: !849)
!854 = !DILocation(line: 183, column: 45, scope: !855)
!855 = distinct !DILexicalBlock(scope: !849, file: !1, line: 183, column: 3)
!856 = !DILocation(line: 183, column: 3, scope: !849)
!857 = !DILocation(line: 184, column: 4, scope: !858)
!858 = distinct !DILexicalBlock(scope: !855, file: !1, line: 183, column: 90)
!859 = !DILocation(line: 184, column: 32, scope: !858)
!860 = !DILocation(line: 185, column: 3, scope: !858)
!861 = !DILocation(line: 183, column: 70, scope: !855)
!862 = !DILocation(line: 183, column: 82, scope: !855)
!863 = !DILocation(line: 183, column: 68, scope: !855)
!864 = !DILocation(line: 183, column: 3, scope: !855)
!865 = distinct !{!865, !856, !866}
!866 = !DILocation(line: 185, column: 3, scope: !849)
!867 = !DILocation(line: 186, column: 2, scope: !845)
!868 = !DILocation(line: 181, column: 36, scope: !840)
!869 = !DILocation(line: 181, column: 2, scope: !840)
!870 = distinct !{!870, !843, !871}
!871 = !DILocation(line: 186, column: 2, scope: !837)
!872 = !DILocation(line: 189, column: 20, scope: !873)
!873 = distinct !DILexicalBlock(scope: !791, file: !1, line: 189, column: 2)
!874 = !DILocation(line: 189, column: 36, scope: !873)
!875 = !DILocation(line: 189, column: 18, scope: !873)
!876 = !DILocation(line: 189, column: 7, scope: !873)
!877 = !DILocation(line: 189, column: 44, scope: !878)
!878 = distinct !DILexicalBlock(scope: !873, file: !1, line: 189, column: 2)
!879 = !DILocation(line: 189, column: 2, scope: !873)
!880 = !DILocation(line: 190, column: 7, scope: !881)
!881 = distinct !DILexicalBlock(scope: !882, file: !1, line: 190, column: 7)
!882 = distinct !DILexicalBlock(scope: !878, file: !1, line: 189, column: 89)
!883 = !DILocation(line: 190, column: 38, scope: !881)
!884 = !DILocation(line: 190, column: 35, scope: !881)
!885 = !DILocation(line: 190, column: 7, scope: !882)
!886 = !DILocation(line: 191, column: 11, scope: !887)
!887 = distinct !DILexicalBlock(scope: !881, file: !1, line: 190, column: 55)
!888 = !DILocation(line: 191, column: 4, scope: !887)
!889 = !DILocation(line: 193, column: 2, scope: !882)
!890 = !DILocation(line: 189, column: 69, scope: !878)
!891 = !DILocation(line: 189, column: 81, scope: !878)
!892 = !DILocation(line: 189, column: 67, scope: !878)
!893 = !DILocation(line: 189, column: 2, scope: !878)
!894 = distinct !{!894, !879, !895}
!895 = !DILocation(line: 193, column: 2, scope: !873)
!896 = !DILocation(line: 197, column: 2, scope: !791)
!897 = !DILocation(line: 198, column: 1, scope: !791)
!898 = distinct !DISubprogram(name: "ED_armature_ebone_to_mat3", scope: !1, file: !1, line: 200, type: !899, scopeLine: 201, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !164)
!899 = !DISubroutineType(types: !900)
!900 = !{null, !168, !901}
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!902 = !DILocalVariable(name: "ebone", arg: 1, scope: !898, file: !1, line: 200, type: !168)
!903 = !DILocation(line: 200, column: 42, scope: !898)
!904 = !DILocalVariable(name: "mat", arg: 2, scope: !898, file: !1, line: 200, type: !901)
!905 = !DILocation(line: 200, column: 55, scope: !898)
!906 = !DILocalVariable(name: "delta", scope: !898, file: !1, line: 202, type: !125)
!907 = !DILocation(line: 202, column: 8, scope: !898)
!908 = !DILocation(line: 205, column: 14, scope: !898)
!909 = !DILocation(line: 205, column: 21, scope: !898)
!910 = !DILocation(line: 205, column: 28, scope: !898)
!911 = !DILocation(line: 205, column: 34, scope: !898)
!912 = !DILocation(line: 205, column: 41, scope: !898)
!913 = !DILocation(line: 205, column: 2, scope: !898)
!914 = !DILocation(line: 206, column: 19, scope: !898)
!915 = !DILocation(line: 206, column: 26, scope: !898)
!916 = !DILocation(line: 206, column: 33, scope: !898)
!917 = !DILocation(line: 206, column: 39, scope: !898)
!918 = !DILocation(line: 206, column: 2, scope: !898)
!919 = !DILocation(line: 207, column: 1, scope: !898)
!920 = distinct !DISubprogram(name: "sub_v3_v3v3", scope: !921, file: !921, line: 357, type: !922, scopeLine: 358, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !164)
!921 = !DIFile(filename: "blender/source/blender/blenlib/intern/math_vector_inline.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!922 = !DISubroutineType(types: !923)
!923 = !{null, !924, !925, !925}
!924 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64)
!926 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !123)
!927 = !DILocalVariable(name: "r", arg: 1, scope: !920, file: !921, line: 357, type: !924)
!928 = !DILocation(line: 357, column: 32, scope: !920)
!929 = !DILocalVariable(name: "a", arg: 2, scope: !920, file: !921, line: 357, type: !925)
!930 = !DILocation(line: 357, column: 50, scope: !920)
!931 = !DILocalVariable(name: "b", arg: 3, scope: !920, file: !921, line: 357, type: !925)
!932 = !DILocation(line: 357, column: 68, scope: !920)
!933 = !DILocation(line: 359, column: 9, scope: !920)
!934 = !DILocation(line: 359, column: 16, scope: !920)
!935 = !DILocation(line: 359, column: 14, scope: !920)
!936 = !DILocation(line: 359, column: 2, scope: !920)
!937 = !DILocation(line: 359, column: 7, scope: !920)
!938 = !DILocation(line: 360, column: 9, scope: !920)
!939 = !DILocation(line: 360, column: 16, scope: !920)
!940 = !DILocation(line: 360, column: 14, scope: !920)
!941 = !DILocation(line: 360, column: 2, scope: !920)
!942 = !DILocation(line: 360, column: 7, scope: !920)
!943 = !DILocation(line: 361, column: 9, scope: !920)
!944 = !DILocation(line: 361, column: 16, scope: !920)
!945 = !DILocation(line: 361, column: 14, scope: !920)
!946 = !DILocation(line: 361, column: 2, scope: !920)
!947 = !DILocation(line: 361, column: 7, scope: !920)
!948 = !DILocation(line: 362, column: 1, scope: !920)
!949 = distinct !DISubprogram(name: "ED_armature_ebone_to_mat4", scope: !1, file: !1, line: 209, type: !950, scopeLine: 210, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !164)
!950 = !DISubroutineType(types: !951)
!951 = !{null, !168, !952}
!952 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!953 = !DILocalVariable(name: "ebone", arg: 1, scope: !949, file: !1, line: 209, type: !168)
!954 = !DILocation(line: 209, column: 42, scope: !949)
!955 = !DILocalVariable(name: "mat", arg: 2, scope: !949, file: !1, line: 209, type: !952)
!956 = !DILocation(line: 209, column: 55, scope: !949)
!957 = !DILocalVariable(name: "m3", scope: !949, file: !1, line: 211, type: !130)
!958 = !DILocation(line: 211, column: 8, scope: !949)
!959 = !DILocation(line: 213, column: 28, scope: !949)
!960 = !DILocation(line: 213, column: 35, scope: !949)
!961 = !DILocation(line: 213, column: 2, scope: !949)
!962 = !DILocation(line: 215, column: 13, scope: !949)
!963 = !DILocation(line: 215, column: 18, scope: !949)
!964 = !DILocation(line: 215, column: 2, scope: !949)
!965 = !DILocation(line: 216, column: 13, scope: !949)
!966 = !DILocation(line: 216, column: 21, scope: !949)
!967 = !DILocation(line: 216, column: 28, scope: !949)
!968 = !DILocation(line: 216, column: 2, scope: !949)
!969 = !DILocation(line: 217, column: 1, scope: !949)
!970 = distinct !DISubprogram(name: "copy_v3_v3", scope: !921, file: !921, line: 64, type: !971, scopeLine: 65, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !164)
!971 = !DISubroutineType(types: !972)
!972 = !{null, !924, !925}
!973 = !DILocalVariable(name: "r", arg: 1, scope: !970, file: !921, line: 64, type: !924)
!974 = !DILocation(line: 64, column: 31, scope: !970)
!975 = !DILocalVariable(name: "a", arg: 2, scope: !970, file: !921, line: 64, type: !925)
!976 = !DILocation(line: 64, column: 49, scope: !970)
!977 = !DILocation(line: 66, column: 9, scope: !970)
!978 = !DILocation(line: 66, column: 2, scope: !970)
!979 = !DILocation(line: 66, column: 7, scope: !970)
!980 = !DILocation(line: 67, column: 9, scope: !970)
!981 = !DILocation(line: 67, column: 2, scope: !970)
!982 = !DILocation(line: 67, column: 7, scope: !970)
!983 = !DILocation(line: 68, column: 9, scope: !970)
!984 = !DILocation(line: 68, column: 2, scope: !970)
!985 = !DILocation(line: 68, column: 7, scope: !970)
!986 = !DILocation(line: 69, column: 1, scope: !970)
!987 = distinct !DISubprogram(name: "ED_armature_ebone_from_mat3", scope: !1, file: !1, line: 219, type: !899, scopeLine: 220, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !164)
!988 = !DILocalVariable(name: "ebone", arg: 1, scope: !987, file: !1, line: 219, type: !168)
!989 = !DILocation(line: 219, column: 44, scope: !987)
!990 = !DILocalVariable(name: "mat", arg: 2, scope: !987, file: !1, line: 219, type: !901)
!991 = !DILocation(line: 219, column: 57, scope: !987)
!992 = !DILocalVariable(name: "vec", scope: !987, file: !1, line: 221, type: !125)
!993 = !DILocation(line: 221, column: 8, scope: !987)
!994 = !DILocalVariable(name: "roll", scope: !987, file: !1, line: 221, type: !123)
!995 = !DILocation(line: 221, column: 16, scope: !987)
!996 = !DILocalVariable(name: "len", scope: !987, file: !1, line: 222, type: !926)
!997 = !DILocation(line: 222, column: 14, scope: !987)
!998 = !DILocation(line: 222, column: 29, scope: !987)
!999 = !DILocation(line: 222, column: 36, scope: !987)
!1000 = !DILocation(line: 222, column: 42, scope: !987)
!1001 = !DILocation(line: 222, column: 49, scope: !987)
!1002 = !DILocation(line: 222, column: 20, scope: !987)
!1003 = !DILocation(line: 224, column: 19, scope: !987)
!1004 = !DILocation(line: 224, column: 24, scope: !987)
!1005 = !DILocation(line: 224, column: 2, scope: !987)
!1006 = !DILocation(line: 226, column: 17, scope: !987)
!1007 = !DILocation(line: 226, column: 24, scope: !987)
!1008 = !DILocation(line: 226, column: 30, scope: !987)
!1009 = !DILocation(line: 226, column: 37, scope: !987)
!1010 = !DILocation(line: 226, column: 43, scope: !987)
!1011 = !DILocation(line: 226, column: 48, scope: !987)
!1012 = !DILocation(line: 226, column: 2, scope: !987)
!1013 = !DILocation(line: 227, column: 16, scope: !987)
!1014 = !DILocation(line: 227, column: 2, scope: !987)
!1015 = !DILocation(line: 227, column: 9, scope: !987)
!1016 = !DILocation(line: 227, column: 14, scope: !987)
!1017 = !DILocation(line: 228, column: 1, scope: !987)
!1018 = distinct !DISubprogram(name: "len_v3v3", scope: !921, file: !921, line: 759, type: !1019, scopeLine: 760, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !164)
!1019 = !DISubroutineType(types: !1020)
!1020 = !{!123, !925, !925}
!1021 = !DILocalVariable(name: "a", arg: 1, scope: !1018, file: !921, line: 759, type: !925)
!1022 = !DILocation(line: 759, column: 36, scope: !1018)
!1023 = !DILocalVariable(name: "b", arg: 2, scope: !1018, file: !921, line: 759, type: !925)
!1024 = !DILocation(line: 759, column: 54, scope: !1018)
!1025 = !DILocalVariable(name: "d", scope: !1018, file: !921, line: 761, type: !125)
!1026 = !DILocation(line: 761, column: 8, scope: !1018)
!1027 = !DILocation(line: 763, column: 14, scope: !1018)
!1028 = !DILocation(line: 763, column: 17, scope: !1018)
!1029 = !DILocation(line: 763, column: 20, scope: !1018)
!1030 = !DILocation(line: 763, column: 2, scope: !1018)
!1031 = !DILocation(line: 764, column: 16, scope: !1018)
!1032 = !DILocation(line: 764, column: 9, scope: !1018)
!1033 = !DILocation(line: 764, column: 2, scope: !1018)
!1034 = distinct !DISubprogram(name: "madd_v3_v3v3fl", scope: !921, file: !921, line: 527, type: !1035, scopeLine: 528, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !164)
!1035 = !DISubroutineType(types: !1036)
!1036 = !{null, !924, !925, !925, !123}
!1037 = !DILocalVariable(name: "r", arg: 1, scope: !1034, file: !921, line: 527, type: !924)
!1038 = !DILocation(line: 527, column: 35, scope: !1034)
!1039 = !DILocalVariable(name: "a", arg: 2, scope: !1034, file: !921, line: 527, type: !925)
!1040 = !DILocation(line: 527, column: 53, scope: !1034)
!1041 = !DILocalVariable(name: "b", arg: 3, scope: !1034, file: !921, line: 527, type: !925)
!1042 = !DILocation(line: 527, column: 71, scope: !1034)
!1043 = !DILocalVariable(name: "f", arg: 4, scope: !1034, file: !921, line: 527, type: !123)
!1044 = !DILocation(line: 527, column: 83, scope: !1034)
!1045 = !DILocation(line: 529, column: 9, scope: !1034)
!1046 = !DILocation(line: 529, column: 16, scope: !1034)
!1047 = !DILocation(line: 529, column: 23, scope: !1034)
!1048 = !DILocation(line: 529, column: 21, scope: !1034)
!1049 = !DILocation(line: 529, column: 14, scope: !1034)
!1050 = !DILocation(line: 529, column: 2, scope: !1034)
!1051 = !DILocation(line: 529, column: 7, scope: !1034)
!1052 = !DILocation(line: 530, column: 9, scope: !1034)
!1053 = !DILocation(line: 530, column: 16, scope: !1034)
!1054 = !DILocation(line: 530, column: 23, scope: !1034)
!1055 = !DILocation(line: 530, column: 21, scope: !1034)
!1056 = !DILocation(line: 530, column: 14, scope: !1034)
!1057 = !DILocation(line: 530, column: 2, scope: !1034)
!1058 = !DILocation(line: 530, column: 7, scope: !1034)
!1059 = !DILocation(line: 531, column: 9, scope: !1034)
!1060 = !DILocation(line: 531, column: 16, scope: !1034)
!1061 = !DILocation(line: 531, column: 23, scope: !1034)
!1062 = !DILocation(line: 531, column: 21, scope: !1034)
!1063 = !DILocation(line: 531, column: 14, scope: !1034)
!1064 = !DILocation(line: 531, column: 2, scope: !1034)
!1065 = !DILocation(line: 531, column: 7, scope: !1034)
!1066 = !DILocation(line: 532, column: 1, scope: !1034)
!1067 = distinct !DISubprogram(name: "ED_armature_ebone_from_mat4", scope: !1, file: !1, line: 230, type: !950, scopeLine: 231, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !164)
!1068 = !DILocalVariable(name: "ebone", arg: 1, scope: !1067, file: !1, line: 230, type: !168)
!1069 = !DILocation(line: 230, column: 44, scope: !1067)
!1070 = !DILocalVariable(name: "mat", arg: 2, scope: !1067, file: !1, line: 230, type: !952)
!1071 = !DILocation(line: 230, column: 57, scope: !1067)
!1072 = !DILocalVariable(name: "mat3", scope: !1067, file: !1, line: 232, type: !130)
!1073 = !DILocation(line: 232, column: 8, scope: !1067)
!1074 = !DILocation(line: 234, column: 13, scope: !1067)
!1075 = !DILocation(line: 234, column: 19, scope: !1067)
!1076 = !DILocation(line: 234, column: 2, scope: !1067)
!1077 = !DILocation(line: 236, column: 2, scope: !1067)
!1078 = !DILocation(line: 238, column: 12, scope: !1067)
!1079 = !DILocation(line: 238, column: 19, scope: !1067)
!1080 = !DILocation(line: 238, column: 25, scope: !1067)
!1081 = !DILocation(line: 238, column: 32, scope: !1067)
!1082 = !DILocation(line: 238, column: 2, scope: !1067)
!1083 = !DILocation(line: 239, column: 13, scope: !1067)
!1084 = !DILocation(line: 239, column: 20, scope: !1067)
!1085 = !DILocation(line: 239, column: 26, scope: !1067)
!1086 = !DILocation(line: 239, column: 2, scope: !1067)
!1087 = !DILocation(line: 240, column: 12, scope: !1067)
!1088 = !DILocation(line: 240, column: 19, scope: !1067)
!1089 = !DILocation(line: 240, column: 25, scope: !1067)
!1090 = !DILocation(line: 240, column: 2, scope: !1067)
!1091 = !DILocation(line: 241, column: 30, scope: !1067)
!1092 = !DILocation(line: 241, column: 37, scope: !1067)
!1093 = !DILocation(line: 241, column: 2, scope: !1067)
!1094 = !DILocation(line: 242, column: 1, scope: !1067)
!1095 = distinct !DISubprogram(name: "sub_v3_v3", scope: !921, file: !921, line: 350, type: !971, scopeLine: 351, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !164)
!1096 = !DILocalVariable(name: "r", arg: 1, scope: !1095, file: !921, line: 350, type: !924)
!1097 = !DILocation(line: 350, column: 30, scope: !1095)
!1098 = !DILocalVariable(name: "a", arg: 2, scope: !1095, file: !921, line: 350, type: !925)
!1099 = !DILocation(line: 350, column: 48, scope: !1095)
!1100 = !DILocation(line: 352, column: 10, scope: !1095)
!1101 = !DILocation(line: 352, column: 2, scope: !1095)
!1102 = !DILocation(line: 352, column: 7, scope: !1095)
!1103 = !DILocation(line: 353, column: 10, scope: !1095)
!1104 = !DILocation(line: 353, column: 2, scope: !1095)
!1105 = !DILocation(line: 353, column: 7, scope: !1095)
!1106 = !DILocation(line: 354, column: 10, scope: !1095)
!1107 = !DILocation(line: 354, column: 2, scope: !1095)
!1108 = !DILocation(line: 354, column: 7, scope: !1095)
!1109 = !DILocation(line: 355, column: 1, scope: !1095)
!1110 = distinct !DISubprogram(name: "add_v3_v3", scope: !921, file: !921, line: 302, type: !971, scopeLine: 303, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !164)
!1111 = !DILocalVariable(name: "r", arg: 1, scope: !1110, file: !921, line: 302, type: !924)
!1112 = !DILocation(line: 302, column: 30, scope: !1110)
!1113 = !DILocalVariable(name: "a", arg: 2, scope: !1110, file: !921, line: 302, type: !925)
!1114 = !DILocation(line: 302, column: 48, scope: !1110)
!1115 = !DILocation(line: 304, column: 10, scope: !1110)
!1116 = !DILocation(line: 304, column: 2, scope: !1110)
!1117 = !DILocation(line: 304, column: 7, scope: !1110)
!1118 = !DILocation(line: 305, column: 10, scope: !1110)
!1119 = !DILocation(line: 305, column: 2, scope: !1110)
!1120 = !DILocation(line: 305, column: 7, scope: !1110)
!1121 = !DILocation(line: 306, column: 10, scope: !1110)
!1122 = !DILocation(line: 306, column: 2, scope: !1110)
!1123 = !DILocation(line: 306, column: 7, scope: !1110)
!1124 = !DILocation(line: 307, column: 1, scope: !1110)
!1125 = distinct !DISubprogram(name: "ED_armature_bone_find_name", scope: !1, file: !1, line: 247, type: !1126, scopeLine: 248, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !164)
!1126 = !DISubroutineType(types: !1127)
!1127 = !{!168, !1128, !1130}
!1128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1129, size: 64)
!1129 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !109)
!1130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1131, size: 64)
