; ModuleID = 'blender/source/blender/modifiers/intern/MOD_wave.c'
source_filename = "blender/source/blender/modifiers/intern/MOD_wave.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!71 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!72 = !{!73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83}
!73 = !DIEnumerator(name: "OB_EMPTY", value: 0, isUnsigned: true)
!74 = !DIEnumerator(name: "OB_MESH", value: 1, isUnsigned: true)
!75 = !DIEnumerator(name: "OB_CURVE", value: 2, isUnsigned: true)
!76 = !DIEnumerator(name: "OB_SURF", value: 3, isUnsigned: true)
!77 = !DIEnumerator(name: "OB_FONT", value: 4, isUnsigned: true)
!78 = !DIEnumerator(name: "OB_MBALL", value: 5, isUnsigned: true)
!79 = !DIEnumerator(name: "OB_LAMP", value: 10, isUnsigned: true)
!80 = !DIEnumerator(name: "OB_CAMERA", value: 11, isUnsigned: true)
!81 = !DIEnumerator(name: "OB_SPEAKER", value: 12, isUnsigned: true)
!82 = !DIEnumerator(name: "OB_LATTICE", value: 22, isUnsigned: true)
!83 = !DIEnumerator(name: "OB_ARMATURE", value: 25, isUnsigned: true)
!84 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !61, line: 393, baseType: !7, size: 32, elements: !85)
!85 = !{!86, !87, !88, !89}
!86 = !DIEnumerator(name: "MOD_DISP_MAP_LOCAL", value: 0, isUnsigned: true)
!87 = !DIEnumerator(name: "MOD_DISP_MAP_GLOBAL", value: 1, isUnsigned: true)
!88 = !DIEnumerator(name: "MOD_DISP_MAP_OBJECT", value: 2, isUnsigned: true)
!89 = !DIEnumerator(name: "MOD_DISP_MAP_UV", value: 3, isUnsigned: true)
!90 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !91, line: 76, baseType: !7, size: 32, elements: !92)
!91 = !DIFile(filename: "blender/source/blender/makesdna/DNA_customdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!92 = !{!93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133}
!93 = !DIEnumerator(name: "CD_MVERT", value: 0, isUnsigned: true)
!94 = !DIEnumerator(name: "CD_MSTICKY", value: 1, isUnsigned: true)
!95 = !DIEnumerator(name: "CD_MDEFORMVERT", value: 2, isUnsigned: true)
!96 = !DIEnumerator(name: "CD_MEDGE", value: 3, isUnsigned: true)
!97 = !DIEnumerator(name: "CD_MFACE", value: 4, isUnsigned: true)
!98 = !DIEnumerator(name: "CD_MTFACE", value: 5, isUnsigned: true)
!99 = !DIEnumerator(name: "CD_MCOL", value: 6, isUnsigned: true)
!100 = !DIEnumerator(name: "CD_ORIGINDEX", value: 7, isUnsigned: true)
!101 = !DIEnumerator(name: "CD_NORMAL", value: 8, isUnsigned: true)
!102 = !DIEnumerator(name: "CD_PROP_FLT", value: 10, isUnsigned: true)
!103 = !DIEnumerator(name: "CD_PROP_INT", value: 11, isUnsigned: true)
!104 = !DIEnumerator(name: "CD_PROP_STR", value: 12, isUnsigned: true)
!105 = !DIEnumerator(name: "CD_ORIGSPACE", value: 13, isUnsigned: true)
!106 = !DIEnumerator(name: "CD_ORCO", value: 14, isUnsigned: true)
!107 = !DIEnumerator(name: "CD_MTEXPOLY", value: 15, isUnsigned: true)
!108 = !DIEnumerator(name: "CD_MLOOPUV", value: 16, isUnsigned: true)
!109 = !DIEnumerator(name: "CD_MLOOPCOL", value: 17, isUnsigned: true)
!110 = !DIEnumerator(name: "CD_TANGENT", value: 18, isUnsigned: true)
!111 = !DIEnumerator(name: "CD_MDISPS", value: 19, isUnsigned: true)
!112 = !DIEnumerator(name: "CD_PREVIEW_MCOL", value: 20, isUnsigned: true)
!113 = !DIEnumerator(name: "CD_ID_MCOL", value: 21, isUnsigned: true)
!114 = !DIEnumerator(name: "CD_TEXTURE_MCOL", value: 22, isUnsigned: true)
!115 = !DIEnumerator(name: "CD_CLOTH_ORCO", value: 23, isUnsigned: true)
!116 = !DIEnumerator(name: "CD_RECAST", value: 24, isUnsigned: true)
!117 = !DIEnumerator(name: "CD_MPOLY", value: 25, isUnsigned: true)
!118 = !DIEnumerator(name: "CD_MLOOP", value: 26, isUnsigned: true)
!119 = !DIEnumerator(name: "CD_SHAPE_KEYINDEX", value: 27, isUnsigned: true)
!120 = !DIEnumerator(name: "CD_SHAPEKEY", value: 28, isUnsigned: true)
!121 = !DIEnumerator(name: "CD_BWEIGHT", value: 29, isUnsigned: true)
!122 = !DIEnumerator(name: "CD_CREASE", value: 30, isUnsigned: true)
!123 = !DIEnumerator(name: "CD_ORIGSPACE_MLOOP", value: 31, isUnsigned: true)
!124 = !DIEnumerator(name: "CD_PREVIEW_MLOOPCOL", value: 32, isUnsigned: true)
!125 = !DIEnumerator(name: "CD_BM_ELEM_PYPTR", value: 33, isUnsigned: true)
!126 = !DIEnumerator(name: "CD_PAINT_MASK", value: 34, isUnsigned: true)
!127 = !DIEnumerator(name: "CD_GRID_PAINT_MASK", value: 35, isUnsigned: true)
!128 = !DIEnumerator(name: "CD_MVERT_SKIN", value: 36, isUnsigned: true)
!129 = !DIEnumerator(name: "CD_FREESTYLE_EDGE", value: 37, isUnsigned: true)
!130 = !DIEnumerator(name: "CD_FREESTYLE_FACE", value: 38, isUnsigned: true)
!131 = !DIEnumerator(name: "CD_MLOOPTANGENT", value: 39, isUnsigned: true)
!132 = !DIEnumerator(name: "CD_TESSLOOPNORMAL", value: 40, isUnsigned: true)
!133 = !DIEnumerator(name: "CD_NUMTYPES", value: 41, isUnsigned: true)
!134 = !{!135, !261, !1888, !1898, !1899}
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "WaveModifierData", file: !61, line: 513, baseType: !137)
!137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "WaveModifierData", file: !61, line: 492, size: 2560, elements: !138)
!138 = !{!139, !1703, !1869, !1870, !1871, !1872, !1873, !1874, !1875, !1876, !1877, !1878, !1879, !1880, !1881, !1882, !1883, !1884, !1885, !1886, !1887}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "modifier", scope: !137, file: !61, line: 493, baseType: !140, size: 896)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "ModifierData", file: !61, line: 110, baseType: !141)
!141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ModifierData", file: !61, line: 99, size: 896, elements: !142)
!142 = !{!143, !145, !146, !148, !149, !150, !151, !156, !1702}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !141, file: !61, line: 100, baseType: !144, size: 64)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !141, file: !61, line: 100, baseType: !144, size: 64, offset: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !141, file: !61, line: 102, baseType: !147, size: 32, offset: 128)
!147 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !141, file: !61, line: 102, baseType: !147, size: 32, offset: 160)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "stackindex", scope: !141, file: !61, line: 103, baseType: !147, size: 32, offset: 192)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !141, file: !61, line: 103, baseType: !147, size: 32, offset: 224)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !141, file: !61, line: 104, baseType: !152, size: 512, offset: 256)
!152 = !DICompositeType(tag: DW_TAG_array_type, baseType: !153, size: 512, elements: !154)
!153 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!154 = !{!155}
!155 = !DISubrange(count: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !141, file: !61, line: 107, baseType: !157, size: 64, offset: 768)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !159, line: 1216, size: 39680, elements: !160)
!159 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!160 = !{!161, !228, !231, !1005, !1008, !1009, !1010, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1036, !1039, !1042, !1266, !1269, !1568, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1598, !1599, !1600, !1601, !1602, !1610, !1676, !1683, !1684, !1691, !1694, !1695, !1696, !1697, !1698, !1699}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !158, file: !159, line: 1217, baseType: !162, size: 960)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !163, line: 130, baseType: !164)
!163 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !163, line: 117, size: 960, elements: !165)
!165 = !{!166, !168, !169, !171, !190, !194, !196, !197, !198, !199}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !164, file: !163, line: 118, baseType: !167, size: 64)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !164, file: !163, line: 118, baseType: !167, size: 64, offset: 64)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !164, file: !163, line: 119, baseType: !170, size: 64, offset: 128)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !164, file: !163, line: 120, baseType: !172, size: 64, offset: 192)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !163, line: 136, size: 17600, elements: !174)
!174 = !{!175, !176, !178, !181, !185, !186, !187}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !173, file: !163, line: 137, baseType: !162, size: 960)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !173, file: !163, line: 138, baseType: !177, size: 64, offset: 960)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !173, file: !163, line: 139, baseType: !179, size: 64, offset: 1024)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !163, line: 43, flags: DIFlagFwdDecl)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !173, file: !163, line: 140, baseType: !182, size: 8192, offset: 1088)
!182 = !DICompositeType(tag: DW_TAG_array_type, baseType: !153, size: 8192, elements: !183)
!183 = !{!184}
!184 = !DISubrange(count: 1024)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !173, file: !163, line: 141, baseType: !182, size: 8192, offset: 9280)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !173, file: !163, line: 148, baseType: !172, size: 64, offset: 17472)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !173, file: !163, line: 150, baseType: !188, size: 64, offset: 17536)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !163, line: 45, flags: DIFlagFwdDecl)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !164, file: !163, line: 121, baseType: !191, size: 528, offset: 256)
!191 = !DICompositeType(tag: DW_TAG_array_type, baseType: !153, size: 528, elements: !192)
!192 = !{!193}
!193 = !DISubrange(count: 66)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !164, file: !163, line: 126, baseType: !195, size: 16, offset: 784)
!195 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !164, file: !163, line: 127, baseType: !147, size: 32, offset: 800)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !164, file: !163, line: 128, baseType: !147, size: 32, offset: 832)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !164, file: !163, line: 128, baseType: !147, size: 32, offset: 864)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !164, file: !163, line: 129, baseType: !200, size: 64, offset: 896)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !163, line: 75, baseType: !202)
!202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !163, line: 62, size: 1024, elements: !203)
!203 = !{!204, !206, !207, !208, !209, !210, !211, !212, !226, !227}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !202, file: !163, line: 63, baseType: !205, size: 64)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !202, file: !163, line: 63, baseType: !205, size: 64, offset: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !202, file: !163, line: 64, baseType: !153, size: 8, offset: 128)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !202, file: !163, line: 64, baseType: !153, size: 8, offset: 136)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !202, file: !163, line: 65, baseType: !195, size: 16, offset: 144)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !202, file: !163, line: 66, baseType: !152, size: 512, offset: 160)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !202, file: !163, line: 67, baseType: !147, size: 32, offset: 672)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !202, file: !163, line: 69, baseType: !213, size: 256, offset: 704)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !163, line: 60, baseType: !214)
!214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !163, line: 48, size: 256, elements: !215)
!215 = !{!216, !217, !224, !225}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !214, file: !163, line: 49, baseType: !167, size: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !214, file: !163, line: 58, baseType: !218, size: 128, offset: 64)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !219, line: 71, baseType: !220)
!219 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!220 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !219, line: 69, size: 128, elements: !221)
!221 = !{!222, !223}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !220, file: !219, line: 70, baseType: !167, size: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !220, file: !219, line: 70, baseType: !167, size: 64, offset: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !214, file: !163, line: 59, baseType: !147, size: 32, offset: 192)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !214, file: !163, line: 59, baseType: !147, size: 32, offset: 224)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !202, file: !163, line: 70, baseType: !147, size: 32, offset: 960)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !202, file: !163, line: 74, baseType: !147, size: 32, offset: 992)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !158, file: !159, line: 1218, baseType: !229, size: 64, offset: 960)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!230 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !159, line: 58, flags: DIFlagFwdDecl)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !158, file: !159, line: 1220, baseType: !232, size: 64, offset: 1024)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !71, line: 115, size: 11392, elements: !234)
!234 = !{!235, !236, !237, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !255, !267, !281, !282, !325, !326, !329, !330, !346, !347, !348, !349, !350, !351, !352, !356, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !372, !373, !374, !375, !376, !377, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !437, !438, !439, !440, !441, !442, !443, !444, !445, !448, !451, !455, !456, !457, !458, !459, !462, !465, !952, !953, !959, !960, !961, !962, !963, !964, !966, !969, !972, !974, !993, !994}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !233, file: !71, line: 116, baseType: !162, size: 960)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !233, file: !71, line: 117, baseType: !229, size: 64, offset: 960)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !233, file: !71, line: 119, baseType: !238, size: 64, offset: 1024)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!239 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !71, line: 57, flags: DIFlagFwdDecl)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !233, file: !71, line: 121, baseType: !195, size: 16, offset: 1088)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !233, file: !71, line: 121, baseType: !195, size: 16, offset: 1104)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !233, file: !71, line: 122, baseType: !147, size: 32, offset: 1120)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !233, file: !71, line: 122, baseType: !147, size: 32, offset: 1152)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !233, file: !71, line: 122, baseType: !147, size: 32, offset: 1184)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !233, file: !71, line: 123, baseType: !152, size: 512, offset: 1216)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !233, file: !71, line: 124, baseType: !232, size: 64, offset: 1728)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !233, file: !71, line: 124, baseType: !232, size: 64, offset: 1792)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !233, file: !71, line: 127, baseType: !232, size: 64, offset: 1856)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !233, file: !71, line: 127, baseType: !232, size: 64, offset: 1920)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !233, file: !71, line: 127, baseType: !232, size: 64, offset: 1984)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !233, file: !71, line: 128, baseType: !252, size: 64, offset: 2048)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!253 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !254, line: 46, flags: DIFlagFwdDecl)
!254 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!255 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !233, file: !71, line: 130, baseType: !256, size: 64, offset: 2112)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!257 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !71, line: 97, size: 832, elements: !258)
!258 = !{!259, !265, !266}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !257, file: !71, line: 98, baseType: !260, size: 768)
!260 = !DICompositeType(tag: DW_TAG_array_type, baseType: !261, size: 768, elements: !262)
!261 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!262 = !{!263, !264}
!263 = !DISubrange(count: 8)
!264 = !DISubrange(count: 3)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !257, file: !71, line: 99, baseType: !147, size: 32, offset: 768)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !257, file: !71, line: 99, baseType: !147, size: 32, offset: 800)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !233, file: !71, line: 131, baseType: !268, size: 64, offset: 2176)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!269 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !270, line: 486, size: 1600, elements: !271)
!270 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!271 = !{!272, !273, !274, !275, !276, !277, !278, !279, !280}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !269, file: !270, line: 487, baseType: !162, size: 960)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !269, file: !270, line: 489, baseType: !218, size: 128, offset: 960)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !269, file: !270, line: 490, baseType: !218, size: 128, offset: 1088)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !269, file: !270, line: 491, baseType: !218, size: 128, offset: 1216)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !269, file: !270, line: 492, baseType: !218, size: 128, offset: 1344)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !269, file: !270, line: 494, baseType: !147, size: 32, offset: 1472)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !269, file: !270, line: 495, baseType: !147, size: 32, offset: 1504)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !269, file: !270, line: 497, baseType: !147, size: 32, offset: 1536)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !269, file: !270, line: 498, baseType: !147, size: 32, offset: 1568)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !233, file: !71, line: 132, baseType: !268, size: 64, offset: 2240)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !233, file: !71, line: 133, baseType: !283, size: 64, offset: 2304)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64)
!284 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !270, line: 334, size: 1728, elements: !285)
!285 = !{!286, !287, !290, !291, !292, !293, !294, !295, !298, !299, !300, !301, !302, !303, !304, !324}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !284, file: !270, line: 335, baseType: !218, size: 128)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !284, file: !270, line: 336, baseType: !288, size: 64, offset: 128)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!289 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !270, line: 47, flags: DIFlagFwdDecl)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !284, file: !270, line: 338, baseType: !195, size: 16, offset: 192)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !284, file: !270, line: 338, baseType: !195, size: 16, offset: 208)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !284, file: !270, line: 339, baseType: !7, size: 32, offset: 224)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !284, file: !270, line: 340, baseType: !147, size: 32, offset: 256)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !284, file: !270, line: 342, baseType: !261, size: 32, offset: 288)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !284, file: !270, line: 343, baseType: !296, size: 96, offset: 320)
!296 = !DICompositeType(tag: DW_TAG_array_type, baseType: !261, size: 96, elements: !297)
!297 = !{!264}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !284, file: !270, line: 344, baseType: !296, size: 96, offset: 416)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !284, file: !270, line: 347, baseType: !218, size: 128, offset: 512)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !284, file: !270, line: 349, baseType: !147, size: 32, offset: 640)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !284, file: !270, line: 350, baseType: !147, size: 32, offset: 672)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !284, file: !270, line: 351, baseType: !167, size: 64, offset: 704)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !284, file: !270, line: 352, baseType: !167, size: 64, offset: 768)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !284, file: !270, line: 354, baseType: !305, size: 384, offset: 832)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !270, line: 116, baseType: !306)
!306 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !270, line: 94, size: 384, elements: !307)
!307 = !{!308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !306, file: !270, line: 96, baseType: !147, size: 32)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !306, file: !270, line: 96, baseType: !147, size: 32, offset: 32)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !306, file: !270, line: 97, baseType: !147, size: 32, offset: 64)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !306, file: !270, line: 97, baseType: !147, size: 32, offset: 96)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !306, file: !270, line: 99, baseType: !195, size: 16, offset: 128)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !306, file: !270, line: 100, baseType: !195, size: 16, offset: 144)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !306, file: !270, line: 102, baseType: !195, size: 16, offset: 160)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !306, file: !270, line: 105, baseType: !195, size: 16, offset: 176)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !306, file: !270, line: 108, baseType: !195, size: 16, offset: 192)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !306, file: !270, line: 109, baseType: !195, size: 16, offset: 208)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !306, file: !270, line: 111, baseType: !195, size: 16, offset: 224)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !306, file: !270, line: 112, baseType: !195, size: 16, offset: 240)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !306, file: !270, line: 114, baseType: !147, size: 32, offset: 256)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !306, file: !270, line: 114, baseType: !147, size: 32, offset: 288)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !306, file: !270, line: 115, baseType: !147, size: 32, offset: 320)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !306, file: !270, line: 115, baseType: !147, size: 32, offset: 352)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !284, file: !270, line: 355, baseType: !152, size: 512, offset: 1216)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !233, file: !71, line: 134, baseType: !167, size: 64, offset: 2368)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !233, file: !71, line: 136, baseType: !327, size: 64, offset: 2432)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64)
!328 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !159, line: 61, flags: DIFlagFwdDecl)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !233, file: !71, line: 138, baseType: !305, size: 384, offset: 2496)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !233, file: !71, line: 139, baseType: !331, size: 64, offset: 2880)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !270, line: 80, baseType: !333)
!333 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !270, line: 72, size: 192, elements: !334)
!334 = !{!335, !342, !343, !344, !345}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !333, file: !270, line: 73, baseType: !336, size: 64)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !270, line: 59, baseType: !338)
!338 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !270, line: 56, size: 128, elements: !339)
!339 = !{!340, !341}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !338, file: !270, line: 57, baseType: !296, size: 96)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !338, file: !270, line: 58, baseType: !147, size: 32, offset: 96)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !333, file: !270, line: 74, baseType: !147, size: 32, offset: 64)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !333, file: !270, line: 76, baseType: !147, size: 32, offset: 96)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !333, file: !270, line: 77, baseType: !147, size: 32, offset: 128)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !333, file: !270, line: 79, baseType: !147, size: 32, offset: 160)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !233, file: !71, line: 141, baseType: !218, size: 128, offset: 2944)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !233, file: !71, line: 142, baseType: !218, size: 128, offset: 3072)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !233, file: !71, line: 143, baseType: !218, size: 128, offset: 3200)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !233, file: !71, line: 144, baseType: !218, size: 128, offset: 3328)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !233, file: !71, line: 146, baseType: !147, size: 32, offset: 3456)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !233, file: !71, line: 147, baseType: !147, size: 32, offset: 3488)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !233, file: !71, line: 150, baseType: !353, size: 64, offset: 3520)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!355 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !159, line: 179, flags: DIFlagFwdDecl)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !233, file: !71, line: 151, baseType: !357, size: 64, offset: 3584)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !233, file: !71, line: 152, baseType: !147, size: 32, offset: 3648)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !233, file: !71, line: 153, baseType: !147, size: 32, offset: 3680)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !233, file: !71, line: 156, baseType: !296, size: 96, offset: 3712)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !233, file: !71, line: 156, baseType: !296, size: 96, offset: 3808)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !233, file: !71, line: 156, baseType: !296, size: 96, offset: 3904)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !233, file: !71, line: 157, baseType: !296, size: 96, offset: 4000)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !233, file: !71, line: 158, baseType: !296, size: 96, offset: 4096)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !233, file: !71, line: 159, baseType: !296, size: 96, offset: 4192)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !233, file: !71, line: 160, baseType: !296, size: 96, offset: 4288)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !233, file: !71, line: 160, baseType: !296, size: 96, offset: 4384)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !233, file: !71, line: 161, baseType: !369, size: 128, offset: 4480)
!369 = !DICompositeType(tag: DW_TAG_array_type, baseType: !261, size: 128, elements: !370)
!370 = !{!371}
!371 = !DISubrange(count: 4)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !233, file: !71, line: 161, baseType: !369, size: 128, offset: 4608)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !233, file: !71, line: 162, baseType: !296, size: 96, offset: 4736)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !233, file: !71, line: 162, baseType: !296, size: 96, offset: 4832)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !233, file: !71, line: 163, baseType: !261, size: 32, offset: 4928)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !233, file: !71, line: 163, baseType: !261, size: 32, offset: 4960)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !233, file: !71, line: 164, baseType: !378, size: 512, offset: 4992)
!378 = !DICompositeType(tag: DW_TAG_array_type, baseType: !261, size: 512, elements: !379)
!379 = !{!371, !371}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !233, file: !71, line: 165, baseType: !378, size: 512, offset: 5504)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !233, file: !71, line: 166, baseType: !378, size: 512, offset: 6016)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !233, file: !71, line: 167, baseType: !378, size: 512, offset: 6528)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !233, file: !71, line: 176, baseType: !378, size: 512, offset: 7040)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !233, file: !71, line: 178, baseType: !7, size: 32, offset: 7552)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !233, file: !71, line: 180, baseType: !195, size: 16, offset: 7584)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !233, file: !71, line: 181, baseType: !195, size: 16, offset: 7600)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !233, file: !71, line: 183, baseType: !195, size: 16, offset: 7616)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !233, file: !71, line: 183, baseType: !195, size: 16, offset: 7632)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !233, file: !71, line: 184, baseType: !195, size: 16, offset: 7648)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !233, file: !71, line: 184, baseType: !195, size: 16, offset: 7664)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !233, file: !71, line: 185, baseType: !195, size: 16, offset: 7680)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !233, file: !71, line: 186, baseType: !195, size: 16, offset: 7696)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !233, file: !71, line: 187, baseType: !195, size: 16, offset: 7712)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !233, file: !71, line: 188, baseType: !153, size: 8, offset: 7728)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !233, file: !71, line: 189, baseType: !153, size: 8, offset: 7736)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !233, file: !71, line: 192, baseType: !147, size: 32, offset: 7744)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !233, file: !71, line: 192, baseType: !147, size: 32, offset: 7776)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !233, file: !71, line: 192, baseType: !147, size: 32, offset: 7808)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !233, file: !71, line: 192, baseType: !147, size: 32, offset: 7840)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !233, file: !71, line: 194, baseType: !147, size: 32, offset: 7872)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !233, file: !71, line: 202, baseType: !261, size: 32, offset: 7904)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !233, file: !71, line: 202, baseType: !261, size: 32, offset: 7936)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !233, file: !71, line: 202, baseType: !261, size: 32, offset: 7968)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !233, file: !71, line: 211, baseType: !261, size: 32, offset: 8000)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !233, file: !71, line: 212, baseType: !261, size: 32, offset: 8032)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !233, file: !71, line: 213, baseType: !261, size: 32, offset: 8064)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !233, file: !71, line: 214, baseType: !261, size: 32, offset: 8096)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !233, file: !71, line: 215, baseType: !261, size: 32, offset: 8128)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !233, file: !71, line: 216, baseType: !261, size: 32, offset: 8160)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !233, file: !71, line: 219, baseType: !261, size: 32, offset: 8192)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !233, file: !71, line: 220, baseType: !261, size: 32, offset: 8224)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !233, file: !71, line: 221, baseType: !261, size: 32, offset: 8256)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !233, file: !71, line: 224, baseType: !414, size: 16, offset: 8288)
!414 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !233, file: !71, line: 224, baseType: !414, size: 16, offset: 8304)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !233, file: !71, line: 226, baseType: !195, size: 16, offset: 8320)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !233, file: !71, line: 228, baseType: !153, size: 8, offset: 8336)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !233, file: !71, line: 229, baseType: !153, size: 8, offset: 8344)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !233, file: !71, line: 231, baseType: !195, size: 16, offset: 8352)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !233, file: !71, line: 232, baseType: !153, size: 8, offset: 8368)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !233, file: !71, line: 233, baseType: !153, size: 8, offset: 8376)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !233, file: !71, line: 234, baseType: !261, size: 32, offset: 8384)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !233, file: !71, line: 235, baseType: !261, size: 32, offset: 8416)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !233, file: !71, line: 237, baseType: !218, size: 128, offset: 8448)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !233, file: !71, line: 238, baseType: !218, size: 128, offset: 8576)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !233, file: !71, line: 239, baseType: !218, size: 128, offset: 8704)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !233, file: !71, line: 240, baseType: !218, size: 128, offset: 8832)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !233, file: !71, line: 242, baseType: !261, size: 32, offset: 8960)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !233, file: !71, line: 244, baseType: !195, size: 16, offset: 8992)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !233, file: !71, line: 245, baseType: !414, size: 16, offset: 9008)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !233, file: !71, line: 246, baseType: !369, size: 128, offset: 9024)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !233, file: !71, line: 248, baseType: !147, size: 32, offset: 9152)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !233, file: !71, line: 249, baseType: !147, size: 32, offset: 9184)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !233, file: !71, line: 251, baseType: !435, size: 64, offset: 9216)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!436 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !71, line: 251, flags: DIFlagFwdDecl)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !233, file: !71, line: 253, baseType: !153, size: 8, offset: 9280)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !233, file: !71, line: 254, baseType: !153, size: 8, offset: 9288)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !233, file: !71, line: 255, baseType: !195, size: 16, offset: 9296)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !233, file: !71, line: 256, baseType: !296, size: 96, offset: 9312)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !233, file: !71, line: 258, baseType: !218, size: 128, offset: 9408)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !233, file: !71, line: 259, baseType: !218, size: 128, offset: 9536)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !233, file: !71, line: 260, baseType: !218, size: 128, offset: 9664)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !233, file: !71, line: 261, baseType: !218, size: 128, offset: 9792)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !233, file: !71, line: 263, baseType: !446, size: 64, offset: 9920)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!447 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !71, line: 52, flags: DIFlagFwdDecl)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !233, file: !71, line: 264, baseType: !449, size: 64, offset: 9984)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!450 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !71, line: 53, flags: DIFlagFwdDecl)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !233, file: !71, line: 265, baseType: !452, size: 64, offset: 10048)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64)
!453 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !454, line: 43, flags: DIFlagFwdDecl)
!454 = !DIFile(filename: "blender/source/blender/makesdna/DNA_freestyle_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!455 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !233, file: !71, line: 267, baseType: !153, size: 8, offset: 10112)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !233, file: !71, line: 268, baseType: !153, size: 8, offset: 10120)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !233, file: !71, line: 269, baseType: !195, size: 16, offset: 10128)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !233, file: !71, line: 270, baseType: !261, size: 32, offset: 10144)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !233, file: !71, line: 272, baseType: !460, size: 64, offset: 10176)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!461 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !71, line: 54, flags: DIFlagFwdDecl)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !233, file: !71, line: 275, baseType: !463, size: 64, offset: 10240)
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64)
!464 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !71, line: 275, flags: DIFlagFwdDecl)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !233, file: !71, line: 277, baseType: !466, size: 64, offset: 10304)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!467 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !28, line: 178, size: 13504, elements: !468)
!468 = !{!469, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !520, !523, !525, !526, !528, !529, !530, !531, !537, !542, !543, !547, !548, !549, !550, !551, !564, !576, !590, !594, !598, !602, !611, !623, !627, !631, !635, !639, !643, !644, !645, !646, !647, !648, !652, !653, !654, !655, !659, !660, !661, !662, !663, !668, !669, !670, !671, !672, !676, !677, !678, !679, !680, !687, !698, !703, !709, !719, !725, !736, !743, !750, !754, !759, !763, !768, !769, !770, !777, !783, !784, !785, !790, !791, !800, !909, !913, !921, !925, !929, !933, !941, !951}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "vertData", scope: !467, file: !28, line: 180, baseType: !470, size: 1600)
!470 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomData", file: !91, line: 73, baseType: !471)
!471 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomData", file: !91, line: 64, size: 1600, elements: !472)
!472 = !{!473, !488, !492, !493, !494, !495, !498}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !471, file: !91, line: 65, baseType: !474, size: 64)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64)
!475 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataLayer", file: !91, line: 53, baseType: !476)
!476 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataLayer", file: !91, line: 42, size: 832, elements: !477)
!477 = !{!478, !479, !480, !481, !482, !483, !484, !485, !486, !487}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !476, file: !91, line: 43, baseType: !147, size: 32)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !476, file: !91, line: 44, baseType: !147, size: 32, offset: 32)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !476, file: !91, line: 45, baseType: !147, size: 32, offset: 64)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !476, file: !91, line: 46, baseType: !147, size: 32, offset: 96)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "active_rnd", scope: !476, file: !91, line: 47, baseType: !147, size: 32, offset: 128)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "active_clone", scope: !476, file: !91, line: 48, baseType: !147, size: 32, offset: 160)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "active_mask", scope: !476, file: !91, line: 49, baseType: !147, size: 32, offset: 192)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !476, file: !91, line: 50, baseType: !147, size: 32, offset: 224)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !476, file: !91, line: 51, baseType: !152, size: 512, offset: 256)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !476, file: !91, line: 52, baseType: !167, size: 64, offset: 768)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "typemap", scope: !471, file: !91, line: 66, baseType: !489, size: 1312, offset: 64)
!489 = !DICompositeType(tag: DW_TAG_array_type, baseType: !147, size: 1312, elements: !490)
!490 = !{!491}
!491 = !DISubrange(count: 41)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "totlayer", scope: !471, file: !91, line: 69, baseType: !147, size: 32, offset: 1376)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "maxlayer", scope: !471, file: !91, line: 69, baseType: !147, size: 32, offset: 1408)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "totsize", scope: !471, file: !91, line: 70, baseType: !147, size: 32, offset: 1440)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !471, file: !91, line: 71, baseType: !496, size: 64, offset: 1472)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64)
!497 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool", file: !91, line: 71, flags: DIFlagFwdDecl)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !471, file: !91, line: 72, baseType: !499, size: 64, offset: 1536)
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64)
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataExternal", file: !91, line: 59, baseType: !501)
!501 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataExternal", file: !91, line: 57, size: 8192, elements: !502)
!502 = !{!503}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !501, file: !91, line: 58, baseType: !182, size: 8192)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "edgeData", scope: !467, file: !28, line: 180, baseType: !470, size: 1600, offset: 1600)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "faceData", scope: !467, file: !28, line: 180, baseType: !470, size: 1600, offset: 3200)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "loopData", scope: !467, file: !28, line: 180, baseType: !470, size: 1600, offset: 4800)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "polyData", scope: !467, file: !28, line: 180, baseType: !470, size: 1600, offset: 6400)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "numVertData", scope: !467, file: !28, line: 181, baseType: !147, size: 32, offset: 8000)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "numEdgeData", scope: !467, file: !28, line: 181, baseType: !147, size: 32, offset: 8032)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "numTessFaceData", scope: !467, file: !28, line: 181, baseType: !147, size: 32, offset: 8064)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "numLoopData", scope: !467, file: !28, line: 181, baseType: !147, size: 32, offset: 8096)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "numPolyData", scope: !467, file: !28, line: 181, baseType: !147, size: 32, offset: 8128)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "needsFree", scope: !467, file: !28, line: 182, baseType: !147, size: 32, offset: 8160)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "deformedOnly", scope: !467, file: !28, line: 183, baseType: !147, size: 32, offset: 8192)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "bvhCache", scope: !467, file: !28, line: 184, baseType: !516, size: 64, offset: 8256)
!516 = !DIDerivedType(tag: DW_TAG_typedef, name: "BVHCache", file: !517, line: 124, baseType: !518)
!517 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_bvhutils.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64)
!519 = !DICompositeType(tag: DW_TAG_structure_type, name: "LinkNode", file: !517, line: 124, flags: DIFlagFwdDecl)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "drawObject", scope: !467, file: !28, line: 185, baseType: !521, size: 64, offset: 8320)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64)
!522 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUDrawObject", file: !28, line: 97, flags: DIFlagFwdDecl)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !467, file: !28, line: 186, baseType: !524, size: 32, offset: 8384)
!524 = !DIDerivedType(tag: DW_TAG_typedef, name: "DerivedMeshType", file: !28, line: 132, baseType: !27)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "auto_bump_scale", scope: !467, file: !28, line: 187, baseType: !261, size: 32, offset: 8416)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "dirty", scope: !467, file: !28, line: 188, baseType: !527, size: 32, offset: 8448)
!527 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMDirtyFlag", file: !28, line: 175, baseType: !33)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "totmat", scope: !467, file: !28, line: 189, baseType: !147, size: 32, offset: 8480)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !467, file: !28, line: 190, baseType: !353, size: 64, offset: 8512)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "cd_flag", scope: !467, file: !28, line: 193, baseType: !153, size: 8, offset: 8576)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "calcNormals", scope: !467, file: !28, line: 196, baseType: !532, size: 64, offset: 8640)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64)
!533 = !DISubroutineType(types: !534)
!534 = !{null, !535}
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64)
!536 = !DIDerivedType(tag: DW_TAG_typedef, name: "DerivedMesh", file: !28, line: 177, baseType: !467)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "calcLoopNormals", scope: !467, file: !28, line: 199, baseType: !538, size: 64, offset: 8704)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64)
!539 = !DISubroutineType(types: !540)
!540 = !{null, !535, !541}
!541 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !261)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "recalcTessellation", scope: !467, file: !28, line: 202, baseType: !532, size: 64, offset: 8768)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "getNumVerts", scope: !467, file: !28, line: 207, baseType: !544, size: 64, offset: 8832)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64)
!545 = !DISubroutineType(types: !546)
!546 = !{!147, !535}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "getNumEdges", scope: !467, file: !28, line: 208, baseType: !544, size: 64, offset: 8896)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "getNumTessFaces", scope: !467, file: !28, line: 209, baseType: !544, size: 64, offset: 8960)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "getNumLoops", scope: !467, file: !28, line: 210, baseType: !544, size: 64, offset: 9024)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "getNumPolys", scope: !467, file: !28, line: 211, baseType: !544, size: 64, offset: 9088)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "getVert", scope: !467, file: !28, line: 218, baseType: !552, size: 64, offset: 9152)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64)
!553 = !DISubroutineType(types: !554)
!554 = !{null, !535, !147, !555}
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64)
!556 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MVert", file: !557, line: 65, size: 160, elements: !558)
!557 = !DIFile(filename: "blender/source/blender/makesdna/DNA_meshdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!558 = !{!559, !560, !562, !563}
!559 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !556, file: !557, line: 66, baseType: !296, size: 96)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !556, file: !557, line: 67, baseType: !561, size: 48, offset: 96)
!561 = !DICompositeType(tag: DW_TAG_array_type, baseType: !195, size: 48, elements: !297)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !556, file: !557, line: 68, baseType: !153, size: 8, offset: 144)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "bweight", scope: !556, file: !557, line: 68, baseType: !153, size: 8, offset: 152)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "getEdge", scope: !467, file: !28, line: 219, baseType: !565, size: 64, offset: 9216)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64)
!566 = !DISubroutineType(types: !567)
!567 = !{null, !535, !147, !568}
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64)
!569 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MEdge", file: !557, line: 48, size: 96, elements: !570)
!570 = !{!571, !572, !573, !574, !575}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !569, file: !557, line: 49, baseType: !7, size: 32)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !569, file: !557, line: 49, baseType: !7, size: 32, offset: 32)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "crease", scope: !569, file: !557, line: 50, baseType: !153, size: 8, offset: 64)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "bweight", scope: !569, file: !557, line: 50, baseType: !153, size: 8, offset: 72)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !569, file: !557, line: 51, baseType: !195, size: 16, offset: 80)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFace", scope: !467, file: !28, line: 220, baseType: !577, size: 64, offset: 9280)
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 64)
!578 = !DISubroutineType(types: !579)
!579 = !{null, !535, !147, !580}
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 64)
!581 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MFace", file: !557, line: 42, size: 160, elements: !582)
!582 = !{!583, !584, !585, !586, !587, !588, !589}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !581, file: !557, line: 43, baseType: !7, size: 32)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !581, file: !557, line: 43, baseType: !7, size: 32, offset: 32)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !581, file: !557, line: 43, baseType: !7, size: 32, offset: 64)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !581, file: !557, line: 43, baseType: !7, size: 32, offset: 96)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !581, file: !557, line: 44, baseType: !195, size: 16, offset: 128)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "edcode", scope: !581, file: !557, line: 45, baseType: !153, size: 8, offset: 144)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !581, file: !557, line: 45, baseType: !153, size: 8, offset: 152)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "getVertArray", scope: !467, file: !28, line: 227, baseType: !591, size: 64, offset: 9344)
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64)
!592 = !DISubroutineType(types: !593)
!593 = !{!555, !535}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeArray", scope: !467, file: !28, line: 228, baseType: !595, size: 64, offset: 9408)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64)
!596 = !DISubroutineType(types: !597)
!597 = !{!568, !535}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceArray", scope: !467, file: !28, line: 229, baseType: !599, size: 64, offset: 9472)
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64)
!600 = !DISubroutineType(types: !601)
!601 = !{!580, !535}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopArray", scope: !467, file: !28, line: 230, baseType: !603, size: 64, offset: 9536)
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 64)
!604 = !DISubroutineType(types: !605)
!605 = !{!606, !535}
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!607 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MLoop", file: !557, line: 88, size: 64, elements: !608)
!608 = !{!609, !610}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !607, file: !557, line: 89, baseType: !7, size: 32)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !607, file: !557, line: 90, baseType: !7, size: 32, offset: 32)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyArray", scope: !467, file: !28, line: 231, baseType: !612, size: 64, offset: 9600)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 64)
!613 = !DISubroutineType(types: !614)
!614 = !{!615, !535}
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 64)
!616 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MPoly", file: !557, line: 79, size: 96, elements: !617)
!617 = !{!618, !619, !620, !621, !622}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "loopstart", scope: !616, file: !557, line: 81, baseType: !147, size: 32)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !616, file: !557, line: 82, baseType: !147, size: 32, offset: 32)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !616, file: !557, line: 83, baseType: !195, size: 16, offset: 64)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !616, file: !557, line: 84, baseType: !153, size: 8, offset: 80)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !616, file: !557, line: 84, baseType: !153, size: 8, offset: 88)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "copyVertArray", scope: !467, file: !28, line: 236, baseType: !624, size: 64, offset: 9664)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 64)
!625 = !DISubroutineType(types: !626)
!626 = !{null, !535, !555}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "copyEdgeArray", scope: !467, file: !28, line: 237, baseType: !628, size: 64, offset: 9728)
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 64)
!629 = !DISubroutineType(types: !630)
!630 = !{null, !535, !568}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "copyTessFaceArray", scope: !467, file: !28, line: 238, baseType: !632, size: 64, offset: 9792)
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !633, size: 64)
!633 = !DISubroutineType(types: !634)
!634 = !{null, !535, !580}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "copyLoopArray", scope: !467, file: !28, line: 239, baseType: !636, size: 64, offset: 9856)
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 64)
!637 = !DISubroutineType(types: !638)
!638 = !{null, !535, !606}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "copyPolyArray", scope: !467, file: !28, line: 240, baseType: !640, size: 64, offset: 9920)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64)
!641 = !DISubroutineType(types: !642)
!642 = !{null, !535, !615}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "dupVertArray", scope: !467, file: !28, line: 245, baseType: !591, size: 64, offset: 9984)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "dupEdgeArray", scope: !467, file: !28, line: 246, baseType: !595, size: 64, offset: 10048)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "dupTessFaceArray", scope: !467, file: !28, line: 247, baseType: !599, size: 64, offset: 10112)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "dupLoopArray", scope: !467, file: !28, line: 248, baseType: !603, size: 64, offset: 10176)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "dupPolyArray", scope: !467, file: !28, line: 249, baseType: !612, size: 64, offset: 10240)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "getVertData", scope: !467, file: !28, line: 255, baseType: !649, size: 64, offset: 10304)
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 64)
!650 = !DISubroutineType(types: !651)
!651 = !{!167, !535, !147, !147}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeData", scope: !467, file: !28, line: 256, baseType: !649, size: 64, offset: 10368)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceData", scope: !467, file: !28, line: 257, baseType: !649, size: 64, offset: 10432)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyData", scope: !467, file: !28, line: 258, baseType: !649, size: 64, offset: 10496)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "getVertDataArray", scope: !467, file: !28, line: 264, baseType: !656, size: 64, offset: 10560)
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 64)
!657 = !DISubroutineType(types: !658)
!658 = !{!167, !535, !147}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeDataArray", scope: !467, file: !28, line: 265, baseType: !656, size: 64, offset: 10624)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceDataArray", scope: !467, file: !28, line: 266, baseType: !656, size: 64, offset: 10688)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopDataArray", scope: !467, file: !28, line: 267, baseType: !656, size: 64, offset: 10752)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyDataArray", scope: !467, file: !28, line: 268, baseType: !656, size: 64, offset: 10816)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "getVertDataLayout", scope: !467, file: !28, line: 272, baseType: !664, size: 64, offset: 10880)
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !665, size: 64)
!665 = !DISubroutineType(types: !666)
!666 = !{!667, !535}
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeDataLayout", scope: !467, file: !28, line: 273, baseType: !664, size: 64, offset: 10944)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceDataLayout", scope: !467, file: !28, line: 274, baseType: !664, size: 64, offset: 11008)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopDataLayout", scope: !467, file: !28, line: 275, baseType: !664, size: 64, offset: 11072)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyDataLayout", scope: !467, file: !28, line: 276, baseType: !664, size: 64, offset: 11136)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromVertCData", scope: !467, file: !28, line: 279, baseType: !673, size: 64, offset: 11200)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64)
!674 = !DISubroutineType(types: !675)
!675 = !{null, !535, !147, !667, !147}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromEdgeCData", scope: !467, file: !28, line: 280, baseType: !673, size: 64, offset: 11264)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromFaceCData", scope: !467, file: !28, line: 281, baseType: !673, size: 64, offset: 11328)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "getNumGrids", scope: !467, file: !28, line: 284, baseType: !544, size: 64, offset: 11392)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "getGridSize", scope: !467, file: !28, line: 285, baseType: !544, size: 64, offset: 11456)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "getGridData", scope: !467, file: !28, line: 286, baseType: !681, size: 64, offset: 11520)
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64)
!682 = !DISubroutineType(types: !683)
!683 = !{!684, !535}
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 64)
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !686, size: 64)
!686 = !DICompositeType(tag: DW_TAG_structure_type, name: "CCGElem", file: !28, line: 82, flags: DIFlagFwdDecl)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "getGridAdjacency", scope: !467, file: !28, line: 287, baseType: !688, size: 64, offset: 11584)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 64)
!689 = !DISubroutineType(types: !690)
!690 = !{!691, !535}
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 64)
!692 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMGridAdjacency", file: !28, line: 120, baseType: !693)
!693 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DMGridAdjacency", file: !28, line: 117, size: 256, elements: !694)
!694 = !{!695, !697}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !693, file: !28, line: 118, baseType: !696, size: 128)
!696 = !DICompositeType(tag: DW_TAG_array_type, baseType: !147, size: 128, elements: !370)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "rotation", scope: !693, file: !28, line: 119, baseType: !696, size: 128, offset: 128)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "getGridOffset", scope: !467, file: !28, line: 288, baseType: !699, size: 64, offset: 11648)
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !700, size: 64)
!700 = !DISubroutineType(types: !701)
!701 = !{!702, !535}
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "getGridKey", scope: !467, file: !28, line: 289, baseType: !704, size: 64, offset: 11712)
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !705, size: 64)
!705 = !DISubroutineType(types: !706)
!706 = !{null, !535, !707}
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 64)
!708 = !DICompositeType(tag: DW_TAG_structure_type, name: "CCGKey", file: !28, line: 83, flags: DIFlagFwdDecl)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "getGridFlagMats", scope: !467, file: !28, line: 290, baseType: !710, size: 64, offset: 11776)
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 64)
!711 = !DISubroutineType(types: !712)
!712 = !{!713, !535}
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !714, size: 64)
!714 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMFlagMat", file: !28, line: 126, baseType: !715)
!715 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DMFlagMat", file: !28, line: 123, size: 32, elements: !716)
!716 = !{!717, !718}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !715, file: !28, line: 124, baseType: !195, size: 16)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !715, file: !28, line: 125, baseType: !153, size: 8, offset: 16)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "getGridHidden", scope: !467, file: !28, line: 291, baseType: !720, size: 64, offset: 11840)
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !721, size: 64)
!721 = !DISubroutineType(types: !722)
!722 = !{!723, !535}
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 64)
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedVert", scope: !467, file: !28, line: 299, baseType: !726, size: 64, offset: 11904)
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 64)
!727 = !DISubroutineType(types: !728)
!728 = !{null, !535, !729, !167, !735}
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64)
!730 = !DISubroutineType(types: !731)
!731 = !{null, !167, !147, !732, !732, !733}
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64)
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !734, size: 64)
!734 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !195)
!735 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMForeachFlag", file: !28, line: 162, baseType: !38)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedEdge", scope: !467, file: !28, line: 309, baseType: !737, size: 64, offset: 11968)
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !738, size: 64)
!738 = !DISubroutineType(types: !739)
!739 = !{null, !535, !740, !167}
!740 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !741, size: 64)
!741 = !DISubroutineType(types: !742)
!742 = !{null, !167, !147, !732, !732}
!743 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedLoop", scope: !467, file: !28, line: 317, baseType: !744, size: 64, offset: 12032)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 64)
!745 = !DISubroutineType(types: !746)
!746 = !{null, !535, !747, !167, !735}
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64)
!748 = !DISubroutineType(types: !749)
!749 = !{null, !167, !147, !147, !732, !732}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedFaceCenter", scope: !467, file: !28, line: 327, baseType: !751, size: 64, offset: 12096)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64)
!752 = !DISubroutineType(types: !753)
!753 = !{null, !535, !740, !167, !735}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "getMinMax", scope: !467, file: !28, line: 337, baseType: !755, size: 64, offset: 12160)
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 64)
!756 = !DISubroutineType(types: !757)
!757 = !{null, !535, !758, !758}
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "getVertCo", scope: !467, file: !28, line: 344, baseType: !760, size: 64, offset: 12224)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64)
!761 = !DISubroutineType(types: !762)
!762 = !{null, !535, !147, !758}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "getVertCos", scope: !467, file: !28, line: 347, baseType: !764, size: 64, offset: 12288)
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 64)
!765 = !DISubroutineType(types: !766)
!766 = !{null, !535, !767}
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "getVertNo", scope: !467, file: !28, line: 350, baseType: !760, size: 64, offset: 12352)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyNo", scope: !467, file: !28, line: 351, baseType: !760, size: 64, offset: 12416)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyMap", scope: !467, file: !28, line: 355, baseType: !771, size: 64, offset: 12480)
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 64)
!772 = !DISubroutineType(types: !773)
!773 = !{!774, !232, !535}
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 64)
!775 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !776)
!776 = !DICompositeType(tag: DW_TAG_structure_type, name: "MeshElemMap", file: !28, line: 355, flags: DIFlagFwdDecl)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "getPBVH", scope: !467, file: !28, line: 359, baseType: !778, size: 64, offset: 12544)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 64)
!779 = !DISubroutineType(types: !780)
!780 = !{!781, !232, !535}
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !782, size: 64)
!782 = !DICompositeType(tag: DW_TAG_structure_type, name: "PBVH", file: !28, line: 100, flags: DIFlagFwdDecl)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "drawVerts", scope: !467, file: !28, line: 364, baseType: !532, size: 64, offset: 12608)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "drawUVEdges", scope: !467, file: !28, line: 367, baseType: !532, size: 64, offset: 12672)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "drawEdges", scope: !467, file: !28, line: 373, baseType: !786, size: 64, offset: 12736)
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 64)
!787 = !DISubroutineType(types: !788)
!788 = !{null, !535, !789, !789}
!789 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "drawLooseEdges", scope: !467, file: !28, line: 376, baseType: !532, size: 64, offset: 12800)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "drawFacesSolid", scope: !467, file: !28, line: 385, baseType: !792, size: 64, offset: 12864)
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !793, size: 64)
!793 = !DISubroutineType(types: !794)
!794 = !{null, !535, !795, !789, !796}
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!796 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSetMaterial", file: !28, line: 146, baseType: !797)
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !798, size: 64)
!798 = !DISubroutineType(types: !799)
!799 = !{!147, !147, !167}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "drawFacesTex", scope: !467, file: !28, line: 391, baseType: !801, size: 64, offset: 12928)
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 64)
!802 = !DISubroutineType(types: !803)
!803 = !{null, !535, !804, !904, !167, !908}
!804 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSetDrawOptionsTex", file: !28, line: 150, baseType: !805)
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !806, size: 64)
!806 = !DISubroutineType(types: !807)
!807 = !{!808, !809, !903, !147}
!808 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMDrawOption", file: !28, line: 143, baseType: !42)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64)
!810 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTFace", file: !557, line: 160, size: 384, elements: !811)
!811 = !{!812, !816, !898, !899, !900, !901, !902}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !810, file: !557, line: 161, baseType: !813, size: 256)
!813 = !DICompositeType(tag: DW_TAG_array_type, baseType: !261, size: 256, elements: !814)
!814 = !{!371, !815}
!815 = !DISubrange(count: 2)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "tpage", scope: !810, file: !557, line: 162, baseType: !817, size: 64, offset: 256)
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !818, size: 64)
!818 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !819, line: 77, size: 15424, elements: !820)
!819 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!820 = !{!821, !822, !823, !826, !829, !832, !835, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !887, !888, !892}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !818, file: !819, line: 78, baseType: !162, size: 960)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !818, file: !819, line: 80, baseType: !182, size: 8192, offset: 960)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !818, file: !819, line: 82, baseType: !824, size: 64, offset: 9152)
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !825, size: 64)
!825 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !819, line: 43, flags: DIFlagFwdDecl)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !818, file: !819, line: 83, baseType: !827, size: 64, offset: 9216)
!827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !828, size: 64)
!828 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !163, line: 46, flags: DIFlagFwdDecl)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !818, file: !819, line: 86, baseType: !830, size: 64, offset: 9280)
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !831, size: 64)
!831 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !819, line: 41, flags: DIFlagFwdDecl)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !818, file: !819, line: 87, baseType: !833, size: 64, offset: 9344)
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !834, size: 64)
!834 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !819, line: 44, flags: DIFlagFwdDecl)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !818, file: !819, line: 89, baseType: !836, size: 512, offset: 9408)
!836 = !DICompositeType(tag: DW_TAG_array_type, baseType: !833, size: 512, elements: !837)
!837 = !{!263}
!838 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !818, file: !819, line: 90, baseType: !195, size: 16, offset: 9920)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !818, file: !819, line: 90, baseType: !195, size: 16, offset: 9936)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !818, file: !819, line: 92, baseType: !195, size: 16, offset: 9952)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !818, file: !819, line: 92, baseType: !195, size: 16, offset: 9968)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !818, file: !819, line: 93, baseType: !195, size: 16, offset: 9984)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !818, file: !819, line: 93, baseType: !195, size: 16, offset: 10000)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !818, file: !819, line: 94, baseType: !147, size: 32, offset: 10016)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !818, file: !819, line: 97, baseType: !195, size: 16, offset: 10048)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !818, file: !819, line: 97, baseType: !195, size: 16, offset: 10064)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !818, file: !819, line: 98, baseType: !195, size: 16, offset: 10080)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !818, file: !819, line: 98, baseType: !195, size: 16, offset: 10096)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !818, file: !819, line: 99, baseType: !195, size: 16, offset: 10112)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !818, file: !819, line: 99, baseType: !195, size: 16, offset: 10128)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !818, file: !819, line: 100, baseType: !7, size: 32, offset: 10144)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !818, file: !819, line: 101, baseType: !724, size: 64, offset: 10176)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !818, file: !819, line: 103, baseType: !188, size: 64, offset: 10240)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !818, file: !819, line: 104, baseType: !855, size: 64, offset: 10304)
!855 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !856, size: 64)
!856 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !163, line: 159, size: 448, elements: !857)
!857 = !{!858, !861, !862, !864, !865, !867}
!858 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !856, file: !163, line: 161, baseType: !859, size: 64)
!859 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !860)
!860 = !{!815}
!861 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !856, file: !163, line: 162, baseType: !859, size: 64, offset: 64)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !856, file: !163, line: 163, baseType: !863, size: 32, offset: 128)
!863 = !DICompositeType(tag: DW_TAG_array_type, baseType: !195, size: 32, elements: !860)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !856, file: !163, line: 164, baseType: !863, size: 32, offset: 160)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !856, file: !163, line: 165, baseType: !866, size: 128, offset: 192)
!866 = !DICompositeType(tag: DW_TAG_array_type, baseType: !724, size: 128, elements: !860)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !856, file: !163, line: 166, baseType: !868, size: 128, offset: 320)
!868 = !DICompositeType(tag: DW_TAG_array_type, baseType: !827, size: 128, elements: !860)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !818, file: !819, line: 107, baseType: !261, size: 32, offset: 10368)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !818, file: !819, line: 108, baseType: !147, size: 32, offset: 10400)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !818, file: !819, line: 109, baseType: !195, size: 16, offset: 10432)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !818, file: !819, line: 110, baseType: !195, size: 16, offset: 10448)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !818, file: !819, line: 113, baseType: !147, size: 32, offset: 10464)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !818, file: !819, line: 113, baseType: !147, size: 32, offset: 10496)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !818, file: !819, line: 114, baseType: !153, size: 8, offset: 10528)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !818, file: !819, line: 114, baseType: !153, size: 8, offset: 10536)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !818, file: !819, line: 115, baseType: !195, size: 16, offset: 10544)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !818, file: !819, line: 116, baseType: !369, size: 128, offset: 10560)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !818, file: !819, line: 119, baseType: !261, size: 32, offset: 10688)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !818, file: !819, line: 119, baseType: !261, size: 32, offset: 10720)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !818, file: !819, line: 122, baseType: !882, size: 512, offset: 10752)
!882 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !883, line: 182, baseType: !884)
!883 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!884 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !883, line: 180, size: 512, elements: !885)
!885 = !{!886}
!886 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !884, file: !883, line: 181, baseType: !152, size: 512)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !818, file: !819, line: 123, baseType: !153, size: 8, offset: 11264)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !818, file: !819, line: 125, baseType: !889, size: 56, offset: 11272)
!889 = !DICompositeType(tag: DW_TAG_array_type, baseType: !153, size: 56, elements: !890)
!890 = !{!891}
!891 = !DISubrange(count: 7)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !818, file: !819, line: 126, baseType: !893, size: 4096, offset: 11328)
!893 = !DICompositeType(tag: DW_TAG_array_type, baseType: !894, size: 4096, elements: !837)
!894 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !819, line: 69, baseType: !895)
!895 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !819, line: 67, size: 512, elements: !896)
!896 = !{!897}
!897 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !895, file: !819, line: 68, baseType: !152, size: 512)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !810, file: !557, line: 163, baseType: !153, size: 8, offset: 320)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "transp", scope: !810, file: !557, line: 163, baseType: !153, size: 8, offset: 328)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !810, file: !557, line: 164, baseType: !195, size: 16, offset: 336)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "tile", scope: !810, file: !557, line: 164, baseType: !195, size: 16, offset: 352)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "unwrap", scope: !810, file: !557, line: 164, baseType: !195, size: 16, offset: 368)
!903 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !789)
!904 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMCompareDrawOptions", file: !28, line: 147, baseType: !905)
!905 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !906, size: 64)
!906 = !DISubroutineType(types: !907)
!907 = !{!147, !167, !147, !147}
!908 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMDrawFlag", file: !28, line: 157, baseType: !48)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "drawFacesGLSL", scope: !467, file: !28, line: 400, baseType: !910, size: 64, offset: 12992)
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !911, size: 64)
!911 = !DISubroutineType(types: !912)
!912 = !{null, !535, !796}
!913 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedFaces", scope: !467, file: !28, line: 415, baseType: !914, size: 64, offset: 13056)
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !915, size: 64)
!915 = !DISubroutineType(types: !916)
!916 = !{null, !535, !917, !796, !904, !167, !908}
!917 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSetDrawOptions", file: !28, line: 149, baseType: !918)
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !919, size: 64)
!919 = !DISubroutineType(types: !920)
!920 = !{!808, !167, !147}
!921 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedFacesTex", scope: !467, file: !28, line: 425, baseType: !922, size: 64, offset: 13120)
!922 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !923, size: 64)
!923 = !DISubroutineType(types: !924)
!924 = !{null, !535, !917, !904, !167, !908}
!925 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedFacesGLSL", scope: !467, file: !28, line: 435, baseType: !926, size: 64, offset: 13184)
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 64)
!927 = !DISubroutineType(types: !928)
!928 = !{null, !535, !796, !917, !167}
!929 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedEdges", scope: !467, file: !28, line: 444, baseType: !930, size: 64, offset: 13248)
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 64)
!931 = !DISubroutineType(types: !932)
!932 = !{null, !535, !917, !167}
!933 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedEdgesInterp", scope: !467, file: !28, line: 455, baseType: !934, size: 64, offset: 13312)
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 64)
!935 = !DISubroutineType(types: !936)
!936 = !{null, !535, !917, !937, !167}
!937 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSetDrawInterpOptions", file: !28, line: 148, baseType: !938)
!938 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 64)
!939 = !DISubroutineType(types: !940)
!940 = !{null, !167, !147, !261}
!941 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedFacesMat", scope: !467, file: !28, line: 464, baseType: !942, size: 64, offset: 13376)
!942 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 64)
!943 = !DISubroutineType(types: !944)
!944 = !{null, !535, !945, !948, !167}
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64)
!946 = !DISubroutineType(types: !947)
!947 = !{null, !167, !147, !167}
!948 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 64)
!949 = !DISubroutineType(types: !950)
!950 = !{!789, !167, !147}
!951 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !467, file: !28, line: 470, baseType: !532, size: 64, offset: 13440)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !233, file: !71, line: 277, baseType: !466, size: 64, offset: 10368)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !233, file: !71, line: 278, baseType: !954, size: 64, offset: 10432)
!954 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !955, line: 27, baseType: !956)
!955 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!956 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !957, line: 45, baseType: !958)
!957 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!958 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_mask", scope: !233, file: !71, line: 279, baseType: !954, size: 64, offset: 10496)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !233, file: !71, line: 280, baseType: !7, size: 32, offset: 10560)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !233, file: !71, line: 281, baseType: !7, size: 32, offset: 10592)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "gpulamp", scope: !233, file: !71, line: 283, baseType: !218, size: 128, offset: 10624)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "pc_ids", scope: !233, file: !71, line: 284, baseType: !218, size: 128, offset: 10752)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "duplilist", scope: !233, file: !71, line: 285, baseType: !965, size: 64, offset: 10880)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_object", scope: !233, file: !71, line: 287, baseType: !967, size: 64, offset: 10944)
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 64)
!968 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyOb", file: !71, line: 59, flags: DIFlagFwdDecl)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_constraint", scope: !233, file: !71, line: 288, baseType: !970, size: 64, offset: 11008)
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64)
!971 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyCon", file: !71, line: 288, flags: DIFlagFwdDecl)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "ima_ofs", scope: !233, file: !71, line: 290, baseType: !973, size: 64, offset: 11072)
!973 = !DICompositeType(tag: DW_TAG_array_type, baseType: !261, size: 64, elements: !860)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !233, file: !71, line: 291, baseType: !975, size: 64, offset: 11136)
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 64)
!976 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageUser", file: !819, line: 65, baseType: !977)
!977 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !819, line: 50, size: 320, elements: !978)
!978 = !{!979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992}
!979 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !977, file: !819, line: 51, baseType: !157, size: 64)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !977, file: !819, line: 53, baseType: !147, size: 32, offset: 64)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !977, file: !819, line: 54, baseType: !147, size: 32, offset: 96)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !977, file: !819, line: 55, baseType: !147, size: 32, offset: 128)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !977, file: !819, line: 55, baseType: !147, size: 32, offset: 160)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !977, file: !819, line: 56, baseType: !153, size: 8, offset: 192)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "cycl", scope: !977, file: !819, line: 56, baseType: !153, size: 8, offset: 200)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !977, file: !819, line: 57, baseType: !153, size: 8, offset: 208)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !977, file: !819, line: 57, baseType: !153, size: 8, offset: 216)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "multi_index", scope: !977, file: !819, line: 59, baseType: !195, size: 16, offset: 224)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !977, file: !819, line: 59, baseType: !195, size: 16, offset: 240)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !977, file: !819, line: 59, baseType: !195, size: 16, offset: 256)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !977, file: !819, line: 61, baseType: !195, size: 16, offset: 272)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !977, file: !819, line: 63, baseType: !147, size: 32, offset: 288)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "lodlevels", scope: !233, file: !71, line: 293, baseType: !218, size: 128, offset: 11200)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "currentlod", scope: !233, file: !71, line: 294, baseType: !995, size: 64, offset: 11328)
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !996, size: 64)
!996 = !DIDerivedType(tag: DW_TAG_typedef, name: "LodLevel", file: !71, line: 113, baseType: !997)
!997 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LodLevel", file: !71, line: 108, size: 256, elements: !998)
!998 = !{!999, !1001, !1002, !1003, !1004}
!999 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !997, file: !71, line: 109, baseType: !1000, size: 64)
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !997, size: 64)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !997, file: !71, line: 109, baseType: !1000, size: 64, offset: 64)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !997, file: !71, line: 110, baseType: !232, size: 64, offset: 128)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !997, file: !71, line: 111, baseType: !147, size: 32, offset: 192)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "distance", scope: !997, file: !71, line: 112, baseType: !261, size: 32, offset: 224)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !158, file: !159, line: 1221, baseType: !1006, size: 64, offset: 1088)
!1006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1007, size: 64)
!1007 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !159, line: 52, flags: DIFlagFwdDecl)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !158, file: !159, line: 1223, baseType: !157, size: 64, offset: 1152)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !158, file: !159, line: 1225, baseType: !218, size: 128, offset: 1216)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !158, file: !159, line: 1226, baseType: !1011, size: 64, offset: 1344)
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64)
!1012 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !159, line: 69, size: 320, elements: !1013)
!1013 = !{!1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021}
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1012, file: !159, line: 70, baseType: !1011, size: 64)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1012, file: !159, line: 70, baseType: !1011, size: 64, offset: 64)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !1012, file: !159, line: 71, baseType: !7, size: 32, offset: 128)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !1012, file: !159, line: 71, baseType: !7, size: 32, offset: 160)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1012, file: !159, line: 72, baseType: !147, size: 32, offset: 192)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !1012, file: !159, line: 73, baseType: !195, size: 16, offset: 224)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !1012, file: !159, line: 73, baseType: !195, size: 16, offset: 240)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !1012, file: !159, line: 74, baseType: !232, size: 64, offset: 256)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !158, file: !159, line: 1227, baseType: !232, size: 64, offset: 1408)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !158, file: !159, line: 1229, baseType: !296, size: 96, offset: 1472)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !158, file: !159, line: 1230, baseType: !296, size: 96, offset: 1568)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !158, file: !159, line: 1231, baseType: !296, size: 96, offset: 1664)
