; ModuleID = 'blender/source/blender/bmesh/tools/bmesh_decimate_collapse.c'
source_filename = "blender/source/blender/bmesh/tools/bmesh_decimate_collapse.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.BMesh = type { i32, i32, i32, i32, i32, i32, i32, i8, i8, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BMVert**, %struct.BMEdge**, %struct.BMFace**, i32, i32, i32, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BLI_mempool*, i32, %struct.BMOperator*, %struct.CustomData, %struct.CustomData, %struct.CustomData, %struct.CustomData, i16, i32, i32, i32, %struct.ListBase, %struct.BMFace*, %struct.ListBase, i8* }
%struct.BMVert = type { %struct.BMHeader, %struct.BMFlagLayer*, [3 x float], [3 x float], %struct.BMEdge* }
%struct.BMHeader = type { i8*, i32, i8, i8, i8 }
%struct.BMFlagLayer = type { i16 }
%struct.BMEdge = type { %struct.BMHeader, %struct.BMFlagLayer*, %struct.BMVert*, %struct.BMVert*, %struct.BMLoop*, %struct.BMDiskLink, %struct.BMDiskLink }
%struct.BMLoop = type { %struct.BMHeader, %struct.BMVert*, %struct.BMEdge*, %struct.BMFace*, %struct.BMLoop*, %struct.BMLoop*, %struct.BMLoop*, %struct.BMLoop* }
%struct.BMDiskLink = type { %struct.BMEdge*, %struct.BMEdge* }
%struct.BLI_mempool = type opaque

!25 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_PTR_OBJECT", value: 102, isUnsigned: true)
!26 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_PTR_MESH", value: 103, isUnsigned: true)
!27 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eBMOpSlotSubType_Map", file: !4, line: 123, baseType: !5, size: 32, elements: !28)
!28 = !{!29, !30, !31, !32, !33, !34}
!29 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_EMPTY", value: 64, isUnsigned: true)
!30 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_ELEM", value: 65, isUnsigned: true)
!31 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_FLT", value: 66, isUnsigned: true)
!32 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_INT", value: 67, isUnsigned: true)
!33 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_BOOL", value: 68, isUnsigned: true)
!34 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_INTERNAL", value: 69, isUnsigned: true)
!35 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 182, baseType: !5, size: 32, elements: !36)
!36 = !{!37, !38, !39, !40, !41}
!37 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_NOP", value: 0, isUnsigned: true)
!38 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_UNTAN_MULTIRES", value: 1, isUnsigned: true)
!39 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_NORMALS_CALC", value: 2, isUnsigned: true)
!40 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_SELECT_FLUSH", value: 4, isUnsigned: true)
!41 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_SELECT_VALIDATE", value: 8, isUnsigned: true)
!42 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "CD_UseFlag", file: !1, line: 57, baseType: !5, size: 32, elements: !43)
!43 = !{!44, !45, !46}
!44 = !DIEnumerator(name: "CD_DO_VERT", value: 1, isUnsigned: true)
!45 = !DIEnumerator(name: "CD_DO_EDGE", value: 2, isUnsigned: true)
!46 = !DIEnumerator(name: "CD_DO_LOOP", value: 4, isUnsigned: true)
!47 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !48, line: 249, baseType: !5, size: 32, elements: !49)
!48 = !DIFile(filename: "blender/source/blender/bmesh/bmesh_class.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!49 = !{!50, !51, !52, !53}
!50 = !DIEnumerator(name: "BM_VERT", value: 1, isUnsigned: true)
!51 = !DIEnumerator(name: "BM_EDGE", value: 2, isUnsigned: true)
!52 = !DIEnumerator(name: "BM_LOOP", value: 4, isUnsigned: true)
!53 = !DIEnumerator(name: "BM_FACE", value: 8, isUnsigned: true)
!54 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "BMIterType", file: !55, line: 57, baseType: !5, size: 32, elements: !56)
!55 = !DIFile(filename: "blender/source/blender/bmesh/intern/bmesh_iterators.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!56 = !{!57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70}
!57 = !DIEnumerator(name: "BM_VERTS_OF_MESH", value: 1, isUnsigned: true)
!58 = !DIEnumerator(name: "BM_EDGES_OF_MESH", value: 2, isUnsigned: true)
!59 = !DIEnumerator(name: "BM_FACES_OF_MESH", value: 3, isUnsigned: true)
!60 = !DIEnumerator(name: "BM_EDGES_OF_VERT", value: 4, isUnsigned: true)
!61 = !DIEnumerator(name: "BM_FACES_OF_VERT", value: 5, isUnsigned: true)
!62 = !DIEnumerator(name: "BM_LOOPS_OF_VERT", value: 6, isUnsigned: true)
!63 = !DIEnumerator(name: "BM_VERTS_OF_EDGE", value: 7, isUnsigned: true)
!64 = !DIEnumerator(name: "BM_FACES_OF_EDGE", value: 8, isUnsigned: true)
!65 = !DIEnumerator(name: "BM_VERTS_OF_FACE", value: 9, isUnsigned: true)
!66 = !DIEnumerator(name: "BM_EDGES_OF_FACE", value: 10, isUnsigned: true)
!67 = !DIEnumerator(name: "BM_LOOPS_OF_FACE", value: 11, isUnsigned: true)
!68 = !DIEnumerator(name: "BM_ALL_LOOPS_OF_FACE", value: 12, isUnsigned: true)
!69 = !DIEnumerator(name: "BM_LOOPS_OF_LOOP", value: 13, isUnsigned: true)
!70 = !DIEnumerator(name: "BM_LOOPS_OF_EDGE", value: 14, isUnsigned: true)
!71 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !48, line: 260, baseType: !5, size: 32, elements: !72)
!72 = !{!73, !74, !75, !76, !77, !78, !79}
!73 = !DIEnumerator(name: "BM_ELEM_SELECT", value: 1, isUnsigned: true)
!74 = !DIEnumerator(name: "BM_ELEM_HIDDEN", value: 2, isUnsigned: true)
!75 = !DIEnumerator(name: "BM_ELEM_SEAM", value: 4, isUnsigned: true)
!76 = !DIEnumerator(name: "BM_ELEM_SMOOTH", value: 8, isUnsigned: true)
!77 = !DIEnumerator(name: "BM_ELEM_TAG", value: 16, isUnsigned: true)
!78 = !DIEnumerator(name: "BM_ELEM_DRAW", value: 32, isUnsigned: true)
!79 = !DIEnumerator(name: "BM_ELEM_INTERNAL_TAG", value: 128, isUnsigned: true)
!80 = !{!81, !82, !83, !87, !91, !157, !159, !141, !103, !161}
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIterType", file: !55, line: 79, baseType: !54)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter__begin_cb", file: !55, line: 158, baseType: !84)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!85 = !DISubroutineType(types: !86)
!86 = !{null, !81}
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter__step_cb", file: !55, line: 159, baseType: !88)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!89 = !DISubroutineType(types: !90)
!90 = !{!81, !81}
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMVert", file: !48, line: 103, baseType: !93)
!93 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMVert", file: !48, line: 90, size: 448, elements: !94)
!94 = !{!95, !106, !112, !117, !118}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !93, file: !48, line: 91, baseType: !96, size: 128)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMHeader", file: !48, line: 82, baseType: !97)
!97 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMHeader", file: !48, line: 64, size: 128, elements: !98)
!98 = !{!99, !100, !102, !104, !105}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !97, file: !48, line: 65, baseType: !81, size: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !97, file: !48, line: 66, baseType: !101, size: 32, offset: 64)
!101 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !97, file: !48, line: 73, baseType: !103, size: 8, offset: 96)
!103 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "hflag", scope: !97, file: !48, line: 74, baseType: !103, size: 8, offset: 104)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "api_flag", scope: !97, file: !48, line: 80, baseType: !103, size: 8, offset: 112)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !93, file: !48, line: 92, baseType: !107, size: 64, offset: 128)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFlagLayer", file: !48, line: 180, size: 16, elements: !109)
!109 = !{!110}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !108, file: !48, line: 181, baseType: !111, size: 16)
!111 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !93, file: !48, line: 94, baseType: !113, size: 96, offset: 192)
!113 = !DICompositeType(tag: DW_TAG_array_type, baseType: !114, size: 96, elements: !115)
!114 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!115 = !{!116}
!116 = !DISubrange(count: 3)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !93, file: !48, line: 95, baseType: !113, size: 96, offset: 288)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !93, file: !48, line: 102, baseType: !119, size: 64, offset: 384)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMEdge", file: !48, line: 110, size: 640, elements: !121)
!121 = !{!122, !123, !124, !126, !127, !150, !156}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !120, file: !48, line: 111, baseType: !96, size: 128)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !120, file: !48, line: 112, baseType: !107, size: 64, offset: 128)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !120, file: !48, line: 114, baseType: !125, size: 64, offset: 192)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !120, file: !48, line: 114, baseType: !125, size: 64, offset: 256)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !120, file: !48, line: 118, baseType: !128, size: 64, offset: 320)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMLoop", file: !48, line: 125, size: 576, elements: !130)
!130 = !{!131, !132, !133, !134, !146, !147, !148, !149}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !129, file: !48, line: 126, baseType: !96, size: 128)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !129, file: !48, line: 129, baseType: !125, size: 64, offset: 128)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !129, file: !48, line: 130, baseType: !119, size: 64, offset: 192)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !129, file: !48, line: 131, baseType: !135, size: 64, offset: 256)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFace", file: !48, line: 164, size: 448, elements: !137)
!137 = !{!138, !139, !140, !143, !144, !145}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !136, file: !48, line: 165, baseType: !96, size: 128)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !136, file: !48, line: 166, baseType: !107, size: 64, offset: 128)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !136, file: !48, line: 172, baseType: !141, size: 64, offset: 192)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMLoop", file: !48, line: 140, baseType: !129)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !136, file: !48, line: 174, baseType: !101, size: 32, offset: 256)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !136, file: !48, line: 175, baseType: !113, size: 96, offset: 288)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !136, file: !48, line: 176, baseType: !111, size: 16, offset: 384)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "radial_next", scope: !129, file: !48, line: 135, baseType: !128, size: 64, offset: 320)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "radial_prev", scope: !129, file: !48, line: 135, baseType: !128, size: 64, offset: 384)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !129, file: !48, line: 139, baseType: !128, size: 64, offset: 448)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !129, file: !48, line: 139, baseType: !128, size: 64, offset: 512)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "v1_disk_link", scope: !120, file: !48, line: 122, baseType: !151, size: 128, offset: 384)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMDiskLink", file: !48, line: 108, baseType: !152)
!152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMDiskLink", file: !48, line: 106, size: 128, elements: !153)
!153 = !{!154, !155}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !152, file: !48, line: 107, baseType: !119, size: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !152, file: !48, line: 107, baseType: !119, size: 64, offset: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "v2_disk_link", scope: !120, file: !48, line: 122, baseType: !151, size: 128, offset: 512)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMEdge", file: !48, line: 123, baseType: !120)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMFace", file: !48, line: 178, baseType: !136)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!162 = !{i32 7, !"Dwarf Version", i32 4}
!163 = !{i32 2, !"Debug Info Version", i32 3}
!164 = !{i32 1, !"wchar_size", i32 4}
!165 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!166 = distinct !DISubprogram(name: "BM_mesh_decimate_collapse", scope: !1, file: !1, line: 979, type: !167, scopeLine: 980, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !314)
!167 = !DISubroutineType(types: !168)
!168 = !{null, !169, !310, !311, !312}
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMesh", file: !48, line: 246, baseType: !171)
!171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMesh", file: !48, line: 186, size: 8064, elements: !172)
!172 = !{!173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !186, !187, !188, !189, !191, !193, !195, !196, !197, !198, !199, !200, !201, !202, !254, !293, !294, !295, !296, !297, !298, !299, !300, !307, !308, !309}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "totvert", scope: !171, file: !48, line: 187, baseType: !101, size: 32)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "totedge", scope: !171, file: !48, line: 187, baseType: !101, size: 32, offset: 32)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !171, file: !48, line: 187, baseType: !101, size: 32, offset: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "totface", scope: !171, file: !48, line: 187, baseType: !101, size: 32, offset: 96)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "totvertsel", scope: !171, file: !48, line: 188, baseType: !101, size: 32, offset: 128)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "totedgesel", scope: !171, file: !48, line: 188, baseType: !101, size: 32, offset: 160)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "totfacesel", scope: !171, file: !48, line: 188, baseType: !101, size: 32, offset: 192)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "elem_index_dirty", scope: !171, file: !48, line: 193, baseType: !103, size: 8, offset: 224)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "elem_table_dirty", scope: !171, file: !48, line: 197, baseType: !103, size: 8, offset: 232)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "vpool", scope: !171, file: !48, line: 201, baseType: !183, size: 64, offset: 256)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool", file: !185, line: 71, flags: DIFlagFwdDecl)
!185 = !DIFile(filename: "blender/source/blender/makesdna/DNA_customdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!186 = !DIDerivedType(tag: DW_TAG_member, name: "epool", scope: !171, file: !48, line: 201, baseType: !183, size: 64, offset: 320)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "lpool", scope: !171, file: !48, line: 201, baseType: !183, size: 64, offset: 384)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "fpool", scope: !171, file: !48, line: 201, baseType: !183, size: 64, offset: 448)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !171, file: !48, line: 208, baseType: !190, size: 64, offset: 512)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "etable", scope: !171, file: !48, line: 209, baseType: !192, size: 64, offset: 576)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "ftable", scope: !171, file: !48, line: 210, baseType: !194, size: 64, offset: 640)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "vtable_tot", scope: !171, file: !48, line: 213, baseType: !101, size: 32, offset: 704)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "etable_tot", scope: !171, file: !48, line: 214, baseType: !101, size: 32, offset: 736)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "ftable_tot", scope: !171, file: !48, line: 215, baseType: !101, size: 32, offset: 768)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "vtoolflagpool", scope: !171, file: !48, line: 218, baseType: !183, size: 64, offset: 832)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "etoolflagpool", scope: !171, file: !48, line: 218, baseType: !183, size: 64, offset: 896)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "ftoolflagpool", scope: !171, file: !48, line: 218, baseType: !183, size: 64, offset: 960)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "stackdepth", scope: !171, file: !48, line: 220, baseType: !101, size: 32, offset: 1024)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "currentop", scope: !171, file: !48, line: 221, baseType: !203, size: 64, offset: 1088)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!204 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOperator", file: !4, line: 190, size: 10496, elements: !205)
!205 = !{!206, !242, !243, !247, !250, !251, !253}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "slots_in", scope: !204, file: !4, line: 191, baseType: !207, size: 5120)
!207 = !DICompositeType(tag: DW_TAG_array_type, baseType: !208, size: 5120, elements: !240)
!208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOpSlot", file: !4, line: 147, size: 320, elements: !209)
!209 = !{!210, !213, !215, !225, !226}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "slot_name", scope: !208, file: !4, line: 148, baseType: !211, size: 64)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !103)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "slot_type", scope: !208, file: !4, line: 149, baseType: !214, size: 32, offset: 64)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotType", file: !4, line: 112, baseType: !3)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "slot_subtype", scope: !208, file: !4, line: 150, baseType: !216, size: 32, offset: 96)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Union", file: !4, line: 142, baseType: !217)
!217 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eBMOpSlotSubType_Union", file: !4, line: 138, size: 32, elements: !218)
!218 = !{!219, !221, !223}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !217, file: !4, line: 139, baseType: !220, size: 32)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Elem", file: !4, line: 122, baseType: !15)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !217, file: !4, line: 140, baseType: !222, size: 32)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Ptr", file: !4, line: 136, baseType: !21)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !217, file: !4, line: 141, baseType: !224, size: 32)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Map", file: !4, line: 130, baseType: !27)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !208, file: !4, line: 152, baseType: !101, size: 32, offset: 128)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !208, file: !4, line: 162, baseType: !227, size: 128, offset: 192)
!227 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !208, file: !4, line: 155, size: 128, elements: !228)
!228 = !{!229, !230, !231, !232, !233, !235}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !227, file: !4, line: 156, baseType: !101, size: 32)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !227, file: !4, line: 157, baseType: !114, size: 32)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !227, file: !4, line: 158, baseType: !81, size: 64)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !227, file: !4, line: 159, baseType: !113, size: 96)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !227, file: !4, line: 160, baseType: !234, size: 64)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "ghash", scope: !227, file: !4, line: 161, baseType: !236, size: 64)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHash", file: !238, line: 48, baseType: !239)
!238 = !DIFile(filename: "blender/source/blender/blenlib/BLI_ghash.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!239 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !238, line: 48, flags: DIFlagFwdDecl)
!240 = !{!241}
!241 = !DISubrange(count: 16)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "slots_out", scope: !204, file: !4, line: 192, baseType: !207, size: 5120, offset: 5120)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !204, file: !4, line: 193, baseType: !244, size: 64, offset: 10240)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!245 = !DISubroutineType(types: !246)
!246 = !{null, !169, !203}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "arena", scope: !204, file: !4, line: 194, baseType: !248, size: 64, offset: 10304)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!249 = !DICompositeType(tag: DW_TAG_structure_type, name: "MemArena", file: !4, line: 194, flags: DIFlagFwdDecl)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !204, file: !4, line: 195, baseType: !101, size: 32, offset: 10368)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "type_flag", scope: !204, file: !4, line: 196, baseType: !252, size: 32, offset: 10400)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMOpTypeFlag", file: !4, line: 188, baseType: !35)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !204, file: !4, line: 197, baseType: !101, size: 32, offset: 10432)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !171, file: !48, line: 223, baseType: !255, size: 1600, offset: 1152)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomData", file: !185, line: 73, baseType: !256)
!256 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomData", file: !185, line: 64, size: 1600, elements: !257)
!257 = !{!258, !276, !280, !281, !282, !283, !284}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !256, file: !185, line: 65, baseType: !259, size: 64)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataLayer", file: !185, line: 53, baseType: !261)
!261 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataLayer", file: !185, line: 42, size: 832, elements: !262)
!262 = !{!263, !264, !265, !266, !267, !268, !269, !270, !271, !275}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !261, file: !185, line: 43, baseType: !101, size: 32)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !261, file: !185, line: 44, baseType: !101, size: 32, offset: 32)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !261, file: !185, line: 45, baseType: !101, size: 32, offset: 64)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !261, file: !185, line: 46, baseType: !101, size: 32, offset: 96)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "active_rnd", scope: !261, file: !185, line: 47, baseType: !101, size: 32, offset: 128)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "active_clone", scope: !261, file: !185, line: 48, baseType: !101, size: 32, offset: 160)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "active_mask", scope: !261, file: !185, line: 49, baseType: !101, size: 32, offset: 192)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !261, file: !185, line: 50, baseType: !101, size: 32, offset: 224)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !261, file: !185, line: 51, baseType: !272, size: 512, offset: 256)
!272 = !DICompositeType(tag: DW_TAG_array_type, baseType: !103, size: 512, elements: !273)
!273 = !{!274}
!274 = !DISubrange(count: 64)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !261, file: !185, line: 52, baseType: !81, size: 64, offset: 768)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "typemap", scope: !256, file: !185, line: 66, baseType: !277, size: 1312, offset: 64)
!277 = !DICompositeType(tag: DW_TAG_array_type, baseType: !101, size: 1312, elements: !278)
!278 = !{!279}
!279 = !DISubrange(count: 41)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "totlayer", scope: !256, file: !185, line: 69, baseType: !101, size: 32, offset: 1376)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "maxlayer", scope: !256, file: !185, line: 69, baseType: !101, size: 32, offset: 1408)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "totsize", scope: !256, file: !185, line: 70, baseType: !101, size: 32, offset: 1440)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !256, file: !185, line: 71, baseType: !183, size: 64, offset: 1472)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !256, file: !185, line: 72, baseType: !285, size: 64, offset: 1536)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataExternal", file: !185, line: 59, baseType: !287)
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataExternal", file: !185, line: 57, size: 8192, elements: !288)
!288 = !{!289}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !287, file: !185, line: 58, baseType: !290, size: 8192)
!290 = !DICompositeType(tag: DW_TAG_array_type, baseType: !103, size: 8192, elements: !291)
!291 = !{!292}
!292 = !DISubrange(count: 1024)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !171, file: !48, line: 223, baseType: !255, size: 1600, offset: 2752)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "ldata", scope: !171, file: !48, line: 223, baseType: !255, size: 1600, offset: 4352)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !171, file: !48, line: 223, baseType: !255, size: 1600, offset: 5952)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !171, file: !48, line: 233, baseType: !111, size: 16, offset: 7552)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !171, file: !48, line: 236, baseType: !101, size: 32, offset: 7584)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "walkers", scope: !171, file: !48, line: 238, baseType: !101, size: 32, offset: 7616)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "totflags", scope: !171, file: !48, line: 238, baseType: !101, size: 32, offset: 7648)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "selected", scope: !171, file: !48, line: 239, baseType: !301, size: 128, offset: 7680)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !302, line: 71, baseType: !303)
!302 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!303 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !302, line: 69, size: 128, elements: !304)
!304 = !{!305, !306}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !303, file: !302, line: 70, baseType: !81, size: 64)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !303, file: !302, line: 70, baseType: !81, size: 64, offset: 64)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "act_face", scope: !171, file: !48, line: 241, baseType: !159, size: 64, offset: 7808)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "errorstack", scope: !171, file: !48, line: 243, baseType: !301, size: 128, offset: 7872)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "py_handle", scope: !171, file: !48, line: 245, baseType: !81, size: 64, offset: 8000)
!310 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !114)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!312 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !313)
!313 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!314 = !{}
!315 = !DILocalVariable(name: "bm", arg: 1, scope: !166, file: !1, line: 979, type: !169)
!316 = !DILocation(line: 979, column: 39, scope: !166)
!317 = !DILocalVariable(name: "factor", arg: 2, scope: !166, file: !1, line: 979, type: !310)
!318 = !DILocation(line: 979, column: 55, scope: !166)
!319 = !DILocalVariable(name: "vweights", arg: 3, scope: !166, file: !1, line: 979, type: !311)
!320 = !DILocation(line: 979, column: 70, scope: !166)
!321 = !DILocalVariable(name: "do_triangulate", arg: 4, scope: !166, file: !1, line: 979, type: !312)
!322 = !DILocation(line: 979, column: 91, scope: !166)
!323 = !DILocalVariable(name: "eheap", scope: !166, file: !1, line: 981, type: !324)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "Heap", file: !326, line: 31, baseType: !327)
!326 = !DIFile(filename: "blender/source/blender/blenlib/BLI_heap.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!327 = !DICompositeType(tag: DW_TAG_structure_type, name: "Heap", file: !326, line: 29, flags: DIFlagFwdDecl)
!328 = !DILocation(line: 981, column: 8, scope: !166)
!329 = !DILocalVariable(name: "eheap_table", scope: !166, file: !1, line: 982, type: !330)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "HeapNode", file: !326, line: 32, baseType: !333)
!333 = !DICompositeType(tag: DW_TAG_structure_type, name: "HeapNode", file: !326, line: 30, flags: DIFlagFwdDecl)
!334 = !DILocation(line: 982, column: 13, scope: !166)
!335 = !DILocalVariable(name: "vquadrics", scope: !166, file: !1, line: 983, type: !336)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "Quadric", file: !338, line: 38, baseType: !339)
!338 = !DIFile(filename: "blender/source/blender/blenlib/BLI_quadric.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!339 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Quadric", file: !338, line: 33, size: 320, elements: !340)
!340 = !{!341, !342, !343, !344, !345, !346, !347, !348, !349, !350}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "a2", scope: !339, file: !338, line: 34, baseType: !114, size: 32)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "ab", scope: !339, file: !338, line: 34, baseType: !114, size: 32, offset: 32)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "ac", scope: !339, file: !338, line: 34, baseType: !114, size: 32, offset: 64)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "ad", scope: !339, file: !338, line: 34, baseType: !114, size: 32, offset: 96)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "b2", scope: !339, file: !338, line: 35, baseType: !114, size: 32, offset: 128)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "bc", scope: !339, file: !338, line: 35, baseType: !114, size: 32, offset: 160)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "bd", scope: !339, file: !338, line: 35, baseType: !114, size: 32, offset: 192)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "c2", scope: !339, file: !338, line: 36, baseType: !114, size: 32, offset: 224)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "cd", scope: !339, file: !338, line: 36, baseType: !114, size: 32, offset: 256)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "d2", scope: !339, file: !338, line: 37, baseType: !114, size: 32, offset: 288)
!351 = !DILocation(line: 983, column: 11, scope: !166)
!352 = !DILocalVariable(name: "tot_edge_orig", scope: !166, file: !1, line: 984, type: !101)
!353 = !DILocation(line: 984, column: 6, scope: !166)
!354 = !DILocalVariable(name: "face_tot_target", scope: !166, file: !1, line: 985, type: !101)
!355 = !DILocation(line: 985, column: 6, scope: !166)
!356 = !DILocalVariable(name: "use_triangulate", scope: !166, file: !1, line: 986, type: !313)
!357 = !DILocation(line: 986, column: 7, scope: !166)
!358 = !DILocalVariable(name: "customdata_flag", scope: !166, file: !1, line: 988, type: !359)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "CD_UseFlag", file: !1, line: 61, baseType: !42)
!360 = !DILocation(line: 988, column: 13, scope: !166)
!361 = !DILocation(line: 992, column: 47, scope: !166)
!362 = !DILocation(line: 992, column: 20, scope: !166)
!363 = !DILocation(line: 992, column: 18, scope: !166)
!364 = !DILocation(line: 997, column: 14, scope: !166)
!365 = !DILocation(line: 997, column: 44, scope: !166)
!366 = !DILocation(line: 997, column: 48, scope: !166)
!367 = !DILocation(line: 997, column: 42, scope: !166)
!368 = !DILocation(line: 997, column: 12, scope: !166)
!369 = !DILocation(line: 999, column: 26, scope: !166)
!370 = !DILocation(line: 999, column: 30, scope: !166)
!371 = !DILocation(line: 999, column: 10, scope: !166)
!372 = !DILocation(line: 999, column: 8, scope: !166)
!373 = !DILocation(line: 1000, column: 16, scope: !166)
!374 = !DILocation(line: 1000, column: 49, scope: !166)
!375 = !DILocation(line: 1000, column: 53, scope: !166)
!376 = !DILocation(line: 1000, column: 47, scope: !166)
!377 = !DILocation(line: 1000, column: 14, scope: !166)
!378 = !DILocation(line: 1001, column: 18, scope: !166)
!379 = !DILocation(line: 1001, column: 22, scope: !166)
!380 = !DILocation(line: 1001, column: 16, scope: !166)
!381 = !DILocation(line: 1005, column: 26, scope: !166)
!382 = !DILocation(line: 1005, column: 30, scope: !166)
!383 = !DILocation(line: 1005, column: 2, scope: !166)
!384 = !DILocation(line: 1007, column: 27, scope: !166)
!385 = !DILocation(line: 1007, column: 31, scope: !166)
!386 = !DILocation(line: 1007, column: 42, scope: !166)
!387 = !DILocation(line: 1007, column: 52, scope: !166)
!388 = !DILocation(line: 1007, column: 59, scope: !166)
!389 = !DILocation(line: 1007, column: 2, scope: !166)
!390 = !DILocation(line: 1009, column: 20, scope: !166)
!391 = !DILocation(line: 1009, column: 24, scope: !166)
!392 = !DILocation(line: 1009, column: 34, scope: !166)
!393 = !DILocation(line: 1009, column: 32, scope: !166)
!394 = !DILocation(line: 1009, column: 18, scope: !166)
!395 = !DILocation(line: 1010, column: 2, scope: !166)
!396 = !DILocation(line: 1010, column: 6, scope: !166)
!397 = !DILocation(line: 1010, column: 23, scope: !166)
!398 = !DILocation(line: 1015, column: 29, scope: !399)
!399 = distinct !DILexicalBlock(scope: !166, file: !1, line: 1015, column: 6)
!400 = !DILocation(line: 1015, column: 33, scope: !399)
!401 = !DILocation(line: 1015, column: 6, scope: !399)
!402 = !DILocation(line: 1015, column: 6, scope: !166)
!403 = !DILocation(line: 1015, column: 58, scope: !399)
!404 = !DILocation(line: 1015, column: 42, scope: !399)
!405 = !DILocation(line: 1016, column: 29, scope: !406)
!406 = distinct !DILexicalBlock(scope: !166, file: !1, line: 1016, column: 6)
!407 = !DILocation(line: 1016, column: 33, scope: !406)
!408 = !DILocation(line: 1016, column: 6, scope: !406)
!409 = !DILocation(line: 1016, column: 6, scope: !166)
!410 = !DILocation(line: 1016, column: 58, scope: !406)
!411 = !DILocation(line: 1016, column: 42, scope: !406)
!412 = !DILocation(line: 1017, column: 27, scope: !413)
!413 = distinct !DILexicalBlock(scope: !166, file: !1, line: 1017, column: 6)
!414 = !DILocation(line: 1017, column: 31, scope: !413)
!415 = !DILocation(line: 1017, column: 6, scope: !413)
!416 = !DILocation(line: 1017, column: 6, scope: !166)
!417 = !DILocation(line: 1017, column: 58, scope: !413)
!418 = !DILocation(line: 1017, column: 42, scope: !413)
!419 = !DILocation(line: 1021, column: 2, scope: !166)
!420 = !DILocation(line: 1021, column: 10, scope: !166)
!421 = !DILocation(line: 1021, column: 14, scope: !166)
!422 = !DILocation(line: 1021, column: 24, scope: !166)
!423 = !DILocation(line: 1021, column: 22, scope: !166)
!424 = !DILocation(line: 1021, column: 41, scope: !166)
!425 = !DILocation(line: 1022, column: 28, scope: !166)
!426 = !DILocation(line: 1022, column: 10, scope: !166)
!427 = !DILocation(line: 1022, column: 35, scope: !166)
!428 = !DILocation(line: 1022, column: 45, scope: !166)
!429 = !DILocation(line: 1023, column: 43, scope: !166)
!430 = !DILocation(line: 1023, column: 30, scope: !166)
!431 = !DILocation(line: 1023, column: 10, scope: !166)
!432 = !DILocation(line: 1023, column: 51, scope: !166)
!433 = !DILocation(line: 0, scope: !166)
!434 = !DILocalVariable(name: "e", scope: !435, file: !1, line: 1026, type: !157)
!435 = distinct !DILexicalBlock(scope: !166, file: !1, line: 1024, column: 2)
!436 = !DILocation(line: 1026, column: 11, scope: !435)
!437 = !DILocation(line: 1026, column: 31, scope: !435)
!438 = !DILocation(line: 1026, column: 15, scope: !435)
!439 = !DILocation(line: 1033, column: 3, scope: !435)
!440 = !DILocation(line: 1033, column: 15, scope: !435)
!441 = !DILocation(line: 1033, column: 37, scope: !435)
!442 = !DILocation(line: 1035, column: 26, scope: !435)
!443 = !DILocation(line: 1035, column: 30, scope: !435)
!444 = !DILocation(line: 1035, column: 33, scope: !435)
!445 = !DILocation(line: 1035, column: 44, scope: !435)
!446 = !DILocation(line: 1035, column: 54, scope: !435)
!447 = !DILocation(line: 1035, column: 61, scope: !435)
!448 = !DILocation(line: 1035, column: 74, scope: !435)
!449 = !DILocation(line: 1035, column: 3, scope: !435)
!450 = distinct !{!450, !419, !451}
!451 = !DILocation(line: 1036, column: 2, scope: !166)
!452 = !DILocation(line: 1040, column: 6, scope: !453)
!453 = distinct !DILexicalBlock(scope: !166, file: !1, line: 1040, column: 6)
!454 = !DILocation(line: 1040, column: 21, scope: !453)
!455 = !DILocation(line: 1040, column: 6, scope: !166)
!456 = !DILocation(line: 1042, column: 7, scope: !457)
!457 = distinct !DILexicalBlock(scope: !458, file: !1, line: 1042, column: 7)
!458 = distinct !DILexicalBlock(scope: !453, file: !1, line: 1040, column: 31)
!459 = !DILocation(line: 1042, column: 7, scope: !458)
!460 = !DILocation(line: 1044, column: 29, scope: !461)
!461 = distinct !DILexicalBlock(scope: !457, file: !1, line: 1042, column: 32)
!462 = !DILocation(line: 1044, column: 4, scope: !461)
!463 = !DILocation(line: 1045, column: 3, scope: !461)
!464 = !DILocation(line: 1046, column: 2, scope: !458)
!465 = !DILocation(line: 1050, column: 2, scope: !166)
!466 = !DILocation(line: 1050, column: 12, scope: !166)
!467 = !DILocation(line: 1051, column: 2, scope: !166)
!468 = !DILocation(line: 1051, column: 12, scope: !166)
!469 = !DILocation(line: 1052, column: 16, scope: !166)
!470 = !DILocation(line: 1052, column: 2, scope: !166)
!471 = !DILocation(line: 1057, column: 8, scope: !166)
!472 = !DILocation(line: 1058, column: 1, scope: !166)
!473 = distinct !DISubprogram(name: "bm_decim_triangulate_begin", scope: !1, file: !1, line: 299, type: !474, scopeLine: 300, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !314)
!474 = !DISubroutineType(types: !475)
!475 = !{!313, !169}
!476 = !DILocalVariable(name: "bm", arg: 1, scope: !473, file: !1, line: 299, type: !169)
!477 = !DILocation(line: 299, column: 47, scope: !473)
!478 = !DILocalVariable(name: "iter", scope: !473, file: !1, line: 301, type: !479)
!479 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter", file: !55, line: 186, baseType: !480)
!480 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter", file: !55, line: 164, size: 512, elements: !481)
!481 = !{!482, !562, !563, !564, !565}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !480, file: !55, line: 179, baseType: !483, size: 320)
!483 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !480, file: !55, line: 166, size: 320, elements: !484)
!484 = !{!485, !500, !506, !514, !522, !528, !534, !540, !544, !550, !556}
!485 = !DIDerivedType(tag: DW_TAG_member, name: "elem_of_mesh", scope: !483, file: !55, line: 167, baseType: !486, size: 192)
!486 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__elem_of_mesh", file: !55, line: 113, size: 192, elements: !487)
!487 = !{!488}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "pooliter", scope: !486, file: !55, line: 114, baseType: !489, size: 192)
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLI_mempool_iter", file: !490, line: 80, baseType: !491)
!490 = !DIFile(filename: "blender/source/blender/blenlib/BLI_mempool.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!491 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool_iter", file: !490, line: 76, size: 192, elements: !492)
!492 = !{!493, !496, !499}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !491, file: !490, line: 77, baseType: !494, size: 64)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64)
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLI_mempool", file: !490, line: 47, baseType: !184)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "curchunk", scope: !491, file: !490, line: 78, baseType: !497, size: 64, offset: 64)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64)
!498 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool_chunk", file: !490, line: 45, flags: DIFlagFwdDecl)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "curindex", scope: !491, file: !490, line: 79, baseType: !5, size: 32, offset: 128)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "edge_of_vert", scope: !483, file: !55, line: 169, baseType: !501, size: 192)
!501 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__edge_of_vert", file: !55, line: 116, size: 192, elements: !502)
!502 = !{!503, !504, !505}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !501, file: !55, line: 117, baseType: !91, size: 64)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "e_first", scope: !501, file: !55, line: 118, baseType: !157, size: 64, offset: 64)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "e_next", scope: !501, file: !55, line: 118, baseType: !157, size: 64, offset: 128)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "face_of_vert", scope: !483, file: !55, line: 170, baseType: !507, size: 320)
!507 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__face_of_vert", file: !55, line: 120, size: 320, elements: !508)
!508 = !{!509, !510, !511, !512, !513}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !507, file: !55, line: 121, baseType: !91, size: 64)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !507, file: !55, line: 122, baseType: !141, size: 64, offset: 64)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !507, file: !55, line: 122, baseType: !141, size: 64, offset: 128)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "e_first", scope: !507, file: !55, line: 123, baseType: !157, size: 64, offset: 192)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "e_next", scope: !507, file: !55, line: 123, baseType: !157, size: 64, offset: 256)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_vert", scope: !483, file: !55, line: 171, baseType: !515, size: 320)
!515 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_vert", file: !55, line: 125, size: 320, elements: !516)
!516 = !{!517, !518, !519, !520, !521}
!517 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !515, file: !55, line: 126, baseType: !91, size: 64)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !515, file: !55, line: 127, baseType: !141, size: 64, offset: 64)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !515, file: !55, line: 127, baseType: !141, size: 64, offset: 128)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "e_first", scope: !515, file: !55, line: 128, baseType: !157, size: 64, offset: 192)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "e_next", scope: !515, file: !55, line: 128, baseType: !157, size: 64, offset: 256)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_edge", scope: !483, file: !55, line: 172, baseType: !523, size: 192)
!523 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_edge", file: !55, line: 130, size: 192, elements: !524)
!524 = !{!525, !526, !527}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !523, file: !55, line: 131, baseType: !157, size: 64)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !523, file: !55, line: 132, baseType: !141, size: 64, offset: 64)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !523, file: !55, line: 132, baseType: !141, size: 64, offset: 128)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_loop", scope: !483, file: !55, line: 173, baseType: !529, size: 192)
!529 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_loop", file: !55, line: 134, size: 192, elements: !530)
!530 = !{!531, !532, !533}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "ldata", scope: !529, file: !55, line: 135, baseType: !141, size: 64)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !529, file: !55, line: 136, baseType: !141, size: 64, offset: 64)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !529, file: !55, line: 136, baseType: !141, size: 64, offset: 128)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "face_of_edge", scope: !483, file: !55, line: 174, baseType: !535, size: 192)
!535 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__face_of_edge", file: !55, line: 138, size: 192, elements: !536)
!536 = !{!537, !538, !539}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !535, file: !55, line: 139, baseType: !157, size: 64)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !535, file: !55, line: 140, baseType: !141, size: 64, offset: 64)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !535, file: !55, line: 140, baseType: !141, size: 64, offset: 128)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "vert_of_edge", scope: !483, file: !55, line: 175, baseType: !541, size: 64)
!541 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__vert_of_edge", file: !55, line: 142, size: 64, elements: !542)
!542 = !{!543}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !541, file: !55, line: 143, baseType: !157, size: 64)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "vert_of_face", scope: !483, file: !55, line: 176, baseType: !545, size: 192)
!545 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__vert_of_face", file: !55, line: 145, size: 192, elements: !546)
!546 = !{!547, !548, !549}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !545, file: !55, line: 146, baseType: !159, size: 64)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !545, file: !55, line: 147, baseType: !141, size: 64, offset: 64)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !545, file: !55, line: 147, baseType: !141, size: 64, offset: 128)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "edge_of_face", scope: !483, file: !55, line: 177, baseType: !551, size: 192)
!551 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__edge_of_face", file: !55, line: 149, size: 192, elements: !552)
!552 = !{!553, !554, !555}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !551, file: !55, line: 150, baseType: !159, size: 64)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !551, file: !55, line: 151, baseType: !141, size: 64, offset: 64)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !551, file: !55, line: 151, baseType: !141, size: 64, offset: 128)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_face", scope: !483, file: !55, line: 178, baseType: !557, size: 192)
!557 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_face", file: !55, line: 153, size: 192, elements: !558)
!558 = !{!559, !560, !561}
!559 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !557, file: !55, line: 154, baseType: !159, size: 64)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !557, file: !55, line: 155, baseType: !141, size: 64, offset: 64)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !557, file: !55, line: 155, baseType: !141, size: 64, offset: 128)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "begin", scope: !480, file: !55, line: 181, baseType: !83, size: 64, offset: 320)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !480, file: !55, line: 182, baseType: !87, size: 64, offset: 384)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !480, file: !55, line: 184, baseType: !101, size: 32, offset: 448)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "itype", scope: !480, file: !55, line: 185, baseType: !103, size: 8, offset: 480)
!566 = !DILocation(line: 301, column: 9, scope: !473)
!567 = !DILocalVariable(name: "f", scope: !473, file: !1, line: 302, type: !159)
!568 = !DILocation(line: 302, column: 10, scope: !473)
!569 = !DILocalVariable(name: "has_cut", scope: !473, file: !1, line: 304, type: !313)
!570 = !DILocation(line: 304, column: 7, scope: !473)
!571 = !DILocation(line: 309, column: 2, scope: !572)
!572 = distinct !DILexicalBlock(scope: !473, file: !1, line: 309, column: 2)
!573 = !DILocation(line: 309, column: 2, scope: !574)
!574 = distinct !DILexicalBlock(scope: !572, file: !1, line: 309, column: 2)
!575 = !DILocalVariable(name: "l_iter", scope: !576, file: !1, line: 310, type: !141)
!576 = distinct !DILexicalBlock(scope: !574, file: !1, line: 309, column: 48)
!577 = !DILocation(line: 310, column: 11, scope: !576)
!578 = !DILocalVariable(name: "l_first", scope: !576, file: !1, line: 311, type: !141)
!579 = !DILocation(line: 311, column: 11, scope: !576)
!580 = !DILocation(line: 313, column: 22, scope: !576)
!581 = !DILocation(line: 313, column: 20, scope: !576)
!582 = !DILocation(line: 313, column: 10, scope: !576)
!583 = !DILocation(line: 314, column: 3, scope: !576)
!584 = !DILocation(line: 315, column: 4, scope: !585)
!585 = distinct !DILexicalBlock(scope: !576, file: !1, line: 314, column: 6)
!586 = !DILocation(line: 316, column: 3, scope: !585)
!587 = !DILocation(line: 316, column: 22, scope: !576)
!588 = !DILocation(line: 316, column: 30, scope: !576)
!589 = !DILocation(line: 316, column: 20, scope: !576)
!590 = !DILocation(line: 316, column: 39, scope: !576)
!591 = !DILocation(line: 316, column: 36, scope: !576)
!592 = distinct !{!592, !583, !593}
!593 = !DILocation(line: 316, column: 46, scope: !576)
!594 = !DILocation(line: 319, column: 2, scope: !576)
!595 = distinct !{!595, !571, !596}
!596 = !DILocation(line: 319, column: 2, scope: !572)
!597 = !DILocation(line: 321, column: 2, scope: !473)
!598 = !DILocation(line: 321, column: 6, scope: !473)
!599 = !DILocation(line: 321, column: 23, scope: !473)
!600 = !DILocation(line: 326, column: 2, scope: !601)
!601 = distinct !DILexicalBlock(scope: !473, file: !1, line: 326, column: 2)
!602 = !DILocation(line: 326, column: 2, scope: !603)
!603 = distinct !DILexicalBlock(scope: !601, file: !1, line: 326, column: 2)
!604 = !DILocation(line: 327, column: 7, scope: !605)
!605 = distinct !DILexicalBlock(scope: !606, file: !1, line: 327, column: 7)
!606 = distinct !DILexicalBlock(scope: !603, file: !1, line: 326, column: 48)
!607 = !DILocation(line: 327, column: 10, scope: !605)
!608 = !DILocation(line: 327, column: 14, scope: !605)
!609 = !DILocation(line: 327, column: 7, scope: !606)
!610 = !DILocalVariable(name: "f_l", scope: !611, file: !1, line: 328, type: !612)
!611 = distinct !DILexicalBlock(scope: !605, file: !1, line: 327, column: 20)
!612 = !DICompositeType(tag: DW_TAG_array_type, baseType: !141, size: 256, elements: !613)
!613 = !{!614}
!614 = !DISubrange(count: 4)
!615 = !DILocation(line: 328, column: 12, scope: !611)
!616 = !DILocalVariable(name: "l_a", scope: !611, file: !1, line: 329, type: !141)
!617 = !DILocation(line: 329, column: 12, scope: !611)
!618 = !DILocalVariable(name: "l_b", scope: !611, file: !1, line: 329, type: !141)
!619 = !DILocation(line: 329, column: 18, scope: !611)
!620 = !DILocalVariable(name: "l_iter", scope: !621, file: !1, line: 332, type: !141)
!621 = distinct !DILexicalBlock(scope: !611, file: !1, line: 331, column: 4)
!622 = !DILocation(line: 332, column: 13, scope: !621)
!623 = !DILocation(line: 332, column: 22, scope: !621)
!624 = !DILocation(line: 334, column: 14, scope: !621)
!625 = !DILocation(line: 334, column: 5, scope: !621)
!626 = !DILocation(line: 334, column: 12, scope: !621)
!627 = !DILocation(line: 334, column: 31, scope: !621)
!628 = !DILocation(line: 334, column: 39, scope: !621)
!629 = !DILocation(line: 334, column: 29, scope: !621)
