; ModuleID = 'blender/source/blender/blenkernel/intern/pbvh.c'
source_filename = "blender/source/blender/blenkernel/intern/pbvh.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.Global = type { %struct.Main*, [1024 x i8], [1024 x i8], i8, i8, i8, %struct.ListBase, i8, i8, i8, i16, i16, i16, i8, i16, i32, i32, i8, i32, i32, [200 x i8] }
%struct.Main = type opaque
%struct.ListBase = type { i8*, i8* }
%struct.BB = type { [3 x float], [3 x float] }
%struct.BBC = type { [3 x float], [3 x float], [3 x float] }
%struct.PBVH = type { i32, i32, %struct.PBVHNode*, i32, i32, i32*, i32, i32, i32, %struct.MVert*, %struct.MFace*, %struct.CustomData*, %struct.CCGKey, %struct.CCGElem**, %struct.DMGridAdjacency*, i8**, %struct.DMFlagMat*, i32, i32**, i32*, i8, i8, %struct.BMesh*, float, float, i32, i32, %struct.BMLog* }
%struct.PBVHNode = type { %struct.GPU_PBVH_Buffers*, %struct.BB, %struct.BB, i32, i32*, i32, i32*, i32, i32, [4 x i32]*, i16, float, float*, i32, %struct.PBVHProxyNode*, %struct.GSet*, %struct.GSet*, %struct.GSet*, [3 x float]*, [3 x i32]*, i32 }
%struct.GPU_PBVH_Buffers = type opaque
%struct.PBVHProxyNode = type { [3 x float]* }
%struct.GSet = type opaque
%struct.MVert = type { [3 x float], [3 x i16], i8, i8 }
%struct.MFace = type { i32, i32, i32, i32, i16, i8, i8 }

!61 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_SELECT_FLUSH", value: 4, isUnsigned: true)
!62 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_SELECT_VALIDATE", value: 8, isUnsigned: true)
!63 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1, line: 1695, baseType: !5, size: 32, elements: !64)
!64 = !{!65, !66, !67}
!65 = !DIEnumerator(name: "ISECT_INSIDE", value: 0, isUnsigned: true)
!66 = !DIEnumerator(name: "ISECT_OUTSIDE", value: 1, isUnsigned: true)
!67 = !DIEnumerator(name: "ISECT_INTERSECT", value: 2, isUnsigned: true)
!68 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !69, line: 304, baseType: !5, size: 32, elements: !70)
!69 = !DIFile(filename: "blender/source/blender/makesdna/DNA_meshdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!70 = !{!71, !72, !73, !74}
!71 = !DIEnumerator(name: "ME_VERT_TMP_TAG", value: 4, isUnsigned: true)
!72 = !DIEnumerator(name: "ME_HIDE", value: 16, isUnsigned: true)
!73 = !DIEnumerator(name: "ME_VERT_MERGED", value: 64, isUnsigned: true)
!74 = !DIEnumerator(name: "ME_VERT_PBVH_UPDATE", value: 128, isUnsigned: true)
!75 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !76, line: 76, baseType: !5, size: 32, elements: !77)
!76 = !DIFile(filename: "blender/source/blender/makesdna/DNA_customdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!77 = !{!78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118}
!78 = !DIEnumerator(name: "CD_MVERT", value: 0, isUnsigned: true)
!79 = !DIEnumerator(name: "CD_MSTICKY", value: 1, isUnsigned: true)
!80 = !DIEnumerator(name: "CD_MDEFORMVERT", value: 2, isUnsigned: true)
!81 = !DIEnumerator(name: "CD_MEDGE", value: 3, isUnsigned: true)
!82 = !DIEnumerator(name: "CD_MFACE", value: 4, isUnsigned: true)
!83 = !DIEnumerator(name: "CD_MTFACE", value: 5, isUnsigned: true)
!84 = !DIEnumerator(name: "CD_MCOL", value: 6, isUnsigned: true)
!85 = !DIEnumerator(name: "CD_ORIGINDEX", value: 7, isUnsigned: true)
!86 = !DIEnumerator(name: "CD_NORMAL", value: 8, isUnsigned: true)
!87 = !DIEnumerator(name: "CD_PROP_FLT", value: 10, isUnsigned: true)
!88 = !DIEnumerator(name: "CD_PROP_INT", value: 11, isUnsigned: true)
!89 = !DIEnumerator(name: "CD_PROP_STR", value: 12, isUnsigned: true)
!90 = !DIEnumerator(name: "CD_ORIGSPACE", value: 13, isUnsigned: true)
!91 = !DIEnumerator(name: "CD_ORCO", value: 14, isUnsigned: true)
!92 = !DIEnumerator(name: "CD_MTEXPOLY", value: 15, isUnsigned: true)
!93 = !DIEnumerator(name: "CD_MLOOPUV", value: 16, isUnsigned: true)
!94 = !DIEnumerator(name: "CD_MLOOPCOL", value: 17, isUnsigned: true)
!95 = !DIEnumerator(name: "CD_TANGENT", value: 18, isUnsigned: true)
!96 = !DIEnumerator(name: "CD_MDISPS", value: 19, isUnsigned: true)
!97 = !DIEnumerator(name: "CD_PREVIEW_MCOL", value: 20, isUnsigned: true)
!98 = !DIEnumerator(name: "CD_ID_MCOL", value: 21, isUnsigned: true)
!99 = !DIEnumerator(name: "CD_TEXTURE_MCOL", value: 22, isUnsigned: true)
!100 = !DIEnumerator(name: "CD_CLOTH_ORCO", value: 23, isUnsigned: true)
!101 = !DIEnumerator(name: "CD_RECAST", value: 24, isUnsigned: true)
!102 = !DIEnumerator(name: "CD_MPOLY", value: 25, isUnsigned: true)
!103 = !DIEnumerator(name: "CD_MLOOP", value: 26, isUnsigned: true)
!104 = !DIEnumerator(name: "CD_SHAPE_KEYINDEX", value: 27, isUnsigned: true)
!105 = !DIEnumerator(name: "CD_SHAPEKEY", value: 28, isUnsigned: true)
!106 = !DIEnumerator(name: "CD_BWEIGHT", value: 29, isUnsigned: true)
!107 = !DIEnumerator(name: "CD_CREASE", value: 30, isUnsigned: true)
!108 = !DIEnumerator(name: "CD_ORIGSPACE_MLOOP", value: 31, isUnsigned: true)
!109 = !DIEnumerator(name: "CD_PREVIEW_MLOOPCOL", value: 32, isUnsigned: true)
!110 = !DIEnumerator(name: "CD_BM_ELEM_PYPTR", value: 33, isUnsigned: true)
!111 = !DIEnumerator(name: "CD_PAINT_MASK", value: 34, isUnsigned: true)
!112 = !DIEnumerator(name: "CD_GRID_PAINT_MASK", value: 35, isUnsigned: true)
!113 = !DIEnumerator(name: "CD_MVERT_SKIN", value: 36, isUnsigned: true)
!114 = !DIEnumerator(name: "CD_FREESTYLE_EDGE", value: 37, isUnsigned: true)
!115 = !DIEnumerator(name: "CD_FREESTYLE_FACE", value: 38, isUnsigned: true)
!116 = !DIEnumerator(name: "CD_MLOOPTANGENT", value: 39, isUnsigned: true)
!117 = !DIEnumerator(name: "CD_TESSLOOPNORMAL", value: 40, isUnsigned: true)
!118 = !DIEnumerator(name: "CD_NUMTYPES", value: 41, isUnsigned: true)
!119 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !69, line: 341, baseType: !5, size: 32, elements: !120)
!120 = !{!121, !122}
!121 = !DIEnumerator(name: "ME_SMOOTH", value: 1, isUnsigned: true)
!122 = !DIEnumerator(name: "ME_FACE_SEL", value: 2, isUnsigned: true)
!123 = !{!124, !127, !137, !138, !141, !142, !143, !150, !154, !156, !157, !162}
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLI_bitmap", file: !126, line: 33, baseType: !5)
!126 = !DIFile(filename: "blender/source/blender/blenlib/BLI_bitmap.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "BB", file: !11, line: 31, baseType: !129)
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !11, line: 29, size: 192, elements: !130)
!130 = !{!131, !136}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "bmin", scope: !129, file: !11, line: 30, baseType: !132, size: 96)
!132 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 96, elements: !134)
!133 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!134 = !{!135}
!135 = !DISubrange(count: 3)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "bmax", scope: !129, file: !11, line: 30, baseType: !132, size: 96, offset: 96)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !139, line: 87, baseType: !140)
!139 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!140 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!142 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_gh_Entry", file: !145, line: 94, size: 192, elements: !146)
!145 = !DIFile(filename: "blender/source/blender/blenlib/BLI_ghash.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!146 = !{!147, !148, !149}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !144, file: !145, line: 94, baseType: !137, size: 64)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !144, file: !145, line: 94, baseType: !137, size: 64, offset: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !144, file: !145, line: 94, baseType: !137, size: 64, offset: 128)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "CCGElem", file: !152, line: 51, baseType: !153)
!152 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_ccg.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!153 = !DICompositeType(tag: DW_TAG_structure_type, name: "CCGElem", file: !4, line: 33, flags: DIFlagFwdDecl)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!155 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!156 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHashIterator", file: !145, line: 54, baseType: !159)
!159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GHashIterator", file: !145, line: 50, size: 192, elements: !160)
!160 = !{!161, !165, !168}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "gh", scope: !159, file: !145, line: 51, baseType: !162, size: 64)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHash", file: !145, line: 48, baseType: !164)
!164 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !145, line: 48, flags: DIFlagFwdDecl)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "curEntry", scope: !159, file: !145, line: 52, baseType: !166, size: 64, offset: 64)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!167 = !DICompositeType(tag: DW_TAG_structure_type, name: "Entry", file: !145, line: 52, flags: DIFlagFwdDecl)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "curBucket", scope: !159, file: !145, line: 53, baseType: !5, size: 32, offset: 128)
!169 = !{i32 7, !"Dwarf Version", i32 4}
!170 = !{i32 2, !"Debug Info Version", i32 3}
!171 = !{i32 1, !"wchar_size", i32 4}
!172 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!173 = distinct !DISubprogram(name: "BB_reset", scope: !1, file: !1, line: 79, type: !174, scopeLine: 80, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !176)
!174 = !DISubroutineType(types: !175)
!175 = !{null, !127}
!176 = !{}
!177 = !DILocalVariable(name: "bb", arg: 1, scope: !173, file: !1, line: 79, type: !127)
!178 = !DILocation(line: 79, column: 19, scope: !173)
!179 = !DILocation(line: 81, column: 30, scope: !173)
!180 = !DILocation(line: 81, column: 34, scope: !173)
!181 = !DILocation(line: 81, column: 42, scope: !173)
!182 = !DILocation(line: 81, column: 16, scope: !173)
!183 = !DILocation(line: 81, column: 20, scope: !173)
!184 = !DILocation(line: 81, column: 28, scope: !173)
!185 = !DILocation(line: 81, column: 2, scope: !173)
!186 = !DILocation(line: 81, column: 6, scope: !173)
!187 = !DILocation(line: 81, column: 14, scope: !173)
!188 = !DILocation(line: 82, column: 30, scope: !173)
!189 = !DILocation(line: 82, column: 34, scope: !173)
!190 = !DILocation(line: 82, column: 42, scope: !173)
!191 = !DILocation(line: 82, column: 16, scope: !173)
!192 = !DILocation(line: 82, column: 20, scope: !173)
!193 = !DILocation(line: 82, column: 28, scope: !173)
!194 = !DILocation(line: 82, column: 2, scope: !173)
!195 = !DILocation(line: 82, column: 6, scope: !173)
!196 = !DILocation(line: 82, column: 14, scope: !173)
!197 = !DILocation(line: 83, column: 1, scope: !173)
!198 = distinct !DISubprogram(name: "BB_expand", scope: !1, file: !1, line: 86, type: !199, scopeLine: 87, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !176)
!199 = !DISubroutineType(types: !200)
!200 = !{null, !127, !201}
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !133)
!203 = !DILocalVariable(name: "bb", arg: 1, scope: !198, file: !1, line: 86, type: !127)
!204 = !DILocation(line: 86, column: 20, scope: !198)
!205 = !DILocalVariable(name: "co", arg: 2, scope: !198, file: !1, line: 86, type: !201)
!206 = !DILocation(line: 86, column: 36, scope: !198)
!207 = !DILocalVariable(name: "i", scope: !198, file: !1, line: 88, type: !142)
!208 = !DILocation(line: 88, column: 6, scope: !198)
!209 = !DILocation(line: 89, column: 9, scope: !210)
!210 = distinct !DILexicalBlock(scope: !198, file: !1, line: 89, column: 2)
!211 = !DILocation(line: 89, column: 7, scope: !210)
!212 = !DILocation(line: 89, column: 14, scope: !213)
!213 = distinct !DILexicalBlock(scope: !210, file: !1, line: 89, column: 2)
!214 = !DILocation(line: 89, column: 16, scope: !213)
!215 = !DILocation(line: 89, column: 2, scope: !210)
!216 = !DILocation(line: 90, column: 24, scope: !217)
!217 = distinct !DILexicalBlock(scope: !213, file: !1, line: 89, column: 26)
!218 = !DILocation(line: 90, column: 28, scope: !217)
!219 = !DILocation(line: 90, column: 33, scope: !217)
!220 = !DILocation(line: 90, column: 37, scope: !217)
!221 = !DILocation(line: 90, column: 40, scope: !217)
!222 = !DILocation(line: 90, column: 17, scope: !217)
!223 = !DILocation(line: 90, column: 3, scope: !217)
!224 = !DILocation(line: 90, column: 7, scope: !217)
!225 = !DILocation(line: 90, column: 12, scope: !217)
!226 = !DILocation(line: 90, column: 15, scope: !217)
!227 = !DILocation(line: 91, column: 24, scope: !217)
!228 = !DILocation(line: 91, column: 28, scope: !217)
!229 = !DILocation(line: 91, column: 33, scope: !217)
!230 = !DILocation(line: 91, column: 37, scope: !217)
!231 = !DILocation(line: 91, column: 40, scope: !217)
!232 = !DILocation(line: 91, column: 17, scope: !217)
!233 = !DILocation(line: 91, column: 3, scope: !217)
!234 = !DILocation(line: 91, column: 7, scope: !217)
!235 = !DILocation(line: 91, column: 12, scope: !217)
!236 = !DILocation(line: 91, column: 15, scope: !217)
!237 = !DILocation(line: 92, column: 2, scope: !217)
!238 = !DILocation(line: 89, column: 21, scope: !213)
!239 = !DILocation(line: 89, column: 2, scope: !213)
!240 = distinct !{!240, !215, !241}
!241 = !DILocation(line: 92, column: 2, scope: !210)
!242 = !DILocation(line: 93, column: 1, scope: !198)
!243 = distinct !DISubprogram(name: "min_ff", scope: !244, file: !244, line: 202, type: !245, scopeLine: 203, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !176)
!244 = !DIFile(filename: "blender/source/blender/blenlib/intern/math_base_inline.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!245 = !DISubroutineType(types: !246)
!246 = !{!133, !133, !133}
!247 = !DILocalVariable(name: "a", arg: 1, scope: !243, file: !244, line: 202, type: !133)
!248 = !DILocation(line: 202, column: 28, scope: !243)
!249 = !DILocalVariable(name: "b", arg: 2, scope: !243, file: !244, line: 202, type: !133)
!250 = !DILocation(line: 202, column: 37, scope: !243)
!251 = !DILocation(line: 204, column: 10, scope: !243)
!252 = !DILocation(line: 204, column: 14, scope: !243)
!253 = !DILocation(line: 204, column: 12, scope: !243)
!254 = !DILocation(line: 204, column: 9, scope: !243)
!255 = !DILocation(line: 204, column: 19, scope: !243)
!256 = !DILocation(line: 204, column: 23, scope: !243)
!257 = !DILocation(line: 204, column: 2, scope: !243)
!258 = distinct !DISubprogram(name: "max_ff", scope: !244, file: !244, line: 206, type: !245, scopeLine: 207, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !176)
!259 = !DILocalVariable(name: "a", arg: 1, scope: !258, file: !244, line: 206, type: !133)
!260 = !DILocation(line: 206, column: 28, scope: !258)
!261 = !DILocalVariable(name: "b", arg: 2, scope: !258, file: !244, line: 206, type: !133)
!262 = !DILocation(line: 206, column: 37, scope: !258)
!263 = !DILocation(line: 208, column: 10, scope: !258)
!264 = !DILocation(line: 208, column: 14, scope: !258)
!265 = !DILocation(line: 208, column: 12, scope: !258)
!266 = !DILocation(line: 208, column: 9, scope: !258)
!267 = !DILocation(line: 208, column: 19, scope: !258)
!268 = !DILocation(line: 208, column: 23, scope: !258)
!269 = !DILocation(line: 208, column: 2, scope: !258)
!270 = distinct !DISubprogram(name: "BB_expand_with_bb", scope: !1, file: !1, line: 96, type: !271, scopeLine: 97, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !176)
!271 = !DISubroutineType(types: !272)
!272 = !{null, !127, !127}
!273 = !DILocalVariable(name: "bb", arg: 1, scope: !270, file: !1, line: 96, type: !127)
!274 = !DILocation(line: 96, column: 28, scope: !270)
!275 = !DILocalVariable(name: "bb2", arg: 2, scope: !270, file: !1, line: 96, type: !127)
!276 = !DILocation(line: 96, column: 36, scope: !270)
!277 = !DILocalVariable(name: "i", scope: !270, file: !1, line: 98, type: !142)
!278 = !DILocation(line: 98, column: 6, scope: !270)
!279 = !DILocation(line: 99, column: 9, scope: !280)
!280 = distinct !DILexicalBlock(scope: !270, file: !1, line: 99, column: 2)
!281 = !DILocation(line: 99, column: 7, scope: !280)
!282 = !DILocation(line: 99, column: 14, scope: !283)
!283 = distinct !DILexicalBlock(scope: !280, file: !1, line: 99, column: 2)
!284 = !DILocation(line: 99, column: 16, scope: !283)
!285 = !DILocation(line: 99, column: 2, scope: !280)
!286 = !DILocation(line: 100, column: 24, scope: !287)
!287 = distinct !DILexicalBlock(scope: !283, file: !1, line: 99, column: 26)
!288 = !DILocation(line: 100, column: 28, scope: !287)
!289 = !DILocation(line: 100, column: 33, scope: !287)
!290 = !DILocation(line: 100, column: 37, scope: !287)
!291 = !DILocation(line: 100, column: 42, scope: !287)
!292 = !DILocation(line: 100, column: 47, scope: !287)
!293 = !DILocation(line: 100, column: 17, scope: !287)
!294 = !DILocation(line: 100, column: 3, scope: !287)
!295 = !DILocation(line: 100, column: 7, scope: !287)
!296 = !DILocation(line: 100, column: 12, scope: !287)
!297 = !DILocation(line: 100, column: 15, scope: !287)
!298 = !DILocation(line: 101, column: 24, scope: !287)
!299 = !DILocation(line: 101, column: 28, scope: !287)
!300 = !DILocation(line: 101, column: 33, scope: !287)
!301 = !DILocation(line: 101, column: 37, scope: !287)
!302 = !DILocation(line: 101, column: 42, scope: !287)
!303 = !DILocation(line: 101, column: 47, scope: !287)
!304 = !DILocation(line: 101, column: 17, scope: !287)
!305 = !DILocation(line: 101, column: 3, scope: !287)
!306 = !DILocation(line: 101, column: 7, scope: !287)
!307 = !DILocation(line: 101, column: 12, scope: !287)
!308 = !DILocation(line: 101, column: 15, scope: !287)
!309 = !DILocation(line: 102, column: 2, scope: !287)
!310 = !DILocation(line: 99, column: 21, scope: !283)
!311 = !DILocation(line: 99, column: 2, scope: !283)
!312 = distinct !{!312, !285, !313}
!313 = !DILocation(line: 102, column: 2, scope: !280)
!314 = !DILocation(line: 103, column: 1, scope: !270)
!315 = distinct !DISubprogram(name: "BB_widest_axis", scope: !1, file: !1, line: 106, type: !316, scopeLine: 107, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !176)
!316 = !DISubroutineType(types: !317)
!317 = !{!142, !318}
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!319 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !128)
!320 = !DILocalVariable(name: "bb", arg: 1, scope: !315, file: !1, line: 106, type: !318)
!321 = !DILocation(line: 106, column: 30, scope: !315)
!322 = !DILocalVariable(name: "dim", scope: !315, file: !1, line: 108, type: !132)
!323 = !DILocation(line: 108, column: 8, scope: !315)
!324 = !DILocalVariable(name: "i", scope: !315, file: !1, line: 109, type: !142)
!325 = !DILocation(line: 109, column: 6, scope: !315)
!326 = !DILocation(line: 111, column: 9, scope: !327)
!327 = distinct !DILexicalBlock(scope: !315, file: !1, line: 111, column: 2)
!328 = !DILocation(line: 111, column: 7, scope: !327)
!329 = !DILocation(line: 111, column: 14, scope: !330)
!330 = distinct !DILexicalBlock(scope: !327, file: !1, line: 111, column: 2)
!331 = !DILocation(line: 111, column: 16, scope: !330)
!332 = !DILocation(line: 111, column: 2, scope: !327)
!333 = !DILocation(line: 112, column: 12, scope: !330)
!334 = !DILocation(line: 112, column: 16, scope: !330)
!335 = !DILocation(line: 112, column: 21, scope: !330)
!336 = !DILocation(line: 112, column: 26, scope: !330)
!337 = !DILocation(line: 112, column: 30, scope: !330)
!338 = !DILocation(line: 112, column: 35, scope: !330)
!339 = !DILocation(line: 112, column: 24, scope: !330)
!340 = !DILocation(line: 112, column: 7, scope: !330)
!341 = !DILocation(line: 112, column: 3, scope: !330)
!342 = !DILocation(line: 112, column: 10, scope: !330)
!343 = !DILocation(line: 111, column: 21, scope: !330)
!344 = !DILocation(line: 111, column: 2, scope: !330)
!345 = distinct !{!345, !332, !346}
!346 = !DILocation(line: 112, column: 36, scope: !327)
!347 = !DILocation(line: 114, column: 6, scope: !348)
!348 = distinct !DILexicalBlock(scope: !315, file: !1, line: 114, column: 6)
!349 = !DILocation(line: 114, column: 15, scope: !348)
!350 = !DILocation(line: 114, column: 13, scope: !348)
!351 = !DILocation(line: 114, column: 6, scope: !315)
!352 = !DILocation(line: 115, column: 7, scope: !353)
!353 = distinct !DILexicalBlock(scope: !354, file: !1, line: 115, column: 7)
!354 = distinct !DILexicalBlock(scope: !348, file: !1, line: 114, column: 23)
!355 = !DILocation(line: 115, column: 16, scope: !353)
!356 = !DILocation(line: 115, column: 14, scope: !353)
!357 = !DILocation(line: 115, column: 7, scope: !354)
!358 = !DILocation(line: 116, column: 4, scope: !353)
!359 = !DILocation(line: 118, column: 4, scope: !353)
!360 = !DILocation(line: 121, column: 7, scope: !361)
!361 = distinct !DILexicalBlock(scope: !362, file: !1, line: 121, column: 7)
!362 = distinct !DILexicalBlock(scope: !348, file: !1, line: 120, column: 7)
!363 = !DILocation(line: 121, column: 16, scope: !361)
!364 = !DILocation(line: 121, column: 14, scope: !361)
!365 = !DILocation(line: 121, column: 7, scope: !362)
!366 = !DILocation(line: 122, column: 4, scope: !361)
!367 = !DILocation(line: 124, column: 4, scope: !361)
!368 = !DILocation(line: 126, column: 1, scope: !315)
!369 = distinct !DISubprogram(name: "BBC_update_centroid", scope: !1, file: !1, line: 128, type: !370, scopeLine: 129, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !176)
!370 = !DISubroutineType(types: !371)
!371 = !{null, !372}
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "BBC", file: !11, line: 36, baseType: !374)
!374 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !11, line: 34, size: 288, elements: !375)
!375 = !{!376, !377, !378}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "bmin", scope: !374, file: !11, line: 35, baseType: !132, size: 96)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "bmax", scope: !374, file: !11, line: 35, baseType: !132, size: 96, offset: 96)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "bcentroid", scope: !374, file: !11, line: 35, baseType: !132, size: 96, offset: 192)
!379 = !DILocalVariable(name: "bbc", arg: 1, scope: !369, file: !1, line: 128, type: !372)
!380 = !DILocation(line: 128, column: 31, scope: !369)
!381 = !DILocalVariable(name: "i", scope: !369, file: !1, line: 130, type: !142)
!382 = !DILocation(line: 130, column: 6, scope: !369)
!383 = !DILocation(line: 131, column: 9, scope: !384)
!384 = distinct !DILexicalBlock(scope: !369, file: !1, line: 131, column: 2)
!385 = !DILocation(line: 131, column: 7, scope: !384)
!386 = !DILocation(line: 131, column: 14, scope: !387)
!387 = distinct !DILexicalBlock(scope: !384, file: !1, line: 131, column: 2)
!388 = !DILocation(line: 131, column: 16, scope: !387)
!389 = !DILocation(line: 131, column: 2, scope: !384)
!390 = !DILocation(line: 132, column: 24, scope: !387)
!391 = !DILocation(line: 132, column: 29, scope: !387)
!392 = !DILocation(line: 132, column: 34, scope: !387)
!393 = !DILocation(line: 132, column: 39, scope: !387)
!394 = !DILocation(line: 132, column: 44, scope: !387)
!395 = !DILocation(line: 132, column: 49, scope: !387)
!396 = !DILocation(line: 132, column: 37, scope: !387)
!397 = !DILocation(line: 132, column: 53, scope: !387)
!398 = !DILocation(line: 132, column: 3, scope: !387)
!399 = !DILocation(line: 132, column: 8, scope: !387)
!400 = !DILocation(line: 132, column: 18, scope: !387)
!401 = !DILocation(line: 132, column: 21, scope: !387)
!402 = !DILocation(line: 131, column: 21, scope: !387)
!403 = !DILocation(line: 131, column: 2, scope: !387)
!404 = distinct !{!404, !389, !405}
!405 = !DILocation(line: 132, column: 55, scope: !384)
!406 = !DILocation(line: 133, column: 1, scope: !369)
!407 = distinct !DISubprogram(name: "pbvh_grow_nodes", scope: !1, file: !1, line: 233, type: !408, scopeLine: 234, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !176)
!408 = !DISubroutineType(types: !409)
!409 = !{null, !410, !142}
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "PBVH", file: !4, line: 46, baseType: !412)
!412 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PBVH", file: !11, line: 121, size: 1664, elements: !413)
!413 = !{!414, !416, !418, !464, !465, !466, !467, !468, !469, !470, !480, !492, !534, !548, !550, !558, !560, !568, !569, !571, !572, !574, !575, !735, !736, !737, !738, !739}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !412, file: !11, line: 122, baseType: !415, size: 32)
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "PBVHType", file: !4, line: 122, baseType: !3)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !412, file: !11, line: 123, baseType: !417, size: 32, offset: 32)
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "PBVHFlags", file: !11, line: 117, baseType: !10)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !412, file: !11, line: 125, baseType: !419, size: 64, offset: 64)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64)
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "PBVHNode", file: !4, line: 47, baseType: !421)
!421 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PBVHNode", file: !11, line: 40, size: 1472, elements: !422)
!422 = !{!423, !427, !428, !429, !430, !432, !433, !434, !435, !436, !441, !443, !444, !445, !446, !453, !457, !458, !459, !460, !463}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "draw_buffers", scope: !421, file: !11, line: 42, baseType: !424, size: 64)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!425 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPU_PBVH_Buffers", file: !426, line: 168, flags: DIFlagFwdDecl)
!426 = !DIFile(filename: "blender/source/blender/gpu/GPU_buffers.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!427 = !DIDerivedType(tag: DW_TAG_member, name: "vb", scope: !421, file: !11, line: 45, baseType: !128, size: 192, offset: 64)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "orig_vb", scope: !421, file: !11, line: 46, baseType: !128, size: 192, offset: 256)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "children_offset", scope: !421, file: !11, line: 50, baseType: !142, size: 32, offset: 448)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "prim_indices", scope: !421, file: !11, line: 57, baseType: !431, size: 64, offset: 512)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "totprim", scope: !421, file: !11, line: 58, baseType: !5, size: 32, offset: 576)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "vert_indices", scope: !421, file: !11, line: 79, baseType: !431, size: 64, offset: 640)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "uniq_verts", scope: !421, file: !11, line: 80, baseType: !5, size: 32, offset: 704)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "face_verts", scope: !421, file: !11, line: 80, baseType: !5, size: 32, offset: 736)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "face_vert_indices", scope: !421, file: !11, line: 91, baseType: !437, size: 64, offset: 768)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = !DICompositeType(tag: DW_TAG_array_type, baseType: !142, size: 128, elements: !439)
!439 = !{!440}
!440 = !DISubrange(count: 4)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !421, file: !11, line: 95, baseType: !442, size: 16, offset: 832, flags: DIFlagBitField, extraData: i64 832)
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "PBVHNodeFlags", file: !4, line: 165, baseType: !14)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "tmin", scope: !421, file: !11, line: 98, baseType: !133, size: 32, offset: 864)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "layer_disp", scope: !421, file: !11, line: 101, baseType: !141, size: 64, offset: 896)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_count", scope: !421, file: !11, line: 103, baseType: !142, size: 32, offset: 960)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "proxies", scope: !421, file: !11, line: 104, baseType: !447, size: 64, offset: 1024)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64)
!448 = !DIDerivedType(tag: DW_TAG_typedef, name: "PBVHProxyNode", file: !4, line: 51, baseType: !449)
!449 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 49, size: 64, elements: !450)
!450 = !{!451}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !449, file: !4, line: 50, baseType: !452, size: 64)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "bm_faces", scope: !421, file: !11, line: 107, baseType: !454, size: 64, offset: 1088)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64)
!455 = !DIDerivedType(tag: DW_TAG_typedef, name: "GSet", file: !145, line: 176, baseType: !456)
!456 = !DICompositeType(tag: DW_TAG_structure_type, name: "GSet", file: !145, line: 176, flags: DIFlagFwdDecl)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "bm_unique_verts", scope: !421, file: !11, line: 108, baseType: !454, size: 64, offset: 1152)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "bm_other_verts", scope: !421, file: !11, line: 109, baseType: !454, size: 64, offset: 1216)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "bm_orco", scope: !421, file: !11, line: 110, baseType: !452, size: 64, offset: 1280)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "bm_ortri", scope: !421, file: !11, line: 111, baseType: !461, size: 64, offset: 1344)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!462 = !DICompositeType(tag: DW_TAG_array_type, baseType: !142, size: 96, elements: !134)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "bm_tot_ortri", scope: !421, file: !11, line: 112, baseType: !142, size: 32, offset: 1408)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "node_mem_count", scope: !412, file: !11, line: 126, baseType: !142, size: 32, offset: 128)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "totnode", scope: !412, file: !11, line: 126, baseType: !142, size: 32, offset: 160)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "prim_indices", scope: !412, file: !11, line: 128, baseType: !431, size: 64, offset: 192)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "totprim", scope: !412, file: !11, line: 129, baseType: !142, size: 32, offset: 256)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "totvert", scope: !412, file: !11, line: 130, baseType: !142, size: 32, offset: 288)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "leaf_limit", scope: !412, file: !11, line: 132, baseType: !142, size: 32, offset: 320)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "verts", scope: !412, file: !11, line: 135, baseType: !471, size: 64, offset: 384)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64)
!472 = !DIDerivedType(tag: DW_TAG_typedef, name: "MVert", file: !69, line: 69, baseType: !473)
!473 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MVert", file: !69, line: 65, size: 160, elements: !474)
!474 = !{!475, !476, !478, !479}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !473, file: !69, line: 66, baseType: !132, size: 96)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !473, file: !69, line: 67, baseType: !477, size: 48, offset: 96)
!477 = !DICompositeType(tag: DW_TAG_array_type, baseType: !156, size: 48, elements: !134)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !473, file: !69, line: 68, baseType: !155, size: 8, offset: 144)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "bweight", scope: !473, file: !69, line: 68, baseType: !155, size: 8, offset: 152)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "faces", scope: !412, file: !11, line: 136, baseType: !481, size: 64, offset: 448)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64)
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "MFace", file: !69, line: 46, baseType: !483)
!483 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MFace", file: !69, line: 42, size: 160, elements: !484)
!484 = !{!485, !486, !487, !488, !489, !490, !491}
!485 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !483, file: !69, line: 43, baseType: !5, size: 32)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !483, file: !69, line: 43, baseType: !5, size: 32, offset: 32)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !483, file: !69, line: 43, baseType: !5, size: 32, offset: 64)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !483, file: !69, line: 43, baseType: !5, size: 32, offset: 96)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !483, file: !69, line: 44, baseType: !156, size: 16, offset: 128)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "edcode", scope: !483, file: !69, line: 45, baseType: !155, size: 8, offset: 144)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !483, file: !69, line: 45, baseType: !155, size: 8, offset: 152)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !412, file: !11, line: 137, baseType: !493, size: 64, offset: 512)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64)
!494 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomData", file: !76, line: 73, baseType: !495)
!495 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomData", file: !76, line: 64, size: 1600, elements: !496)
!496 = !{!497, !515, !519, !520, !521, !522, !525}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !495, file: !76, line: 65, baseType: !498, size: 64)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64)
!499 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataLayer", file: !76, line: 53, baseType: !500)
!500 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataLayer", file: !76, line: 42, size: 832, elements: !501)
!501 = !{!502, !503, !504, !505, !506, !507, !508, !509, !510, !514}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !500, file: !76, line: 43, baseType: !142, size: 32)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !500, file: !76, line: 44, baseType: !142, size: 32, offset: 32)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !500, file: !76, line: 45, baseType: !142, size: 32, offset: 64)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !500, file: !76, line: 46, baseType: !142, size: 32, offset: 96)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "active_rnd", scope: !500, file: !76, line: 47, baseType: !142, size: 32, offset: 128)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "active_clone", scope: !500, file: !76, line: 48, baseType: !142, size: 32, offset: 160)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "active_mask", scope: !500, file: !76, line: 49, baseType: !142, size: 32, offset: 192)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !500, file: !76, line: 50, baseType: !142, size: 32, offset: 224)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !500, file: !76, line: 51, baseType: !511, size: 512, offset: 256)
!511 = !DICompositeType(tag: DW_TAG_array_type, baseType: !155, size: 512, elements: !512)
!512 = !{!513}
!513 = !DISubrange(count: 64)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !500, file: !76, line: 52, baseType: !137, size: 64, offset: 768)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "typemap", scope: !495, file: !76, line: 66, baseType: !516, size: 1312, offset: 64)
!516 = !DICompositeType(tag: DW_TAG_array_type, baseType: !142, size: 1312, elements: !517)
!517 = !{!518}
!518 = !DISubrange(count: 41)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "totlayer", scope: !495, file: !76, line: 69, baseType: !142, size: 32, offset: 1376)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "maxlayer", scope: !495, file: !76, line: 69, baseType: !142, size: 32, offset: 1408)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "totsize", scope: !495, file: !76, line: 70, baseType: !142, size: 32, offset: 1440)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !495, file: !76, line: 71, baseType: !523, size: 64, offset: 1472)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 64)
!524 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool", file: !76, line: 71, flags: DIFlagFwdDecl)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !495, file: !76, line: 72, baseType: !526, size: 64, offset: 1536)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64)
!527 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataExternal", file: !76, line: 59, baseType: !528)
!528 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataExternal", file: !76, line: 57, size: 8192, elements: !529)
!529 = !{!530}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !528, file: !76, line: 58, baseType: !531, size: 8192)
!531 = !DICompositeType(tag: DW_TAG_array_type, baseType: !155, size: 8192, elements: !532)
!532 = !{!533}
!533 = !DISubrange(count: 1024)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "gridkey", scope: !412, file: !11, line: 140, baseType: !535, size: 320, offset: 576)
!535 = !DIDerivedType(tag: DW_TAG_typedef, name: "CCGKey", file: !152, line: 78, baseType: !536)
!536 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CCGKey", file: !152, line: 53, size: 320, elements: !537)
!537 = !{!538, !539, !540, !541, !542, !543, !544, !545, !546, !547}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !536, file: !152, line: 54, baseType: !142, size: 32)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "elem_size", scope: !536, file: !152, line: 58, baseType: !142, size: 32, offset: 32)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "grid_size", scope: !536, file: !152, line: 61, baseType: !142, size: 32, offset: 64)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "grid_area", scope: !536, file: !152, line: 63, baseType: !142, size: 32, offset: 96)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "grid_bytes", scope: !536, file: !152, line: 65, baseType: !142, size: 32, offset: 128)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "normal_offset", scope: !536, file: !152, line: 69, baseType: !142, size: 32, offset: 160)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "mask_offset", scope: !536, file: !152, line: 73, baseType: !142, size: 32, offset: 192)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "num_layers", scope: !536, file: !152, line: 75, baseType: !142, size: 32, offset: 224)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "has_normals", scope: !536, file: !152, line: 76, baseType: !142, size: 32, offset: 256)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "has_mask", scope: !536, file: !152, line: 77, baseType: !142, size: 32, offset: 288)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "grids", scope: !412, file: !11, line: 141, baseType: !549, size: 64, offset: 896)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "gridadj", scope: !412, file: !11, line: 142, baseType: !551, size: 64, offset: 960)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64)
!552 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMGridAdjacency", file: !553, line: 120, baseType: !554)
!553 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_DerivedMesh.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!554 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DMGridAdjacency", file: !553, line: 117, size: 256, elements: !555)
!555 = !{!556, !557}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !554, file: !553, line: 118, baseType: !438, size: 128)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "rotation", scope: !554, file: !553, line: 119, baseType: !438, size: 128, offset: 128)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "gridfaces", scope: !412, file: !11, line: 143, baseType: !559, size: 64, offset: 1024)
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "grid_flag_mats", scope: !412, file: !11, line: 144, baseType: !561, size: 64, offset: 1088)
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64)
!562 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !563)
!563 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMFlagMat", file: !553, line: 126, baseType: !564)
!564 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DMFlagMat", file: !553, line: 123, size: 32, elements: !565)
!565 = !{!566, !567}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !564, file: !553, line: 124, baseType: !156, size: 16)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !564, file: !553, line: 125, baseType: !155, size: 8, offset: 16)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "totgrid", scope: !412, file: !11, line: 145, baseType: !142, size: 32, offset: 1152)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "grid_hidden", scope: !412, file: !11, line: 146, baseType: !570, size: 64, offset: 1216)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "vert_bitmap", scope: !412, file: !11, line: 150, baseType: !124, size: 64, offset: 1280)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "deformed", scope: !412, file: !11, line: 157, baseType: !573, size: 8, offset: 1344)
!573 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "show_diffuse_color", scope: !412, file: !11, line: 159, baseType: !573, size: 8, offset: 1352)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "bm", scope: !412, file: !11, line: 162, baseType: !576, size: 64, offset: 1408)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64)
!577 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMesh", file: !578, line: 246, baseType: !579)
!578 = !DIFile(filename: "blender/source/blender/bmesh/bmesh_class.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!579 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMesh", file: !578, line: 186, size: 8064, elements: !580)
!580 = !{!581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !655, !659, !663, !664, !665, !666, !667, !668, !669, !670, !717, !718, !719, !720, !721, !722, !723, !724, !725, !732, !733, !734}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "totvert", scope: !579, file: !578, line: 187, baseType: !142, size: 32)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "totedge", scope: !579, file: !578, line: 187, baseType: !142, size: 32, offset: 32)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !579, file: !578, line: 187, baseType: !142, size: 32, offset: 64)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "totface", scope: !579, file: !578, line: 187, baseType: !142, size: 32, offset: 96)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "totvertsel", scope: !579, file: !578, line: 188, baseType: !142, size: 32, offset: 128)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "totedgesel", scope: !579, file: !578, line: 188, baseType: !142, size: 32, offset: 160)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "totfacesel", scope: !579, file: !578, line: 188, baseType: !142, size: 32, offset: 192)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "elem_index_dirty", scope: !579, file: !578, line: 193, baseType: !155, size: 8, offset: 224)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "elem_table_dirty", scope: !579, file: !578, line: 197, baseType: !155, size: 8, offset: 232)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "vpool", scope: !579, file: !578, line: 201, baseType: !523, size: 64, offset: 256)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "epool", scope: !579, file: !578, line: 201, baseType: !523, size: 64, offset: 320)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "lpool", scope: !579, file: !578, line: 201, baseType: !523, size: 64, offset: 384)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "fpool", scope: !579, file: !578, line: 201, baseType: !523, size: 64, offset: 448)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !579, file: !578, line: 208, baseType: !595, size: 64, offset: 512)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64)
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 64)
!597 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMVert", file: !578, line: 103, baseType: !598)
!598 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMVert", file: !578, line: 90, size: 448, elements: !599)
!599 = !{!600, !609, !614, !615, !616}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !598, file: !578, line: 91, baseType: !601, size: 128)
!601 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMHeader", file: !578, line: 82, baseType: !602)
!602 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMHeader", file: !578, line: 64, size: 128, elements: !603)
!603 = !{!604, !605, !606, !607, !608}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !602, file: !578, line: 65, baseType: !137, size: 64)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !602, file: !578, line: 66, baseType: !142, size: 32, offset: 64)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !602, file: !578, line: 73, baseType: !155, size: 8, offset: 96)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "hflag", scope: !602, file: !578, line: 74, baseType: !155, size: 8, offset: 104)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "api_flag", scope: !602, file: !578, line: 80, baseType: !155, size: 8, offset: 112)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !598, file: !578, line: 92, baseType: !610, size: 64, offset: 128)
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64)
!611 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFlagLayer", file: !578, line: 180, size: 16, elements: !612)
!612 = !{!613}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !611, file: !578, line: 181, baseType: !156, size: 16)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !598, file: !578, line: 94, baseType: !132, size: 96, offset: 192)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !598, file: !578, line: 95, baseType: !132, size: 96, offset: 288)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !598, file: !578, line: 102, baseType: !617, size: 64, offset: 384)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64)
!618 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMEdge", file: !578, line: 110, size: 640, elements: !619)
!619 = !{!620, !621, !622, !624, !625, !648, !654}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !618, file: !578, line: 111, baseType: !601, size: 128)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !618, file: !578, line: 112, baseType: !610, size: 64, offset: 128)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !618, file: !578, line: 114, baseType: !623, size: 64, offset: 192)
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 64)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !618, file: !578, line: 114, baseType: !623, size: 64, offset: 256)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !618, file: !578, line: 118, baseType: !626, size: 64, offset: 320)
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 64)
!627 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMLoop", file: !578, line: 125, size: 576, elements: !628)
!628 = !{!629, !630, !631, !632, !644, !645, !646, !647}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !627, file: !578, line: 126, baseType: !601, size: 128)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !627, file: !578, line: 129, baseType: !623, size: 64, offset: 128)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !627, file: !578, line: 130, baseType: !617, size: 64, offset: 192)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !627, file: !578, line: 131, baseType: !633, size: 64, offset: 256)
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 64)
!634 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFace", file: !578, line: 164, size: 448, elements: !635)
!635 = !{!636, !637, !638, !641, !642, !643}
!636 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !634, file: !578, line: 165, baseType: !601, size: 128)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !634, file: !578, line: 166, baseType: !610, size: 64, offset: 128)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !634, file: !578, line: 172, baseType: !639, size: 64, offset: 192)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64)
!640 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMLoop", file: !578, line: 140, baseType: !627)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !634, file: !578, line: 174, baseType: !142, size: 32, offset: 256)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !634, file: !578, line: 175, baseType: !132, size: 96, offset: 288)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !634, file: !578, line: 176, baseType: !156, size: 16, offset: 384)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "radial_next", scope: !627, file: !578, line: 135, baseType: !626, size: 64, offset: 320)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "radial_prev", scope: !627, file: !578, line: 135, baseType: !626, size: 64, offset: 384)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !627, file: !578, line: 139, baseType: !626, size: 64, offset: 448)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !627, file: !578, line: 139, baseType: !626, size: 64, offset: 512)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "v1_disk_link", scope: !618, file: !578, line: 122, baseType: !649, size: 128, offset: 384)
!649 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMDiskLink", file: !578, line: 108, baseType: !650)
!650 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMDiskLink", file: !578, line: 106, size: 128, elements: !651)
!651 = !{!652, !653}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !650, file: !578, line: 107, baseType: !617, size: 64)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !650, file: !578, line: 107, baseType: !617, size: 64, offset: 64)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "v2_disk_link", scope: !618, file: !578, line: 122, baseType: !649, size: 128, offset: 512)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "etable", scope: !579, file: !578, line: 209, baseType: !656, size: 64, offset: 576)
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 64)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64)
!658 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMEdge", file: !578, line: 123, baseType: !618)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "ftable", scope: !579, file: !578, line: 210, baseType: !660, size: 64, offset: 640)
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 64)
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !662, size: 64)
!662 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMFace", file: !578, line: 178, baseType: !634)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "vtable_tot", scope: !579, file: !578, line: 213, baseType: !142, size: 32, offset: 704)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "etable_tot", scope: !579, file: !578, line: 214, baseType: !142, size: 32, offset: 736)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "ftable_tot", scope: !579, file: !578, line: 215, baseType: !142, size: 32, offset: 768)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "vtoolflagpool", scope: !579, file: !578, line: 218, baseType: !523, size: 64, offset: 832)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "etoolflagpool", scope: !579, file: !578, line: 218, baseType: !523, size: 64, offset: 896)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "ftoolflagpool", scope: !579, file: !578, line: 218, baseType: !523, size: 64, offset: 960)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "stackdepth", scope: !579, file: !578, line: 220, baseType: !142, size: 32, offset: 1024)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "currentop", scope: !579, file: !578, line: 221, baseType: !671, size: 64, offset: 1088)
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 64)
!672 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOperator", file: !26, line: 190, size: 10496, elements: !673)
!673 = !{!674, !705, !706, !710, !713, !714, !716}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "slots_in", scope: !672, file: !26, line: 191, baseType: !675, size: 5120)
!675 = !DICompositeType(tag: DW_TAG_array_type, baseType: !676, size: 5120, elements: !703)
!676 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOpSlot", file: !26, line: 147, size: 320, elements: !677)
!677 = !{!678, !681, !683, !693, !694}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "slot_name", scope: !676, file: !26, line: 148, baseType: !679, size: 64)
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 64)
!680 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !155)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "slot_type", scope: !676, file: !26, line: 149, baseType: !682, size: 32, offset: 64)
!682 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotType", file: !26, line: 112, baseType: !25)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "slot_subtype", scope: !676, file: !26, line: 150, baseType: !684, size: 32, offset: 96)
!684 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Union", file: !26, line: 142, baseType: !685)
!685 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eBMOpSlotSubType_Union", file: !26, line: 138, size: 32, elements: !686)
!686 = !{!687, !689, !691}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !685, file: !26, line: 139, baseType: !688, size: 32)
!688 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Elem", file: !26, line: 122, baseType: !36)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !685, file: !26, line: 140, baseType: !690, size: 32)
!690 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Ptr", file: !26, line: 136, baseType: !42)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !685, file: !26, line: 141, baseType: !692, size: 32)
!692 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Map", file: !26, line: 130, baseType: !48)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !676, file: !26, line: 152, baseType: !142, size: 32, offset: 128)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !676, file: !26, line: 162, baseType: !695, size: 128, offset: 192)
!695 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !676, file: !26, line: 155, size: 128, elements: !696)
!696 = !{!697, !698, !699, !700, !701, !702}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !695, file: !26, line: 156, baseType: !142, size: 32)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !695, file: !26, line: 157, baseType: !133, size: 32)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !695, file: !26, line: 158, baseType: !137, size: 64)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !695, file: !26, line: 159, baseType: !132, size: 96)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !695, file: !26, line: 160, baseType: !559, size: 64)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "ghash", scope: !695, file: !26, line: 161, baseType: !162, size: 64)
!703 = !{!704}
!704 = !DISubrange(count: 16)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "slots_out", scope: !672, file: !26, line: 192, baseType: !675, size: 5120, offset: 5120)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !672, file: !26, line: 193, baseType: !707, size: 64, offset: 10240)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 64)
!708 = !DISubroutineType(types: !709)
!709 = !{null, !576, !671}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "arena", scope: !672, file: !26, line: 194, baseType: !711, size: 64, offset: 10304)
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 64)
!712 = !DICompositeType(tag: DW_TAG_structure_type, name: "MemArena", file: !26, line: 194, flags: DIFlagFwdDecl)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !672, file: !26, line: 195, baseType: !142, size: 32, offset: 10368)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "type_flag", scope: !672, file: !26, line: 196, baseType: !715, size: 32, offset: 10400)
!715 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMOpTypeFlag", file: !26, line: 188, baseType: !56)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !672, file: !26, line: 197, baseType: !142, size: 32, offset: 10432)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !579, file: !578, line: 223, baseType: !494, size: 1600, offset: 1152)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !579, file: !578, line: 223, baseType: !494, size: 1600, offset: 2752)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "ldata", scope: !579, file: !578, line: 223, baseType: !494, size: 1600, offset: 4352)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !579, file: !578, line: 223, baseType: !494, size: 1600, offset: 5952)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !579, file: !578, line: 233, baseType: !156, size: 16, offset: 7552)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !579, file: !578, line: 236, baseType: !142, size: 32, offset: 7584)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "walkers", scope: !579, file: !578, line: 238, baseType: !142, size: 32, offset: 7616)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "totflags", scope: !579, file: !578, line: 238, baseType: !142, size: 32, offset: 7648)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "selected", scope: !579, file: !578, line: 239, baseType: !726, size: 128, offset: 7680)
!726 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !727, line: 71, baseType: !728)
!727 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!728 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !727, line: 69, size: 128, elements: !729)
!729 = !{!730, !731}
!730 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !728, file: !727, line: 70, baseType: !137, size: 64)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !728, file: !727, line: 70, baseType: !137, size: 64, offset: 64)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "act_face", scope: !579, file: !578, line: 241, baseType: !661, size: 64, offset: 7808)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "errorstack", scope: !579, file: !578, line: 243, baseType: !726, size: 128, offset: 7872)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "py_handle", scope: !579, file: !578, line: 245, baseType: !137, size: 64, offset: 8000)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "bm_max_edge_len", scope: !412, file: !11, line: 163, baseType: !133, size: 32, offset: 1472)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "bm_min_edge_len", scope: !412, file: !11, line: 164, baseType: !133, size: 32, offset: 1504)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "cd_vert_node_offset", scope: !412, file: !11, line: 165, baseType: !142, size: 32, offset: 1536)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "cd_face_node_offset", scope: !412, file: !11, line: 166, baseType: !142, size: 32, offset: 1568)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "bm_log", scope: !412, file: !11, line: 168, baseType: !740, size: 64, offset: 1600)
!740 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !741, size: 64)
!741 = !DICompositeType(tag: DW_TAG_structure_type, name: "BMLog", file: !4, line: 44, flags: DIFlagFwdDecl)
!742 = !DILocalVariable(name: "bvh", arg: 1, scope: !407, file: !1, line: 233, type: !410)
!743 = !DILocation(line: 233, column: 28, scope: !407)
!744 = !DILocalVariable(name: "totnode", arg: 2, scope: !407, file: !1, line: 233, type: !142)
!745 = !DILocation(line: 233, column: 37, scope: !407)
!746 = !DILocation(line: 235, column: 6, scope: !747)
!747 = distinct !DILexicalBlock(scope: !407, file: !1, line: 235, column: 6)
!748 = !DILocation(line: 235, column: 16, scope: !747)
!749 = !DILocation(line: 235, column: 21, scope: !747)
!750 = !DILocation(line: 235, column: 14, scope: !747)
!751 = !DILocation(line: 235, column: 6, scope: !407)
!752 = !DILocalVariable(name: "prev", scope: !753, file: !1, line: 236, type: !419)
!753 = distinct !DILexicalBlock(scope: !747, file: !1, line: 235, column: 37)
!754 = !DILocation(line: 236, column: 13, scope: !753)
!755 = !DILocation(line: 236, column: 20, scope: !753)
!756 = !DILocation(line: 236, column: 25, scope: !753)
!757 = !DILocation(line: 237, column: 3, scope: !753)
!758 = !DILocation(line: 237, column: 8, scope: !753)
!759 = !DILocation(line: 237, column: 23, scope: !753)
!760 = !DILocation(line: 238, column: 7, scope: !761)
!761 = distinct !DILexicalBlock(scope: !753, file: !1, line: 238, column: 7)
!762 = !DILocation(line: 238, column: 12, scope: !761)
!763 = !DILocation(line: 238, column: 29, scope: !761)
!764 = !DILocation(line: 238, column: 27, scope: !761)
!765 = !DILocation(line: 238, column: 7, scope: !753)
!766 = !DILocation(line: 239, column: 26, scope: !761)
!767 = !DILocation(line: 239, column: 4, scope: !761)
!768 = !DILocation(line: 239, column: 9, scope: !761)
!769 = !DILocation(line: 239, column: 24, scope: !761)
!770 = !DILocation(line: 240, column: 16, scope: !753)
!771 = !DILocation(line: 240, column: 47, scope: !753)
!772 = !DILocation(line: 240, column: 52, scope: !753)
!773 = !DILocation(line: 240, column: 45, scope: !753)
!774 = !DILocation(line: 240, column: 3, scope: !753)
!775 = !DILocation(line: 240, column: 8, scope: !753)
!776 = !DILocation(line: 240, column: 14, scope: !753)
!777 = !DILocation(line: 242, column: 10, scope: !753)
!778 = !DILocation(line: 242, column: 15, scope: !753)
!779 = !DILocation(line: 242, column: 3, scope: !753)
!780 = !DILocation(line: 242, column: 22, scope: !753)
!781 = !DILocation(line: 242, column: 28, scope: !753)
!782 = !DILocation(line: 242, column: 33, scope: !753)
!783 = !DILocation(line: 242, column: 41, scope: !753)
!784 = !DILocation(line: 243, column: 10, scope: !753)
!785 = !DILocation(line: 243, column: 15, scope: !753)
!786 = !DILocation(line: 243, column: 23, scope: !753)
!787 = !DILocation(line: 243, column: 28, scope: !753)
!788 = !DILocation(line: 243, column: 21, scope: !753)
!789 = !DILocation(line: 243, column: 3, scope: !753)
!790 = !DILocation(line: 243, column: 41, scope: !753)
!791 = !DILocation(line: 243, column: 46, scope: !753)
!792 = !DILocation(line: 243, column: 63, scope: !753)
!793 = !DILocation(line: 243, column: 68, scope: !753)
!794 = !DILocation(line: 243, column: 61, scope: !753)
!795 = !DILocation(line: 243, column: 40, scope: !753)
!796 = !DILocation(line: 243, column: 77, scope: !753)
!797 = !DILocation(line: 244, column: 3, scope: !753)
!798 = !DILocation(line: 244, column: 13, scope: !753)
!799 = !DILocation(line: 245, column: 2, scope: !753)
!800 = !DILocation(line: 247, column: 17, scope: !407)
!801 = !DILocation(line: 247, column: 2, scope: !407)
!802 = !DILocation(line: 247, column: 7, scope: !407)
!803 = !DILocation(line: 247, column: 15, scope: !407)
!804 = !DILocation(line: 248, column: 1, scope: !407)
!805 = distinct !DISubprogram(name: "BKE_pbvh_count_grid_quads", scope: !1, file: !1, line: 365, type: !806, scopeLine: 368, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !176)
!806 = !DISubroutineType(types: !807)
!807 = !{!142, !570, !431, !142, !142}
!808 = !DILocalVariable(name: "grid_hidden", arg: 1, scope: !805, file: !1, line: 365, type: !570)
!809 = !DILocation(line: 365, column: 44, scope: !805)
!810 = !DILocalVariable(name: "grid_indices", arg: 2, scope: !805, file: !1, line: 366, type: !431)
!811 = !DILocation(line: 366, column: 36, scope: !805)
!812 = !DILocalVariable(name: "totgrid", arg: 3, scope: !805, file: !1, line: 366, type: !142)
!813 = !DILocation(line: 366, column: 54, scope: !805)
!814 = !DILocalVariable(name: "gridsize", arg: 4, scope: !805, file: !1, line: 367, type: !142)
!815 = !DILocation(line: 367, column: 35, scope: !805)
!816 = !DILocalVariable(name: "gridarea", scope: !805, file: !1, line: 369, type: !142)
!817 = !DILocation(line: 369, column: 6, scope: !805)
!818 = !DILocation(line: 369, column: 18, scope: !805)
!819 = !DILocation(line: 369, column: 27, scope: !805)
!820 = !DILocation(line: 369, column: 35, scope: !805)
!821 = !DILocation(line: 369, column: 44, scope: !805)
!822 = !DILocation(line: 369, column: 32, scope: !805)
!823 = !DILocalVariable(name: "i", scope: !805, file: !1, line: 370, type: !142)
!824 = !DILocation(line: 370, column: 6, scope: !805)
!825 = !DILocalVariable(name: "x", scope: !805, file: !1, line: 370, type: !142)
!826 = !DILocation(line: 370, column: 9, scope: !805)
!827 = !DILocalVariable(name: "y", scope: !805, file: !1, line: 370, type: !142)
!828 = !DILocation(line: 370, column: 12, scope: !805)
!829 = !DILocalVariable(name: "totquad", scope: !805, file: !1, line: 370, type: !142)
!830 = !DILocation(line: 370, column: 15, scope: !805)
!831 = !DILocation(line: 375, column: 9, scope: !832)
!832 = distinct !DILexicalBlock(scope: !805, file: !1, line: 375, column: 2)
!833 = !DILocation(line: 375, column: 22, scope: !832)
!834 = !DILocation(line: 375, column: 7, scope: !832)
!835 = !DILocation(line: 375, column: 27, scope: !836)
!836 = distinct !DILexicalBlock(scope: !832, file: !1, line: 375, column: 2)
!837 = !DILocation(line: 375, column: 31, scope: !836)
!838 = !DILocation(line: 375, column: 29, scope: !836)
!839 = !DILocation(line: 375, column: 2, scope: !832)
!840 = !DILocalVariable(name: "gh", scope: !841, file: !1, line: 376, type: !842)
!841 = distinct !DILexicalBlock(scope: !836, file: !1, line: 375, column: 45)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 64)
!843 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !125)
!844 = !DILocation(line: 376, column: 21, scope: !841)
!845 = !DILocation(line: 376, column: 26, scope: !841)
!846 = !DILocation(line: 376, column: 38, scope: !841)
!847 = !DILocation(line: 376, column: 51, scope: !841)
!848 = !DILocation(line: 378, column: 7, scope: !849)
!849 = distinct !DILexicalBlock(scope: !841, file: !1, line: 378, column: 7)
!850 = !DILocation(line: 378, column: 7, scope: !841)
!851 = !DILocation(line: 380, column: 11, scope: !852)
!852 = distinct !DILexicalBlock(scope: !853, file: !1, line: 380, column: 4)
!853 = distinct !DILexicalBlock(scope: !849, file: !1, line: 378, column: 11)
!854 = !DILocation(line: 380, column: 9, scope: !852)
!855 = !DILocation(line: 380, column: 16, scope: !856)
!856 = distinct !DILexicalBlock(scope: !852, file: !1, line: 380, column: 4)
!857 = !DILocation(line: 380, column: 20, scope: !856)
!858 = !DILocation(line: 380, column: 29, scope: !856)
!859 = !DILocation(line: 380, column: 18, scope: !856)
!860 = !DILocation(line: 380, column: 4, scope: !852)
!861 = !DILocation(line: 381, column: 12, scope: !862)
!862 = distinct !DILexicalBlock(scope: !863, file: !1, line: 381, column: 5)
!863 = distinct !DILexicalBlock(scope: !856, file: !1, line: 380, column: 39)
!864 = !DILocation(line: 381, column: 10, scope: !862)
!865 = !DILocation(line: 381, column: 17, scope: !866)
!866 = distinct !DILexicalBlock(scope: !862, file: !1, line: 381, column: 5)
!867 = !DILocation(line: 381, column: 21, scope: !866)
!868 = !DILocation(line: 381, column: 30, scope: !866)
!869 = !DILocation(line: 381, column: 19, scope: !866)
!870 = !DILocation(line: 381, column: 5, scope: !862)
!871 = !DILocation(line: 382, column: 37, scope: !872)
!872 = distinct !DILexicalBlock(scope: !873, file: !1, line: 382, column: 10)
!873 = distinct !DILexicalBlock(scope: !866, file: !1, line: 381, column: 40)
!874 = !DILocation(line: 382, column: 41, scope: !872)
!875 = !DILocation(line: 382, column: 51, scope: !872)
!876 = !DILocation(line: 382, column: 54, scope: !872)
!877 = !DILocation(line: 382, column: 11, scope: !872)
!878 = !DILocation(line: 382, column: 10, scope: !873)
!879 = !DILocation(line: 383, column: 14, scope: !872)
!880 = !DILocation(line: 383, column: 7, scope: !872)
!881 = !DILocation(line: 384, column: 5, scope: !873)
!882 = !DILocation(line: 381, column: 36, scope: !866)
!883 = !DILocation(line: 381, column: 5, scope: !866)
!884 = distinct !{!884, !870, !885}
!885 = !DILocation(line: 384, column: 5, scope: !862)
!886 = !DILocation(line: 385, column: 4, scope: !863)
!887 = !DILocation(line: 380, column: 35, scope: !856)
!888 = !DILocation(line: 380, column: 4, scope: !856)
!889 = distinct !{!889, !860, !890}
!890 = !DILocation(line: 385, column: 4, scope: !852)
!891 = !DILocation(line: 386, column: 3, scope: !853)
!892 = !DILocation(line: 388, column: 15, scope: !849)
!893 = !DILocation(line: 388, column: 12, scope: !849)
!894 = !DILocation(line: 389, column: 2, scope: !841)
!895 = !DILocation(line: 375, column: 41, scope: !836)
!896 = !DILocation(line: 375, column: 2, scope: !836)
!897 = distinct !{!897, !839, !898}
!898 = !DILocation(line: 389, column: 2, scope: !832)
!899 = !DILocation(line: 391, column: 9, scope: !805)
!900 = !DILocation(line: 391, column: 2, scope: !805)
!901 = distinct !DISubprogram(name: "BKE_pbvh_build_mesh", scope: !1, file: !1, line: 541, type: !902, scopeLine: 542, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !176)
!902 = !DISubroutineType(types: !903)
!903 = !{null, !410, !481, !471, !142, !142, !904}
!904 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64)
!905 = !DILocalVariable(name: "bvh", arg: 1, scope: !901, file: !1, line: 541, type: !410)
!906 = !DILocation(line: 541, column: 32, scope: !901)
!907 = !DILocalVariable(name: "faces", arg: 2, scope: !901, file: !1, line: 541, type: !481)
!908 = !DILocation(line: 541, column: 44, scope: !901)
!909 = !DILocalVariable(name: "verts", arg: 3, scope: !901, file: !1, line: 541, type: !471)
!910 = !DILocation(line: 541, column: 58, scope: !901)
!911 = !DILocalVariable(name: "totface", arg: 4, scope: !901, file: !1, line: 541, type: !142)
!912 = !DILocation(line: 541, column: 69, scope: !901)
!913 = !DILocalVariable(name: "totvert", arg: 5, scope: !901, file: !1, line: 541, type: !142)
!914 = !DILocation(line: 541, column: 82, scope: !901)
!915 = !DILocalVariable(name: "vdata", arg: 6, scope: !901, file: !1, line: 541, type: !904)
!916 = !DILocation(line: 541, column: 110, scope: !901)
!917 = !DILocalVariable(name: "prim_bbc", scope: !901, file: !1, line: 543, type: !372)
!918 = !DILocation(line: 543, column: 7, scope: !901)
!919 = !DILocalVariable(name: "cb", scope: !901, file: !1, line: 544, type: !128)
!920 = !DILocation(line: 544, column: 5, scope: !901)
!921 = !DILocalVariable(name: "i", scope: !901, file: !1, line: 545, type: !142)
!922 = !DILocation(line: 545, column: 6, scope: !901)
!923 = !DILocalVariable(name: "j", scope: !901, file: !1, line: 545, type: !142)
!924 = !DILocation(line: 545, column: 9, scope: !901)
!925 = !DILocation(line: 547, column: 2, scope: !901)
!926 = !DILocation(line: 547, column: 7, scope: !901)
!927 = !DILocation(line: 547, column: 12, scope: !901)
!928 = !DILocation(line: 548, column: 15, scope: !901)
!929 = !DILocation(line: 548, column: 2, scope: !901)
!930 = !DILocation(line: 548, column: 7, scope: !901)
!931 = !DILocation(line: 548, column: 13, scope: !901)
!932 = !DILocation(line: 549, column: 15, scope: !901)
!933 = !DILocation(line: 549, column: 2, scope: !901)
!934 = !DILocation(line: 549, column: 7, scope: !901)
!935 = !DILocation(line: 549, column: 13, scope: !901)
!936 = !DILocation(line: 550, column: 21, scope: !901)
!937 = !DILocation(line: 550, column: 2, scope: !901)
!938 = !DILocation(line: 550, column: 7, scope: !901)
!939 = !DILocation(line: 550, column: 19, scope: !901)
!940 = !DILocation(line: 551, column: 17, scope: !901)
!941 = !DILocation(line: 551, column: 2, scope: !901)
!942 = !DILocation(line: 551, column: 7, scope: !901)
!943 = !DILocation(line: 551, column: 15, scope: !901)
!944 = !DILocation(line: 552, column: 2, scope: !901)
!945 = !DILocation(line: 552, column: 7, scope: !901)
!946 = !DILocation(line: 552, column: 18, scope: !901)
!947 = !DILocation(line: 553, column: 15, scope: !901)
!948 = !DILocation(line: 553, column: 2, scope: !901)
!949 = !DILocation(line: 553, column: 7, scope: !901)
!950 = !DILocation(line: 553, column: 13, scope: !901)
!951 = !DILocation(line: 555, column: 2, scope: !901)
!952 = !DILocation(line: 558, column: 13, scope: !901)
!953 = !DILocation(line: 558, column: 39, scope: !901)
!954 = !DILocation(line: 558, column: 37, scope: !901)
!955 = !DILocation(line: 558, column: 11, scope: !901)
!956 = !DILocation(line: 560, column: 9, scope: !957)
!957 = distinct !DILexicalBlock(scope: !901, file: !1, line: 560, column: 2)
!958 = !DILocation(line: 560, column: 7, scope: !957)
!959 = !DILocation(line: 560, column: 14, scope: !960)
!960 = distinct !DILexicalBlock(scope: !957, file: !1, line: 560, column: 2)
!961 = !DILocation(line: 560, column: 18, scope: !960)
!962 = !DILocation(line: 560, column: 16, scope: !960)
!963 = !DILocation(line: 560, column: 2, scope: !957)
!964 = !DILocalVariable(name: "f", scope: !965, file: !1, line: 561, type: !481)
!965 = distinct !DILexicalBlock(scope: !960, file: !1, line: 560, column: 32)
!966 = !DILocation(line: 561, column: 10, scope: !965)
!967 = !DILocation(line: 561, column: 14, scope: !965)
!968 = !DILocation(line: 561, column: 22, scope: !965)
!969 = !DILocation(line: 561, column: 20, scope: !965)
!970 = !DILocalVariable(name: "sides", scope: !965, file: !1, line: 562, type: !971)
!971 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !142)
!972 = !DILocation(line: 562, column: 13, scope: !965)
!973 = !DILocation(line: 562, column: 21, scope: !965)
!974 = !DILocation(line: 562, column: 24, scope: !965)
!975 = !DILocalVariable(name: "bbc", scope: !965, file: !1, line: 563, type: !372)
!976 = !DILocation(line: 563, column: 8, scope: !965)
!977 = !DILocation(line: 563, column: 14, scope: !965)
!978 = !DILocation(line: 563, column: 25, scope: !965)
!979 = !DILocation(line: 563, column: 23, scope: !965)
!980 = !DILocation(line: 565, column: 18, scope: !965)
!981 = !DILocation(line: 565, column: 12, scope: !965)
!982 = !DILocation(line: 565, column: 3, scope: !965)
!983 = !DILocation(line: 567, column: 10, scope: !984)
!984 = distinct !DILexicalBlock(scope: !965, file: !1, line: 567, column: 3)
!985 = !DILocation(line: 567, column: 8, scope: !984)
!986 = !DILocation(line: 567, column: 15, scope: !987)
!987 = distinct !DILexicalBlock(scope: !984, file: !1, line: 567, column: 3)
!988 = !DILocation(line: 567, column: 19, scope: !987)
!989 = !DILocation(line: 567, column: 17, scope: !987)
!990 = !DILocation(line: 567, column: 3, scope: !984)
!991 = !DILocation(line: 568, column: 20, scope: !987)
!992 = !DILocation(line: 568, column: 14, scope: !987)
!993 = !DILocation(line: 568, column: 25, scope: !987)
!994 = !DILocation(line: 568, column: 33, scope: !987)
!995 = !DILocation(line: 568, column: 36, scope: !987)
!996 = !DILocation(line: 568, column: 40, scope: !987)
!997 = !DILocation(line: 568, column: 31, scope: !987)
!998 = !DILocation(line: 568, column: 44, scope: !987)
!999 = !DILocation(line: 568, column: 4, scope: !987)
!1000 = !DILocation(line: 567, column: 26, scope: !987)
!1001 = !DILocation(line: 567, column: 3, scope: !987)
!1002 = distinct !{!1002, !990, !1003}
!1003 = !DILocation(line: 568, column: 46, scope: !984)
!1004 = !DILocation(line: 570, column: 23, scope: !965)
!1005 = !DILocation(line: 570, column: 3, scope: !965)
!1006 = !DILocation(line: 572, column: 18, scope: !965)
!1007 = !DILocation(line: 572, column: 23, scope: !965)
!1008 = !DILocation(line: 572, column: 3, scope: !965)
!1009 = !DILocation(line: 573, column: 2, scope: !965)
!1010 = !DILocation(line: 560, column: 27, scope: !960)
!1011 = !DILocation(line: 560, column: 2, scope: !960)
!1012 = distinct !{!1012, !963, !1013}
!1013 = !DILocation(line: 573, column: 2, scope: !957)
!1014 = !DILocation(line: 575, column: 6, scope: !1015)
!1015 = distinct !DILexicalBlock(scope: !901, file: !1, line: 575, column: 6)
!1016 = !DILocation(line: 575, column: 6, scope: !901)
!1017 = !DILocation(line: 576, column: 14, scope: !1015)
!1018 = !DILocation(line: 576, column: 24, scope: !1015)
!1019 = !DILocation(line: 576, column: 34, scope: !1015)
!1020 = !DILocation(line: 576, column: 3, scope: !1015)
!1021 = !DILocation(line: 578, column: 2, scope: !901)
!1022 = !DILocation(line: 578, column: 12, scope: !901)
!1023 = !DILocation(line: 579, column: 2, scope: !901)
!1024 = !DILocation(line: 579, column: 12, scope: !901)
!1025 = !DILocation(line: 579, column: 17, scope: !901)
!1026 = !DILocation(line: 580, column: 1, scope: !901)
!1027 = distinct !DISubprogram(name: "pbvh_build", scope: !1, file: !1, line: 515, type: !1028, scopeLine: 516, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !176)
!1028 = !DISubroutineType(types: !1029)
!1029 = !{null, !410, !127, !372, !142}
!1030 = !DILocalVariable(name: "bvh", arg: 1, scope: !1027, file: !1, line: 515, type: !410)
!1031 = !DILocation(line: 515, column: 30, scope: !1027)
!1032 = !DILocalVariable(name: "cb", arg: 2, scope: !1027, file: !1, line: 515, type: !127)
!1033 = !DILocation(line: 515, column: 39, scope: !1027)
!1034 = !DILocalVariable(name: "prim_bbc", arg: 3, scope: !1027, file: !1, line: 515, type: !372)
!1035 = !DILocation(line: 515, column: 48, scope: !1027)
!1036 = !DILocalVariable(name: "totprim", arg: 4, scope: !1027, file: !1, line: 515, type: !142)
!1037 = !DILocation(line: 515, column: 62, scope: !1027)
!1038 = !DILocalVariable(name: "i", scope: !1027, file: !1, line: 517, type: !142)
!1039 = !DILocation(line: 517, column: 6, scope: !1027)
!1040 = !DILocation(line: 519, column: 6, scope: !1041)
!1041 = distinct !DILexicalBlock(scope: !1027, file: !1, line: 519, column: 6)
!1042 = !DILocation(line: 519, column: 17, scope: !1041)
!1043 = !DILocation(line: 519, column: 22, scope: !1041)
!1044 = !DILocation(line: 519, column: 14, scope: !1041)
!1045 = !DILocation(line: 519, column: 6, scope: !1027)
!1046 = !DILocation(line: 520, column: 18, scope: !1047)
!1047 = distinct !DILexicalBlock(scope: !1041, file: !1, line: 519, column: 31)
!1048 = !DILocation(line: 520, column: 3, scope: !1047)
!1049 = !DILocation(line: 520, column: 8, scope: !1047)
!1050 = !DILocation(line: 520, column: 16, scope: !1047)
!1051 = !DILocation(line: 521, column: 7, scope: !1052)
!1052 = distinct !DILexicalBlock(scope: !1047, file: !1, line: 521, column: 7)
!1053 = !DILocation(line: 521, column: 12, scope: !1052)
!1054 = !DILocation(line: 521, column: 7, scope: !1047)
!1055 = !DILocation(line: 521, column: 19, scope: !1052)
!1056 = !DILocation(line: 521, column: 29, scope: !1052)
!1057 = !DILocation(line: 521, column: 34, scope: !1052)
!1058 = !DILocation(line: 522, column: 7, scope: !1059)
!1059 = distinct !DILexicalBlock(scope: !1047, file: !1, line: 522, column: 7)
!1060 = !DILocation(line: 522, column: 12, scope: !1059)
!1061 = !DILocation(line: 522, column: 7, scope: !1047)
!1062 = !DILocation(line: 522, column: 26, scope: !1059)
!1063 = !DILocation(line: 522, column: 36, scope: !1059)
!1064 = !DILocation(line: 522, column: 41, scope: !1059)
!1065 = !DILocation(line: 523, column: 23, scope: !1047)
!1066 = !DILocation(line: 523, column: 49, scope: !1047)
!1067 = !DILocation(line: 523, column: 47, scope: !1047)
!1068 = !DILocation(line: 523, column: 3, scope: !1047)
!1069 = !DILocation(line: 523, column: 8, scope: !1047)
!1070 = !DILocation(line: 523, column: 21, scope: !1047)
!1071 = !DILocation(line: 525, column: 10, scope: !1072)
!1072 = distinct !DILexicalBlock(scope: !1047, file: !1, line: 525, column: 3)
!1073 = !DILocation(line: 525, column: 8, scope: !1072)
!1074 = !DILocation(line: 525, column: 15, scope: !1075)
!1075 = distinct !DILexicalBlock(scope: !1072, file: !1, line: 525, column: 3)
!1076 = !DILocation(line: 525, column: 19, scope: !1075)
!1077 = !DILocation(line: 525, column: 17, scope: !1075)
!1078 = !DILocation(line: 525, column: 3, scope: !1072)
!1079 = !DILocation(line: 526, column: 27, scope: !1075)
!1080 = !DILocation(line: 526, column: 4, scope: !1075)
!1081 = !DILocation(line: 526, column: 9, scope: !1075)
!1082 = !DILocation(line: 526, column: 22, scope: !1075)
!1083 = !DILocation(line: 526, column: 25, scope: !1075)
!1084 = !DILocation(line: 525, column: 28, scope: !1075)
!1085 = !DILocation(line: 525, column: 3, scope: !1075)
!1086 = distinct !{!1086, !1078, !1087}
!1087 = !DILocation(line: 526, column: 27, scope: !1072)
!1088 = !DILocation(line: 527, column: 3, scope: !1047)
!1089 = !DILocation(line: 527, column: 8, scope: !1047)
!1090 = !DILocation(line: 527, column: 16, scope: !1047)
!1091 = !DILocation(line: 528, column: 7, scope: !1092)
!1092 = distinct !DILexicalBlock(scope: !1047, file: !1, line: 528, column: 7)
!1093 = !DILocation(line: 528, column: 12, scope: !1092)
!1094 = !DILocation(line: 528, column: 27, scope: !1092)
!1095 = !DILocation(line: 528, column: 7, scope: !1047)
!1096 = !DILocation(line: 529, column: 4, scope: !1097)
!1097 = distinct !DILexicalBlock(scope: !1092, file: !1, line: 528, column: 34)
!1098 = !DILocation(line: 529, column: 9, scope: !1097)
!1099 = !DILocation(line: 529, column: 24, scope: !1097)
!1100 = !DILocation(line: 530, column: 17, scope: !1097)
!1101 = !DILocation(line: 531, column: 29, scope: !1097)
!1102 = !DILocation(line: 531, column: 34, scope: !1097)
!1103 = !DILocation(line: 530, column: 46, scope: !1097)
!1104 = !DILocation(line: 530, column: 4, scope: !1097)
!1105 = !DILocation(line: 530, column: 9, scope: !1097)
!1106 = !DILocation(line: 530, column: 15, scope: !1097)
!1107 = !DILocation(line: 533, column: 3, scope: !1097)
!1108 = !DILocation(line: 534, column: 2, scope: !1047)
!1109 = !DILocation(line: 536, column: 2, scope: !1027)
!1110 = !DILocation(line: 536, column: 7, scope: !1027)
!1111 = !DILocation(line: 536, column: 15, scope: !1027)
!1112 = !DILocation(line: 537, column: 12, scope: !1027)
!1113 = !DILocation(line: 537, column: 20, scope: !1027)
!1114 = !DILocation(line: 537, column: 24, scope: !1027)
!1115 = !DILocation(line: 537, column: 37, scope: !1027)
!1116 = !DILocation(line: 537, column: 2, scope: !1027)
!1117 = !DILocation(line: 538, column: 1, scope: !1027)
!1118 = distinct !DISubprogram(name: "BKE_pbvh_build_grids", scope: !1, file: !1, line: 583, type: !1119, scopeLine: 585, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !176)
!1119 = !DISubroutineType(types: !1120)
!1120 = !{null, !410, !549, !551, !142, !1121, !559, !1122, !570}
!1121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64)
!1122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64)
!1123 = !DILocalVariable(name: "bvh", arg: 1, scope: !1118, file: !1, line: 583, type: !410)
!1124 = !DILocation(line: 583, column: 33, scope: !1118)
!1125 = !DILocalVariable(name: "grids", arg: 2, scope: !1118, file: !1, line: 583, type: !549)
!1126 = !DILocation(line: 583, column: 48, scope: !1118)
!1127 = !DILocalVariable(name: "gridadj", arg: 3, scope: !1118, file: !1, line: 583, type: !551)
!1128 = !DILocation(line: 583, column: 72, scope: !1118)
!1129 = !DILocalVariable(name: "totgrid", arg: 4, scope: !1118, file: !1, line: 584, type: !142)
!1130 = !DILocation(line: 584, column: 31, scope: !1118)
!1131 = !DILocalVariable(name: "key", arg: 5, scope: !1118, file: !1, line: 584, type: !1121)
!1132 = !DILocation(line: 584, column: 48, scope: !1118)
!1133 = !DILocalVariable(name: "gridfaces", arg: 6, scope: !1118, file: !1, line: 584, type: !559)
!1134 = !DILocation(line: 584, column: 60, scope: !1118)
!1135 = !DILocalVariable(name: "flagmats", arg: 7, scope: !1118, file: !1, line: 584, type: !1122)
!1136 = !DILocation(line: 584, column: 82, scope: !1118)
!1137 = !DILocalVariable(name: "grid_hidden", arg: 8, scope: !1118, file: !1, line: 584, type: !570)
!1138 = !DILocation(line: 584, column: 105, scope: !1118)
!1139 = !DILocalVariable(name: "prim_bbc", scope: !1118, file: !1, line: 586, type: !372)
!1140 = !DILocation(line: 586, column: 7, scope: !1118)
!1141 = !DILocalVariable(name: "cb", scope: !1118, file: !1, line: 587, type: !128)
!1142 = !DILocation(line: 587, column: 5, scope: !1118)
!1143 = !DILocalVariable(name: "gridsize", scope: !1118, file: !1, line: 588, type: !142)
!1144 = !DILocation(line: 588, column: 6, scope: !1118)
!1145 = !DILocation(line: 588, column: 17, scope: !1118)
!1146 = !DILocation(line: 588, column: 22, scope: !1118)
!1147 = !DILocalVariable(name: "i", scope: !1118, file: !1, line: 589, type: !142)
!1148 = !DILocation(line: 589, column: 6, scope: !1118)
!1149 = !DILocalVariable(name: "j", scope: !1118, file: !1, line: 589, type: !142)
!1150 = !DILocation(line: 589, column: 9, scope: !1118)
!1151 = !DILocation(line: 591, column: 2, scope: !1118)
!1152 = !DILocation(line: 591, column: 7, scope: !1118)
!1153 = !DILocation(line: 591, column: 12, scope: !1118)
!1154 = !DILocation(line: 592, column: 15, scope: !1118)
!1155 = !DILocation(line: 592, column: 2, scope: !1118)
!1156 = !DILocation(line: 592, column: 7, scope: !1118)
!1157 = !DILocation(line: 592, column: 13, scope: !1118)
!1158 = !DILocation(line: 593, column: 17, scope: !1118)
!1159 = !DILocation(line: 593, column: 2, scope: !1118)
!1160 = !DILocation(line: 593, column: 7, scope: !1118)
!1161 = !DILocation(line: 593, column: 15, scope: !1118)
!1162 = !DILocation(line: 594, column: 19, scope: !1118)
!1163 = !DILocation(line: 594, column: 2, scope: !1118)
!1164 = !DILocation(line: 594, column: 7, scope: !1118)
!1165 = !DILocation(line: 594, column: 17, scope: !1118)
!1166 = !DILocation(line: 595, column: 24, scope: !1118)
!1167 = !DILocation(line: 595, column: 2, scope: !1118)
!1168 = !DILocation(line: 595, column: 7, scope: !1118)
!1169 = !DILocation(line: 595, column: 22, scope: !1118)
!1170 = !DILocation(line: 596, column: 17, scope: !1118)
!1171 = !DILocation(line: 596, column: 2, scope: !1118)
!1172 = !DILocation(line: 596, column: 7, scope: !1118)
!1173 = !DILocation(line: 596, column: 15, scope: !1118)
!1174 = !DILocation(line: 597, column: 2, scope: !1118)
!1175 = !DILocation(line: 597, column: 7, scope: !1118)
!1176 = !DILocation(line: 597, column: 18, scope: !1118)
!1177 = !DILocation(line: 597, column: 17, scope: !1118)
!1178 = !DILocation(line: 598, column: 21, scope: !1118)
!1179 = !DILocation(line: 598, column: 2, scope: !1118)
!1180 = !DILocation(line: 598, column: 7, scope: !1118)
!1181 = !DILocation(line: 598, column: 19, scope: !1118)
!1182 = !DILocation(line: 599, column: 42, scope: !1118)
!1183 = !DILocation(line: 599, column: 51, scope: !1118)
!1184 = !DILocation(line: 599, column: 59, scope: !1118)
!1185 = !DILocation(line: 599, column: 68, scope: !1118)
!1186 = !DILocation(line: 599, column: 56, scope: !1118)
!1187 = !DILocation(line: 599, column: 38, scope: !1118)
!1188 = !DILocation(line: 599, column: 20, scope: !1118)
!1189 = !DILocation(line: 599, column: 2, scope: !1118)
!1190 = !DILocation(line: 599, column: 7, scope: !1118)
!1191 = !DILocation(line: 599, column: 18, scope: !1118)
!1192 = !DILocation(line: 601, column: 2, scope: !1118)
!1193 = !DILocation(line: 604, column: 13, scope: !1118)
!1194 = !DILocation(line: 604, column: 39, scope: !1118)
!1195 = !DILocation(line: 604, column: 37, scope: !1118)
!1196 = !DILocation(line: 604, column: 11, scope: !1118)
!1197 = !DILocation(line: 606, column: 9, scope: !1198)
!1198 = distinct !DILexicalBlock(scope: !1118, file: !1, line: 606, column: 2)
!1199 = !DILocation(line: 606, column: 7, scope: !1198)
!1200 = !DILocation(line: 606, column: 14, scope: !1201)
!1201 = distinct !DILexicalBlock(scope: !1198, file: !1, line: 606, column: 2)
!1202 = !DILocation(line: 606, column: 18, scope: !1201)
!1203 = !DILocation(line: 606, column: 16, scope: !1201)
!1204 = !DILocation(line: 606, column: 2, scope: !1198)
!1205 = !DILocalVariable(name: "grid", scope: !1206, file: !1, line: 607, type: !150)
!1206 = distinct !DILexicalBlock(scope: !1201, file: !1, line: 606, column: 32)
!1207 = !DILocation(line: 607, column: 12, scope: !1206)
!1208 = !DILocation(line: 607, column: 19, scope: !1206)
!1209 = !DILocation(line: 607, column: 25, scope: !1206)
!1210 = !DILocalVariable(name: "bbc", scope: !1206, file: !1, line: 608, type: !372)
!1211 = !DILocation(line: 608, column: 8, scope: !1206)
!1212 = !DILocation(line: 608, column: 14, scope: !1206)
!1213 = !DILocation(line: 608, column: 25, scope: !1206)
!1214 = !DILocation(line: 608, column: 23, scope: !1206)
!1215 = !DILocation(line: 610, column: 18, scope: !1206)
!1216 = !DILocation(line: 610, column: 12, scope: !1206)
!1217 = !DILocation(line: 610, column: 3, scope: !1206)
!1218 = !DILocation(line: 612, column: 10, scope: !1219)
!1219 = distinct !DILexicalBlock(scope: !1206, file: !1, line: 612, column: 3)
!1220 = !DILocation(line: 612, column: 8, scope: !1219)
!1221 = !DILocation(line: 612, column: 15, scope: !1222)
!1222 = distinct !DILexicalBlock(scope: !1219, file: !1, line: 612, column: 3)
!1223 = !DILocation(line: 612, column: 19, scope: !1222)
!1224 = !DILocation(line: 612, column: 30, scope: !1222)
!1225 = !DILocation(line: 612, column: 28, scope: !1222)
!1226 = !DILocation(line: 612, column: 17, scope: !1222)
!1227 = !DILocation(line: 612, column: 3, scope: !1219)
!1228 = !DILocation(line: 613, column: 20, scope: !1222)
!1229 = !DILocation(line: 613, column: 14, scope: !1222)
!1230 = !DILocation(line: 613, column: 44, scope: !1222)
!1231 = !DILocation(line: 613, column: 49, scope: !1222)
!1232 = !DILocation(line: 613, column: 55, scope: !1222)
!1233 = !DILocation(line: 613, column: 25, scope: !1222)
!1234 = !DILocation(line: 613, column: 4, scope: !1222)
!1235 = !DILocation(line: 612, column: 40, scope: !1222)
!1236 = !DILocation(line: 612, column: 3, scope: !1222)
!1237 = distinct !{!1237, !1227, !1238}
!1238 = !DILocation(line: 613, column: 57, scope: !1219)
!1239 = !DILocation(line: 615, column: 23, scope: !1206)
!1240 = !DILocation(line: 615, column: 3, scope: !1206)
!1241 = !DILocation(line: 617, column: 18, scope: !1206)
!1242 = !DILocation(line: 617, column: 23, scope: !1206)
!1243 = !DILocation(line: 617, column: 3, scope: !1206)
!1244 = !DILocation(line: 618, column: 2, scope: !1206)
!1245 = !DILocation(line: 606, column: 27, scope: !1201)
!1246 = !DILocation(line: 606, column: 2, scope: !1201)
!1247 = distinct !{!1247, !1204, !1248}
!1248 = !DILocation(line: 618, column: 2, scope: !1198)
!1249 = !DILocation(line: 620, column: 6, scope: !1250)
!1250 = distinct !DILexicalBlock(scope: !1118, file: !1, line: 620, column: 6)
!1251 = !DILocation(line: 620, column: 6, scope: !1118)
!1252 = !DILocation(line: 621, column: 14, scope: !1250)
!1253 = !DILocation(line: 621, column: 24, scope: !1250)
!1254 = !DILocation(line: 621, column: 34, scope: !1250)
!1255 = !DILocation(line: 621, column: 3, scope: !1250)
!1256 = !DILocation(line: 623, column: 2, scope: !1118)
!1257 = !DILocation(line: 623, column: 12, scope: !1118)
!1258 = !DILocation(line: 624, column: 1, scope: !1118)
!1259 = distinct !DISubprogram(name: "max_ii", scope: !244, file: !244, line: 215, type: !1260, scopeLine: 216, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !176)
!1260 = !DISubroutineType(types: !1261)
!1261 = !{!142, !142, !142}
!1262 = !DILocalVariable(name: "a", arg: 1, scope: !1259, file: !244, line: 215, type: !142)
!1263 = !DILocation(line: 215, column: 24, scope: !1259)
!1264 = !DILocalVariable(name: "b", arg: 2, scope: !1259, file: !244, line: 215, type: !142)
!1265 = !DILocation(line: 215, column: 31, scope: !1259)
!1266 = !DILocation(line: 217, column: 10, scope: !1259)
!1267 = !DILocation(line: 217, column: 14, scope: !1259)
!1268 = !DILocation(line: 217, column: 12, scope: !1259)
!1269 = !DILocation(line: 217, column: 9, scope: !1259)
!1270 = !DILocation(line: 217, column: 19, scope: !1259)
!1271 = !DILocation(line: 217, column: 23, scope: !1259)
!1272 = !DILocation(line: 217, column: 2, scope: !1259)
!1273 = distinct !DISubprogram(name: "CCG_elem_offset_co", scope: !152, file: !152, line: 152, type: !1274, scopeLine: 153, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !176)
!1274 = !DISubroutineType(types: !1275)
!1275 = !{!141, !1276, !150, !142}
!1276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1277, size: 64)
!1277 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !535)
!1278 = !DILocalVariable(name: "key", arg: 1, scope: !1273, file: !152, line: 152, type: !1276)
!1279 = !DILocation(line: 152, column: 52, scope: !1273)
!1280 = !DILocalVariable(name: "elem", arg: 2, scope: !1273, file: !152, line: 152, type: !150)
!1281 = !DILocation(line: 152, column: 66, scope: !1273)
!1282 = !DILocalVariable(name: "offset", arg: 3, scope: !1273, file: !152, line: 152, type: !142)
!1283 = !DILocation(line: 152, column: 76, scope: !1273)
!1284 = !DILocation(line: 154, column: 21, scope: !1273)
!1285 = !DILocation(line: 154, column: 42, scope: !1273)
!1286 = !DILocation(line: 154, column: 47, scope: !1273)
!1287 = !DILocation(line: 154, column: 53, scope: !1273)
!1288 = !DILocation(line: 154, column: 26, scope: !1273)
!1289 = !DILocation(line: 154, column: 9, scope: !1273)
!1290 = !DILocation(line: 154, column: 2, scope: !1273)
!1291 = distinct !DISubprogram(name: "BKE_pbvh_new", scope: !1, file: !1, line: 626, type: !1292, scopeLine: 627, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !176)
!1292 = !DISubroutineType(types: !1293)
!1293 = !{!410}
!1294 = !DILocalVariable(name: "bvh", scope: !1291, file: !1, line: 628, type: !410)
!1295 = !DILocation(line: 628, column: 8, scope: !1291)
!1296 = !DILocation(line: 628, column: 14, scope: !1291)
!1297 = !DILocation(line: 630, column: 9, scope: !1291)
!1298 = !DILocation(line: 630, column: 2, scope: !1291)
!1299 = distinct !DISubprogram(name: "BKE_pbvh_free", scope: !1, file: !1, line: 633, type: !1300, scopeLine: 634, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !176)
!1300 = !DISubroutineType(types: !1301)
!1301 = !{null, !410}
!1302 = !DILocalVariable(name: "bvh", arg: 1, scope: !1299, file: !1, line: 633, type: !410)
!1303 = !DILocation(line: 633, column: 26, scope: !1299)
!1304 = !DILocalVariable(name: "node", scope: !1299, file: !1, line: 635, type: !419)
!1305 = !DILocation(line: 635, column: 12, scope: !1299)
!1306 = !DILocalVariable(name: "i", scope: !1299, file: !1, line: 636, type: !142)
!1307 = !DILocation(line: 636, column: 6, scope: !1299)
!1308 = !DILocation(line: 638, column: 9, scope: !1309)
!1309 = distinct !DILexicalBlock(scope: !1299, file: !1, line: 638, column: 2)
!1310 = !DILocation(line: 638, column: 7, scope: !1309)
!1311 = !DILocation(line: 638, column: 14, scope: !1312)
!1312 = distinct !DILexicalBlock(scope: !1309, file: !1, line: 638, column: 2)
!1313 = !DILocation(line: 638, column: 18, scope: !1312)
!1314 = !DILocation(line: 638, column: 23, scope: !1312)
!1315 = !DILocation(line: 638, column: 16, scope: !1312)
!1316 = !DILocation(line: 638, column: 2, scope: !1309)
!1317 = !DILocation(line: 639, column: 11, scope: !1318)
!1318 = distinct !DILexicalBlock(scope: !1312, file: !1, line: 638, column: 37)
!1319 = !DILocation(line: 639, column: 16, scope: !1318)
!1320 = !DILocation(line: 639, column: 22, scope: !1318)
!1321 = !DILocation(line: 639, column: 8, scope: !1318)
!1322 = !DILocation(line: 641, column: 7, scope: !1323)
!1323 = distinct !DILexicalBlock(scope: !1318, file: !1, line: 641, column: 7)
!1324 = !DILocation(line: 641, column: 13, scope: !1323)
!1325 = !DILocation(line: 641, column: 18, scope: !1323)
!1326 = !DILocation(line: 641, column: 7, scope: !1318)
!1327 = !DILocation(line: 642, column: 8, scope: !1328)
!1328 = distinct !DILexicalBlock(scope: !1329, file: !1, line: 642, column: 8)
!1329 = distinct !DILexicalBlock(scope: !1323, file: !1, line: 641, column: 31)
!1330 = !DILocation(line: 642, column: 14, scope: !1328)
!1331 = !DILocation(line: 642, column: 8, scope: !1329)
!1332 = !DILocation(line: 643, column: 27, scope: !1328)
!1333 = !DILocation(line: 643, column: 33, scope: !1328)
!1334 = !DILocation(line: 643, column: 5, scope: !1328)
!1335 = !DILocation(line: 644, column: 8, scope: !1336)
!1336 = distinct !DILexicalBlock(scope: !1329, file: !1, line: 644, column: 8)
!1337 = !DILocation(line: 644, column: 14, scope: !1336)
