; ModuleID = 'blender/extern/colamd/Source/colamd.c'
source_filename = "blender/extern/colamd/Source/colamd.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.Colamd_Row_struct = type { i32, i32, %union.anon, %union.anon.0 }
%union.anon = type { i32 }
%union.anon.0 = type { i32 }
%struct.Colamd_Col_struct = type { i32, i32, %union.anon.1, %union.anon.2, %union.anon.3, %union.anon.4 }
%union.anon.1 = type { i32 }
%union.anon.2 = type { i32 }
%union.anon.3 = type { i32 }
%union.anon.4 = type { i32 }

@.str = private unnamed_addr constant [7 x i8] c"colamd\00", align 1
@.str.1 = private unnamed_addr constant [7 x i8] c"symamd\00", align 1
@colamd_printf = external dso_local global i32 (i8*, ...)*, align 8
@.str.2 = private unnamed_addr constant [24 x i8] c"\0A%s version %d.%d, %s: \00", align 1
@.str.3 = private unnamed_addr constant [12 x i8] c"Nov 1, 2007\00", align 1
@.str.4 = private unnamed_addr constant [26 x i8] c"No statistics available.\0A\00", align 1
@.str.5 = private unnamed_addr constant [6 x i8] c"OK.  \00", align 1
@.str.6 = private unnamed_addr constant [9 x i8] c"ERROR.  \00", align 1
@.str.7 = private unnamed_addr constant [47 x i8] c"Matrix has unsorted or duplicate row indices.\0A\00", align 1
@.str.8 = private unnamed_addr constant [57 x i8] c"%s: number of duplicate or out-of-order row indices: %d\0A\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "blender/extern/colamd/Source/colamd.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!2 = !{}
!3 = !{!4, !6, !5, !7, !10, !37, !53}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!5 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !8, line: 46, baseType: !9)
!8 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!9 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "Colamd_Col", file: !1, line: 756, baseType: !12)
!12 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Colamd_Col_struct", file: !1, line: 725, size: 192, elements: !13)
!13 = !{!14, !15, !16, !21, !26, !32}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !12, file: !1, line: 727, baseType: !5, size: 32)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !12, file: !1, line: 729, baseType: !5, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "shared1", scope: !12, file: !1, line: 736, baseType: !17, size: 32, offset: 64)
!17 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !12, file: !1, line: 730, size: 32, elements: !18)
!18 = !{!19, !20}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "thickness", scope: !17, file: !1, line: 732, baseType: !5, size: 32)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !17, file: !1, line: 734, baseType: !5, size: 32)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "shared2", scope: !12, file: !1, line: 741, baseType: !22, size: 32, offset: 96)
!22 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !12, file: !1, line: 737, size: 32, elements: !23)
!23 = !{!24, !25}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "score", scope: !22, file: !1, line: 739, baseType: !5, size: 32)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "order", scope: !22, file: !1, line: 740, baseType: !5, size: 32)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "shared3", scope: !12, file: !1, line: 749, baseType: !27, size: 32, offset: 128)
!27 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !12, file: !1, line: 742, size: 32, elements: !28)
!28 = !{!29, !30, !31}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "headhash", scope: !27, file: !1, line: 744, baseType: !5, size: 32)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !27, file: !1, line: 746, baseType: !5, size: 32)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !27, file: !1, line: 747, baseType: !5, size: 32)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "shared4", scope: !12, file: !1, line: 754, baseType: !33, size: 32, offset: 160)
!33 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !12, file: !1, line: 750, size: 32, elements: !34)
!34 = !{!35, !36}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "degree_next", scope: !33, file: !1, line: 752, baseType: !5, size: 32)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "hash_next", scope: !33, file: !1, line: 753, baseType: !5, size: 32)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "Colamd_Row", file: !1, line: 773, baseType: !39)
!39 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Colamd_Row_struct", file: !1, line: 758, size: 128, elements: !40)
!40 = !{!41, !42, !43, !48}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !39, file: !1, line: 760, baseType: !5, size: 32)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !39, file: !1, line: 761, baseType: !5, size: 32, offset: 32)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "shared1", scope: !39, file: !1, line: 766, baseType: !44, size: 32, offset: 64)
!44 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !39, file: !1, line: 762, size: 32, elements: !45)
!45 = !{!46, !47}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "degree", scope: !44, file: !1, line: 764, baseType: !5, size: 32)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !44, file: !1, line: 765, baseType: !5, size: 32)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "shared2", scope: !39, file: !1, line: 771, baseType: !49, size: 32, offset: 96)
!49 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !39, file: !1, line: 767, size: 32, elements: !50)
!50 = !{!51, !52}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "mark", scope: !49, file: !1, line: 769, baseType: !5, size: 32)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "first_column", scope: !49, file: !1, line: 770, baseType: !5, size: 32)
!53 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!54 = !{i32 7, !"Dwarf Version", i32 4}
!55 = !{i32 2, !"Debug Info Version", i32 3}
!56 = !{i32 1, !"wchar_size", i32 4}
!57 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!58 = distinct !DISubprogram(name: "colamd_recommended", scope: !1, file: !1, line: 1065, type: !59, scopeLine: 1073, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!59 = !DISubroutineType(types: !60)
!60 = !{!7, !5, !5, !5}
!61 = !DILocalVariable(name: "nnz", arg: 1, scope: !58, file: !1, line: 1069, type: !5)
!62 = !DILocation(line: 1069, column: 9, scope: !58)
!63 = !DILocalVariable(name: "n_row", arg: 2, scope: !58, file: !1, line: 1070, type: !5)
!64 = !DILocation(line: 1070, column: 9, scope: !58)
!65 = !DILocalVariable(name: "n_col", arg: 3, scope: !58, file: !1, line: 1071, type: !5)
!66 = !DILocation(line: 1071, column: 9, scope: !58)
!67 = !DILocalVariable(name: "s", scope: !58, file: !1, line: 1074, type: !7)
!68 = !DILocation(line: 1074, column: 12, scope: !58)
!69 = !DILocalVariable(name: "c", scope: !58, file: !1, line: 1074, type: !7)
!70 = !DILocation(line: 1074, column: 15, scope: !58)
!71 = !DILocalVariable(name: "r", scope: !58, file: !1, line: 1074, type: !7)
!72 = !DILocation(line: 1074, column: 18, scope: !58)
!73 = !DILocalVariable(name: "ok", scope: !58, file: !1, line: 1075, type: !5)
!74 = !DILocation(line: 1075, column: 9, scope: !58)
!75 = !DILocation(line: 1076, column: 9, scope: !76)
!76 = distinct !DILexicalBlock(scope: !58, file: !1, line: 1076, column: 9)
!77 = !DILocation(line: 1076, column: 13, scope: !76)
!78 = !DILocation(line: 1076, column: 17, scope: !76)
!79 = !DILocation(line: 1076, column: 20, scope: !76)
!80 = !DILocation(line: 1076, column: 26, scope: !76)
!81 = !DILocation(line: 1076, column: 30, scope: !76)
!82 = !DILocation(line: 1076, column: 33, scope: !76)
!83 = !DILocation(line: 1076, column: 39, scope: !76)
!84 = !DILocation(line: 1076, column: 9, scope: !58)
!85 = !DILocation(line: 1078, column: 2, scope: !86)
!86 = distinct !DILexicalBlock(scope: !76, file: !1, line: 1077, column: 5)
!87 = !DILocation(line: 1080, column: 17, scope: !58)
!88 = !DILocation(line: 1080, column: 9, scope: !58)
!89 = !DILocation(line: 1080, column: 7, scope: !58)
!90 = !DILocation(line: 1081, column: 9, scope: !58)
!91 = !DILocation(line: 1081, column: 7, scope: !58)
!92 = !DILocation(line: 1082, column: 9, scope: !58)
!93 = !DILocation(line: 1082, column: 7, scope: !58)
!94 = !DILocation(line: 1083, column: 16, scope: !58)
!95 = !DILocation(line: 1083, column: 19, scope: !58)
!96 = !DILocation(line: 1083, column: 9, scope: !58)
!97 = !DILocation(line: 1083, column: 7, scope: !58)
!98 = !DILocation(line: 1084, column: 16, scope: !58)
!99 = !DILocation(line: 1084, column: 19, scope: !58)
!100 = !DILocation(line: 1084, column: 9, scope: !58)
!101 = !DILocation(line: 1084, column: 7, scope: !58)
!102 = !DILocation(line: 1085, column: 16, scope: !58)
!103 = !DILocation(line: 1085, column: 19, scope: !58)
!104 = !DILocation(line: 1085, column: 9, scope: !58)
!105 = !DILocation(line: 1085, column: 7, scope: !58)
!106 = !DILocation(line: 1086, column: 16, scope: !58)
!107 = !DILocation(line: 1086, column: 19, scope: !58)
!108 = !DILocation(line: 1086, column: 22, scope: !58)
!109 = !DILocation(line: 1086, column: 9, scope: !58)
!110 = !DILocation(line: 1086, column: 7, scope: !58)
