; ModuleID = 'blender/source/blender/editors/space_view3d/view3d_draw.c'
source_filename = "blender/source/blender/editors/space_view3d/view3d_draw.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.UserDef = type { i32, i32, i32, i32, i32, [768 x i8], [768 x i8], [1024 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [1024 x i8], [1024 x i8], i32, i16, i16, i16, i16, i16, i16, i32, i32, i32, i16, i16, i32, i32, i32, i32, i32, i32, i32, i16, i16, i16, i16, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, [64 x i8], i16, i16, i16, i16, i16, i16, i16, i16, [3 x %struct.SolidLight], i16, i16, i16, i16, i16, i16, i16, i16, i32, i32, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i8, i8, i8, i8, i16, i16, i16, i16, i16, i16, float, float, i32, i16, i16, float, i16, i16, i16, i16, %struct.ColorBand, [3 x float], [4 x float], i16, i8, i8, [80 x i8], [1024 x i8], i32, i32, float, float, i32, i16, i16, i16, i16, i16, i16, %struct.WalkNavigation }
%struct.ListBase = type { i8*, i8* }
%struct.SolidLight = type { i32, i32, [4 x float], [4 x float], [4 x float] }
%struct.ColorBand = type { i16, i16, i8, i8, i8, [1 x i8], [32 x %struct.CBData] }
%struct.CBData = type { float, float, float, float, float, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "grid_pos", scope: !2, file: !3, line: 3224, type: !3976, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "view3d_main_area_clear", scope: !3, file: !3, line: 3211, type: !4, scopeLine: 3212, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2543, retainedNodes: !3975)
!3 = !DIFile(filename: "blender/source/blender/editors/space_view3d/view3d_draw.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !DISubroutineType(types: !5)
!5 = !{null, !6, !2121, !2214}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "Scene", file: !8, line: 1299, baseType: !9)
!8 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !8, line: 1216, size: 39680, elements: !10)
!10 = !{!11, !83, !87, !475, !1062, !1063, !1064, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1436, !1754, !1757, !1997, !2009, !2010, !2011, !2012, !2013, !2014, !2015, !2016, !2019, !2020, !2021, !2022, !2023, !2031, !2097, !2104, !2105, !2112, !2113, !2114, !2115, !2116, !2117, !2118}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !9, file: !8, line: 1217, baseType: !12, size: 960)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !13, line: 130, baseType: !14)
!13 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!14 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !13, line: 117, size: 960, elements: !15)
!15 = !{!16, !18, !19, !21, !41, !45, !47, !49, !50, !51}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !14, file: !13, line: 118, baseType: !17, size: 64)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !14, file: !13, line: 118, baseType: !17, size: 64, offset: 64)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !14, file: !13, line: 119, baseType: !20, size: 64, offset: 128)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !14, file: !13, line: 120, baseType: !22, size: 64, offset: 192)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!23 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !13, line: 136, size: 17600, elements: !24)
!24 = !{!25, !26, !28, !31, !36, !37, !38}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !23, file: !13, line: 137, baseType: !12, size: 960)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !23, file: !13, line: 138, baseType: !27, size: 64, offset: 960)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !23, file: !13, line: 139, baseType: !29, size: 64, offset: 1024)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!30 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !13, line: 43, flags: DIFlagFwdDecl)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !23, file: !13, line: 140, baseType: !32, size: 8192, offset: 1088)
!32 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 8192, elements: !34)
!33 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!34 = !{!35}
!35 = !DISubrange(count: 1024)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !23, file: !13, line: 141, baseType: !32, size: 8192, offset: 9280)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !23, file: !13, line: 148, baseType: !22, size: 64, offset: 17472)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !23, file: !13, line: 150, baseType: !39, size: 64, offset: 17536)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!40 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !13, line: 45, flags: DIFlagFwdDecl)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !14, file: !13, line: 121, baseType: !42, size: 528, offset: 256)
!42 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 528, elements: !43)
!43 = !{!44}
!44 = !DISubrange(count: 66)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !14, file: !13, line: 126, baseType: !46, size: 16, offset: 784)
!46 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !14, file: !13, line: 127, baseType: !48, size: 32, offset: 800)
!48 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !14, file: !13, line: 128, baseType: !48, size: 32, offset: 832)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !14, file: !13, line: 128, baseType: !48, size: 32, offset: 864)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !14, file: !13, line: 129, baseType: !52, size: 64, offset: 896)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !13, line: 75, baseType: !54)
!54 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !13, line: 62, size: 1024, elements: !55)
!55 = !{!56, !58, !59, !60, !61, !62, !66, !67, !81, !82}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !54, file: !13, line: 63, baseType: !57, size: 64)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !54, file: !13, line: 63, baseType: !57, size: 64, offset: 64)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !54, file: !13, line: 64, baseType: !33, size: 8, offset: 128)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !54, file: !13, line: 64, baseType: !33, size: 8, offset: 136)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !54, file: !13, line: 65, baseType: !46, size: 16, offset: 144)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !54, file: !13, line: 66, baseType: !63, size: 512, offset: 160)
!63 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 512, elements: !64)
!64 = !{!65}
!65 = !DISubrange(count: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !54, file: !13, line: 67, baseType: !48, size: 32, offset: 672)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !54, file: !13, line: 69, baseType: !68, size: 256, offset: 704)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !13, line: 60, baseType: !69)
!69 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !13, line: 48, size: 256, elements: !70)
!70 = !{!71, !72, !79, !80}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !69, file: !13, line: 49, baseType: !17, size: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !69, file: !13, line: 58, baseType: !73, size: 128, offset: 64)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !74, line: 71, baseType: !75)
!74 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!75 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !74, line: 69, size: 128, elements: !76)
!76 = !{!77, !78}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !75, file: !74, line: 70, baseType: !17, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !75, file: !74, line: 70, baseType: !17, size: 64, offset: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !69, file: !13, line: 59, baseType: !48, size: 32, offset: 192)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !69, file: !13, line: 59, baseType: !48, size: 32, offset: 224)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !54, file: !13, line: 70, baseType: !48, size: 32, offset: 960)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !54, file: !13, line: 74, baseType: !48, size: 32, offset: 992)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !9, file: !8, line: 1218, baseType: !84, size: 64, offset: 960)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!85 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !86, line: 37, flags: DIFlagFwdDecl)
!86 = !DIFile(filename: "blender/source/blender/makesdna/DNA_armature_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!87 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !9, file: !8, line: 1220, baseType: !88, size: 64, offset: 1024)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!89 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !90, line: 115, size: 11392, elements: !91)
!90 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!91 = !{!92, !93, !94, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !204, !214, !228, !229, !270, !271, !274, !275, !291, !292, !293, !294, !295, !296, !297, !301, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !317, !318, !319, !320, !321, !322, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !382, !383, !384, !385, !386, !387, !388, !389, !390, !393, !396, !405, !406, !407, !408, !409, !412, !415, !418, !419, !425, !426, !427, !428, !429, !430, !432, !435, !438, !442, !463, !464}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !89, file: !90, line: 116, baseType: !12, size: 960)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !89, file: !90, line: 117, baseType: !84, size: 64, offset: 960)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !89, file: !90, line: 119, baseType: !95, size: 64, offset: 1024)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !97, line: 155, size: 1856, elements: !98)
!97 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_paint.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!98 = !{!99, !102, !106, !109, !112, !113, !114, !120, !140, !142, !146, !150, !151, !152, !154, !157, !160, !161, !162, !163, !164, !168, !169, !171, !173, !174, !178, !179, !182, !185, !186, !187, !188}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "multires", scope: !96, file: !97, line: 157, baseType: !100, size: 64)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = !DICompositeType(tag: DW_TAG_structure_type, name: "MultiresModifierData", file: !97, line: 157, flags: DIFlagFwdDecl)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "mvert", scope: !96, file: !97, line: 158, baseType: !103, size: 64, offset: 64)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DICompositeType(tag: DW_TAG_structure_type, name: "MVert", file: !105, line: 52, flags: DIFlagFwdDecl)
!105 = !DIFile(filename: "blender/source/blender/makesdna/DNA_mesh_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!106 = !DIDerivedType(tag: DW_TAG_member, name: "mpoly", scope: !96, file: !97, line: 159, baseType: !107, size: 64, offset: 128)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = !DICompositeType(tag: DW_TAG_structure_type, name: "MPoly", file: !105, line: 49, flags: DIFlagFwdDecl)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "mloop", scope: !96, file: !97, line: 160, baseType: !110, size: 64, offset: 192)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DICompositeType(tag: DW_TAG_structure_type, name: "MLoop", file: !105, line: 46, flags: DIFlagFwdDecl)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "totvert", scope: !96, file: !97, line: 161, baseType: !48, size: 32, offset: 256)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "totpoly", scope: !96, file: !97, line: 161, baseType: !48, size: 32, offset: 288)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "face_normals", scope: !96, file: !97, line: 162, baseType: !115, size: 64, offset: 320)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DICompositeType(tag: DW_TAG_array_type, baseType: !117, size: 96, elements: !118)
!117 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!118 = !{!119}
!119 = !DISubrange(count: 3)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "kb", scope: !96, file: !97, line: 163, baseType: !121, size: 64, offset: 384)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "KeyBlock", file: !123, line: 45, size: 1472, elements: !124)
!123 = !DIFile(filename: "blender/source/blender/makesdna/DNA_key_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!124 = !{!125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !122, file: !123, line: 46, baseType: !121, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !122, file: !123, line: 46, baseType: !121, size: 64, offset: 64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !122, file: !123, line: 48, baseType: !117, size: 32, offset: 128)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "curval", scope: !122, file: !123, line: 51, baseType: !117, size: 32, offset: 160)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !122, file: !123, line: 53, baseType: !46, size: 16, offset: 192)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !122, file: !123, line: 54, baseType: !46, size: 16, offset: 208)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "relative", scope: !122, file: !123, line: 56, baseType: !46, size: 16, offset: 224)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !122, file: !123, line: 57, baseType: !46, size: 16, offset: 240)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "totelem", scope: !122, file: !123, line: 59, baseType: !48, size: 32, offset: 256)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !122, file: !123, line: 60, baseType: !48, size: 32, offset: 288)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !122, file: !123, line: 62, baseType: !17, size: 64, offset: 320)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !122, file: !123, line: 63, baseType: !63, size: 512, offset: 384)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "vgroup", scope: !122, file: !123, line: 64, baseType: !63, size: 512, offset: 896)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "slidermin", scope: !122, file: !123, line: 67, baseType: !117, size: 32, offset: 1408)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "slidermax", scope: !122, file: !123, line: 68, baseType: !117, size: 32, offset: 1440)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "vmask", scope: !96, file: !97, line: 164, baseType: !141, size: 64, offset: 448)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "pmap", scope: !96, file: !97, line: 167, baseType: !143, size: 64, offset: 512)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!144 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !145)
!145 = !DICompositeType(tag: DW_TAG_structure_type, name: "MeshElemMap", file: !97, line: 44, flags: DIFlagFwdDecl)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "bm", scope: !96, file: !97, line: 170, baseType: !147, size: 64, offset: 576)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!148 = !DICompositeType(tag: DW_TAG_structure_type, name: "BMesh", file: !149, line: 44, flags: DIFlagFwdDecl)
!149 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_customdata.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!150 = !DIDerivedType(tag: DW_TAG_member, name: "cd_vert_node_offset", scope: !96, file: !97, line: 171, baseType: !48, size: 32, offset: 640)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "cd_face_node_offset", scope: !96, file: !97, line: 172, baseType: !48, size: 32, offset: 672)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "bm_smooth_shading", scope: !96, file: !97, line: 173, baseType: !153, size: 8, offset: 704)
!153 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "bm_log", scope: !96, file: !97, line: 175, baseType: !155, size: 64, offset: 768)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!156 = !DICompositeType(tag: DW_TAG_structure_type, name: "BMLog", file: !97, line: 175, flags: DIFlagFwdDecl)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "pbvh", scope: !96, file: !97, line: 178, baseType: !158, size: 64, offset: 832)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = !DICompositeType(tag: DW_TAG_structure_type, name: "PBVH", file: !97, line: 55, flags: DIFlagFwdDecl)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "show_diffuse_color", scope: !96, file: !97, line: 179, baseType: !153, size: 8, offset: 896)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers_active", scope: !96, file: !97, line: 182, baseType: !153, size: 8, offset: 904)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "orig_cos", scope: !96, file: !97, line: 183, baseType: !115, size: 64, offset: 960)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "deform_cos", scope: !96, file: !97, line: 184, baseType: !115, size: 64, offset: 1024)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "deform_imats", scope: !96, file: !97, line: 185, baseType: !165, size: 64, offset: 1088)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = !DICompositeType(tag: DW_TAG_array_type, baseType: !117, size: 288, elements: !167)
!167 = !{!119, !119}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "partial_redraw", scope: !96, file: !97, line: 188, baseType: !153, size: 8, offset: 1152)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "texcache_side", scope: !96, file: !97, line: 191, baseType: !170, size: 32, offset: 1184)
!170 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "texcache", scope: !96, file: !97, line: 191, baseType: !172, size: 64, offset: 1216)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "texcache_actual", scope: !96, file: !97, line: 191, baseType: !170, size: 32, offset: 1280)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "tex_pool", scope: !96, file: !97, line: 192, baseType: !175, size: 64, offset: 1344)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!176 = !DICompositeType(tag: DW_TAG_structure_type, name: "ImagePool", file: !177, line: 47, flags: DIFlagFwdDecl)
!177 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_image.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!178 = !DIDerivedType(tag: DW_TAG_member, name: "layer_co", scope: !96, file: !97, line: 195, baseType: !115, size: 64, offset: 1408)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "stroke", scope: !96, file: !97, line: 197, baseType: !180, size: 64, offset: 1472)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptStroke", file: !97, line: 197, flags: DIFlagFwdDecl)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !96, file: !97, line: 198, baseType: !183, size: 64, offset: 1536)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = !DICompositeType(tag: DW_TAG_structure_type, name: "StrokeCache", file: !97, line: 59, flags: DIFlagFwdDecl)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "last_stroke_valid", scope: !96, file: !97, line: 201, baseType: !153, size: 8, offset: 1600)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "last_stroke", scope: !96, file: !97, line: 202, baseType: !116, size: 96, offset: 1632)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "average_stroke_accum", scope: !96, file: !97, line: 204, baseType: !116, size: 96, offset: 1728)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "average_stroke_counter", scope: !96, file: !97, line: 205, baseType: !48, size: 32, offset: 1824)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !89, file: !90, line: 121, baseType: !46, size: 16, offset: 1088)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !89, file: !90, line: 121, baseType: !46, size: 16, offset: 1104)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !89, file: !90, line: 122, baseType: !48, size: 32, offset: 1120)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !89, file: !90, line: 122, baseType: !48, size: 32, offset: 1152)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !89, file: !90, line: 122, baseType: !48, size: 32, offset: 1184)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !89, file: !90, line: 123, baseType: !63, size: 512, offset: 1216)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !89, file: !90, line: 124, baseType: !88, size: 64, offset: 1728)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !89, file: !90, line: 124, baseType: !88, size: 64, offset: 1792)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !89, file: !90, line: 127, baseType: !88, size: 64, offset: 1856)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !89, file: !90, line: 127, baseType: !88, size: 64, offset: 1920)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !89, file: !90, line: 127, baseType: !88, size: 64, offset: 1984)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !89, file: !90, line: 128, baseType: !201, size: 64, offset: 2048)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !203, line: 45, flags: DIFlagFwdDecl)
!203 = !DIFile(filename: "blender/source/blender/makesdna/DNA_camera_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!204 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !89, file: !90, line: 130, baseType: !205, size: 64, offset: 2112)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !90, line: 97, size: 832, elements: !207)
!207 = !{!208, !212, !213}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !206, file: !90, line: 98, baseType: !209, size: 768)
!209 = !DICompositeType(tag: DW_TAG_array_type, baseType: !117, size: 768, elements: !210)
!210 = !{!211, !119}
!211 = !DISubrange(count: 8)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !206, file: !90, line: 99, baseType: !48, size: 32, offset: 768)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !206, file: !90, line: 99, baseType: !48, size: 32, offset: 800)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !89, file: !90, line: 131, baseType: !215, size: 64, offset: 2176)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!216 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !217, line: 486, size: 1600, elements: !218)
!217 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!218 = !{!219, !220, !221, !222, !223, !224, !225, !226, !227}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !216, file: !217, line: 487, baseType: !12, size: 960)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !216, file: !217, line: 489, baseType: !73, size: 128, offset: 960)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !216, file: !217, line: 490, baseType: !73, size: 128, offset: 1088)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !216, file: !217, line: 491, baseType: !73, size: 128, offset: 1216)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !216, file: !217, line: 492, baseType: !73, size: 128, offset: 1344)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !216, file: !217, line: 494, baseType: !48, size: 32, offset: 1472)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !216, file: !217, line: 495, baseType: !48, size: 32, offset: 1504)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !216, file: !217, line: 497, baseType: !48, size: 32, offset: 1536)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !216, file: !217, line: 498, baseType: !48, size: 32, offset: 1568)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !89, file: !90, line: 132, baseType: !215, size: 64, offset: 2240)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !89, file: !90, line: 133, baseType: !230, size: 64, offset: 2304)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!231 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !217, line: 334, size: 1728, elements: !232)
!232 = !{!233, !234, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !269}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !231, file: !217, line: 335, baseType: !73, size: 128)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !231, file: !217, line: 336, baseType: !235, size: 64, offset: 128)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!236 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !217, line: 47, flags: DIFlagFwdDecl)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !231, file: !217, line: 338, baseType: !46, size: 16, offset: 192)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !231, file: !217, line: 338, baseType: !46, size: 16, offset: 208)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !231, file: !217, line: 339, baseType: !170, size: 32, offset: 224)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !231, file: !217, line: 340, baseType: !48, size: 32, offset: 256)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !231, file: !217, line: 342, baseType: !117, size: 32, offset: 288)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !231, file: !217, line: 343, baseType: !116, size: 96, offset: 320)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !231, file: !217, line: 344, baseType: !116, size: 96, offset: 416)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !231, file: !217, line: 347, baseType: !73, size: 128, offset: 512)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !231, file: !217, line: 349, baseType: !48, size: 32, offset: 640)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !231, file: !217, line: 350, baseType: !48, size: 32, offset: 672)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !231, file: !217, line: 351, baseType: !17, size: 64, offset: 704)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !231, file: !217, line: 352, baseType: !17, size: 64, offset: 768)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !231, file: !217, line: 354, baseType: !250, size: 384, offset: 832)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !217, line: 116, baseType: !251)
!251 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !217, line: 94, size: 384, elements: !252)
!252 = !{!253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !251, file: !217, line: 96, baseType: !48, size: 32)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !251, file: !217, line: 96, baseType: !48, size: 32, offset: 32)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !251, file: !217, line: 97, baseType: !48, size: 32, offset: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !251, file: !217, line: 97, baseType: !48, size: 32, offset: 96)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !251, file: !217, line: 99, baseType: !46, size: 16, offset: 128)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !251, file: !217, line: 100, baseType: !46, size: 16, offset: 144)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !251, file: !217, line: 102, baseType: !46, size: 16, offset: 160)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !251, file: !217, line: 105, baseType: !46, size: 16, offset: 176)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !251, file: !217, line: 108, baseType: !46, size: 16, offset: 192)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !251, file: !217, line: 109, baseType: !46, size: 16, offset: 208)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !251, file: !217, line: 111, baseType: !46, size: 16, offset: 224)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !251, file: !217, line: 112, baseType: !46, size: 16, offset: 240)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !251, file: !217, line: 114, baseType: !48, size: 32, offset: 256)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !251, file: !217, line: 114, baseType: !48, size: 32, offset: 288)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !251, file: !217, line: 115, baseType: !48, size: 32, offset: 320)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !251, file: !217, line: 115, baseType: !48, size: 32, offset: 352)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !231, file: !217, line: 355, baseType: !63, size: 512, offset: 1216)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !89, file: !90, line: 134, baseType: !17, size: 64, offset: 2368)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !89, file: !90, line: 136, baseType: !272, size: 64, offset: 2432)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64)
!273 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !90, line: 58, flags: DIFlagFwdDecl)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !89, file: !90, line: 138, baseType: !250, size: 384, offset: 2496)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !89, file: !90, line: 139, baseType: !276, size: 64, offset: 2880)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !217, line: 80, baseType: !278)
!278 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !217, line: 72, size: 192, elements: !279)
!279 = !{!280, !287, !288, !289, !290}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !278, file: !217, line: 73, baseType: !281, size: 64)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !217, line: 59, baseType: !283)
!283 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !217, line: 56, size: 128, elements: !284)
!284 = !{!285, !286}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !283, file: !217, line: 57, baseType: !116, size: 96)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !283, file: !217, line: 58, baseType: !48, size: 32, offset: 96)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !278, file: !217, line: 74, baseType: !48, size: 32, offset: 64)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !278, file: !217, line: 76, baseType: !48, size: 32, offset: 96)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !278, file: !217, line: 77, baseType: !48, size: 32, offset: 128)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !278, file: !217, line: 79, baseType: !48, size: 32, offset: 160)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !89, file: !90, line: 141, baseType: !73, size: 128, offset: 2944)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !89, file: !90, line: 142, baseType: !73, size: 128, offset: 3072)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !89, file: !90, line: 143, baseType: !73, size: 128, offset: 3200)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !89, file: !90, line: 144, baseType: !73, size: 128, offset: 3328)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !89, file: !90, line: 146, baseType: !48, size: 32, offset: 3456)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !89, file: !90, line: 147, baseType: !48, size: 32, offset: 3488)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !89, file: !90, line: 150, baseType: !298, size: 64, offset: 3520)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64)
!300 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !90, line: 50, flags: DIFlagFwdDecl)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !89, file: !90, line: 151, baseType: !302, size: 64, offset: 3584)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !89, file: !90, line: 152, baseType: !48, size: 32, offset: 3648)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !89, file: !90, line: 153, baseType: !48, size: 32, offset: 3680)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !89, file: !90, line: 156, baseType: !116, size: 96, offset: 3712)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !89, file: !90, line: 156, baseType: !116, size: 96, offset: 3808)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !89, file: !90, line: 156, baseType: !116, size: 96, offset: 3904)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !89, file: !90, line: 157, baseType: !116, size: 96, offset: 4000)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !89, file: !90, line: 158, baseType: !116, size: 96, offset: 4096)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !89, file: !90, line: 159, baseType: !116, size: 96, offset: 4192)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !89, file: !90, line: 160, baseType: !116, size: 96, offset: 4288)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !89, file: !90, line: 160, baseType: !116, size: 96, offset: 4384)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !89, file: !90, line: 161, baseType: !314, size: 128, offset: 4480)
!314 = !DICompositeType(tag: DW_TAG_array_type, baseType: !117, size: 128, elements: !315)
!315 = !{!316}
!316 = !DISubrange(count: 4)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !89, file: !90, line: 161, baseType: !314, size: 128, offset: 4608)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !89, file: !90, line: 162, baseType: !116, size: 96, offset: 4736)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !89, file: !90, line: 162, baseType: !116, size: 96, offset: 4832)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !89, file: !90, line: 163, baseType: !117, size: 32, offset: 4928)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !89, file: !90, line: 163, baseType: !117, size: 32, offset: 4960)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !89, file: !90, line: 164, baseType: !323, size: 512, offset: 4992)
!323 = !DICompositeType(tag: DW_TAG_array_type, baseType: !117, size: 512, elements: !324)
!324 = !{!316, !316}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !89, file: !90, line: 165, baseType: !323, size: 512, offset: 5504)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !89, file: !90, line: 166, baseType: !323, size: 512, offset: 6016)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !89, file: !90, line: 167, baseType: !323, size: 512, offset: 6528)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !89, file: !90, line: 176, baseType: !323, size: 512, offset: 7040)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !89, file: !90, line: 178, baseType: !170, size: 32, offset: 7552)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !89, file: !90, line: 180, baseType: !46, size: 16, offset: 7584)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !89, file: !90, line: 181, baseType: !46, size: 16, offset: 7600)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !89, file: !90, line: 183, baseType: !46, size: 16, offset: 7616)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !89, file: !90, line: 183, baseType: !46, size: 16, offset: 7632)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !89, file: !90, line: 184, baseType: !46, size: 16, offset: 7648)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !89, file: !90, line: 184, baseType: !46, size: 16, offset: 7664)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !89, file: !90, line: 185, baseType: !46, size: 16, offset: 7680)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !89, file: !90, line: 186, baseType: !46, size: 16, offset: 7696)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !89, file: !90, line: 187, baseType: !46, size: 16, offset: 7712)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !89, file: !90, line: 188, baseType: !33, size: 8, offset: 7728)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !89, file: !90, line: 189, baseType: !33, size: 8, offset: 7736)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !89, file: !90, line: 192, baseType: !48, size: 32, offset: 7744)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !89, file: !90, line: 192, baseType: !48, size: 32, offset: 7776)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !89, file: !90, line: 192, baseType: !48, size: 32, offset: 7808)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !89, file: !90, line: 192, baseType: !48, size: 32, offset: 7840)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !89, file: !90, line: 194, baseType: !48, size: 32, offset: 7872)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !89, file: !90, line: 202, baseType: !117, size: 32, offset: 7904)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !89, file: !90, line: 202, baseType: !117, size: 32, offset: 7936)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !89, file: !90, line: 202, baseType: !117, size: 32, offset: 7968)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !89, file: !90, line: 211, baseType: !117, size: 32, offset: 8000)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !89, file: !90, line: 212, baseType: !117, size: 32, offset: 8032)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !89, file: !90, line: 213, baseType: !117, size: 32, offset: 8064)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !89, file: !90, line: 214, baseType: !117, size: 32, offset: 8096)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !89, file: !90, line: 215, baseType: !117, size: 32, offset: 8128)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !89, file: !90, line: 216, baseType: !117, size: 32, offset: 8160)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !89, file: !90, line: 219, baseType: !117, size: 32, offset: 8192)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !89, file: !90, line: 220, baseType: !117, size: 32, offset: 8224)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !89, file: !90, line: 221, baseType: !117, size: 32, offset: 8256)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !89, file: !90, line: 224, baseType: !359, size: 16, offset: 8288)
!359 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !89, file: !90, line: 224, baseType: !359, size: 16, offset: 8304)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !89, file: !90, line: 226, baseType: !46, size: 16, offset: 8320)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !89, file: !90, line: 228, baseType: !33, size: 8, offset: 8336)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !89, file: !90, line: 229, baseType: !33, size: 8, offset: 8344)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !89, file: !90, line: 231, baseType: !46, size: 16, offset: 8352)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !89, file: !90, line: 232, baseType: !33, size: 8, offset: 8368)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !89, file: !90, line: 233, baseType: !33, size: 8, offset: 8376)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !89, file: !90, line: 234, baseType: !117, size: 32, offset: 8384)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !89, file: !90, line: 235, baseType: !117, size: 32, offset: 8416)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !89, file: !90, line: 237, baseType: !73, size: 128, offset: 8448)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !89, file: !90, line: 238, baseType: !73, size: 128, offset: 8576)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !89, file: !90, line: 239, baseType: !73, size: 128, offset: 8704)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !89, file: !90, line: 240, baseType: !73, size: 128, offset: 8832)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !89, file: !90, line: 242, baseType: !117, size: 32, offset: 8960)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !89, file: !90, line: 244, baseType: !46, size: 16, offset: 8992)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !89, file: !90, line: 245, baseType: !359, size: 16, offset: 9008)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !89, file: !90, line: 246, baseType: !314, size: 128, offset: 9024)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !89, file: !90, line: 248, baseType: !48, size: 32, offset: 9152)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !89, file: !90, line: 249, baseType: !48, size: 32, offset: 9184)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !89, file: !90, line: 251, baseType: !380, size: 64, offset: 9216)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!381 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !90, line: 251, flags: DIFlagFwdDecl)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !89, file: !90, line: 253, baseType: !33, size: 8, offset: 9280)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !89, file: !90, line: 254, baseType: !33, size: 8, offset: 9288)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !89, file: !90, line: 255, baseType: !46, size: 16, offset: 9296)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !89, file: !90, line: 256, baseType: !116, size: 96, offset: 9312)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !89, file: !90, line: 258, baseType: !73, size: 128, offset: 9408)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !89, file: !90, line: 259, baseType: !73, size: 128, offset: 9536)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !89, file: !90, line: 260, baseType: !73, size: 128, offset: 9664)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !89, file: !90, line: 261, baseType: !73, size: 128, offset: 9792)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !89, file: !90, line: 263, baseType: !391, size: 64, offset: 9920)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!392 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !90, line: 52, flags: DIFlagFwdDecl)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !89, file: !90, line: 264, baseType: !394, size: 64, offset: 9984)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64)
!395 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !90, line: 53, flags: DIFlagFwdDecl)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !89, file: !90, line: 265, baseType: !397, size: 64, offset: 10048)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !399, line: 51, size: 1216, elements: !400)
!399 = !DIFile(filename: "blender/source/blender/makesdna/DNA_group_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!400 = !{!401, !402, !403, !404}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !398, file: !399, line: 52, baseType: !12, size: 960)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "gobject", scope: !398, file: !399, line: 54, baseType: !73, size: 128, offset: 960)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !398, file: !399, line: 59, baseType: !170, size: 32, offset: 1088)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "dupli_ofs", scope: !398, file: !399, line: 60, baseType: !116, size: 96, offset: 1120)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !89, file: !90, line: 267, baseType: !33, size: 8, offset: 10112)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !89, file: !90, line: 268, baseType: !33, size: 8, offset: 10120)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !89, file: !90, line: 269, baseType: !46, size: 16, offset: 10128)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !89, file: !90, line: 270, baseType: !117, size: 32, offset: 10144)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !89, file: !90, line: 272, baseType: !410, size: 64, offset: 10176)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!411 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !90, line: 54, flags: DIFlagFwdDecl)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !89, file: !90, line: 275, baseType: !413, size: 64, offset: 10240)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64)
!414 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !90, line: 275, flags: DIFlagFwdDecl)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !89, file: !90, line: 277, baseType: !416, size: 64, offset: 10304)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!417 = !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !90, line: 56, flags: DIFlagFwdDecl)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !89, file: !90, line: 277, baseType: !416, size: 64, offset: 10368)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !89, file: !90, line: 278, baseType: !420, size: 64, offset: 10432)
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !421, line: 27, baseType: !422)
!421 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !423, line: 45, baseType: !424)
!423 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!424 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_mask", scope: !89, file: !90, line: 279, baseType: !420, size: 64, offset: 10496)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !89, file: !90, line: 280, baseType: !170, size: 32, offset: 10560)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !89, file: !90, line: 281, baseType: !170, size: 32, offset: 10592)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "gpulamp", scope: !89, file: !90, line: 283, baseType: !73, size: 128, offset: 10624)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "pc_ids", scope: !89, file: !90, line: 284, baseType: !73, size: 128, offset: 10752)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "duplilist", scope: !89, file: !90, line: 285, baseType: !431, size: 64, offset: 10880)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_object", scope: !89, file: !90, line: 287, baseType: !433, size: 64, offset: 10944)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!434 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyOb", file: !90, line: 59, flags: DIFlagFwdDecl)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_constraint", scope: !89, file: !90, line: 288, baseType: !436, size: 64, offset: 11008)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!437 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyCon", file: !90, line: 288, flags: DIFlagFwdDecl)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "ima_ofs", scope: !89, file: !90, line: 290, baseType: !439, size: 64, offset: 11072)
!439 = !DICompositeType(tag: DW_TAG_array_type, baseType: !117, size: 64, elements: !440)
!440 = !{!441}
!441 = !DISubrange(count: 2)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !89, file: !90, line: 291, baseType: !443, size: 64, offset: 11136)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64)
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageUser", file: !445, line: 65, baseType: !446)
!445 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!446 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !445, line: 50, size: 320, elements: !447)
!447 = !{!448, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !446, file: !445, line: 51, baseType: !449, size: 64)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !446, file: !445, line: 53, baseType: !48, size: 32, offset: 64)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !446, file: !445, line: 54, baseType: !48, size: 32, offset: 96)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !446, file: !445, line: 55, baseType: !48, size: 32, offset: 128)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !446, file: !445, line: 55, baseType: !48, size: 32, offset: 160)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !446, file: !445, line: 56, baseType: !33, size: 8, offset: 192)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "cycl", scope: !446, file: !445, line: 56, baseType: !33, size: 8, offset: 200)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !446, file: !445, line: 57, baseType: !33, size: 8, offset: 208)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !446, file: !445, line: 57, baseType: !33, size: 8, offset: 216)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "multi_index", scope: !446, file: !445, line: 59, baseType: !46, size: 16, offset: 224)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !446, file: !445, line: 59, baseType: !46, size: 16, offset: 240)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !446, file: !445, line: 59, baseType: !46, size: 16, offset: 256)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !446, file: !445, line: 61, baseType: !46, size: 16, offset: 272)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !446, file: !445, line: 63, baseType: !48, size: 32, offset: 288)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "lodlevels", scope: !89, file: !90, line: 293, baseType: !73, size: 128, offset: 11200)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "currentlod", scope: !89, file: !90, line: 294, baseType: !465, size: 64, offset: 11328)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64)
!466 = !DIDerivedType(tag: DW_TAG_typedef, name: "LodLevel", file: !90, line: 113, baseType: !467)
!467 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LodLevel", file: !90, line: 108, size: 256, elements: !468)
!468 = !{!469, !471, !472, !473, !474}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !467, file: !90, line: 109, baseType: !470, size: 64)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !467, file: !90, line: 109, baseType: !470, size: 64, offset: 64)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !467, file: !90, line: 110, baseType: !88, size: 64, offset: 128)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !467, file: !90, line: 111, baseType: !48, size: 32, offset: 192)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "distance", scope: !467, file: !90, line: 112, baseType: !117, size: 32, offset: 224)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !9, file: !8, line: 1221, baseType: !476, size: 64, offset: 1088)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64)
!477 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !478, line: 52, size: 4224, elements: !479)
!478 = !DIFile(filename: "blender/source/blender/makesdna/DNA_world_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!479 = !{!480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !1057, !1058, !1059, !1060, !1061}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !477, file: !478, line: 53, baseType: !12, size: 960)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !477, file: !478, line: 54, baseType: !84, size: 64, offset: 960)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "colormodel", scope: !477, file: !478, line: 56, baseType: !46, size: 16, offset: 1024)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "totex", scope: !477, file: !478, line: 56, baseType: !46, size: 16, offset: 1040)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "texact", scope: !477, file: !478, line: 57, baseType: !46, size: 16, offset: 1056)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "mistype", scope: !477, file: !478, line: 57, baseType: !46, size: 16, offset: 1072)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "horr", scope: !477, file: !478, line: 59, baseType: !117, size: 32, offset: 1088)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "horg", scope: !477, file: !478, line: 59, baseType: !117, size: 32, offset: 1120)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "horb", scope: !477, file: !478, line: 59, baseType: !117, size: 32, offset: 1152)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "zenr", scope: !477, file: !478, line: 60, baseType: !117, size: 32, offset: 1184)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "zeng", scope: !477, file: !478, line: 60, baseType: !117, size: 32, offset: 1216)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "zenb", scope: !477, file: !478, line: 60, baseType: !117, size: 32, offset: 1248)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "ambr", scope: !477, file: !478, line: 61, baseType: !117, size: 32, offset: 1280)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "ambg", scope: !477, file: !478, line: 61, baseType: !117, size: 32, offset: 1312)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "ambb", scope: !477, file: !478, line: 61, baseType: !117, size: 32, offset: 1344)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "exposure", scope: !477, file: !478, line: 68, baseType: !117, size: 32, offset: 1376)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !477, file: !478, line: 68, baseType: !117, size: 32, offset: 1408)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !477, file: !478, line: 68, baseType: !117, size: 32, offset: 1440)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "linfac", scope: !477, file: !478, line: 69, baseType: !117, size: 32, offset: 1472)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "logfac", scope: !477, file: !478, line: 69, baseType: !117, size: 32, offset: 1504)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !477, file: !478, line: 74, baseType: !117, size: 32, offset: 1536)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "activityBoxRadius", scope: !477, file: !478, line: 79, baseType: !117, size: 32, offset: 1568)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "skytype", scope: !477, file: !478, line: 81, baseType: !46, size: 16, offset: 1600)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !477, file: !478, line: 91, baseType: !46, size: 16, offset: 1616)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "occlusionRes", scope: !477, file: !478, line: 92, baseType: !46, size: 16, offset: 1632)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "physicsEngine", scope: !477, file: !478, line: 93, baseType: !46, size: 16, offset: 1648)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "ticrate", scope: !477, file: !478, line: 94, baseType: !46, size: 16, offset: 1664)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "maxlogicstep", scope: !477, file: !478, line: 94, baseType: !46, size: 16, offset: 1680)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "physubstep", scope: !477, file: !478, line: 94, baseType: !46, size: 16, offset: 1696)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "maxphystep", scope: !477, file: !478, line: 94, baseType: !46, size: 16, offset: 1712)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "misi", scope: !477, file: !478, line: 96, baseType: !117, size: 32, offset: 1728)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "miststa", scope: !477, file: !478, line: 96, baseType: !117, size: 32, offset: 1760)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "mistdist", scope: !477, file: !478, line: 96, baseType: !117, size: 32, offset: 1792)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "misthi", scope: !477, file: !478, line: 96, baseType: !117, size: 32, offset: 1824)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "starr", scope: !477, file: !478, line: 98, baseType: !117, size: 32, offset: 1856)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "starg", scope: !477, file: !478, line: 98, baseType: !117, size: 32, offset: 1888)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "starb", scope: !477, file: !478, line: 98, baseType: !117, size: 32, offset: 1920)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "stark", scope: !477, file: !478, line: 98, baseType: !117, size: 32, offset: 1952)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "starsize", scope: !477, file: !478, line: 99, baseType: !117, size: 32, offset: 1984)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "starmindist", scope: !477, file: !478, line: 99, baseType: !117, size: 32, offset: 2016)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "stardist", scope: !477, file: !478, line: 100, baseType: !117, size: 32, offset: 2048)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "starcolnoise", scope: !477, file: !478, line: 100, baseType: !117, size: 32, offset: 2080)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "dofsta", scope: !477, file: !478, line: 103, baseType: !46, size: 16, offset: 2112)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "dofend", scope: !477, file: !478, line: 103, baseType: !46, size: 16, offset: 2128)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "dofmin", scope: !477, file: !478, line: 103, baseType: !46, size: 16, offset: 2144)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "dofmax", scope: !477, file: !478, line: 103, baseType: !46, size: 16, offset: 2160)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "aodist", scope: !477, file: !478, line: 106, baseType: !117, size: 32, offset: 2176)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "aodistfac", scope: !477, file: !478, line: 106, baseType: !117, size: 32, offset: 2208)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "aoenergy", scope: !477, file: !478, line: 106, baseType: !117, size: 32, offset: 2240)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "aobias", scope: !477, file: !478, line: 106, baseType: !117, size: 32, offset: 2272)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "aomode", scope: !477, file: !478, line: 107, baseType: !46, size: 16, offset: 2304)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "aosamp", scope: !477, file: !478, line: 107, baseType: !46, size: 16, offset: 2320)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "aomix", scope: !477, file: !478, line: 107, baseType: !46, size: 16, offset: 2336)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "aocolor", scope: !477, file: !478, line: 107, baseType: !46, size: 16, offset: 2352)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "ao_adapt_thresh", scope: !477, file: !478, line: 108, baseType: !117, size: 32, offset: 2368)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "ao_adapt_speed_fac", scope: !477, file: !478, line: 108, baseType: !117, size: 32, offset: 2400)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_error", scope: !477, file: !478, line: 109, baseType: !117, size: 32, offset: 2432)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_correction", scope: !477, file: !478, line: 109, baseType: !117, size: 32, offset: 2464)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "ao_indirect_energy", scope: !477, file: !478, line: 110, baseType: !117, size: 32, offset: 2496)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "ao_env_energy", scope: !477, file: !478, line: 110, baseType: !117, size: 32, offset: 2528)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "ao_pad2", scope: !477, file: !478, line: 110, baseType: !117, size: 32, offset: 2560)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "ao_indirect_bounces", scope: !477, file: !478, line: 111, baseType: !46, size: 16, offset: 2592)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "ao_pad", scope: !477, file: !478, line: 111, baseType: !46, size: 16, offset: 2608)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "ao_samp_method", scope: !477, file: !478, line: 112, baseType: !46, size: 16, offset: 2624)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "ao_gather_method", scope: !477, file: !478, line: 112, baseType: !46, size: 16, offset: 2640)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_passes", scope: !477, file: !478, line: 112, baseType: !46, size: 16, offset: 2656)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !477, file: !478, line: 115, baseType: !46, size: 16, offset: 2672)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "aosphere", scope: !477, file: !478, line: 118, baseType: !141, size: 64, offset: 2688)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "aotables", scope: !477, file: !478, line: 118, baseType: !141, size: 64, offset: 2752)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !477, file: !478, line: 121, baseType: !201, size: 64, offset: 2816)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "mtex", scope: !477, file: !478, line: 122, baseType: !551, size: 1152, offset: 2880)
!551 = !DICompositeType(tag: DW_TAG_array_type, baseType: !552, size: 1152, elements: !1055)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64)
!553 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTex", file: !554, line: 57, size: 2496, elements: !555)
!554 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!555 = !{!556, !557, !558, !559, !560, !561, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !553, file: !554, line: 59, baseType: !46, size: 16)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !553, file: !554, line: 59, baseType: !46, size: 16, offset: 16)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "maptoneg", scope: !553, file: !554, line: 59, baseType: !46, size: 16, offset: 32)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "blendtype", scope: !553, file: !554, line: 59, baseType: !46, size: 16, offset: 48)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !553, file: !554, line: 60, baseType: !88, size: 64, offset: 64)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "tex", scope: !553, file: !554, line: 61, baseType: !562, size: 64, offset: 128)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64)
!563 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Tex", file: !554, line: 202, size: 3328, elements: !564)
!564 = !{!565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !691, !692, !772, !798, !896, !897, !965, !986, !994, !995}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !563, file: !554, line: 203, baseType: !12, size: 960)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !563, file: !554, line: 204, baseType: !84, size: 64, offset: 960)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "noisesize", scope: !563, file: !554, line: 206, baseType: !117, size: 32, offset: 1024)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "turbul", scope: !563, file: !554, line: 206, baseType: !117, size: 32, offset: 1056)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "bright", scope: !563, file: !554, line: 207, baseType: !117, size: 32, offset: 1088)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "contrast", scope: !563, file: !554, line: 207, baseType: !117, size: 32, offset: 1120)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "saturation", scope: !563, file: !554, line: 207, baseType: !117, size: 32, offset: 1152)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "rfac", scope: !563, file: !554, line: 207, baseType: !117, size: 32, offset: 1184)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "gfac", scope: !563, file: !554, line: 207, baseType: !117, size: 32, offset: 1216)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "bfac", scope: !563, file: !554, line: 207, baseType: !117, size: 32, offset: 1248)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "filtersize", scope: !563, file: !554, line: 208, baseType: !117, size: 32, offset: 1280)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !563, file: !554, line: 208, baseType: !117, size: 32, offset: 1312)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "mg_H", scope: !563, file: !554, line: 211, baseType: !117, size: 32, offset: 1344)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "mg_lacunarity", scope: !563, file: !554, line: 211, baseType: !117, size: 32, offset: 1376)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "mg_octaves", scope: !563, file: !554, line: 211, baseType: !117, size: 32, offset: 1408)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "mg_offset", scope: !563, file: !554, line: 211, baseType: !117, size: 32, offset: 1440)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "mg_gain", scope: !563, file: !554, line: 211, baseType: !117, size: 32, offset: 1472)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "dist_amount", scope: !563, file: !554, line: 214, baseType: !117, size: 32, offset: 1504)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "ns_outscale", scope: !563, file: !554, line: 214, baseType: !117, size: 32, offset: 1536)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w1", scope: !563, file: !554, line: 217, baseType: !117, size: 32, offset: 1568)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w2", scope: !563, file: !554, line: 218, baseType: !117, size: 32, offset: 1600)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w3", scope: !563, file: !554, line: 219, baseType: !117, size: 32, offset: 1632)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w4", scope: !563, file: !554, line: 220, baseType: !117, size: 32, offset: 1664)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "vn_mexp", scope: !563, file: !554, line: 221, baseType: !117, size: 32, offset: 1696)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "vn_distm", scope: !563, file: !554, line: 222, baseType: !46, size: 16, offset: 1728)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "vn_coltype", scope: !563, file: !554, line: 222, baseType: !46, size: 16, offset: 1744)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "noisedepth", scope: !563, file: !554, line: 224, baseType: !46, size: 16, offset: 1760)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "noisetype", scope: !563, file: !554, line: 224, baseType: !46, size: 16, offset: 1776)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis", scope: !563, file: !554, line: 227, baseType: !46, size: 16, offset: 1792)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis2", scope: !563, file: !554, line: 227, baseType: !46, size: 16, offset: 1808)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "imaflag", scope: !563, file: !554, line: 229, baseType: !46, size: 16, offset: 1824)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !563, file: !554, line: 229, baseType: !46, size: 16, offset: 1840)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !563, file: !554, line: 230, baseType: !46, size: 16, offset: 1856)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "stype", scope: !563, file: !554, line: 230, baseType: !46, size: 16, offset: 1872)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmin", scope: !563, file: !554, line: 232, baseType: !117, size: 32, offset: 1888)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "cropymin", scope: !563, file: !554, line: 232, baseType: !117, size: 32, offset: 1920)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmax", scope: !563, file: !554, line: 232, baseType: !117, size: 32, offset: 1952)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "cropymax", scope: !563, file: !554, line: 232, baseType: !117, size: 32, offset: 1984)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "texfilter", scope: !563, file: !554, line: 233, baseType: !48, size: 32, offset: 2016)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "afmax", scope: !563, file: !554, line: 234, baseType: !48, size: 32, offset: 2048)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "xrepeat", scope: !563, file: !554, line: 235, baseType: !46, size: 16, offset: 2080)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "yrepeat", scope: !563, file: !554, line: 235, baseType: !46, size: 16, offset: 2096)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "extend", scope: !563, file: !554, line: 236, baseType: !46, size: 16, offset: 2112)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !563, file: !554, line: 239, baseType: !46, size: 16, offset: 2128)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !563, file: !554, line: 240, baseType: !48, size: 32, offset: 2144)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !563, file: !554, line: 241, baseType: !48, size: 32, offset: 2176)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !563, file: !554, line: 241, baseType: !48, size: 32, offset: 2208)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !563, file: !554, line: 241, baseType: !48, size: 32, offset: 2240)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "checkerdist", scope: !563, file: !554, line: 243, baseType: !117, size: 32, offset: 2272)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "nabla", scope: !563, file: !554, line: 243, baseType: !117, size: 32, offset: 2304)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !563, file: !554, line: 244, baseType: !117, size: 32, offset: 2336)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !563, file: !554, line: 246, baseType: !446, size: 320, offset: 2368)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !563, file: !554, line: 248, baseType: !618, size: 64, offset: 2688)
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !619, size: 64)
!619 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !620, line: 328, size: 3456, elements: !621)
!620 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!621 = !{!622, !623, !624, !627, !628, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !657, !658, !659, !662, !667, !668, !671, !675, !679, !683, !687, !688, !689, !690}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !619, file: !620, line: 329, baseType: !12, size: 960)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !619, file: !620, line: 330, baseType: !84, size: 64, offset: 960)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !619, file: !620, line: 332, baseType: !625, size: 64, offset: 1024)
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 64)
!626 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !620, line: 332, flags: DIFlagFwdDecl)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !619, file: !620, line: 333, baseType: !63, size: 512, offset: 1088)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "interface_type", scope: !619, file: !620, line: 335, baseType: !629, size: 64, offset: 1600)
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 64)
!630 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !631, line: 41, flags: DIFlagFwdDecl)
!631 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!632 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !619, file: !620, line: 337, baseType: !272, size: 64, offset: 1664)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "view_center", scope: !619, file: !620, line: 338, baseType: !439, size: 64, offset: 1728)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !619, file: !620, line: 340, baseType: !73, size: 128, offset: 1792)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !619, file: !620, line: 340, baseType: !73, size: 128, offset: 1920)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !619, file: !620, line: 342, baseType: !48, size: 32, offset: 2048)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !619, file: !620, line: 342, baseType: !48, size: 32, offset: 2080)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "cur_index", scope: !619, file: !620, line: 343, baseType: !48, size: 32, offset: 2112)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !619, file: !620, line: 345, baseType: !48, size: 32, offset: 2144)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !619, file: !620, line: 346, baseType: !48, size: 32, offset: 2176)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "is_updating", scope: !619, file: !620, line: 347, baseType: !46, size: 16, offset: 2208)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !619, file: !620, line: 348, baseType: !46, size: 16, offset: 2224)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !619, file: !620, line: 349, baseType: !48, size: 32, offset: 2240)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "nodetype", scope: !619, file: !620, line: 351, baseType: !48, size: 32, offset: 2272)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "edit_quality", scope: !619, file: !620, line: 353, baseType: !46, size: 16, offset: 2304)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "render_quality", scope: !619, file: !620, line: 354, baseType: !46, size: 16, offset: 2320)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "chunksize", scope: !619, file: !620, line: 355, baseType: !48, size: 32, offset: 2336)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "viewer_border", scope: !619, file: !620, line: 357, baseType: !649, size: 128, offset: 2368)
!649 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !650, line: 95, baseType: !651)
!650 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!651 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !650, line: 92, size: 128, elements: !652)
!652 = !{!653, !654, !655, !656}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !651, file: !650, line: 93, baseType: !117, size: 32)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !651, file: !650, line: 93, baseType: !117, size: 32, offset: 32)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !651, file: !650, line: 94, baseType: !117, size: 32, offset: 64)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !651, file: !650, line: 94, baseType: !117, size: 32, offset: 96)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !619, file: !620, line: 363, baseType: !73, size: 128, offset: 2496)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !619, file: !620, line: 363, baseType: !73, size: 128, offset: 2624)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "previews", scope: !619, file: !620, line: 368, baseType: !660, size: 64, offset: 2752)
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 64)
!661 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHash", file: !620, line: 48, flags: DIFlagFwdDecl)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "active_viewer_key", scope: !619, file: !620, line: 372, baseType: !663, size: 32, offset: 2816)
!663 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !620, line: 274, baseType: !664)
!664 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !620, line: 271, size: 32, elements: !665)
!665 = !{!666}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !664, file: !620, line: 273, baseType: !170, size: 32)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !619, file: !620, line: 373, baseType: !48, size: 32, offset: 2848)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "execdata", scope: !619, file: !620, line: 382, baseType: !669, size: 64, offset: 2880)
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !670, size: 64)
!670 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeExec", file: !620, line: 46, flags: DIFlagFwdDecl)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !619, file: !620, line: 385, baseType: !672, size: 64, offset: 2944)
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 64)
!673 = !DISubroutineType(types: !674)
!674 = !{null, !17, !117}
!675 = !DIDerivedType(tag: DW_TAG_member, name: "stats_draw", scope: !619, file: !620, line: 386, baseType: !676, size: 64, offset: 3008)
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 64)
!677 = !DISubroutineType(types: !678)
!678 = !{null, !17, !302}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "test_break", scope: !619, file: !620, line: 387, baseType: !680, size: 64, offset: 3072)
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !681, size: 64)
!681 = !DISubroutineType(types: !682)
!682 = !{!48, !17}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "update_draw", scope: !619, file: !620, line: 388, baseType: !684, size: 64, offset: 3136)
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 64)
!685 = !DISubroutineType(types: !686)
!686 = !{null, !17}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "tbh", scope: !619, file: !620, line: 389, baseType: !17, size: 64, offset: 3200)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "prh", scope: !619, file: !620, line: 389, baseType: !17, size: 64, offset: 3264)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "sdh", scope: !619, file: !620, line: 389, baseType: !17, size: 64, offset: 3328)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "udh", scope: !619, file: !620, line: 389, baseType: !17, size: 64, offset: 3392)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !563, file: !554, line: 249, baseType: !201, size: 64, offset: 2752)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "ima", scope: !563, file: !554, line: 250, baseType: !693, size: 64, offset: 2816)
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 64)
!694 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !445, line: 77, size: 15424, elements: !695)
!695 = !{!696, !697, !698, !701, !704, !707, !710, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !761, !762, !766}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !694, file: !445, line: 78, baseType: !12, size: 960)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !694, file: !445, line: 80, baseType: !32, size: 8192, offset: 960)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !694, file: !445, line: 82, baseType: !699, size: 64, offset: 9152)
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !700, size: 64)
!700 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !445, line: 43, flags: DIFlagFwdDecl)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !694, file: !445, line: 83, baseType: !702, size: 64, offset: 9216)
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !703, size: 64)
!703 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !13, line: 46, flags: DIFlagFwdDecl)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !694, file: !445, line: 86, baseType: !705, size: 64, offset: 9280)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 64)
!706 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !445, line: 41, flags: DIFlagFwdDecl)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !694, file: !445, line: 87, baseType: !708, size: 64, offset: 9344)
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 64)
!709 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !445, line: 44, flags: DIFlagFwdDecl)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !694, file: !445, line: 89, baseType: !711, size: 512, offset: 9408)
!711 = !DICompositeType(tag: DW_TAG_array_type, baseType: !708, size: 512, elements: !712)
!712 = !{!211}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !694, file: !445, line: 90, baseType: !46, size: 16, offset: 9920)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !694, file: !445, line: 90, baseType: !46, size: 16, offset: 9936)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !694, file: !445, line: 92, baseType: !46, size: 16, offset: 9952)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !694, file: !445, line: 92, baseType: !46, size: 16, offset: 9968)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !694, file: !445, line: 93, baseType: !46, size: 16, offset: 9984)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !694, file: !445, line: 93, baseType: !46, size: 16, offset: 10000)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !694, file: !445, line: 94, baseType: !48, size: 32, offset: 10016)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !694, file: !445, line: 97, baseType: !46, size: 16, offset: 10048)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !694, file: !445, line: 97, baseType: !46, size: 16, offset: 10064)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !694, file: !445, line: 98, baseType: !46, size: 16, offset: 10080)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !694, file: !445, line: 98, baseType: !46, size: 16, offset: 10096)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !694, file: !445, line: 99, baseType: !46, size: 16, offset: 10112)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !694, file: !445, line: 99, baseType: !46, size: 16, offset: 10128)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !694, file: !445, line: 100, baseType: !170, size: 32, offset: 10144)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !694, file: !445, line: 101, baseType: !172, size: 64, offset: 10176)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !694, file: !445, line: 103, baseType: !39, size: 64, offset: 10240)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !694, file: !445, line: 104, baseType: !730, size: 64, offset: 10304)
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 64)
!731 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !13, line: 159, size: 448, elements: !732)
!732 = !{!733, !735, !736, !738, !739, !741}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !731, file: !13, line: 161, baseType: !734, size: 64)
!734 = !DICompositeType(tag: DW_TAG_array_type, baseType: !170, size: 64, elements: !440)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !731, file: !13, line: 162, baseType: !734, size: 64, offset: 64)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !731, file: !13, line: 163, baseType: !737, size: 32, offset: 128)
!737 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 32, elements: !440)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !731, file: !13, line: 164, baseType: !737, size: 32, offset: 160)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !731, file: !13, line: 165, baseType: !740, size: 128, offset: 192)
!740 = !DICompositeType(tag: DW_TAG_array_type, baseType: !172, size: 128, elements: !440)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !731, file: !13, line: 166, baseType: !742, size: 128, offset: 320)
!742 = !DICompositeType(tag: DW_TAG_array_type, baseType: !702, size: 128, elements: !440)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !694, file: !445, line: 107, baseType: !117, size: 32, offset: 10368)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !694, file: !445, line: 108, baseType: !48, size: 32, offset: 10400)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !694, file: !445, line: 109, baseType: !46, size: 16, offset: 10432)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !694, file: !445, line: 110, baseType: !46, size: 16, offset: 10448)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !694, file: !445, line: 113, baseType: !48, size: 32, offset: 10464)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !694, file: !445, line: 113, baseType: !48, size: 32, offset: 10496)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !694, file: !445, line: 114, baseType: !33, size: 8, offset: 10528)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !694, file: !445, line: 114, baseType: !33, size: 8, offset: 10536)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !694, file: !445, line: 115, baseType: !46, size: 16, offset: 10544)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !694, file: !445, line: 116, baseType: !314, size: 128, offset: 10560)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !694, file: !445, line: 119, baseType: !117, size: 32, offset: 10688)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !694, file: !445, line: 119, baseType: !117, size: 32, offset: 10720)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !694, file: !445, line: 122, baseType: !756, size: 512, offset: 10752)
!756 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !757, line: 182, baseType: !758)
!757 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!758 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !757, line: 180, size: 512, elements: !759)
!759 = !{!760}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !758, file: !757, line: 181, baseType: !63, size: 512)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !694, file: !445, line: 123, baseType: !33, size: 8, offset: 11264)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !694, file: !445, line: 125, baseType: !763, size: 56, offset: 11272)
!763 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 56, elements: !764)
!764 = !{!765}
!765 = !DISubrange(count: 7)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !694, file: !445, line: 126, baseType: !767, size: 4096, offset: 11328)
!767 = !DICompositeType(tag: DW_TAG_array_type, baseType: !768, size: 4096, elements: !712)
!768 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !445, line: 69, baseType: !769)
!769 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !445, line: 67, size: 512, elements: !770)
!770 = !{!771}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !769, file: !445, line: 68, baseType: !63, size: 512)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "coba", scope: !563, file: !554, line: 251, baseType: !773, size: 64, offset: 2880)
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 64)
!774 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorBand", file: !554, line: 113, size: 6208, elements: !775)
!775 = !{!776, !777, !778, !779, !780, !781, !785}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !774, file: !554, line: 114, baseType: !46, size: 16)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !774, file: !554, line: 114, baseType: !46, size: 16, offset: 16)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype", scope: !774, file: !554, line: 115, baseType: !33, size: 8, offset: 32)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype_hue", scope: !774, file: !554, line: 115, baseType: !33, size: 8, offset: 40)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "color_mode", scope: !774, file: !554, line: 116, baseType: !33, size: 8, offset: 48)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !774, file: !554, line: 117, baseType: !782, size: 8, offset: 56)
!782 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 8, elements: !783)
!783 = !{!784}
!784 = !DISubrange(count: 1)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !774, file: !554, line: 119, baseType: !786, size: 6144, offset: 64)
!786 = !DICompositeType(tag: DW_TAG_array_type, baseType: !787, size: 6144, elements: !796)
!787 = !DIDerivedType(tag: DW_TAG_typedef, name: "CBData", file: !554, line: 109, baseType: !788)
!788 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CBData", file: !554, line: 106, size: 192, elements: !789)
!789 = !{!790, !791, !792, !793, !794, !795}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !788, file: !554, line: 107, baseType: !117, size: 32)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !788, file: !554, line: 107, baseType: !117, size: 32, offset: 32)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !788, file: !554, line: 107, baseType: !117, size: 32, offset: 64)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !788, file: !554, line: 107, baseType: !117, size: 32, offset: 96)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !788, file: !554, line: 107, baseType: !117, size: 32, offset: 128)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !788, file: !554, line: 108, baseType: !48, size: 32, offset: 160)
!796 = !{!797}
!797 = !DISubrange(count: 32)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "env", scope: !563, file: !554, line: 252, baseType: !799, size: 64, offset: 2944)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 64)
!800 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EnvMap", file: !554, line: 122, size: 1600, elements: !801)
!801 = !{!802, !803, !804, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895}
!802 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !800, file: !554, line: 123, baseType: !88, size: 64)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "ima", scope: !800, file: !554, line: 124, baseType: !693, size: 64, offset: 64)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "cube", scope: !800, file: !554, line: 125, baseType: !805, size: 384, offset: 128)
!805 = !DICompositeType(tag: DW_TAG_array_type, baseType: !806, size: 384, elements: !880)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 64)
!807 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImBuf", file: !808, line: 70, size: 19840, elements: !809)
!808 = !DIFile(filename: "blender/source/blender/imbuf/IMB_imbuf_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!809 = !{!810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !823, !824, !825, !826, !827, !829, !831, !832, !833, !837, !838, !839, !840, !841, !844, !845, !846, !847, !848, !851, !852, !854, !855, !856, !859, !860, !861, !864, !865, !873}
