; ModuleID = 'blender/source/blender/blenkernel/intern/armature.c'
source_filename = "blender/source/blender/blenkernel/intern/armature.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.Global = type { %struct.Main*, [1024 x i8], [1024 x i8], i8, i8, i8, %struct.ListBase, i8, i8, i8, i16, i16, i16, i8, i16, i32, i32, i8, i32, i32, [200 x i8] }
%struct.Main = type { %struct.Main*, %struct.Main*, [1024 x i8], i16, i16, i16, i16, i64, [16 x i8], i16, %struct.Library*, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, [256 x i8], %struct.EvaluationContext*, %struct.MainLock* }
%struct.Library = type { %struct.ID, %struct.ID*, %struct.FileData*, [1024 x i8], [1024 x i8], %struct.Library*, %struct.PackedFile* }
%struct.ID = type { i8*, i8*, %struct.ID*, %struct.Library*, [66 x i8], i16, i32, i32, i32, %struct.IDProperty* }

!189 = !{!190, !191, !192, !193, !194, !195}
!190 = !DIEnumerator(name: "PCHAN_HAS_IK", value: 1, isUnsigned: true)
!191 = !DIEnumerator(name: "PCHAN_HAS_CONST", value: 2, isUnsigned: true)
!192 = !DIEnumerator(name: "PCHAN_HAS_ACTION", value: 4, isUnsigned: true)
!193 = !DIEnumerator(name: "PCHAN_HAS_TARGET", value: 8, isUnsigned: true)
!194 = !DIEnumerator(name: "PCHAN_HAS_STRIDE", value: 16, isUnsigned: true)
!195 = !DIEnumerator(name: "PCHAN_HAS_SPLINEIK", value: 32, isUnsigned: true)
!196 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eBConstraint_Types", file: !164, line: 461, baseType: !5, size: 32, elements: !197)
!197 = !{!198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227}
!198 = !DIEnumerator(name: "CONSTRAINT_TYPE_NULL", value: 0, isUnsigned: true)
!199 = !DIEnumerator(name: "CONSTRAINT_TYPE_CHILDOF", value: 1, isUnsigned: true)
!200 = !DIEnumerator(name: "CONSTRAINT_TYPE_TRACKTO", value: 2, isUnsigned: true)
!201 = !DIEnumerator(name: "CONSTRAINT_TYPE_KINEMATIC", value: 3, isUnsigned: true)
!202 = !DIEnumerator(name: "CONSTRAINT_TYPE_FOLLOWPATH", value: 4, isUnsigned: true)
!203 = !DIEnumerator(name: "CONSTRAINT_TYPE_ROTLIMIT", value: 5, isUnsigned: true)
!204 = !DIEnumerator(name: "CONSTRAINT_TYPE_LOCLIMIT", value: 6, isUnsigned: true)
!205 = !DIEnumerator(name: "CONSTRAINT_TYPE_SIZELIMIT", value: 7, isUnsigned: true)
!206 = !DIEnumerator(name: "CONSTRAINT_TYPE_ROTLIKE", value: 8, isUnsigned: true)
!207 = !DIEnumerator(name: "CONSTRAINT_TYPE_LOCLIKE", value: 9, isUnsigned: true)
!208 = !DIEnumerator(name: "CONSTRAINT_TYPE_SIZELIKE", value: 10, isUnsigned: true)
!209 = !DIEnumerator(name: "CONSTRAINT_TYPE_PYTHON", value: 11, isUnsigned: true)
!210 = !DIEnumerator(name: "CONSTRAINT_TYPE_ACTION", value: 12, isUnsigned: true)
!211 = !DIEnumerator(name: "CONSTRAINT_TYPE_LOCKTRACK", value: 13, isUnsigned: true)
!212 = !DIEnumerator(name: "CONSTRAINT_TYPE_DISTLIMIT", value: 14, isUnsigned: true)
!213 = !DIEnumerator(name: "CONSTRAINT_TYPE_STRETCHTO", value: 15, isUnsigned: true)
!214 = !DIEnumerator(name: "CONSTRAINT_TYPE_MINMAX", value: 16, isUnsigned: true)
!215 = !DIEnumerator(name: "CONSTRAINT_TYPE_RIGIDBODYJOINT", value: 17, isUnsigned: true)
!216 = !DIEnumerator(name: "CONSTRAINT_TYPE_CLAMPTO", value: 18, isUnsigned: true)
!217 = !DIEnumerator(name: "CONSTRAINT_TYPE_TRANSFORM", value: 19, isUnsigned: true)
!218 = !DIEnumerator(name: "CONSTRAINT_TYPE_SHRINKWRAP", value: 20, isUnsigned: true)
!219 = !DIEnumerator(name: "CONSTRAINT_TYPE_DAMPTRACK", value: 21, isUnsigned: true)
!220 = !DIEnumerator(name: "CONSTRAINT_TYPE_SPLINEIK", value: 22, isUnsigned: true)
!221 = !DIEnumerator(name: "CONSTRAINT_TYPE_TRANSLIKE", value: 23, isUnsigned: true)
!222 = !DIEnumerator(name: "CONSTRAINT_TYPE_SAMEVOL", value: 24, isUnsigned: true)
!223 = !DIEnumerator(name: "CONSTRAINT_TYPE_PIVOT", value: 25, isUnsigned: true)
!224 = !DIEnumerator(name: "CONSTRAINT_TYPE_FOLLOWTRACK", value: 26, isUnsigned: true)
!225 = !DIEnumerator(name: "CONSTRAINT_TYPE_CAMERASOLVER", value: 27, isUnsigned: true)
!226 = !DIEnumerator(name: "CONSTRAINT_TYPE_OBJECTSOLVER", value: 28, isUnsigned: true)
!227 = !DIEnumerator(name: "NUM_CONSTRAINT_TYPES", value: 29, isUnsigned: true)
!228 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eBConstraint_Flags", file: !164, line: 499, baseType: !5, size: 32, elements: !229)
!229 = !{!230, !231, !232, !233, !234, !235, !236}
!230 = !DIEnumerator(name: "CONSTRAINT_EXPAND", value: 1, isUnsigned: true)
!231 = !DIEnumerator(name: "CONSTRAINT_DISABLE", value: 4, isUnsigned: true)
!232 = !DIEnumerator(name: "CONSTRAINT_ACTIVE", value: 16, isUnsigned: true)
!233 = !DIEnumerator(name: "CONSTRAINT_SPACEONCE", value: 64, isUnsigned: true)
!234 = !DIEnumerator(name: "CONSTRAINT_OWN_IPO", value: 128, isUnsigned: true)
!235 = !DIEnumerator(name: "CONSTRAINT_PROXY_LOCAL", value: 256, isUnsigned: true)
!236 = !DIEnumerator(name: "CONSTRAINT_OFF", value: 512, isUnsigned: true)
!237 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eSplineIK_Flags", file: !164, line: 681, baseType: !5, size: 32, elements: !238)
!238 = !{!239, !240, !241, !242, !243}
!239 = !DIEnumerator(name: "CONSTRAINT_SPLINEIK_BOUND", value: 1, isUnsigned: true)
!240 = !DIEnumerator(name: "CONSTRAINT_SPLINEIK_NO_ROOT", value: 2, isUnsigned: true)
!241 = !DIEnumerator(name: "CONSTRAINT_SPLINEIK_SCALE_LIMITED", value: 4, isUnsigned: true)
!242 = !DIEnumerator(name: "CONSTRAINT_SPLINEIK_EVENSPLITS", value: 8, isUnsigned: true)
!243 = !DIEnumerator(name: "CONSTRAINT_SPLINEIK_NO_CURVERAD", value: 16, isUnsigned: true)
!244 = !{!245, !255, !366, !141}
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "bArmature", file: !4, line: 114, baseType: !247)
!247 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bArmature", file: !4, line: 78, size: 2048, elements: !248)
!248 = !{!249, !320, !390, !391, !392, !394, !439, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !247, file: !4, line: 79, baseType: !250, size: 960)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !251, line: 130, baseType: !252)
!251 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !251, line: 117, size: 960, elements: !253)
!253 = !{!254, !256, !257, !259, !279, !283, !285, !286, !287, !288}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !252, file: !251, line: 118, baseType: !255, size: 64)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !252, file: !251, line: 118, baseType: !255, size: 64, offset: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !252, file: !251, line: 119, baseType: !258, size: 64, offset: 128)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !252, file: !251, line: 120, baseType: !260, size: 64, offset: 192)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!261 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !251, line: 136, size: 17600, elements: !262)
!262 = !{!263, !264, !266, !269, !274, !275, !276}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !261, file: !251, line: 137, baseType: !250, size: 960)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !261, file: !251, line: 138, baseType: !265, size: 64, offset: 960)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !261, file: !251, line: 139, baseType: !267, size: 64, offset: 1024)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!268 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !251, line: 43, flags: DIFlagFwdDecl)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !261, file: !251, line: 140, baseType: !270, size: 8192, offset: 1088)
!270 = !DICompositeType(tag: DW_TAG_array_type, baseType: !271, size: 8192, elements: !272)
!271 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!272 = !{!273}
!273 = !DISubrange(count: 1024)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !261, file: !251, line: 141, baseType: !270, size: 8192, offset: 9280)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !261, file: !251, line: 148, baseType: !260, size: 64, offset: 17472)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !261, file: !251, line: 150, baseType: !277, size: 64, offset: 17536)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!278 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !251, line: 45, flags: DIFlagFwdDecl)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !252, file: !251, line: 121, baseType: !280, size: 528, offset: 256)
!280 = !DICompositeType(tag: DW_TAG_array_type, baseType: !271, size: 528, elements: !281)
!281 = !{!282}
!282 = !DISubrange(count: 66)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !252, file: !251, line: 126, baseType: !284, size: 16, offset: 784)
!284 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !252, file: !251, line: 127, baseType: !141, size: 32, offset: 800)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !252, file: !251, line: 128, baseType: !141, size: 32, offset: 832)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !252, file: !251, line: 128, baseType: !141, size: 32, offset: 864)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !252, file: !251, line: 129, baseType: !289, size: 64, offset: 896)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !251, line: 75, baseType: !291)
!291 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !251, line: 62, size: 1024, elements: !292)
!292 = !{!293, !295, !296, !297, !298, !299, !303, !304, !318, !319}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !291, file: !251, line: 63, baseType: !294, size: 64)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !291, file: !251, line: 63, baseType: !294, size: 64, offset: 64)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !291, file: !251, line: 64, baseType: !271, size: 8, offset: 128)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !291, file: !251, line: 64, baseType: !271, size: 8, offset: 136)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !291, file: !251, line: 65, baseType: !284, size: 16, offset: 144)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !291, file: !251, line: 66, baseType: !300, size: 512, offset: 160)
!300 = !DICompositeType(tag: DW_TAG_array_type, baseType: !271, size: 512, elements: !301)
!301 = !{!302}
!302 = !DISubrange(count: 64)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !291, file: !251, line: 67, baseType: !141, size: 32, offset: 672)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !291, file: !251, line: 69, baseType: !305, size: 256, offset: 704)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !251, line: 60, baseType: !306)
!306 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !251, line: 48, size: 256, elements: !307)
!307 = !{!308, !309, !316, !317}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !306, file: !251, line: 49, baseType: !255, size: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !306, file: !251, line: 58, baseType: !310, size: 128, offset: 64)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !311, line: 71, baseType: !312)
!311 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!312 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !311, line: 69, size: 128, elements: !313)
!313 = !{!314, !315}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !312, file: !311, line: 70, baseType: !255, size: 64)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !312, file: !311, line: 70, baseType: !255, size: 64, offset: 64)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !306, file: !251, line: 59, baseType: !141, size: 32, offset: 192)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !306, file: !251, line: 59, baseType: !141, size: 32, offset: 224)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !291, file: !251, line: 70, baseType: !141, size: 32, offset: 960)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !291, file: !251, line: 74, baseType: !141, size: 32, offset: 992)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !247, file: !4, line: 80, baseType: !321, size: 64, offset: 960)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!322 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !323, line: 838, size: 768, elements: !324)
!323 = !DIFile(filename: "blender/source/blender/makesdna/DNA_anim_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!324 = !{!325, !339, !340, !350, !351, !383, !384, !385, !386, !387, !388, !389}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !322, file: !323, line: 840, baseType: !326, size: 64)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAction", file: !140, line: 499, baseType: !328)
!328 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !140, line: 486, size: 1600, elements: !329)
!329 = !{!330, !331, !332, !333, !334, !335, !336, !337, !338}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !328, file: !140, line: 487, baseType: !250, size: 960)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !328, file: !140, line: 489, baseType: !310, size: 128, offset: 960)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !328, file: !140, line: 490, baseType: !310, size: 128, offset: 1088)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !328, file: !140, line: 491, baseType: !310, size: 128, offset: 1216)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !328, file: !140, line: 492, baseType: !310, size: 128, offset: 1344)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !328, file: !140, line: 494, baseType: !141, size: 32, offset: 1472)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !328, file: !140, line: 495, baseType: !141, size: 32, offset: 1504)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !328, file: !140, line: 497, baseType: !141, size: 32, offset: 1536)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !328, file: !140, line: 498, baseType: !141, size: 32, offset: 1568)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "tmpact", scope: !322, file: !323, line: 844, baseType: !326, size: 64, offset: 64)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "remap", scope: !322, file: !323, line: 848, baseType: !341, size: 64, offset: 128)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "AnimMapper", file: !323, line: 549, baseType: !343)
!343 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AnimMapper", file: !323, line: 544, size: 320, elements: !344)
!344 = !{!345, !347, !348, !349}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !343, file: !323, line: 545, baseType: !346, size: 64)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !343, file: !323, line: 545, baseType: !346, size: 64, offset: 64)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !343, file: !323, line: 547, baseType: !326, size: 64, offset: 128)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "mappings", scope: !343, file: !323, line: 548, baseType: !310, size: 128, offset: 192)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "nla_tracks", scope: !322, file: !323, line: 851, baseType: !310, size: 128, offset: 192)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "actstrip", scope: !322, file: !323, line: 853, baseType: !352, size: 64, offset: 320)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "NlaStrip", file: !323, line: 594, baseType: !354)
!354 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NlaStrip", file: !323, line: 561, size: 1664, elements: !355)
!355 = !{!356, !358, !359, !360, !361, !362, !363, !364, !365, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !354, file: !323, line: 562, baseType: !357, size: 64)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !354, file: !323, line: 562, baseType: !357, size: 64, offset: 64)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "strips", scope: !354, file: !323, line: 564, baseType: !310, size: 128, offset: 128)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "act", scope: !354, file: !323, line: 565, baseType: !326, size: 64, offset: 256)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "remap", scope: !354, file: !323, line: 566, baseType: !341, size: 64, offset: 320)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "fcurves", scope: !354, file: !323, line: 568, baseType: !310, size: 128, offset: 384)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !354, file: !323, line: 569, baseType: !310, size: 128, offset: 512)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !354, file: !323, line: 571, baseType: !300, size: 512, offset: 640)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "influence", scope: !354, file: !323, line: 573, baseType: !366, size: 32, offset: 1152)
!366 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "strip_time", scope: !354, file: !323, line: 574, baseType: !366, size: 32, offset: 1184)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !354, file: !323, line: 576, baseType: !366, size: 32, offset: 1216)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !354, file: !323, line: 576, baseType: !366, size: 32, offset: 1248)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "actstart", scope: !354, file: !323, line: 577, baseType: !366, size: 32, offset: 1280)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "actend", scope: !354, file: !323, line: 577, baseType: !366, size: 32, offset: 1312)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "repeat", scope: !354, file: !323, line: 579, baseType: !366, size: 32, offset: 1344)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !354, file: !323, line: 580, baseType: !366, size: 32, offset: 1376)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "blendin", scope: !354, file: !323, line: 582, baseType: !366, size: 32, offset: 1408)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "blendout", scope: !354, file: !323, line: 582, baseType: !366, size: 32, offset: 1440)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "blendmode", scope: !354, file: !323, line: 583, baseType: !284, size: 16, offset: 1472)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "extendmode", scope: !354, file: !323, line: 585, baseType: !284, size: 16, offset: 1488)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !354, file: !323, line: 586, baseType: !284, size: 16, offset: 1504)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !354, file: !323, line: 588, baseType: !284, size: 16, offset: 1520)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "speaker_handle", scope: !354, file: !323, line: 590, baseType: !255, size: 64, offset: 1536)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !354, file: !323, line: 592, baseType: !141, size: 32, offset: 1600)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !354, file: !323, line: 593, baseType: !141, size: 32, offset: 1632)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "drivers", scope: !322, file: !323, line: 858, baseType: !310, size: 128, offset: 384)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "overrides", scope: !322, file: !323, line: 859, baseType: !310, size: 128, offset: 512)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !322, file: !323, line: 862, baseType: !141, size: 32, offset: 640)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !322, file: !323, line: 863, baseType: !141, size: 32, offset: 672)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "act_blendmode", scope: !322, file: !323, line: 866, baseType: !284, size: 16, offset: 704)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "act_extendmode", scope: !322, file: !323, line: 867, baseType: !284, size: 16, offset: 720)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "act_influence", scope: !322, file: !323, line: 868, baseType: !366, size: 32, offset: 736)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "bonebase", scope: !247, file: !4, line: 82, baseType: !310, size: 128, offset: 1024)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "chainbase", scope: !247, file: !4, line: 83, baseType: !310, size: 128, offset: 1152)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "edbo", scope: !247, file: !4, line: 84, baseType: !393, size: 64, offset: 1280)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "act_bone", scope: !247, file: !4, line: 92, baseType: !395, size: 64, offset: 1344)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bone", file: !4, line: 76, baseType: !397)
!397 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Bone", file: !4, line: 48, size: 2624, elements: !398)
!398 = !{!399, !401, !402, !403, !404, !405, !406, !407, !411, !412, !415, !416, !417, !418, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !397, file: !4, line: 49, baseType: !400, size: 64)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !397, file: !4, line: 49, baseType: !400, size: 64, offset: 64)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !397, file: !4, line: 50, baseType: !289, size: 64, offset: 128)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !397, file: !4, line: 51, baseType: !400, size: 64, offset: 192)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "childbase", scope: !397, file: !4, line: 52, baseType: !310, size: 128, offset: 256)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !397, file: !4, line: 53, baseType: !300, size: 512, offset: 384)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "roll", scope: !397, file: !4, line: 55, baseType: !366, size: 32, offset: 896)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !397, file: !4, line: 56, baseType: !408, size: 96, offset: 928)
!408 = !DICompositeType(tag: DW_TAG_array_type, baseType: !366, size: 96, elements: !409)
!409 = !{!410}
!410 = !DISubrange(count: 3)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !397, file: !4, line: 57, baseType: !408, size: 96, offset: 1024)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "bone_mat", scope: !397, file: !4, line: 58, baseType: !413, size: 288, offset: 1120)
!413 = !DICompositeType(tag: DW_TAG_array_type, baseType: !366, size: 288, elements: !414)
!414 = !{!410, !410}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !397, file: !4, line: 60, baseType: !141, size: 32, offset: 1408)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "arm_head", scope: !397, file: !4, line: 62, baseType: !408, size: 96, offset: 1440)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "arm_tail", scope: !397, file: !4, line: 63, baseType: !408, size: 96, offset: 1536)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "arm_mat", scope: !397, file: !4, line: 64, baseType: !419, size: 512, offset: 1632)
!419 = !DICompositeType(tag: DW_TAG_array_type, baseType: !366, size: 512, elements: !420)
!420 = !{!421, !421}
!421 = !DISubrange(count: 4)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "arm_roll", scope: !397, file: !4, line: 65, baseType: !366, size: 32, offset: 2144)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !397, file: !4, line: 67, baseType: !366, size: 32, offset: 2176)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !397, file: !4, line: 67, baseType: !366, size: 32, offset: 2208)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "xwidth", scope: !397, file: !4, line: 68, baseType: !366, size: 32, offset: 2240)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !397, file: !4, line: 68, baseType: !366, size: 32, offset: 2272)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "zwidth", scope: !397, file: !4, line: 68, baseType: !366, size: 32, offset: 2304)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "ease1", scope: !397, file: !4, line: 69, baseType: !366, size: 32, offset: 2336)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "ease2", scope: !397, file: !4, line: 69, baseType: !366, size: 32, offset: 2368)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "rad_head", scope: !397, file: !4, line: 70, baseType: !366, size: 32, offset: 2400)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "rad_tail", scope: !397, file: !4, line: 70, baseType: !366, size: 32, offset: 2432)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !397, file: !4, line: 72, baseType: !408, size: 96, offset: 2464)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !397, file: !4, line: 73, baseType: !141, size: 32, offset: 2560)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "segments", scope: !397, file: !4, line: 74, baseType: !284, size: 16, offset: 2592)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !397, file: !4, line: 75, baseType: !436, size: 16, offset: 2608)
!436 = !DICompositeType(tag: DW_TAG_array_type, baseType: !284, size: 16, elements: !437)
!437 = !{!438}
!438 = !DISubrange(count: 1)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "act_edbone", scope: !247, file: !4, line: 93, baseType: !440, size: 64, offset: 1408)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!441 = !DICompositeType(tag: DW_TAG_structure_type, name: "EditBone", file: !4, line: 93, flags: DIFlagFwdDecl)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "sketch", scope: !247, file: !4, line: 95, baseType: !255, size: 64, offset: 1472)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !247, file: !4, line: 97, baseType: !141, size: 32, offset: 1536)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "drawtype", scope: !247, file: !4, line: 98, baseType: !141, size: 32, offset: 1568)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "gevertdeformer", scope: !247, file: !4, line: 99, baseType: !141, size: 32, offset: 1600)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !247, file: !4, line: 100, baseType: !141, size: 32, offset: 1632)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "deformflag", scope: !247, file: !4, line: 101, baseType: !284, size: 16, offset: 1664)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "pathflag", scope: !247, file: !4, line: 102, baseType: !284, size: 16, offset: 1680)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "layer_used", scope: !247, file: !4, line: 104, baseType: !5, size: 32, offset: 1696)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !247, file: !4, line: 105, baseType: !5, size: 32, offset: 1728)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "layer_protected", scope: !247, file: !4, line: 105, baseType: !5, size: 32, offset: 1760)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "ghostep", scope: !247, file: !4, line: 108, baseType: !284, size: 16, offset: 1792)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "ghostsize", scope: !247, file: !4, line: 108, baseType: !284, size: 16, offset: 1808)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "ghosttype", scope: !247, file: !4, line: 109, baseType: !284, size: 16, offset: 1824)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "pathsize", scope: !247, file: !4, line: 109, baseType: !284, size: 16, offset: 1840)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "ghostsf", scope: !247, file: !4, line: 110, baseType: !141, size: 32, offset: 1856)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "ghostef", scope: !247, file: !4, line: 110, baseType: !141, size: 32, offset: 1888)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "pathsf", scope: !247, file: !4, line: 111, baseType: !141, size: 32, offset: 1920)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "pathef", scope: !247, file: !4, line: 111, baseType: !141, size: 32, offset: 1952)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "pathbc", scope: !247, file: !4, line: 112, baseType: !141, size: 32, offset: 1984)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "pathac", scope: !247, file: !4, line: 112, baseType: !141, size: 32, offset: 2016)
!462 = !{i32 7, !"Dwarf Version", i32 4}
!463 = !{i32 2, !"Debug Info Version", i32 3}
!464 = !{i32 1, !"wchar_size", i32 4}
!465 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!466 = distinct !DISubprogram(name: "BKE_armature_add", scope: !1, file: !1, line: 76, type: !467, scopeLine: 77, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !544)
!467 = !DISubroutineType(types: !468)
!468 = !{!469, !470, !542}
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "Main", file: !472, line: 104, baseType: !473)
!472 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_main.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!473 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Main", file: !472, line: 53, size: 15232, elements: !474)
!474 = !{!475, !477, !478, !479, !480, !481, !482, !483, !489, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !533, !539}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !473, file: !472, line: 54, baseType: !476, size: 64)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !473, file: !472, line: 54, baseType: !476, size: 64, offset: 64)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !473, file: !472, line: 55, baseType: !270, size: 8192, offset: 128)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "versionfile", scope: !473, file: !472, line: 56, baseType: !284, size: 16, offset: 8320)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "subversionfile", scope: !473, file: !472, line: 56, baseType: !284, size: 16, offset: 8336)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "minversionfile", scope: !473, file: !472, line: 57, baseType: !284, size: 16, offset: 8352)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "minsubversionfile", scope: !473, file: !472, line: 57, baseType: !284, size: 16, offset: 8368)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "build_commit_timestamp", scope: !473, file: !472, line: 58, baseType: !484, size: 64, offset: 8384)
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !485, line: 27, baseType: !486)
!485 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !487, line: 45, baseType: !488)
!487 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!488 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "build_hash", scope: !473, file: !472, line: 59, baseType: !490, size: 128, offset: 8448)
!490 = !DICompositeType(tag: DW_TAG_array_type, baseType: !271, size: 128, elements: !491)
!491 = !{!492}
!492 = !DISubrange(count: 16)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "recovered", scope: !473, file: !472, line: 60, baseType: !284, size: 16, offset: 8576)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "curlib", scope: !473, file: !472, line: 62, baseType: !260, size: 64, offset: 8640)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !473, file: !472, line: 63, baseType: !310, size: 128, offset: 8704)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "library", scope: !473, file: !472, line: 64, baseType: !310, size: 128, offset: 8832)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !473, file: !472, line: 65, baseType: !310, size: 128, offset: 8960)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "mesh", scope: !473, file: !472, line: 66, baseType: !310, size: 128, offset: 9088)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "curve", scope: !473, file: !472, line: 67, baseType: !310, size: 128, offset: 9216)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "mball", scope: !473, file: !472, line: 68, baseType: !310, size: 128, offset: 9344)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !473, file: !472, line: 69, baseType: !310, size: 128, offset: 9472)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "tex", scope: !473, file: !472, line: 70, baseType: !310, size: 128, offset: 9600)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "image", scope: !473, file: !472, line: 71, baseType: !310, size: 128, offset: 9728)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "latt", scope: !473, file: !472, line: 72, baseType: !310, size: 128, offset: 9856)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "lamp", scope: !473, file: !472, line: 73, baseType: !310, size: 128, offset: 9984)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !473, file: !472, line: 74, baseType: !310, size: 128, offset: 10112)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !473, file: !472, line: 75, baseType: !310, size: 128, offset: 10240)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !473, file: !472, line: 76, baseType: !310, size: 128, offset: 10368)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !473, file: !472, line: 77, baseType: !310, size: 128, offset: 10496)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !473, file: !472, line: 78, baseType: !310, size: 128, offset: 10624)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "script", scope: !473, file: !472, line: 79, baseType: !310, size: 128, offset: 10752)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "vfont", scope: !473, file: !472, line: 80, baseType: !310, size: 128, offset: 10880)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !473, file: !472, line: 81, baseType: !310, size: 128, offset: 11008)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "speaker", scope: !473, file: !472, line: 82, baseType: !310, size: 128, offset: 11136)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "sound", scope: !473, file: !472, line: 83, baseType: !310, size: 128, offset: 11264)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !473, file: !472, line: 84, baseType: !310, size: 128, offset: 11392)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "armature", scope: !473, file: !472, line: 85, baseType: !310, size: 128, offset: 11520)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !473, file: !472, line: 86, baseType: !310, size: 128, offset: 11648)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !473, file: !472, line: 87, baseType: !310, size: 128, offset: 11776)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !473, file: !472, line: 88, baseType: !310, size: 128, offset: 11904)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "particle", scope: !473, file: !472, line: 89, baseType: !310, size: 128, offset: 12032)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "palettes", scope: !473, file: !472, line: 90, baseType: !310, size: 128, offset: 12160)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "paintcurves", scope: !473, file: !472, line: 91, baseType: !310, size: 128, offset: 12288)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "wm", scope: !473, file: !472, line: 92, baseType: !310, size: 128, offset: 12416)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "gpencil", scope: !473, file: !472, line: 93, baseType: !310, size: 128, offset: 12544)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "movieclip", scope: !473, file: !472, line: 94, baseType: !310, size: 128, offset: 12672)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !473, file: !472, line: 95, baseType: !310, size: 128, offset: 12800)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "linestyle", scope: !473, file: !472, line: 96, baseType: !310, size: 128, offset: 12928)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "id_tag_update", scope: !473, file: !472, line: 98, baseType: !530, size: 2048, offset: 13056)
!530 = !DICompositeType(tag: DW_TAG_array_type, baseType: !271, size: 2048, elements: !531)
!531 = !{!532}
!532 = !DISubrange(count: 256)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "eval_ctx", scope: !473, file: !472, line: 101, baseType: !534, size: 64, offset: 15104)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64)
!535 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EvaluationContext", file: !536, line: 58, size: 32, elements: !537)
!536 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_depsgraph.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!537 = !{!538}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !535, file: !536, line: 59, baseType: !141, size: 32)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !473, file: !472, line: 103, baseType: !540, size: 64, offset: 15168)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64)
!541 = !DICompositeType(tag: DW_TAG_structure_type, name: "MainLock", file: !472, line: 51, flags: DIFlagFwdDecl)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64)
!543 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !271)
!544 = !{}
!545 = !DILocalVariable(name: "bmain", arg: 1, scope: !466, file: !1, line: 76, type: !470)
!546 = !DILocation(line: 76, column: 35, scope: !466)
!547 = !DILocalVariable(name: "name", arg: 2, scope: !466, file: !1, line: 76, type: !542)
!548 = !DILocation(line: 76, column: 54, scope: !466)
!549 = !DILocalVariable(name: "arm", scope: !466, file: !1, line: 78, type: !245)
!550 = !DILocation(line: 78, column: 13, scope: !466)
!551 = !DILocation(line: 80, column: 27, scope: !466)
!552 = !DILocation(line: 80, column: 41, scope: !466)
!553 = !DILocation(line: 80, column: 8, scope: !466)
!554 = !DILocation(line: 80, column: 6, scope: !466)
!555 = !DILocation(line: 81, column: 2, scope: !466)
!556 = !DILocation(line: 81, column: 7, scope: !466)
!557 = !DILocation(line: 81, column: 18, scope: !466)
!558 = !DILocation(line: 82, column: 2, scope: !466)
!559 = !DILocation(line: 82, column: 7, scope: !466)
!560 = !DILocation(line: 82, column: 12, scope: !466)
!561 = !DILocation(line: 83, column: 2, scope: !466)
!562 = !DILocation(line: 83, column: 7, scope: !466)
!563 = !DILocation(line: 83, column: 13, scope: !466)
!564 = !DILocation(line: 84, column: 9, scope: !466)
!565 = !DILocation(line: 84, column: 2, scope: !466)
!566 = distinct !DISubprogram(name: "BKE_armature_from_object", scope: !1, file: !1, line: 87, type: !567, scopeLine: 88, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !544)
!567 = !DISubroutineType(types: !568)
!568 = !{!469, !569}
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 64)
!570 = !DIDerivedType(tag: DW_TAG_typedef, name: "Object", file: !57, line: 295, baseType: !571)
!571 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !57, line: 115, size: 11392, elements: !572)
!572 = !{!573, !574, !575, !578, !579, !580, !581, !582, !583, !584, !586, !587, !588, !589, !590, !594, !604, !606, !607, !648, !649, !653, !654, !670, !671, !672, !673, !674, !675, !676, !681, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !759, !760, !761, !762, !763, !764, !765, !766, !767, !770, !773, !776, !777, !778, !779, !780, !783, !805, !1293, !1294, !1295, !1296, !1297, !1298, !1299, !1300, !1301, !1304, !1307, !1309, !2021, !2022}
!573 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !571, file: !57, line: 116, baseType: !250, size: 960)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !571, file: !57, line: 117, baseType: !321, size: 64, offset: 960)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !571, file: !57, line: 119, baseType: !576, size: 64, offset: 1024)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64)
!577 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !57, line: 57, flags: DIFlagFwdDecl)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !571, file: !57, line: 121, baseType: !284, size: 16, offset: 1088)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !571, file: !57, line: 121, baseType: !284, size: 16, offset: 1104)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !571, file: !57, line: 122, baseType: !141, size: 32, offset: 1120)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !571, file: !57, line: 122, baseType: !141, size: 32, offset: 1152)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !571, file: !57, line: 122, baseType: !141, size: 32, offset: 1184)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !571, file: !57, line: 123, baseType: !300, size: 512, offset: 1216)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !571, file: !57, line: 124, baseType: !585, size: 64, offset: 1728)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !571, file: !57, line: 124, baseType: !585, size: 64, offset: 1792)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !571, file: !57, line: 127, baseType: !585, size: 64, offset: 1856)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !571, file: !57, line: 127, baseType: !585, size: 64, offset: 1920)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !571, file: !57, line: 127, baseType: !585, size: 64, offset: 1984)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !571, file: !57, line: 128, baseType: !591, size: 64, offset: 2048)
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64)
!592 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !593, line: 46, flags: DIFlagFwdDecl)
!593 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!594 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !571, file: !57, line: 130, baseType: !595, size: 64, offset: 2112)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64)
!596 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !57, line: 97, size: 832, elements: !597)
!597 = !{!598, !602, !603}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !596, file: !57, line: 98, baseType: !599, size: 768)
!599 = !DICompositeType(tag: DW_TAG_array_type, baseType: !366, size: 768, elements: !600)
!600 = !{!601, !410}
!601 = !DISubrange(count: 8)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !596, file: !57, line: 99, baseType: !141, size: 32, offset: 768)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !596, file: !57, line: 99, baseType: !141, size: 32, offset: 800)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !571, file: !57, line: 131, baseType: !605, size: 64, offset: 2176)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !571, file: !57, line: 132, baseType: !605, size: 64, offset: 2240)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !571, file: !57, line: 133, baseType: !608, size: 64, offset: 2304)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64)
!609 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !140, line: 334, size: 1728, elements: !610)
!610 = !{!611, !612, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !647}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !609, file: !140, line: 335, baseType: !310, size: 128)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !609, file: !140, line: 336, baseType: !613, size: 64, offset: 128)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 64)
!614 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !140, line: 47, flags: DIFlagFwdDecl)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !609, file: !140, line: 338, baseType: !284, size: 16, offset: 192)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !609, file: !140, line: 338, baseType: !284, size: 16, offset: 208)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !609, file: !140, line: 339, baseType: !5, size: 32, offset: 224)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !609, file: !140, line: 340, baseType: !141, size: 32, offset: 256)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !609, file: !140, line: 342, baseType: !366, size: 32, offset: 288)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !609, file: !140, line: 343, baseType: !408, size: 96, offset: 320)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !609, file: !140, line: 344, baseType: !408, size: 96, offset: 416)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !609, file: !140, line: 347, baseType: !310, size: 128, offset: 512)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !609, file: !140, line: 349, baseType: !141, size: 32, offset: 640)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !609, file: !140, line: 350, baseType: !141, size: 32, offset: 672)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !609, file: !140, line: 351, baseType: !255, size: 64, offset: 704)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !609, file: !140, line: 352, baseType: !255, size: 64, offset: 768)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !609, file: !140, line: 354, baseType: !628, size: 384, offset: 832)
!628 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !140, line: 116, baseType: !629)
!629 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !140, line: 94, size: 384, elements: !630)
!630 = !{!631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !629, file: !140, line: 96, baseType: !141, size: 32)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !629, file: !140, line: 96, baseType: !141, size: 32, offset: 32)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !629, file: !140, line: 97, baseType: !141, size: 32, offset: 64)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !629, file: !140, line: 97, baseType: !141, size: 32, offset: 96)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !629, file: !140, line: 99, baseType: !284, size: 16, offset: 128)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !629, file: !140, line: 100, baseType: !284, size: 16, offset: 144)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !629, file: !140, line: 102, baseType: !284, size: 16, offset: 160)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !629, file: !140, line: 105, baseType: !284, size: 16, offset: 176)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !629, file: !140, line: 108, baseType: !284, size: 16, offset: 192)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !629, file: !140, line: 109, baseType: !284, size: 16, offset: 208)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !629, file: !140, line: 111, baseType: !284, size: 16, offset: 224)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !629, file: !140, line: 112, baseType: !284, size: 16, offset: 240)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !629, file: !140, line: 114, baseType: !141, size: 32, offset: 256)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !629, file: !140, line: 114, baseType: !141, size: 32, offset: 288)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !629, file: !140, line: 115, baseType: !141, size: 32, offset: 320)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !629, file: !140, line: 115, baseType: !141, size: 32, offset: 352)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !609, file: !140, line: 355, baseType: !300, size: 512, offset: 1216)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !571, file: !57, line: 134, baseType: !255, size: 64, offset: 2368)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !571, file: !57, line: 136, baseType: !650, size: 64, offset: 2432)
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 64)
!651 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !652, line: 61, flags: DIFlagFwdDecl)
!652 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!653 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !571, file: !57, line: 138, baseType: !628, size: 384, offset: 2496)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !571, file: !57, line: 139, baseType: !655, size: 64, offset: 2880)
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 64)
!656 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !140, line: 80, baseType: !657)
!657 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !140, line: 72, size: 192, elements: !658)
!658 = !{!659, !666, !667, !668, !669}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !657, file: !140, line: 73, baseType: !660, size: 64)
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 64)
!661 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !140, line: 59, baseType: !662)
!662 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !140, line: 56, size: 128, elements: !663)
!663 = !{!664, !665}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !662, file: !140, line: 57, baseType: !408, size: 96)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !662, file: !140, line: 58, baseType: !141, size: 32, offset: 96)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !657, file: !140, line: 74, baseType: !141, size: 32, offset: 64)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !657, file: !140, line: 76, baseType: !141, size: 32, offset: 96)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !657, file: !140, line: 77, baseType: !141, size: 32, offset: 128)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !657, file: !140, line: 79, baseType: !141, size: 32, offset: 160)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !571, file: !57, line: 141, baseType: !310, size: 128, offset: 2944)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !571, file: !57, line: 142, baseType: !310, size: 128, offset: 3072)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !571, file: !57, line: 143, baseType: !310, size: 128, offset: 3200)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !571, file: !57, line: 144, baseType: !310, size: 128, offset: 3328)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !571, file: !57, line: 146, baseType: !141, size: 32, offset: 3456)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !571, file: !57, line: 147, baseType: !141, size: 32, offset: 3488)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !571, file: !57, line: 150, baseType: !677, size: 64, offset: 3520)
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !678, size: 64)
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 64)
!679 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !680, line: 46, flags: DIFlagFwdDecl)
!680 = !DIFile(filename: "blender/source/blender/makesdna/DNA_curve_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!681 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !571, file: !57, line: 151, baseType: !682, size: 64, offset: 3584)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !571, file: !57, line: 152, baseType: !141, size: 32, offset: 3648)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !571, file: !57, line: 153, baseType: !141, size: 32, offset: 3680)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !571, file: !57, line: 156, baseType: !408, size: 96, offset: 3712)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !571, file: !57, line: 156, baseType: !408, size: 96, offset: 3808)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !571, file: !57, line: 156, baseType: !408, size: 96, offset: 3904)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !571, file: !57, line: 157, baseType: !408, size: 96, offset: 4000)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !571, file: !57, line: 158, baseType: !408, size: 96, offset: 4096)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !571, file: !57, line: 159, baseType: !408, size: 96, offset: 4192)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !571, file: !57, line: 160, baseType: !408, size: 96, offset: 4288)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !571, file: !57, line: 160, baseType: !408, size: 96, offset: 4384)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !571, file: !57, line: 161, baseType: !694, size: 128, offset: 4480)
!694 = !DICompositeType(tag: DW_TAG_array_type, baseType: !366, size: 128, elements: !695)
!695 = !{!421}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !571, file: !57, line: 161, baseType: !694, size: 128, offset: 4608)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !571, file: !57, line: 162, baseType: !408, size: 96, offset: 4736)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !571, file: !57, line: 162, baseType: !408, size: 96, offset: 4832)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !571, file: !57, line: 163, baseType: !366, size: 32, offset: 4928)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !571, file: !57, line: 163, baseType: !366, size: 32, offset: 4960)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !571, file: !57, line: 164, baseType: !419, size: 512, offset: 4992)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !571, file: !57, line: 165, baseType: !419, size: 512, offset: 5504)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !571, file: !57, line: 166, baseType: !419, size: 512, offset: 6016)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !571, file: !57, line: 167, baseType: !419, size: 512, offset: 6528)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !571, file: !57, line: 176, baseType: !419, size: 512, offset: 7040)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !571, file: !57, line: 178, baseType: !5, size: 32, offset: 7552)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !571, file: !57, line: 180, baseType: !284, size: 16, offset: 7584)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !571, file: !57, line: 181, baseType: !284, size: 16, offset: 7600)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !571, file: !57, line: 183, baseType: !284, size: 16, offset: 7616)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !571, file: !57, line: 183, baseType: !284, size: 16, offset: 7632)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !571, file: !57, line: 184, baseType: !284, size: 16, offset: 7648)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !571, file: !57, line: 184, baseType: !284, size: 16, offset: 7664)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !571, file: !57, line: 185, baseType: !284, size: 16, offset: 7680)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !571, file: !57, line: 186, baseType: !284, size: 16, offset: 7696)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !571, file: !57, line: 187, baseType: !284, size: 16, offset: 7712)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !571, file: !57, line: 188, baseType: !271, size: 8, offset: 7728)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !571, file: !57, line: 189, baseType: !271, size: 8, offset: 7736)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !571, file: !57, line: 192, baseType: !141, size: 32, offset: 7744)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !571, file: !57, line: 192, baseType: !141, size: 32, offset: 7776)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !571, file: !57, line: 192, baseType: !141, size: 32, offset: 7808)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !571, file: !57, line: 192, baseType: !141, size: 32, offset: 7840)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !571, file: !57, line: 194, baseType: !141, size: 32, offset: 7872)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !571, file: !57, line: 202, baseType: !366, size: 32, offset: 7904)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !571, file: !57, line: 202, baseType: !366, size: 32, offset: 7936)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !571, file: !57, line: 202, baseType: !366, size: 32, offset: 7968)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !571, file: !57, line: 211, baseType: !366, size: 32, offset: 8000)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !571, file: !57, line: 212, baseType: !366, size: 32, offset: 8032)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !571, file: !57, line: 213, baseType: !366, size: 32, offset: 8064)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !571, file: !57, line: 214, baseType: !366, size: 32, offset: 8096)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !571, file: !57, line: 215, baseType: !366, size: 32, offset: 8128)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !571, file: !57, line: 216, baseType: !366, size: 32, offset: 8160)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !571, file: !57, line: 219, baseType: !366, size: 32, offset: 8192)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !571, file: !57, line: 220, baseType: !366, size: 32, offset: 8224)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !571, file: !57, line: 221, baseType: !366, size: 32, offset: 8256)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !571, file: !57, line: 224, baseType: !736, size: 16, offset: 8288)
!736 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !571, file: !57, line: 224, baseType: !736, size: 16, offset: 8304)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !571, file: !57, line: 226, baseType: !284, size: 16, offset: 8320)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !571, file: !57, line: 228, baseType: !271, size: 8, offset: 8336)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !571, file: !57, line: 229, baseType: !271, size: 8, offset: 8344)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !571, file: !57, line: 231, baseType: !284, size: 16, offset: 8352)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !571, file: !57, line: 232, baseType: !271, size: 8, offset: 8368)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !571, file: !57, line: 233, baseType: !271, size: 8, offset: 8376)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !571, file: !57, line: 234, baseType: !366, size: 32, offset: 8384)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !571, file: !57, line: 235, baseType: !366, size: 32, offset: 8416)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !571, file: !57, line: 237, baseType: !310, size: 128, offset: 8448)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !571, file: !57, line: 238, baseType: !310, size: 128, offset: 8576)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !571, file: !57, line: 239, baseType: !310, size: 128, offset: 8704)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !571, file: !57, line: 240, baseType: !310, size: 128, offset: 8832)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !571, file: !57, line: 242, baseType: !366, size: 32, offset: 8960)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !571, file: !57, line: 244, baseType: !284, size: 16, offset: 8992)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !571, file: !57, line: 245, baseType: !736, size: 16, offset: 9008)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !571, file: !57, line: 246, baseType: !694, size: 128, offset: 9024)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !571, file: !57, line: 248, baseType: !141, size: 32, offset: 9152)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !571, file: !57, line: 249, baseType: !141, size: 32, offset: 9184)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !571, file: !57, line: 251, baseType: !757, size: 64, offset: 9216)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 64)
!758 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !57, line: 251, flags: DIFlagFwdDecl)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !571, file: !57, line: 253, baseType: !271, size: 8, offset: 9280)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !571, file: !57, line: 254, baseType: !271, size: 8, offset: 9288)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !571, file: !57, line: 255, baseType: !284, size: 16, offset: 9296)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !571, file: !57, line: 256, baseType: !408, size: 96, offset: 9312)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !571, file: !57, line: 258, baseType: !310, size: 128, offset: 9408)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !571, file: !57, line: 259, baseType: !310, size: 128, offset: 9536)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !571, file: !57, line: 260, baseType: !310, size: 128, offset: 9664)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !571, file: !57, line: 261, baseType: !310, size: 128, offset: 9792)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !571, file: !57, line: 263, baseType: !768, size: 64, offset: 9920)
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 64)
!769 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !57, line: 52, flags: DIFlagFwdDecl)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !571, file: !57, line: 264, baseType: !771, size: 64, offset: 9984)
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 64)
!772 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !57, line: 53, flags: DIFlagFwdDecl)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !571, file: !57, line: 265, baseType: !774, size: 64, offset: 10048)
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 64)
!775 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !140, line: 46, flags: DIFlagFwdDecl)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !571, file: !57, line: 267, baseType: !271, size: 8, offset: 10112)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !571, file: !57, line: 268, baseType: !271, size: 8, offset: 10120)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !571, file: !57, line: 269, baseType: !284, size: 16, offset: 10128)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !571, file: !57, line: 270, baseType: !366, size: 32, offset: 10144)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !571, file: !57, line: 272, baseType: !781, size: 64, offset: 10176)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !782, size: 64)
!782 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !57, line: 54, flags: DIFlagFwdDecl)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !571, file: !57, line: 275, baseType: !784, size: 64, offset: 10240)
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !785, size: 64)
!785 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !786, line: 49, size: 448, elements: !787)
!786 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_curve.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!787 = !{!788, !789, !790, !791}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "disp", scope: !785, file: !786, line: 50, baseType: !310, size: 128)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "bev", scope: !785, file: !786, line: 51, baseType: !310, size: 128, offset: 128)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "deformed_nurbs", scope: !785, file: !786, line: 52, baseType: !310, size: 128, offset: 256)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !785, file: !786, line: 53, baseType: !792, size: 64, offset: 384)
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !793, size: 64)
!793 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Path", file: !680, line: 65, size: 128, elements: !794)
!794 = !{!795, !803, !804}
!795 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !793, file: !680, line: 66, baseType: !796, size: 64)
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !797, size: 64)
!797 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PathPoint", file: !680, line: 56, size: 320, elements: !798)
!798 = !{!799, !800, !801, !802}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !797, file: !680, line: 57, baseType: !694, size: 128)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !797, file: !680, line: 58, baseType: !694, size: 128, offset: 128)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "radius", scope: !797, file: !680, line: 59, baseType: !366, size: 32, offset: 256)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !797, file: !680, line: 59, baseType: !366, size: 32, offset: 288)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !793, file: !680, line: 67, baseType: !141, size: 32, offset: 64)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "totdist", scope: !793, file: !680, line: 68, baseType: !366, size: 32, offset: 96)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !571, file: !57, line: 277, baseType: !806, size: 64, offset: 10304)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 64)
!807 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !30, line: 178, size: 13504, elements: !808)
!808 = !{!809, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !861, !864, !866, !867, !869, !870, !871, !872, !878, !883, !884, !888, !889, !890, !891, !892, !905, !917, !931, !935, !939, !943, !952, !964, !968, !972, !976, !980, !984, !985, !986, !987, !988, !989, !993, !994, !995, !996, !1000, !1001, !1002, !1003, !1004, !1009, !1010, !1011, !1012, !1013, !1017, !1018, !1019, !1020, !1021, !1028, !1039, !1044, !1050, !1060, !1066, !1077, !1084, !1091, !1095, !1100, !1104, !1109, !1110, !1111, !1118, !1124, !1125, !1126, !1131, !1132, !1141, !1250, !1254, !1262, !1266, !1270, !1274, !1282, !1292}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "vertData", scope: !807, file: !30, line: 180, baseType: !810, size: 1600)
!810 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomData", file: !96, line: 73, baseType: !811)
!811 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomData", file: !96, line: 64, size: 1600, elements: !812)
!812 = !{!813, !828, !832, !833, !834, !835, !838}
!813 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !811, file: !96, line: 65, baseType: !814, size: 64)
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !815, size: 64)
!815 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataLayer", file: !96, line: 53, baseType: !816)
!816 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataLayer", file: !96, line: 42, size: 832, elements: !817)
!817 = !{!818, !819, !820, !821, !822, !823, !824, !825, !826, !827}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !816, file: !96, line: 43, baseType: !141, size: 32)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !816, file: !96, line: 44, baseType: !141, size: 32, offset: 32)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !816, file: !96, line: 45, baseType: !141, size: 32, offset: 64)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !816, file: !96, line: 46, baseType: !141, size: 32, offset: 96)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "active_rnd", scope: !816, file: !96, line: 47, baseType: !141, size: 32, offset: 128)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "active_clone", scope: !816, file: !96, line: 48, baseType: !141, size: 32, offset: 160)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "active_mask", scope: !816, file: !96, line: 49, baseType: !141, size: 32, offset: 192)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !816, file: !96, line: 50, baseType: !141, size: 32, offset: 224)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !816, file: !96, line: 51, baseType: !300, size: 512, offset: 256)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !816, file: !96, line: 52, baseType: !255, size: 64, offset: 768)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "typemap", scope: !811, file: !96, line: 66, baseType: !829, size: 1312, offset: 64)
!829 = !DICompositeType(tag: DW_TAG_array_type, baseType: !141, size: 1312, elements: !830)
!830 = !{!831}
!831 = !DISubrange(count: 41)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "totlayer", scope: !811, file: !96, line: 69, baseType: !141, size: 32, offset: 1376)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "maxlayer", scope: !811, file: !96, line: 69, baseType: !141, size: 32, offset: 1408)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "totsize", scope: !811, file: !96, line: 70, baseType: !141, size: 32, offset: 1440)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !811, file: !96, line: 71, baseType: !836, size: 64, offset: 1472)
!836 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !837, size: 64)
!837 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool", file: !96, line: 71, flags: DIFlagFwdDecl)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !811, file: !96, line: 72, baseType: !839, size: 64, offset: 1536)
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !840, size: 64)
!840 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataExternal", file: !96, line: 59, baseType: !841)
!841 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataExternal", file: !96, line: 57, size: 8192, elements: !842)
!842 = !{!843}
!843 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !841, file: !96, line: 58, baseType: !270, size: 8192)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "edgeData", scope: !807, file: !30, line: 180, baseType: !810, size: 1600, offset: 1600)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "faceData", scope: !807, file: !30, line: 180, baseType: !810, size: 1600, offset: 3200)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "loopData", scope: !807, file: !30, line: 180, baseType: !810, size: 1600, offset: 4800)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "polyData", scope: !807, file: !30, line: 180, baseType: !810, size: 1600, offset: 6400)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "numVertData", scope: !807, file: !30, line: 181, baseType: !141, size: 32, offset: 8000)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "numEdgeData", scope: !807, file: !30, line: 181, baseType: !141, size: 32, offset: 8032)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "numTessFaceData", scope: !807, file: !30, line: 181, baseType: !141, size: 32, offset: 8064)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "numLoopData", scope: !807, file: !30, line: 181, baseType: !141, size: 32, offset: 8096)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "numPolyData", scope: !807, file: !30, line: 181, baseType: !141, size: 32, offset: 8128)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "needsFree", scope: !807, file: !30, line: 182, baseType: !141, size: 32, offset: 8160)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "deformedOnly", scope: !807, file: !30, line: 183, baseType: !141, size: 32, offset: 8192)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "bvhCache", scope: !807, file: !30, line: 184, baseType: !856, size: 64, offset: 8256)
!856 = !DIDerivedType(tag: DW_TAG_typedef, name: "BVHCache", file: !857, line: 124, baseType: !858)
!857 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_bvhutils.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!858 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !859, size: 64)
!859 = !DICompositeType(tag: DW_TAG_structure_type, name: "LinkNode", file: !860, line: 118, flags: DIFlagFwdDecl)
!860 = !DIFile(filename: "blender/source/blender/blenlib/BLI_fileops.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!861 = !DIDerivedType(tag: DW_TAG_member, name: "drawObject", scope: !807, file: !30, line: 185, baseType: !862, size: 64, offset: 8320)
!862 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !863, size: 64)
!863 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUDrawObject", file: !30, line: 97, flags: DIFlagFwdDecl)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !807, file: !30, line: 186, baseType: !865, size: 32, offset: 8384)
!865 = !DIDerivedType(tag: DW_TAG_typedef, name: "DerivedMeshType", file: !30, line: 132, baseType: !29)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "auto_bump_scale", scope: !807, file: !30, line: 187, baseType: !366, size: 32, offset: 8416)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "dirty", scope: !807, file: !30, line: 188, baseType: !868, size: 32, offset: 8448)
!868 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMDirtyFlag", file: !30, line: 175, baseType: !35)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "totmat", scope: !807, file: !30, line: 189, baseType: !141, size: 32, offset: 8480)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !807, file: !30, line: 190, baseType: !677, size: 64, offset: 8512)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "cd_flag", scope: !807, file: !30, line: 193, baseType: !271, size: 8, offset: 8576)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "calcNormals", scope: !807, file: !30, line: 196, baseType: !873, size: 64, offset: 8640)
!873 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !874, size: 64)
!874 = !DISubroutineType(types: !875)
!875 = !{null, !876}
!876 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !877, size: 64)
!877 = !DIDerivedType(tag: DW_TAG_typedef, name: "DerivedMesh", file: !30, line: 177, baseType: !807)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "calcLoopNormals", scope: !807, file: !30, line: 199, baseType: !879, size: 64, offset: 8704)
!879 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !880, size: 64)
!880 = !DISubroutineType(types: !881)
!881 = !{null, !876, !882}
!882 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !366)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "recalcTessellation", scope: !807, file: !30, line: 202, baseType: !873, size: 64, offset: 8768)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "getNumVerts", scope: !807, file: !30, line: 207, baseType: !885, size: 64, offset: 8832)
!885 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !886, size: 64)
!886 = !DISubroutineType(types: !887)
!887 = !{!141, !876}
!888 = !DIDerivedType(tag: DW_TAG_member, name: "getNumEdges", scope: !807, file: !30, line: 208, baseType: !885, size: 64, offset: 8896)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "getNumTessFaces", scope: !807, file: !30, line: 209, baseType: !885, size: 64, offset: 8960)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "getNumLoops", scope: !807, file: !30, line: 210, baseType: !885, size: 64, offset: 9024)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "getNumPolys", scope: !807, file: !30, line: 211, baseType: !885, size: 64, offset: 9088)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "getVert", scope: !807, file: !30, line: 218, baseType: !893, size: 64, offset: 9152)
!893 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !894, size: 64)
!894 = !DISubroutineType(types: !895)
!895 = !{null, !876, !141, !896}
!896 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !897, size: 64)
!897 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MVert", file: !898, line: 65, size: 160, elements: !899)
!898 = !DIFile(filename: "blender/source/blender/makesdna/DNA_meshdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!899 = !{!900, !901, !903, !904}
!900 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !897, file: !898, line: 66, baseType: !408, size: 96)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !897, file: !898, line: 67, baseType: !902, size: 48, offset: 96)
!902 = !DICompositeType(tag: DW_TAG_array_type, baseType: !284, size: 48, elements: !409)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !897, file: !898, line: 68, baseType: !271, size: 8, offset: 144)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "bweight", scope: !897, file: !898, line: 68, baseType: !271, size: 8, offset: 152)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "getEdge", scope: !807, file: !30, line: 219, baseType: !906, size: 64, offset: 9216)
!906 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !907, size: 64)
!907 = !DISubroutineType(types: !908)
!908 = !{null, !876, !141, !909}
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 64)
!910 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MEdge", file: !898, line: 48, size: 96, elements: !911)
!911 = !{!912, !913, !914, !915, !916}
!912 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !910, file: !898, line: 49, baseType: !5, size: 32)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !910, file: !898, line: 49, baseType: !5, size: 32, offset: 32)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "crease", scope: !910, file: !898, line: 50, baseType: !271, size: 8, offset: 64)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "bweight", scope: !910, file: !898, line: 50, baseType: !271, size: 8, offset: 72)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !910, file: !898, line: 51, baseType: !284, size: 16, offset: 80)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFace", scope: !807, file: !30, line: 220, baseType: !918, size: 64, offset: 9280)
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !919, size: 64)
!919 = !DISubroutineType(types: !920)
!920 = !{null, !876, !141, !921}
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !922, size: 64)
!922 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MFace", file: !898, line: 42, size: 160, elements: !923)
!923 = !{!924, !925, !926, !927, !928, !929, !930}
!924 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !922, file: !898, line: 43, baseType: !5, size: 32)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !922, file: !898, line: 43, baseType: !5, size: 32, offset: 32)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !922, file: !898, line: 43, baseType: !5, size: 32, offset: 64)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !922, file: !898, line: 43, baseType: !5, size: 32, offset: 96)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !922, file: !898, line: 44, baseType: !284, size: 16, offset: 128)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "edcode", scope: !922, file: !898, line: 45, baseType: !271, size: 8, offset: 144)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !922, file: !898, line: 45, baseType: !271, size: 8, offset: 152)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "getVertArray", scope: !807, file: !30, line: 227, baseType: !932, size: 64, offset: 9344)
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 64)
!933 = !DISubroutineType(types: !934)
!934 = !{!896, !876}
!935 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeArray", scope: !807, file: !30, line: 228, baseType: !936, size: 64, offset: 9408)
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 64)
!937 = !DISubroutineType(types: !938)
!938 = !{!909, !876}
!939 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceArray", scope: !807, file: !30, line: 229, baseType: !940, size: 64, offset: 9472)
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 64)
!941 = !DISubroutineType(types: !942)
!942 = !{!921, !876}
!943 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopArray", scope: !807, file: !30, line: 230, baseType: !944, size: 64, offset: 9536)
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 64)
!945 = !DISubroutineType(types: !946)
!946 = !{!947, !876}
!947 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !948, size: 64)
!948 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MLoop", file: !898, line: 88, size: 64, elements: !949)
!949 = !{!950, !951}
!950 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !948, file: !898, line: 89, baseType: !5, size: 32)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !948, file: !898, line: 90, baseType: !5, size: 32, offset: 32)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyArray", scope: !807, file: !30, line: 231, baseType: !953, size: 64, offset: 9600)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64)
!954 = !DISubroutineType(types: !955)
!955 = !{!956, !876}
!956 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 64)
!957 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MPoly", file: !898, line: 79, size: 96, elements: !958)
!958 = !{!959, !960, !961, !962, !963}
!959 = !DIDerivedType(tag: DW_TAG_member, name: "loopstart", scope: !957, file: !898, line: 81, baseType: !141, size: 32)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !957, file: !898, line: 82, baseType: !141, size: 32, offset: 32)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !957, file: !898, line: 83, baseType: !284, size: 16, offset: 64)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !957, file: !898, line: 84, baseType: !271, size: 8, offset: 80)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !957, file: !898, line: 84, baseType: !271, size: 8, offset: 88)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "copyVertArray", scope: !807, file: !30, line: 236, baseType: !965, size: 64, offset: 9664)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64)
!966 = !DISubroutineType(types: !967)
!967 = !{null, !876, !896}
!968 = !DIDerivedType(tag: DW_TAG_member, name: "copyEdgeArray", scope: !807, file: !30, line: 237, baseType: !969, size: 64, offset: 9728)
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 64)
!970 = !DISubroutineType(types: !971)
!971 = !{null, !876, !909}
!972 = !DIDerivedType(tag: DW_TAG_member, name: "copyTessFaceArray", scope: !807, file: !30, line: 238, baseType: !973, size: 64, offset: 9792)
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64)
!974 = !DISubroutineType(types: !975)
!975 = !{null, !876, !921}
!976 = !DIDerivedType(tag: DW_TAG_member, name: "copyLoopArray", scope: !807, file: !30, line: 239, baseType: !977, size: 64, offset: 9856)
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 64)
!978 = !DISubroutineType(types: !979)
!979 = !{null, !876, !947}
!980 = !DIDerivedType(tag: DW_TAG_member, name: "copyPolyArray", scope: !807, file: !30, line: 240, baseType: !981, size: 64, offset: 9920)
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 64)
!982 = !DISubroutineType(types: !983)
!983 = !{null, !876, !956}
!984 = !DIDerivedType(tag: DW_TAG_member, name: "dupVertArray", scope: !807, file: !30, line: 245, baseType: !932, size: 64, offset: 9984)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "dupEdgeArray", scope: !807, file: !30, line: 246, baseType: !936, size: 64, offset: 10048)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "dupTessFaceArray", scope: !807, file: !30, line: 247, baseType: !940, size: 64, offset: 10112)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "dupLoopArray", scope: !807, file: !30, line: 248, baseType: !944, size: 64, offset: 10176)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "dupPolyArray", scope: !807, file: !30, line: 249, baseType: !953, size: 64, offset: 10240)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "getVertData", scope: !807, file: !30, line: 255, baseType: !990, size: 64, offset: 10304)
!990 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !991, size: 64)
!991 = !DISubroutineType(types: !992)
!992 = !{!255, !876, !141, !141}
!993 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeData", scope: !807, file: !30, line: 256, baseType: !990, size: 64, offset: 10368)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceData", scope: !807, file: !30, line: 257, baseType: !990, size: 64, offset: 10432)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyData", scope: !807, file: !30, line: 258, baseType: !990, size: 64, offset: 10496)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "getVertDataArray", scope: !807, file: !30, line: 264, baseType: !997, size: 64, offset: 10560)
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !998, size: 64)
!998 = !DISubroutineType(types: !999)
!999 = !{!255, !876, !141}
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeDataArray", scope: !807, file: !30, line: 265, baseType: !997, size: 64, offset: 10624)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceDataArray", scope: !807, file: !30, line: 266, baseType: !997, size: 64, offset: 10688)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopDataArray", scope: !807, file: !30, line: 267, baseType: !997, size: 64, offset: 10752)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyDataArray", scope: !807, file: !30, line: 268, baseType: !997, size: 64, offset: 10816)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "getVertDataLayout", scope: !807, file: !30, line: 272, baseType: !1005, size: 64, offset: 10880)
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1006, size: 64)
!1006 = !DISubroutineType(types: !1007)
!1007 = !{!1008, !876}
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeDataLayout", scope: !807, file: !30, line: 273, baseType: !1005, size: 64, offset: 10944)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceDataLayout", scope: !807, file: !30, line: 274, baseType: !1005, size: 64, offset: 11008)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopDataLayout", scope: !807, file: !30, line: 275, baseType: !1005, size: 64, offset: 11072)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyDataLayout", scope: !807, file: !30, line: 276, baseType: !1005, size: 64, offset: 11136)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromVertCData", scope: !807, file: !30, line: 279, baseType: !1014, size: 64, offset: 11200)
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64)
!1015 = !DISubroutineType(types: !1016)
!1016 = !{null, !876, !141, !1008, !141}
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromEdgeCData", scope: !807, file: !30, line: 280, baseType: !1014, size: 64, offset: 11264)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromFaceCData", scope: !807, file: !30, line: 281, baseType: !1014, size: 64, offset: 11328)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "getNumGrids", scope: !807, file: !30, line: 284, baseType: !885, size: 64, offset: 11392)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "getGridSize", scope: !807, file: !30, line: 285, baseType: !885, size: 64, offset: 11456)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "getGridData", scope: !807, file: !30, line: 286, baseType: !1022, size: 64, offset: 11520)
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 64)
!1023 = !DISubroutineType(types: !1024)
!1024 = !{!1025, !876}
!1025 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1026, size: 64)
!1026 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1027, size: 64)
!1027 = !DICompositeType(tag: DW_TAG_structure_type, name: "CCGElem", file: !30, line: 82, flags: DIFlagFwdDecl)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "getGridAdjacency", scope: !807, file: !30, line: 287, baseType: !1029, size: 64, offset: 11584)
!1029 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1030, size: 64)
!1030 = !DISubroutineType(types: !1031)
!1031 = !{!1032, !876}
!1032 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1033, size: 64)
!1033 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMGridAdjacency", file: !30, line: 120, baseType: !1034)
!1034 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DMGridAdjacency", file: !30, line: 117, size: 256, elements: !1035)
!1035 = !{!1036, !1038}
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1034, file: !30, line: 118, baseType: !1037, size: 128)
!1037 = !DICompositeType(tag: DW_TAG_array_type, baseType: !141, size: 128, elements: !695)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "rotation", scope: !1034, file: !30, line: 119, baseType: !1037, size: 128, offset: 128)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "getGridOffset", scope: !807, file: !30, line: 288, baseType: !1040, size: 64, offset: 11648)
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1041, size: 64)
!1041 = !DISubroutineType(types: !1042)
!1042 = !{!1043, !876}
!1043 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "getGridKey", scope: !807, file: !30, line: 289, baseType: !1045, size: 64, offset: 11712)
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 64)
!1046 = !DISubroutineType(types: !1047)
!1047 = !{null, !876, !1048}
!1048 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1049, size: 64)
!1049 = !DICompositeType(tag: DW_TAG_structure_type, name: "CCGKey", file: !30, line: 83, flags: DIFlagFwdDecl)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "getGridFlagMats", scope: !807, file: !30, line: 290, baseType: !1051, size: 64, offset: 11776)
!1051 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1052, size: 64)
!1052 = !DISubroutineType(types: !1053)
!1053 = !{!1054, !876}
!1054 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1055, size: 64)
!1055 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMFlagMat", file: !30, line: 126, baseType: !1056)
!1056 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DMFlagMat", file: !30, line: 123, size: 32, elements: !1057)
!1057 = !{!1058, !1059}
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !1056, file: !30, line: 124, baseType: !284, size: 16)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1056, file: !30, line: 125, baseType: !271, size: 8, offset: 16)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "getGridHidden", scope: !807, file: !30, line: 291, baseType: !1061, size: 64, offset: 11840)
!1061 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1062, size: 64)
!1062 = !DISubroutineType(types: !1063)
!1063 = !{!1064, !876}
!1064 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1065, size: 64)
!1065 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedVert", scope: !807, file: !30, line: 299, baseType: !1067, size: 64, offset: 11904)
!1067 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1068, size: 64)
!1068 = !DISubroutineType(types: !1069)
!1069 = !{null, !876, !1070, !255, !1076}
!1070 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1071, size: 64)
!1071 = !DISubroutineType(types: !1072)
!1072 = !{null, !255, !141, !1073, !1073, !1074}
!1073 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !882, size: 64)
!1074 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1075, size: 64)
!1075 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !284)
!1076 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMForeachFlag", file: !30, line: 162, baseType: !40)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedEdge", scope: !807, file: !30, line: 309, baseType: !1078, size: 64, offset: 11968)
!1078 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1079, size: 64)
!1079 = !DISubroutineType(types: !1080)
!1080 = !{null, !876, !1081, !255}
!1081 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1082, size: 64)
!1082 = !DISubroutineType(types: !1083)
!1083 = !{null, !255, !141, !1073, !1073}
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedLoop", scope: !807, file: !30, line: 317, baseType: !1085, size: 64, offset: 12032)
!1085 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1086, size: 64)
!1086 = !DISubroutineType(types: !1087)
!1087 = !{null, !876, !1088, !255, !1076}
!1088 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1089, size: 64)
!1089 = !DISubroutineType(types: !1090)
!1090 = !{null, !255, !141, !141, !1073, !1073}
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedFaceCenter", scope: !807, file: !30, line: 327, baseType: !1092, size: 64, offset: 12096)
!1092 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1093, size: 64)
!1093 = !DISubroutineType(types: !1094)
!1094 = !{null, !876, !1081, !255, !1076}
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "getMinMax", scope: !807, file: !30, line: 337, baseType: !1096, size: 64, offset: 12160)
