; ModuleID = 'blender/source/blender/editors/armature/pose_group.c'
source_filename = "blender/source/blender/editors/armature/pose_group.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.EnumPropertyItem = type { i32, i8*, i32, i8*, i8* }
%struct.wmOperatorType = type { i8*, i8*, i8*, i8*, i32 (%struct.bContext*, %struct.wmOperator*)*, i8 (%struct.bContext*, %struct.wmOperator*)*, i32 (%struct.bContext*, %struct.wmOperator*, %struct.wmEvent*)*, void (%struct.bContext*, %struct.wmOperator*)*, i32 (%struct.bContext*, %struct.wmOperator*, %struct.wmEvent*)*, i32 (%struct.bContext*)*, void (%struct.bContext*, %struct.wmOperator*)*, %struct.StructRNA*, %struct.IDProperty*, %struct.PropertyRNA*, %struct.ListBase, %struct.wmKeyMap*, i8*, i32 (%struct.bContext*, %struct.wmOperatorType*)*, %struct.ExtensionRNA, i16 }
%struct.bContext = type opaque
%struct.wmOperator = type { %struct.wmOperator*, %struct.wmOperator*, [64 x i8], %struct.IDProperty*, %struct.wmOperatorType*, i8*, i8*, %struct.PointerRNA*, %struct.ReportList*, %struct.ListBase, %struct.wmOperator*, %struct.uiLayout*, i16, [3 x i16] }
%struct.PointerRNA = type { %struct.anon, %struct.StructRNA*, i8* }
%struct.anon = type { i8* }
%struct.ReportList = type { %struct.ListBase, i32, i32, i32, i32, %struct.wmTimer* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "group_slot_move", scope: !2, file: !3, line: 338, type: !2722, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "POSE_OT_group_move", scope: !3, file: !3, line: 336, type: !4, scopeLine: 337, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !1806, retainedNodes: !2721)
!3 = !DIFile(filename: "blender/source/blender/editors/armature/pose_group.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !DISubroutineType(types: !5)
!5 = !{null, !6}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "wmOperatorType", file: !8, line: 568, baseType: !9)
!8 = !DIFile(filename: "blender/source/blender/windowmanager/WM_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmOperatorType", file: !8, line: 508, size: 1536, elements: !10)
!10 = !{!11, !15, !16, !17, !18, !1732, !1736, !1742, !1746, !1747, !1751, !1752, !1753, !1754, !1758, !1759, !1774, !1775, !1779, !1805}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !9, file: !8, line: 509, baseType: !12, size: 64)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!13 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !14)
!14 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !9, file: !8, line: 510, baseType: !12, size: 64, offset: 64)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "translation_context", scope: !9, file: !8, line: 511, baseType: !12, size: 64, offset: 128)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !9, file: !8, line: 512, baseType: !12, size: 64, offset: 192)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !9, file: !8, line: 518, baseType: !19, size: 64, offset: 256)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!20 = !DISubroutineType(types: !21)
!21 = !{!22, !23, !26}
!22 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!24 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !25, line: 44, flags: DIFlagFwdDecl)
!25 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!27 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmOperator", file: !28, line: 328, size: 1344, elements: !29)
!28 = !DIFile(filename: "blender/source/blender/makesdna/DNA_windowmanager_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!29 = !{!30, !31, !32, !36, !68, !70, !71, !72, !84, !1725, !1726, !1727, !1730, !1731}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !27, file: !28, line: 329, baseType: !26, size: 64)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !27, file: !28, line: 329, baseType: !26, size: 64, offset: 64)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !27, file: !28, line: 332, baseType: !33, size: 512, offset: 128)
!33 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 512, elements: !34)
!34 = !{!35}
!35 = !DISubrange(count: 64)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !27, file: !28, line: 333, baseType: !37, size: 64, offset: 640)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !39, line: 75, baseType: !40)
!39 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!40 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !39, line: 62, size: 1024, elements: !41)
!41 = !{!42, !44, !45, !46, !47, !49, !50, !51, !66, !67}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !40, file: !39, line: 63, baseType: !43, size: 64)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !40, file: !39, line: 63, baseType: !43, size: 64, offset: 64)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !40, file: !39, line: 64, baseType: !14, size: 8, offset: 128)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !40, file: !39, line: 64, baseType: !14, size: 8, offset: 136)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !40, file: !39, line: 65, baseType: !48, size: 16, offset: 144)
!48 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !40, file: !39, line: 66, baseType: !33, size: 512, offset: 160)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !40, file: !39, line: 67, baseType: !22, size: 32, offset: 672)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !40, file: !39, line: 69, baseType: !52, size: 256, offset: 704)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !39, line: 60, baseType: !53)
!53 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !39, line: 48, size: 256, elements: !54)
!54 = !{!55, !57, !64, !65}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !53, file: !39, line: 49, baseType: !56, size: 64)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !53, file: !39, line: 58, baseType: !58, size: 128, offset: 64)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !59, line: 71, baseType: !60)
!59 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!60 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !59, line: 69, size: 128, elements: !61)
!61 = !{!62, !63}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !60, file: !59, line: 70, baseType: !56, size: 64)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !60, file: !59, line: 70, baseType: !56, size: 64, offset: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !53, file: !39, line: 59, baseType: !22, size: 32, offset: 192)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !53, file: !39, line: 59, baseType: !22, size: 32, offset: 224)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !40, file: !39, line: 70, baseType: !22, size: 32, offset: 960)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !40, file: !39, line: 74, baseType: !22, size: 32, offset: 992)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !27, file: !28, line: 336, baseType: !69, size: 64, offset: 704)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !27, file: !28, line: 337, baseType: !56, size: 64, offset: 768)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "py_instance", scope: !27, file: !28, line: 338, baseType: !56, size: 64, offset: 832)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !27, file: !28, line: 340, baseType: !73, size: 64, offset: 896)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !25, line: 55, size: 192, elements: !75)
!75 = !{!76, !80, !83}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !74, file: !25, line: 58, baseType: !77, size: 64)
!77 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !74, file: !25, line: 56, size: 64, elements: !78)
!78 = !{!79}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !77, file: !25, line: 57, baseType: !56, size: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !74, file: !25, line: 60, baseType: !81, size: 64, offset: 64)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!82 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !25, line: 41, flags: DIFlagFwdDecl)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !74, file: !25, line: 61, baseType: !56, size: 64, offset: 128)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "reports", scope: !27, file: !28, line: 341, baseType: !85, size: 64, offset: 960)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ReportList", file: !28, line: 106, size: 320, elements: !87)
!87 = !{!88, !89, !90, !91, !92, !93}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !86, file: !28, line: 107, baseType: !58, size: 128)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "printlevel", scope: !86, file: !28, line: 108, baseType: !22, size: 32, offset: 128)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "storelevel", scope: !86, file: !28, line: 109, baseType: !22, size: 32, offset: 160)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !86, file: !28, line: 110, baseType: !22, size: 32, offset: 192)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !86, file: !28, line: 110, baseType: !22, size: 32, offset: 224)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "reporttimer", scope: !86, file: !28, line: 111, baseType: !94, size: 64, offset: 256)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTimer", file: !8, line: 490, size: 768, elements: !96)
!96 = !{!97, !98, !99, !1716, !1717, !1718, !1719, !1720, !1721, !1722, !1723, !1724}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !95, file: !8, line: 491, baseType: !94, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !95, file: !8, line: 491, baseType: !94, size: 64, offset: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "win", scope: !95, file: !8, line: 493, baseType: !100, size: 64, offset: 128)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindow", file: !28, line: 169, size: 2048, elements: !102)
!102 = !{!103, !104, !105, !106, !1633, !1634, !1635, !1636, !1637, !1638, !1639, !1640, !1641, !1642, !1643, !1644, !1645, !1646, !1647, !1648, !1649, !1650, !1691, !1694, !1708, !1709, !1710, !1711, !1712, !1713, !1714, !1715}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !101, file: !28, line: 170, baseType: !100, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !101, file: !28, line: 170, baseType: !100, size: 64, offset: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "ghostwin", scope: !101, file: !28, line: 172, baseType: !56, size: 64, offset: 128)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !101, file: !28, line: 174, baseType: !107, size: 64, offset: 192)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !109, line: 49, size: 1984, elements: !110)
!109 = !DIFile(filename: "blender/source/blender/makesdna/DNA_screen_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!110 = !{!111, !147, !148, !149, !150, !151, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1623, !1624, !1625, !1626, !1627, !1628, !1629, !1630, !1631, !1632}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !108, file: !109, line: 50, baseType: !112, size: 960)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !39, line: 130, baseType: !113)
!113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !39, line: 117, size: 960, elements: !114)
!114 = !{!115, !116, !117, !119, !138, !142, !143, !144, !145, !146}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !113, file: !39, line: 118, baseType: !56, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !113, file: !39, line: 118, baseType: !56, size: 64, offset: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !113, file: !39, line: 119, baseType: !118, size: 64, offset: 128)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !113, file: !39, line: 120, baseType: !120, size: 64, offset: 192)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !39, line: 136, size: 17600, elements: !122)
!122 = !{!123, !124, !126, !129, !133, !134, !135}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !121, file: !39, line: 137, baseType: !112, size: 960)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !121, file: !39, line: 138, baseType: !125, size: 64, offset: 960)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !121, file: !39, line: 139, baseType: !127, size: 64, offset: 1024)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !39, line: 43, flags: DIFlagFwdDecl)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !121, file: !39, line: 140, baseType: !130, size: 8192, offset: 1088)
!130 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 8192, elements: !131)
!131 = !{!132}
!132 = !DISubrange(count: 1024)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !121, file: !39, line: 141, baseType: !130, size: 8192, offset: 9280)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !121, file: !39, line: 148, baseType: !120, size: 64, offset: 17472)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !121, file: !39, line: 150, baseType: !136, size: 64, offset: 17536)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !39, line: 45, flags: DIFlagFwdDecl)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !113, file: !39, line: 121, baseType: !139, size: 528, offset: 256)
!139 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 528, elements: !140)
!140 = !{!141}
!141 = !DISubrange(count: 66)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !113, file: !39, line: 126, baseType: !48, size: 16, offset: 784)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !113, file: !39, line: 127, baseType: !22, size: 32, offset: 800)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !113, file: !39, line: 128, baseType: !22, size: 32, offset: 832)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !113, file: !39, line: 128, baseType: !22, size: 32, offset: 864)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !113, file: !39, line: 129, baseType: !37, size: 64, offset: 896)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "vertbase", scope: !108, file: !109, line: 52, baseType: !58, size: 128, offset: 960)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "edgebase", scope: !108, file: !109, line: 53, baseType: !58, size: 128, offset: 1088)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "areabase", scope: !108, file: !109, line: 54, baseType: !58, size: 128, offset: 1216)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !108, file: !109, line: 55, baseType: !58, size: 128, offset: 1344)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !108, file: !109, line: 57, baseType: !152, size: 64, offset: 1472)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !154, line: 1216, size: 39680, elements: !155)
!154 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!155 = !{!156, !157, !161, !455, !458, !459, !460, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !486, !557, !985, !1200, !1203, !1491, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1513, !1514, !1515, !1516, !1517, !1525, !1592, !1599, !1600, !1607, !1608, !1609, !1610, !1611, !1612, !1613}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !153, file: !154, line: 1217, baseType: !112, size: 960)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !153, file: !154, line: 1218, baseType: !158, size: 64, offset: 960)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !160, line: 37, flags: DIFlagFwdDecl)
!160 = !DIFile(filename: "blender/source/blender/makesdna/DNA_armature_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!161 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !153, file: !154, line: 1220, baseType: !162, size: 64, offset: 1024)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !164, line: 115, size: 11392, elements: !165)
!164 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!165 = !{!166, !167, !168, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !186, !198, !212, !213, !257, !258, !261, !262, !278, !279, !280, !281, !282, !283, !284, !288, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !304, !305, !306, !307, !308, !309, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !369, !370, !371, !372, !373, !374, !375, !376, !377, !380, !383, !386, !387, !388, !389, !390, !393, !396, !399, !400, !406, !407, !408, !409, !410, !411, !413, !416, !419, !423, !443, !444}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !163, file: !164, line: 116, baseType: !112, size: 960)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !163, file: !164, line: 117, baseType: !158, size: 64, offset: 960)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !163, file: !164, line: 119, baseType: !169, size: 64, offset: 1024)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !164, line: 57, flags: DIFlagFwdDecl)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !163, file: !164, line: 121, baseType: !48, size: 16, offset: 1088)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !163, file: !164, line: 121, baseType: !48, size: 16, offset: 1104)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !163, file: !164, line: 122, baseType: !22, size: 32, offset: 1120)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !163, file: !164, line: 122, baseType: !22, size: 32, offset: 1152)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !163, file: !164, line: 122, baseType: !22, size: 32, offset: 1184)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !163, file: !164, line: 123, baseType: !33, size: 512, offset: 1216)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !163, file: !164, line: 124, baseType: !162, size: 64, offset: 1728)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !163, file: !164, line: 124, baseType: !162, size: 64, offset: 1792)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !163, file: !164, line: 127, baseType: !162, size: 64, offset: 1856)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !163, file: !164, line: 127, baseType: !162, size: 64, offset: 1920)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !163, file: !164, line: 127, baseType: !162, size: 64, offset: 1984)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !163, file: !164, line: 128, baseType: !183, size: 64, offset: 2048)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !185, line: 46, flags: DIFlagFwdDecl)
!185 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!186 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !163, file: !164, line: 130, baseType: !187, size: 64, offset: 2112)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !164, line: 97, size: 832, elements: !189)
!189 = !{!190, !196, !197}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !188, file: !164, line: 98, baseType: !191, size: 768)
!191 = !DICompositeType(tag: DW_TAG_array_type, baseType: !192, size: 768, elements: !193)
!192 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!193 = !{!194, !195}
!194 = !DISubrange(count: 8)
!195 = !DISubrange(count: 3)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !188, file: !164, line: 99, baseType: !22, size: 32, offset: 768)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !188, file: !164, line: 99, baseType: !22, size: 32, offset: 800)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !163, file: !164, line: 131, baseType: !199, size: 64, offset: 2176)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!200 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !201, line: 486, size: 1600, elements: !202)
!201 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!202 = !{!203, !204, !205, !206, !207, !208, !209, !210, !211}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !200, file: !201, line: 487, baseType: !112, size: 960)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !200, file: !201, line: 489, baseType: !58, size: 128, offset: 960)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !200, file: !201, line: 490, baseType: !58, size: 128, offset: 1088)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !200, file: !201, line: 491, baseType: !58, size: 128, offset: 1216)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !200, file: !201, line: 492, baseType: !58, size: 128, offset: 1344)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !200, file: !201, line: 494, baseType: !22, size: 32, offset: 1472)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !200, file: !201, line: 495, baseType: !22, size: 32, offset: 1504)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !200, file: !201, line: 497, baseType: !22, size: 32, offset: 1536)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !200, file: !201, line: 498, baseType: !22, size: 32, offset: 1568)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !163, file: !164, line: 132, baseType: !199, size: 64, offset: 2240)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !163, file: !164, line: 133, baseType: !214, size: 64, offset: 2304)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !201, line: 334, size: 1728, elements: !216)
!216 = !{!217, !218, !221, !222, !223, !225, !226, !227, !230, !231, !232, !233, !234, !235, !236, !256}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !215, file: !201, line: 335, baseType: !58, size: 128)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !215, file: !201, line: 336, baseType: !219, size: 64, offset: 128)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!220 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !201, line: 47, flags: DIFlagFwdDecl)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !215, file: !201, line: 338, baseType: !48, size: 16, offset: 192)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !215, file: !201, line: 338, baseType: !48, size: 16, offset: 208)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !215, file: !201, line: 339, baseType: !224, size: 32, offset: 224)
!224 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !215, file: !201, line: 340, baseType: !22, size: 32, offset: 256)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !215, file: !201, line: 342, baseType: !192, size: 32, offset: 288)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !215, file: !201, line: 343, baseType: !228, size: 96, offset: 320)
!228 = !DICompositeType(tag: DW_TAG_array_type, baseType: !192, size: 96, elements: !229)
!229 = !{!195}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !215, file: !201, line: 344, baseType: !228, size: 96, offset: 416)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !215, file: !201, line: 347, baseType: !58, size: 128, offset: 512)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !215, file: !201, line: 349, baseType: !22, size: 32, offset: 640)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !215, file: !201, line: 350, baseType: !22, size: 32, offset: 672)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !215, file: !201, line: 351, baseType: !56, size: 64, offset: 704)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !215, file: !201, line: 352, baseType: !56, size: 64, offset: 768)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !215, file: !201, line: 354, baseType: !237, size: 384, offset: 832)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !201, line: 116, baseType: !238)
!238 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !201, line: 94, size: 384, elements: !239)
!239 = !{!240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !238, file: !201, line: 96, baseType: !22, size: 32)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !238, file: !201, line: 96, baseType: !22, size: 32, offset: 32)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !238, file: !201, line: 97, baseType: !22, size: 32, offset: 64)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !238, file: !201, line: 97, baseType: !22, size: 32, offset: 96)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !238, file: !201, line: 99, baseType: !48, size: 16, offset: 128)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !238, file: !201, line: 100, baseType: !48, size: 16, offset: 144)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !238, file: !201, line: 102, baseType: !48, size: 16, offset: 160)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !238, file: !201, line: 105, baseType: !48, size: 16, offset: 176)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !238, file: !201, line: 108, baseType: !48, size: 16, offset: 192)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !238, file: !201, line: 109, baseType: !48, size: 16, offset: 208)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !238, file: !201, line: 111, baseType: !48, size: 16, offset: 224)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !238, file: !201, line: 112, baseType: !48, size: 16, offset: 240)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !238, file: !201, line: 114, baseType: !22, size: 32, offset: 256)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !238, file: !201, line: 114, baseType: !22, size: 32, offset: 288)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !238, file: !201, line: 115, baseType: !22, size: 32, offset: 320)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !238, file: !201, line: 115, baseType: !22, size: 32, offset: 352)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !215, file: !201, line: 355, baseType: !33, size: 512, offset: 1216)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !163, file: !164, line: 134, baseType: !56, size: 64, offset: 2368)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !163, file: !164, line: 136, baseType: !259, size: 64, offset: 2432)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !164, line: 58, flags: DIFlagFwdDecl)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !163, file: !164, line: 138, baseType: !237, size: 384, offset: 2496)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !163, file: !164, line: 139, baseType: !263, size: 64, offset: 2880)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !201, line: 80, baseType: !265)
!265 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !201, line: 72, size: 192, elements: !266)
!266 = !{!267, !274, !275, !276, !277}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !265, file: !201, line: 73, baseType: !268, size: 64)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !201, line: 59, baseType: !270)
!270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !201, line: 56, size: 128, elements: !271)
!271 = !{!272, !273}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !270, file: !201, line: 57, baseType: !228, size: 96)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !270, file: !201, line: 58, baseType: !22, size: 32, offset: 96)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !265, file: !201, line: 74, baseType: !22, size: 32, offset: 64)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !265, file: !201, line: 76, baseType: !22, size: 32, offset: 96)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !265, file: !201, line: 77, baseType: !22, size: 32, offset: 128)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !265, file: !201, line: 79, baseType: !22, size: 32, offset: 160)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !163, file: !164, line: 141, baseType: !58, size: 128, offset: 2944)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !163, file: !164, line: 142, baseType: !58, size: 128, offset: 3072)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !163, file: !164, line: 143, baseType: !58, size: 128, offset: 3200)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !163, file: !164, line: 144, baseType: !58, size: 128, offset: 3328)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !163, file: !164, line: 146, baseType: !22, size: 32, offset: 3456)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !163, file: !164, line: 147, baseType: !22, size: 32, offset: 3488)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !163, file: !164, line: 150, baseType: !285, size: 64, offset: 3520)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!287 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !164, line: 50, flags: DIFlagFwdDecl)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !163, file: !164, line: 151, baseType: !289, size: 64, offset: 3584)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !163, file: !164, line: 152, baseType: !22, size: 32, offset: 3648)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !163, file: !164, line: 153, baseType: !22, size: 32, offset: 3680)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !163, file: !164, line: 156, baseType: !228, size: 96, offset: 3712)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !163, file: !164, line: 156, baseType: !228, size: 96, offset: 3808)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !163, file: !164, line: 156, baseType: !228, size: 96, offset: 3904)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !163, file: !164, line: 157, baseType: !228, size: 96, offset: 4000)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !163, file: !164, line: 158, baseType: !228, size: 96, offset: 4096)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !163, file: !164, line: 159, baseType: !228, size: 96, offset: 4192)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !163, file: !164, line: 160, baseType: !228, size: 96, offset: 4288)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !163, file: !164, line: 160, baseType: !228, size: 96, offset: 4384)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !163, file: !164, line: 161, baseType: !301, size: 128, offset: 4480)
!301 = !DICompositeType(tag: DW_TAG_array_type, baseType: !192, size: 128, elements: !302)
!302 = !{!303}
!303 = !DISubrange(count: 4)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !163, file: !164, line: 161, baseType: !301, size: 128, offset: 4608)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !163, file: !164, line: 162, baseType: !228, size: 96, offset: 4736)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !163, file: !164, line: 162, baseType: !228, size: 96, offset: 4832)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !163, file: !164, line: 163, baseType: !192, size: 32, offset: 4928)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !163, file: !164, line: 163, baseType: !192, size: 32, offset: 4960)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !163, file: !164, line: 164, baseType: !310, size: 512, offset: 4992)
!310 = !DICompositeType(tag: DW_TAG_array_type, baseType: !192, size: 512, elements: !311)
!311 = !{!303, !303}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !163, file: !164, line: 165, baseType: !310, size: 512, offset: 5504)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !163, file: !164, line: 166, baseType: !310, size: 512, offset: 6016)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !163, file: !164, line: 167, baseType: !310, size: 512, offset: 6528)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !163, file: !164, line: 176, baseType: !310, size: 512, offset: 7040)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !163, file: !164, line: 178, baseType: !224, size: 32, offset: 7552)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !163, file: !164, line: 180, baseType: !48, size: 16, offset: 7584)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !163, file: !164, line: 181, baseType: !48, size: 16, offset: 7600)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !163, file: !164, line: 183, baseType: !48, size: 16, offset: 7616)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !163, file: !164, line: 183, baseType: !48, size: 16, offset: 7632)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !163, file: !164, line: 184, baseType: !48, size: 16, offset: 7648)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !163, file: !164, line: 184, baseType: !48, size: 16, offset: 7664)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !163, file: !164, line: 185, baseType: !48, size: 16, offset: 7680)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !163, file: !164, line: 186, baseType: !48, size: 16, offset: 7696)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !163, file: !164, line: 187, baseType: !48, size: 16, offset: 7712)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !163, file: !164, line: 188, baseType: !14, size: 8, offset: 7728)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !163, file: !164, line: 189, baseType: !14, size: 8, offset: 7736)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !163, file: !164, line: 192, baseType: !22, size: 32, offset: 7744)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !163, file: !164, line: 192, baseType: !22, size: 32, offset: 7776)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !163, file: !164, line: 192, baseType: !22, size: 32, offset: 7808)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !163, file: !164, line: 192, baseType: !22, size: 32, offset: 7840)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !163, file: !164, line: 194, baseType: !22, size: 32, offset: 7872)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !163, file: !164, line: 202, baseType: !192, size: 32, offset: 7904)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !163, file: !164, line: 202, baseType: !192, size: 32, offset: 7936)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !163, file: !164, line: 202, baseType: !192, size: 32, offset: 7968)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !163, file: !164, line: 211, baseType: !192, size: 32, offset: 8000)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !163, file: !164, line: 212, baseType: !192, size: 32, offset: 8032)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !163, file: !164, line: 213, baseType: !192, size: 32, offset: 8064)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !163, file: !164, line: 214, baseType: !192, size: 32, offset: 8096)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !163, file: !164, line: 215, baseType: !192, size: 32, offset: 8128)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !163, file: !164, line: 216, baseType: !192, size: 32, offset: 8160)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !163, file: !164, line: 219, baseType: !192, size: 32, offset: 8192)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !163, file: !164, line: 220, baseType: !192, size: 32, offset: 8224)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !163, file: !164, line: 221, baseType: !192, size: 32, offset: 8256)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !163, file: !164, line: 224, baseType: !346, size: 16, offset: 8288)
!346 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !163, file: !164, line: 224, baseType: !346, size: 16, offset: 8304)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !163, file: !164, line: 226, baseType: !48, size: 16, offset: 8320)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !163, file: !164, line: 228, baseType: !14, size: 8, offset: 8336)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !163, file: !164, line: 229, baseType: !14, size: 8, offset: 8344)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !163, file: !164, line: 231, baseType: !48, size: 16, offset: 8352)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !163, file: !164, line: 232, baseType: !14, size: 8, offset: 8368)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !163, file: !164, line: 233, baseType: !14, size: 8, offset: 8376)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !163, file: !164, line: 234, baseType: !192, size: 32, offset: 8384)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !163, file: !164, line: 235, baseType: !192, size: 32, offset: 8416)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !163, file: !164, line: 237, baseType: !58, size: 128, offset: 8448)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !163, file: !164, line: 238, baseType: !58, size: 128, offset: 8576)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !163, file: !164, line: 239, baseType: !58, size: 128, offset: 8704)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !163, file: !164, line: 240, baseType: !58, size: 128, offset: 8832)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !163, file: !164, line: 242, baseType: !192, size: 32, offset: 8960)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !163, file: !164, line: 244, baseType: !48, size: 16, offset: 8992)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !163, file: !164, line: 245, baseType: !346, size: 16, offset: 9008)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !163, file: !164, line: 246, baseType: !301, size: 128, offset: 9024)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !163, file: !164, line: 248, baseType: !22, size: 32, offset: 9152)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !163, file: !164, line: 249, baseType: !22, size: 32, offset: 9184)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !163, file: !164, line: 251, baseType: !367, size: 64, offset: 9216)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!368 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !164, line: 251, flags: DIFlagFwdDecl)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !163, file: !164, line: 253, baseType: !14, size: 8, offset: 9280)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !163, file: !164, line: 254, baseType: !14, size: 8, offset: 9288)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !163, file: !164, line: 255, baseType: !48, size: 16, offset: 9296)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !163, file: !164, line: 256, baseType: !228, size: 96, offset: 9312)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !163, file: !164, line: 258, baseType: !58, size: 128, offset: 9408)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !163, file: !164, line: 259, baseType: !58, size: 128, offset: 9536)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !163, file: !164, line: 260, baseType: !58, size: 128, offset: 9664)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !163, file: !164, line: 261, baseType: !58, size: 128, offset: 9792)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !163, file: !164, line: 263, baseType: !378, size: 64, offset: 9920)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!379 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !164, line: 52, flags: DIFlagFwdDecl)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !163, file: !164, line: 264, baseType: !381, size: 64, offset: 9984)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!382 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !164, line: 53, flags: DIFlagFwdDecl)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !163, file: !164, line: 265, baseType: !384, size: 64, offset: 10048)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64)
!385 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !201, line: 46, flags: DIFlagFwdDecl)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !163, file: !164, line: 267, baseType: !14, size: 8, offset: 10112)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !163, file: !164, line: 268, baseType: !14, size: 8, offset: 10120)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !163, file: !164, line: 269, baseType: !48, size: 16, offset: 10128)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !163, file: !164, line: 270, baseType: !192, size: 32, offset: 10144)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !163, file: !164, line: 272, baseType: !391, size: 64, offset: 10176)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!392 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !164, line: 54, flags: DIFlagFwdDecl)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !163, file: !164, line: 275, baseType: !394, size: 64, offset: 10240)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64)
!395 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !164, line: 275, flags: DIFlagFwdDecl)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !163, file: !164, line: 277, baseType: !397, size: 64, offset: 10304)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !164, line: 56, flags: DIFlagFwdDecl)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !163, file: !164, line: 277, baseType: !397, size: 64, offset: 10368)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !163, file: !164, line: 278, baseType: !401, size: 64, offset: 10432)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !402, line: 27, baseType: !403)
!402 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !404, line: 45, baseType: !405)
!404 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!405 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_mask", scope: !163, file: !164, line: 279, baseType: !401, size: 64, offset: 10496)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !163, file: !164, line: 280, baseType: !224, size: 32, offset: 10560)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !163, file: !164, line: 281, baseType: !224, size: 32, offset: 10592)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "gpulamp", scope: !163, file: !164, line: 283, baseType: !58, size: 128, offset: 10624)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "pc_ids", scope: !163, file: !164, line: 284, baseType: !58, size: 128, offset: 10752)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "duplilist", scope: !163, file: !164, line: 285, baseType: !412, size: 64, offset: 10880)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_object", scope: !163, file: !164, line: 287, baseType: !414, size: 64, offset: 10944)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!415 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyOb", file: !164, line: 59, flags: DIFlagFwdDecl)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_constraint", scope: !163, file: !164, line: 288, baseType: !417, size: 64, offset: 11008)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64)
!418 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyCon", file: !164, line: 288, flags: DIFlagFwdDecl)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "ima_ofs", scope: !163, file: !164, line: 290, baseType: !420, size: 64, offset: 11072)
!420 = !DICompositeType(tag: DW_TAG_array_type, baseType: !192, size: 64, elements: !421)
!421 = !{!422}
!422 = !DISubrange(count: 2)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !163, file: !164, line: 291, baseType: !424, size: 64, offset: 11136)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageUser", file: !426, line: 65, baseType: !427)
!426 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!427 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !426, line: 50, size: 320, elements: !428)
!428 = !{!429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !427, file: !426, line: 51, baseType: !152, size: 64)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !427, file: !426, line: 53, baseType: !22, size: 32, offset: 64)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !427, file: !426, line: 54, baseType: !22, size: 32, offset: 96)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !427, file: !426, line: 55, baseType: !22, size: 32, offset: 128)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !427, file: !426, line: 55, baseType: !22, size: 32, offset: 160)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !427, file: !426, line: 56, baseType: !14, size: 8, offset: 192)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "cycl", scope: !427, file: !426, line: 56, baseType: !14, size: 8, offset: 200)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !427, file: !426, line: 57, baseType: !14, size: 8, offset: 208)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !427, file: !426, line: 57, baseType: !14, size: 8, offset: 216)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "multi_index", scope: !427, file: !426, line: 59, baseType: !48, size: 16, offset: 224)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !427, file: !426, line: 59, baseType: !48, size: 16, offset: 240)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !427, file: !426, line: 59, baseType: !48, size: 16, offset: 256)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !427, file: !426, line: 61, baseType: !48, size: 16, offset: 272)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !427, file: !426, line: 63, baseType: !22, size: 32, offset: 288)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "lodlevels", scope: !163, file: !164, line: 293, baseType: !58, size: 128, offset: 11200)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "currentlod", scope: !163, file: !164, line: 294, baseType: !445, size: 64, offset: 11328)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64)
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "LodLevel", file: !164, line: 113, baseType: !447)
!447 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LodLevel", file: !164, line: 108, size: 256, elements: !448)
!448 = !{!449, !451, !452, !453, !454}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !447, file: !164, line: 109, baseType: !450, size: 64)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !447, file: !164, line: 109, baseType: !450, size: 64, offset: 64)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !447, file: !164, line: 110, baseType: !162, size: 64, offset: 128)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !447, file: !164, line: 111, baseType: !22, size: 32, offset: 192)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "distance", scope: !447, file: !164, line: 112, baseType: !192, size: 32, offset: 224)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !153, file: !154, line: 1221, baseType: !456, size: 64, offset: 1088)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64)
!457 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !154, line: 52, flags: DIFlagFwdDecl)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !153, file: !154, line: 1223, baseType: !152, size: 64, offset: 1152)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !153, file: !154, line: 1225, baseType: !58, size: 128, offset: 1216)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !153, file: !154, line: 1226, baseType: !461, size: 64, offset: 1344)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!462 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !154, line: 69, size: 320, elements: !463)
!463 = !{!464, !465, !466, !467, !468, !469, !470, !471}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !462, file: !154, line: 70, baseType: !461, size: 64)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !462, file: !154, line: 70, baseType: !461, size: 64, offset: 64)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !462, file: !154, line: 71, baseType: !224, size: 32, offset: 128)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !462, file: !154, line: 71, baseType: !224, size: 32, offset: 160)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !462, file: !154, line: 72, baseType: !22, size: 32, offset: 192)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !462, file: !154, line: 73, baseType: !48, size: 16, offset: 224)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !462, file: !154, line: 73, baseType: !48, size: 16, offset: 240)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !462, file: !154, line: 74, baseType: !162, size: 64, offset: 256)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !153, file: !154, line: 1227, baseType: !162, size: 64, offset: 1408)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !153, file: !154, line: 1229, baseType: !228, size: 96, offset: 1472)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !153, file: !154, line: 1230, baseType: !228, size: 96, offset: 1568)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !153, file: !154, line: 1231, baseType: !228, size: 96, offset: 1664)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !153, file: !154, line: 1231, baseType: !228, size: 96, offset: 1760)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !153, file: !154, line: 1233, baseType: !224, size: 32, offset: 1856)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !153, file: !154, line: 1234, baseType: !22, size: 32, offset: 1888)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !153, file: !154, line: 1235, baseType: !224, size: 32, offset: 1920)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !153, file: !154, line: 1237, baseType: !48, size: 16, offset: 1952)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !153, file: !154, line: 1239, baseType: !14, size: 8, offset: 1968)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !153, file: !154, line: 1240, baseType: !483, size: 8, offset: 1976)
!483 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 8, elements: !484)
!484 = !{!485}
!485 = !DISubrange(count: 1)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !153, file: !154, line: 1242, baseType: !487, size: 64, offset: 1984)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!488 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !489, line: 328, size: 3456, elements: !490)
!489 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!490 = !{!491, !492, !493, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !523, !524, !525, !528, !533, !534, !537, !541, !545, !549, !553, !554, !555, !556}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !488, file: !489, line: 329, baseType: !112, size: 960)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !488, file: !489, line: 330, baseType: !158, size: 64, offset: 960)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !488, file: !489, line: 332, baseType: !494, size: 64, offset: 1024)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64)
!495 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !489, line: 332, flags: DIFlagFwdDecl)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !488, file: !489, line: 333, baseType: !33, size: 512, offset: 1088)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "interface_type", scope: !488, file: !489, line: 335, baseType: !81, size: 64, offset: 1600)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !488, file: !489, line: 337, baseType: !259, size: 64, offset: 1664)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "view_center", scope: !488, file: !489, line: 338, baseType: !420, size: 64, offset: 1728)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !488, file: !489, line: 340, baseType: !58, size: 128, offset: 1792)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !488, file: !489, line: 340, baseType: !58, size: 128, offset: 1920)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !488, file: !489, line: 342, baseType: !22, size: 32, offset: 2048)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !488, file: !489, line: 342, baseType: !22, size: 32, offset: 2080)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "cur_index", scope: !488, file: !489, line: 343, baseType: !22, size: 32, offset: 2112)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !488, file: !489, line: 345, baseType: !22, size: 32, offset: 2144)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !488, file: !489, line: 346, baseType: !22, size: 32, offset: 2176)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "is_updating", scope: !488, file: !489, line: 347, baseType: !48, size: 16, offset: 2208)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !488, file: !489, line: 348, baseType: !48, size: 16, offset: 2224)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !488, file: !489, line: 349, baseType: !22, size: 32, offset: 2240)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "nodetype", scope: !488, file: !489, line: 351, baseType: !22, size: 32, offset: 2272)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "edit_quality", scope: !488, file: !489, line: 353, baseType: !48, size: 16, offset: 2304)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "render_quality", scope: !488, file: !489, line: 354, baseType: !48, size: 16, offset: 2320)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "chunksize", scope: !488, file: !489, line: 355, baseType: !22, size: 32, offset: 2336)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "viewer_border", scope: !488, file: !489, line: 357, baseType: !515, size: 128, offset: 2368)
!515 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !516, line: 95, baseType: !517)
!516 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!517 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !516, line: 92, size: 128, elements: !518)
!518 = !{!519, !520, !521, !522}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !517, file: !516, line: 93, baseType: !192, size: 32)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !517, file: !516, line: 93, baseType: !192, size: 32, offset: 32)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !517, file: !516, line: 94, baseType: !192, size: 32, offset: 64)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !517, file: !516, line: 94, baseType: !192, size: 32, offset: 96)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !488, file: !489, line: 363, baseType: !58, size: 128, offset: 2496)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !488, file: !489, line: 363, baseType: !58, size: 128, offset: 2624)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "previews", scope: !488, file: !489, line: 368, baseType: !526, size: 64, offset: 2752)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64)
!527 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHash", file: !489, line: 48, flags: DIFlagFwdDecl)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "active_viewer_key", scope: !488, file: !489, line: 372, baseType: !529, size: 32, offset: 2816)
!529 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !489, line: 274, baseType: !530)
!530 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !489, line: 271, size: 32, elements: !531)
!531 = !{!532}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !530, file: !489, line: 273, baseType: !224, size: 32)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !488, file: !489, line: 373, baseType: !22, size: 32, offset: 2848)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "execdata", scope: !488, file: !489, line: 382, baseType: !535, size: 64, offset: 2880)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64)
!536 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeExec", file: !489, line: 46, flags: DIFlagFwdDecl)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !488, file: !489, line: 385, baseType: !538, size: 64, offset: 2944)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64)
!539 = !DISubroutineType(types: !540)
!540 = !{null, !56, !192}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "stats_draw", scope: !488, file: !489, line: 386, baseType: !542, size: 64, offset: 3008)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64)
!543 = !DISubroutineType(types: !544)
!544 = !{null, !56, !289}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "test_break", scope: !488, file: !489, line: 387, baseType: !546, size: 64, offset: 3072)
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64)
!547 = !DISubroutineType(types: !548)
!548 = !{!22, !56}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "update_draw", scope: !488, file: !489, line: 388, baseType: !550, size: 64, offset: 3136)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64)
!551 = !DISubroutineType(types: !552)
!552 = !{null, !56}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "tbh", scope: !488, file: !489, line: 389, baseType: !56, size: 64, offset: 3200)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "prh", scope: !488, file: !489, line: 389, baseType: !56, size: 64, offset: 3264)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "sdh", scope: !488, file: !489, line: 389, baseType: !56, size: 64, offset: 3328)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "udh", scope: !488, file: !489, line: 389, baseType: !56, size: 64, offset: 3392)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !153, file: !154, line: 1244, baseType: !558, size: 64, offset: 2048)
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 64)
!559 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !560, line: 200, size: 17024, elements: !561)
!560 = !DIFile(filename: "blender/source/blender/makesdna/DNA_sequence_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!561 = !{!562, !563, !564, !565, !978, !979, !980, !981, !982, !983, !984}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "seqbasep", scope: !559, file: !560, line: 201, baseType: !412, size: 64)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !559, file: !560, line: 202, baseType: !58, size: 128, offset: 64)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "metastack", scope: !559, file: !560, line: 203, baseType: !58, size: 128, offset: 192)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "act_seq", scope: !559, file: !560, line: 206, baseType: !566, size: 64, offset: 320)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64)
!567 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sequence", file: !560, line: 190, baseType: !568)
!568 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sequence", file: !560, line: 126, size: 2816, elements: !569)
!569 = !{!570, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !668, !669, !670, !671, !949, !953, !954, !955, !956, !957, !958, !959, !960, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !977}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !568, file: !560, line: 127, baseType: !571, size: 64)
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !568, file: !560, line: 127, baseType: !571, size: 64, offset: 64)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !568, file: !560, line: 128, baseType: !56, size: 64, offset: 128)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !568, file: !560, line: 129, baseType: !56, size: 64, offset: 192)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !568, file: !560, line: 130, baseType: !33, size: 512, offset: 256)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !568, file: !560, line: 132, baseType: !22, size: 32, offset: 768)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !568, file: !560, line: 132, baseType: !22, size: 32, offset: 800)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !568, file: !560, line: 133, baseType: !22, size: 32, offset: 832)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !568, file: !560, line: 134, baseType: !22, size: 32, offset: 864)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "startofs", scope: !568, file: !560, line: 134, baseType: !22, size: 32, offset: 896)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "endofs", scope: !568, file: !560, line: 134, baseType: !22, size: 32, offset: 928)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !568, file: !560, line: 135, baseType: !22, size: 32, offset: 960)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !568, file: !560, line: 135, baseType: !22, size: 32, offset: 992)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !568, file: !560, line: 136, baseType: !22, size: 32, offset: 1024)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !568, file: !560, line: 136, baseType: !22, size: 32, offset: 1056)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "startdisp", scope: !568, file: !560, line: 137, baseType: !22, size: 32, offset: 1088)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "enddisp", scope: !568, file: !560, line: 137, baseType: !22, size: 32, offset: 1120)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "sat", scope: !568, file: !560, line: 138, baseType: !192, size: 32, offset: 1152)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "mul", scope: !568, file: !560, line: 139, baseType: !192, size: 32, offset: 1184)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "handsize", scope: !568, file: !560, line: 139, baseType: !192, size: 32, offset: 1216)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "anim_preseek", scope: !568, file: !560, line: 141, baseType: !48, size: 16, offset: 1248)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "streamindex", scope: !568, file: !560, line: 142, baseType: !48, size: 16, offset: 1264)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "multicam_source", scope: !568, file: !560, line: 143, baseType: !22, size: 32, offset: 1280)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "clip_flag", scope: !568, file: !560, line: 144, baseType: !22, size: 32, offset: 1312)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "strip", scope: !568, file: !560, line: 146, baseType: !596, size: 64, offset: 1344)
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 64)
!597 = !DIDerivedType(tag: DW_TAG_typedef, name: "Strip", file: !560, line: 114, baseType: !598)
!598 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Strip", file: !560, line: 99, size: 7232, elements: !599)
!599 = !{!600, !602, !603, !604, !605, !606, !607, !618, !622, !636, !645, !652, !662}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !598, file: !560, line: 100, baseType: !601, size: 64)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 64)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !598, file: !560, line: 100, baseType: !601, size: 64, offset: 64)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !598, file: !560, line: 101, baseType: !22, size: 32, offset: 128)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !598, file: !560, line: 101, baseType: !22, size: 32, offset: 160)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !598, file: !560, line: 102, baseType: !22, size: 32, offset: 192)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !598, file: !560, line: 102, baseType: !22, size: 32, offset: 224)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "stripdata", scope: !598, file: !560, line: 103, baseType: !608, size: 64, offset: 256)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64)
!609 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripElem", file: !560, line: 59, baseType: !610)
!610 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripElem", file: !560, line: 56, size: 2112, elements: !611)
!611 = !{!612, !616, !617}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !610, file: !560, line: 57, baseType: !613, size: 2048)
!613 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 2048, elements: !614)
!614 = !{!615}
!615 = !DISubrange(count: 256)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "orig_width", scope: !610, file: !560, line: 58, baseType: !22, size: 32, offset: 2048)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "orig_height", scope: !610, file: !560, line: 58, baseType: !22, size: 32, offset: 2080)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !598, file: !560, line: 106, baseType: !619, size: 6144, offset: 320)
!619 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 6144, elements: !620)
!620 = !{!621}
!621 = !DISubrange(count: 768)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !598, file: !560, line: 107, baseType: !623, size: 64, offset: 6464)
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 64)
!624 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripProxy", file: !560, line: 97, baseType: !625)
!625 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripProxy", file: !560, line: 83, size: 8320, elements: !626)
!626 = !{!627, !628, !629, !632, !633, !634, !635}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !625, file: !560, line: 84, baseType: !619, size: 6144)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !625, file: !560, line: 87, baseType: !613, size: 2048, offset: 6144)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !625, file: !560, line: 88, baseType: !630, size: 64, offset: 8192)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64)
!631 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !426, line: 41, flags: DIFlagFwdDecl)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !625, file: !560, line: 90, baseType: !48, size: 16, offset: 8256)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !625, file: !560, line: 92, baseType: !48, size: 16, offset: 8272)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flags", scope: !625, file: !560, line: 93, baseType: !48, size: 16, offset: 8288)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flags", scope: !625, file: !560, line: 95, baseType: !48, size: 16, offset: 8304)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !598, file: !560, line: 108, baseType: !637, size: 64, offset: 6528)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 64)
!638 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripCrop", file: !560, line: 66, baseType: !639)
!639 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripCrop", file: !560, line: 61, size: 128, elements: !640)
!640 = !{!641, !642, !643, !644}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !639, file: !560, line: 62, baseType: !22, size: 32)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !639, file: !560, line: 63, baseType: !22, size: 32, offset: 32)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !639, file: !560, line: 64, baseType: !22, size: 32, offset: 64)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !639, file: !560, line: 65, baseType: !22, size: 32, offset: 96)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !598, file: !560, line: 109, baseType: !646, size: 64, offset: 6592)
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64)
!647 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripTransform", file: !560, line: 71, baseType: !648)
!648 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripTransform", file: !560, line: 68, size: 64, elements: !649)
!649 = !{!650, !651}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "xofs", scope: !648, file: !560, line: 69, baseType: !22, size: 32)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "yofs", scope: !648, file: !560, line: 70, baseType: !22, size: 32, offset: 32)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "color_balance", scope: !598, file: !560, line: 110, baseType: !653, size: 64, offset: 6656)
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64)
!654 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripColorBalance", file: !560, line: 81, baseType: !655)
!655 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripColorBalance", file: !560, line: 73, size: 352, elements: !656)
!656 = !{!657, !658, !659, !660, !661}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "lift", scope: !655, file: !560, line: 74, baseType: !228, size: 96)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !655, file: !560, line: 75, baseType: !228, size: 96, offset: 96)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "gain", scope: !655, file: !560, line: 76, baseType: !228, size: 96, offset: 192)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !655, file: !560, line: 77, baseType: !22, size: 32, offset: 288)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !655, file: !560, line: 78, baseType: !22, size: 32, offset: 320)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !598, file: !560, line: 113, baseType: !663, size: 512, offset: 6720)
!663 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !664, line: 182, baseType: !665)
!664 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!665 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !664, line: 180, size: 512, elements: !666)
!666 = !{!667}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !665, file: !664, line: 181, baseType: !33, size: 512)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !568, file: !560, line: 148, baseType: !183, size: 64, offset: 1408)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !568, file: !560, line: 151, baseType: !152, size: 64, offset: 1472)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "scene_camera", scope: !568, file: !560, line: 152, baseType: !162, size: 64, offset: 1536)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "clip", scope: !568, file: !560, line: 153, baseType: !672, size: 64, offset: 1600)
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 64)
!673 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClip", file: !674, line: 64, size: 19136, elements: !675)
!674 = !DIFile(filename: "blender/source/blender/makesdna/DNA_movieclip_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!675 = !{!676, !677, !678, !679, !680, !681, !683, !684, !685, !686, !689, !690, !935, !936, !944, !945, !946, !947, !948}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !673, file: !674, line: 65, baseType: !112, size: 960)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !673, file: !674, line: 66, baseType: !158, size: 64, offset: 960)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !673, file: !674, line: 68, baseType: !130, size: 8192, offset: 1024)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !673, file: !674, line: 70, baseType: !22, size: 32, offset: 9216)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !673, file: !674, line: 71, baseType: !22, size: 32, offset: 9248)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "lastsize", scope: !673, file: !674, line: 72, baseType: !682, size: 64, offset: 9280)
!682 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 64, elements: !421)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !673, file: !674, line: 74, baseType: !192, size: 32, offset: 9344)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !673, file: !674, line: 74, baseType: !192, size: 32, offset: 9376)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !673, file: !674, line: 76, baseType: !630, size: 64, offset: 9408)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !673, file: !674, line: 77, baseType: !687, size: 64, offset: 9472)
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 64)
!688 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipCache", file: !674, line: 77, flags: DIFlagFwdDecl)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !673, file: !674, line: 78, baseType: !259, size: 64, offset: 9536)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "tracking", scope: !673, file: !674, line: 80, baseType: !691, size: 2624, offset: 9600)
!691 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTracking", file: !692, line: 340, size: 2624, elements: !693)
!692 = !DIFile(filename: "blender/source/blender/makesdna/DNA_tracking_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!693 = !{!694, !722, !740, !741, !742, !757, !815, !816, !915, !916, !917, !918, !924}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "settings", scope: !691, file: !692, line: 341, baseType: !695, size: 576)
!695 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingSettings", file: !692, line: 251, baseType: !696)
!696 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingSettings", file: !692, line: 207, size: 576, elements: !697)
!697 = !{!698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721}
!698 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !696, file: !692, line: 208, baseType: !22, size: 32)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "default_motion_model", scope: !696, file: !692, line: 211, baseType: !48, size: 16, offset: 32)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "default_algorithm_flag", scope: !696, file: !692, line: 212, baseType: !48, size: 16, offset: 48)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "default_minimum_correlation", scope: !696, file: !692, line: 213, baseType: !192, size: 32, offset: 64)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_size", scope: !696, file: !692, line: 214, baseType: !48, size: 16, offset: 96)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "default_search_size", scope: !696, file: !692, line: 215, baseType: !48, size: 16, offset: 112)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "default_frames_limit", scope: !696, file: !692, line: 216, baseType: !48, size: 16, offset: 128)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "default_margin", scope: !696, file: !692, line: 217, baseType: !48, size: 16, offset: 144)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_match", scope: !696, file: !692, line: 218, baseType: !48, size: 16, offset: 160)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "default_flag", scope: !696, file: !692, line: 219, baseType: !48, size: 16, offset: 176)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "default_weight", scope: !696, file: !692, line: 220, baseType: !192, size: 32, offset: 192)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "motion_flag", scope: !696, file: !692, line: 222, baseType: !48, size: 16, offset: 224)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "speed", scope: !696, file: !692, line: 225, baseType: !48, size: 16, offset: 240)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe1", scope: !696, file: !692, line: 228, baseType: !22, size: 32, offset: 256)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe2", scope: !696, file: !692, line: 229, baseType: !22, size: 32, offset: 288)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction_flag", scope: !696, file: !692, line: 233, baseType: !22, size: 32, offset: 320)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "refine_camera_intrinsics", scope: !696, file: !692, line: 236, baseType: !48, size: 16, offset: 352)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !696, file: !692, line: 236, baseType: !48, size: 16, offset: 368)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !696, file: !692, line: 241, baseType: !192, size: 32, offset: 384)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "clean_frames", scope: !696, file: !692, line: 244, baseType: !22, size: 32, offset: 416)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "clean_action", scope: !696, file: !692, line: 244, baseType: !22, size: 32, offset: 448)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "clean_error", scope: !696, file: !692, line: 245, baseType: !192, size: 32, offset: 480)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "object_distance", scope: !696, file: !692, line: 248, baseType: !192, size: 32, offset: 512)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !696, file: !692, line: 250, baseType: !22, size: 32, offset: 544)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !691, file: !692, line: 342, baseType: !723, size: 448, offset: 576)
!723 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingCamera", file: !692, line: 79, baseType: !724)
!724 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingCamera", file: !692, line: 61, size: 448, elements: !725)
!725 = !{!726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "intrinsics", scope: !724, file: !692, line: 62, baseType: !56, size: 64)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_model", scope: !724, file: !692, line: 64, baseType: !48, size: 16, offset: 64)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !724, file: !692, line: 65, baseType: !48, size: 16, offset: 80)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "sensor_width", scope: !724, file: !692, line: 67, baseType: !192, size: 32, offset: 96)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_aspect", scope: !724, file: !692, line: 68, baseType: !192, size: 32, offset: 128)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "focal", scope: !724, file: !692, line: 69, baseType: !192, size: 32, offset: 160)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !724, file: !692, line: 70, baseType: !48, size: 16, offset: 192)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !724, file: !692, line: 71, baseType: !48, size: 16, offset: 208)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "principal", scope: !724, file: !692, line: 72, baseType: !420, size: 64, offset: 224)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "k1", scope: !724, file: !692, line: 75, baseType: !192, size: 32, offset: 288)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "k2", scope: !724, file: !692, line: 75, baseType: !192, size: 32, offset: 320)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "k3", scope: !724, file: !692, line: 75, baseType: !192, size: 32, offset: 352)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "division_k1", scope: !724, file: !692, line: 78, baseType: !192, size: 32, offset: 384)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "division_k2", scope: !724, file: !692, line: 78, baseType: !192, size: 32, offset: 416)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "tracks", scope: !691, file: !692, line: 343, baseType: !58, size: 128, offset: 1024)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "plane_tracks", scope: !691, file: !692, line: 344, baseType: !58, size: 128, offset: 1152)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction", scope: !691, file: !692, line: 345, baseType: !743, size: 192, offset: 1280)
!743 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingReconstruction", file: !692, line: 278, baseType: !744)
!744 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingReconstruction", file: !692, line: 270, size: 192, elements: !745)
!745 = !{!746, !747, !748, !749, !750}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !744, file: !692, line: 271, baseType: !22, size: 32)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !744, file: !692, line: 273, baseType: !192, size: 32, offset: 32)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "last_camera", scope: !744, file: !692, line: 275, baseType: !22, size: 32, offset: 64)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "camnr", scope: !744, file: !692, line: 276, baseType: !22, size: 32, offset: 96)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "cameras", scope: !744, file: !692, line: 277, baseType: !751, size: 64, offset: 128)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64)
!752 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieReconstructedCamera", file: !692, line: 55, size: 576, elements: !753)
!753 = !{!754, !755, !756}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !752, file: !692, line: 56, baseType: !22, size: 32)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !752, file: !692, line: 57, baseType: !192, size: 32, offset: 32)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !752, file: !692, line: 58, baseType: !310, size: 512, offset: 64)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "stabilization", scope: !691, file: !692, line: 346, baseType: !758, size: 384, offset: 1472)
!758 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStabilization", file: !692, line: 268, baseType: !759)
!759 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStabilization", file: !692, line: 253, size: 384, elements: !760)
!760 = !{!761, !762, !763, !764, !765, !809, !810, !811, !812, !813, !814}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !759, file: !692, line: 254, baseType: !22, size: 32)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "tot_track", scope: !759, file: !692, line: 255, baseType: !22, size: 32, offset: 32)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !759, file: !692, line: 255, baseType: !22, size: 32, offset: 64)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "maxscale", scope: !759, file: !692, line: 258, baseType: !192, size: 32, offset: 96)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "rot_track", scope: !759, file: !692, line: 259, baseType: !766, size: 64, offset: 128)
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64)
!767 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingTrack", file: !692, line: 164, baseType: !768)
!768 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingTrack", file: !692, line: 108, size: 1664, elements: !769)
!769 = !{!770, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !768, file: !692, line: 109, baseType: !771, size: 64)
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 64)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !768, file: !692, line: 109, baseType: !771, size: 64, offset: 64)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !768, file: !692, line: 111, baseType: !33, size: 512, offset: 128)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "pat_min", scope: !768, file: !692, line: 119, baseType: !420, size: 64, offset: 640)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "pat_max", scope: !768, file: !692, line: 119, baseType: !420, size: 64, offset: 704)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !768, file: !692, line: 125, baseType: !420, size: 64, offset: 768)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !768, file: !692, line: 125, baseType: !420, size: 64, offset: 832)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !768, file: !692, line: 127, baseType: !420, size: 64, offset: 896)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !768, file: !692, line: 130, baseType: !22, size: 32, offset: 960)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !768, file: !692, line: 131, baseType: !22, size: 32, offset: 992)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !768, file: !692, line: 132, baseType: !782, size: 64, offset: 1024)
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !783, size: 64)
!783 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingMarker", file: !692, line: 106, baseType: !784)
!784 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingMarker", file: !692, line: 81, size: 512, elements: !785)
!785 = !{!786, !787, !790, !791, !792, !793}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !784, file: !692, line: 82, baseType: !420, size: 64)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_corners", scope: !784, file: !692, line: 97, baseType: !788, size: 256, offset: 64)
!788 = !DICompositeType(tag: DW_TAG_array_type, baseType: !192, size: 256, elements: !789)
!789 = !{!303, !422}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !784, file: !692, line: 102, baseType: !420, size: 64, offset: 320)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !784, file: !692, line: 102, baseType: !420, size: 64, offset: 384)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !784, file: !692, line: 104, baseType: !22, size: 32, offset: 448)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !784, file: !692, line: 105, baseType: !22, size: 32, offset: 480)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "bundle_pos", scope: !768, file: !692, line: 135, baseType: !228, size: 96, offset: 1088)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !768, file: !692, line: 136, baseType: !192, size: 32, offset: 1184)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !768, file: !692, line: 139, baseType: !22, size: 32, offset: 1216)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "pat_flag", scope: !768, file: !692, line: 139, baseType: !22, size: 32, offset: 1248)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "search_flag", scope: !768, file: !692, line: 139, baseType: !22, size: 32, offset: 1280)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !768, file: !692, line: 140, baseType: !228, size: 96, offset: 1312)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "frames_limit", scope: !768, file: !692, line: 143, baseType: !48, size: 16, offset: 1408)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !768, file: !692, line: 144, baseType: !48, size: 16, offset: 1424)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_match", scope: !768, file: !692, line: 145, baseType: !48, size: 16, offset: 1440)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "motion_model", scope: !768, file: !692, line: 148, baseType: !48, size: 16, offset: 1456)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm_flag", scope: !768, file: !692, line: 149, baseType: !22, size: 32, offset: 1472)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "minimum_correlation", scope: !768, file: !692, line: 150, baseType: !192, size: 32, offset: 1504)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !768, file: !692, line: 152, baseType: !259, size: 64, offset: 1536)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !768, file: !692, line: 163, baseType: !192, size: 32, offset: 1600)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !768, file: !692, line: 163, baseType: !192, size: 32, offset: 1632)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "locinf", scope: !759, file: !692, line: 261, baseType: !192, size: 32, offset: 192)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "scaleinf", scope: !759, file: !692, line: 261, baseType: !192, size: 32, offset: 224)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "rotinf", scope: !759, file: !692, line: 261, baseType: !192, size: 32, offset: 256)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !759, file: !692, line: 263, baseType: !22, size: 32, offset: 288)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !759, file: !692, line: 266, baseType: !22, size: 32, offset: 320)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !759, file: !692, line: 267, baseType: !192, size: 32, offset: 352)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !691, file: !692, line: 347, baseType: !766, size: 64, offset: 1856)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "act_plane_track", scope: !691, file: !692, line: 348, baseType: !817, size: 64, offset: 1920)
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !818, size: 64)
!818 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingPlaneTrack", file: !692, line: 205, baseType: !819)
!819 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingPlaneTrack", file: !692, line: 186, size: 1024, elements: !820)
!820 = !{!821, !823, !824, !825, !827, !828, !829, !837, !838, !839, !913, !914}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !819, file: !692, line: 187, baseType: !822, size: 64)
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 64)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !819, file: !692, line: 187, baseType: !822, size: 64, offset: 64)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !819, file: !692, line: 189, baseType: !33, size: 512, offset: 128)
