; ModuleID = 'blender/source/blender/windowmanager/intern/wm.c'
source_filename = "blender/source/blender/windowmanager/intern/wm.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.GHash = type opaque
%struct.Global = type { %struct.Main*, [1024 x i8], [1024 x i8], i8, i8, i8, %struct.ListBase, i8, i8, i8, i16, i16, i16, i8, i16, i32, i32, i8, i32, i32, [200 x i8] }
%struct.Main = type { %struct.Main*, %struct.Main*, [1024 x i8], i16, i16, i16, i16, i64, [16 x i8], i16, %struct.Library*, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, [256 x i8], %struct.EvaluationContext*, %struct.MainLock* }
%struct.Library = type { %struct.ID, %struct.ID*, %struct.FileData*, [1024 x i8], [1024 x i8], %struct.Library*, %struct.PackedFile* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "uilisttypes_hash", scope: !2, file: !3, line: 212, type: !39, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !27, globals: !36, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "blender/source/blender/windowmanager/intern/wm.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !{!5, !13, !19, !23}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ReportListFlags", file: !6, line: 86, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "blender/source/blender/makesdna/DNA_windowmanager_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12}
!9 = !DIEnumerator(name: "RPT_PRINT", value: 1, isUnsigned: true)
!10 = !DIEnumerator(name: "RPT_STORE", value: 2, isUnsigned: true)
!11 = !DIEnumerator(name: "RPT_FREE", value: 4, isUnsigned: true)
!12 = !DIEnumerator(name: "RPT_OP_HOLD", value: 8, isUnsigned: true)
!13 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !14, line: 83, baseType: !7, size: 32, elements: !15)
!14 = !DIFile(filename: "blender/source/blender/windowmanager/wm_event_system.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!15 = !{!16, !17, !18}
!16 = !DIEnumerator(name: "WM_HANDLER_BLOCKING", value: 1, isUnsigned: true)
!17 = !DIEnumerator(name: "WM_HANDLER_DO_FREE", value: 2, isUnsigned: true)
!18 = !DIEnumerator(name: "WM_HANDLER_ACCEPT_DBL_CLICK", value: 4, isUnsigned: true)
!19 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 163, baseType: !7, size: 32, elements: !20)
!20 = !{!21, !22}
!21 = !DIEnumerator(name: "WM_INIT_WINDOW", value: 1, isUnsigned: true)
!22 = !DIEnumerator(name: "WM_INIT_KEYMAP", value: 2, isUnsigned: true)
!23 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 321, baseType: !7, size: 32, elements: !24)
!24 = !{!25, !26}
!25 = !DIEnumerator(name: "KEYCONF_USER", value: 2, isUnsigned: true)
!26 = !DIEnumerator(name: "KEYCONF_INIT_DEFAULT", value: 4, isUnsigned: true)
!27 = !{!28, !29}
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!30 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_gh_Entry", file: !31, line: 94, size: 192, elements: !32)
!31 = !DIFile(filename: "blender/source/blender/blenlib/BLI_ghash.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!32 = !{!33, !34, !35}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !30, file: !31, line: 94, baseType: !28, size: 64)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !30, file: !31, line: 94, baseType: !28, size: 64, offset: 64)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !30, file: !31, line: 94, baseType: !28, size: 64, offset: 128)
!36 = !{!0, !37}
!37 = !DIGlobalVariableExpression(var: !38, expr: !DIExpression())
!38 = distinct !DIGlobalVariable(name: "menutypes_hash", scope: !2, file: !3, line: 272, type: !39, isLocal: true, isDefinition: true)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHash", file: !31, line: 48, baseType: !41)
!41 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !31, line: 48, flags: DIFlagFwdDecl)
!42 = !{i32 7, !"Dwarf Version", i32 4}
!43 = !{i32 2, !"Debug Info Version", i32 3}
!44 = !{i32 1, !"wchar_size", i32 4}
!45 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!46 = distinct !DISubprogram(name: "WM_operator_free", scope: !3, file: !3, line: 76, type: !47, scopeLine: 77, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !1580)
!47 = !DISubroutineType(types: !48)
!48 = !{null, !49}
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "wmOperator", file: !6, line: 348, baseType: !51)
!51 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmOperator", file: !6, line: 328, size: 1344, elements: !52)
!52 = !{!53, !55, !56, !61, !93, !247, !248, !249, !250, !1573, !1574, !1575, !1578, !1579}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !51, file: !6, line: 329, baseType: !54, size: 64)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !51, file: !6, line: 329, baseType: !54, size: 64, offset: 64)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !51, file: !6, line: 332, baseType: !57, size: 512, offset: 128)
!57 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 512, elements: !59)
!58 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!59 = !{!60}
!60 = !DISubrange(count: 64)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !51, file: !6, line: 333, baseType: !62, size: 64, offset: 640)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !64, line: 75, baseType: !65)
!64 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!65 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !64, line: 62, size: 1024, elements: !66)
!66 = !{!67, !69, !70, !71, !72, !74, !75, !77, !91, !92}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !65, file: !64, line: 63, baseType: !68, size: 64)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !65, file: !64, line: 63, baseType: !68, size: 64, offset: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !65, file: !64, line: 64, baseType: !58, size: 8, offset: 128)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !65, file: !64, line: 64, baseType: !58, size: 8, offset: 136)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !65, file: !64, line: 65, baseType: !73, size: 16, offset: 144)
!73 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !65, file: !64, line: 66, baseType: !57, size: 512, offset: 160)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !65, file: !64, line: 67, baseType: !76, size: 32, offset: 672)
!76 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !65, file: !64, line: 69, baseType: !78, size: 256, offset: 704)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !64, line: 60, baseType: !79)
!79 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !64, line: 48, size: 256, elements: !80)
!80 = !{!81, !82, !89, !90}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !79, file: !64, line: 49, baseType: !28, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !79, file: !64, line: 58, baseType: !83, size: 128, offset: 64)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !84, line: 71, baseType: !85)
!84 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!85 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !84, line: 69, size: 128, elements: !86)
!86 = !{!87, !88}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !85, file: !84, line: 70, baseType: !28, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !85, file: !84, line: 70, baseType: !28, size: 64, offset: 64)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !79, file: !64, line: 59, baseType: !76, size: 32, offset: 192)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !79, file: !64, line: 59, baseType: !76, size: 32, offset: 224)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !65, file: !64, line: 70, baseType: !76, size: 32, offset: 960)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !65, file: !64, line: 74, baseType: !76, size: 32, offset: 992)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !51, file: !6, line: 336, baseType: !94, size: 64, offset: 704)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmOperatorType", file: !96, line: 508, size: 1536, elements: !97)
!96 = !DIFile(filename: "blender/source/blender/windowmanager/WM_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!97 = !{!98, !101, !102, !103, !104, !110, !115, !168, !172, !173, !177, !178, !181, !182, !187, !188, !203, !204, !208, !246}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !95, file: !96, line: 509, baseType: !99, size: 64)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !58)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !95, file: !96, line: 510, baseType: !99, size: 64, offset: 64)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "translation_context", scope: !95, file: !96, line: 511, baseType: !99, size: 64, offset: 128)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !95, file: !96, line: 512, baseType: !99, size: 64, offset: 192)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !95, file: !96, line: 518, baseType: !105, size: 64, offset: 256)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!106 = !DISubroutineType(types: !107)
!107 = !{!76, !108, !54}
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !6, line: 51, flags: DIFlagFwdDecl)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !95, file: !96, line: 524, baseType: !111, size: 64, offset: 320)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!112 = !DISubroutineType(types: !113)
!113 = !{!114, !108, !54}
!114 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "invoke", scope: !95, file: !96, line: 530, baseType: !116, size: 64, offset: 384)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DISubroutineType(types: !118)
!118 = !{!76, !108, !54, !119}
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !121)
!121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmEvent", file: !96, line: 421, size: 960, elements: !122)
!122 = !{!123, !125, !126, !127, !128, !129, !130, !134, !138, !139, !140, !141, !142, !143, !144, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !164, !165, !166, !167}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !121, file: !96, line: 422, baseType: !124, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !121, file: !96, line: 422, baseType: !124, size: 64, offset: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !121, file: !96, line: 424, baseType: !73, size: 16, offset: 128)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !121, file: !96, line: 425, baseType: !73, size: 16, offset: 144)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !121, file: !96, line: 426, baseType: !76, size: 32, offset: 160)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !121, file: !96, line: 426, baseType: !76, size: 32, offset: 192)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "mval", scope: !121, file: !96, line: 427, baseType: !131, size: 64, offset: 224)
!131 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 64, elements: !132)
!132 = !{!133}
!133 = !DISubrange(count: 2)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "utf8_buf", scope: !121, file: !96, line: 428, baseType: !135, size: 48, offset: 288)
!135 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 48, elements: !136)
!136 = !{!137}
!137 = !DISubrange(count: 6)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !121, file: !96, line: 431, baseType: !58, size: 8, offset: 336)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !121, file: !96, line: 432, baseType: !58, size: 8, offset: 344)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "prevtype", scope: !121, file: !96, line: 435, baseType: !73, size: 16, offset: 352)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "prevval", scope: !121, file: !96, line: 436, baseType: !73, size: 16, offset: 368)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "prevx", scope: !121, file: !96, line: 437, baseType: !76, size: 32, offset: 384)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "prevy", scope: !121, file: !96, line: 437, baseType: !76, size: 32, offset: 416)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "prevclicktime", scope: !121, file: !96, line: 438, baseType: !145, size: 64, offset: 448)
!145 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "prevclickx", scope: !121, file: !96, line: 439, baseType: !76, size: 32, offset: 512)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "prevclicky", scope: !121, file: !96, line: 439, baseType: !76, size: 32, offset: 544)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !121, file: !96, line: 442, baseType: !73, size: 16, offset: 576)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "ctrl", scope: !121, file: !96, line: 442, baseType: !73, size: 16, offset: 592)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "alt", scope: !121, file: !96, line: 442, baseType: !73, size: 16, offset: 608)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "oskey", scope: !121, file: !96, line: 442, baseType: !73, size: 16, offset: 624)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "keymodifier", scope: !121, file: !96, line: 443, baseType: !73, size: 16, offset: 640)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "check_click", scope: !121, file: !96, line: 446, baseType: !73, size: 16, offset: 656)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "keymap_idname", scope: !121, file: !96, line: 449, baseType: !99, size: 64, offset: 704)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "tablet_data", scope: !121, file: !96, line: 452, baseType: !156, size: 64, offset: 768)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTabletData", file: !96, line: 463, size: 128, elements: !158)
!158 = !{!159, !160, !162, !163}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "Active", scope: !157, file: !96, line: 464, baseType: !76, size: 32)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "Pressure", scope: !157, file: !96, line: 465, baseType: !161, size: 32, offset: 32)
!161 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "Xtilt", scope: !157, file: !96, line: 466, baseType: !161, size: 32, offset: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "Ytilt", scope: !157, file: !96, line: 467, baseType: !161, size: 32, offset: 96)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "custom", scope: !121, file: !96, line: 455, baseType: !73, size: 16, offset: 832)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "customdatafree", scope: !121, file: !96, line: 456, baseType: !73, size: 16, offset: 848)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !121, file: !96, line: 457, baseType: !76, size: 32, offset: 864)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !121, file: !96, line: 458, baseType: !28, size: 64, offset: 896)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "cancel", scope: !95, file: !96, line: 531, baseType: !169, size: 64, offset: 448)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = !DISubroutineType(types: !171)
!171 = !{null, !108, !54}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "modal", scope: !95, file: !96, line: 532, baseType: !116, size: 64, offset: 512)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "poll", scope: !95, file: !96, line: 536, baseType: !174, size: 64, offset: 576)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!175 = !DISubroutineType(types: !176)
!176 = !{!76, !108}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "ui", scope: !95, file: !96, line: 539, baseType: !169, size: 64, offset: 640)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "srna", scope: !95, file: !96, line: 542, baseType: !179, size: 64, offset: 704)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !6, line: 57, flags: DIFlagFwdDecl)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "last_properties", scope: !95, file: !96, line: 545, baseType: !68, size: 64, offset: 768)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !95, file: !96, line: 549, baseType: !183, size: 64, offset: 832)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "PropertyRNA", file: !185, line: 333, baseType: !186)
!185 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!186 = !DICompositeType(tag: DW_TAG_structure_type, name: "PropertyRNA", file: !185, line: 39, flags: DIFlagFwdDecl)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "macro", scope: !95, file: !96, line: 552, baseType: !83, size: 128, offset: 896)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "modalkeymap", scope: !95, file: !96, line: 555, baseType: !189, size: 64, offset: 1024)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!190 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmKeyMap", file: !6, line: 281, size: 1088, elements: !191)
!191 = !{!192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !190, file: !6, line: 282, baseType: !189, size: 64)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !190, file: !6, line: 282, baseType: !189, size: 64, offset: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "items", scope: !190, file: !6, line: 284, baseType: !83, size: 128, offset: 128)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "diff_items", scope: !190, file: !6, line: 285, baseType: !83, size: 128, offset: 256)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !190, file: !6, line: 287, baseType: !57, size: 512, offset: 384)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "spaceid", scope: !190, file: !6, line: 288, baseType: !73, size: 16, offset: 896)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "regionid", scope: !190, file: !6, line: 289, baseType: !73, size: 16, offset: 912)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !190, file: !6, line: 291, baseType: !73, size: 16, offset: 928)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "kmi_id", scope: !190, file: !6, line: 292, baseType: !73, size: 16, offset: 944)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "poll", scope: !190, file: !6, line: 295, baseType: !174, size: 64, offset: 960)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "modal_items", scope: !190, file: !6, line: 296, baseType: !28, size: 64, offset: 1024)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "pyop_data", scope: !95, file: !96, line: 559, baseType: !28, size: 64, offset: 1088)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "pyop_poll", scope: !95, file: !96, line: 560, baseType: !205, size: 64, offset: 1152)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = !DISubroutineType(types: !207)
!207 = !{!76, !108, !94}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "ext", scope: !95, file: !96, line: 563, baseType: !209, size: 256, offset: 1216)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExtensionRNA", file: !185, line: 436, baseType: !210)
!210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ExtensionRNA", file: !185, line: 430, size: 256, elements: !211)
!211 = !{!212, !213, !216, !241}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !210, file: !185, line: 431, baseType: !28, size: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "srna", scope: !210, file: !185, line: 432, baseType: !214, size: 64, offset: 64)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructRNA", file: !185, line: 417, baseType: !180)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !210, file: !185, line: 433, baseType: !217, size: 64, offset: 128)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructCallbackFunc", file: !185, line: 408, baseType: !218)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!219 = !DISubroutineType(types: !220)
!220 = !{!76, !108, !221, !230, !232}
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!222 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !185, line: 55, size: 192, elements: !223)
!223 = !{!224, !228, !229}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !222, file: !185, line: 58, baseType: !225, size: 64)
!225 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !222, file: !185, line: 56, size: 64, elements: !226)
!226 = !{!227}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !225, file: !185, line: 57, baseType: !28, size: 64)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !222, file: !185, line: 60, baseType: !179, size: 64, offset: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !222, file: !185, line: 61, baseType: !28, size: 64, offset: 128)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!231 = !DICompositeType(tag: DW_TAG_structure_type, name: "FunctionRNA", file: !185, line: 38, flags: DIFlagFwdDecl)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "ParameterList", file: !185, line: 348, baseType: !234)
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParameterList", file: !185, line: 337, size: 256, elements: !235)
!235 = !{!236, !237, !238, !239, !240}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !234, file: !185, line: 339, baseType: !28, size: 64)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !234, file: !185, line: 342, baseType: !230, size: 64, offset: 64)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_size", scope: !234, file: !185, line: 345, baseType: !76, size: 32, offset: 128)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !234, file: !185, line: 347, baseType: !76, size: 32, offset: 160)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "ret_count", scope: !234, file: !185, line: 347, baseType: !76, size: 32, offset: 192)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !210, file: !185, line: 434, baseType: !242, size: 64, offset: 192)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructFreeFunc", file: !185, line: 409, baseType: !243)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!244 = !DISubroutineType(types: !245)
!245 = !{null, !28}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !95, file: !96, line: 566, baseType: !73, size: 16, offset: 1472)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !51, file: !6, line: 337, baseType: !28, size: 64, offset: 768)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "py_instance", scope: !51, file: !6, line: 338, baseType: !28, size: 64, offset: 832)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !51, file: !6, line: 340, baseType: !221, size: 64, offset: 896)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "reports", scope: !51, file: !6, line: 341, baseType: !251, size: 64, offset: 960)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ReportList", file: !6, line: 106, size: 320, elements: !253)
!253 = !{!254, !255, !256, !257, !258, !259}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !252, file: !6, line: 107, baseType: !83, size: 128)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "printlevel", scope: !252, file: !6, line: 108, baseType: !76, size: 32, offset: 128)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "storelevel", scope: !252, file: !6, line: 109, baseType: !76, size: 32, offset: 160)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !252, file: !6, line: 110, baseType: !76, size: 32, offset: 192)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !252, file: !6, line: 110, baseType: !76, size: 32, offset: 224)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "reporttimer", scope: !252, file: !6, line: 111, baseType: !260, size: 64, offset: 256)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!261 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTimer", file: !96, line: 490, size: 768, elements: !262)
!262 = !{!263, !264, !265, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !261, file: !96, line: 491, baseType: !260, size: 64)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !261, file: !96, line: 491, baseType: !260, size: 64, offset: 64)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "win", scope: !261, file: !96, line: 493, baseType: !266, size: 64, offset: 128)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!267 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindow", file: !6, line: 169, size: 2048, elements: !268)
!268 = !{!269, !270, !271, !272, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1542, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !267, file: !6, line: 170, baseType: !266, size: 64)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !267, file: !6, line: 170, baseType: !266, size: 64, offset: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "ghostwin", scope: !267, file: !6, line: 172, baseType: !28, size: 64, offset: 128)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !267, file: !6, line: 174, baseType: !273, size: 64, offset: 192)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!274 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !275, line: 49, size: 1984, elements: !276)
!275 = !DIFile(filename: "blender/source/blender/makesdna/DNA_screen_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!276 = !{!277, !313, !314, !315, !316, !317, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !274, file: !275, line: 50, baseType: !278, size: 960)
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !64, line: 130, baseType: !279)
!279 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !64, line: 117, size: 960, elements: !280)
!280 = !{!281, !282, !283, !285, !304, !308, !309, !310, !311, !312}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !279, file: !64, line: 118, baseType: !28, size: 64)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !279, file: !64, line: 118, baseType: !28, size: 64, offset: 64)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !279, file: !64, line: 119, baseType: !284, size: 64, offset: 128)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !279, file: !64, line: 120, baseType: !286, size: 64, offset: 192)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !64, line: 136, size: 17600, elements: !288)
!288 = !{!289, !290, !292, !295, !299, !300, !301}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !287, file: !64, line: 137, baseType: !278, size: 960)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !287, file: !64, line: 138, baseType: !291, size: 64, offset: 960)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !287, file: !64, line: 139, baseType: !293, size: 64, offset: 1024)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64)
!294 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !64, line: 43, flags: DIFlagFwdDecl)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !287, file: !64, line: 140, baseType: !296, size: 8192, offset: 1088)
!296 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 8192, elements: !297)
!297 = !{!298}
!298 = !DISubrange(count: 1024)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !287, file: !64, line: 141, baseType: !296, size: 8192, offset: 9280)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !287, file: !64, line: 148, baseType: !286, size: 64, offset: 17472)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !287, file: !64, line: 150, baseType: !302, size: 64, offset: 17536)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!303 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !64, line: 45, flags: DIFlagFwdDecl)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !279, file: !64, line: 121, baseType: !305, size: 528, offset: 256)
!305 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 528, elements: !306)
!306 = !{!307}
!307 = !DISubrange(count: 66)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !279, file: !64, line: 126, baseType: !73, size: 16, offset: 784)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !279, file: !64, line: 127, baseType: !76, size: 32, offset: 800)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !279, file: !64, line: 128, baseType: !76, size: 32, offset: 832)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !279, file: !64, line: 128, baseType: !76, size: 32, offset: 864)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !279, file: !64, line: 129, baseType: !62, size: 64, offset: 896)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "vertbase", scope: !274, file: !275, line: 52, baseType: !83, size: 128, offset: 960)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "edgebase", scope: !274, file: !275, line: 53, baseType: !83, size: 128, offset: 1088)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "areabase", scope: !274, file: !275, line: 54, baseType: !83, size: 128, offset: 1216)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !274, file: !275, line: 55, baseType: !83, size: 128, offset: 1344)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !274, file: !275, line: 57, baseType: !318, size: 64, offset: 1472)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!319 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !320, line: 1216, size: 39680, elements: !321)
!320 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!321 = !{!322, !323, !327, !331, !334, !335, !336, !348, !349, !353, !354, !355, !356, !357, !358, !359, !360, !361, !365, !438, !872, !1086, !1089, !1374, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1396, !1397, !1398, !1399, !1400, !1408, !1475, !1482, !1483, !1490, !1491, !1497, !1498, !1499, !1500, !1501}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !319, file: !320, line: 1217, baseType: !278, size: 960)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !319, file: !320, line: 1218, baseType: !324, size: 64, offset: 960)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64)
!325 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !326, line: 43, flags: DIFlagFwdDecl)
!326 = !DIFile(filename: "blender/source/blender/makesdna/DNA_movieclip_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!327 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !319, file: !320, line: 1220, baseType: !328, size: 64, offset: 1024)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!329 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !330, line: 44, flags: DIFlagFwdDecl)
!330 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_context.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!331 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !319, file: !320, line: 1221, baseType: !332, size: 64, offset: 1088)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!333 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !320, line: 52, flags: DIFlagFwdDecl)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !319, file: !320, line: 1223, baseType: !318, size: 64, offset: 1152)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !319, file: !320, line: 1225, baseType: !83, size: 128, offset: 1216)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !319, file: !320, line: 1226, baseType: !337, size: 64, offset: 1344)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64)
!338 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !320, line: 69, size: 320, elements: !339)
!339 = !{!340, !341, !342, !343, !344, !345, !346, !347}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !338, file: !320, line: 70, baseType: !337, size: 64)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !338, file: !320, line: 70, baseType: !337, size: 64, offset: 64)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !338, file: !320, line: 71, baseType: !7, size: 32, offset: 128)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !338, file: !320, line: 71, baseType: !7, size: 32, offset: 160)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !338, file: !320, line: 72, baseType: !76, size: 32, offset: 192)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !338, file: !320, line: 73, baseType: !73, size: 16, offset: 224)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !338, file: !320, line: 73, baseType: !73, size: 16, offset: 240)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !338, file: !320, line: 74, baseType: !328, size: 64, offset: 256)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !319, file: !320, line: 1227, baseType: !328, size: 64, offset: 1408)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !319, file: !320, line: 1229, baseType: !350, size: 96, offset: 1472)
!350 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 96, elements: !351)
!351 = !{!352}
!352 = !DISubrange(count: 3)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !319, file: !320, line: 1230, baseType: !350, size: 96, offset: 1568)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !319, file: !320, line: 1231, baseType: !350, size: 96, offset: 1664)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !319, file: !320, line: 1231, baseType: !350, size: 96, offset: 1760)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !319, file: !320, line: 1233, baseType: !7, size: 32, offset: 1856)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !319, file: !320, line: 1234, baseType: !76, size: 32, offset: 1888)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !319, file: !320, line: 1235, baseType: !7, size: 32, offset: 1920)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !319, file: !320, line: 1237, baseType: !73, size: 16, offset: 1952)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !319, file: !320, line: 1239, baseType: !58, size: 8, offset: 1968)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !319, file: !320, line: 1240, baseType: !362, size: 8, offset: 1976)
!362 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 8, elements: !363)
!363 = !{!364}
!364 = !DISubrange(count: 1)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !319, file: !320, line: 1242, baseType: !366, size: 64, offset: 1984)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!367 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !368, line: 328, size: 3456, elements: !369)
!368 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!369 = !{!370, !371, !372, !375, !376, !377, !381, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !406, !407, !408, !411, !416, !417, !420, !424, !429, !433, !434, !435, !436, !437}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !367, file: !368, line: 329, baseType: !278, size: 960)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !367, file: !368, line: 330, baseType: !324, size: 64, offset: 960)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !367, file: !368, line: 332, baseType: !373, size: 64, offset: 1024)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64)
!374 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !368, line: 332, flags: DIFlagFwdDecl)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !367, file: !368, line: 333, baseType: !57, size: 512, offset: 1088)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "interface_type", scope: !367, file: !368, line: 335, baseType: !179, size: 64, offset: 1600)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !367, file: !368, line: 337, baseType: !378, size: 64, offset: 1664)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!379 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !380, line: 45, flags: DIFlagFwdDecl)
!380 = !DIFile(filename: "blender/source/blender/makesdna/DNA_tracking_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!381 = !DIDerivedType(tag: DW_TAG_member, name: "view_center", scope: !367, file: !368, line: 338, baseType: !382, size: 64, offset: 1728)
!382 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 64, elements: !132)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !367, file: !368, line: 340, baseType: !83, size: 128, offset: 1792)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !367, file: !368, line: 340, baseType: !83, size: 128, offset: 1920)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !367, file: !368, line: 342, baseType: !76, size: 32, offset: 2048)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !367, file: !368, line: 342, baseType: !76, size: 32, offset: 2080)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "cur_index", scope: !367, file: !368, line: 343, baseType: !76, size: 32, offset: 2112)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !367, file: !368, line: 345, baseType: !76, size: 32, offset: 2144)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !367, file: !368, line: 346, baseType: !76, size: 32, offset: 2176)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "is_updating", scope: !367, file: !368, line: 347, baseType: !73, size: 16, offset: 2208)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !367, file: !368, line: 348, baseType: !73, size: 16, offset: 2224)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !367, file: !368, line: 349, baseType: !76, size: 32, offset: 2240)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "nodetype", scope: !367, file: !368, line: 351, baseType: !76, size: 32, offset: 2272)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "edit_quality", scope: !367, file: !368, line: 353, baseType: !73, size: 16, offset: 2304)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "render_quality", scope: !367, file: !368, line: 354, baseType: !73, size: 16, offset: 2320)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "chunksize", scope: !367, file: !368, line: 355, baseType: !76, size: 32, offset: 2336)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "viewer_border", scope: !367, file: !368, line: 357, baseType: !398, size: 128, offset: 2368)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !399, line: 95, baseType: !400)
!399 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!400 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !399, line: 92, size: 128, elements: !401)
!401 = !{!402, !403, !404, !405}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !400, file: !399, line: 93, baseType: !161, size: 32)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !400, file: !399, line: 93, baseType: !161, size: 32, offset: 32)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !400, file: !399, line: 94, baseType: !161, size: 32, offset: 64)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !400, file: !399, line: 94, baseType: !161, size: 32, offset: 96)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !367, file: !368, line: 363, baseType: !83, size: 128, offset: 2496)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !367, file: !368, line: 363, baseType: !83, size: 128, offset: 2624)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "previews", scope: !367, file: !368, line: 368, baseType: !409, size: 64, offset: 2752)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!410 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHash", file: !368, line: 48, flags: DIFlagFwdDecl)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "active_viewer_key", scope: !367, file: !368, line: 372, baseType: !412, size: 32, offset: 2816)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !368, line: 274, baseType: !413)
!413 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !368, line: 271, size: 32, elements: !414)
!414 = !{!415}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !413, file: !368, line: 273, baseType: !7, size: 32)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !367, file: !368, line: 373, baseType: !76, size: 32, offset: 2848)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "execdata", scope: !367, file: !368, line: 382, baseType: !418, size: 64, offset: 2880)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!419 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeExec", file: !368, line: 46, flags: DIFlagFwdDecl)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !367, file: !368, line: 385, baseType: !421, size: 64, offset: 2944)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!422 = !DISubroutineType(types: !423)
!423 = !{null, !28, !161}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "stats_draw", scope: !367, file: !368, line: 386, baseType: !425, size: 64, offset: 3008)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!426 = !DISubroutineType(types: !427)
!427 = !{null, !28, !428}
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "test_break", scope: !367, file: !368, line: 387, baseType: !430, size: 64, offset: 3072)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64)
!431 = !DISubroutineType(types: !432)
!432 = !{!76, !28}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "update_draw", scope: !367, file: !368, line: 388, baseType: !243, size: 64, offset: 3136)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "tbh", scope: !367, file: !368, line: 389, baseType: !28, size: 64, offset: 3200)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "prh", scope: !367, file: !368, line: 389, baseType: !28, size: 64, offset: 3264)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "sdh", scope: !367, file: !368, line: 389, baseType: !28, size: 64, offset: 3328)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "udh", scope: !367, file: !368, line: 389, baseType: !28, size: 64, offset: 3392)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !319, file: !320, line: 1244, baseType: !439, size: 64, offset: 2048)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !441, line: 200, size: 17024, elements: !442)
!441 = !DIFile(filename: "blender/source/blender/makesdna/DNA_sequence_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!442 = !{!443, !445, !446, !447, !865, !866, !867, !868, !869, !870, !871}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "seqbasep", scope: !440, file: !441, line: 201, baseType: !444, size: 64)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !440, file: !441, line: 202, baseType: !83, size: 128, offset: 64)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "metastack", scope: !440, file: !441, line: 203, baseType: !83, size: 128, offset: 192)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "act_seq", scope: !440, file: !441, line: 206, baseType: !448, size: 64, offset: 320)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64)
!449 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sequence", file: !441, line: 190, baseType: !450)
!450 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sequence", file: !441, line: 126, size: 2816, elements: !451)
!451 = !{!452, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !551, !554, !555, !556, !837, !840, !841, !842, !843, !844, !845, !846, !847, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !864}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !450, file: !441, line: 127, baseType: !453, size: 64)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !450, file: !441, line: 127, baseType: !453, size: 64, offset: 64)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !450, file: !441, line: 128, baseType: !28, size: 64, offset: 128)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !450, file: !441, line: 129, baseType: !28, size: 64, offset: 192)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !450, file: !441, line: 130, baseType: !57, size: 512, offset: 256)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !450, file: !441, line: 132, baseType: !76, size: 32, offset: 768)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !450, file: !441, line: 132, baseType: !76, size: 32, offset: 800)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !450, file: !441, line: 133, baseType: !76, size: 32, offset: 832)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !450, file: !441, line: 134, baseType: !76, size: 32, offset: 864)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "startofs", scope: !450, file: !441, line: 134, baseType: !76, size: 32, offset: 896)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "endofs", scope: !450, file: !441, line: 134, baseType: !76, size: 32, offset: 928)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !450, file: !441, line: 135, baseType: !76, size: 32, offset: 960)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !450, file: !441, line: 135, baseType: !76, size: 32, offset: 992)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !450, file: !441, line: 136, baseType: !76, size: 32, offset: 1024)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !450, file: !441, line: 136, baseType: !76, size: 32, offset: 1056)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "startdisp", scope: !450, file: !441, line: 137, baseType: !76, size: 32, offset: 1088)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "enddisp", scope: !450, file: !441, line: 137, baseType: !76, size: 32, offset: 1120)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "sat", scope: !450, file: !441, line: 138, baseType: !161, size: 32, offset: 1152)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "mul", scope: !450, file: !441, line: 139, baseType: !161, size: 32, offset: 1184)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "handsize", scope: !450, file: !441, line: 139, baseType: !161, size: 32, offset: 1216)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "anim_preseek", scope: !450, file: !441, line: 141, baseType: !73, size: 16, offset: 1248)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "streamindex", scope: !450, file: !441, line: 142, baseType: !73, size: 16, offset: 1264)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "multicam_source", scope: !450, file: !441, line: 143, baseType: !76, size: 32, offset: 1280)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "clip_flag", scope: !450, file: !441, line: 144, baseType: !76, size: 32, offset: 1312)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "strip", scope: !450, file: !441, line: 146, baseType: !478, size: 64, offset: 1344)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!479 = !DIDerivedType(tag: DW_TAG_typedef, name: "Strip", file: !441, line: 114, baseType: !480)
!480 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Strip", file: !441, line: 99, size: 7232, elements: !481)
!481 = !{!482, !484, !485, !486, !487, !488, !489, !500, !504, !519, !528, !535, !545}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !480, file: !441, line: 100, baseType: !483, size: 64)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !480, file: !441, line: 100, baseType: !483, size: 64, offset: 64)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !480, file: !441, line: 101, baseType: !76, size: 32, offset: 128)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !480, file: !441, line: 101, baseType: !76, size: 32, offset: 160)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !480, file: !441, line: 102, baseType: !76, size: 32, offset: 192)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !480, file: !441, line: 102, baseType: !76, size: 32, offset: 224)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "stripdata", scope: !480, file: !441, line: 103, baseType: !490, size: 64, offset: 256)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64)
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripElem", file: !441, line: 59, baseType: !492)
!492 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripElem", file: !441, line: 56, size: 2112, elements: !493)
!493 = !{!494, !498, !499}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !492, file: !441, line: 57, baseType: !495, size: 2048)
!495 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 2048, elements: !496)
!496 = !{!497}
!497 = !DISubrange(count: 256)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "orig_width", scope: !492, file: !441, line: 58, baseType: !76, size: 32, offset: 2048)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "orig_height", scope: !492, file: !441, line: 58, baseType: !76, size: 32, offset: 2080)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !480, file: !441, line: 106, baseType: !501, size: 6144, offset: 320)
!501 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 6144, elements: !502)
!502 = !{!503}
!503 = !DISubrange(count: 768)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !480, file: !441, line: 107, baseType: !505, size: 64, offset: 6464)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64)
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripProxy", file: !441, line: 97, baseType: !507)
!507 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripProxy", file: !441, line: 83, size: 8320, elements: !508)
!508 = !{!509, !510, !511, !515, !516, !517, !518}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !507, file: !441, line: 84, baseType: !501, size: 6144)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !507, file: !441, line: 87, baseType: !495, size: 2048, offset: 6144)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !507, file: !441, line: 88, baseType: !512, size: 64, offset: 8192)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64)
!513 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !514, line: 41, flags: DIFlagFwdDecl)
!514 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!515 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !507, file: !441, line: 90, baseType: !73, size: 16, offset: 8256)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !507, file: !441, line: 92, baseType: !73, size: 16, offset: 8272)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flags", scope: !507, file: !441, line: 93, baseType: !73, size: 16, offset: 8288)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flags", scope: !507, file: !441, line: 95, baseType: !73, size: 16, offset: 8304)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !480, file: !441, line: 108, baseType: !520, size: 64, offset: 6528)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 64)
!521 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripCrop", file: !441, line: 66, baseType: !522)
!522 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripCrop", file: !441, line: 61, size: 128, elements: !523)
!523 = !{!524, !525, !526, !527}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !522, file: !441, line: 62, baseType: !76, size: 32)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !522, file: !441, line: 63, baseType: !76, size: 32, offset: 32)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !522, file: !441, line: 64, baseType: !76, size: 32, offset: 64)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !522, file: !441, line: 65, baseType: !76, size: 32, offset: 96)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !480, file: !441, line: 109, baseType: !529, size: 64, offset: 6592)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64)
!530 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripTransform", file: !441, line: 71, baseType: !531)
!531 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripTransform", file: !441, line: 68, size: 64, elements: !532)
!532 = !{!533, !534}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "xofs", scope: !531, file: !441, line: 69, baseType: !76, size: 32)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "yofs", scope: !531, file: !441, line: 70, baseType: !76, size: 32, offset: 32)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "color_balance", scope: !480, file: !441, line: 110, baseType: !536, size: 64, offset: 6656)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripColorBalance", file: !441, line: 81, baseType: !538)
!538 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripColorBalance", file: !441, line: 73, size: 352, elements: !539)
!539 = !{!540, !541, !542, !543, !544}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "lift", scope: !538, file: !441, line: 74, baseType: !350, size: 96)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !538, file: !441, line: 75, baseType: !350, size: 96, offset: 96)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "gain", scope: !538, file: !441, line: 76, baseType: !350, size: 96, offset: 192)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !538, file: !441, line: 77, baseType: !76, size: 32, offset: 288)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !538, file: !441, line: 78, baseType: !76, size: 32, offset: 320)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !480, file: !441, line: 113, baseType: !546, size: 512, offset: 6720)
!546 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !547, line: 182, baseType: !548)
!547 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!548 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !547, line: 180, size: 512, elements: !549)
!549 = !{!550}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !548, file: !547, line: 181, baseType: !57, size: 512)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !450, file: !441, line: 148, baseType: !552, size: 64, offset: 1408)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64)
!553 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !441, line: 49, flags: DIFlagFwdDecl)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !450, file: !441, line: 151, baseType: !318, size: 64, offset: 1472)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "scene_camera", scope: !450, file: !441, line: 152, baseType: !328, size: 64, offset: 1536)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "clip", scope: !450, file: !441, line: 153, baseType: !557, size: 64, offset: 1600)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64)
!558 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClip", file: !326, line: 64, size: 19136, elements: !559)
!559 = !{!560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !572, !573, !823, !824, !832, !833, !834, !835, !836}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !558, file: !326, line: 65, baseType: !278, size: 960)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !558, file: !326, line: 66, baseType: !324, size: 64, offset: 960)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !558, file: !326, line: 68, baseType: !296, size: 8192, offset: 1024)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !558, file: !326, line: 70, baseType: !76, size: 32, offset: 9216)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !558, file: !326, line: 71, baseType: !76, size: 32, offset: 9248)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "lastsize", scope: !558, file: !326, line: 72, baseType: !131, size: 64, offset: 9280)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !558, file: !326, line: 74, baseType: !161, size: 32, offset: 9344)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !558, file: !326, line: 74, baseType: !161, size: 32, offset: 9376)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !558, file: !326, line: 76, baseType: !512, size: 64, offset: 9408)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !558, file: !326, line: 77, baseType: !570, size: 64, offset: 9472)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64)
!571 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipCache", file: !326, line: 77, flags: DIFlagFwdDecl)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !558, file: !326, line: 78, baseType: !378, size: 64, offset: 9536)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "tracking", scope: !558, file: !326, line: 80, baseType: !574, size: 2624, offset: 9600)
!574 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTracking", file: !380, line: 340, size: 2624, elements: !575)
!575 = !{!576, !604, !622, !623, !624, !642, !700, !701, !803, !804, !805, !806, !812}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "settings", scope: !574, file: !380, line: 341, baseType: !577, size: 576)
!577 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingSettings", file: !380, line: 251, baseType: !578)
!578 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingSettings", file: !380, line: 207, size: 576, elements: !579)
!579 = !{!580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !578, file: !380, line: 208, baseType: !76, size: 32)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "default_motion_model", scope: !578, file: !380, line: 211, baseType: !73, size: 16, offset: 32)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "default_algorithm_flag", scope: !578, file: !380, line: 212, baseType: !73, size: 16, offset: 48)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "default_minimum_correlation", scope: !578, file: !380, line: 213, baseType: !161, size: 32, offset: 64)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_size", scope: !578, file: !380, line: 214, baseType: !73, size: 16, offset: 96)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "default_search_size", scope: !578, file: !380, line: 215, baseType: !73, size: 16, offset: 112)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "default_frames_limit", scope: !578, file: !380, line: 216, baseType: !73, size: 16, offset: 128)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "default_margin", scope: !578, file: !380, line: 217, baseType: !73, size: 16, offset: 144)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_match", scope: !578, file: !380, line: 218, baseType: !73, size: 16, offset: 160)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "default_flag", scope: !578, file: !380, line: 219, baseType: !73, size: 16, offset: 176)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "default_weight", scope: !578, file: !380, line: 220, baseType: !161, size: 32, offset: 192)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "motion_flag", scope: !578, file: !380, line: 222, baseType: !73, size: 16, offset: 224)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "speed", scope: !578, file: !380, line: 225, baseType: !73, size: 16, offset: 240)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe1", scope: !578, file: !380, line: 228, baseType: !76, size: 32, offset: 256)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe2", scope: !578, file: !380, line: 229, baseType: !76, size: 32, offset: 288)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction_flag", scope: !578, file: !380, line: 233, baseType: !76, size: 32, offset: 320)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "refine_camera_intrinsics", scope: !578, file: !380, line: 236, baseType: !73, size: 16, offset: 352)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !578, file: !380, line: 236, baseType: !73, size: 16, offset: 368)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !578, file: !380, line: 241, baseType: !161, size: 32, offset: 384)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "clean_frames", scope: !578, file: !380, line: 244, baseType: !76, size: 32, offset: 416)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "clean_action", scope: !578, file: !380, line: 244, baseType: !76, size: 32, offset: 448)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "clean_error", scope: !578, file: !380, line: 245, baseType: !161, size: 32, offset: 480)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "object_distance", scope: !578, file: !380, line: 248, baseType: !161, size: 32, offset: 512)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !578, file: !380, line: 250, baseType: !76, size: 32, offset: 544)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !574, file: !380, line: 342, baseType: !605, size: 448, offset: 576)
!605 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingCamera", file: !380, line: 79, baseType: !606)
!606 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingCamera", file: !380, line: 61, size: 448, elements: !607)
!607 = !{!608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "intrinsics", scope: !606, file: !380, line: 62, baseType: !28, size: 64)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_model", scope: !606, file: !380, line: 64, baseType: !73, size: 16, offset: 64)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !606, file: !380, line: 65, baseType: !73, size: 16, offset: 80)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "sensor_width", scope: !606, file: !380, line: 67, baseType: !161, size: 32, offset: 96)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_aspect", scope: !606, file: !380, line: 68, baseType: !161, size: 32, offset: 128)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "focal", scope: !606, file: !380, line: 69, baseType: !161, size: 32, offset: 160)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !606, file: !380, line: 70, baseType: !73, size: 16, offset: 192)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !606, file: !380, line: 71, baseType: !73, size: 16, offset: 208)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "principal", scope: !606, file: !380, line: 72, baseType: !382, size: 64, offset: 224)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "k1", scope: !606, file: !380, line: 75, baseType: !161, size: 32, offset: 288)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "k2", scope: !606, file: !380, line: 75, baseType: !161, size: 32, offset: 320)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "k3", scope: !606, file: !380, line: 75, baseType: !161, size: 32, offset: 352)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "division_k1", scope: !606, file: !380, line: 78, baseType: !161, size: 32, offset: 384)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "division_k2", scope: !606, file: !380, line: 78, baseType: !161, size: 32, offset: 416)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "tracks", scope: !574, file: !380, line: 343, baseType: !83, size: 128, offset: 1024)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "plane_tracks", scope: !574, file: !380, line: 344, baseType: !83, size: 128, offset: 1152)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction", scope: !574, file: !380, line: 345, baseType: !625, size: 192, offset: 1280)
!625 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingReconstruction", file: !380, line: 278, baseType: !626)
!626 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingReconstruction", file: !380, line: 270, size: 192, elements: !627)
!627 = !{!628, !629, !630, !631, !632}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !626, file: !380, line: 271, baseType: !76, size: 32)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !626, file: !380, line: 273, baseType: !161, size: 32, offset: 32)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "last_camera", scope: !626, file: !380, line: 275, baseType: !76, size: 32, offset: 64)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "camnr", scope: !626, file: !380, line: 276, baseType: !76, size: 32, offset: 96)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "cameras", scope: !626, file: !380, line: 277, baseType: !633, size: 64, offset: 128)
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 64)
!634 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieReconstructedCamera", file: !380, line: 55, size: 576, elements: !635)
!635 = !{!636, !637, !638}
!636 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !634, file: !380, line: 56, baseType: !76, size: 32)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !634, file: !380, line: 57, baseType: !161, size: 32, offset: 32)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !634, file: !380, line: 58, baseType: !639, size: 512, offset: 64)
!639 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 512, elements: !640)
!640 = !{!641, !641}
!641 = !DISubrange(count: 4)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "stabilization", scope: !574, file: !380, line: 346, baseType: !643, size: 384, offset: 1472)
!643 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStabilization", file: !380, line: 268, baseType: !644)
!644 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStabilization", file: !380, line: 253, size: 384, elements: !645)
!645 = !{!646, !647, !648, !649, !650, !694, !695, !696, !697, !698, !699}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !644, file: !380, line: 254, baseType: !76, size: 32)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "tot_track", scope: !644, file: !380, line: 255, baseType: !76, size: 32, offset: 32)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !644, file: !380, line: 255, baseType: !76, size: 32, offset: 64)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "maxscale", scope: !644, file: !380, line: 258, baseType: !161, size: 32, offset: 96)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "rot_track", scope: !644, file: !380, line: 259, baseType: !651, size: 64, offset: 128)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64)
!652 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingTrack", file: !380, line: 164, baseType: !653)
!653 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingTrack", file: !380, line: 108, size: 1664, elements: !654)
!654 = !{!655, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !653, file: !380, line: 109, baseType: !656, size: 64)
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 64)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !653, file: !380, line: 109, baseType: !656, size: 64, offset: 64)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !653, file: !380, line: 111, baseType: !57, size: 512, offset: 128)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "pat_min", scope: !653, file: !380, line: 119, baseType: !382, size: 64, offset: 640)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "pat_max", scope: !653, file: !380, line: 119, baseType: !382, size: 64, offset: 704)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !653, file: !380, line: 125, baseType: !382, size: 64, offset: 768)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !653, file: !380, line: 125, baseType: !382, size: 64, offset: 832)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !653, file: !380, line: 127, baseType: !382, size: 64, offset: 896)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !653, file: !380, line: 130, baseType: !76, size: 32, offset: 960)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !653, file: !380, line: 131, baseType: !76, size: 32, offset: 992)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !653, file: !380, line: 132, baseType: !667, size: 64, offset: 1024)
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64)
!668 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingMarker", file: !380, line: 106, baseType: !669)
!669 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingMarker", file: !380, line: 81, size: 512, elements: !670)
!670 = !{!671, !672, !675, !676, !677, !678}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !669, file: !380, line: 82, baseType: !382, size: 64)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_corners", scope: !669, file: !380, line: 97, baseType: !673, size: 256, offset: 64)
!673 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 256, elements: !674)
!674 = !{!641, !133}
!675 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !669, file: !380, line: 102, baseType: !382, size: 64, offset: 320)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !669, file: !380, line: 102, baseType: !382, size: 64, offset: 384)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !669, file: !380, line: 104, baseType: !76, size: 32, offset: 448)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !669, file: !380, line: 105, baseType: !76, size: 32, offset: 480)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "bundle_pos", scope: !653, file: !380, line: 135, baseType: !350, size: 96, offset: 1088)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !653, file: !380, line: 136, baseType: !161, size: 32, offset: 1184)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !653, file: !380, line: 139, baseType: !76, size: 32, offset: 1216)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "pat_flag", scope: !653, file: !380, line: 139, baseType: !76, size: 32, offset: 1248)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "search_flag", scope: !653, file: !380, line: 139, baseType: !76, size: 32, offset: 1280)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !653, file: !380, line: 140, baseType: !350, size: 96, offset: 1312)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "frames_limit", scope: !653, file: !380, line: 143, baseType: !73, size: 16, offset: 1408)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !653, file: !380, line: 144, baseType: !73, size: 16, offset: 1424)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_match", scope: !653, file: !380, line: 145, baseType: !73, size: 16, offset: 1440)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "motion_model", scope: !653, file: !380, line: 148, baseType: !73, size: 16, offset: 1456)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm_flag", scope: !653, file: !380, line: 149, baseType: !76, size: 32, offset: 1472)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "minimum_correlation", scope: !653, file: !380, line: 150, baseType: !161, size: 32, offset: 1504)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !653, file: !380, line: 152, baseType: !378, size: 64, offset: 1536)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !653, file: !380, line: 163, baseType: !161, size: 32, offset: 1600)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !653, file: !380, line: 163, baseType: !161, size: 32, offset: 1632)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "locinf", scope: !644, file: !380, line: 261, baseType: !161, size: 32, offset: 192)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "scaleinf", scope: !644, file: !380, line: 261, baseType: !161, size: 32, offset: 224)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "rotinf", scope: !644, file: !380, line: 261, baseType: !161, size: 32, offset: 256)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !644, file: !380, line: 263, baseType: !76, size: 32, offset: 288)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !644, file: !380, line: 266, baseType: !76, size: 32, offset: 320)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !644, file: !380, line: 267, baseType: !161, size: 32, offset: 352)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !574, file: !380, line: 347, baseType: !651, size: 64, offset: 1856)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "act_plane_track", scope: !574, file: !380, line: 348, baseType: !702, size: 64, offset: 1920)
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !703, size: 64)
!703 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingPlaneTrack", file: !380, line: 205, baseType: !704)
!704 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingPlaneTrack", file: !380, line: 186, size: 1024, elements: !705)
!705 = !{!706, !708, !709, !710, !712, !713, !714, !722, !723, !724, !801, !802}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !704, file: !380, line: 187, baseType: !707, size: 64)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 64)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !704, file: !380, line: 187, baseType: !707, size: 64, offset: 64)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !704, file: !380, line: 189, baseType: !57, size: 512, offset: 128)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "point_tracks", scope: !704, file: !380, line: 191, baseType: !711, size: 64, offset: 640)
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 64)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "point_tracksnr", scope: !704, file: !380, line: 193, baseType: !76, size: 32, offset: 704)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !704, file: !380, line: 193, baseType: !76, size: 32, offset: 736)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !704, file: !380, line: 195, baseType: !715, size: 64, offset: 768)
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 64)
!716 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingPlaneMarker", file: !380, line: 184, baseType: !717)
!717 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingPlaneMarker", file: !380, line: 166, size: 320, elements: !718)
!718 = !{!719, !720, !721}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "corners", scope: !717, file: !380, line: 180, baseType: !673, size: 256)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !717, file: !380, line: 182, baseType: !76, size: 32, offset: 256)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !717, file: !380, line: 183, baseType: !76, size: 32, offset: 288)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !704, file: !380, line: 196, baseType: !76, size: 32, offset: 832)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !704, file: !380, line: 198, baseType: !76, size: 32, offset: 864)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "image", scope: !704, file: !380, line: 200, baseType: !725, size: 64, offset: 896)
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !726, size: 64)
!726 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !514, line: 77, size: 15424, elements: !727)
!727 = !{!728, !729, !730, !733, !736, !737, !740, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !760, !761, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !787, !788, !789, !790, !791, !795}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !726, file: !514, line: 78, baseType: !278, size: 960)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !726, file: !514, line: 80, baseType: !296, size: 8192, offset: 960)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !726, file: !514, line: 82, baseType: !731, size: 64, offset: 9152)
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !732, size: 64)
!732 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !514, line: 43, flags: DIFlagFwdDecl)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !726, file: !514, line: 83, baseType: !734, size: 64, offset: 9216)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64)
!735 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !64, line: 46, flags: DIFlagFwdDecl)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !726, file: !514, line: 86, baseType: !512, size: 64, offset: 9280)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !726, file: !514, line: 87, baseType: !738, size: 64, offset: 9344)
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 64)
!739 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !514, line: 44, flags: DIFlagFwdDecl)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !726, file: !514, line: 89, baseType: !741, size: 512, offset: 9408)
!741 = !DICompositeType(tag: DW_TAG_array_type, baseType: !738, size: 512, elements: !742)
!742 = !{!743}
!743 = !DISubrange(count: 8)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !726, file: !514, line: 90, baseType: !73, size: 16, offset: 9920)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !726, file: !514, line: 90, baseType: !73, size: 16, offset: 9936)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !726, file: !514, line: 92, baseType: !73, size: 16, offset: 9952)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !726, file: !514, line: 92, baseType: !73, size: 16, offset: 9968)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !726, file: !514, line: 93, baseType: !73, size: 16, offset: 9984)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !726, file: !514, line: 93, baseType: !73, size: 16, offset: 10000)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !726, file: !514, line: 94, baseType: !76, size: 32, offset: 10016)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !726, file: !514, line: 97, baseType: !73, size: 16, offset: 10048)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !726, file: !514, line: 97, baseType: !73, size: 16, offset: 10064)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !726, file: !514, line: 98, baseType: !73, size: 16, offset: 10080)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !726, file: !514, line: 98, baseType: !73, size: 16, offset: 10096)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !726, file: !514, line: 99, baseType: !73, size: 16, offset: 10112)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !726, file: !514, line: 99, baseType: !73, size: 16, offset: 10128)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !726, file: !514, line: 100, baseType: !7, size: 32, offset: 10144)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !726, file: !514, line: 101, baseType: !759, size: 64, offset: 10176)
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !726, file: !514, line: 103, baseType: !302, size: 64, offset: 10240)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !726, file: !514, line: 104, baseType: !762, size: 64, offset: 10304)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 64)
!763 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !64, line: 159, size: 448, elements: !764)
!764 = !{!765, !767, !768, !770, !771, !773}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !763, file: !64, line: 161, baseType: !766, size: 64)
!766 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !132)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !763, file: !64, line: 162, baseType: !766, size: 64, offset: 64)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !763, file: !64, line: 163, baseType: !769, size: 32, offset: 128)
!769 = !DICompositeType(tag: DW_TAG_array_type, baseType: !73, size: 32, elements: !132)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !763, file: !64, line: 164, baseType: !769, size: 32, offset: 160)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !763, file: !64, line: 165, baseType: !772, size: 128, offset: 192)
!772 = !DICompositeType(tag: DW_TAG_array_type, baseType: !759, size: 128, elements: !132)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !763, file: !64, line: 166, baseType: !774, size: 128, offset: 320)
!774 = !DICompositeType(tag: DW_TAG_array_type, baseType: !734, size: 128, elements: !132)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !726, file: !514, line: 107, baseType: !161, size: 32, offset: 10368)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !726, file: !514, line: 108, baseType: !76, size: 32, offset: 10400)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !726, file: !514, line: 109, baseType: !73, size: 16, offset: 10432)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !726, file: !514, line: 110, baseType: !73, size: 16, offset: 10448)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !726, file: !514, line: 113, baseType: !76, size: 32, offset: 10464)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !726, file: !514, line: 113, baseType: !76, size: 32, offset: 10496)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !726, file: !514, line: 114, baseType: !58, size: 8, offset: 10528)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !726, file: !514, line: 114, baseType: !58, size: 8, offset: 10536)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !726, file: !514, line: 115, baseType: !73, size: 16, offset: 10544)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !726, file: !514, line: 116, baseType: !785, size: 128, offset: 10560)
!785 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 128, elements: !786)
!786 = !{!641}
!787 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !726, file: !514, line: 119, baseType: !161, size: 32, offset: 10688)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !726, file: !514, line: 119, baseType: !161, size: 32, offset: 10720)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !726, file: !514, line: 122, baseType: !546, size: 512, offset: 10752)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !726, file: !514, line: 123, baseType: !58, size: 8, offset: 11264)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !726, file: !514, line: 125, baseType: !792, size: 56, offset: 11272)
!792 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 56, elements: !793)
!793 = !{!794}
!794 = !DISubrange(count: 7)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !726, file: !514, line: 126, baseType: !796, size: 4096, offset: 11328)
!796 = !DICompositeType(tag: DW_TAG_array_type, baseType: !797, size: 4096, elements: !742)
!797 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !514, line: 69, baseType: !798)
!798 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !514, line: 67, size: 512, elements: !799)
!799 = !{!800}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !798, file: !514, line: 68, baseType: !57, size: 512)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "image_opacity", scope: !704, file: !380, line: 201, baseType: !161, size: 32, offset: 960)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !704, file: !380, line: 204, baseType: !76, size: 32, offset: 992)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !574, file: !380, line: 350, baseType: !83, size: 128, offset: 1984)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "objectnr", scope: !574, file: !380, line: 351, baseType: !76, size: 32, offset: 2112)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "tot_object", scope: !574, file: !380, line: 351, baseType: !76, size: 32, offset: 2144)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !574, file: !380, line: 353, baseType: !807, size: 64, offset: 2176)
!807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !808, size: 64)
!808 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStats", file: !380, line: 297, baseType: !809)
!809 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStats", file: !380, line: 295, size: 2048, elements: !810)
!810 = !{!811}
!811 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !809, file: !380, line: 296, baseType: !495, size: 2048)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "dopesheet", scope: !574, file: !380, line: 355, baseType: !813, size: 384, offset: 2240)
!813 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingDopesheet", file: !380, line: 338, baseType: !814)
!814 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingDopesheet", file: !380, line: 322, size: 384, elements: !815)
!815 = !{!816, !817, !818, !819, !820, !821, !822}
!816 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !814, file: !380, line: 323, baseType: !76, size: 32)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "sort_method", scope: !814, file: !380, line: 325, baseType: !73, size: 16, offset: 32)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !814, file: !380, line: 326, baseType: !73, size: 16, offset: 48)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "coverage_segments", scope: !814, file: !380, line: 331, baseType: !83, size: 128, offset: 64)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !814, file: !380, line: 334, baseType: !83, size: 128, offset: 192)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "tot_channel", scope: !814, file: !380, line: 335, baseType: !76, size: 32, offset: 320)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !814, file: !380, line: 337, baseType: !76, size: 32, offset: 352)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "tracking_context", scope: !558, file: !326, line: 81, baseType: !28, size: 64, offset: 12224)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !558, file: !326, line: 85, baseType: !825, size: 6208, offset: 12288)
!825 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipProxy", file: !326, line: 55, size: 6208, elements: !826)
!826 = !{!827, !828, !829, !830, !831}
!827 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !825, file: !326, line: 56, baseType: !501, size: 6144)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !825, file: !326, line: 58, baseType: !73, size: 16, offset: 6144)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !825, file: !326, line: 59, baseType: !73, size: 16, offset: 6160)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flag", scope: !825, file: !326, line: 60, baseType: !73, size: 16, offset: 6176)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flag", scope: !825, file: !326, line: 61, baseType: !73, size: 16, offset: 6192)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !558, file: !326, line: 86, baseType: !76, size: 32, offset: 18496)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !558, file: !326, line: 88, baseType: !76, size: 32, offset: 18528)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !558, file: !326, line: 90, baseType: !76, size: 32, offset: 18560)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "frame_offset", scope: !558, file: !326, line: 94, baseType: !76, size: 32, offset: 18592)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !558, file: !326, line: 100, baseType: !546, size: 512, offset: 18624)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !450, file: !441, line: 154, baseType: !838, size: 64, offset: 1664)
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 64)
!839 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mask", file: !330, line: 264, flags: DIFlagFwdDecl)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !450, file: !441, line: 156, baseType: !512, size: 64, offset: 1728)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "effect_fader", scope: !450, file: !441, line: 158, baseType: !161, size: 32, offset: 1792)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "speed_fader", scope: !450, file: !441, line: 159, baseType: !161, size: 32, offset: 1824)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "seq1", scope: !450, file: !441, line: 162, baseType: !453, size: 64, offset: 1856)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "seq2", scope: !450, file: !441, line: 162, baseType: !453, size: 64, offset: 1920)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "seq3", scope: !450, file: !441, line: 162, baseType: !453, size: 64, offset: 1984)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !450, file: !441, line: 164, baseType: !83, size: 128, offset: 2048)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "sound", scope: !450, file: !441, line: 166, baseType: !848, size: 64, offset: 2176)
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !849, size: 64)
!849 = !DICompositeType(tag: DW_TAG_structure_type, name: "bSound", file: !441, line: 51, flags: DIFlagFwdDecl)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "scene_sound", scope: !450, file: !441, line: 167, baseType: !28, size: 64, offset: 2240)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "volume", scope: !450, file: !441, line: 168, baseType: !161, size: 32, offset: 2304)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "pitch", scope: !450, file: !441, line: 170, baseType: !161, size: 32, offset: 2336)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "pan", scope: !450, file: !441, line: 170, baseType: !161, size: 32, offset: 2368)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "strobe", scope: !450, file: !441, line: 171, baseType: !161, size: 32, offset: 2400)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "effectdata", scope: !450, file: !441, line: 173, baseType: !28, size: 64, offset: 2432)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "anim_startofs", scope: !450, file: !441, line: 175, baseType: !76, size: 32, offset: 2496)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "anim_endofs", scope: !450, file: !441, line: 176, baseType: !76, size: 32, offset: 2528)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "blend_mode", scope: !450, file: !441, line: 179, baseType: !76, size: 32, offset: 2560)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "blend_opacity", scope: !450, file: !441, line: 180, baseType: !161, size: 32, offset: 2592)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !450, file: !441, line: 183, baseType: !76, size: 32, offset: 2624)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !450, file: !441, line: 185, baseType: !58, size: 8, offset: 2656)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !450, file: !441, line: 186, baseType: !863, size: 24, offset: 2664)
!863 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 24, elements: !351)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !450, file: !441, line: 189, baseType: !83, size: 128, offset: 2688)
