; ModuleID = 'blender/source/blender/modifiers/intern/MOD_meshcache.c'
source_filename = "blender/source/blender/modifiers/intern/MOD_meshcache.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!29 = !{!30, !31, !32}
!30 = !DIEnumerator(name: "DM_TYPE_CDDM", value: 0, isUnsigned: true)
!31 = !DIEnumerator(name: "DM_TYPE_EDITBMESH", value: 1, isUnsigned: true)
!32 = !DIEnumerator(name: "DM_TYPE_CCGDM", value: 2, isUnsigned: true)
!33 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "DMDirtyFlag", file: !28, line: 164, baseType: !7, size: 32, elements: !34)
!34 = !{!35, !36, !37}
!35 = !DIEnumerator(name: "DM_DIRTY_TESS_CDLAYERS", value: 1, isUnsigned: true)
!36 = !DIEnumerator(name: "DM_DIRTY_MCOL_UPDATE_DRAW", value: 2, isUnsigned: true)
!37 = !DIEnumerator(name: "DM_DIRTY_NORMALS", value: 4, isUnsigned: true)
!38 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "DMForeachFlag", file: !28, line: 159, baseType: !7, size: 32, elements: !39)
!39 = !{!40, !41}
!40 = !DIEnumerator(name: "DM_FOREACH_NOP", value: 0, isUnsigned: true)
!41 = !DIEnumerator(name: "DM_FOREACH_USE_NORMAL", value: 1, isUnsigned: true)
!42 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "DMDrawOption", file: !28, line: 134, baseType: !7, size: 32, elements: !43)
!43 = !{!44, !45, !46, !47}
!44 = !DIEnumerator(name: "DM_DRAW_OPTION_SKIP", value: 0, isUnsigned: true)
!45 = !DIEnumerator(name: "DM_DRAW_OPTION_NORMAL", value: 1, isUnsigned: true)
!46 = !DIEnumerator(name: "DM_DRAW_OPTION_NO_MCOL", value: 2, isUnsigned: true)
!47 = !DIEnumerator(name: "DM_DRAW_OPTION_STIPPLE", value: 3, isUnsigned: true)
!48 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "DMDrawFlag", file: !28, line: 152, baseType: !7, size: 32, elements: !49)
!49 = !{!50, !51, !52, !53}
!50 = !DIEnumerator(name: "DM_DRAW_USE_COLORS", value: 1, isUnsigned: true)
!51 = !DIEnumerator(name: "DM_DRAW_ALWAYS_SMOOTH", value: 2, isUnsigned: true)
!52 = !DIEnumerator(name: "DM_DRAW_USE_ACTIVE_UV", value: 4, isUnsigned: true)
!53 = !DIEnumerator(name: "DM_DRAW_USE_TEXPAINT_UV", value: 8, isUnsigned: true)
!54 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ModifierApplyFlag", file: !6, line: 110, baseType: !7, size: 32, elements: !55)
!55 = !{!56, !57, !58, !59}
!56 = !DIEnumerator(name: "MOD_APPLY_RENDER", value: 1, isUnsigned: true)
!57 = !DIEnumerator(name: "MOD_APPLY_USECACHE", value: 2, isUnsigned: true)
!58 = !DIEnumerator(name: "MOD_APPLY_ORCO", value: 4, isUnsigned: true)
!59 = !DIEnumerator(name: "MOD_APPLY_IGNORE_SIMPLIFY", value: 8, isUnsigned: true)
!60 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !61, line: 1310, baseType: !7, size: 32, elements: !62)
!61 = !DIFile(filename: "blender/source/blender/makesdna/DNA_modifier_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!62 = !{!63, !64}
!63 = !DIEnumerator(name: "MOD_MESHCACHE_DEFORM_OVERWRITE", value: 0, isUnsigned: true)
!64 = !DIEnumerator(name: "MOD_MESHCACHE_DEFORM_INTEGRATE", value: 1, isUnsigned: true)
!65 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !61, line: 1327, baseType: !7, size: 32, elements: !66)
!66 = !{!67, !68}
!67 = !DIEnumerator(name: "MOD_MESHCACHE_PLAY_CFEA", value: 0, isUnsigned: true)
!68 = !DIEnumerator(name: "MOD_MESHCACHE_PLAY_EVAL", value: 1, isUnsigned: true)
!69 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !70, line: 339, baseType: !7, size: 32, elements: !71)
!70 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!71 = !{!72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82}
!72 = !DIEnumerator(name: "OB_EMPTY", value: 0, isUnsigned: true)
!73 = !DIEnumerator(name: "OB_MESH", value: 1, isUnsigned: true)
!74 = !DIEnumerator(name: "OB_CURVE", value: 2, isUnsigned: true)
!75 = !DIEnumerator(name: "OB_SURF", value: 3, isUnsigned: true)
!76 = !DIEnumerator(name: "OB_FONT", value: 4, isUnsigned: true)
!77 = !DIEnumerator(name: "OB_MBALL", value: 5, isUnsigned: true)
!78 = !DIEnumerator(name: "OB_LAMP", value: 10, isUnsigned: true)
!79 = !DIEnumerator(name: "OB_CAMERA", value: 11, isUnsigned: true)
!80 = !DIEnumerator(name: "OB_SPEAKER", value: 12, isUnsigned: true)
!81 = !DIEnumerator(name: "OB_LATTICE", value: 22, isUnsigned: true)
!82 = !DIEnumerator(name: "OB_ARMATURE", value: 25, isUnsigned: true)
!83 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !61, line: 1305, baseType: !7, size: 32, elements: !84)
!84 = !{!85, !86}
!85 = !DIEnumerator(name: "MOD_MESHCACHE_TYPE_MDD", value: 1, isUnsigned: true)
!86 = !DIEnumerator(name: "MOD_MESHCACHE_TYPE_PC2", value: 2, isUnsigned: true)
!87 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !61, line: 1315, baseType: !7, size: 32, elements: !88)
!88 = !{!89, !90}
!89 = !DIEnumerator(name: "MOD_MESHCACHE_INTERP_NONE", value: 0, isUnsigned: true)
!90 = !DIEnumerator(name: "MOD_MESHCACHE_INTERP_LINEAR", value: 1, isUnsigned: true)
!91 = !{!92, !124, !1670, !134, !1671}
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "MeshCacheModifierData", file: !61, line: 1303, baseType: !94)
!94 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MeshCacheModifierData", file: !61, line: 1273, size: 9408, elements: !95)
!95 = !{!96, !1653, !1654, !1655, !1656, !1657, !1658, !1659, !1660, !1661, !1662, !1663, !1664, !1665, !1666, !1667, !1668, !1669}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "modifier", scope: !94, file: !61, line: 1274, baseType: !97, size: 896)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "ModifierData", file: !61, line: 110, baseType: !98)
!98 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ModifierData", file: !61, line: 99, size: 896, elements: !99)
!99 = !{!100, !102, !103, !105, !106, !107, !108, !113, !1652}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !98, file: !61, line: 100, baseType: !101, size: 64)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !98, file: !61, line: 100, baseType: !101, size: 64, offset: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !98, file: !61, line: 102, baseType: !104, size: 32, offset: 128)
!104 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !98, file: !61, line: 102, baseType: !104, size: 32, offset: 160)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "stackindex", scope: !98, file: !61, line: 103, baseType: !104, size: 32, offset: 192)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !98, file: !61, line: 103, baseType: !104, size: 32, offset: 224)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !98, file: !61, line: 104, baseType: !109, size: 512, offset: 256)
!109 = !DICompositeType(tag: DW_TAG_array_type, baseType: !110, size: 512, elements: !111)
!110 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!111 = !{!112}
!112 = !DISubrange(count: 64)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !98, file: !61, line: 107, baseType: !114, size: 64, offset: 768)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !116, line: 1216, size: 39680, elements: !117)
!116 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!117 = !{!118, !185, !188, !963, !966, !967, !968, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !994, !997, !1000, !1224, !1227, !1526, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1548, !1549, !1550, !1551, !1552, !1560, !1626, !1633, !1634, !1641, !1644, !1645, !1646, !1647, !1648, !1649}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !115, file: !116, line: 1217, baseType: !119, size: 960)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !120, line: 130, baseType: !121)
!120 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !120, line: 117, size: 960, elements: !122)
!122 = !{!123, !125, !126, !128, !147, !151, !153, !154, !155, !156}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !121, file: !120, line: 118, baseType: !124, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !121, file: !120, line: 118, baseType: !124, size: 64, offset: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !121, file: !120, line: 119, baseType: !127, size: 64, offset: 128)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !121, file: !120, line: 120, baseType: !129, size: 64, offset: 192)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !120, line: 136, size: 17600, elements: !131)
!131 = !{!132, !133, !135, !138, !142, !143, !144}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !130, file: !120, line: 137, baseType: !119, size: 960)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !130, file: !120, line: 138, baseType: !134, size: 64, offset: 960)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !130, file: !120, line: 139, baseType: !136, size: 64, offset: 1024)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !120, line: 43, flags: DIFlagFwdDecl)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !130, file: !120, line: 140, baseType: !139, size: 8192, offset: 1088)
!139 = !DICompositeType(tag: DW_TAG_array_type, baseType: !110, size: 8192, elements: !140)
!140 = !{!141}
!141 = !DISubrange(count: 1024)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !130, file: !120, line: 141, baseType: !139, size: 8192, offset: 9280)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !130, file: !120, line: 148, baseType: !129, size: 64, offset: 17472)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !130, file: !120, line: 150, baseType: !145, size: 64, offset: 17536)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !120, line: 45, flags: DIFlagFwdDecl)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !121, file: !120, line: 121, baseType: !148, size: 528, offset: 256)
!148 = !DICompositeType(tag: DW_TAG_array_type, baseType: !110, size: 528, elements: !149)
!149 = !{!150}
!150 = !DISubrange(count: 66)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !121, file: !120, line: 126, baseType: !152, size: 16, offset: 784)
!152 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !121, file: !120, line: 127, baseType: !104, size: 32, offset: 800)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !121, file: !120, line: 128, baseType: !104, size: 32, offset: 832)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !121, file: !120, line: 128, baseType: !104, size: 32, offset: 864)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !121, file: !120, line: 129, baseType: !157, size: 64, offset: 896)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !120, line: 75, baseType: !159)
!159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !120, line: 62, size: 1024, elements: !160)
!160 = !{!161, !163, !164, !165, !166, !167, !168, !169, !183, !184}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !159, file: !120, line: 63, baseType: !162, size: 64)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !159, file: !120, line: 63, baseType: !162, size: 64, offset: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !159, file: !120, line: 64, baseType: !110, size: 8, offset: 128)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !159, file: !120, line: 64, baseType: !110, size: 8, offset: 136)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !159, file: !120, line: 65, baseType: !152, size: 16, offset: 144)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !159, file: !120, line: 66, baseType: !109, size: 512, offset: 160)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !159, file: !120, line: 67, baseType: !104, size: 32, offset: 672)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !159, file: !120, line: 69, baseType: !170, size: 256, offset: 704)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !120, line: 60, baseType: !171)
!171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !120, line: 48, size: 256, elements: !172)
!172 = !{!173, !174, !181, !182}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !171, file: !120, line: 49, baseType: !124, size: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !171, file: !120, line: 58, baseType: !175, size: 128, offset: 64)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !176, line: 71, baseType: !177)
!176 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !176, line: 69, size: 128, elements: !178)
!178 = !{!179, !180}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !177, file: !176, line: 70, baseType: !124, size: 64)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !177, file: !176, line: 70, baseType: !124, size: 64, offset: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !171, file: !120, line: 59, baseType: !104, size: 32, offset: 192)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !171, file: !120, line: 59, baseType: !104, size: 32, offset: 224)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !159, file: !120, line: 70, baseType: !104, size: 32, offset: 960)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !159, file: !120, line: 74, baseType: !104, size: 32, offset: 992)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !115, file: !116, line: 1218, baseType: !186, size: 64, offset: 960)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!187 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !116, line: 58, flags: DIFlagFwdDecl)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !115, file: !116, line: 1220, baseType: !189, size: 64, offset: 1024)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!190 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !70, line: 115, size: 11392, elements: !191)
!191 = !{!192, !193, !194, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !212, !224, !238, !239, !282, !283, !286, !287, !303, !304, !305, !306, !307, !308, !309, !313, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !329, !330, !331, !332, !333, !334, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !394, !395, !396, !397, !398, !399, !400, !401, !402, !405, !408, !412, !413, !414, !415, !416, !419, !422, !910, !911, !917, !918, !919, !920, !921, !922, !924, !927, !930, !932, !951, !952}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !190, file: !70, line: 116, baseType: !119, size: 960)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !190, file: !70, line: 117, baseType: !186, size: 64, offset: 960)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !190, file: !70, line: 119, baseType: !195, size: 64, offset: 1024)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !70, line: 57, flags: DIFlagFwdDecl)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !190, file: !70, line: 121, baseType: !152, size: 16, offset: 1088)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !190, file: !70, line: 121, baseType: !152, size: 16, offset: 1104)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !190, file: !70, line: 122, baseType: !104, size: 32, offset: 1120)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !190, file: !70, line: 122, baseType: !104, size: 32, offset: 1152)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !190, file: !70, line: 122, baseType: !104, size: 32, offset: 1184)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !190, file: !70, line: 123, baseType: !109, size: 512, offset: 1216)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !190, file: !70, line: 124, baseType: !189, size: 64, offset: 1728)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !190, file: !70, line: 124, baseType: !189, size: 64, offset: 1792)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !190, file: !70, line: 127, baseType: !189, size: 64, offset: 1856)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !190, file: !70, line: 127, baseType: !189, size: 64, offset: 1920)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !190, file: !70, line: 127, baseType: !189, size: 64, offset: 1984)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !190, file: !70, line: 128, baseType: !209, size: 64, offset: 2048)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!210 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !211, line: 46, flags: DIFlagFwdDecl)
!211 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!212 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !190, file: !70, line: 130, baseType: !213, size: 64, offset: 2112)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !70, line: 97, size: 832, elements: !215)
!215 = !{!216, !222, !223}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !214, file: !70, line: 98, baseType: !217, size: 768)
!217 = !DICompositeType(tag: DW_TAG_array_type, baseType: !218, size: 768, elements: !219)
!218 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!219 = !{!220, !221}
!220 = !DISubrange(count: 8)
!221 = !DISubrange(count: 3)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !214, file: !70, line: 99, baseType: !104, size: 32, offset: 768)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !214, file: !70, line: 99, baseType: !104, size: 32, offset: 800)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !190, file: !70, line: 131, baseType: !225, size: 64, offset: 2176)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!226 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !227, line: 486, size: 1600, elements: !228)
!227 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!228 = !{!229, !230, !231, !232, !233, !234, !235, !236, !237}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !226, file: !227, line: 487, baseType: !119, size: 960)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !226, file: !227, line: 489, baseType: !175, size: 128, offset: 960)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !226, file: !227, line: 490, baseType: !175, size: 128, offset: 1088)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !226, file: !227, line: 491, baseType: !175, size: 128, offset: 1216)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !226, file: !227, line: 492, baseType: !175, size: 128, offset: 1344)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !226, file: !227, line: 494, baseType: !104, size: 32, offset: 1472)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !226, file: !227, line: 495, baseType: !104, size: 32, offset: 1504)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !226, file: !227, line: 497, baseType: !104, size: 32, offset: 1536)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !226, file: !227, line: 498, baseType: !104, size: 32, offset: 1568)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !190, file: !70, line: 132, baseType: !225, size: 64, offset: 2240)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !190, file: !70, line: 133, baseType: !240, size: 64, offset: 2304)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !227, line: 334, size: 1728, elements: !242)
!242 = !{!243, !244, !247, !248, !249, !250, !251, !252, !255, !256, !257, !258, !259, !260, !261, !281}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !241, file: !227, line: 335, baseType: !175, size: 128)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !241, file: !227, line: 336, baseType: !245, size: 64, offset: 128)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!246 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !227, line: 47, flags: DIFlagFwdDecl)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !241, file: !227, line: 338, baseType: !152, size: 16, offset: 192)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !241, file: !227, line: 338, baseType: !152, size: 16, offset: 208)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !241, file: !227, line: 339, baseType: !7, size: 32, offset: 224)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !241, file: !227, line: 340, baseType: !104, size: 32, offset: 256)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !241, file: !227, line: 342, baseType: !218, size: 32, offset: 288)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !241, file: !227, line: 343, baseType: !253, size: 96, offset: 320)
!253 = !DICompositeType(tag: DW_TAG_array_type, baseType: !218, size: 96, elements: !254)
!254 = !{!221}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !241, file: !227, line: 344, baseType: !253, size: 96, offset: 416)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !241, file: !227, line: 347, baseType: !175, size: 128, offset: 512)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !241, file: !227, line: 349, baseType: !104, size: 32, offset: 640)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !241, file: !227, line: 350, baseType: !104, size: 32, offset: 672)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !241, file: !227, line: 351, baseType: !124, size: 64, offset: 704)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !241, file: !227, line: 352, baseType: !124, size: 64, offset: 768)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !241, file: !227, line: 354, baseType: !262, size: 384, offset: 832)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !227, line: 116, baseType: !263)
!263 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !227, line: 94, size: 384, elements: !264)
!264 = !{!265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !263, file: !227, line: 96, baseType: !104, size: 32)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !263, file: !227, line: 96, baseType: !104, size: 32, offset: 32)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !263, file: !227, line: 97, baseType: !104, size: 32, offset: 64)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !263, file: !227, line: 97, baseType: !104, size: 32, offset: 96)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !263, file: !227, line: 99, baseType: !152, size: 16, offset: 128)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !263, file: !227, line: 100, baseType: !152, size: 16, offset: 144)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !263, file: !227, line: 102, baseType: !152, size: 16, offset: 160)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !263, file: !227, line: 105, baseType: !152, size: 16, offset: 176)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !263, file: !227, line: 108, baseType: !152, size: 16, offset: 192)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !263, file: !227, line: 109, baseType: !152, size: 16, offset: 208)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !263, file: !227, line: 111, baseType: !152, size: 16, offset: 224)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !263, file: !227, line: 112, baseType: !152, size: 16, offset: 240)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !263, file: !227, line: 114, baseType: !104, size: 32, offset: 256)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !263, file: !227, line: 114, baseType: !104, size: 32, offset: 288)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !263, file: !227, line: 115, baseType: !104, size: 32, offset: 320)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !263, file: !227, line: 115, baseType: !104, size: 32, offset: 352)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !241, file: !227, line: 355, baseType: !109, size: 512, offset: 1216)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !190, file: !70, line: 134, baseType: !124, size: 64, offset: 2368)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !190, file: !70, line: 136, baseType: !284, size: 64, offset: 2432)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64)
!285 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !116, line: 61, flags: DIFlagFwdDecl)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !190, file: !70, line: 138, baseType: !262, size: 384, offset: 2496)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !190, file: !70, line: 139, baseType: !288, size: 64, offset: 2880)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !227, line: 80, baseType: !290)
!290 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !227, line: 72, size: 192, elements: !291)
!291 = !{!292, !299, !300, !301, !302}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !290, file: !227, line: 73, baseType: !293, size: 64)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !227, line: 59, baseType: !295)
!295 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !227, line: 56, size: 128, elements: !296)
!296 = !{!297, !298}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !295, file: !227, line: 57, baseType: !253, size: 96)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !295, file: !227, line: 58, baseType: !104, size: 32, offset: 96)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !290, file: !227, line: 74, baseType: !104, size: 32, offset: 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !290, file: !227, line: 76, baseType: !104, size: 32, offset: 96)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !290, file: !227, line: 77, baseType: !104, size: 32, offset: 128)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !290, file: !227, line: 79, baseType: !104, size: 32, offset: 160)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !190, file: !70, line: 141, baseType: !175, size: 128, offset: 2944)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !190, file: !70, line: 142, baseType: !175, size: 128, offset: 3072)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !190, file: !70, line: 143, baseType: !175, size: 128, offset: 3200)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !190, file: !70, line: 144, baseType: !175, size: 128, offset: 3328)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !190, file: !70, line: 146, baseType: !104, size: 32, offset: 3456)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !190, file: !70, line: 147, baseType: !104, size: 32, offset: 3488)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !190, file: !70, line: 150, baseType: !310, size: 64, offset: 3520)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!312 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !116, line: 179, flags: DIFlagFwdDecl)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !190, file: !70, line: 151, baseType: !314, size: 64, offset: 3584)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !190, file: !70, line: 152, baseType: !104, size: 32, offset: 3648)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !190, file: !70, line: 153, baseType: !104, size: 32, offset: 3680)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !190, file: !70, line: 156, baseType: !253, size: 96, offset: 3712)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !190, file: !70, line: 156, baseType: !253, size: 96, offset: 3808)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !190, file: !70, line: 156, baseType: !253, size: 96, offset: 3904)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !190, file: !70, line: 157, baseType: !253, size: 96, offset: 4000)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !190, file: !70, line: 158, baseType: !253, size: 96, offset: 4096)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !190, file: !70, line: 159, baseType: !253, size: 96, offset: 4192)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !190, file: !70, line: 160, baseType: !253, size: 96, offset: 4288)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !190, file: !70, line: 160, baseType: !253, size: 96, offset: 4384)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !190, file: !70, line: 161, baseType: !326, size: 128, offset: 4480)
!326 = !DICompositeType(tag: DW_TAG_array_type, baseType: !218, size: 128, elements: !327)
!327 = !{!328}
!328 = !DISubrange(count: 4)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !190, file: !70, line: 161, baseType: !326, size: 128, offset: 4608)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !190, file: !70, line: 162, baseType: !253, size: 96, offset: 4736)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !190, file: !70, line: 162, baseType: !253, size: 96, offset: 4832)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !190, file: !70, line: 163, baseType: !218, size: 32, offset: 4928)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !190, file: !70, line: 163, baseType: !218, size: 32, offset: 4960)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !190, file: !70, line: 164, baseType: !335, size: 512, offset: 4992)
!335 = !DICompositeType(tag: DW_TAG_array_type, baseType: !218, size: 512, elements: !336)
!336 = !{!328, !328}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !190, file: !70, line: 165, baseType: !335, size: 512, offset: 5504)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !190, file: !70, line: 166, baseType: !335, size: 512, offset: 6016)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !190, file: !70, line: 167, baseType: !335, size: 512, offset: 6528)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !190, file: !70, line: 176, baseType: !335, size: 512, offset: 7040)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !190, file: !70, line: 178, baseType: !7, size: 32, offset: 7552)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !190, file: !70, line: 180, baseType: !152, size: 16, offset: 7584)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !190, file: !70, line: 181, baseType: !152, size: 16, offset: 7600)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !190, file: !70, line: 183, baseType: !152, size: 16, offset: 7616)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !190, file: !70, line: 183, baseType: !152, size: 16, offset: 7632)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !190, file: !70, line: 184, baseType: !152, size: 16, offset: 7648)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !190, file: !70, line: 184, baseType: !152, size: 16, offset: 7664)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !190, file: !70, line: 185, baseType: !152, size: 16, offset: 7680)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !190, file: !70, line: 186, baseType: !152, size: 16, offset: 7696)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !190, file: !70, line: 187, baseType: !152, size: 16, offset: 7712)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !190, file: !70, line: 188, baseType: !110, size: 8, offset: 7728)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !190, file: !70, line: 189, baseType: !110, size: 8, offset: 7736)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !190, file: !70, line: 192, baseType: !104, size: 32, offset: 7744)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !190, file: !70, line: 192, baseType: !104, size: 32, offset: 7776)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !190, file: !70, line: 192, baseType: !104, size: 32, offset: 7808)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !190, file: !70, line: 192, baseType: !104, size: 32, offset: 7840)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !190, file: !70, line: 194, baseType: !104, size: 32, offset: 7872)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !190, file: !70, line: 202, baseType: !218, size: 32, offset: 7904)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !190, file: !70, line: 202, baseType: !218, size: 32, offset: 7936)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !190, file: !70, line: 202, baseType: !218, size: 32, offset: 7968)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !190, file: !70, line: 211, baseType: !218, size: 32, offset: 8000)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !190, file: !70, line: 212, baseType: !218, size: 32, offset: 8032)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !190, file: !70, line: 213, baseType: !218, size: 32, offset: 8064)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !190, file: !70, line: 214, baseType: !218, size: 32, offset: 8096)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !190, file: !70, line: 215, baseType: !218, size: 32, offset: 8128)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !190, file: !70, line: 216, baseType: !218, size: 32, offset: 8160)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !190, file: !70, line: 219, baseType: !218, size: 32, offset: 8192)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !190, file: !70, line: 220, baseType: !218, size: 32, offset: 8224)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !190, file: !70, line: 221, baseType: !218, size: 32, offset: 8256)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !190, file: !70, line: 224, baseType: !371, size: 16, offset: 8288)
!371 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !190, file: !70, line: 224, baseType: !371, size: 16, offset: 8304)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !190, file: !70, line: 226, baseType: !152, size: 16, offset: 8320)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !190, file: !70, line: 228, baseType: !110, size: 8, offset: 8336)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !190, file: !70, line: 229, baseType: !110, size: 8, offset: 8344)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !190, file: !70, line: 231, baseType: !152, size: 16, offset: 8352)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !190, file: !70, line: 232, baseType: !110, size: 8, offset: 8368)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !190, file: !70, line: 233, baseType: !110, size: 8, offset: 8376)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !190, file: !70, line: 234, baseType: !218, size: 32, offset: 8384)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !190, file: !70, line: 235, baseType: !218, size: 32, offset: 8416)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !190, file: !70, line: 237, baseType: !175, size: 128, offset: 8448)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !190, file: !70, line: 238, baseType: !175, size: 128, offset: 8576)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !190, file: !70, line: 239, baseType: !175, size: 128, offset: 8704)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !190, file: !70, line: 240, baseType: !175, size: 128, offset: 8832)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !190, file: !70, line: 242, baseType: !218, size: 32, offset: 8960)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !190, file: !70, line: 244, baseType: !152, size: 16, offset: 8992)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !190, file: !70, line: 245, baseType: !371, size: 16, offset: 9008)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !190, file: !70, line: 246, baseType: !326, size: 128, offset: 9024)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !190, file: !70, line: 248, baseType: !104, size: 32, offset: 9152)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !190, file: !70, line: 249, baseType: !104, size: 32, offset: 9184)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !190, file: !70, line: 251, baseType: !392, size: 64, offset: 9216)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !70, line: 251, flags: DIFlagFwdDecl)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !190, file: !70, line: 253, baseType: !110, size: 8, offset: 9280)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !190, file: !70, line: 254, baseType: !110, size: 8, offset: 9288)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !190, file: !70, line: 255, baseType: !152, size: 16, offset: 9296)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !190, file: !70, line: 256, baseType: !253, size: 96, offset: 9312)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !190, file: !70, line: 258, baseType: !175, size: 128, offset: 9408)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !190, file: !70, line: 259, baseType: !175, size: 128, offset: 9536)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !190, file: !70, line: 260, baseType: !175, size: 128, offset: 9664)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !190, file: !70, line: 261, baseType: !175, size: 128, offset: 9792)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !190, file: !70, line: 263, baseType: !403, size: 64, offset: 9920)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!404 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !70, line: 52, flags: DIFlagFwdDecl)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !190, file: !70, line: 264, baseType: !406, size: 64, offset: 9984)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!407 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !70, line: 53, flags: DIFlagFwdDecl)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !190, file: !70, line: 265, baseType: !409, size: 64, offset: 10048)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!410 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !411, line: 43, flags: DIFlagFwdDecl)
!411 = !DIFile(filename: "blender/source/blender/makesdna/DNA_freestyle_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!412 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !190, file: !70, line: 267, baseType: !110, size: 8, offset: 10112)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !190, file: !70, line: 268, baseType: !110, size: 8, offset: 10120)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !190, file: !70, line: 269, baseType: !152, size: 16, offset: 10128)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !190, file: !70, line: 270, baseType: !218, size: 32, offset: 10144)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !190, file: !70, line: 272, baseType: !417, size: 64, offset: 10176)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64)
!418 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !70, line: 54, flags: DIFlagFwdDecl)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !190, file: !70, line: 275, baseType: !420, size: 64, offset: 10240)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64)
!421 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !70, line: 275, flags: DIFlagFwdDecl)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !190, file: !70, line: 277, baseType: !423, size: 64, offset: 10304)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!424 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !28, line: 178, size: 13504, elements: !425)
!425 = !{!426, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !478, !481, !483, !484, !486, !487, !488, !489, !495, !500, !501, !505, !506, !507, !508, !509, !522, !534, !548, !552, !556, !560, !569, !581, !585, !589, !593, !597, !601, !602, !603, !604, !605, !606, !610, !611, !612, !613, !617, !618, !619, !620, !621, !626, !627, !628, !629, !630, !634, !635, !636, !637, !638, !645, !656, !661, !667, !677, !683, !694, !701, !708, !712, !717, !721, !726, !727, !728, !735, !741, !742, !743, !748, !749, !758, !867, !871, !879, !883, !887, !891, !899, !909}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "vertData", scope: !424, file: !28, line: 180, baseType: !427, size: 1600)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomData", file: !428, line: 73, baseType: !429)
!428 = !DIFile(filename: "blender/source/blender/makesdna/DNA_customdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!429 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomData", file: !428, line: 64, size: 1600, elements: !430)
!430 = !{!431, !446, !450, !451, !452, !453, !456}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !429, file: !428, line: 65, baseType: !432, size: 64)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataLayer", file: !428, line: 53, baseType: !434)
!434 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataLayer", file: !428, line: 42, size: 832, elements: !435)
!435 = !{!436, !437, !438, !439, !440, !441, !442, !443, !444, !445}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !434, file: !428, line: 43, baseType: !104, size: 32)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !434, file: !428, line: 44, baseType: !104, size: 32, offset: 32)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !434, file: !428, line: 45, baseType: !104, size: 32, offset: 64)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !434, file: !428, line: 46, baseType: !104, size: 32, offset: 96)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "active_rnd", scope: !434, file: !428, line: 47, baseType: !104, size: 32, offset: 128)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "active_clone", scope: !434, file: !428, line: 48, baseType: !104, size: 32, offset: 160)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "active_mask", scope: !434, file: !428, line: 49, baseType: !104, size: 32, offset: 192)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !434, file: !428, line: 50, baseType: !104, size: 32, offset: 224)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !434, file: !428, line: 51, baseType: !109, size: 512, offset: 256)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !434, file: !428, line: 52, baseType: !124, size: 64, offset: 768)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "typemap", scope: !429, file: !428, line: 66, baseType: !447, size: 1312, offset: 64)
!447 = !DICompositeType(tag: DW_TAG_array_type, baseType: !104, size: 1312, elements: !448)
!448 = !{!449}
!449 = !DISubrange(count: 41)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "totlayer", scope: !429, file: !428, line: 69, baseType: !104, size: 32, offset: 1376)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "maxlayer", scope: !429, file: !428, line: 69, baseType: !104, size: 32, offset: 1408)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "totsize", scope: !429, file: !428, line: 70, baseType: !104, size: 32, offset: 1440)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !429, file: !428, line: 71, baseType: !454, size: 64, offset: 1472)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64)
!455 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool", file: !428, line: 71, flags: DIFlagFwdDecl)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !429, file: !428, line: 72, baseType: !457, size: 64, offset: 1536)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataExternal", file: !428, line: 59, baseType: !459)
!459 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataExternal", file: !428, line: 57, size: 8192, elements: !460)
!460 = !{!461}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !459, file: !428, line: 58, baseType: !139, size: 8192)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "edgeData", scope: !424, file: !28, line: 180, baseType: !427, size: 1600, offset: 1600)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "faceData", scope: !424, file: !28, line: 180, baseType: !427, size: 1600, offset: 3200)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "loopData", scope: !424, file: !28, line: 180, baseType: !427, size: 1600, offset: 4800)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "polyData", scope: !424, file: !28, line: 180, baseType: !427, size: 1600, offset: 6400)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "numVertData", scope: !424, file: !28, line: 181, baseType: !104, size: 32, offset: 8000)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "numEdgeData", scope: !424, file: !28, line: 181, baseType: !104, size: 32, offset: 8032)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "numTessFaceData", scope: !424, file: !28, line: 181, baseType: !104, size: 32, offset: 8064)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "numLoopData", scope: !424, file: !28, line: 181, baseType: !104, size: 32, offset: 8096)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "numPolyData", scope: !424, file: !28, line: 181, baseType: !104, size: 32, offset: 8128)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "needsFree", scope: !424, file: !28, line: 182, baseType: !104, size: 32, offset: 8160)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "deformedOnly", scope: !424, file: !28, line: 183, baseType: !104, size: 32, offset: 8192)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "bvhCache", scope: !424, file: !28, line: 184, baseType: !474, size: 64, offset: 8256)
!474 = !DIDerivedType(tag: DW_TAG_typedef, name: "BVHCache", file: !475, line: 124, baseType: !476)
!475 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_bvhutils.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64)
!477 = !DICompositeType(tag: DW_TAG_structure_type, name: "LinkNode", file: !475, line: 124, flags: DIFlagFwdDecl)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "drawObject", scope: !424, file: !28, line: 185, baseType: !479, size: 64, offset: 8320)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64)
!480 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUDrawObject", file: !28, line: 97, flags: DIFlagFwdDecl)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !424, file: !28, line: 186, baseType: !482, size: 32, offset: 8384)
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "DerivedMeshType", file: !28, line: 132, baseType: !27)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "auto_bump_scale", scope: !424, file: !28, line: 187, baseType: !218, size: 32, offset: 8416)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "dirty", scope: !424, file: !28, line: 188, baseType: !485, size: 32, offset: 8448)
!485 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMDirtyFlag", file: !28, line: 175, baseType: !33)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "totmat", scope: !424, file: !28, line: 189, baseType: !104, size: 32, offset: 8480)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !424, file: !28, line: 190, baseType: !310, size: 64, offset: 8512)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "cd_flag", scope: !424, file: !28, line: 193, baseType: !110, size: 8, offset: 8576)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "calcNormals", scope: !424, file: !28, line: 196, baseType: !490, size: 64, offset: 8640)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64)
!491 = !DISubroutineType(types: !492)
!492 = !{null, !493}
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64)
!494 = !DIDerivedType(tag: DW_TAG_typedef, name: "DerivedMesh", file: !28, line: 177, baseType: !424)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "calcLoopNormals", scope: !424, file: !28, line: 199, baseType: !496, size: 64, offset: 8704)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64)
!497 = !DISubroutineType(types: !498)
!498 = !{null, !493, !499}
!499 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !218)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "recalcTessellation", scope: !424, file: !28, line: 202, baseType: !490, size: 64, offset: 8768)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "getNumVerts", scope: !424, file: !28, line: 207, baseType: !502, size: 64, offset: 8832)
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64)
!503 = !DISubroutineType(types: !504)
!504 = !{!104, !493}
!505 = !DIDerivedType(tag: DW_TAG_member, name: "getNumEdges", scope: !424, file: !28, line: 208, baseType: !502, size: 64, offset: 8896)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "getNumTessFaces", scope: !424, file: !28, line: 209, baseType: !502, size: 64, offset: 8960)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "getNumLoops", scope: !424, file: !28, line: 210, baseType: !502, size: 64, offset: 9024)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "getNumPolys", scope: !424, file: !28, line: 211, baseType: !502, size: 64, offset: 9088)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "getVert", scope: !424, file: !28, line: 218, baseType: !510, size: 64, offset: 9152)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 64)
!511 = !DISubroutineType(types: !512)
!512 = !{null, !493, !104, !513}
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64)
!514 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MVert", file: !515, line: 65, size: 160, elements: !516)
!515 = !DIFile(filename: "blender/source/blender/makesdna/DNA_meshdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!516 = !{!517, !518, !520, !521}
!517 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !514, file: !515, line: 66, baseType: !253, size: 96)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !514, file: !515, line: 67, baseType: !519, size: 48, offset: 96)
!519 = !DICompositeType(tag: DW_TAG_array_type, baseType: !152, size: 48, elements: !254)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !514, file: !515, line: 68, baseType: !110, size: 8, offset: 144)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "bweight", scope: !514, file: !515, line: 68, baseType: !110, size: 8, offset: 152)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "getEdge", scope: !424, file: !28, line: 219, baseType: !523, size: 64, offset: 9216)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 64)
!524 = !DISubroutineType(types: !525)
!525 = !{null, !493, !104, !526}
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64)
!527 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MEdge", file: !515, line: 48, size: 96, elements: !528)
!528 = !{!529, !530, !531, !532, !533}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !527, file: !515, line: 49, baseType: !7, size: 32)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !527, file: !515, line: 49, baseType: !7, size: 32, offset: 32)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "crease", scope: !527, file: !515, line: 50, baseType: !110, size: 8, offset: 64)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "bweight", scope: !527, file: !515, line: 50, baseType: !110, size: 8, offset: 72)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !527, file: !515, line: 51, baseType: !152, size: 16, offset: 80)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFace", scope: !424, file: !28, line: 220, baseType: !535, size: 64, offset: 9280)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64)
!536 = !DISubroutineType(types: !537)
!537 = !{null, !493, !104, !538}
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64)
!539 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MFace", file: !515, line: 42, size: 160, elements: !540)
!540 = !{!541, !542, !543, !544, !545, !546, !547}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !539, file: !515, line: 43, baseType: !7, size: 32)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !539, file: !515, line: 43, baseType: !7, size: 32, offset: 32)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !539, file: !515, line: 43, baseType: !7, size: 32, offset: 64)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !539, file: !515, line: 43, baseType: !7, size: 32, offset: 96)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !539, file: !515, line: 44, baseType: !152, size: 16, offset: 128)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "edcode", scope: !539, file: !515, line: 45, baseType: !110, size: 8, offset: 144)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !539, file: !515, line: 45, baseType: !110, size: 8, offset: 152)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "getVertArray", scope: !424, file: !28, line: 227, baseType: !549, size: 64, offset: 9344)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64)
!550 = !DISubroutineType(types: !551)
!551 = !{!513, !493}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeArray", scope: !424, file: !28, line: 228, baseType: !553, size: 64, offset: 9408)
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64)
!554 = !DISubroutineType(types: !555)
!555 = !{!526, !493}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceArray", scope: !424, file: !28, line: 229, baseType: !557, size: 64, offset: 9472)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64)
!558 = !DISubroutineType(types: !559)
!559 = !{!538, !493}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopArray", scope: !424, file: !28, line: 230, baseType: !561, size: 64, offset: 9536)
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64)
!562 = !DISubroutineType(types: !563)
!563 = !{!564, !493}
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64)
!565 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MLoop", file: !515, line: 88, size: 64, elements: !566)
!566 = !{!567, !568}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !565, file: !515, line: 89, baseType: !7, size: 32)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !565, file: !515, line: 90, baseType: !7, size: 32, offset: 32)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyArray", scope: !424, file: !28, line: 231, baseType: !570, size: 64, offset: 9600)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64)
!571 = !DISubroutineType(types: !572)
!572 = !{!573, !493}
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64)
!574 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MPoly", file: !515, line: 79, size: 96, elements: !575)
!575 = !{!576, !577, !578, !579, !580}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "loopstart", scope: !574, file: !515, line: 81, baseType: !104, size: 32)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !574, file: !515, line: 82, baseType: !104, size: 32, offset: 32)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !574, file: !515, line: 83, baseType: !152, size: 16, offset: 64)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !574, file: !515, line: 84, baseType: !110, size: 8, offset: 80)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !574, file: !515, line: 84, baseType: !110, size: 8, offset: 88)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "copyVertArray", scope: !424, file: !28, line: 236, baseType: !582, size: 64, offset: 9664)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!583 = !DISubroutineType(types: !584)
!584 = !{null, !493, !513}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "copyEdgeArray", scope: !424, file: !28, line: 237, baseType: !586, size: 64, offset: 9728)
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64)
!587 = !DISubroutineType(types: !588)
!588 = !{null, !493, !526}
!589 = !DIDerivedType(tag: DW_TAG_member, name: "copyTessFaceArray", scope: !424, file: !28, line: 238, baseType: !590, size: 64, offset: 9792)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64)
!591 = !DISubroutineType(types: !592)
!592 = !{null, !493, !538}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "copyLoopArray", scope: !424, file: !28, line: 239, baseType: !594, size: 64, offset: 9856)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 64)
!595 = !DISubroutineType(types: !596)
!596 = !{null, !493, !564}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "copyPolyArray", scope: !424, file: !28, line: 240, baseType: !598, size: 64, offset: 9920)
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !599, size: 64)
!599 = !DISubroutineType(types: !600)
!600 = !{null, !493, !573}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "dupVertArray", scope: !424, file: !28, line: 245, baseType: !549, size: 64, offset: 9984)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "dupEdgeArray", scope: !424, file: !28, line: 246, baseType: !553, size: 64, offset: 10048)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "dupTessFaceArray", scope: !424, file: !28, line: 247, baseType: !557, size: 64, offset: 10112)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "dupLoopArray", scope: !424, file: !28, line: 248, baseType: !561, size: 64, offset: 10176)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "dupPolyArray", scope: !424, file: !28, line: 249, baseType: !570, size: 64, offset: 10240)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "getVertData", scope: !424, file: !28, line: 255, baseType: !607, size: 64, offset: 10304)
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64)
!608 = !DISubroutineType(types: !609)
!609 = !{!124, !493, !104, !104}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeData", scope: !424, file: !28, line: 256, baseType: !607, size: 64, offset: 10368)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceData", scope: !424, file: !28, line: 257, baseType: !607, size: 64, offset: 10432)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyData", scope: !424, file: !28, line: 258, baseType: !607, size: 64, offset: 10496)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "getVertDataArray", scope: !424, file: !28, line: 264, baseType: !614, size: 64, offset: 10560)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!615 = !DISubroutineType(types: !616)
!616 = !{!124, !493, !104}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeDataArray", scope: !424, file: !28, line: 265, baseType: !614, size: 64, offset: 10624)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceDataArray", scope: !424, file: !28, line: 266, baseType: !614, size: 64, offset: 10688)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopDataArray", scope: !424, file: !28, line: 267, baseType: !614, size: 64, offset: 10752)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyDataArray", scope: !424, file: !28, line: 268, baseType: !614, size: 64, offset: 10816)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "getVertDataLayout", scope: !424, file: !28, line: 272, baseType: !622, size: 64, offset: 10880)
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 64)
!623 = !DISubroutineType(types: !624)
!624 = !{!625, !493}
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeDataLayout", scope: !424, file: !28, line: 273, baseType: !622, size: 64, offset: 10944)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceDataLayout", scope: !424, file: !28, line: 274, baseType: !622, size: 64, offset: 11008)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopDataLayout", scope: !424, file: !28, line: 275, baseType: !622, size: 64, offset: 11072)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyDataLayout", scope: !424, file: !28, line: 276, baseType: !622, size: 64, offset: 11136)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromVertCData", scope: !424, file: !28, line: 279, baseType: !631, size: 64, offset: 11200)
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64)
!632 = !DISubroutineType(types: !633)
!633 = !{null, !493, !104, !625, !104}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromEdgeCData", scope: !424, file: !28, line: 280, baseType: !631, size: 64, offset: 11264)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromFaceCData", scope: !424, file: !28, line: 281, baseType: !631, size: 64, offset: 11328)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "getNumGrids", scope: !424, file: !28, line: 284, baseType: !502, size: 64, offset: 11392)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "getGridSize", scope: !424, file: !28, line: 285, baseType: !502, size: 64, offset: 11456)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "getGridData", scope: !424, file: !28, line: 286, baseType: !639, size: 64, offset: 11520)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64)
!640 = !DISubroutineType(types: !641)
!641 = !{!642, !493}
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 64)
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 64)
!644 = !DICompositeType(tag: DW_TAG_structure_type, name: "CCGElem", file: !28, line: 82, flags: DIFlagFwdDecl)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "getGridAdjacency", scope: !424, file: !28, line: 287, baseType: !646, size: 64, offset: 11584)
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64)
!647 = !DISubroutineType(types: !648)
!648 = !{!649, !493}
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 64)
!650 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMGridAdjacency", file: !28, line: 120, baseType: !651)
!651 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DMGridAdjacency", file: !28, line: 117, size: 256, elements: !652)
!652 = !{!653, !655}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !651, file: !28, line: 118, baseType: !654, size: 128)
!654 = !DICompositeType(tag: DW_TAG_array_type, baseType: !104, size: 128, elements: !327)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "rotation", scope: !651, file: !28, line: 119, baseType: !654, size: 128, offset: 128)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "getGridOffset", scope: !424, file: !28, line: 288, baseType: !657, size: 64, offset: 11648)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64)
!658 = !DISubroutineType(types: !659)
!659 = !{!660, !493}
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "getGridKey", scope: !424, file: !28, line: 289, baseType: !662, size: 64, offset: 11712)
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !663, size: 64)
!663 = !DISubroutineType(types: !664)
!664 = !{null, !493, !665}
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 64)
!666 = !DICompositeType(tag: DW_TAG_structure_type, name: "CCGKey", file: !28, line: 83, flags: DIFlagFwdDecl)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "getGridFlagMats", scope: !424, file: !28, line: 290, baseType: !668, size: 64, offset: 11776)
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 64)
!669 = !DISubroutineType(types: !670)
!670 = !{!671, !493}
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 64)
!672 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMFlagMat", file: !28, line: 126, baseType: !673)
!673 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DMFlagMat", file: !28, line: 123, size: 32, elements: !674)
!674 = !{!675, !676}
!675 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !673, file: !28, line: 124, baseType: !152, size: 16)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !673, file: !28, line: 125, baseType: !110, size: 8, offset: 16)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "getGridHidden", scope: !424, file: !28, line: 291, baseType: !678, size: 64, offset: 11840)
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 64)
!679 = !DISubroutineType(types: !680)
!680 = !{!681, !493}
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedVert", scope: !424, file: !28, line: 299, baseType: !684, size: 64, offset: 11904)
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 64)
!685 = !DISubroutineType(types: !686)
!686 = !{null, !493, !687, !124, !693}
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 64)
!688 = !DISubroutineType(types: !689)
!689 = !{null, !124, !104, !690, !690, !691}
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 64)
!692 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !152)
!693 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMForeachFlag", file: !28, line: 162, baseType: !38)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedEdge", scope: !424, file: !28, line: 309, baseType: !695, size: 64, offset: 11968)
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 64)
!696 = !DISubroutineType(types: !697)
!697 = !{null, !493, !698, !124}
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 64)
!699 = !DISubroutineType(types: !700)
!700 = !{null, !124, !104, !690, !690}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedLoop", scope: !424, file: !28, line: 317, baseType: !702, size: 64, offset: 12032)
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !703, size: 64)
!703 = !DISubroutineType(types: !704)
!704 = !{null, !493, !705, !124, !693}
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 64)
!706 = !DISubroutineType(types: !707)
!707 = !{null, !124, !104, !104, !690, !690}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedFaceCenter", scope: !424, file: !28, line: 327, baseType: !709, size: 64, offset: 12096)
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 64)
!710 = !DISubroutineType(types: !711)
!711 = !{null, !493, !698, !124, !693}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "getMinMax", scope: !424, file: !28, line: 337, baseType: !713, size: 64, offset: 12160)
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !714, size: 64)
!714 = !DISubroutineType(types: !715)
!715 = !{null, !493, !716, !716}
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "getVertCo", scope: !424, file: !28, line: 344, baseType: !718, size: 64, offset: 12224)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 64)
!719 = !DISubroutineType(types: !720)
!720 = !{null, !493, !104, !716}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "getVertCos", scope: !424, file: !28, line: 347, baseType: !722, size: 64, offset: 12288)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 64)
!723 = !DISubroutineType(types: !724)
!724 = !{null, !493, !725}
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "getVertNo", scope: !424, file: !28, line: 350, baseType: !718, size: 64, offset: 12352)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyNo", scope: !424, file: !28, line: 351, baseType: !718, size: 64, offset: 12416)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyMap", scope: !424, file: !28, line: 355, baseType: !729, size: 64, offset: 12480)
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64)
!730 = !DISubroutineType(types: !731)
!731 = !{!732, !189, !493}
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 64)
!733 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !734)
!734 = !DICompositeType(tag: DW_TAG_structure_type, name: "MeshElemMap", file: !28, line: 355, flags: DIFlagFwdDecl)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "getPBVH", scope: !424, file: !28, line: 359, baseType: !736, size: 64, offset: 12544)
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !737, size: 64)
!737 = !DISubroutineType(types: !738)
!738 = !{!739, !189, !493}
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 64)
!740 = !DICompositeType(tag: DW_TAG_structure_type, name: "PBVH", file: !28, line: 100, flags: DIFlagFwdDecl)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "drawVerts", scope: !424, file: !28, line: 364, baseType: !490, size: 64, offset: 12608)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "drawUVEdges", scope: !424, file: !28, line: 367, baseType: !490, size: 64, offset: 12672)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "drawEdges", scope: !424, file: !28, line: 373, baseType: !744, size: 64, offset: 12736)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 64)
!745 = !DISubroutineType(types: !746)
!746 = !{null, !493, !747, !747}
!747 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "drawLooseEdges", scope: !424, file: !28, line: 376, baseType: !490, size: 64, offset: 12800)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "drawFacesSolid", scope: !424, file: !28, line: 385, baseType: !750, size: 64, offset: 12864)
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !751, size: 64)
!751 = !DISubroutineType(types: !752)
!752 = !{null, !493, !753, !747, !754}
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64)
!754 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSetMaterial", file: !28, line: 146, baseType: !755)
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 64)
!756 = !DISubroutineType(types: !757)
!757 = !{!104, !104, !124}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "drawFacesTex", scope: !424, file: !28, line: 391, baseType: !759, size: 64, offset: 12928)
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !760, size: 64)
!760 = !DISubroutineType(types: !761)
!761 = !{null, !493, !762, !862, !124, !866}
!762 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSetDrawOptionsTex", file: !28, line: 150, baseType: !763)
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 64)
!764 = !DISubroutineType(types: !765)
!765 = !{!766, !767, !861, !104}
!766 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMDrawOption", file: !28, line: 143, baseType: !42)
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 64)
!768 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTFace", file: !515, line: 160, size: 384, elements: !769)
!769 = !{!770, !774, !856, !857, !858, !859, !860}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !768, file: !515, line: 161, baseType: !771, size: 256)
!771 = !DICompositeType(tag: DW_TAG_array_type, baseType: !218, size: 256, elements: !772)
!772 = !{!328, !773}
!773 = !DISubrange(count: 2)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "tpage", scope: !768, file: !515, line: 162, baseType: !775, size: 64, offset: 256)
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64)
!776 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !777, line: 77, size: 15424, elements: !778)
!777 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!778 = !{!779, !780, !781, !784, !787, !790, !793, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !845, !846, !850}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !776, file: !777, line: 78, baseType: !119, size: 960)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !776, file: !777, line: 80, baseType: !139, size: 8192, offset: 960)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !776, file: !777, line: 82, baseType: !782, size: 64, offset: 9152)
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !783, size: 64)
!783 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !777, line: 43, flags: DIFlagFwdDecl)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !776, file: !777, line: 83, baseType: !785, size: 64, offset: 9216)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 64)
!786 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !120, line: 46, flags: DIFlagFwdDecl)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !776, file: !777, line: 86, baseType: !788, size: 64, offset: 9280)
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !789, size: 64)
!789 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !777, line: 41, flags: DIFlagFwdDecl)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !776, file: !777, line: 87, baseType: !791, size: 64, offset: 9344)
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 64)
!792 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !777, line: 44, flags: DIFlagFwdDecl)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !776, file: !777, line: 89, baseType: !794, size: 512, offset: 9408)
!794 = !DICompositeType(tag: DW_TAG_array_type, baseType: !791, size: 512, elements: !795)
!795 = !{!220}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !776, file: !777, line: 90, baseType: !152, size: 16, offset: 9920)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !776, file: !777, line: 90, baseType: !152, size: 16, offset: 9936)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !776, file: !777, line: 92, baseType: !152, size: 16, offset: 9952)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !776, file: !777, line: 92, baseType: !152, size: 16, offset: 9968)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !776, file: !777, line: 93, baseType: !152, size: 16, offset: 9984)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !776, file: !777, line: 93, baseType: !152, size: 16, offset: 10000)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !776, file: !777, line: 94, baseType: !104, size: 32, offset: 10016)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !776, file: !777, line: 97, baseType: !152, size: 16, offset: 10048)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !776, file: !777, line: 97, baseType: !152, size: 16, offset: 10064)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !776, file: !777, line: 98, baseType: !152, size: 16, offset: 10080)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !776, file: !777, line: 98, baseType: !152, size: 16, offset: 10096)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !776, file: !777, line: 99, baseType: !152, size: 16, offset: 10112)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !776, file: !777, line: 99, baseType: !152, size: 16, offset: 10128)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !776, file: !777, line: 100, baseType: !7, size: 32, offset: 10144)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !776, file: !777, line: 101, baseType: !682, size: 64, offset: 10176)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !776, file: !777, line: 103, baseType: !145, size: 64, offset: 10240)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !776, file: !777, line: 104, baseType: !813, size: 64, offset: 10304)
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 64)
!814 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !120, line: 159, size: 448, elements: !815)
!815 = !{!816, !819, !820, !822, !823, !825}
!816 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !814, file: !120, line: 161, baseType: !817, size: 64)
!817 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !818)
!818 = !{!773}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !814, file: !120, line: 162, baseType: !817, size: 64, offset: 64)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !814, file: !120, line: 163, baseType: !821, size: 32, offset: 128)
!821 = !DICompositeType(tag: DW_TAG_array_type, baseType: !152, size: 32, elements: !818)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !814, file: !120, line: 164, baseType: !821, size: 32, offset: 160)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !814, file: !120, line: 165, baseType: !824, size: 128, offset: 192)
!824 = !DICompositeType(tag: DW_TAG_array_type, baseType: !682, size: 128, elements: !818)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !814, file: !120, line: 166, baseType: !826, size: 128, offset: 320)
!826 = !DICompositeType(tag: DW_TAG_array_type, baseType: !785, size: 128, elements: !818)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !776, file: !777, line: 107, baseType: !218, size: 32, offset: 10368)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !776, file: !777, line: 108, baseType: !104, size: 32, offset: 10400)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !776, file: !777, line: 109, baseType: !152, size: 16, offset: 10432)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !776, file: !777, line: 110, baseType: !152, size: 16, offset: 10448)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !776, file: !777, line: 113, baseType: !104, size: 32, offset: 10464)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !776, file: !777, line: 113, baseType: !104, size: 32, offset: 10496)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !776, file: !777, line: 114, baseType: !110, size: 8, offset: 10528)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !776, file: !777, line: 114, baseType: !110, size: 8, offset: 10536)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !776, file: !777, line: 115, baseType: !152, size: 16, offset: 10544)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !776, file: !777, line: 116, baseType: !326, size: 128, offset: 10560)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !776, file: !777, line: 119, baseType: !218, size: 32, offset: 10688)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !776, file: !777, line: 119, baseType: !218, size: 32, offset: 10720)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !776, file: !777, line: 122, baseType: !840, size: 512, offset: 10752)
!840 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !841, line: 182, baseType: !842)
!841 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!842 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !841, line: 180, size: 512, elements: !843)
!843 = !{!844}
!844 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !842, file: !841, line: 181, baseType: !109, size: 512)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !776, file: !777, line: 123, baseType: !110, size: 8, offset: 11264)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !776, file: !777, line: 125, baseType: !847, size: 56, offset: 11272)
!847 = !DICompositeType(tag: DW_TAG_array_type, baseType: !110, size: 56, elements: !848)
!848 = !{!849}
!849 = !DISubrange(count: 7)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !776, file: !777, line: 126, baseType: !851, size: 4096, offset: 11328)
!851 = !DICompositeType(tag: DW_TAG_array_type, baseType: !852, size: 4096, elements: !795)
!852 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !777, line: 69, baseType: !853)
!853 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !777, line: 67, size: 512, elements: !854)
!854 = !{!855}
!855 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !853, file: !777, line: 68, baseType: !109, size: 512)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !768, file: !515, line: 163, baseType: !110, size: 8, offset: 320)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "transp", scope: !768, file: !515, line: 163, baseType: !110, size: 8, offset: 328)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !768, file: !515, line: 164, baseType: !152, size: 16, offset: 336)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "tile", scope: !768, file: !515, line: 164, baseType: !152, size: 16, offset: 352)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "unwrap", scope: !768, file: !515, line: 164, baseType: !152, size: 16, offset: 368)
!861 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !747)
!862 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMCompareDrawOptions", file: !28, line: 147, baseType: !863)
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !864, size: 64)
!864 = !DISubroutineType(types: !865)
!865 = !{!104, !124, !104, !104}
!866 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMDrawFlag", file: !28, line: 157, baseType: !48)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "drawFacesGLSL", scope: !424, file: !28, line: 400, baseType: !868, size: 64, offset: 12992)
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 64)
!869 = !DISubroutineType(types: !870)
!870 = !{null, !493, !754}
!871 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedFaces", scope: !424, file: !28, line: 415, baseType: !872, size: 64, offset: 13056)
!872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !873, size: 64)
!873 = !DISubroutineType(types: !874)
!874 = !{null, !493, !875, !754, !862, !124, !866}
!875 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSetDrawOptions", file: !28, line: 149, baseType: !876)
!876 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !877, size: 64)
!877 = !DISubroutineType(types: !878)
!878 = !{!766, !124, !104}
!879 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedFacesTex", scope: !424, file: !28, line: 425, baseType: !880, size: 64, offset: 13120)
!880 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !881, size: 64)
!881 = !DISubroutineType(types: !882)
!882 = !{null, !493, !875, !862, !124, !866}
!883 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedFacesGLSL", scope: !424, file: !28, line: 435, baseType: !884, size: 64, offset: 13184)
!884 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !885, size: 64)
!885 = !DISubroutineType(types: !886)
!886 = !{null, !493, !754, !875, !124}
!887 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedEdges", scope: !424, file: !28, line: 444, baseType: !888, size: 64, offset: 13248)
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 64)
!889 = !DISubroutineType(types: !890)
!890 = !{null, !493, !875, !124}
!891 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedEdgesInterp", scope: !424, file: !28, line: 455, baseType: !892, size: 64, offset: 13312)
!892 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !893, size: 64)
!893 = !DISubroutineType(types: !894)
!894 = !{null, !493, !875, !895, !124}
!895 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSetDrawInterpOptions", file: !28, line: 148, baseType: !896)
!896 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !897, size: 64)
!897 = !DISubroutineType(types: !898)
!898 = !{null, !124, !104, !218}
!899 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedFacesMat", scope: !424, file: !28, line: 464, baseType: !900, size: 64, offset: 13376)
!900 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !901, size: 64)
!901 = !DISubroutineType(types: !902)
!902 = !{null, !493, !903, !906, !124}
!903 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !904, size: 64)
!904 = !DISubroutineType(types: !905)
!905 = !{null, !124, !104, !124}
!906 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !907, size: 64)
!907 = !DISubroutineType(types: !908)
!908 = !{!747, !124, !104}
!909 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !424, file: !28, line: 470, baseType: !490, size: 64, offset: 13440)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !190, file: !70, line: 277, baseType: !423, size: 64, offset: 10368)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !190, file: !70, line: 278, baseType: !912, size: 64, offset: 10432)
!912 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !913, line: 27, baseType: !914)
!913 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!914 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !915, line: 45, baseType: !916)
!915 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!916 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_mask", scope: !190, file: !70, line: 279, baseType: !912, size: 64, offset: 10496)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !190, file: !70, line: 280, baseType: !7, size: 32, offset: 10560)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !190, file: !70, line: 281, baseType: !7, size: 32, offset: 10592)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "gpulamp", scope: !190, file: !70, line: 283, baseType: !175, size: 128, offset: 10624)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "pc_ids", scope: !190, file: !70, line: 284, baseType: !175, size: 128, offset: 10752)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "duplilist", scope: !190, file: !70, line: 285, baseType: !923, size: 64, offset: 10880)
!923 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_object", scope: !190, file: !70, line: 287, baseType: !925, size: 64, offset: 10944)
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64)
!926 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyOb", file: !70, line: 59, flags: DIFlagFwdDecl)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_constraint", scope: !190, file: !70, line: 288, baseType: !928, size: 64, offset: 11008)
!928 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 64)
!929 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyCon", file: !70, line: 288, flags: DIFlagFwdDecl)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "ima_ofs", scope: !190, file: !70, line: 290, baseType: !931, size: 64, offset: 11072)
!931 = !DICompositeType(tag: DW_TAG_array_type, baseType: !218, size: 64, elements: !818)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !190, file: !70, line: 291, baseType: !933, size: 64, offset: 11136)
!933 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !934, size: 64)
!934 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageUser", file: !777, line: 65, baseType: !935)
!935 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !777, line: 50, size: 320, elements: !936)
!936 = !{!937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950}
!937 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !935, file: !777, line: 51, baseType: !114, size: 64)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !935, file: !777, line: 53, baseType: !104, size: 32, offset: 64)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !935, file: !777, line: 54, baseType: !104, size: 32, offset: 96)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !935, file: !777, line: 55, baseType: !104, size: 32, offset: 128)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !935, file: !777, line: 55, baseType: !104, size: 32, offset: 160)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !935, file: !777, line: 56, baseType: !110, size: 8, offset: 192)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "cycl", scope: !935, file: !777, line: 56, baseType: !110, size: 8, offset: 200)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !935, file: !777, line: 57, baseType: !110, size: 8, offset: 208)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !935, file: !777, line: 57, baseType: !110, size: 8, offset: 216)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "multi_index", scope: !935, file: !777, line: 59, baseType: !152, size: 16, offset: 224)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !935, file: !777, line: 59, baseType: !152, size: 16, offset: 240)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !935, file: !777, line: 59, baseType: !152, size: 16, offset: 256)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !935, file: !777, line: 61, baseType: !152, size: 16, offset: 272)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !935, file: !777, line: 63, baseType: !104, size: 32, offset: 288)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "lodlevels", scope: !190, file: !70, line: 293, baseType: !175, size: 128, offset: 11200)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "currentlod", scope: !190, file: !70, line: 294, baseType: !953, size: 64, offset: 11328)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64)
!954 = !DIDerivedType(tag: DW_TAG_typedef, name: "LodLevel", file: !70, line: 113, baseType: !955)
!955 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LodLevel", file: !70, line: 108, size: 256, elements: !956)
!956 = !{!957, !959, !960, !961, !962}
!957 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !955, file: !70, line: 109, baseType: !958, size: 64)
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 64)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !955, file: !70, line: 109, baseType: !958, size: 64, offset: 64)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !955, file: !70, line: 110, baseType: !189, size: 64, offset: 128)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !955, file: !70, line: 111, baseType: !104, size: 32, offset: 192)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "distance", scope: !955, file: !70, line: 112, baseType: !218, size: 32, offset: 224)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !115, file: !116, line: 1221, baseType: !964, size: 64, offset: 1088)
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !965, size: 64)
!965 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !116, line: 52, flags: DIFlagFwdDecl)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !115, file: !116, line: 1223, baseType: !114, size: 64, offset: 1152)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !115, file: !116, line: 1225, baseType: !175, size: 128, offset: 1216)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !115, file: !116, line: 1226, baseType: !969, size: 64, offset: 1344)
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 64)
!970 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !116, line: 69, size: 320, elements: !971)
!971 = !{!972, !973, !974, !975, !976, !977, !978, !979}
!972 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !970, file: !116, line: 70, baseType: !969, size: 64)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !970, file: !116, line: 70, baseType: !969, size: 64, offset: 64)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !970, file: !116, line: 71, baseType: !7, size: 32, offset: 128)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !970, file: !116, line: 71, baseType: !7, size: 32, offset: 160)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !970, file: !116, line: 72, baseType: !104, size: 32, offset: 192)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !970, file: !116, line: 73, baseType: !152, size: 16, offset: 224)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !970, file: !116, line: 73, baseType: !152, size: 16, offset: 240)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !970, file: !116, line: 74, baseType: !189, size: 64, offset: 256)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !115, file: !116, line: 1227, baseType: !189, size: 64, offset: 1408)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !115, file: !116, line: 1229, baseType: !253, size: 96, offset: 1472)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !115, file: !116, line: 1230, baseType: !253, size: 96, offset: 1568)
