; ModuleID = 'blender/source/blender/editors/space_text/space_text.c'
source_filename = "blender/source/blender/editors/space_text/space_text.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.UserDef = type { i32, i32, i32, i32, i32, [768 x i8], [768 x i8], [1024 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [1024 x i8], [1024 x i8], i32, i16, i16, i16, i16, i16, i16, i32, i32, i32, i16, i16, i32, i32, i32, i32, i32, i32, i32, i16, i16, i16, i16, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, [64 x i8], i16, i16, i16, i16, i16, i16, i16, i16, [3 x %struct.SolidLight], i16, i16, i16, i16, i16, i16, i16, i16, i32, i32, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i8, i8, i8, i8, i16, i16, i16, i16, i16, i16, float, float, i32, i16, i16, float, i16, i16, i16, i16, %struct.ColorBand, [3 x float], [4 x float], i16, i8, i8, [80 x i8], [1024 x i8], i32, i32, float, float, i32, i16, i16, i16, i16, i16, i16, %struct.WalkNavigation }
%struct.ListBase = type { i8*, i8* }
%struct.SolidLight = type { i32, i32, [4 x float], [4 x float], [4 x float] }
%struct.ColorBand = type { i16, i16, i8, i8, i8, [1 x i8], [32 x %struct.CBData] }
%struct.CBData = type { float, float, float, float, float, i32 }
%struct.WalkNavigation = type { float, float, float, float, float, float, i16, [3 x i16] }

!1330 = !DIEnumerator(name: "TH_NLA_TWEAK_DUPLI", value: 168, isUnsigned: true)
!1331 = !DIEnumerator(name: "TH_NLA_TRANSITION", value: 169, isUnsigned: true)
!1332 = !DIEnumerator(name: "TH_NLA_TRANSITION_SEL", value: 170, isUnsigned: true)
!1333 = !DIEnumerator(name: "TH_NLA_META", value: 171, isUnsigned: true)
!1334 = !DIEnumerator(name: "TH_NLA_META_SEL", value: 172, isUnsigned: true)
!1335 = !DIEnumerator(name: "TH_NLA_SOUND", value: 173, isUnsigned: true)
!1336 = !DIEnumerator(name: "TH_NLA_SOUND_SEL", value: 174, isUnsigned: true)
!1337 = !DIEnumerator(name: "TH_EMBOSS", value: 175, isUnsigned: true)
!1338 = !DIEnumerator(name: "TH_AXIS_X", value: 176, isUnsigned: true)
!1339 = !DIEnumerator(name: "TH_AXIS_Y", value: 177, isUnsigned: true)
!1340 = !DIEnumerator(name: "TH_AXIS_Z", value: 178, isUnsigned: true)
!1341 = !DIEnumerator(name: "TH_LOW_GRAD", value: 179, isUnsigned: true)
!1342 = !DIEnumerator(name: "TH_HIGH_GRAD", value: 180, isUnsigned: true)
!1343 = !DIEnumerator(name: "TH_SHOW_BACK_GRAD", value: 181, isUnsigned: true)
!1344 = !DIEnumerator(name: "TH_INFO_SELECTED", value: 182, isUnsigned: true)
!1345 = !DIEnumerator(name: "TH_INFO_SELECTED_TEXT", value: 183, isUnsigned: true)
!1346 = !DIEnumerator(name: "TH_INFO_ERROR", value: 184, isUnsigned: true)
!1347 = !DIEnumerator(name: "TH_INFO_ERROR_TEXT", value: 185, isUnsigned: true)
!1348 = !DIEnumerator(name: "TH_INFO_WARNING", value: 186, isUnsigned: true)
!1349 = !DIEnumerator(name: "TH_INFO_WARNING_TEXT", value: 187, isUnsigned: true)
!1350 = !DIEnumerator(name: "TH_INFO_INFO", value: 188, isUnsigned: true)
!1351 = !DIEnumerator(name: "TH_INFO_INFO_TEXT", value: 189, isUnsigned: true)
!1352 = !DIEnumerator(name: "TH_INFO_DEBUG", value: 190, isUnsigned: true)
!1353 = !DIEnumerator(name: "TH_INFO_DEBUG_TEXT", value: 191, isUnsigned: true)
!1354 = !DIEnumerator(name: "TH_VIEW_OVERLAY", value: 192, isUnsigned: true)
!1355 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1356, line: 82, baseType: !7, size: 32, elements: !1357)
!1356 = !DIFile(filename: "blender/source/blender/windowmanager/wm_cursors.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1357 = !{!1358, !1359, !1360, !1361, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1375}
!1358 = !DIEnumerator(name: "BC_NW_ARROWCURSOR", value: 2, isUnsigned: true)
!1359 = !DIEnumerator(name: "BC_NS_ARROWCURSOR", value: 3, isUnsigned: true)
!1360 = !DIEnumerator(name: "BC_EW_ARROWCURSOR", value: 4, isUnsigned: true)
!1361 = !DIEnumerator(name: "BC_WAITCURSOR", value: 5, isUnsigned: true)
!1362 = !DIEnumerator(name: "BC_CROSSCURSOR", value: 6, isUnsigned: true)
!1363 = !DIEnumerator(name: "BC_EDITCROSSCURSOR", value: 7, isUnsigned: true)
!1364 = !DIEnumerator(name: "BC_BOXSELCURSOR", value: 8, isUnsigned: true)
!1365 = !DIEnumerator(name: "BC_KNIFECURSOR", value: 9, isUnsigned: true)
!1366 = !DIEnumerator(name: "BC_VLOOPCURSOR", value: 10, isUnsigned: true)
!1367 = !DIEnumerator(name: "BC_TEXTEDITCURSOR", value: 11, isUnsigned: true)
!1368 = !DIEnumerator(name: "BC_PAINTBRUSHCURSOR", value: 12, isUnsigned: true)
!1369 = !DIEnumerator(name: "BC_HANDCURSOR", value: 13, isUnsigned: true)
!1370 = !DIEnumerator(name: "BC_NSEW_SCROLLCURSOR", value: 14, isUnsigned: true)
!1371 = !DIEnumerator(name: "BC_NS_SCROLLCURSOR", value: 15, isUnsigned: true)
!1372 = !DIEnumerator(name: "BC_EW_SCROLLCURSOR", value: 16, isUnsigned: true)
!1373 = !DIEnumerator(name: "BC_EYEDROPPER_CURSOR", value: 17, isUnsigned: true)
!1374 = !DIEnumerator(name: "BC_SWAPAREA_CURSOR", value: 18, isUnsigned: true)
!1375 = !DIEnumerator(name: "BC_NUMCURSORS", value: 19, isUnsigned: true)
!1376 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1356, line: 43, baseType: !7, size: 32, elements: !1377)
!1377 = !{!1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387}
!1378 = !DIEnumerator(name: "CURSOR_FACESEL", value: 1000, isUnsigned: true)
!1379 = !DIEnumerator(name: "CURSOR_WAIT", value: 1001, isUnsigned: true)
!1380 = !DIEnumerator(name: "CURSOR_EDIT", value: 1002, isUnsigned: true)
!1381 = !DIEnumerator(name: "CURSOR_X_MOVE", value: 1003, isUnsigned: true)
!1382 = !DIEnumerator(name: "CURSOR_Y_MOVE", value: 1004, isUnsigned: true)
!1383 = !DIEnumerator(name: "CURSOR_HELP", value: 1005, isUnsigned: true)
!1384 = !DIEnumerator(name: "CURSOR_STD", value: 1006, isUnsigned: true)
!1385 = !DIEnumerator(name: "CURSOR_NONE", value: 1007, isUnsigned: true)
!1386 = !DIEnumerator(name: "CURSOR_PENCIL", value: 1008, isUnsigned: true)
!1387 = !DIEnumerator(name: "CURSOR_COPY", value: 1009, isUnsigned: true)
!1388 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eSpaceText_Flags", file: !6, line: 860, baseType: !7, size: 32, elements: !1389)
!1389 = !{!1390, !1391, !1392, !1393, !1394, !1395, !1396}
!1390 = !DIEnumerator(name: "ST_SCROLL_SELECT", value: 1, isUnsigned: true)
!1391 = !DIEnumerator(name: "ST_CLEAR_NAMESPACE", value: 16, isUnsigned: true)
!1392 = !DIEnumerator(name: "ST_FIND_WRAP", value: 32, isUnsigned: true)
!1393 = !DIEnumerator(name: "ST_FIND_ALL", value: 64, isUnsigned: true)
!1394 = !DIEnumerator(name: "ST_SHOW_MARGIN", value: 128, isUnsigned: true)
!1395 = !DIEnumerator(name: "ST_MATCH_CASE", value: 256, isUnsigned: true)
!1396 = !DIEnumerator(name: "ST_FIND_ACTIVATE", value: 512, isUnsigned: true)
!1397 = !{!1398, !1421, !1411}
!1398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1399, size: 64)
!1399 = !DIDerivedType(tag: DW_TAG_typedef, name: "SpaceLink", file: !6, line: 91, baseType: !1400)
!1400 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceLink", file: !6, line: 85, size: 448, elements: !1401)
!1401 = !{!1402, !1404, !1405, !1413, !1414, !1416}
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1400, file: !6, line: 86, baseType: !1403, size: 64)
!1403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1400, size: 64)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1400, file: !6, line: 86, baseType: !1403, size: 64, offset: 64)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !1400, file: !6, line: 87, baseType: !1406, size: 128, offset: 128)
!1406 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !1407, line: 71, baseType: !1408)
!1407 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1408 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !1407, line: 69, size: 128, elements: !1409)
!1409 = !{!1410, !1412}
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !1408, file: !1407, line: 70, baseType: !1411, size: 64)
!1411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !1408, file: !1407, line: 70, baseType: !1411, size: 64, offset: 64)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "spacetype", scope: !1400, file: !6, line: 88, baseType: !245, size: 32, offset: 256)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "blockscale", scope: !1400, file: !6, line: 89, baseType: !1415, size: 32, offset: 288)
!1415 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "blockhandler", scope: !1400, file: !6, line: 90, baseType: !1417, size: 128, offset: 320)
!1417 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1418, size: 128, elements: !1419)
!1418 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!1419 = !{!1420}
!1420 = !DISubrange(count: 8)
!1421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1422, size: 64)
!1422 = !DIDerivedType(tag: DW_TAG_typedef, name: "SpaceText", file: !6, line: 856, baseType: !1423)
!1423 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceText", file: !6, line: 818, size: 5440, elements: !1424)
!1424 = !{!1425, !1426, !1427, !1428, !1429, !1430, !1431, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1548, !1549, !1550, !1551, !1555, !1556, !1557, !1558, !1562, !1563}
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1423, file: !6, line: 819, baseType: !1398, size: 64)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1423, file: !6, line: 819, baseType: !1398, size: 64, offset: 64)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !1423, file: !6, line: 820, baseType: !1406, size: 128, offset: 128)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "spacetype", scope: !1423, file: !6, line: 821, baseType: !245, size: 32, offset: 256)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "blockscale", scope: !1423, file: !6, line: 822, baseType: !1415, size: 32, offset: 288)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "blockhandler", scope: !1423, file: !6, line: 823, baseType: !1417, size: 128, offset: 320)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1423, file: !6, line: 825, baseType: !1432, size: 64, offset: 448)
!1432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1433, size: 64)
!1433 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Text", file: !1434, line: 50, size: 1664, elements: !1435)
!1434 = !DIFile(filename: "blender/source/blender/makesdna/DNA_text_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1435 = !{!1436, !1499, !1501, !1502, !1503, !1504, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523}
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1433, file: !1434, line: 51, baseType: !1437, size: 960)
!1437 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !1438, line: 130, baseType: !1439)
!1438 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1439 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !1438, line: 117, size: 960, elements: !1440)
!1440 = !{!1441, !1442, !1443, !1445, !1465, !1469, !1470, !1471, !1472, !1473}
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1439, file: !1438, line: 118, baseType: !1411, size: 64)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1439, file: !1438, line: 118, baseType: !1411, size: 64, offset: 64)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !1439, file: !1438, line: 119, baseType: !1444, size: 64, offset: 128)
!1444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1439, size: 64)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !1439, file: !1438, line: 120, baseType: !1446, size: 64, offset: 192)
!1446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1447, size: 64)
!1447 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !1438, line: 136, size: 17600, elements: !1448)
!1448 = !{!1449, !1450, !1452, !1455, !1460, !1461, !1462}
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1447, file: !1438, line: 137, baseType: !1437, size: 960)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !1447, file: !1438, line: 138, baseType: !1451, size: 64, offset: 960)
!1451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1437, size: 64)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !1447, file: !1438, line: 139, baseType: !1453, size: 64, offset: 1024)
!1453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1454, size: 64)
!1454 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !1438, line: 43, flags: DIFlagFwdDecl)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1447, file: !1438, line: 140, baseType: !1456, size: 8192, offset: 1088)
!1456 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1457, size: 8192, elements: !1458)
!1457 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!1458 = !{!1459}
!1459 = !DISubrange(count: 1024)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !1447, file: !1438, line: 141, baseType: !1456, size: 8192, offset: 9280)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !1447, file: !1438, line: 148, baseType: !1446, size: 64, offset: 17472)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !1447, file: !1438, line: 150, baseType: !1463, size: 64, offset: 17536)
!1463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1464, size: 64)
!1464 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !1438, line: 45, flags: DIFlagFwdDecl)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1439, file: !1438, line: 121, baseType: !1466, size: 528, offset: 256)
!1466 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1457, size: 528, elements: !1467)
!1467 = !{!1468}
!1468 = !DISubrange(count: 66)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1439, file: !1438, line: 126, baseType: !1418, size: 16, offset: 784)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !1439, file: !1438, line: 127, baseType: !245, size: 32, offset: 800)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !1439, file: !1438, line: 128, baseType: !245, size: 32, offset: 832)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1439, file: !1438, line: 128, baseType: !245, size: 32, offset: 864)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !1439, file: !1438, line: 129, baseType: !1474, size: 64, offset: 896)
!1474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1475, size: 64)
!1475 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !1438, line: 75, baseType: !1476)
!1476 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !1438, line: 62, size: 1024, elements: !1477)
!1477 = !{!1478, !1480, !1481, !1482, !1483, !1484, !1488, !1489, !1497, !1498}
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1476, file: !1438, line: 63, baseType: !1479, size: 64)
!1479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1476, size: 64)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1476, file: !1438, line: 63, baseType: !1479, size: 64, offset: 64)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1476, file: !1438, line: 64, baseType: !1457, size: 8, offset: 128)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !1476, file: !1438, line: 64, baseType: !1457, size: 8, offset: 136)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1476, file: !1438, line: 65, baseType: !1418, size: 16, offset: 144)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1476, file: !1438, line: 66, baseType: !1485, size: 512, offset: 160)
!1485 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1457, size: 512, elements: !1486)
!1486 = !{!1487}
!1487 = !DISubrange(count: 64)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !1476, file: !1438, line: 67, baseType: !245, size: 32, offset: 672)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1476, file: !1438, line: 69, baseType: !1490, size: 256, offset: 704)
!1490 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !1438, line: 60, baseType: !1491)
!1491 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !1438, line: 48, size: 256, elements: !1492)
!1492 = !{!1493, !1494, !1495, !1496}
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !1491, file: !1438, line: 49, baseType: !1411, size: 64)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !1491, file: !1438, line: 58, baseType: !1406, size: 128, offset: 64)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1491, file: !1438, line: 59, baseType: !245, size: 32, offset: 192)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !1491, file: !1438, line: 59, baseType: !245, size: 32, offset: 224)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1476, file: !1438, line: 70, baseType: !245, size: 32, offset: 960)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !1476, file: !1438, line: 74, baseType: !245, size: 32, offset: 992)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1433, file: !1434, line: 53, baseType: !1500, size: 64, offset: 960)
!1500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1457, size: 64)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1433, file: !1434, line: 55, baseType: !245, size: 32, offset: 1024)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "nlines", scope: !1433, file: !1434, line: 55, baseType: !245, size: 32, offset: 1056)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "lines", scope: !1433, file: !1434, line: 57, baseType: !1406, size: 128, offset: 1088)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "curl", scope: !1433, file: !1434, line: 58, baseType: !1505, size: 64, offset: 1216)
!1505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1506, size: 64)
!1506 = !DIDerivedType(tag: DW_TAG_typedef, name: "TextLine", file: !1434, line: 48, baseType: !1507)
!1507 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "TextLine", file: !1434, line: 42, size: 320, elements: !1508)
!1508 = !{!1509, !1511, !1512, !1513, !1514, !1515}
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1507, file: !1434, line: 43, baseType: !1510, size: 64)
!1510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1507, size: 64)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1507, file: !1434, line: 43, baseType: !1510, size: 64, offset: 64)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !1507, file: !1434, line: 45, baseType: !1500, size: 64, offset: 128)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1507, file: !1434, line: 46, baseType: !1500, size: 64, offset: 192)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1507, file: !1434, line: 47, baseType: !245, size: 32, offset: 256)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "blen", scope: !1507, file: !1434, line: 47, baseType: !245, size: 32, offset: 288)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "sell", scope: !1433, file: !1434, line: 58, baseType: !1505, size: 64, offset: 1280)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "curc", scope: !1433, file: !1434, line: 59, baseType: !245, size: 32, offset: 1344)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "selc", scope: !1433, file: !1434, line: 59, baseType: !245, size: 32, offset: 1376)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "undo_buf", scope: !1433, file: !1434, line: 61, baseType: !1500, size: 64, offset: 1408)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "undo_pos", scope: !1433, file: !1434, line: 62, baseType: !245, size: 32, offset: 1472)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "undo_len", scope: !1433, file: !1434, line: 62, baseType: !245, size: 32, offset: 1504)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "compiled", scope: !1433, file: !1434, line: 64, baseType: !1411, size: 64, offset: 1536)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "mtime", scope: !1433, file: !1434, line: 65, baseType: !1524, size: 64, offset: 1600)
!1524 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !1423, file: !6, line: 827, baseType: !245, size: 32, offset: 512)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "viewlines", scope: !1423, file: !6, line: 827, baseType: !245, size: 32, offset: 544)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1423, file: !6, line: 828, baseType: !1418, size: 16, offset: 576)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "menunr", scope: !1423, file: !6, line: 828, baseType: !1418, size: 16, offset: 592)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "lheight", scope: !1423, file: !6, line: 830, baseType: !1418, size: 16, offset: 608)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "cwidth", scope: !1423, file: !6, line: 831, baseType: !1457, size: 8, offset: 624)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "linenrs_tot", scope: !1423, file: !6, line: 831, baseType: !1457, size: 8, offset: 632)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !1423, file: !6, line: 832, baseType: !245, size: 32, offset: 640)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "showlinenrs", scope: !1423, file: !6, line: 833, baseType: !245, size: 32, offset: 672)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "tabnumber", scope: !1423, file: !6, line: 834, baseType: !245, size: 32, offset: 704)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "showsyntax", scope: !1423, file: !6, line: 836, baseType: !1418, size: 16, offset: 736)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "line_hlight", scope: !1423, file: !6, line: 837, baseType: !1418, size: 16, offset: 752)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "overwrite", scope: !1423, file: !6, line: 838, baseType: !1418, size: 16, offset: 768)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "live_edit", scope: !1423, file: !6, line: 839, baseType: !1418, size: 16, offset: 784)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "pix_per_line", scope: !1423, file: !6, line: 840, baseType: !1415, size: 32, offset: 800)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "txtscroll", scope: !1423, file: !6, line: 842, baseType: !1541, size: 128, offset: 832)
!1541 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rcti", file: !1542, line: 86, size: 128, elements: !1543)
!1542 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1543 = !{!1544, !1545, !1546, !1547}
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !1541, file: !1542, line: 87, baseType: !245, size: 32)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !1541, file: !1542, line: 87, baseType: !245, size: 32, offset: 32)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !1541, file: !1542, line: 88, baseType: !245, size: 32, offset: 64)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !1541, file: !1542, line: 88, baseType: !245, size: 32, offset: 96)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "txtbar", scope: !1423, file: !6, line: 842, baseType: !1541, size: 128, offset: 960)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "wordwrap", scope: !1423, file: !6, line: 844, baseType: !245, size: 32, offset: 1088)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "doplugins", scope: !1423, file: !6, line: 844, baseType: !245, size: 32, offset: 1120)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "findstr", scope: !1423, file: !6, line: 846, baseType: !1552, size: 2048, offset: 1152)
!1552 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1457, size: 2048, elements: !1553)
!1553 = !{!1554}
!1554 = !DISubrange(count: 256)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "replacestr", scope: !1423, file: !6, line: 847, baseType: !1552, size: 2048, offset: 3200)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "margin_column", scope: !1423, file: !6, line: 849, baseType: !1418, size: 16, offset: 5248)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "lheight_dpi", scope: !1423, file: !6, line: 850, baseType: !1418, size: 16, offset: 5264)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1423, file: !6, line: 851, baseType: !1559, size: 32, offset: 5280)
!1559 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1457, size: 32, elements: !1560)
!1560 = !{!1561}
!1561 = !DISubrange(count: 4)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "drawcache", scope: !1423, file: !6, line: 853, baseType: !1411, size: 64, offset: 5312)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "scroll_accum", scope: !1423, file: !6, line: 855, baseType: !1564, size: 64, offset: 5376)
!1564 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1415, size: 64, elements: !1565)
!1565 = !{!1566}
!1566 = !DISubrange(count: 2)
!1567 = !{!0}
!1568 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1569, size: 128, elements: !1565)
!1569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1570, size: 64)
!1570 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1457)
!1571 = !{i32 7, !"Dwarf Version", i32 4}
!1572 = !{i32 2, !"Debug Info Version", i32 3}
!1573 = !{i32 1, !"wchar_size", i32 4}
!1574 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!1575 = distinct !DISubprogram(name: "ED_spacetype_text", scope: !3, file: !3, line: 560, type: !1576, scopeLine: 561, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !1578)
!1576 = !DISubroutineType(types: !1577)
!1577 = !{null}
!1578 = !{}
!1579 = !DILocalVariable(name: "st", scope: !1575, file: !3, line: 562, type: !1580)
!1580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1581, size: 64)
!1581 = !DIDerivedType(tag: DW_TAG_typedef, name: "SpaceType", file: !1582, line: 112, baseType: !1583)
!1582 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_screen.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1583 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceType", file: !1582, line: 66, size: 1728, elements: !1584)
!1584 = !{!1585, !1587, !1588, !1589, !1590, !1591, !1599, !1603, !3003, !3004, !3021, !3025, !3029, !3031, !3035, !3036, !3042, !3043, !3044}
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1583, file: !1582, line: 67, baseType: !1586, size: 64)
!1586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1583, size: 64)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1583, file: !1582, line: 67, baseType: !1586, size: 64, offset: 64)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1583, file: !1582, line: 69, baseType: !1485, size: 512, offset: 128)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "spaceid", scope: !1583, file: !1582, line: 70, baseType: !245, size: 32, offset: 640)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "iconid", scope: !1583, file: !1582, line: 71, baseType: !245, size: 32, offset: 672)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "new", scope: !1583, file: !1582, line: 74, baseType: !1592, size: 64, offset: 704)
!1592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1593, size: 64)
!1593 = !DISubroutineType(types: !1594)
!1594 = !{!1403, !1595}
!1595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1596, size: 64)
!1596 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1597)
!1597 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !1598, line: 44, flags: DIFlagFwdDecl)
!1598 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !1583, file: !1582, line: 76, baseType: !1600, size: 64, offset: 768)
!1600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1601, size: 64)
!1601 = !DISubroutineType(types: !1602)
!1602 = !{null, !1403}
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1583, file: !1582, line: 79, baseType: !1604, size: 64, offset: 832)
!1604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1605, size: 64)
!1605 = !DISubroutineType(types: !1606)
!1606 = !{null, !1607, !2959}
!1607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1608, size: 64)
!1608 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindowManager", file: !1609, line: 128, size: 2816, elements: !1610)
!1609 = !DIFile(filename: "blender/source/blender/makesdna/DNA_windowmanager_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1610 = !{!1611, !1612, !2922, !2923, !2924, !2925, !2926, !2927, !2928, !2929, !2938, !2939, !2940, !2941, !2942, !2953, !2954, !2955, !2956, !2957, !2958}
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1608, file: !1609, line: 129, baseType: !1437, size: 960)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "windrawable", scope: !1608, file: !1609, line: 131, baseType: !1613, size: 64, offset: 960)
!1613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1614, size: 64)
!1614 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindow", file: !1609, line: 169, size: 2048, elements: !1615)
!1615 = !{!1616, !1617, !1618, !1619, !2840, !2841, !2842, !2843, !2844, !2845, !2846, !2847, !2848, !2849, !2850, !2851, !2852, !2853, !2854, !2855, !2856, !2857, !2897, !2900, !2914, !2915, !2916, !2917, !2918, !2919, !2920, !2921}
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1614, file: !1609, line: 170, baseType: !1613, size: 64)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1614, file: !1609, line: 170, baseType: !1613, size: 64, offset: 64)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "ghostwin", scope: !1614, file: !1609, line: 172, baseType: !1411, size: 64, offset: 128)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !1614, file: !1609, line: 174, baseType: !1620, size: 64, offset: 192)
!1620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1621, size: 64)
!1621 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !32, line: 49, size: 1984, elements: !1622)
!1622 = !{!1623, !1624, !1625, !1626, !1627, !1628, !2807, !2808, !2809, !2810, !2811, !2812, !2813, !2814, !2815, !2816, !2817, !2818, !2819, !2820, !2821, !2822, !2839}
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1621, file: !32, line: 50, baseType: !1437, size: 960)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "vertbase", scope: !1621, file: !32, line: 52, baseType: !1406, size: 128, offset: 960)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "edgebase", scope: !1621, file: !32, line: 53, baseType: !1406, size: 128, offset: 1088)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "areabase", scope: !1621, file: !32, line: 54, baseType: !1406, size: 128, offset: 1216)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !1621, file: !32, line: 55, baseType: !1406, size: 128, offset: 1344)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !1621, file: !32, line: 57, baseType: !1629, size: 64, offset: 1472)
!1629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1630, size: 64)
!1630 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !1631, line: 1216, size: 39680, elements: !1632)
!1631 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1632 = !{!1633, !1634, !1638, !1642, !1645, !1646, !1647, !1659, !1660, !1664, !1665, !1666, !1667, !1668, !1669, !1670, !1671, !1672, !1676, !1751, !2179, !2394, !2397, !2677, !2689, !2690, !2691, !2692, !2693, !2694, !2695, !2696, !2699, !2700, !2701, !2702, !2703, !2711, !2778, !2785, !2786, !2793, !2794, !2800, !2801, !2802, !2803, !2804}
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1630, file: !1631, line: 1217, baseType: !1437, size: 960)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1630, file: !1631, line: 1218, baseType: !1635, size: 64, offset: 960)
!1635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1636, size: 64)
!1636 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !1637, line: 43, flags: DIFlagFwdDecl)
!1637 = !DIFile(filename: "blender/source/blender/makesdna/DNA_movieclip_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !1630, file: !1631, line: 1220, baseType: !1639, size: 64, offset: 1024)
!1639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1640, size: 64)
!1640 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !1641, line: 44, flags: DIFlagFwdDecl)
!1641 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_context.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !1630, file: !1631, line: 1221, baseType: !1643, size: 64, offset: 1088)
!1643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1644, size: 64)
!1644 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !1631, line: 52, flags: DIFlagFwdDecl)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !1630, file: !1631, line: 1223, baseType: !1629, size: 64, offset: 1152)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1630, file: !1631, line: 1225, baseType: !1406, size: 128, offset: 1216)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !1630, file: !1631, line: 1226, baseType: !1648, size: 64, offset: 1344)
!1648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1649, size: 64)
!1649 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !1631, line: 69, size: 320, elements: !1650)
!1650 = !{!1651, !1652, !1653, !1654, !1655, !1656, !1657, !1658}
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1649, file: !1631, line: 70, baseType: !1648, size: 64)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1649, file: !1631, line: 70, baseType: !1648, size: 64, offset: 64)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !1649, file: !1631, line: 71, baseType: !7, size: 32, offset: 128)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !1649, file: !1631, line: 71, baseType: !7, size: 32, offset: 160)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1649, file: !1631, line: 72, baseType: !245, size: 32, offset: 192)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !1649, file: !1631, line: 73, baseType: !1418, size: 16, offset: 224)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !1649, file: !1631, line: 73, baseType: !1418, size: 16, offset: 240)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !1649, file: !1631, line: 74, baseType: !1639, size: 64, offset: 256)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !1630, file: !1631, line: 1227, baseType: !1639, size: 64, offset: 1408)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !1630, file: !1631, line: 1229, baseType: !1661, size: 96, offset: 1472)
!1661 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1415, size: 96, elements: !1662)
!1662 = !{!1663}
!1663 = !DISubrange(count: 3)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !1630, file: !1631, line: 1230, baseType: !1661, size: 96, offset: 1568)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !1630, file: !1631, line: 1231, baseType: !1661, size: 96, offset: 1664)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !1630, file: !1631, line: 1231, baseType: !1661, size: 96, offset: 1760)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !1630, file: !1631, line: 1233, baseType: !7, size: 32, offset: 1856)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !1630, file: !1631, line: 1234, baseType: !245, size: 32, offset: 1888)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !1630, file: !1631, line: 1235, baseType: !7, size: 32, offset: 1920)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1630, file: !1631, line: 1237, baseType: !1418, size: 16, offset: 1952)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !1630, file: !1631, line: 1239, baseType: !1457, size: 8, offset: 1968)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1630, file: !1631, line: 1240, baseType: !1673, size: 8, offset: 1976)
!1673 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1457, size: 8, elements: !1674)
!1674 = !{!1675}
!1675 = !DISubrange(count: 1)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !1630, file: !1631, line: 1242, baseType: !1677, size: 64, offset: 1984)
!1677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1678, size: 64)
!1678 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !1679, line: 328, size: 3456, elements: !1680)
!1679 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1680 = !{!1681, !1682, !1683, !1686, !1687, !1690, !1694, !1695, !1696, !1697, !1698, !1699, !1700, !1701, !1702, !1703, !1704, !1705, !1706, !1707, !1708, !1709, !1717, !1718, !1719, !1722, !1727, !1728, !1731, !1735, !1739, !1743, !1747, !1748, !1749, !1750}
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1678, file: !1679, line: 329, baseType: !1437, size: 960)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1678, file: !1679, line: 330, baseType: !1635, size: 64, offset: 960)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !1678, file: !1679, line: 332, baseType: !1684, size: 64, offset: 1024)
!1684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1685, size: 64)
!1685 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !1679, line: 332, flags: DIFlagFwdDecl)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !1678, file: !1679, line: 333, baseType: !1485, size: 512, offset: 1088)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "interface_type", scope: !1678, file: !1679, line: 335, baseType: !1688, size: 64, offset: 1600)
!1688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1689, size: 64)
!1689 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !1598, line: 41, flags: DIFlagFwdDecl)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !1678, file: !1679, line: 337, baseType: !1691, size: 64, offset: 1664)
!1691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1692, size: 64)
!1692 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !1693, line: 45, flags: DIFlagFwdDecl)
!1693 = !DIFile(filename: "blender/source/blender/makesdna/DNA_tracking_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "view_center", scope: !1678, file: !1679, line: 338, baseType: !1564, size: 64, offset: 1728)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !1678, file: !1679, line: 340, baseType: !1406, size: 128, offset: 1792)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !1678, file: !1679, line: 340, baseType: !1406, size: 128, offset: 1920)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1678, file: !1679, line: 342, baseType: !245, size: 32, offset: 2048)
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1678, file: !1679, line: 342, baseType: !245, size: 32, offset: 2080)
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "cur_index", scope: !1678, file: !1679, line: 343, baseType: !245, size: 32, offset: 2112)
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1678, file: !1679, line: 345, baseType: !245, size: 32, offset: 2144)
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !1678, file: !1679, line: 346, baseType: !245, size: 32, offset: 2176)
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "is_updating", scope: !1678, file: !1679, line: 347, baseType: !1418, size: 16, offset: 2208)
!1703 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !1678, file: !1679, line: 348, baseType: !1418, size: 16, offset: 2224)
!1704 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1678, file: !1679, line: 349, baseType: !245, size: 32, offset: 2240)
!1705 = !DIDerivedType(tag: DW_TAG_member, name: "nodetype", scope: !1678, file: !1679, line: 351, baseType: !245, size: 32, offset: 2272)
!1706 = !DIDerivedType(tag: DW_TAG_member, name: "edit_quality", scope: !1678, file: !1679, line: 353, baseType: !1418, size: 16, offset: 2304)
!1707 = !DIDerivedType(tag: DW_TAG_member, name: "render_quality", scope: !1678, file: !1679, line: 354, baseType: !1418, size: 16, offset: 2320)
!1708 = !DIDerivedType(tag: DW_TAG_member, name: "chunksize", scope: !1678, file: !1679, line: 355, baseType: !245, size: 32, offset: 2336)
!1709 = !DIDerivedType(tag: DW_TAG_member, name: "viewer_border", scope: !1678, file: !1679, line: 357, baseType: !1710, size: 128, offset: 2368)
!1710 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !1542, line: 95, baseType: !1711)
!1711 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !1542, line: 92, size: 128, elements: !1712)
!1712 = !{!1713, !1714, !1715, !1716}
!1713 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !1711, file: !1542, line: 93, baseType: !1415, size: 32)
!1714 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !1711, file: !1542, line: 93, baseType: !1415, size: 32, offset: 32)
!1715 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !1711, file: !1542, line: 94, baseType: !1415, size: 32, offset: 64)
!1716 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !1711, file: !1542, line: 94, baseType: !1415, size: 32, offset: 96)
!1717 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !1678, file: !1679, line: 363, baseType: !1406, size: 128, offset: 2496)
!1718 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !1678, file: !1679, line: 363, baseType: !1406, size: 128, offset: 2624)
!1719 = !DIDerivedType(tag: DW_TAG_member, name: "previews", scope: !1678, file: !1679, line: 368, baseType: !1720, size: 64, offset: 2752)
!1720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1721, size: 64)
!1721 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHash", file: !1679, line: 48, flags: DIFlagFwdDecl)
!1722 = !DIDerivedType(tag: DW_TAG_member, name: "active_viewer_key", scope: !1678, file: !1679, line: 372, baseType: !1723, size: 32, offset: 2816)
!1723 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !1679, line: 274, baseType: !1724)
!1724 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !1679, line: 271, size: 32, elements: !1725)
!1725 = !{!1726}
!1726 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1724, file: !1679, line: 273, baseType: !7, size: 32)
!1727 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1678, file: !1679, line: 373, baseType: !245, size: 32, offset: 2848)
!1728 = !DIDerivedType(tag: DW_TAG_member, name: "execdata", scope: !1678, file: !1679, line: 382, baseType: !1729, size: 64, offset: 2880)
!1729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1730, size: 64)
!1730 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeExec", file: !1679, line: 46, flags: DIFlagFwdDecl)
!1731 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !1678, file: !1679, line: 385, baseType: !1732, size: 64, offset: 2944)
!1732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1733, size: 64)
!1733 = !DISubroutineType(types: !1734)
!1734 = !{null, !1411, !1415}
!1735 = !DIDerivedType(tag: DW_TAG_member, name: "stats_draw", scope: !1678, file: !1679, line: 386, baseType: !1736, size: 64, offset: 3008)
!1736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1737, size: 64)
!1737 = !DISubroutineType(types: !1738)
!1738 = !{null, !1411, !1500}
!1739 = !DIDerivedType(tag: DW_TAG_member, name: "test_break", scope: !1678, file: !1679, line: 387, baseType: !1740, size: 64, offset: 3072)
!1740 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1741, size: 64)
!1741 = !DISubroutineType(types: !1742)
!1742 = !{!245, !1411}
!1743 = !DIDerivedType(tag: DW_TAG_member, name: "update_draw", scope: !1678, file: !1679, line: 388, baseType: !1744, size: 64, offset: 3136)
!1744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1745, size: 64)
!1745 = !DISubroutineType(types: !1746)
!1746 = !{null, !1411}
!1747 = !DIDerivedType(tag: DW_TAG_member, name: "tbh", scope: !1678, file: !1679, line: 389, baseType: !1411, size: 64, offset: 3200)
!1748 = !DIDerivedType(tag: DW_TAG_member, name: "prh", scope: !1678, file: !1679, line: 389, baseType: !1411, size: 64, offset: 3264)
!1749 = !DIDerivedType(tag: DW_TAG_member, name: "sdh", scope: !1678, file: !1679, line: 389, baseType: !1411, size: 64, offset: 3328)
!1750 = !DIDerivedType(tag: DW_TAG_member, name: "udh", scope: !1678, file: !1679, line: 389, baseType: !1411, size: 64, offset: 3392)
!1751 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !1630, file: !1631, line: 1244, baseType: !1752, size: 64, offset: 2048)
!1752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1753, size: 64)
!1753 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !1754, line: 200, size: 17024, elements: !1755)
!1754 = !DIFile(filename: "blender/source/blender/makesdna/DNA_sequence_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1755 = !{!1756, !1758, !1759, !1760, !2172, !2173, !2174, !2175, !2176, !2177, !2178}
!1756 = !DIDerivedType(tag: DW_TAG_member, name: "seqbasep", scope: !1753, file: !1754, line: 201, baseType: !1757, size: 64)
!1757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1406, size: 64)
!1758 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !1753, file: !1754, line: 202, baseType: !1406, size: 128, offset: 64)
!1759 = !DIDerivedType(tag: DW_TAG_member, name: "metastack", scope: !1753, file: !1754, line: 203, baseType: !1406, size: 128, offset: 192)
!1760 = !DIDerivedType(tag: DW_TAG_member, name: "act_seq", scope: !1753, file: !1754, line: 206, baseType: !1761, size: 64, offset: 320)
!1761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1762, size: 64)
!1762 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sequence", file: !1754, line: 190, baseType: !1763)
!1763 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sequence", file: !1754, line: 126, size: 2816, elements: !1764)
!1764 = !{!1765, !1767, !1768, !1769, !1770, !1771, !1772, !1773, !1774, !1775, !1776, !1777, !1778, !1779, !1780, !1781, !1782, !1783, !1784, !1785, !1786, !1787, !1788, !1789, !1790, !1861, !1864, !1865, !1866, !2144, !2147, !2148, !2149, !2150, !2151, !2152, !2153, !2154, !2157, !2158, !2159, !2160, !2161, !2162, !2163, !2164, !2165, !2166, !2167, !2168, !2169, !2171}
!1765 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1763, file: !1754, line: 127, baseType: !1766, size: 64)
!1766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1763, size: 64)
!1767 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1763, file: !1754, line: 127, baseType: !1766, size: 64, offset: 64)
!1768 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !1763, file: !1754, line: 128, baseType: !1411, size: 64, offset: 128)
!1769 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !1763, file: !1754, line: 129, baseType: !1411, size: 64, offset: 192)
!1770 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1763, file: !1754, line: 130, baseType: !1485, size: 512, offset: 256)
!1771 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1763, file: !1754, line: 132, baseType: !245, size: 32, offset: 768)
!1772 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1763, file: !1754, line: 132, baseType: !245, size: 32, offset: 800)
!1773 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1763, file: !1754, line: 133, baseType: !245, size: 32, offset: 832)
!1774 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !1763, file: !1754, line: 134, baseType: !245, size: 32, offset: 864)
!1775 = !DIDerivedType(tag: DW_TAG_member, name: "startofs", scope: !1763, file: !1754, line: 134, baseType: !245, size: 32, offset: 896)
!1776 = !DIDerivedType(tag: DW_TAG_member, name: "endofs", scope: !1763, file: !1754, line: 134, baseType: !245, size: 32, offset: 928)
!1777 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !1763, file: !1754, line: 135, baseType: !245, size: 32, offset: 960)
!1778 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !1763, file: !1754, line: 135, baseType: !245, size: 32, offset: 992)
!1779 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !1763, file: !1754, line: 136, baseType: !245, size: 32, offset: 1024)
!1780 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !1763, file: !1754, line: 136, baseType: !245, size: 32, offset: 1056)
!1781 = !DIDerivedType(tag: DW_TAG_member, name: "startdisp", scope: !1763, file: !1754, line: 137, baseType: !245, size: 32, offset: 1088)
!1782 = !DIDerivedType(tag: DW_TAG_member, name: "enddisp", scope: !1763, file: !1754, line: 137, baseType: !245, size: 32, offset: 1120)
!1783 = !DIDerivedType(tag: DW_TAG_member, name: "sat", scope: !1763, file: !1754, line: 138, baseType: !1415, size: 32, offset: 1152)
!1784 = !DIDerivedType(tag: DW_TAG_member, name: "mul", scope: !1763, file: !1754, line: 139, baseType: !1415, size: 32, offset: 1184)
!1785 = !DIDerivedType(tag: DW_TAG_member, name: "handsize", scope: !1763, file: !1754, line: 139, baseType: !1415, size: 32, offset: 1216)
!1786 = !DIDerivedType(tag: DW_TAG_member, name: "anim_preseek", scope: !1763, file: !1754, line: 141, baseType: !1418, size: 16, offset: 1248)
!1787 = !DIDerivedType(tag: DW_TAG_member, name: "streamindex", scope: !1763, file: !1754, line: 142, baseType: !1418, size: 16, offset: 1264)
!1788 = !DIDerivedType(tag: DW_TAG_member, name: "multicam_source", scope: !1763, file: !1754, line: 143, baseType: !245, size: 32, offset: 1280)
!1789 = !DIDerivedType(tag: DW_TAG_member, name: "clip_flag", scope: !1763, file: !1754, line: 144, baseType: !245, size: 32, offset: 1312)
!1790 = !DIDerivedType(tag: DW_TAG_member, name: "strip", scope: !1763, file: !1754, line: 146, baseType: !1791, size: 64, offset: 1344)
!1791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1792, size: 64)
!1792 = !DIDerivedType(tag: DW_TAG_typedef, name: "Strip", file: !1754, line: 114, baseType: !1793)
!1793 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Strip", file: !1754, line: 99, size: 7232, elements: !1794)
!1794 = !{!1795, !1797, !1798, !1799, !1800, !1801, !1802, !1810, !1814, !1829, !1838, !1845, !1855}
!1795 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1793, file: !1754, line: 100, baseType: !1796, size: 64)
!1796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1793, size: 64)
!1797 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1793, file: !1754, line: 100, baseType: !1796, size: 64, offset: 64)
!1798 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !1793, file: !1754, line: 101, baseType: !245, size: 32, offset: 128)
!1799 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !1793, file: !1754, line: 101, baseType: !245, size: 32, offset: 160)
!1800 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !1793, file: !1754, line: 102, baseType: !245, size: 32, offset: 192)
!1801 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !1793, file: !1754, line: 102, baseType: !245, size: 32, offset: 224)
!1802 = !DIDerivedType(tag: DW_TAG_member, name: "stripdata", scope: !1793, file: !1754, line: 103, baseType: !1803, size: 64, offset: 256)
!1803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1804, size: 64)
!1804 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripElem", file: !1754, line: 59, baseType: !1805)
!1805 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripElem", file: !1754, line: 56, size: 2112, elements: !1806)
!1806 = !{!1807, !1808, !1809}
!1807 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1805, file: !1754, line: 57, baseType: !1552, size: 2048)
!1808 = !DIDerivedType(tag: DW_TAG_member, name: "orig_width", scope: !1805, file: !1754, line: 58, baseType: !245, size: 32, offset: 2048)
!1809 = !DIDerivedType(tag: DW_TAG_member, name: "orig_height", scope: !1805, file: !1754, line: 58, baseType: !245, size: 32, offset: 2080)
!1810 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !1793, file: !1754, line: 106, baseType: !1811, size: 6144, offset: 320)
!1811 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1457, size: 6144, elements: !1812)
!1812 = !{!1813}
!1813 = !DISubrange(count: 768)
!1814 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !1793, file: !1754, line: 107, baseType: !1815, size: 64, offset: 6464)
!1815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1816, size: 64)
!1816 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripProxy", file: !1754, line: 97, baseType: !1817)
!1817 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripProxy", file: !1754, line: 83, size: 8320, elements: !1818)
!1818 = !{!1819, !1820, !1821, !1825, !1826, !1827, !1828}
!1819 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !1817, file: !1754, line: 84, baseType: !1811, size: 6144)
!1820 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !1817, file: !1754, line: 87, baseType: !1552, size: 2048, offset: 6144)
!1821 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !1817, file: !1754, line: 88, baseType: !1822, size: 64, offset: 8192)
!1822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1823, size: 64)
!1823 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !1824, line: 41, flags: DIFlagFwdDecl)
!1824 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1825 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !1817, file: !1754, line: 90, baseType: !1418, size: 16, offset: 8256)
!1826 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1817, file: !1754, line: 92, baseType: !1418, size: 16, offset: 8272)
!1827 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flags", scope: !1817, file: !1754, line: 93, baseType: !1418, size: 16, offset: 8288)
!1828 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flags", scope: !1817, file: !1754, line: 95, baseType: !1418, size: 16, offset: 8304)
!1829 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !1793, file: !1754, line: 108, baseType: !1830, size: 64, offset: 6528)
!1830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1831, size: 64)
!1831 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripCrop", file: !1754, line: 66, baseType: !1832)
!1832 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripCrop", file: !1754, line: 61, size: 128, elements: !1833)
!1833 = !{!1834, !1835, !1836, !1837}
!1834 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !1832, file: !1754, line: 62, baseType: !245, size: 32)
!1835 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !1832, file: !1754, line: 63, baseType: !245, size: 32, offset: 32)
!1836 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !1832, file: !1754, line: 64, baseType: !245, size: 32, offset: 64)
!1837 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !1832, file: !1754, line: 65, baseType: !245, size: 32, offset: 96)
!1838 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !1793, file: !1754, line: 109, baseType: !1839, size: 64, offset: 6592)
!1839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1840, size: 64)
!1840 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripTransform", file: !1754, line: 71, baseType: !1841)
!1841 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripTransform", file: !1754, line: 68, size: 64, elements: !1842)
!1842 = !{!1843, !1844}
!1843 = !DIDerivedType(tag: DW_TAG_member, name: "xofs", scope: !1841, file: !1754, line: 69, baseType: !245, size: 32)
!1844 = !DIDerivedType(tag: DW_TAG_member, name: "yofs", scope: !1841, file: !1754, line: 70, baseType: !245, size: 32, offset: 32)
!1845 = !DIDerivedType(tag: DW_TAG_member, name: "color_balance", scope: !1793, file: !1754, line: 110, baseType: !1846, size: 64, offset: 6656)
!1846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1847, size: 64)
!1847 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripColorBalance", file: !1754, line: 81, baseType: !1848)
!1848 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripColorBalance", file: !1754, line: 73, size: 352, elements: !1849)
!1849 = !{!1850, !1851, !1852, !1853, !1854}
!1850 = !DIDerivedType(tag: DW_TAG_member, name: "lift", scope: !1848, file: !1754, line: 74, baseType: !1661, size: 96)
!1851 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !1848, file: !1754, line: 75, baseType: !1661, size: 96, offset: 96)
!1852 = !DIDerivedType(tag: DW_TAG_member, name: "gain", scope: !1848, file: !1754, line: 76, baseType: !1661, size: 96, offset: 192)
!1853 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1848, file: !1754, line: 77, baseType: !245, size: 32, offset: 288)
!1854 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1848, file: !1754, line: 78, baseType: !245, size: 32, offset: 320)
!1855 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !1793, file: !1754, line: 113, baseType: !1856, size: 512, offset: 6720)
!1856 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !1857, line: 182, baseType: !1858)
!1857 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1858 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !1857, line: 180, size: 512, elements: !1859)
!1859 = !{!1860}
!1860 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1858, file: !1857, line: 181, baseType: !1485, size: 512)
!1861 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !1763, file: !1754, line: 148, baseType: !1862, size: 64, offset: 1408)
!1862 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1863, size: 64)
!1863 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !1754, line: 49, flags: DIFlagFwdDecl)
!1864 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !1763, file: !1754, line: 151, baseType: !1629, size: 64, offset: 1472)
!1865 = !DIDerivedType(tag: DW_TAG_member, name: "scene_camera", scope: !1763, file: !1754, line: 152, baseType: !1639, size: 64, offset: 1536)
!1866 = !DIDerivedType(tag: DW_TAG_member, name: "clip", scope: !1763, file: !1754, line: 153, baseType: !1867, size: 64, offset: 1600)
!1867 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1868, size: 64)
!1868 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClip", file: !1637, line: 64, size: 19136, elements: !1869)
!1869 = !{!1870, !1871, !1872, !1873, !1874, !1875, !1877, !1878, !1879, !1880, !1883, !1884, !2130, !2131, !2139, !2140, !2141, !2142, !2143}
!1870 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1868, file: !1637, line: 65, baseType: !1437, size: 960)
!1871 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !1868, file: !1637, line: 66, baseType: !1635, size: 64, offset: 960)
!1872 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1868, file: !1637, line: 68, baseType: !1456, size: 8192, offset: 1024)
!1873 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !1868, file: !1637, line: 70, baseType: !245, size: 32, offset: 9216)
!1874 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !1868, file: !1637, line: 71, baseType: !245, size: 32, offset: 9248)
!1875 = !DIDerivedType(tag: DW_TAG_member, name: "lastsize", scope: !1868, file: !1637, line: 72, baseType: !1876, size: 64, offset: 9280)
!1876 = !DICompositeType(tag: DW_TAG_array_type, baseType: !245, size: 64, elements: !1565)
!1877 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !1868, file: !1637, line: 74, baseType: !1415, size: 32, offset: 9344)
!1878 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !1868, file: !1637, line: 74, baseType: !1415, size: 32, offset: 9376)
!1879 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !1868, file: !1637, line: 76, baseType: !1822, size: 64, offset: 9408)
!1880 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !1868, file: !1637, line: 77, baseType: !1881, size: 64, offset: 9472)
!1881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1882, size: 64)
!1882 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipCache", file: !1637, line: 77, flags: DIFlagFwdDecl)
!1883 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !1868, file: !1637, line: 78, baseType: !1691, size: 64, offset: 9536)
!1884 = !DIDerivedType(tag: DW_TAG_member, name: "tracking", scope: !1868, file: !1637, line: 80, baseType: !1885, size: 2624, offset: 9600)
!1885 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTracking", file: !1693, line: 340, size: 2624, elements: !1886)
!1886 = !{!1887, !1915, !1933, !1934, !1935, !1952, !2010, !2011, !2110, !2111, !2112, !2113, !2119}
!1887 = !DIDerivedType(tag: DW_TAG_member, name: "settings", scope: !1885, file: !1693, line: 341, baseType: !1888, size: 576)
!1888 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingSettings", file: !1693, line: 251, baseType: !1889)
!1889 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingSettings", file: !1693, line: 207, size: 576, elements: !1890)
!1890 = !{!1891, !1892, !1893, !1894, !1895, !1896, !1897, !1898, !1899, !1900, !1901, !1902, !1903, !1904, !1905, !1906, !1907, !1908, !1909, !1910, !1911, !1912, !1913, !1914}
!1891 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1889, file: !1693, line: 208, baseType: !245, size: 32)
!1892 = !DIDerivedType(tag: DW_TAG_member, name: "default_motion_model", scope: !1889, file: !1693, line: 211, baseType: !1418, size: 16, offset: 32)
!1893 = !DIDerivedType(tag: DW_TAG_member, name: "default_algorithm_flag", scope: !1889, file: !1693, line: 212, baseType: !1418, size: 16, offset: 48)
!1894 = !DIDerivedType(tag: DW_TAG_member, name: "default_minimum_correlation", scope: !1889, file: !1693, line: 213, baseType: !1415, size: 32, offset: 64)
!1895 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_size", scope: !1889, file: !1693, line: 214, baseType: !1418, size: 16, offset: 96)
!1896 = !DIDerivedType(tag: DW_TAG_member, name: "default_search_size", scope: !1889, file: !1693, line: 215, baseType: !1418, size: 16, offset: 112)
!1897 = !DIDerivedType(tag: DW_TAG_member, name: "default_frames_limit", scope: !1889, file: !1693, line: 216, baseType: !1418, size: 16, offset: 128)
!1898 = !DIDerivedType(tag: DW_TAG_member, name: "default_margin", scope: !1889, file: !1693, line: 217, baseType: !1418, size: 16, offset: 144)
!1899 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_match", scope: !1889, file: !1693, line: 218, baseType: !1418, size: 16, offset: 160)
!1900 = !DIDerivedType(tag: DW_TAG_member, name: "default_flag", scope: !1889, file: !1693, line: 219, baseType: !1418, size: 16, offset: 176)
!1901 = !DIDerivedType(tag: DW_TAG_member, name: "default_weight", scope: !1889, file: !1693, line: 220, baseType: !1415, size: 32, offset: 192)
!1902 = !DIDerivedType(tag: DW_TAG_member, name: "motion_flag", scope: !1889, file: !1693, line: 222, baseType: !1418, size: 16, offset: 224)
!1903 = !DIDerivedType(tag: DW_TAG_member, name: "speed", scope: !1889, file: !1693, line: 225, baseType: !1418, size: 16, offset: 240)
!1904 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe1", scope: !1889, file: !1693, line: 228, baseType: !245, size: 32, offset: 256)
!1905 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe2", scope: !1889, file: !1693, line: 229, baseType: !245, size: 32, offset: 288)
!1906 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction_flag", scope: !1889, file: !1693, line: 233, baseType: !245, size: 32, offset: 320)
!1907 = !DIDerivedType(tag: DW_TAG_member, name: "refine_camera_intrinsics", scope: !1889, file: !1693, line: 236, baseType: !1418, size: 16, offset: 352)
!1908 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1889, file: !1693, line: 236, baseType: !1418, size: 16, offset: 368)
!1909 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !1889, file: !1693, line: 241, baseType: !1415, size: 32, offset: 384)
!1910 = !DIDerivedType(tag: DW_TAG_member, name: "clean_frames", scope: !1889, file: !1693, line: 244, baseType: !245, size: 32, offset: 416)
!1911 = !DIDerivedType(tag: DW_TAG_member, name: "clean_action", scope: !1889, file: !1693, line: 244, baseType: !245, size: 32, offset: 448)
!1912 = !DIDerivedType(tag: DW_TAG_member, name: "clean_error", scope: !1889, file: !1693, line: 245, baseType: !1415, size: 32, offset: 480)
!1913 = !DIDerivedType(tag: DW_TAG_member, name: "object_distance", scope: !1889, file: !1693, line: 248, baseType: !1415, size: 32, offset: 512)
!1914 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !1889, file: !1693, line: 250, baseType: !245, size: 32, offset: 544)
!1915 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !1885, file: !1693, line: 342, baseType: !1916, size: 448, offset: 576)
!1916 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingCamera", file: !1693, line: 79, baseType: !1917)
!1917 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingCamera", file: !1693, line: 61, size: 448, elements: !1918)
!1918 = !{!1919, !1920, !1921, !1922, !1923, !1924, !1925, !1926, !1927, !1928, !1929, !1930, !1931, !1932}
!1919 = !DIDerivedType(tag: DW_TAG_member, name: "intrinsics", scope: !1917, file: !1693, line: 62, baseType: !1411, size: 64)
!1920 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_model", scope: !1917, file: !1693, line: 64, baseType: !1418, size: 16, offset: 64)
!1921 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1917, file: !1693, line: 65, baseType: !1418, size: 16, offset: 80)
!1922 = !DIDerivedType(tag: DW_TAG_member, name: "sensor_width", scope: !1917, file: !1693, line: 67, baseType: !1415, size: 32, offset: 96)
!1923 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_aspect", scope: !1917, file: !1693, line: 68, baseType: !1415, size: 32, offset: 128)
!1924 = !DIDerivedType(tag: DW_TAG_member, name: "focal", scope: !1917, file: !1693, line: 69, baseType: !1415, size: 32, offset: 160)
!1925 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !1917, file: !1693, line: 70, baseType: !1418, size: 16, offset: 192)
!1926 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !1917, file: !1693, line: 71, baseType: !1418, size: 16, offset: 208)
!1927 = !DIDerivedType(tag: DW_TAG_member, name: "principal", scope: !1917, file: !1693, line: 72, baseType: !1564, size: 64, offset: 224)
!1928 = !DIDerivedType(tag: DW_TAG_member, name: "k1", scope: !1917, file: !1693, line: 75, baseType: !1415, size: 32, offset: 288)
!1929 = !DIDerivedType(tag: DW_TAG_member, name: "k2", scope: !1917, file: !1693, line: 75, baseType: !1415, size: 32, offset: 320)
!1930 = !DIDerivedType(tag: DW_TAG_member, name: "k3", scope: !1917, file: !1693, line: 75, baseType: !1415, size: 32, offset: 352)
!1931 = !DIDerivedType(tag: DW_TAG_member, name: "division_k1", scope: !1917, file: !1693, line: 78, baseType: !1415, size: 32, offset: 384)
!1932 = !DIDerivedType(tag: DW_TAG_member, name: "division_k2", scope: !1917, file: !1693, line: 78, baseType: !1415, size: 32, offset: 416)
!1933 = !DIDerivedType(tag: DW_TAG_member, name: "tracks", scope: !1885, file: !1693, line: 343, baseType: !1406, size: 128, offset: 1024)
!1934 = !DIDerivedType(tag: DW_TAG_member, name: "plane_tracks", scope: !1885, file: !1693, line: 344, baseType: !1406, size: 128, offset: 1152)
!1935 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction", scope: !1885, file: !1693, line: 345, baseType: !1936, size: 192, offset: 1280)
!1936 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingReconstruction", file: !1693, line: 278, baseType: !1937)
!1937 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingReconstruction", file: !1693, line: 270, size: 192, elements: !1938)
!1938 = !{!1939, !1940, !1941, !1942, !1943}
!1939 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1937, file: !1693, line: 271, baseType: !245, size: 32)
!1940 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1937, file: !1693, line: 273, baseType: !1415, size: 32, offset: 32)
!1941 = !DIDerivedType(tag: DW_TAG_member, name: "last_camera", scope: !1937, file: !1693, line: 275, baseType: !245, size: 32, offset: 64)
!1942 = !DIDerivedType(tag: DW_TAG_member, name: "camnr", scope: !1937, file: !1693, line: 276, baseType: !245, size: 32, offset: 96)
!1943 = !DIDerivedType(tag: DW_TAG_member, name: "cameras", scope: !1937, file: !1693, line: 277, baseType: !1944, size: 64, offset: 128)
!1944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1945, size: 64)
!1945 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieReconstructedCamera", file: !1693, line: 55, size: 576, elements: !1946)
!1946 = !{!1947, !1948, !1949}
!1947 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !1945, file: !1693, line: 56, baseType: !245, size: 32)
!1948 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1945, file: !1693, line: 57, baseType: !1415, size: 32, offset: 32)
!1949 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !1945, file: !1693, line: 58, baseType: !1950, size: 512, offset: 64)
!1950 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1415, size: 512, elements: !1951)
!1951 = !{!1561, !1561}
!1952 = !DIDerivedType(tag: DW_TAG_member, name: "stabilization", scope: !1885, file: !1693, line: 346, baseType: !1953, size: 384, offset: 1472)
!1953 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStabilization", file: !1693, line: 268, baseType: !1954)
!1954 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStabilization", file: !1693, line: 253, size: 384, elements: !1955)
!1955 = !{!1956, !1957, !1958, !1959, !1960, !2004, !2005, !2006, !2007, !2008, !2009}
!1956 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1954, file: !1693, line: 254, baseType: !245, size: 32)
!1957 = !DIDerivedType(tag: DW_TAG_member, name: "tot_track", scope: !1954, file: !1693, line: 255, baseType: !245, size: 32, offset: 32)
!1958 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !1954, file: !1693, line: 255, baseType: !245, size: 32, offset: 64)
!1959 = !DIDerivedType(tag: DW_TAG_member, name: "maxscale", scope: !1954, file: !1693, line: 258, baseType: !1415, size: 32, offset: 96)
!1960 = !DIDerivedType(tag: DW_TAG_member, name: "rot_track", scope: !1954, file: !1693, line: 259, baseType: !1961, size: 64, offset: 128)
!1961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1962, size: 64)
!1962 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingTrack", file: !1693, line: 164, baseType: !1963)
!1963 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingTrack", file: !1693, line: 108, size: 1664, elements: !1964)
!1964 = !{!1965, !1967, !1968, !1969, !1970, !1971, !1972, !1973, !1974, !1975, !1976, !1989, !1990, !1991, !1992, !1993, !1994, !1995, !1996, !1997, !1998, !1999, !2000, !2001, !2002, !2003}
!1965 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1963, file: !1693, line: 109, baseType: !1966, size: 64)
!1966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1963, size: 64)
!1967 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1963, file: !1693, line: 109, baseType: !1966, size: 64, offset: 64)
!1968 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1963, file: !1693, line: 111, baseType: !1485, size: 512, offset: 128)
!1969 = !DIDerivedType(tag: DW_TAG_member, name: "pat_min", scope: !1963, file: !1693, line: 119, baseType: !1564, size: 64, offset: 640)
!1970 = !DIDerivedType(tag: DW_TAG_member, name: "pat_max", scope: !1963, file: !1693, line: 119, baseType: !1564, size: 64, offset: 704)
!1971 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !1963, file: !1693, line: 125, baseType: !1564, size: 64, offset: 768)
!1972 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !1963, file: !1693, line: 125, baseType: !1564, size: 64, offset: 832)
!1973 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1963, file: !1693, line: 127, baseType: !1564, size: 64, offset: 896)
!1974 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !1963, file: !1693, line: 130, baseType: !245, size: 32, offset: 960)
!1975 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !1963, file: !1693, line: 131, baseType: !245, size: 32, offset: 992)
!1976 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !1963, file: !1693, line: 132, baseType: !1977, size: 64, offset: 1024)
!1977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1978, size: 64)
!1978 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingMarker", file: !1693, line: 106, baseType: !1979)
!1979 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingMarker", file: !1693, line: 81, size: 512, elements: !1980)
!1980 = !{!1981, !1982, !1985, !1986, !1987, !1988}
!1981 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1979, file: !1693, line: 82, baseType: !1564, size: 64)
!1982 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_corners", scope: !1979, file: !1693, line: 97, baseType: !1983, size: 256, offset: 64)
!1983 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1415, size: 256, elements: !1984)
!1984 = !{!1561, !1566}
!1985 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !1979, file: !1693, line: 102, baseType: !1564, size: 64, offset: 320)
!1986 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !1979, file: !1693, line: 102, baseType: !1564, size: 64, offset: 384)
!1987 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !1979, file: !1693, line: 104, baseType: !245, size: 32, offset: 448)
!1988 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1979, file: !1693, line: 105, baseType: !245, size: 32, offset: 480)
!1989 = !DIDerivedType(tag: DW_TAG_member, name: "bundle_pos", scope: !1963, file: !1693, line: 135, baseType: !1661, size: 96, offset: 1088)
!1990 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1963, file: !1693, line: 136, baseType: !1415, size: 32, offset: 1184)
!1991 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1963, file: !1693, line: 139, baseType: !245, size: 32, offset: 1216)
!1992 = !DIDerivedType(tag: DW_TAG_member, name: "pat_flag", scope: !1963, file: !1693, line: 139, baseType: !245, size: 32, offset: 1248)
!1993 = !DIDerivedType(tag: DW_TAG_member, name: "search_flag", scope: !1963, file: !1693, line: 139, baseType: !245, size: 32, offset: 1280)
!1994 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !1963, file: !1693, line: 140, baseType: !1661, size: 96, offset: 1312)
!1995 = !DIDerivedType(tag: DW_TAG_member, name: "frames_limit", scope: !1963, file: !1693, line: 143, baseType: !1418, size: 16, offset: 1408)
!1996 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !1963, file: !1693, line: 144, baseType: !1418, size: 16, offset: 1424)
!1997 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_match", scope: !1963, file: !1693, line: 145, baseType: !1418, size: 16, offset: 1440)
!1998 = !DIDerivedType(tag: DW_TAG_member, name: "motion_model", scope: !1963, file: !1693, line: 148, baseType: !1418, size: 16, offset: 1456)
!1999 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm_flag", scope: !1963, file: !1693, line: 149, baseType: !245, size: 32, offset: 1472)
!2000 = !DIDerivedType(tag: DW_TAG_member, name: "minimum_correlation", scope: !1963, file: !1693, line: 150, baseType: !1415, size: 32, offset: 1504)
!2001 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !1963, file: !1693, line: 152, baseType: !1691, size: 64, offset: 1536)
!2002 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !1963, file: !1693, line: 163, baseType: !1415, size: 32, offset: 1600)
!2003 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1963, file: !1693, line: 163, baseType: !1415, size: 32, offset: 1632)
!2004 = !DIDerivedType(tag: DW_TAG_member, name: "locinf", scope: !1954, file: !1693, line: 261, baseType: !1415, size: 32, offset: 192)
!2005 = !DIDerivedType(tag: DW_TAG_member, name: "scaleinf", scope: !1954, file: !1693, line: 261, baseType: !1415, size: 32, offset: 224)
!2006 = !DIDerivedType(tag: DW_TAG_member, name: "rotinf", scope: !1954, file: !1693, line: 261, baseType: !1415, size: 32, offset: 256)
!2007 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1954, file: !1693, line: 263, baseType: !245, size: 32, offset: 288)
!2008 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !1954, file: !1693, line: 266, baseType: !245, size: 32, offset: 320)
!2009 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !1954, file: !1693, line: 267, baseType: !1415, size: 32, offset: 352)
!2010 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !1885, file: !1693, line: 347, baseType: !1961, size: 64, offset: 1856)
!2011 = !DIDerivedType(tag: DW_TAG_member, name: "act_plane_track", scope: !1885, file: !1693, line: 348, baseType: !2012, size: 64, offset: 1920)
!2012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2013, size: 64)
!2013 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingPlaneTrack", file: !1693, line: 205, baseType: !2014)
!2014 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingPlaneTrack", file: !1693, line: 186, size: 1024, elements: !2015)
!2015 = !{!2016, !2018, !2019, !2020, !2022, !2023, !2024, !2032, !2033, !2034, !2108, !2109}
!2016 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !2014, file: !1693, line: 187, baseType: !2017, size: 64)
!2017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2014, size: 64)
!2018 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !2014, file: !1693, line: 187, baseType: !2017, size: 64, offset: 64)
!2019 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !2014, file: !1693, line: 189, baseType: !1485, size: 512, offset: 128)
!2020 = !DIDerivedType(tag: DW_TAG_member, name: "point_tracks", scope: !2014, file: !1693, line: 191, baseType: !2021, size: 64, offset: 640)
!2021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1961, size: 64)
!2022 = !DIDerivedType(tag: DW_TAG_member, name: "point_tracksnr", scope: !2014, file: !1693, line: 193, baseType: !245, size: 32, offset: 704)
!2023 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !2014, file: !1693, line: 193, baseType: !245, size: 32, offset: 736)
!2024 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !2014, file: !1693, line: 195, baseType: !2025, size: 64, offset: 768)
!2025 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2026, size: 64)
!2026 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingPlaneMarker", file: !1693, line: 184, baseType: !2027)
!2027 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingPlaneMarker", file: !1693, line: 166, size: 320, elements: !2028)
!2028 = !{!2029, !2030, !2031}
!2029 = !DIDerivedType(tag: DW_TAG_member, name: "corners", scope: !2027, file: !1693, line: 180, baseType: !1983, size: 256)
!2030 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !2027, file: !1693, line: 182, baseType: !245, size: 32, offset: 256)
!2031 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !2027, file: !1693, line: 183, baseType: !245, size: 32, offset: 288)
!2032 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !2014, file: !1693, line: 196, baseType: !245, size: 32, offset: 832)
!2033 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !2014, file: !1693, line: 198, baseType: !245, size: 32, offset: 864)
!2034 = !DIDerivedType(tag: DW_TAG_member, name: "image", scope: !2014, file: !1693, line: 200, baseType: !2035, size: 64, offset: 896)
!2035 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2036, size: 64)
!2036 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !1824, line: 77, size: 15424, elements: !2037)
!2037 = !{!2038, !2039, !2040, !2043, !2046, !2047, !2050, !2052, !2053, !2054, !2055, !2056, !2057, !2058, !2059, !2060, !2061, !2062, !2063, !2064, !2065, !2066, !2068, !2069, !2083, !2084, !2085, !2086, !2087, !2088, !2089, !2090, !2091, !2092, !2094, !2095, !2096, !2097, !2098, !2102}
!2038 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !2036, file: !1824, line: 78, baseType: !1437, size: 960)
!2039 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !2036, file: !1824, line: 80, baseType: !1456, size: 8192, offset: 960)
!2040 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !2036, file: !1824, line: 82, baseType: !2041, size: 64, offset: 9152)
!2041 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2042, size: 64)
!2042 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !1824, line: 43, flags: DIFlagFwdDecl)
!2043 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !2036, file: !1824, line: 83, baseType: !2044, size: 64, offset: 9216)
!2044 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2045, size: 64)
!2045 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !1438, line: 46, flags: DIFlagFwdDecl)
!2046 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !2036, file: !1824, line: 86, baseType: !1822, size: 64, offset: 9280)
!2047 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !2036, file: !1824, line: 87, baseType: !2048, size: 64, offset: 9344)
!2048 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2049, size: 64)
!2049 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !1824, line: 44, flags: DIFlagFwdDecl)
!2050 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !2036, file: !1824, line: 89, baseType: !2051, size: 512, offset: 9408)
!2051 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2048, size: 512, elements: !1419)
!2052 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !2036, file: !1824, line: 90, baseType: !1418, size: 16, offset: 9920)
!2053 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !2036, file: !1824, line: 90, baseType: !1418, size: 16, offset: 9936)
!2054 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !2036, file: !1824, line: 92, baseType: !1418, size: 16, offset: 9952)
!2055 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !2036, file: !1824, line: 92, baseType: !1418, size: 16, offset: 9968)
!2056 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !2036, file: !1824, line: 93, baseType: !1418, size: 16, offset: 9984)
!2057 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !2036, file: !1824, line: 93, baseType: !1418, size: 16, offset: 10000)
!2058 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !2036, file: !1824, line: 94, baseType: !245, size: 32, offset: 10016)
!2059 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !2036, file: !1824, line: 97, baseType: !1418, size: 16, offset: 10048)
!2060 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !2036, file: !1824, line: 97, baseType: !1418, size: 16, offset: 10064)
!2061 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !2036, file: !1824, line: 98, baseType: !1418, size: 16, offset: 10080)
!2062 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !2036, file: !1824, line: 98, baseType: !1418, size: 16, offset: 10096)
!2063 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !2036, file: !1824, line: 99, baseType: !1418, size: 16, offset: 10112)
!2064 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !2036, file: !1824, line: 99, baseType: !1418, size: 16, offset: 10128)
!2065 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !2036, file: !1824, line: 100, baseType: !7, size: 32, offset: 10144)
!2066 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !2036, file: !1824, line: 101, baseType: !2067, size: 64, offset: 10176)
!2067 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!2068 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !2036, file: !1824, line: 103, baseType: !1463, size: 64, offset: 10240)
!2069 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !2036, file: !1824, line: 104, baseType: !2070, size: 64, offset: 10304)
!2070 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2071, size: 64)
!2071 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !1438, line: 159, size: 448, elements: !2072)
!2072 = !{!2073, !2075, !2076, !2078, !2079, !2081}
!2073 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !2071, file: !1438, line: 161, baseType: !2074, size: 64)
!2074 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !1565)
!2075 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !2071, file: !1438, line: 162, baseType: !2074, size: 64, offset: 64)
!2076 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !2071, file: !1438, line: 163, baseType: !2077, size: 32, offset: 128)
!2077 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1418, size: 32, elements: !1565)
!2078 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !2071, file: !1438, line: 164, baseType: !2077, size: 32, offset: 160)
!2079 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !2071, file: !1438, line: 165, baseType: !2080, size: 128, offset: 192)
!2080 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2067, size: 128, elements: !1565)
!2081 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !2071, file: !1438, line: 166, baseType: !2082, size: 128, offset: 320)
!2082 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2044, size: 128, elements: !1565)
!2083 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !2036, file: !1824, line: 107, baseType: !1415, size: 32, offset: 10368)
!2084 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !2036, file: !1824, line: 108, baseType: !245, size: 32, offset: 10400)
!2085 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !2036, file: !1824, line: 109, baseType: !1418, size: 16, offset: 10432)
!2086 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !2036, file: !1824, line: 110, baseType: !1418, size: 16, offset: 10448)
!2087 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !2036, file: !1824, line: 113, baseType: !245, size: 32, offset: 10464)
!2088 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !2036, file: !1824, line: 113, baseType: !245, size: 32, offset: 10496)
!2089 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !2036, file: !1824, line: 114, baseType: !1457, size: 8, offset: 10528)
!2090 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !2036, file: !1824, line: 114, baseType: !1457, size: 8, offset: 10536)
!2091 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !2036, file: !1824, line: 115, baseType: !1418, size: 16, offset: 10544)
!2092 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !2036, file: !1824, line: 116, baseType: !2093, size: 128, offset: 10560)
!2093 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1415, size: 128, elements: !1560)
!2094 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !2036, file: !1824, line: 119, baseType: !1415, size: 32, offset: 10688)
!2095 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !2036, file: !1824, line: 119, baseType: !1415, size: 32, offset: 10720)
!2096 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !2036, file: !1824, line: 122, baseType: !1856, size: 512, offset: 10752)
!2097 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !2036, file: !1824, line: 123, baseType: !1457, size: 8, offset: 11264)
!2098 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !2036, file: !1824, line: 125, baseType: !2099, size: 56, offset: 11272)
!2099 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1457, size: 56, elements: !2100)
!2100 = !{!2101}
!2101 = !DISubrange(count: 7)
!2102 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !2036, file: !1824, line: 126, baseType: !2103, size: 4096, offset: 11328)
!2103 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2104, size: 4096, elements: !1419)
!2104 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !1824, line: 69, baseType: !2105)
!2105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !1824, line: 67, size: 512, elements: !2106)
!2106 = !{!2107}
!2107 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !2105, file: !1824, line: 68, baseType: !1485, size: 512)
!2108 = !DIDerivedType(tag: DW_TAG_member, name: "image_opacity", scope: !2014, file: !1693, line: 201, baseType: !1415, size: 32, offset: 960)
!2109 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !2014, file: !1693, line: 204, baseType: !245, size: 32, offset: 992)
!2110 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !1885, file: !1693, line: 350, baseType: !1406, size: 128, offset: 1984)
!2111 = !DIDerivedType(tag: DW_TAG_member, name: "objectnr", scope: !1885, file: !1693, line: 351, baseType: !245, size: 32, offset: 2112)
!2112 = !DIDerivedType(tag: DW_TAG_member, name: "tot_object", scope: !1885, file: !1693, line: 351, baseType: !245, size: 32, offset: 2144)
!2113 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !1885, file: !1693, line: 353, baseType: !2114, size: 64, offset: 2176)
!2114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2115, size: 64)
!2115 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStats", file: !1693, line: 297, baseType: !2116)
!2116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStats", file: !1693, line: 295, size: 2048, elements: !2117)
!2117 = !{!2118}
!2118 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !2116, file: !1693, line: 296, baseType: !1552, size: 2048)
!2119 = !DIDerivedType(tag: DW_TAG_member, name: "dopesheet", scope: !1885, file: !1693, line: 355, baseType: !2120, size: 384, offset: 2240)
!2120 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingDopesheet", file: !1693, line: 338, baseType: !2121)
!2121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingDopesheet", file: !1693, line: 322, size: 384, elements: !2122)
!2122 = !{!2123, !2124, !2125, !2126, !2127, !2128, !2129}
!2123 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !2121, file: !1693, line: 323, baseType: !245, size: 32)
!2124 = !DIDerivedType(tag: DW_TAG_member, name: "sort_method", scope: !2121, file: !1693, line: 325, baseType: !1418, size: 16, offset: 32)
!2125 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !2121, file: !1693, line: 326, baseType: !1418, size: 16, offset: 48)
!2126 = !DIDerivedType(tag: DW_TAG_member, name: "coverage_segments", scope: !2121, file: !1693, line: 331, baseType: !1406, size: 128, offset: 64)
!2127 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !2121, file: !1693, line: 334, baseType: !1406, size: 128, offset: 192)
!2128 = !DIDerivedType(tag: DW_TAG_member, name: "tot_channel", scope: !2121, file: !1693, line: 335, baseType: !245, size: 32, offset: 320)
!2129 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !2121, file: !1693, line: 337, baseType: !245, size: 32, offset: 352)
!2130 = !DIDerivedType(tag: DW_TAG_member, name: "tracking_context", scope: !1868, file: !1637, line: 81, baseType: !1411, size: 64, offset: 12224)
!2131 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !1868, file: !1637, line: 85, baseType: !2132, size: 6208, offset: 12288)
!2132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipProxy", file: !1637, line: 55, size: 6208, elements: !2133)
!2133 = !{!2134, !2135, !2136, !2137, !2138}
!2134 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !2132, file: !1637, line: 56, baseType: !1811, size: 6144)
!2135 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !2132, file: !1637, line: 58, baseType: !1418, size: 16, offset: 6144)
!2136 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !2132, file: !1637, line: 59, baseType: !1418, size: 16, offset: 6160)
!2137 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flag", scope: !2132, file: !1637, line: 60, baseType: !1418, size: 16, offset: 6176)
!2138 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flag", scope: !2132, file: !1637, line: 61, baseType: !1418, size: 16, offset: 6192)
!2139 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1868, file: !1637, line: 86, baseType: !245, size: 32, offset: 18496)
!2140 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1868, file: !1637, line: 88, baseType: !245, size: 32, offset: 18528)
!2141 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1868, file: !1637, line: 90, baseType: !245, size: 32, offset: 18560)
!2142 = !DIDerivedType(tag: DW_TAG_member, name: "frame_offset", scope: !1868, file: !1637, line: 94, baseType: !245, size: 32, offset: 18592)
!2143 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !1868, file: !1637, line: 100, baseType: !1856, size: 512, offset: 18624)
!2144 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !1763, file: !1754, line: 154, baseType: !2145, size: 64, offset: 1664)
!2145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2146, size: 64)
!2146 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mask", file: !1641, line: 264, flags: DIFlagFwdDecl)
!2147 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !1763, file: !1754, line: 156, baseType: !1822, size: 64, offset: 1728)
!2148 = !DIDerivedType(tag: DW_TAG_member, name: "effect_fader", scope: !1763, file: !1754, line: 158, baseType: !1415, size: 32, offset: 1792)
!2149 = !DIDerivedType(tag: DW_TAG_member, name: "speed_fader", scope: !1763, file: !1754, line: 159, baseType: !1415, size: 32, offset: 1824)
!2150 = !DIDerivedType(tag: DW_TAG_member, name: "seq1", scope: !1763, file: !1754, line: 162, baseType: !1766, size: 64, offset: 1856)
!2151 = !DIDerivedType(tag: DW_TAG_member, name: "seq2", scope: !1763, file: !1754, line: 162, baseType: !1766, size: 64, offset: 1920)
!2152 = !DIDerivedType(tag: DW_TAG_member, name: "seq3", scope: !1763, file: !1754, line: 162, baseType: !1766, size: 64, offset: 1984)
!2153 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !1763, file: !1754, line: 164, baseType: !1406, size: 128, offset: 2048)
!2154 = !DIDerivedType(tag: DW_TAG_member, name: "sound", scope: !1763, file: !1754, line: 166, baseType: !2155, size: 64, offset: 2176)
!2155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2156, size: 64)
!2156 = !DICompositeType(tag: DW_TAG_structure_type, name: "bSound", file: !1754, line: 51, flags: DIFlagFwdDecl)
!2157 = !DIDerivedType(tag: DW_TAG_member, name: "scene_sound", scope: !1763, file: !1754, line: 167, baseType: !1411, size: 64, offset: 2240)
!2158 = !DIDerivedType(tag: DW_TAG_member, name: "volume", scope: !1763, file: !1754, line: 168, baseType: !1415, size: 32, offset: 2304)
!2159 = !DIDerivedType(tag: DW_TAG_member, name: "pitch", scope: !1763, file: !1754, line: 170, baseType: !1415, size: 32, offset: 2336)
!2160 = !DIDerivedType(tag: DW_TAG_member, name: "pan", scope: !1763, file: !1754, line: 170, baseType: !1415, size: 32, offset: 2368)
!2161 = !DIDerivedType(tag: DW_TAG_member, name: "strobe", scope: !1763, file: !1754, line: 171, baseType: !1415, size: 32, offset: 2400)
!2162 = !DIDerivedType(tag: DW_TAG_member, name: "effectdata", scope: !1763, file: !1754, line: 173, baseType: !1411, size: 64, offset: 2432)
!2163 = !DIDerivedType(tag: DW_TAG_member, name: "anim_startofs", scope: !1763, file: !1754, line: 175, baseType: !245, size: 32, offset: 2496)
!2164 = !DIDerivedType(tag: DW_TAG_member, name: "anim_endofs", scope: !1763, file: !1754, line: 176, baseType: !245, size: 32, offset: 2528)
!2165 = !DIDerivedType(tag: DW_TAG_member, name: "blend_mode", scope: !1763, file: !1754, line: 179, baseType: !245, size: 32, offset: 2560)
!2166 = !DIDerivedType(tag: DW_TAG_member, name: "blend_opacity", scope: !1763, file: !1754, line: 180, baseType: !1415, size: 32, offset: 2592)
!2167 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !1763, file: !1754, line: 183, baseType: !245, size: 32, offset: 2624)
!2168 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !1763, file: !1754, line: 185, baseType: !1457, size: 8, offset: 2656)
