; ModuleID = 'blender/source/blender/blenkernel/intern/tracking_util.c'
source_filename = "blender/source/blender/blenkernel/intern/tracking_util.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.TracksMap = type { [64 x i8], i8, i32, i32, i8*, %struct.MovieTrackingTrack*, %struct.GHash*, i32, i32 }
%struct.MovieTrackingTrack = type { %struct.MovieTrackingTrack*, %struct.MovieTrackingTrack*, [64 x i8], [2 x float], [2 x float], [2 x float], [2 x float], [2 x float], i32, i32, %struct.MovieTrackingMarker*, [3 x float], float, i32, i32, i32, [3 x float], i16, i16, i16, i16, i32, float, %struct.bGPdata*, float, float }
%struct.MovieTrackingMarker = type { [2 x float], [4 x [2 x float]], [2 x float], [2 x float], i32, i32 }
%struct.bGPdata = type opaque
%struct.GHash = type opaque
%struct.MovieTracking = type { %struct.MovieTrackingSettings, %struct.MovieTrackingCamera, %struct.ListBase, %struct.ListBase, %struct.MovieTrackingReconstruction, %struct.MovieTrackingStabilization, %struct.MovieTrackingTrack*, %struct.MovieTrackingPlaneTrack*, %struct.ListBase, i32, i32, %struct.MovieTrackingStats*, %struct.MovieTrackingDopesheet }
%struct.MovieTrackingSettings = type { i32, i16, i16, float, i16, i16, i16, i16, i16, i16, float, i16, i16, i32, i32, i32, i16, i16, float, i32, i32, float, float, i32 }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !21, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "blender/source/blender/blenkernel/intern/tracking_util.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!2 = !{!3, !12, !17}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 371, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "blender/source/blender/makesdna/DNA_tracking_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9, !10, !11}
!7 = !DIEnumerator(name: "MARKER_DISABLED", value: 1, isUnsigned: true)
!8 = !DIEnumerator(name: "MARKER_TRACKED", value: 2, isUnsigned: true)
!9 = !DIEnumerator(name: "MARKER_GRAPH_SEL_X", value: 4, isUnsigned: true)
!10 = !DIEnumerator(name: "MARKER_GRAPH_SEL_Y", value: 8, isUnsigned: true)
!11 = !DIEnumerator(name: "MARKER_GRAPH_SEL", value: 12, isUnsigned: true)
!12 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !13, line: 36, baseType: !5, size: 32, elements: !14)
!13 = !DIFile(filename: "blender/extern/libmv/intern/camera_intrinsics.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!14 = !{!15, !16}
!15 = !DIEnumerator(name: "LIBMV_DISTORTION_MODEL_POLYNOMIAL", value: 0, isUnsigned: true)
!16 = !DIEnumerator(name: "LIBMV_DISTORTION_MODEL_DIVISION", value: 1, isUnsigned: true)
!17 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 359, baseType: !5, size: 32, elements: !18)
!18 = !{!19, !20}
!19 = !DIEnumerator(name: "TRACKING_DISTORTION_MODEL_POLYNOMIAL", value: 0, isUnsigned: true)
!20 = !DIEnumerator(name: "TRACKING_DISTORTION_MODEL_DIVISION", value: 1, isUnsigned: true)
!21 = !{!22, !23}
!22 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!23 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!24 = !{i32 7, !"Dwarf Version", i32 4}
!25 = !{i32 2, !"Debug Info Version", i32 3}
!26 = !{i32 1, !"wchar_size", i32 4}
!27 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!28 = distinct !DISubprogram(name: "tracks_map_new", scope: !1, file: !1, line: 58, type: !29, scopeLine: 59, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !117)
!29 = !DISubroutineType(types: !30)
!30 = !{!31, !115, !41, !22, !22}
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!32 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "TracksMap", file: !33, line: 48, size: 896, elements: !34)
!33 = !DIFile(filename: "blender/source/blender/blenkernel/tracking_private.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!34 = !{!35, !40, !42, !43, !44, !46, !101, !105, !106}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "object_name", scope: !32, file: !33, line: 49, baseType: !36, size: 512)
!36 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 512, elements: !38)
!37 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!38 = !{!39}
!39 = !DISubrange(count: 64)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "is_camera", scope: !32, file: !33, line: 50, baseType: !41, size: 8, offset: 512)
!41 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "num_tracks", scope: !32, file: !33, line: 52, baseType: !22, size: 32, offset: 544)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_size", scope: !32, file: !33, line: 53, baseType: !22, size: 32, offset: 576)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !32, file: !33, line: 55, baseType: !45, size: 64, offset: 640)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "tracks", scope: !32, file: !33, line: 56, baseType: !47, size: 64, offset: 704)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingTrack", file: !4, line: 164, baseType: !49)
!49 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingTrack", file: !4, line: 108, size: 1664, elements: !50)
!50 = !{!51, !53, !54, !55, !60, !61, !62, !63, !64, !65, !66, !80, !84, !85, !86, !87, !88, !89, !91, !92, !93, !94, !95, !96, !99, !100}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !49, file: !4, line: 109, baseType: !52, size: 64)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !49, file: !4, line: 109, baseType: !52, size: 64, offset: 64)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !49, file: !4, line: 111, baseType: !36, size: 512, offset: 128)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "pat_min", scope: !49, file: !4, line: 119, baseType: !56, size: 64, offset: 640)
!56 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 64, elements: !58)
!57 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!58 = !{!59}
!59 = !DISubrange(count: 2)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "pat_max", scope: !49, file: !4, line: 119, baseType: !56, size: 64, offset: 704)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !49, file: !4, line: 125, baseType: !56, size: 64, offset: 768)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !49, file: !4, line: 125, baseType: !56, size: 64, offset: 832)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !49, file: !4, line: 127, baseType: !56, size: 64, offset: 896)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !49, file: !4, line: 130, baseType: !22, size: 32, offset: 960)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !49, file: !4, line: 131, baseType: !22, size: 32, offset: 992)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !49, file: !4, line: 132, baseType: !67, size: 64, offset: 1024)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingMarker", file: !4, line: 106, baseType: !69)
!69 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingMarker", file: !4, line: 81, size: 512, elements: !70)
!70 = !{!71, !72, !76, !77, !78, !79}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !69, file: !4, line: 82, baseType: !56, size: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_corners", scope: !69, file: !4, line: 97, baseType: !73, size: 256, offset: 64)
!73 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 256, elements: !74)
!74 = !{!75, !59}
!75 = !DISubrange(count: 4)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !69, file: !4, line: 102, baseType: !56, size: 64, offset: 320)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !69, file: !4, line: 102, baseType: !56, size: 64, offset: 384)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !69, file: !4, line: 104, baseType: !22, size: 32, offset: 448)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !69, file: !4, line: 105, baseType: !22, size: 32, offset: 480)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "bundle_pos", scope: !49, file: !4, line: 135, baseType: !81, size: 96, offset: 1088)
!81 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 96, elements: !82)
!82 = !{!83}
!83 = !DISubrange(count: 3)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !49, file: !4, line: 136, baseType: !57, size: 32, offset: 1184)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !49, file: !4, line: 139, baseType: !22, size: 32, offset: 1216)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "pat_flag", scope: !49, file: !4, line: 139, baseType: !22, size: 32, offset: 1248)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "search_flag", scope: !49, file: !4, line: 139, baseType: !22, size: 32, offset: 1280)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !49, file: !4, line: 140, baseType: !81, size: 96, offset: 1312)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "frames_limit", scope: !49, file: !4, line: 143, baseType: !90, size: 16, offset: 1408)
!90 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !49, file: !4, line: 144, baseType: !90, size: 16, offset: 1424)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_match", scope: !49, file: !4, line: 145, baseType: !90, size: 16, offset: 1440)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "motion_model", scope: !49, file: !4, line: 148, baseType: !90, size: 16, offset: 1456)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm_flag", scope: !49, file: !4, line: 149, baseType: !22, size: 32, offset: 1472)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "minimum_correlation", scope: !49, file: !4, line: 150, baseType: !57, size: 32, offset: 1504)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !49, file: !4, line: 152, baseType: !97, size: 64, offset: 1536)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!98 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !4, line: 45, flags: DIFlagFwdDecl)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !49, file: !4, line: 163, baseType: !57, size: 32, offset: 1600)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !49, file: !4, line: 163, baseType: !57, size: 32, offset: 1632)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !32, file: !33, line: 58, baseType: !102, size: 64, offset: 768)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !104, line: 48, flags: DIFlagFwdDecl)
!104 = !DIFile(filename: "blender/source/blender/blenlib/BLI_ghash.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!105 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !32, file: !33, line: 60, baseType: !22, size: 32, offset: 832)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "spin_lock", scope: !32, file: !33, line: 63, baseType: !107, size: 32, offset: 864)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "SpinLock", file: !108, line: 127, baseType: !109)
!108 = !DIFile(filename: "blender/source/blender/blenlib/BLI_threads.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "spec_null_spinlock_t", file: !110, line: 9, baseType: !111)
!110 = !DIFile(filename: "include/spec_pthread.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !112, line: 26, baseType: !113)
!112 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !114, line: 42, baseType: !5)
!114 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !37)
!117 = !{}
!118 = !DILocalVariable(name: "object_name", arg: 1, scope: !28, file: !1, line: 58, type: !115)
!119 = !DILocation(line: 58, column: 39, scope: !28)
!120 = !DILocalVariable(name: "is_camera", arg: 2, scope: !28, file: !1, line: 58, type: !41)
!121 = !DILocation(line: 58, column: 57, scope: !28)
!122 = !DILocalVariable(name: "num_tracks", arg: 3, scope: !28, file: !1, line: 58, type: !22)
!123 = !DILocation(line: 58, column: 72, scope: !28)
!124 = !DILocalVariable(name: "customdata_size", arg: 4, scope: !28, file: !1, line: 58, type: !22)
!125 = !DILocation(line: 58, column: 88, scope: !28)
!126 = !DILocalVariable(name: "map", scope: !28, file: !1, line: 60, type: !127)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "TracksMap", file: !33, line: 64, baseType: !32)
!129 = !DILocation(line: 60, column: 13, scope: !28)
!130 = !DILocation(line: 60, column: 19, scope: !28)
!131 = !DILocation(line: 62, column: 14, scope: !28)
!132 = !DILocation(line: 62, column: 19, scope: !28)
!133 = !DILocation(line: 62, column: 32, scope: !28)
!134 = !DILocation(line: 62, column: 2, scope: !28)
!135 = !DILocation(line: 63, column: 19, scope: !28)
!136 = !DILocation(line: 63, column: 2, scope: !28)
!137 = !DILocation(line: 63, column: 7, scope: !28)
!138 = !DILocation(line: 63, column: 17, scope: !28)
!139 = !DILocation(line: 65, column: 20, scope: !28)
!140 = !DILocation(line: 65, column: 2, scope: !28)
!141 = !DILocation(line: 65, column: 7, scope: !28)
!142 = !DILocation(line: 65, column: 18, scope: !28)
!143 = !DILocation(line: 66, column: 25, scope: !28)
!144 = !DILocation(line: 66, column: 2, scope: !28)
!145 = !DILocation(line: 66, column: 7, scope: !28)
!146 = !DILocation(line: 66, column: 23, scope: !28)
!147 = !DILocation(line: 68, column: 16, scope: !28)
!148 = !DILocation(line: 68, column: 57, scope: !28)
!149 = !DILocation(line: 68, column: 55, scope: !28)
!150 = !DILocation(line: 68, column: 2, scope: !28)
!151 = !DILocation(line: 68, column: 7, scope: !28)
!152 = !DILocation(line: 68, column: 14, scope: !28)
!153 = !DILocation(line: 70, column: 6, scope: !154)
!154 = distinct !DILexicalBlock(scope: !28, file: !1, line: 70, column: 6)
!155 = !DILocation(line: 70, column: 6, scope: !28)
!156 = !DILocation(line: 71, column: 21, scope: !154)
!157 = !DILocation(line: 71, column: 33, scope: !154)
!158 = !DILocation(line: 71, column: 51, scope: !154)
!159 = !DILocation(line: 71, column: 49, scope: !154)
!160 = !DILocation(line: 71, column: 3, scope: !154)
!161 = !DILocation(line: 71, column: 8, scope: !154)
!162 = !DILocation(line: 71, column: 19, scope: !154)
!163 = !DILocation(line: 73, column: 14, scope: !28)
!164 = !DILocation(line: 73, column: 2, scope: !28)
!165 = !DILocation(line: 73, column: 7, scope: !28)
!166 = !DILocation(line: 73, column: 12, scope: !28)
!167 = !DILocation(line: 75, column: 17, scope: !28)
!168 = !DILocation(line: 75, column: 22, scope: !28)
!169 = !DILocation(line: 75, column: 2, scope: !28)
!170 = !DILocation(line: 77, column: 9, scope: !28)
!171 = !DILocation(line: 77, column: 2, scope: !28)
!172 = distinct !DISubprogram(name: "tracks_map_get_size", scope: !1, file: !1, line: 80, type: !173, scopeLine: 81, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !117)
!173 = !DISubroutineType(types: !174)
!174 = !{!22, !127}
!175 = !DILocalVariable(name: "map", arg: 1, scope: !172, file: !1, line: 80, type: !127)
!176 = !DILocation(line: 80, column: 36, scope: !172)
!177 = !DILocation(line: 82, column: 9, scope: !172)
!178 = !DILocation(line: 82, column: 14, scope: !172)
!179 = !DILocation(line: 82, column: 2, scope: !172)
!180 = distinct !DISubprogram(name: "tracks_map_get_indexed_element", scope: !1, file: !1, line: 85, type: !181, scopeLine: 86, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !117)
!181 = !DISubroutineType(types: !182)
!182 = !{null, !127, !22, !183, !184}
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!186 = !DILocalVariable(name: "map", arg: 1, scope: !180, file: !1, line: 85, type: !127)
!187 = !DILocation(line: 85, column: 48, scope: !180)
!188 = !DILocalVariable(name: "index", arg: 2, scope: !180, file: !1, line: 85, type: !22)
!189 = !DILocation(line: 85, column: 57, scope: !180)
!190 = !DILocalVariable(name: "track", arg: 3, scope: !180, file: !1, line: 85, type: !183)
!191 = !DILocation(line: 85, column: 85, scope: !180)
!192 = !DILocalVariable(name: "customdata", arg: 4, scope: !180, file: !1, line: 85, type: !184)
!193 = !DILocation(line: 85, column: 99, scope: !180)
!194 = !DILocation(line: 87, column: 12, scope: !180)
!195 = !DILocation(line: 87, column: 17, scope: !180)
!196 = !DILocation(line: 87, column: 24, scope: !180)
!197 = !DILocation(line: 87, column: 3, scope: !180)
!198 = !DILocation(line: 87, column: 9, scope: !180)
!199 = !DILocation(line: 89, column: 6, scope: !200)
!200 = distinct !DILexicalBlock(scope: !180, file: !1, line: 89, column: 6)
!201 = !DILocation(line: 89, column: 11, scope: !200)
!202 = !DILocation(line: 89, column: 6, scope: !180)
!203 = !DILocation(line: 90, column: 18, scope: !200)
!204 = !DILocation(line: 90, column: 23, scope: !200)
!205 = !DILocation(line: 90, column: 34, scope: !200)
!206 = !DILocation(line: 90, column: 42, scope: !200)
!207 = !DILocation(line: 90, column: 47, scope: !200)
!208 = !DILocation(line: 90, column: 40, scope: !200)
!209 = !DILocation(line: 90, column: 4, scope: !200)
!210 = !DILocation(line: 90, column: 15, scope: !200)
!211 = !DILocation(line: 90, column: 3, scope: !200)
!212 = !DILocation(line: 91, column: 1, scope: !180)
!213 = distinct !DISubprogram(name: "tracks_map_insert", scope: !1, file: !1, line: 93, type: !214, scopeLine: 94, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !117)
!214 = !DISubroutineType(types: !215)
!215 = !{null, !127, !47, !185}
!216 = !DILocalVariable(name: "map", arg: 1, scope: !213, file: !1, line: 93, type: !127)
!217 = !DILocation(line: 93, column: 35, scope: !213)
!218 = !DILocalVariable(name: "track", arg: 2, scope: !213, file: !1, line: 93, type: !47)
!219 = !DILocation(line: 93, column: 60, scope: !213)
!220 = !DILocalVariable(name: "customdata", arg: 3, scope: !213, file: !1, line: 93, type: !185)
!221 = !DILocation(line: 93, column: 73, scope: !213)
!222 = !DILocalVariable(name: "new_track", scope: !213, file: !1, line: 95, type: !48)
!223 = !DILocation(line: 95, column: 21, scope: !213)
!224 = !DILocation(line: 95, column: 34, scope: !213)
!225 = !DILocation(line: 95, column: 33, scope: !213)
!226 = !DILocation(line: 97, column: 22, scope: !213)
!227 = !DILocation(line: 97, column: 46, scope: !213)
!228 = !DILocation(line: 97, column: 36, scope: !213)
!229 = !DILocation(line: 97, column: 12, scope: !213)
!230 = !DILocation(line: 97, column: 20, scope: !213)
!231 = !DILocation(line: 99, column: 2, scope: !213)
!232 = !DILocation(line: 99, column: 7, scope: !213)
!233 = !DILocation(line: 99, column: 14, scope: !213)
!234 = !DILocation(line: 99, column: 19, scope: !213)
!235 = !DILocation(line: 99, column: 26, scope: !213)
!236 = !DILocation(line: 101, column: 6, scope: !237)
!237 = distinct !DILexicalBlock(scope: !213, file: !1, line: 101, column: 6)
!238 = !DILocation(line: 101, column: 6, scope: !213)
!239 = !DILocation(line: 102, column: 11, scope: !237)
!240 = !DILocation(line: 102, column: 16, scope: !237)
!241 = !DILocation(line: 102, column: 27, scope: !237)
!242 = !DILocation(line: 102, column: 32, scope: !237)
!243 = !DILocation(line: 102, column: 38, scope: !237)
!244 = !DILocation(line: 102, column: 43, scope: !237)
!245 = !DILocation(line: 102, column: 36, scope: !237)
!246 = !DILocation(line: 102, column: 61, scope: !237)
!247 = !DILocation(line: 102, column: 73, scope: !237)
!248 = !DILocation(line: 102, column: 78, scope: !237)
!249 = !DILocation(line: 102, column: 3, scope: !237)
!250 = !DILocation(line: 104, column: 19, scope: !213)
!251 = !DILocation(line: 104, column: 24, scope: !213)
!252 = !DILocation(line: 104, column: 31, scope: !213)
!253 = !DILocation(line: 104, column: 36, scope: !213)
!254 = !DILocation(line: 104, column: 43, scope: !213)
!255 = !DILocation(line: 104, column: 48, scope: !213)
!256 = !DILocation(line: 104, column: 30, scope: !213)
!257 = !DILocation(line: 104, column: 54, scope: !213)
!258 = !DILocation(line: 104, column: 2, scope: !213)
!259 = !DILocation(line: 106, column: 2, scope: !213)
!260 = !DILocation(line: 106, column: 7, scope: !213)
!261 = !DILocation(line: 106, column: 10, scope: !213)
!262 = !DILocation(line: 107, column: 1, scope: !213)
!263 = distinct !DISubprogram(name: "tracks_map_merge", scope: !1, file: !1, line: 109, type: !264, scopeLine: 110, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !117)
!264 = !DISubroutineType(types: !265)
!265 = !{null, !127, !266}
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTracking", file: !4, line: 356, baseType: !268)
!268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTracking", file: !4, line: 340, size: 2624, elements: !269)
!269 = !{!270, !298, !316, !323, !324, !341, !356, !357, !384, !385, !386, !387, !396}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "settings", scope: !268, file: !4, line: 341, baseType: !271, size: 576)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingSettings", file: !4, line: 251, baseType: !272)
!272 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingSettings", file: !4, line: 207, size: 576, elements: !273)
!273 = !{!274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !272, file: !4, line: 208, baseType: !22, size: 32)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "default_motion_model", scope: !272, file: !4, line: 211, baseType: !90, size: 16, offset: 32)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "default_algorithm_flag", scope: !272, file: !4, line: 212, baseType: !90, size: 16, offset: 48)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "default_minimum_correlation", scope: !272, file: !4, line: 213, baseType: !57, size: 32, offset: 64)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_size", scope: !272, file: !4, line: 214, baseType: !90, size: 16, offset: 96)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "default_search_size", scope: !272, file: !4, line: 215, baseType: !90, size: 16, offset: 112)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "default_frames_limit", scope: !272, file: !4, line: 216, baseType: !90, size: 16, offset: 128)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "default_margin", scope: !272, file: !4, line: 217, baseType: !90, size: 16, offset: 144)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_match", scope: !272, file: !4, line: 218, baseType: !90, size: 16, offset: 160)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "default_flag", scope: !272, file: !4, line: 219, baseType: !90, size: 16, offset: 176)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "default_weight", scope: !272, file: !4, line: 220, baseType: !57, size: 32, offset: 192)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "motion_flag", scope: !272, file: !4, line: 222, baseType: !90, size: 16, offset: 224)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "speed", scope: !272, file: !4, line: 225, baseType: !90, size: 16, offset: 240)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe1", scope: !272, file: !4, line: 228, baseType: !22, size: 32, offset: 256)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe2", scope: !272, file: !4, line: 229, baseType: !22, size: 32, offset: 288)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction_flag", scope: !272, file: !4, line: 233, baseType: !22, size: 32, offset: 320)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "refine_camera_intrinsics", scope: !272, file: !4, line: 236, baseType: !90, size: 16, offset: 352)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !272, file: !4, line: 236, baseType: !90, size: 16, offset: 368)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !272, file: !4, line: 241, baseType: !57, size: 32, offset: 384)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "clean_frames", scope: !272, file: !4, line: 244, baseType: !22, size: 32, offset: 416)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "clean_action", scope: !272, file: !4, line: 244, baseType: !22, size: 32, offset: 448)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "clean_error", scope: !272, file: !4, line: 245, baseType: !57, size: 32, offset: 480)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "object_distance", scope: !272, file: !4, line: 248, baseType: !57, size: 32, offset: 512)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !272, file: !4, line: 250, baseType: !22, size: 32, offset: 544)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !268, file: !4, line: 342, baseType: !299, size: 448, offset: 576)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingCamera", file: !4, line: 79, baseType: !300)
!300 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingCamera", file: !4, line: 61, size: 448, elements: !301)
!301 = !{!302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "intrinsics", scope: !300, file: !4, line: 62, baseType: !185, size: 64)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_model", scope: !300, file: !4, line: 64, baseType: !90, size: 16, offset: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !300, file: !4, line: 65, baseType: !90, size: 16, offset: 80)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "sensor_width", scope: !300, file: !4, line: 67, baseType: !57, size: 32, offset: 96)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_aspect", scope: !300, file: !4, line: 68, baseType: !57, size: 32, offset: 128)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "focal", scope: !300, file: !4, line: 69, baseType: !57, size: 32, offset: 160)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !300, file: !4, line: 70, baseType: !90, size: 16, offset: 192)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !300, file: !4, line: 71, baseType: !90, size: 16, offset: 208)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "principal", scope: !300, file: !4, line: 72, baseType: !56, size: 64, offset: 224)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "k1", scope: !300, file: !4, line: 75, baseType: !57, size: 32, offset: 288)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "k2", scope: !300, file: !4, line: 75, baseType: !57, size: 32, offset: 320)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "k3", scope: !300, file: !4, line: 75, baseType: !57, size: 32, offset: 352)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "division_k1", scope: !300, file: !4, line: 78, baseType: !57, size: 32, offset: 384)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "division_k2", scope: !300, file: !4, line: 78, baseType: !57, size: 32, offset: 416)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "tracks", scope: !268, file: !4, line: 343, baseType: !317, size: 128, offset: 1024)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !318, line: 71, baseType: !319)
!318 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!319 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !318, line: 69, size: 128, elements: !320)
!320 = !{!321, !322}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !319, file: !318, line: 70, baseType: !185, size: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !319, file: !318, line: 70, baseType: !185, size: 64, offset: 64)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "plane_tracks", scope: !268, file: !4, line: 344, baseType: !317, size: 128, offset: 1152)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction", scope: !268, file: !4, line: 345, baseType: !325, size: 192, offset: 1280)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingReconstruction", file: !4, line: 278, baseType: !326)
!326 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingReconstruction", file: !4, line: 270, size: 192, elements: !327)
!327 = !{!328, !329, !330, !331, !332}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !326, file: !4, line: 271, baseType: !22, size: 32)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !326, file: !4, line: 273, baseType: !57, size: 32, offset: 32)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "last_camera", scope: !326, file: !4, line: 275, baseType: !22, size: 32, offset: 64)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "camnr", scope: !326, file: !4, line: 276, baseType: !22, size: 32, offset: 96)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "cameras", scope: !326, file: !4, line: 277, baseType: !333, size: 64, offset: 128)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64)
!334 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieReconstructedCamera", file: !4, line: 55, size: 576, elements: !335)
!335 = !{!336, !337, !338}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !334, file: !4, line: 56, baseType: !22, size: 32)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !334, file: !4, line: 57, baseType: !57, size: 32, offset: 32)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !334, file: !4, line: 58, baseType: !339, size: 512, offset: 64)
!339 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 512, elements: !340)
!340 = !{!75, !75}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "stabilization", scope: !268, file: !4, line: 346, baseType: !342, size: 384, offset: 1472)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStabilization", file: !4, line: 268, baseType: !343)
!343 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStabilization", file: !4, line: 253, size: 384, elements: !344)
!344 = !{!345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !343, file: !4, line: 254, baseType: !22, size: 32)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "tot_track", scope: !343, file: !4, line: 255, baseType: !22, size: 32, offset: 32)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !343, file: !4, line: 255, baseType: !22, size: 32, offset: 64)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "maxscale", scope: !343, file: !4, line: 258, baseType: !57, size: 32, offset: 96)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "rot_track", scope: !343, file: !4, line: 259, baseType: !47, size: 64, offset: 128)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "locinf", scope: !343, file: !4, line: 261, baseType: !57, size: 32, offset: 192)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "scaleinf", scope: !343, file: !4, line: 261, baseType: !57, size: 32, offset: 224)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "rotinf", scope: !343, file: !4, line: 261, baseType: !57, size: 32, offset: 256)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !343, file: !4, line: 263, baseType: !22, size: 32, offset: 288)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !343, file: !4, line: 266, baseType: !22, size: 32, offset: 320)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !343, file: !4, line: 267, baseType: !57, size: 32, offset: 352)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !268, file: !4, line: 347, baseType: !47, size: 64, offset: 1856)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "act_plane_track", scope: !268, file: !4, line: 348, baseType: !358, size: 64, offset: 1920)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingPlaneTrack", file: !4, line: 205, baseType: !360)
!360 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingPlaneTrack", file: !4, line: 186, size: 1024, elements: !361)
!361 = !{!362, !364, !365, !366, !367, !368, !369, !377, !378, !379, !382, !383}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !360, file: !4, line: 187, baseType: !363, size: 64)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !360, file: !4, line: 187, baseType: !363, size: 64, offset: 64)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !360, file: !4, line: 189, baseType: !36, size: 512, offset: 128)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "point_tracks", scope: !360, file: !4, line: 191, baseType: !183, size: 64, offset: 640)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "point_tracksnr", scope: !360, file: !4, line: 193, baseType: !22, size: 32, offset: 704)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !360, file: !4, line: 193, baseType: !22, size: 32, offset: 736)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !360, file: !4, line: 195, baseType: !370, size: 64, offset: 768)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingPlaneMarker", file: !4, line: 184, baseType: !372)
!372 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingPlaneMarker", file: !4, line: 166, size: 320, elements: !373)
!373 = !{!374, !375, !376}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "corners", scope: !372, file: !4, line: 180, baseType: !73, size: 256)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !372, file: !4, line: 182, baseType: !22, size: 32, offset: 256)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !372, file: !4, line: 183, baseType: !22, size: 32, offset: 288)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !360, file: !4, line: 196, baseType: !22, size: 32, offset: 832)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !360, file: !4, line: 198, baseType: !22, size: 32, offset: 864)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "image", scope: !360, file: !4, line: 200, baseType: !380, size: 64, offset: 896)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!381 = !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !4, line: 47, flags: DIFlagFwdDecl)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "image_opacity", scope: !360, file: !4, line: 201, baseType: !57, size: 32, offset: 960)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !360, file: !4, line: 204, baseType: !22, size: 32, offset: 992)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !268, file: !4, line: 350, baseType: !317, size: 128, offset: 1984)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "objectnr", scope: !268, file: !4, line: 351, baseType: !22, size: 32, offset: 2112)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "tot_object", scope: !268, file: !4, line: 351, baseType: !22, size: 32, offset: 2144)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !268, file: !4, line: 353, baseType: !388, size: 64, offset: 2176)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStats", file: !4, line: 297, baseType: !390)
!390 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStats", file: !4, line: 295, size: 2048, elements: !391)
!391 = !{!392}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !390, file: !4, line: 296, baseType: !393, size: 2048)
!393 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 2048, elements: !394)
!394 = !{!395}
!395 = !DISubrange(count: 256)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "dopesheet", scope: !268, file: !4, line: 355, baseType: !397, size: 384, offset: 2240)
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingDopesheet", file: !4, line: 338, baseType: !398)
!398 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingDopesheet", file: !4, line: 322, size: 384, elements: !399)
!399 = !{!400, !401, !402, !403, !404, !405, !406}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !398, file: !4, line: 323, baseType: !22, size: 32)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "sort_method", scope: !398, file: !4, line: 325, baseType: !90, size: 16, offset: 32)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !398, file: !4, line: 326, baseType: !90, size: 16, offset: 48)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "coverage_segments", scope: !398, file: !4, line: 331, baseType: !317, size: 128, offset: 64)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !398, file: !4, line: 334, baseType: !317, size: 128, offset: 192)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "tot_channel", scope: !398, file: !4, line: 335, baseType: !22, size: 32, offset: 320)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !398, file: !4, line: 337, baseType: !22, size: 32, offset: 352)
!407 = !DILocalVariable(name: "map", arg: 1, scope: !263, file: !1, line: 109, type: !127)
!408 = !DILocation(line: 109, column: 34, scope: !263)
!409 = !DILocalVariable(name: "tracking", arg: 2, scope: !263, file: !1, line: 109, type: !266)
!410 = !DILocation(line: 109, column: 54, scope: !263)
!411 = !DILocalVariable(name: "track", scope: !263, file: !1, line: 111, type: !47)
!412 = !DILocation(line: 111, column: 22, scope: !263)
!413 = !DILocalVariable(name: "tracks", scope: !263, file: !1, line: 112, type: !317)
!414 = !DILocation(line: 112, column: 11, scope: !263)
!415 = !DILocalVariable(name: "new_tracks", scope: !263, file: !1, line: 112, type: !317)
!416 = !DILocation(line: 112, column: 34, scope: !263)
!417 = !DILocalVariable(name: "old_tracks", scope: !263, file: !1, line: 113, type: !418)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!419 = !DILocation(line: 113, column: 12, scope: !263)
!420 = !DILocalVariable(name: "a", scope: !263, file: !1, line: 114, type: !22)
!421 = !DILocation(line: 114, column: 6, scope: !263)
!422 = !DILocation(line: 116, column: 6, scope: !423)
!423 = distinct !DILexicalBlock(scope: !263, file: !1, line: 116, column: 6)
!424 = !DILocation(line: 116, column: 11, scope: !423)
!425 = !DILocation(line: 116, column: 6, scope: !263)
!426 = !DILocation(line: 117, column: 17, scope: !427)
!427 = distinct !DILexicalBlock(scope: !423, file: !1, line: 116, column: 22)
!428 = !DILocation(line: 117, column: 27, scope: !427)
!429 = !DILocation(line: 117, column: 14, scope: !427)
!430 = !DILocation(line: 118, column: 2, scope: !427)
!431 = !DILocalVariable(name: "object", scope: !432, file: !1, line: 120, type: !433)
!432 = distinct !DILexicalBlock(scope: !423, file: !1, line: 119, column: 7)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingObject", file: !4, line: 293, baseType: !435)
!435 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingObject", file: !4, line: 280, size: 1216, elements: !436)
!436 = !{!437, !439, !440, !441, !442, !443, !444, !445, !446, !447}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !435, file: !4, line: 281, baseType: !438, size: 64)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !435, file: !4, line: 281, baseType: !438, size: 64, offset: 64)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !435, file: !4, line: 283, baseType: !36, size: 512, offset: 128)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !435, file: !4, line: 284, baseType: !22, size: 32, offset: 640)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !435, file: !4, line: 285, baseType: !57, size: 32, offset: 672)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "tracks", scope: !435, file: !4, line: 287, baseType: !317, size: 128, offset: 704)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "plane_tracks", scope: !435, file: !4, line: 288, baseType: !317, size: 128, offset: 832)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction", scope: !435, file: !4, line: 289, baseType: !325, size: 192, offset: 960)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe1", scope: !435, file: !4, line: 292, baseType: !22, size: 32, offset: 1152)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe2", scope: !435, file: !4, line: 292, baseType: !22, size: 32, offset: 1184)
!448 = !DILocation(line: 120, column: 24, scope: !432)
!449 = !DILocation(line: 120, column: 63, scope: !432)
!450 = !DILocation(line: 120, column: 73, scope: !432)
!451 = !DILocation(line: 120, column: 78, scope: !432)
!452 = !DILocation(line: 120, column: 33, scope: !432)
!453 = !DILocation(line: 122, column: 8, scope: !454)
!454 = distinct !DILexicalBlock(scope: !432, file: !1, line: 122, column: 7)
!455 = !DILocation(line: 122, column: 7, scope: !432)
!456 = !DILocation(line: 124, column: 37, scope: !457)
!457 = distinct !DILexicalBlock(scope: !454, file: !1, line: 122, column: 16)
!458 = !DILocation(line: 124, column: 47, scope: !457)
!459 = !DILocation(line: 124, column: 52, scope: !457)
!460 = !DILocation(line: 124, column: 13, scope: !457)
!461 = !DILocation(line: 124, column: 11, scope: !457)
!462 = !DILocation(line: 125, column: 3, scope: !457)
!463 = !DILocation(line: 127, column: 17, scope: !432)
!464 = !DILocation(line: 127, column: 25, scope: !432)
!465 = !DILocation(line: 127, column: 14, scope: !432)
!466 = !DILocation(line: 134, column: 9, scope: !467)
!467 = distinct !DILexicalBlock(scope: !263, file: !1, line: 134, column: 2)
!468 = !DILocation(line: 134, column: 7, scope: !467)
!469 = !DILocation(line: 134, column: 14, scope: !470)
!470 = distinct !DILexicalBlock(scope: !467, file: !1, line: 134, column: 2)
!471 = !DILocation(line: 134, column: 18, scope: !470)
!472 = !DILocation(line: 134, column: 23, scope: !470)
!473 = !DILocation(line: 134, column: 16, scope: !470)
!474 = !DILocation(line: 134, column: 2, scope: !467)
!475 = !DILocalVariable(name: "old_track", scope: !476, file: !1, line: 135, type: !47)
!476 = distinct !DILexicalBlock(scope: !470, file: !1, line: 134, column: 40)
!477 = !DILocation(line: 135, column: 23, scope: !476)
!478 = !DILocalVariable(name: "mapped_to_old", scope: !476, file: !1, line: 136, type: !41)
!479 = !DILocation(line: 136, column: 8, scope: !476)
!480 = !DILocation(line: 138, column: 12, scope: !476)
!481 = !DILocation(line: 138, column: 17, scope: !476)
!482 = !DILocation(line: 138, column: 24, scope: !476)
!483 = !DILocation(line: 138, column: 9, scope: !476)
!484 = !DILocation(line: 141, column: 32, scope: !476)
!485 = !DILocation(line: 141, column: 37, scope: !476)
!486 = !DILocation(line: 141, column: 43, scope: !476)
!487 = !DILocation(line: 141, column: 15, scope: !476)
!488 = !DILocation(line: 141, column: 13, scope: !476)
!489 = !DILocation(line: 142, column: 7, scope: !490)
!490 = distinct !DILexicalBlock(scope: !476, file: !1, line: 142, column: 7)
!491 = !DILocation(line: 142, column: 7, scope: !476)
!492 = !DILocation(line: 143, column: 22, scope: !493)
!493 = distinct !DILexicalBlock(scope: !494, file: !1, line: 143, column: 8)
!494 = distinct !DILexicalBlock(scope: !490, file: !1, line: 142, column: 18)
!495 = !DILocation(line: 143, column: 34, scope: !493)
!496 = !DILocation(line: 143, column: 8, scope: !493)
!497 = !DILocation(line: 143, column: 45, scope: !493)
!498 = !DILocation(line: 143, column: 8, scope: !494)
!499 = !DILocation(line: 144, column: 17, scope: !500)
!500 = distinct !DILexicalBlock(scope: !493, file: !1, line: 143, column: 52)
!501 = !DILocation(line: 144, column: 29, scope: !500)
!502 = !DILocation(line: 144, column: 5, scope: !500)
!503 = !DILocation(line: 146, column: 20, scope: !500)
!504 = !DILocation(line: 146, column: 25, scope: !500)
!505 = !DILocation(line: 146, column: 5, scope: !500)
!506 = !DILocation(line: 149, column: 19, scope: !500)
!507 = !DILocation(line: 149, column: 30, scope: !500)
!508 = !DILocation(line: 149, column: 5, scope: !500)
!509 = !DILocation(line: 149, column: 12, scope: !500)
!510 = !DILocation(line: 149, column: 17, scope: !500)
!511 = !DILocation(line: 150, column: 23, scope: !500)
!512 = !DILocation(line: 150, column: 34, scope: !500)
!513 = !DILocation(line: 150, column: 5, scope: !500)
!514 = !DILocation(line: 150, column: 12, scope: !500)
!515 = !DILocation(line: 150, column: 21, scope: !500)
!516 = !DILocation(line: 151, column: 26, scope: !500)
!517 = !DILocation(line: 151, column: 37, scope: !500)
!518 = !DILocation(line: 151, column: 5, scope: !500)
!519 = !DILocation(line: 151, column: 12, scope: !500)
!520 = !DILocation(line: 151, column: 24, scope: !500)
!521 = !DILocation(line: 154, column: 5, scope: !500)
!522 = !DILocation(line: 154, column: 15, scope: !500)
!523 = !DILocation(line: 154, column: 26, scope: !500)
!524 = !DILocation(line: 155, column: 6, scope: !500)
!525 = !DILocation(line: 155, column: 19, scope: !500)
!526 = !DILocation(line: 155, column: 18, scope: !500)
!527 = !DILocation(line: 156, column: 26, scope: !500)
!528 = !DILocation(line: 156, column: 40, scope: !500)
!529 = !DILocation(line: 156, column: 51, scope: !500)
!530 = !DILocation(line: 156, column: 5, scope: !500)
!531 = !DILocation(line: 156, column: 16, scope: !500)
!532 = !DILocation(line: 156, column: 24, scope: !500)
!533 = !DILocation(line: 158, column: 22, scope: !500)
!534 = !DILocation(line: 158, column: 27, scope: !500)
!535 = !DILocation(line: 158, column: 5, scope: !500)
!536 = !DILocation(line: 160, column: 26, scope: !500)
!537 = !DILocation(line: 160, column: 5, scope: !500)
!538 = !DILocation(line: 162, column: 19, scope: !500)
!539 = !DILocation(line: 163, column: 4, scope: !500)
!540 = !DILocation(line: 164, column: 3, scope: !494)
!541 = !DILocation(line: 166, column: 7, scope: !542)
!542 = distinct !DILexicalBlock(scope: !476, file: !1, line: 166, column: 7)
!543 = !DILocation(line: 166, column: 21, scope: !542)
!544 = !DILocation(line: 166, column: 7, scope: !476)
!545 = !DILocalVariable(name: "new_track", scope: !546, file: !1, line: 167, type: !47)
!546 = distinct !DILexicalBlock(scope: !542, file: !1, line: 166, column: 31)
!547 = !DILocation(line: 167, column: 24, scope: !546)
!548 = !DILocation(line: 167, column: 65, scope: !546)
!549 = !DILocation(line: 167, column: 36, scope: !546)
!550 = !DILocation(line: 170, column: 21, scope: !546)
!551 = !DILocation(line: 170, column: 26, scope: !546)
!552 = !DILocation(line: 170, column: 32, scope: !546)
!553 = !DILocation(line: 170, column: 4, scope: !546)
!554 = !DILocation(line: 171, column: 21, scope: !546)
!555 = !DILocation(line: 171, column: 26, scope: !546)
!556 = !DILocation(line: 171, column: 32, scope: !546)
!557 = !DILocation(line: 171, column: 39, scope: !546)
!558 = !DILocation(line: 171, column: 4, scope: !546)
!559 = !DILocation(line: 173, column: 25, scope: !546)
!560 = !DILocation(line: 173, column: 4, scope: !546)
!561 = !DILocation(line: 174, column: 3, scope: !546)
!562 = !DILocation(line: 175, column: 2, scope: !476)
!563 = !DILocation(line: 134, column: 36, scope: !470)
!564 = !DILocation(line: 134, column: 2, scope: !470)
!565 = distinct !{!565, !474, !566}
!566 = !DILocation(line: 175, column: 2, scope: !467)
!567 = !DILocation(line: 178, column: 10, scope: !263)
!568 = !DILocation(line: 178, column: 22, scope: !263)
!569 = !DILocation(line: 178, column: 8, scope: !263)
!570 = !DILocation(line: 179, column: 2, scope: !263)
!571 = !DILocation(line: 179, column: 9, scope: !263)
!572 = !DILocalVariable(name: "next", scope: !573, file: !1, line: 180, type: !47)
!573 = distinct !DILexicalBlock(scope: !263, file: !1, line: 179, column: 16)
!574 = !DILocation(line: 180, column: 23, scope: !573)
!575 = !DILocation(line: 180, column: 30, scope: !573)
!576 = !DILocation(line: 180, column: 37, scope: !573)
!577 = !DILocation(line: 181, column: 28, scope: !573)
!578 = !DILocation(line: 181, column: 3, scope: !573)
!579 = !DILocation(line: 182, column: 11, scope: !573)
!580 = !DILocation(line: 182, column: 9, scope: !573)
!581 = distinct !{!581, !570, !582}
!582 = !DILocation(line: 183, column: 2, scope: !263)
!583 = !DILocation(line: 186, column: 17, scope: !263)
!584 = !DILocation(line: 186, column: 10, scope: !263)
!585 = !DILocation(line: 186, column: 8, scope: !263)
!586 = !DILocation(line: 187, column: 2, scope: !263)
!587 = !DILocation(line: 187, column: 9, scope: !263)
!588 = !DILocalVariable(name: "next", scope: !589, file: !1, line: 188, type: !47)
!589 = distinct !DILexicalBlock(scope: !263, file: !1, line: 187, column: 16)
!590 = !DILocation(line: 188, column: 23, scope: !589)
!591 = !DILocation(line: 188, column: 30, scope: !589)
!592 = !DILocation(line: 188, column: 37, scope: !589)
!593 = !DILocation(line: 190, column: 24, scope: !589)
!594 = !DILocation(line: 190, column: 3, scope: !589)
!595 = !DILocation(line: 192, column: 17, scope: !589)
!596 = !DILocation(line: 192, column: 24, scope: !589)
!597 = !DILocation(line: 192, column: 29, scope: !589)
!598 = !DILocation(line: 192, column: 3, scope: !589)
!599 = !DILocation(line: 192, column: 10, scope: !589)
!600 = !DILocation(line: 192, column: 15, scope: !589)
!601 = !DILocation(line: 193, column: 28, scope: !589)
!602 = !DILocation(line: 193, column: 3, scope: !589)
!603 = !DILocation(line: 195, column: 31, scope: !589)
!604 = !DILocation(line: 195, column: 3, scope: !589)
!605 = !DILocation(line: 198, column: 11, scope: !589)
!606 = !DILocation(line: 198, column: 9, scope: !589)
!607 = distinct !{!607, !586, !608}
!608 = !DILocation(line: 199, column: 2, scope: !263)
!609 = !DILocation(line: 201, column: 3, scope: !263)
!610 = !DILocation(line: 201, column: 16, scope: !263)
!611 = !DILocation(line: 202, column: 1, scope: !263)
!612 = distinct !DISubprogram(name: "tracks_map_free", scope: !1, file: !1, line: 204, type: !613, scopeLine: 205, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !117)
!613 = !DISubroutineType(types: !614)
!614 = !{null, !127, !615}
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 64)
!616 = !DISubroutineType(types: !617)
!617 = !{null, !185}
!618 = !DILocalVariable(name: "map", arg: 1, scope: !612, file: !1, line: 204, type: !127)
!619 = !DILocation(line: 204, column: 33, scope: !612)
!620 = !DILocalVariable(name: "customdata_free", arg: 2, scope: !612, file: !1, line: 204, type: !615)
!621 = !DILocation(line: 204, column: 45, scope: !612)
!622 = !DILocalVariable(name: "i", scope: !612, file: !1, line: 206, type: !22)
!623 = !DILocation(line: 206, column: 6, scope: !612)
!624 = !DILocation(line: 208, column: 17, scope: !612)
!625 = !DILocation(line: 208, column: 22, scope: !612)
!626 = !DILocation(line: 208, column: 2, scope: !612)
!627 = !DILocation(line: 210, column: 9, scope: !628)
!628 = distinct !DILexicalBlock(scope: !612, file: !1, line: 210, column: 2)
!629 = !DILocation(line: 210, column: 7, scope: !628)
!630 = !DILocation(line: 210, column: 14, scope: !631)
!631 = distinct !DILexicalBlock(scope: !628, file: !1, line: 210, column: 2)
!632 = !DILocation(line: 210, column: 18, scope: !631)
!633 = !DILocation(line: 210, column: 23, scope: !631)
!634 = !DILocation(line: 210, column: 16, scope: !631)
!635 = !DILocation(line: 210, column: 2, scope: !628)
!636 = !DILocation(line: 211, column: 7, scope: !637)
!637 = distinct !DILexicalBlock(scope: !638, file: !1, line: 211, column: 7)
!638 = distinct !DILexicalBlock(scope: !631, file: !1, line: 210, column: 40)
!639 = !DILocation(line: 211, column: 12, scope: !637)
!640 = !DILocation(line: 211, column: 23, scope: !637)
!641 = !DILocation(line: 211, column: 26, scope: !637)
!642 = !DILocation(line: 211, column: 7, scope: !638)
!643 = !DILocation(line: 212, column: 4, scope: !637)
!644 = !DILocation(line: 212, column: 21, scope: !637)
!645 = !DILocation(line: 212, column: 26, scope: !637)
!646 = !DILocation(line: 212, column: 37, scope: !637)
!647 = !DILocation(line: 212, column: 41, scope: !637)
!648 = !DILocation(line: 212, column: 46, scope: !637)
!649 = !DILocation(line: 212, column: 39, scope: !637)
!650 = !DILocation(line: 214, column: 28, scope: !638)
!651 = !DILocation(line: 214, column: 33, scope: !638)
!652 = !DILocation(line: 214, column: 40, scope: !638)
!653 = !DILocation(line: 214, column: 3, scope: !638)
!654 = !DILocation(line: 215, column: 2, scope: !638)
!655 = !DILocation(line: 210, column: 36, scope: !631)
!656 = !DILocation(line: 210, column: 2, scope: !631)
!657 = distinct !{!657, !635, !658}
!658 = !DILocation(line: 215, column: 2, scope: !628)
!659 = !DILocation(line: 217, column: 6, scope: !660)
!660 = distinct !DILexicalBlock(scope: !612, file: !1, line: 217, column: 6)
!661 = !DILocation(line: 217, column: 11, scope: !660)
!662 = !DILocation(line: 217, column: 6, scope: !612)
!663 = !DILocation(line: 218, column: 3, scope: !660)
!664 = !DILocation(line: 218, column: 13, scope: !660)
!665 = !DILocation(line: 218, column: 18, scope: !660)
!666 = !DILocation(line: 220, column: 2, scope: !612)
!667 = !DILocation(line: 220, column: 12, scope: !612)
!668 = !DILocation(line: 220, column: 17, scope: !612)
!669 = !DILocation(line: 222, column: 16, scope: !612)
!670 = !DILocation(line: 222, column: 21, scope: !612)
!671 = !DILocation(line: 222, column: 2, scope: !612)
!672 = !DILocation(line: 224, column: 2, scope: !612)
!673 = !DILocation(line: 224, column: 12, scope: !612)
!674 = !DILocation(line: 225, column: 1, scope: !612)
!675 = distinct !DISubprogram(name: "tracking_get_search_origin_frame_pixel", scope: !1, file: !1, line: 258, type: !676, scopeLine: 261, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !117)
!676 = !DISubroutineType(types: !677)
!677 = !{null, !22, !22, !678, !680}
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 64)
!679 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !68)
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!681 = !DILocalVariable(name: "frame_width", arg: 1, scope: !675, file: !1, line: 258, type: !22)
!682 = !DILocation(line: 258, column: 49, scope: !675)
!683 = !DILocalVariable(name: "frame_height", arg: 2, scope: !675, file: !1, line: 258, type: !22)
!684 = !DILocation(line: 258, column: 66, scope: !675)
!685 = !DILocalVariable(name: "marker", arg: 3, scope: !675, file: !1, line: 259, type: !678)
!686 = !DILocation(line: 259, column: 72, scope: !675)
!687 = !DILocalVariable(name: "frame_pixel", arg: 4, scope: !675, file: !1, line: 260, type: !680)
!688 = !DILocation(line: 260, column: 51, scope: !675)
!689 = !DILocation(line: 263, column: 44, scope: !675)
!690 = !DILocation(line: 263, column: 57, scope: !675)
!691 = !DILocation(line: 263, column: 71, scope: !675)
!692 = !DILocation(line: 263, column: 79, scope: !675)
!693 = !DILocation(line: 263, column: 87, scope: !675)
!694 = !DILocation(line: 263, column: 99, scope: !675)
!695 = !DILocation(line: 263, column: 2, scope: !675)
!696 = !DILocation(line: 264, column: 24, scope: !675)
!697 = !DILocation(line: 264, column: 19, scope: !675)
!698 = !DILocation(line: 264, column: 2, scope: !675)
!699 = !DILocation(line: 264, column: 17, scope: !675)
!700 = !DILocation(line: 265, column: 24, scope: !675)
!701 = !DILocation(line: 265, column: 19, scope: !675)
!702 = !DILocation(line: 265, column: 2, scope: !675)
!703 = !DILocation(line: 265, column: 17, scope: !675)
!704 = !DILocation(line: 266, column: 1, scope: !675)
!705 = distinct !DISubprogram(name: "marker_unified_to_frame_pixel_coordinates", scope: !1, file: !1, line: 249, type: !706, scopeLine: 253, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !117)
!706 = !DISubroutineType(types: !707)
!707 = !{null, !22, !22, !678, !708, !680}
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 64)
!709 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !57)
!710 = !DILocalVariable(name: "frame_width", arg: 1, scope: !705, file: !1, line: 249, type: !22)
!711 = !DILocation(line: 249, column: 59, scope: !705)
!712 = !DILocalVariable(name: "frame_height", arg: 2, scope: !705, file: !1, line: 249, type: !22)
!713 = !DILocation(line: 249, column: 76, scope: !705)
!714 = !DILocalVariable(name: "marker", arg: 3, scope: !705, file: !1, line: 250, type: !678)
!715 = !DILocation(line: 250, column: 82, scope: !705)
!716 = !DILocalVariable(name: "marker_unified_coords", arg: 4, scope: !705, file: !1, line: 251, type: !708)
!717 = !DILocation(line: 251, column: 67, scope: !705)
!718 = !DILocalVariable(name: "frame_pixel_coords", arg: 5, scope: !705, file: !1, line: 252, type: !680)
!719 = !DILocation(line: 252, column: 61, scope: !705)
!720 = !DILocation(line: 254, column: 26, scope: !705)
!721 = !DILocation(line: 254, column: 34, scope: !705)
!722 = !DILocation(line: 254, column: 57, scope: !705)
!723 = !DILocation(line: 254, column: 2, scope: !705)
!724 = !DILocation(line: 255, column: 19, scope: !705)
!725 = !DILocation(line: 255, column: 32, scope: !705)
!726 = !DILocation(line: 255, column: 46, scope: !705)
!727 = !DILocation(line: 255, column: 66, scope: !705)
!728 = !DILocation(line: 255, column: 2, scope: !705)
!729 = !DILocation(line: 256, column: 1, scope: !705)
!730 = distinct !DISubprogram(name: "tracking_get_marker_coords_for_tracking", scope: !1, file: !1, line: 306, type: !731, scopeLine: 309, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !117)
!731 = !DISubroutineType(types: !732)
!732 = !{null, !22, !22, !678, !733, !733}
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!734 = !DILocalVariable(name: "frame_width", arg: 1, scope: !730, file: !1, line: 306, type: !22)
!735 = !DILocation(line: 306, column: 50, scope: !730)
!736 = !DILocalVariable(name: "frame_height", arg: 2, scope: !730, file: !1, line: 306, type: !22)
!737 = !DILocation(line: 306, column: 67, scope: !730)
!738 = !DILocalVariable(name: "marker", arg: 3, scope: !730, file: !1, line: 307, type: !678)
!739 = !DILocation(line: 307, column: 73, scope: !730)
!740 = !DILocalVariable(name: "search_pixel_x", arg: 4, scope: !730, file: !1, line: 308, type: !733)
!741 = !DILocation(line: 308, column: 53, scope: !730)
!742 = !DILocalVariable(name: "search_pixel_y", arg: 5, scope: !730, file: !1, line: 308, type: !733)
!743 = !DILocation(line: 308, column: 79, scope: !730)
!744 = !DILocalVariable(name: "i", scope: !730, file: !1, line: 310, type: !22)
!745 = !DILocation(line: 310, column: 6, scope: !730)
!746 = !DILocalVariable(name: "unified_coords", scope: !730, file: !1, line: 311, type: !56)
!747 = !DILocation(line: 311, column: 8, scope: !730)
!748 = !DILocalVariable(name: "pixel_coords", scope: !730, file: !1, line: 312, type: !56)
!749 = !DILocation(line: 312, column: 8, scope: !730)
!750 = !DILocation(line: 315, column: 9, scope: !751)
!751 = distinct !DILexicalBlock(scope: !730, file: !1, line: 315, column: 2)
!752 = !DILocation(line: 315, column: 7, scope: !751)
!753 = !DILocation(line: 315, column: 14, scope: !754)
!754 = distinct !DILexicalBlock(scope: !751, file: !1, line: 315, column: 2)
!755 = !DILocation(line: 315, column: 16, scope: !754)
!756 = !DILocation(line: 315, column: 2, scope: !751)
!757 = !DILocation(line: 316, column: 34, scope: !758)
!758 = distinct !DILexicalBlock(scope: !754, file: !1, line: 315, column: 26)
!759 = !DILocation(line: 316, column: 47, scope: !758)
!760 = !DILocation(line: 316, column: 61, scope: !758)
!761 = !DILocation(line: 316, column: 69, scope: !758)
!762 = !DILocation(line: 316, column: 77, scope: !758)
!763 = !DILocation(line: 316, column: 93, scope: !758)
!764 = !DILocation(line: 316, column: 97, scope: !758)
!765 = !DILocation(line: 316, column: 3, scope: !758)
!766 = !DILocation(line: 317, column: 23, scope: !758)
!767 = !DILocation(line: 317, column: 39, scope: !758)
!768 = !DILocation(line: 317, column: 3, scope: !758)
!769 = !DILocation(line: 317, column: 18, scope: !758)
!770 = !DILocation(line: 317, column: 21, scope: !758)
!771 = !DILocation(line: 318, column: 23, scope: !758)
!772 = !DILocation(line: 318, column: 39, scope: !758)
!773 = !DILocation(line: 318, column: 3, scope: !758)
!774 = !DILocation(line: 318, column: 18, scope: !758)
!775 = !DILocation(line: 318, column: 21, scope: !758)
!776 = !DILocation(line: 319, column: 2, scope: !758)
!777 = !DILocation(line: 315, column: 22, scope: !754)
!778 = !DILocation(line: 315, column: 2, scope: !754)
!779 = distinct !{!779, !756, !780}
!780 = !DILocation(line: 319, column: 2, scope: !751)
!781 = !DILocation(line: 322, column: 2, scope: !730)
!782 = !DILocation(line: 322, column: 20, scope: !730)
!783 = !DILocation(line: 323, column: 2, scope: !730)
!784 = !DILocation(line: 323, column: 20, scope: !730)
!785 = !DILocation(line: 324, column: 33, scope: !730)
!786 = !DILocation(line: 324, column: 46, scope: !730)
!787 = !DILocation(line: 324, column: 60, scope: !730)
!788 = !DILocation(line: 324, column: 68, scope: !730)
!789 = !DILocation(line: 324, column: 84, scope: !730)
!790 = !DILocation(line: 324, column: 2, scope: !730)
!791 = !DILocation(line: 326, column: 22, scope: !730)
!792 = !DILocation(line: 326, column: 38, scope: !730)
!793 = !DILocation(line: 326, column: 2, scope: !730)
!794 = !DILocation(line: 326, column: 20, scope: !730)
!795 = !DILocation(line: 327, column: 22, scope: !730)
!796 = !DILocation(line: 327, column: 38, scope: !730)
!797 = !DILocation(line: 327, column: 2, scope: !730)
!798 = !DILocation(line: 327, column: 20, scope: !730)
!799 = !DILocation(line: 328, column: 1, scope: !730)
!800 = distinct !DISubprogram(name: "marker_unified_to_search_pixel", scope: !1, file: !1, line: 274, type: !706, scopeLine: 277, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !117)
!801 = !DILocalVariable(name: "frame_width", arg: 1, scope: !800, file: !1, line: 274, type: !22)
!802 = !DILocation(line: 274, column: 48, scope: !800)
!803 = !DILocalVariable(name: "frame_height", arg: 2, scope: !800, file: !1, line: 274, type: !22)
!804 = !DILocation(line: 274, column: 65, scope: !800)
!805 = !DILocalVariable(name: "marker", arg: 3, scope: !800, file: !1, line: 275, type: !678)
!806 = !DILocation(line: 275, column: 71, scope: !800)
!807 = !DILocalVariable(name: "marker_unified", arg: 4, scope: !800, file: !1, line: 276, type: !708)
!808 = !DILocation(line: 276, column: 56, scope: !800)
!809 = !DILocalVariable(name: "search_pixel", arg: 5, scope: !800, file: !1, line: 276, type: !680)
!810 = !DILocation(line: 276, column: 81, scope: !800)
!811 = !DILocalVariable(name: "frame_pixel", scope: !800, file: !1, line: 278, type: !56)
!812 = !DILocation(line: 278, column: 8, scope: !800)
!813 = !DILocalVariable(name: "search_origin_frame_pixel", scope: !800, file: !1, line: 279, type: !56)
!814 = !DILocation(line: 279, column: 8, scope: !800)
!815 = !DILocation(line: 281, column: 44, scope: !800)
!816 = !DILocation(line: 281, column: 57, scope: !800)
!817 = !DILocation(line: 281, column: 71, scope: !800)
!818 = !DILocation(line: 281, column: 79, scope: !800)
!819 = !DILocation(line: 281, column: 95, scope: !800)
!820 = !DILocation(line: 281, column: 2, scope: !800)
!821 = !DILocation(line: 282, column: 41, scope: !800)
!822 = !DILocation(line: 282, column: 54, scope: !800)
!823 = !DILocation(line: 282, column: 68, scope: !800)
!824 = !DILocation(line: 282, column: 76, scope: !800)
!825 = !DILocation(line: 282, column: 2, scope: !800)
!826 = !DILocation(line: 283, column: 14, scope: !800)
!827 = !DILocation(line: 283, column: 28, scope: !800)
!828 = !DILocation(line: 283, column: 41, scope: !800)
!829 = !DILocation(line: 283, column: 2, scope: !800)
!830 = !DILocation(line: 284, column: 1, scope: !800)
!831 = distinct !DISubprogram(name: "tracking_set_marker_coords_from_tracking", scope: !1, file: !1, line: 331, type: !832, scopeLine: 333, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !117)
!832 = !DISubroutineType(types: !833)
!833 = !{null, !22, !22, !67, !834, !834}
!834 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !835, size: 64)
!835 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !23)
!836 = !DILocalVariable(name: "frame_width", arg: 1, scope: !831, file: !1, line: 331, type: !22)
!837 = !DILocation(line: 331, column: 51, scope: !831)
!838 = !DILocalVariable(name: "frame_height", arg: 2, scope: !831, file: !1, line: 331, type: !22)
!839 = !DILocation(line: 331, column: 68, scope: !831)
!840 = !DILocalVariable(name: "marker", arg: 3, scope: !831, file: !1, line: 331, type: !67)
!841 = !DILocation(line: 331, column: 103, scope: !831)
!842 = !DILocalVariable(name: "search_pixel_x", arg: 4, scope: !831, file: !1, line: 332, type: !834)
!843 = !DILocation(line: 332, column: 60, scope: !831)
!844 = !DILocalVariable(name: "search_pixel_y", arg: 5, scope: !831, file: !1, line: 332, type: !834)
!845 = !DILocation(line: 332, column: 92, scope: !831)
!846 = !DILocalVariable(name: "i", scope: !831, file: !1, line: 334, type: !22)
!847 = !DILocation(line: 334, column: 6, scope: !831)
!848 = !DILocalVariable(name: "marker_unified", scope: !831, file: !1, line: 335, type: !56)
!849 = !DILocation(line: 335, column: 8, scope: !831)
!850 = !DILocalVariable(name: "search_pixel", scope: !831, file: !1, line: 336, type: !56)
!851 = !DILocation(line: 336, column: 8, scope: !831)
!852 = !DILocation(line: 339, column: 9, scope: !853)
!853 = distinct !DILexicalBlock(scope: !831, file: !1, line: 339, column: 2)
!854 = !DILocation(line: 339, column: 7, scope: !853)
!855 = !DILocation(line: 339, column: 14, scope: !856)
!856 = distinct !DILexicalBlock(scope: !853, file: !1, line: 339, column: 2)
!857 = !DILocation(line: 339, column: 16, scope: !856)
!858 = !DILocation(line: 339, column: 2, scope: !853)
!859 = !DILocation(line: 340, column: 21, scope: !860)
!860 = distinct !DILexicalBlock(scope: !856, file: !1, line: 339, column: 26)
!861 = !DILocation(line: 340, column: 36, scope: !860)
!862 = !DILocation(line: 340, column: 39, scope: !860)
!863 = !DILocation(line: 340, column: 3, scope: !860)
!864 = !DILocation(line: 340, column: 19, scope: !860)
!865 = !DILocation(line: 341, column: 21, scope: !860)
!866 = !DILocation(line: 341, column: 36, scope: !860)
!867 = !DILocation(line: 341, column: 39, scope: !860)
!868 = !DILocation(line: 341, column: 3, scope: !860)
!869 = !DILocation(line: 341, column: 19, scope: !860)
!870 = !DILocation(line: 342, column: 34, scope: !860)
!871 = !DILocation(line: 342, column: 47, scope: !860)
!872 = !DILocation(line: 342, column: 61, scope: !860)
!873 = !DILocation(line: 342, column: 69, scope: !860)
!874 = !DILocation(line: 342, column: 83, scope: !860)
!875 = !DILocation(line: 342, column: 91, scope: !860)
!876 = !DILocation(line: 342, column: 107, scope: !860)
!877 = !DILocation(line: 342, column: 3, scope: !860)
!878 = !DILocation(line: 343, column: 2, scope: !860)
!879 = !DILocation(line: 339, column: 22, scope: !856)
!880 = !DILocation(line: 339, column: 2, scope: !856)
!881 = distinct !{!881, !858, !882}
!882 = !DILocation(line: 343, column: 2, scope: !853)
!883 = !DILocation(line: 346, column: 20, scope: !831)
!884 = !DILocation(line: 346, column: 38, scope: !831)
!885 = !DILocation(line: 346, column: 2, scope: !831)
!886 = !DILocation(line: 346, column: 18, scope: !831)
!887 = !DILocation(line: 347, column: 20, scope: !831)
!888 = !DILocation(line: 347, column: 38, scope: !831)
!889 = !DILocation(line: 347, column: 2, scope: !831)
!890 = !DILocation(line: 347, column: 18, scope: !831)
!891 = !DILocation(line: 348, column: 33, scope: !831)
!892 = !DILocation(line: 348, column: 46, scope: !831)
!893 = !DILocation(line: 348, column: 60, scope: !831)
!894 = !DILocation(line: 348, column: 68, scope: !831)
!895 = !DILocation(line: 348, column: 82, scope: !831)
!896 = !DILocation(line: 348, column: 2, scope: !831)
!897 = !DILocation(line: 354, column: 9, scope: !898)
!898 = distinct !DILexicalBlock(scope: !831, file: !1, line: 354, column: 2)
!899 = !DILocation(line: 354, column: 7, scope: !898)
!900 = !DILocation(line: 354, column: 14, scope: !901)
!901 = distinct !DILexicalBlock(scope: !898, file: !1, line: 354, column: 2)
!902 = !DILocation(line: 354, column: 16, scope: !901)
!903 = !DILocation(line: 354, column: 2, scope: !898)
!904 = !DILocation(line: 355, column: 36, scope: !905)
!905 = distinct !DILexicalBlock(scope: !901, file: !1, line: 354, column: 26)
!906 = !DILocation(line: 355, column: 3, scope: !905)
!907 = !DILocation(line: 355, column: 11, scope: !905)
!908 = !DILocation(line: 355, column: 27, scope: !905)
!909 = !DILocation(line: 355, column: 33, scope: !905)
!910 = !DILocation(line: 356, column: 36, scope: !905)
!911 = !DILocation(line: 356, column: 3, scope: !905)
!912 = !DILocation(line: 356, column: 11, scope: !905)
!913 = !DILocation(line: 356, column: 27, scope: !905)
!914 = !DILocation(line: 356, column: 33, scope: !905)
!915 = !DILocation(line: 357, column: 2, scope: !905)
!916 = !DILocation(line: 354, column: 22, scope: !901)
!917 = !DILocation(line: 354, column: 2, scope: !901)
!918 = distinct !{!918, !903, !919}
!919 = !DILocation(line: 357, column: 2, scope: !898)
!920 = !DILocation(line: 359, column: 20, scope: !831)
!921 = !DILocation(line: 359, column: 2, scope: !831)
!922 = !DILocation(line: 359, column: 10, scope: !831)
!923 = !DILocation(line: 359, column: 17, scope: !831)
!924 = !DILocation(line: 360, column: 20, scope: !831)
!925 = !DILocation(line: 360, column: 2, scope: !831)
!926 = !DILocation(line: 360, column: 10, scope: !831)
!927 = !DILocation(line: 360, column: 17, scope: !831)
!928 = !DILocation(line: 361, column: 1, scope: !831)
!929 = distinct !DISubprogram(name: "search_pixel_to_marker_unified", scope: !1, file: !1, line: 286, type: !706, scopeLine: 289, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !117)
!930 = !DILocalVariable(name: "frame_width", arg: 1, scope: !929, file: !1, line: 286, type: !22)
!931 = !DILocation(line: 286, column: 48, scope: !929)
!932 = !DILocalVariable(name: "frame_height", arg: 2, scope: !929, file: !1, line: 286, type: !22)
!933 = !DILocation(line: 286, column: 65, scope: !929)
!934 = !DILocalVariable(name: "marker", arg: 3, scope: !929, file: !1, line: 287, type: !678)
!935 = !DILocation(line: 287, column: 71, scope: !929)
!936 = !DILocalVariable(name: "search_pixel", arg: 4, scope: !929, file: !1, line: 288, type: !708)
!937 = !DILocation(line: 288, column: 56, scope: !929)
!938 = !DILocalVariable(name: "marker_unified", arg: 5, scope: !929, file: !1, line: 288, type: !680)
!939 = !DILocation(line: 288, column: 79, scope: !929)
!940 = !DILocalVariable(name: "frame_unified", scope: !929, file: !1, line: 290, type: !56)
!941 = !DILocation(line: 290, column: 8, scope: !929)
!942 = !DILocalVariable(name: "search_origin_frame_pixel", scope: !929, file: !1, line: 291, type: !56)
!943 = !DILocation(line: 291, column: 8, scope: !929)
!944 = !DILocation(line: 293, column: 41, scope: !929)
!945 = !DILocation(line: 293, column: 54, scope: !929)
!946 = !DILocation(line: 293, column: 68, scope: !929)
!947 = !DILocation(line: 293, column: 76, scope: !929)
!948 = !DILocation(line: 293, column: 2, scope: !929)
!949 = !DILocation(line: 294, column: 14, scope: !929)
!950 = !DILocation(line: 294, column: 29, scope: !929)
!951 = !DILocation(line: 294, column: 43, scope: !929)
!952 = !DILocation(line: 294, column: 2, scope: !929)
!953 = !DILocation(line: 295, column: 19, scope: !929)
!954 = !DILocation(line: 295, column: 32, scope: !929)
!955 = !DILocation(line: 295, column: 46, scope: !929)
!956 = !DILocation(line: 295, column: 61, scope: !929)
!957 = !DILocation(line: 295, column: 2, scope: !929)
!958 = !DILocation(line: 298, column: 14, scope: !929)
!959 = !DILocation(line: 298, column: 30, scope: !929)
!960 = !DILocation(line: 298, column: 45, scope: !929)
!961 = !DILocation(line: 298, column: 53, scope: !929)
!962 = !DILocation(line: 298, column: 2, scope: !929)
!963 = !DILocation(line: 299, column: 1, scope: !929)
!964 = distinct !DISubprogram(name: "tracking_marker_insert_disabled", scope: !1, file: !1, line: 374, type: !965, scopeLine: 376, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !117)
!965 = !DISubroutineType(types: !966)
!966 = !{null, !47, !678, !41, !41}
!967 = !DILocalVariable(name: "track", arg: 1, scope: !964, file: !1, line: 374, type: !47)
!968 = !DILocation(line: 374, column: 58, scope: !964)
!969 = !DILocalVariable(name: "ref_marker", arg: 2, scope: !964, file: !1, line: 374, type: !678)
!970 = !DILocation(line: 374, column: 92, scope: !964)
!971 = !DILocalVariable(name: "before", arg: 3, scope: !964, file: !1, line: 375, type: !41)
!972 = !DILocation(line: 375, column: 43, scope: !964)
!973 = !DILocalVariable(name: "overwrite", arg: 4, scope: !964, file: !1, line: 375, type: !41)
!974 = !DILocation(line: 375, column: 56, scope: !964)
!975 = !DILocalVariable(name: "marker_new", scope: !964, file: !1, line: 377, type: !68)
!976 = !DILocation(line: 377, column: 22, scope: !964)
!977 = !DILocation(line: 379, column: 16, scope: !964)
!978 = !DILocation(line: 379, column: 15, scope: !964)
!979 = !DILocation(line: 380, column: 13, scope: !964)
!980 = !DILocation(line: 380, column: 18, scope: !964)
!981 = !DILocation(line: 381, column: 13, scope: !964)
!982 = !DILocation(line: 381, column: 18, scope: !964)
!983 = !DILocation(line: 383, column: 6, scope: !984)
!984 = distinct !DILexicalBlock(scope: !964, file: !1, line: 383, column: 6)
!985 = !DILocation(line: 383, column: 6, scope: !964)
!986 = !DILocation(line: 384, column: 14, scope: !984)
!987 = !DILocation(line: 384, column: 21, scope: !984)
!988 = !DILocation(line: 384, column: 3, scope: !984)
!989 = !DILocation(line: 386, column: 14, scope: !984)
!990 = !DILocation(line: 386, column: 21, scope: !984)
!991 = !DILocation(line: 388, column: 6, scope: !992)
!992 = distinct !DILexicalBlock(scope: !964, file: !1, line: 388, column: 6)
!993 = !DILocation(line: 388, column: 16, scope: !992)
!994 = !DILocation(line: 388, column: 59, scope: !992)
!995 = !DILocation(line: 388, column: 77, scope: !992)
!996 = !DILocation(line: 388, column: 20, scope: !992)
!997 = !DILocation(line: 388, column: 6, scope: !964)
!998 = !DILocation(line: 389, column: 30, scope: !992)
!999 = !DILocation(line: 389, column: 3, scope: !992)
!1000 = !DILocation(line: 390, column: 1, scope: !964)
!1001 = distinct !DISubprogram(name: "tracking_cameraIntrinscisOptionsFromTracking", scope: !1, file: !1, line: 395, type: !1002, scopeLine: 398, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !117)
!1002 = !DISubroutineType(types: !1003)
!1003 = !{null, !266, !22, !22, !1004}
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 64)
!1005 = !DIDerivedType(tag: DW_TAG_typedef, name: "libmv_CameraIntrinsicsOptions", file: !13, line: 54, baseType: !1006)
!1006 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "libmv_CameraIntrinsicsOptions", file: !13, line: 41, size: 768, elements: !1007)
!1007 = !{!1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020}
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_model", scope: !1006, file: !13, line: 43, baseType: !22, size: 32)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "image_width", scope: !1006, file: !13, line: 44, baseType: !22, size: 32, offset: 32)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "image_height", scope: !1006, file: !13, line: 44, baseType: !22, size: 32, offset: 64)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "focal_length", scope: !1006, file: !13, line: 45, baseType: !23, size: 64, offset: 128)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "principal_point_x", scope: !1006, file: !13, line: 46, baseType: !23, size: 64, offset: 192)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "principal_point_y", scope: !1006, file: !13, line: 46, baseType: !23, size: 64, offset: 256)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "polynomial_k1", scope: !1006, file: !13, line: 49, baseType: !23, size: 64, offset: 320)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "polynomial_k2", scope: !1006, file: !13, line: 49, baseType: !23, size: 64, offset: 384)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "polynomial_k3", scope: !1006, file: !13, line: 49, baseType: !23, size: 64, offset: 448)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "polynomial_p1", scope: !1006, file: !13, line: 50, baseType: !23, size: 64, offset: 512)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "polynomial_p2", scope: !1006, file: !13, line: 50, baseType: !23, size: 64, offset: 576)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "division_k1", scope: !1006, file: !13, line: 53, baseType: !23, size: 64, offset: 640)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "division_k2", scope: !1006, file: !13, line: 53, baseType: !23, size: 64, offset: 704)
!1021 = !DILocalVariable(name: "tracking", arg: 1, scope: !1001, file: !1, line: 395, type: !266)
!1022 = !DILocation(line: 395, column: 66, scope: !1001)
!1023 = !DILocalVariable(name: "calibration_width", arg: 2, scope: !1001, file: !1, line: 396, type: !22)
!1024 = !DILocation(line: 396, column: 55, scope: !1001)
!1025 = !DILocalVariable(name: "calibration_height", arg: 3, scope: !1001, file: !1, line: 396, type: !22)
!1026 = !DILocation(line: 396, column: 78, scope: !1001)
!1027 = !DILocalVariable(name: "camera_intrinsics_options", arg: 4, scope: !1001, file: !1, line: 397, type: !1004)
!1028 = !DILocation(line: 397, column: 82, scope: !1001)
!1029 = !DILocalVariable(name: "camera", scope: !1001, file: !1, line: 399, type: !1030)
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!1031 = !DILocation(line: 399, column: 23, scope: !1001)
!1032 = !DILocation(line: 399, column: 33, scope: !1001)
!1033 = !DILocation(line: 399, column: 43, scope: !1001)
!1034 = !DILocalVariable(name: "aspy", scope: !1001, file: !1, line: 400, type: !57)
!1035 = !DILocation(line: 400, column: 8, scope: !1001)
!1036 = !DILocation(line: 400, column: 22, scope: !1001)
!1037 = !DILocation(line: 400, column: 32, scope: !1001)
!1038 = !DILocation(line: 400, column: 39, scope: !1001)
!1039 = !DILocation(line: 400, column: 20, scope: !1001)
!1040 = !DILocation(line: 402, column: 44, scope: !1001)
!1041 = !DILocation(line: 402, column: 52, scope: !1001)
!1042 = !DILocation(line: 402, column: 2, scope: !1001)
!1043 = !DILocation(line: 402, column: 29, scope: !1001)
!1044 = !DILocation(line: 402, column: 42, scope: !1001)
!1045 = !DILocation(line: 404, column: 49, scope: !1001)
!1046 = !DILocation(line: 404, column: 57, scope: !1001)
!1047 = !DILocation(line: 404, column: 2, scope: !1001)
!1048 = !DILocation(line: 404, column: 29, scope: !1001)
!1049 = !DILocation(line: 404, column: 47, scope: !1001)
!1050 = !DILocation(line: 405, column: 49, scope: !1001)
!1051 = !DILocation(line: 405, column: 57, scope: !1001)
!1052 = !DILocation(line: 405, column: 72, scope: !1001)
!1053 = !DILocation(line: 405, column: 70, scope: !1001)
!1054 = !DILocation(line: 405, column: 2, scope: !1001)
!1055 = !DILocation(line: 405, column: 29, scope: !1001)
!1056 = !DILocation(line: 405, column: 47, scope: !1001)
!1057 = !DILocation(line: 407, column: 10, scope: !1001)
!1058 = !DILocation(line: 407, column: 18, scope: !1001)
!1059 = !DILocation(line: 407, column: 2, scope: !1001)
!1060 = !DILocation(line: 409, column: 4, scope: !1061)
!1061 = distinct !DILexicalBlock(scope: !1001, file: !1, line: 407, column: 36)
!1062 = !DILocation(line: 409, column: 31, scope: !1061)
!1063 = !DILocation(line: 409, column: 48, scope: !1061)
!1064 = !DILocation(line: 410, column: 47, scope: !1061)
!1065 = !DILocation(line: 410, column: 55, scope: !1061)
!1066 = !DILocation(line: 410, column: 4, scope: !1061)
!1067 = !DILocation(line: 410, column: 31, scope: !1061)
!1068 = !DILocation(line: 410, column: 45, scope: !1061)
!1069 = !DILocation(line: 411, column: 47, scope: !1061)
!1070 = !DILocation(line: 411, column: 55, scope: !1061)
!1071 = !DILocation(line: 411, column: 4, scope: !1061)
!1072 = !DILocation(line: 411, column: 31, scope: !1061)
!1073 = !DILocation(line: 411, column: 45, scope: !1061)
!1074 = !DILocation(line: 412, column: 47, scope: !1061)
!1075 = !DILocation(line: 412, column: 55, scope: !1061)
!1076 = !DILocation(line: 412, column: 4, scope: !1061)
!1077 = !DILocation(line: 412, column: 31, scope: !1061)
!1078 = !DILocation(line: 412, column: 45, scope: !1061)
!1079 = !DILocation(line: 413, column: 4, scope: !1061)
!1080 = !DILocation(line: 413, column: 31, scope: !1061)
!1081 = !DILocation(line: 413, column: 45, scope: !1061)
!1082 = !DILocation(line: 414, column: 4, scope: !1061)
!1083 = !DILocation(line: 414, column: 31, scope: !1061)
