; ModuleID = 'blender/source/blender/render/intern/source/occlusion.c'
source_filename = "blender/source/blender/render/intern/source/occlusion.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "c1", scope: !2, file: !3, line: 299, type: !2785, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "sh_eval", scope: !3, file: !3, line: 295, type: !4, scopeLine: 296, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !8, retainedNodes: !2792)
!3 = !DIFile(filename: "blender/source/blender/render/intern/source/occlusion.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !DISubroutineType(types: !5)
!5 = !{!6, !7, !7}
!6 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!8 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !9, retainedTypes: !63, globals: !2782, splitDebugInlining: false, nameTableKind: None)
!9 = !{!10, !46}
!10 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ScenePassType", file: !11, line: 213, baseType: !12, size: 32, elements: !13)
!11 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!12 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!13 = !{!14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45}
!14 = !DIEnumerator(name: "SCE_PASS_COMBINED", value: 1)
!15 = !DIEnumerator(name: "SCE_PASS_Z", value: 2)
!16 = !DIEnumerator(name: "SCE_PASS_RGBA", value: 4)
!17 = !DIEnumerator(name: "SCE_PASS_DIFFUSE", value: 8)
!18 = !DIEnumerator(name: "SCE_PASS_SPEC", value: 16)
!19 = !DIEnumerator(name: "SCE_PASS_SHADOW", value: 32)
!20 = !DIEnumerator(name: "SCE_PASS_AO", value: 64)
!21 = !DIEnumerator(name: "SCE_PASS_REFLECT", value: 128)
!22 = !DIEnumerator(name: "SCE_PASS_NORMAL", value: 256)
!23 = !DIEnumerator(name: "SCE_PASS_VECTOR", value: 512)
!24 = !DIEnumerator(name: "SCE_PASS_REFRACT", value: 1024)
!25 = !DIEnumerator(name: "SCE_PASS_INDEXOB", value: 2048)
!26 = !DIEnumerator(name: "SCE_PASS_UV", value: 4096)
!27 = !DIEnumerator(name: "SCE_PASS_INDIRECT", value: 8192)
!28 = !DIEnumerator(name: "SCE_PASS_MIST", value: 16384)
!29 = !DIEnumerator(name: "SCE_PASS_RAYHITS", value: 32768)
!30 = !DIEnumerator(name: "SCE_PASS_EMIT", value: 65536)
!31 = !DIEnumerator(name: "SCE_PASS_ENVIRONMENT", value: 131072)
!32 = !DIEnumerator(name: "SCE_PASS_INDEXMA", value: 262144)
!33 = !DIEnumerator(name: "SCE_PASS_DIFFUSE_DIRECT", value: 524288)
!34 = !DIEnumerator(name: "SCE_PASS_DIFFUSE_INDIRECT", value: 1048576)
!35 = !DIEnumerator(name: "SCE_PASS_DIFFUSE_COLOR", value: 2097152)
!36 = !DIEnumerator(name: "SCE_PASS_GLOSSY_DIRECT", value: 4194304)
!37 = !DIEnumerator(name: "SCE_PASS_GLOSSY_INDIRECT", value: 8388608)
!38 = !DIEnumerator(name: "SCE_PASS_GLOSSY_COLOR", value: 16777216)
!39 = !DIEnumerator(name: "SCE_PASS_TRANSM_DIRECT", value: 33554432)
!40 = !DIEnumerator(name: "SCE_PASS_TRANSM_INDIRECT", value: 67108864)
!41 = !DIEnumerator(name: "SCE_PASS_TRANSM_COLOR", value: 134217728)
!42 = !DIEnumerator(name: "SCE_PASS_SUBSURFACE_DIRECT", value: 268435456)
!43 = !DIEnumerator(name: "SCE_PASS_SUBSURFACE_INDIRECT", value: 536870912)
!44 = !DIEnumerator(name: "SCE_PASS_SUBSURFACE_COLOR", value: 1073741824)
!45 = !DIEnumerator(name: "SCE_PASS_DEBUG", value: -2147483648)
!46 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !47, line: 394, baseType: !48, size: 32, elements: !49)
!47 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!48 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!49 = !{!50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62}
!50 = !DIEnumerator(name: "OB_NEG_SCALE", value: 4, isUnsigned: true)
!51 = !DIEnumerator(name: "OB_DUPLIFRAMES", value: 8, isUnsigned: true)
!52 = !DIEnumerator(name: "OB_DUPLIVERTS", value: 16, isUnsigned: true)
!53 = !DIEnumerator(name: "OB_DUPLIROT", value: 32, isUnsigned: true)
!54 = !DIEnumerator(name: "OB_DUPLINOSPEED", value: 64, isUnsigned: true)
!55 = !DIEnumerator(name: "OB_DUPLIGROUP", value: 256, isUnsigned: true)
!56 = !DIEnumerator(name: "OB_DUPLIFACES", value: 512, isUnsigned: true)
!57 = !DIEnumerator(name: "OB_DUPLIFACES_SCALE", value: 1024, isUnsigned: true)
!58 = !DIEnumerator(name: "OB_DUPLIPARTS", value: 2048, isUnsigned: true)
!59 = !DIEnumerator(name: "OB_RENDER_DUPLI", value: 4096, isUnsigned: true)
!60 = !DIEnumerator(name: "OB_NO_CONSTRAINTS", value: 8192, isUnsigned: true)
!61 = !DIEnumerator(name: "OB_NO_PSYS_UPDATE", value: 16384, isUnsigned: true)
!62 = !DIEnumerator(name: "OB_DUPLI", value: 2840, isUnsigned: true)
!63 = !{!64, !65, !80, !6, !173}
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixStr", file: !67, line: 54, baseType: !68)
!67 = !DIFile(filename: "blender/source/blender/render/intern/include/rendercore.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!68 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PixStr", file: !67, line: 49, size: 256, elements: !69)
!69 = !{!70, !72, !73, !74, !75, !76, !78}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !68, file: !67, line: 50, baseType: !71, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "obi", scope: !68, file: !67, line: 51, baseType: !12, size: 32, offset: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "facenr", scope: !68, file: !67, line: 51, baseType: !12, size: 32, offset: 96)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !68, file: !67, line: 51, baseType: !12, size: 32, offset: 128)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "maskz", scope: !68, file: !67, line: 51, baseType: !12, size: 32, offset: 160)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !68, file: !67, line: 52, baseType: !77, size: 16, offset: 192)
!77 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "shadfac", scope: !68, file: !67, line: 53, baseType: !79, size: 16, offset: 208)
!79 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "OcclusionBuildThread", file: !3, line: 136, baseType: !82)
!82 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "OcclusionBuildThread", file: !3, line: 132, size: 256, elements: !83)
!83 = !{!84, !169, !170, !171, !172}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "tree", scope: !82, file: !3, line: 133, baseType: !85, size: 64)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "OcclusionTree", file: !3, line: 120, baseType: !87)
!87 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "OcclusionTree", file: !3, line: 96, size: 768, elements: !88)
!88 = !{!89, !94, !99, !106, !107, !108, !132, !137, !138, !139, !140, !141, !142, !143, !144}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "arena", scope: !87, file: !3, line: 97, baseType: !90, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "MemArena", file: !92, line: 53, baseType: !93)
!92 = !DIFile(filename: "blender/source/blender/blenlib/BLI_memarena.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!93 = !DICompositeType(tag: DW_TAG_structure_type, name: "MemArena", file: !92, line: 52, flags: DIFlagFwdDecl)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !87, file: !3, line: 99, baseType: !95, size: 64, offset: 64)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 96, elements: !97)
!97 = !{!98}
!98 = !DISubrange(count: 3)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "face", scope: !87, file: !3, line: 101, baseType: !100, size: 64, offset: 128)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "OccFace", file: !3, line: 82, baseType: !102)
!102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "OccFace", file: !3, line: 79, size: 64, elements: !103)
!103 = !{!104, !105}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "obi", scope: !102, file: !3, line: 80, baseType: !12, size: 32)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "facenr", scope: !102, file: !3, line: 81, baseType: !12, size: 32, offset: 32)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "occlusion", scope: !87, file: !3, line: 102, baseType: !7, size: 64, offset: 192)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "rad", scope: !87, file: !3, line: 103, baseType: !95, size: 64, offset: 256)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !87, file: !3, line: 105, baseType: !109, size: 64, offset: 320)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "OccNode", file: !3, line: 94, baseType: !111)
!111 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "OccNode", file: !3, line: 84, size: 1152, elements: !112)
!112 = !{!113, !114, !115, !119, !120, !121, !122, !123}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !111, file: !3, line: 85, baseType: !96, size: 96)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "area", scope: !111, file: !3, line: 85, baseType: !6, size: 32, offset: 96)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "sh", scope: !111, file: !3, line: 86, baseType: !116, size: 288, offset: 128)
!116 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 288, elements: !117)
!117 = !{!118}
!118 = !DISubrange(count: 9)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "dco", scope: !111, file: !3, line: 86, baseType: !6, size: 32, offset: 416)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "occlusion", scope: !111, file: !3, line: 87, baseType: !6, size: 32, offset: 448)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "rad", scope: !111, file: !3, line: 87, baseType: !96, size: 96, offset: 480)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "childflag", scope: !111, file: !3, line: 88, baseType: !12, size: 32, offset: 576)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !111, file: !3, line: 93, baseType: !124, size: 512, offset: 640)
!124 = !DICompositeType(tag: DW_TAG_array_type, baseType: !125, size: 512, elements: !130)
!125 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !111, file: !3, line: 89, size: 64, elements: !126)
!126 = !{!127, !128}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "face", scope: !125, file: !3, line: 91, baseType: !12, size: 32)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !125, file: !3, line: 92, baseType: !129, size: 64)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!130 = !{!131}
!131 = !DISubrange(count: 8)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !87, file: !3, line: 107, baseType: !133, size: 64, offset: 384)
!133 = !DICompositeType(tag: DW_TAG_array_type, baseType: !134, size: 64, elements: !135)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!135 = !{!136}
!136 = !DISubrange(count: 1)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "maxdepth", scope: !87, file: !3, line: 108, baseType: !12, size: 32, offset: 448)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "totface", scope: !87, file: !3, line: 110, baseType: !12, size: 32, offset: 480)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !87, file: !3, line: 112, baseType: !6, size: 32, offset: 512)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "distfac", scope: !87, file: !3, line: 113, baseType: !6, size: 32, offset: 544)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "dothreadedbuild", scope: !87, file: !3, line: 115, baseType: !12, size: 32, offset: 576)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "totbuildthread", scope: !87, file: !3, line: 116, baseType: !12, size: 32, offset: 608)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "doindirect", scope: !87, file: !3, line: 117, baseType: !12, size: 32, offset: 640)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !87, file: !3, line: 119, baseType: !145, size: 64, offset: 704)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "OcclusionCache", file: !3, line: 77, baseType: !147)
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "OcclusionCache", file: !3, line: 74, size: 256, elements: !148)
!148 = !{!149, !164, !165, !166, !167, !168}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "sample", scope: !147, file: !3, line: 75, baseType: !150, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "OcclusionCacheSample", file: !3, line: 72, baseType: !152)
!152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "OcclusionCacheSample", file: !3, line: 69, size: 640, elements: !153)
!153 = !{!154, !155, !156, !157, !158, !159, !160, !161, !162, !163}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !152, file: !3, line: 70, baseType: !96, size: 96)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !152, file: !3, line: 70, baseType: !96, size: 96, offset: 96)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "ao", scope: !152, file: !3, line: 70, baseType: !96, size: 96, offset: 192)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "env", scope: !152, file: !3, line: 70, baseType: !96, size: 96, offset: 288)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "indirect", scope: !152, file: !3, line: 70, baseType: !96, size: 96, offset: 384)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "intensity", scope: !152, file: !3, line: 70, baseType: !6, size: 32, offset: 480)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "dist2", scope: !152, file: !3, line: 70, baseType: !6, size: 32, offset: 512)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !152, file: !3, line: 71, baseType: !12, size: 32, offset: 544)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !152, file: !3, line: 71, baseType: !12, size: 32, offset: 576)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "filled", scope: !152, file: !3, line: 71, baseType: !12, size: 32, offset: 608)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !147, file: !3, line: 76, baseType: !12, size: 32, offset: 64)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !147, file: !3, line: 76, baseType: !12, size: 32, offset: 96)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !147, file: !3, line: 76, baseType: !12, size: 32, offset: 128)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !147, file: !3, line: 76, baseType: !12, size: 32, offset: 160)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !147, file: !3, line: 76, baseType: !12, size: 32, offset: 192)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "begin", scope: !82, file: !3, line: 134, baseType: !12, size: 32, offset: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !82, file: !3, line: 134, baseType: !12, size: 32, offset: 96)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !82, file: !3, line: 134, baseType: !12, size: 32, offset: 128)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !82, file: !3, line: 135, baseType: !109, size: 64, offset: 192)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "OcclusionThread", file: !3, line: 130, baseType: !175)
!175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "OcclusionThread", file: !3, line: 122, size: 448, elements: !176)
!176 = !{!177, !2773, !2776, !2777, !2778, !2779, !2780, !2781}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "re", scope: !175, file: !3, line: 123, baseType: !178, size: 64)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "Render", file: !180, line: 58, baseType: !181)
!180 = !DIFile(filename: "blender/source/blender/render/extern/include/RE_pipeline.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Render", file: !182, line: 126, size: 49920, elements: !183)
!182 = !DIFile(filename: "blender/source/blender/render/intern/include/render_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!183 = !{!184, !186, !187, !192, !193, !194, !195, !196, !197, !199, !2294, !2295, !2296, !2303, !2304, !2305, !2306, !2307, !2308, !2309, !2310, !2311, !2312, !2313, !2314, !2315, !2316, !2317, !2318, !2319, !2320, !2321, !2322, !2323, !2324, !2325, !2326, !2327, !2328, !2342, !2345, !2346, !2347, !2349, !2408, !2411, !2413, !2415, !2416, !2417, !2418, !2419, !2422, !2425, !2428, !2431, !2432, !2433, !2434, !2435, !2436, !2437, !2438, !2439, !2440, !2441, !2480, !2481, !2482, !2483, !2696, !2697, !2698, !2699, !2700, !2701, !2702, !2703, !2704, !2705, !2706, !2707, !2709, !2713, !2714, !2715, !2716, !2721, !2722, !2726, !2727, !2757, !2758, !2759, !2760, !2764, !2765, !2766, !2767, !2768, !2771, !2772}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !181, file: !182, line: 128, baseType: !185, size: 64)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !181, file: !182, line: 128, baseType: !185, size: 64, offset: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !181, file: !182, line: 129, baseType: !188, size: 592, offset: 128)
!188 = !DICompositeType(tag: DW_TAG_array_type, baseType: !189, size: 592, elements: !190)
!189 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!190 = !{!191}
!191 = !DISubrange(count: 74)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "slot", scope: !181, file: !182, line: 130, baseType: !12, size: 32, offset: 736)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !181, file: !182, line: 133, baseType: !79, size: 16, offset: 768)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "osa", scope: !181, file: !182, line: 133, baseType: !79, size: 16, offset: 784)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !181, file: !182, line: 133, baseType: !79, size: 16, offset: 800)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "result_ok", scope: !181, file: !182, line: 133, baseType: !79, size: 16, offset: 816)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "scene_color_manage", scope: !181, file: !182, line: 136, baseType: !198, size: 8, offset: 832)
!198 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !181, file: !182, line: 139, baseType: !200, size: 64, offset: 896)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderResult", file: !180, line: 148, baseType: !202)
!202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !180, line: 110, size: 1152, elements: !203)
!203 = !{!204, !206, !207, !208, !209, !210, !211, !213, !214, !215, !224, !225, !226, !233, !235, !2290, !2291, !2292, !2293}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !202, file: !180, line: 111, baseType: !205, size: 64)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !202, file: !180, line: 111, baseType: !205, size: 64, offset: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "rectx", scope: !202, file: !180, line: 114, baseType: !12, size: 32, offset: 128)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "recty", scope: !202, file: !180, line: 114, baseType: !12, size: 32, offset: 160)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !202, file: !180, line: 115, baseType: !79, size: 16, offset: 192)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "sample_nr", scope: !202, file: !180, line: 115, baseType: !79, size: 16, offset: 208)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "rect32", scope: !202, file: !180, line: 118, baseType: !212, size: 64, offset: 256)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "rectf", scope: !202, file: !180, line: 120, baseType: !7, size: 64, offset: 320)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "rectz", scope: !202, file: !180, line: 122, baseType: !7, size: 64, offset: 384)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "tilerect", scope: !202, file: !180, line: 125, baseType: !216, size: 128, offset: 448)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "rcti", file: !217, line: 89, baseType: !218)
!217 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!218 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rcti", file: !217, line: 86, size: 128, elements: !219)
!219 = !{!220, !221, !222, !223}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !218, file: !217, line: 87, baseType: !12, size: 32)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !218, file: !217, line: 87, baseType: !12, size: 32, offset: 32)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !218, file: !217, line: 88, baseType: !12, size: 32, offset: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !218, file: !217, line: 88, baseType: !12, size: 32, offset: 96)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "xof", scope: !202, file: !180, line: 127, baseType: !12, size: 32, offset: 576)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "yof", scope: !202, file: !180, line: 127, baseType: !12, size: 32, offset: 608)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !202, file: !180, line: 130, baseType: !227, size: 128, offset: 640)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !228, line: 71, baseType: !229)
!228 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!229 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !228, line: 69, size: 128, elements: !230)
!230 = !{!231, !232}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !229, file: !228, line: 70, baseType: !64, size: 64)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !229, file: !228, line: 70, baseType: !64, size: 64, offset: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "renrect", scope: !202, file: !180, line: 133, baseType: !234, size: 128, offset: 768)
!234 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !216)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "renlay", scope: !202, file: !180, line: 134, baseType: !236, size: 64, offset: 896)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!237 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !238)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderLayer", file: !180, line: 108, baseType: !239)
!239 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderLayer", file: !180, line: 85, size: 1600, elements: !240)
!240 = !{!241, !243, !244, !245, !246, !247, !248, !249, !250, !251, !2281, !2282, !2283, !2284, !2285, !2286, !2287, !2288, !2289}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !239, file: !180, line: 86, baseType: !242, size: 64)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !239, file: !180, line: 86, baseType: !242, size: 64, offset: 64)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !239, file: !180, line: 89, baseType: !188, size: 592, offset: 128)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !239, file: !180, line: 90, baseType: !48, size: 32, offset: 736)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "lay_zmask", scope: !239, file: !180, line: 90, baseType: !48, size: 32, offset: 768)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "lay_exclude", scope: !239, file: !180, line: 90, baseType: !48, size: 32, offset: 800)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "layflag", scope: !239, file: !180, line: 91, baseType: !12, size: 32, offset: 832)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "passflag", scope: !239, file: !180, line: 91, baseType: !12, size: 32, offset: 864)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "pass_xor", scope: !239, file: !180, line: 91, baseType: !12, size: 32, offset: 896)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "mat_override", scope: !239, file: !180, line: 93, baseType: !252, size: 64, offset: 960)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!253 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !254, line: 93, size: 7552, elements: !255)
!254 = !DIFile(filename: "blender/source/blender/makesdna/DNA_material_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!255 = !{!256, !318, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !367, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !436, !437, !438, !439, !440, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !2240, !2241, !2242, !2243, !2244, !2245, !2246, !2247, !2248, !2249, !2250, !2251, !2252, !2253, !2254, !2255, !2256, !2257, !2258, !2259, !2260, !2261, !2262, !2263, !2264, !2265, !2266, !2267, !2268, !2269, !2270, !2271, !2272, !2280}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !253, file: !254, line: 94, baseType: !257, size: 960)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !258, line: 130, baseType: !259)
!258 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!259 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !258, line: 117, size: 960, elements: !260)
!260 = !{!261, !262, !263, !265, !284, !288, !289, !290, !291, !292}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !259, file: !258, line: 118, baseType: !64, size: 64)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !259, file: !258, line: 118, baseType: !64, size: 64, offset: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !259, file: !258, line: 119, baseType: !264, size: 64, offset: 128)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !259, file: !258, line: 120, baseType: !266, size: 64, offset: 192)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!267 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !258, line: 136, size: 17600, elements: !268)
!268 = !{!269, !270, !272, !275, !279, !280, !281}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !267, file: !258, line: 137, baseType: !257, size: 960)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !267, file: !258, line: 138, baseType: !271, size: 64, offset: 960)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !267, file: !258, line: 139, baseType: !273, size: 64, offset: 1024)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!274 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !258, line: 43, flags: DIFlagFwdDecl)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !267, file: !258, line: 140, baseType: !276, size: 8192, offset: 1088)
!276 = !DICompositeType(tag: DW_TAG_array_type, baseType: !189, size: 8192, elements: !277)
!277 = !{!278}
!278 = !DISubrange(count: 1024)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !267, file: !258, line: 141, baseType: !276, size: 8192, offset: 9280)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !267, file: !258, line: 148, baseType: !266, size: 64, offset: 17472)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !267, file: !258, line: 150, baseType: !282, size: 64, offset: 17536)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!283 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !258, line: 45, flags: DIFlagFwdDecl)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !259, file: !258, line: 121, baseType: !285, size: 528, offset: 256)
!285 = !DICompositeType(tag: DW_TAG_array_type, baseType: !189, size: 528, elements: !286)
!286 = !{!287}
!287 = !DISubrange(count: 66)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !259, file: !258, line: 126, baseType: !79, size: 16, offset: 784)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !259, file: !258, line: 127, baseType: !12, size: 32, offset: 800)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !259, file: !258, line: 128, baseType: !12, size: 32, offset: 832)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !259, file: !258, line: 128, baseType: !12, size: 32, offset: 864)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !259, file: !258, line: 129, baseType: !293, size: 64, offset: 896)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !258, line: 75, baseType: !295)
!295 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !258, line: 62, size: 1024, elements: !296)
!296 = !{!297, !299, !300, !301, !302, !303, !307, !308, !316, !317}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !295, file: !258, line: 63, baseType: !298, size: 64)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !295, file: !258, line: 63, baseType: !298, size: 64, offset: 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !295, file: !258, line: 64, baseType: !189, size: 8, offset: 128)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !295, file: !258, line: 64, baseType: !189, size: 8, offset: 136)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !295, file: !258, line: 65, baseType: !79, size: 16, offset: 144)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !295, file: !258, line: 66, baseType: !304, size: 512, offset: 160)
!304 = !DICompositeType(tag: DW_TAG_array_type, baseType: !189, size: 512, elements: !305)
!305 = !{!306}
!306 = !DISubrange(count: 64)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !295, file: !258, line: 67, baseType: !12, size: 32, offset: 672)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !295, file: !258, line: 69, baseType: !309, size: 256, offset: 704)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !258, line: 60, baseType: !310)
!310 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !258, line: 48, size: 256, elements: !311)
!311 = !{!312, !313, !314, !315}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !310, file: !258, line: 49, baseType: !64, size: 64)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !310, file: !258, line: 58, baseType: !227, size: 128, offset: 64)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !310, file: !258, line: 59, baseType: !12, size: 32, offset: 192)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !310, file: !258, line: 59, baseType: !12, size: 32, offset: 224)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !295, file: !258, line: 70, baseType: !12, size: 32, offset: 960)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !295, file: !258, line: 74, baseType: !12, size: 32, offset: 992)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !253, file: !254, line: 95, baseType: !319, size: 64, offset: 960)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!320 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !254, line: 48, flags: DIFlagFwdDecl)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "material_type", scope: !253, file: !254, line: 97, baseType: !79, size: 16, offset: 1024)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !253, file: !254, line: 97, baseType: !79, size: 16, offset: 1040)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !253, file: !254, line: 99, baseType: !6, size: 32, offset: 1056)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !253, file: !254, line: 99, baseType: !6, size: 32, offset: 1088)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !253, file: !254, line: 99, baseType: !6, size: 32, offset: 1120)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "specr", scope: !253, file: !254, line: 100, baseType: !6, size: 32, offset: 1152)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "specg", scope: !253, file: !254, line: 100, baseType: !6, size: 32, offset: 1184)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "specb", scope: !253, file: !254, line: 100, baseType: !6, size: 32, offset: 1216)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "mirr", scope: !253, file: !254, line: 101, baseType: !6, size: 32, offset: 1248)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "mirg", scope: !253, file: !254, line: 101, baseType: !6, size: 32, offset: 1280)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "mirb", scope: !253, file: !254, line: 101, baseType: !6, size: 32, offset: 1312)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "ambr", scope: !253, file: !254, line: 102, baseType: !6, size: 32, offset: 1344)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "ambb", scope: !253, file: !254, line: 102, baseType: !6, size: 32, offset: 1376)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "ambg", scope: !253, file: !254, line: 102, baseType: !6, size: 32, offset: 1408)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "amb", scope: !253, file: !254, line: 103, baseType: !6, size: 32, offset: 1440)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "emit", scope: !253, file: !254, line: 103, baseType: !6, size: 32, offset: 1472)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "ang", scope: !253, file: !254, line: 103, baseType: !6, size: 32, offset: 1504)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "spectra", scope: !253, file: !254, line: 103, baseType: !6, size: 32, offset: 1536)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "ray_mirror", scope: !253, file: !254, line: 103, baseType: !6, size: 32, offset: 1568)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !253, file: !254, line: 104, baseType: !6, size: 32, offset: 1600)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !253, file: !254, line: 104, baseType: !6, size: 32, offset: 1632)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "spec", scope: !253, file: !254, line: 104, baseType: !6, size: 32, offset: 1664)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "zoffs", scope: !253, file: !254, line: 104, baseType: !6, size: 32, offset: 1696)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "add", scope: !253, file: !254, line: 104, baseType: !6, size: 32, offset: 1728)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "translucency", scope: !253, file: !254, line: 105, baseType: !6, size: 32, offset: 1760)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "vol", scope: !253, file: !254, line: 108, baseType: !347, size: 704, offset: 1792)
!347 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VolumeSettings", file: !254, line: 53, size: 704, elements: !348)
!348 = !{!349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "density", scope: !347, file: !254, line: 54, baseType: !6, size: 32)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "emission", scope: !347, file: !254, line: 55, baseType: !6, size: 32, offset: 32)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "scattering", scope: !347, file: !254, line: 56, baseType: !6, size: 32, offset: 64)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "reflection", scope: !347, file: !254, line: 57, baseType: !6, size: 32, offset: 96)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "emission_col", scope: !347, file: !254, line: 59, baseType: !96, size: 96, offset: 128)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "transmission_col", scope: !347, file: !254, line: 60, baseType: !96, size: 96, offset: 224)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "reflection_col", scope: !347, file: !254, line: 61, baseType: !96, size: 96, offset: 320)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "density_scale", scope: !347, file: !254, line: 63, baseType: !6, size: 32, offset: 416)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "depth_cutoff", scope: !347, file: !254, line: 64, baseType: !6, size: 32, offset: 448)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "asymmetry", scope: !347, file: !254, line: 65, baseType: !6, size: 32, offset: 480)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "stepsize_type", scope: !347, file: !254, line: 67, baseType: !79, size: 16, offset: 512)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "shadeflag", scope: !347, file: !254, line: 68, baseType: !79, size: 16, offset: 528)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "shade_type", scope: !347, file: !254, line: 69, baseType: !79, size: 16, offset: 544)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "precache_resolution", scope: !347, file: !254, line: 70, baseType: !79, size: 16, offset: 560)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "stepsize", scope: !347, file: !254, line: 72, baseType: !6, size: 32, offset: 576)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "ms_diff", scope: !347, file: !254, line: 73, baseType: !6, size: 32, offset: 608)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "ms_intensity", scope: !347, file: !254, line: 74, baseType: !6, size: 32, offset: 640)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "ms_spread", scope: !347, file: !254, line: 75, baseType: !6, size: 32, offset: 672)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "game", scope: !253, file: !254, line: 109, baseType: !368, size: 128, offset: 2496)
!368 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GameSettings", file: !254, line: 79, size: 128, elements: !369)
!369 = !{!370, !371, !372, !373}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !368, file: !254, line: 80, baseType: !12, size: 32)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_blend", scope: !368, file: !254, line: 81, baseType: !12, size: 32, offset: 32)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "face_orientation", scope: !368, file: !254, line: 82, baseType: !12, size: 32, offset: 64)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !368, file: !254, line: 83, baseType: !12, size: 32, offset: 96)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_mir", scope: !253, file: !254, line: 111, baseType: !6, size: 32, offset: 2624)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_mir_i", scope: !253, file: !254, line: 111, baseType: !6, size: 32, offset: 2656)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_tra", scope: !253, file: !254, line: 112, baseType: !6, size: 32, offset: 2688)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_tra_i", scope: !253, file: !254, line: 112, baseType: !6, size: 32, offset: 2720)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !253, file: !254, line: 113, baseType: !6, size: 32, offset: 2752)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "tx_limit", scope: !253, file: !254, line: 114, baseType: !6, size: 32, offset: 2784)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "tx_falloff", scope: !253, file: !254, line: 114, baseType: !6, size: 32, offset: 2816)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "ray_depth", scope: !253, file: !254, line: 115, baseType: !79, size: 16, offset: 2848)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "ray_depth_tra", scope: !253, file: !254, line: 115, baseType: !79, size: 16, offset: 2864)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "har", scope: !253, file: !254, line: 116, baseType: !79, size: 16, offset: 2880)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "seed1", scope: !253, file: !254, line: 117, baseType: !189, size: 8, offset: 2896)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "seed2", scope: !253, file: !254, line: 117, baseType: !189, size: 8, offset: 2904)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "gloss_mir", scope: !253, file: !254, line: 119, baseType: !6, size: 32, offset: 2912)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "gloss_tra", scope: !253, file: !254, line: 119, baseType: !6, size: 32, offset: 2944)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "samp_gloss_mir", scope: !253, file: !254, line: 120, baseType: !79, size: 16, offset: 2976)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "samp_gloss_tra", scope: !253, file: !254, line: 120, baseType: !79, size: 16, offset: 2992)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "adapt_thresh_mir", scope: !253, file: !254, line: 121, baseType: !6, size: 32, offset: 3008)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "adapt_thresh_tra", scope: !253, file: !254, line: 121, baseType: !6, size: 32, offset: 3040)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "aniso_gloss_mir", scope: !253, file: !254, line: 122, baseType: !6, size: 32, offset: 3072)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "dist_mir", scope: !253, file: !254, line: 123, baseType: !6, size: 32, offset: 3104)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "fadeto_mir", scope: !253, file: !254, line: 124, baseType: !79, size: 16, offset: 3136)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "shade_flag", scope: !253, file: !254, line: 125, baseType: !79, size: 16, offset: 3152)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !253, file: !254, line: 127, baseType: !12, size: 32, offset: 3168)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "mode_l", scope: !253, file: !254, line: 127, baseType: !12, size: 32, offset: 3200)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "mode2", scope: !253, file: !254, line: 128, baseType: !12, size: 32, offset: 3232)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "mode2_l", scope: !253, file: !254, line: 128, baseType: !12, size: 32, offset: 3264)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "flarec", scope: !253, file: !254, line: 129, baseType: !79, size: 16, offset: 3296)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "starc", scope: !253, file: !254, line: 129, baseType: !79, size: 16, offset: 3312)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "linec", scope: !253, file: !254, line: 129, baseType: !79, size: 16, offset: 3328)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "ringc", scope: !253, file: !254, line: 129, baseType: !79, size: 16, offset: 3344)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "hasize", scope: !253, file: !254, line: 130, baseType: !6, size: 32, offset: 3360)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "flaresize", scope: !253, file: !254, line: 130, baseType: !6, size: 32, offset: 3392)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "subsize", scope: !253, file: !254, line: 130, baseType: !6, size: 32, offset: 3424)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "flareboost", scope: !253, file: !254, line: 130, baseType: !6, size: 32, offset: 3456)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "strand_sta", scope: !253, file: !254, line: 131, baseType: !6, size: 32, offset: 3488)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "strand_end", scope: !253, file: !254, line: 131, baseType: !6, size: 32, offset: 3520)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "strand_ease", scope: !253, file: !254, line: 131, baseType: !6, size: 32, offset: 3552)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "strand_surfnor", scope: !253, file: !254, line: 131, baseType: !6, size: 32, offset: 3584)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "strand_min", scope: !253, file: !254, line: 132, baseType: !6, size: 32, offset: 3616)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "strand_widthfade", scope: !253, file: !254, line: 132, baseType: !6, size: 32, offset: 3648)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "strand_uvname", scope: !253, file: !254, line: 133, baseType: !304, size: 512, offset: 3680)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "sbias", scope: !253, file: !254, line: 135, baseType: !6, size: 32, offset: 4192)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "lbias", scope: !253, file: !254, line: 136, baseType: !6, size: 32, offset: 4224)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "shad_alpha", scope: !253, file: !254, line: 137, baseType: !6, size: 32, offset: 4256)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "septex", scope: !253, file: !254, line: 138, baseType: !12, size: 32, offset: 4288)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "rgbsel", scope: !253, file: !254, line: 141, baseType: !189, size: 8, offset: 4320)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "texact", scope: !253, file: !254, line: 141, baseType: !189, size: 8, offset: 4328)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "pr_type", scope: !253, file: !254, line: 141, baseType: !189, size: 8, offset: 4336)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !253, file: !254, line: 141, baseType: !189, size: 8, offset: 4344)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "pr_lamp", scope: !253, file: !254, line: 142, baseType: !79, size: 16, offset: 4352)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "pr_texture", scope: !253, file: !254, line: 142, baseType: !79, size: 16, offset: 4368)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flag", scope: !253, file: !254, line: 142, baseType: !79, size: 16, offset: 4384)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "mapflag", scope: !253, file: !254, line: 145, baseType: !189, size: 8, offset: 4400)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !253, file: !254, line: 145, baseType: !189, size: 8, offset: 4408)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "diff_shader", scope: !253, file: !254, line: 148, baseType: !79, size: 16, offset: 4416)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "spec_shader", scope: !253, file: !254, line: 148, baseType: !79, size: 16, offset: 4432)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "roughness", scope: !253, file: !254, line: 149, baseType: !6, size: 32, offset: 4448)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "refrac", scope: !253, file: !254, line: 149, baseType: !6, size: 32, offset: 4480)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !253, file: !254, line: 152, baseType: !433, size: 128, offset: 4512)
!433 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 128, elements: !434)
!434 = !{!435}
!435 = !DISubrange(count: 4)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "rms", scope: !253, file: !254, line: 153, baseType: !6, size: 32, offset: 4640)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "darkness", scope: !253, file: !254, line: 154, baseType: !6, size: 32, offset: 4672)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !253, file: !254, line: 157, baseType: !79, size: 16, offset: 4704)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !253, file: !254, line: 157, baseType: !79, size: 16, offset: 4720)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_col", scope: !253, file: !254, line: 160, baseType: !441, size: 64, offset: 4736)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64)
!442 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorBand", file: !443, line: 113, size: 6208, elements: !444)
!443 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!444 = !{!445, !446, !447, !448, !449, !450, !452}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !442, file: !443, line: 114, baseType: !79, size: 16)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !442, file: !443, line: 114, baseType: !79, size: 16, offset: 16)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype", scope: !442, file: !443, line: 115, baseType: !189, size: 8, offset: 32)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype_hue", scope: !442, file: !443, line: 115, baseType: !189, size: 8, offset: 40)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "color_mode", scope: !442, file: !443, line: 116, baseType: !189, size: 8, offset: 48)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !442, file: !443, line: 117, baseType: !451, size: 8, offset: 56)
!451 = !DICompositeType(tag: DW_TAG_array_type, baseType: !189, size: 8, elements: !135)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !442, file: !443, line: 119, baseType: !453, size: 6144, offset: 64)
!453 = !DICompositeType(tag: DW_TAG_array_type, baseType: !454, size: 6144, elements: !463)
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "CBData", file: !443, line: 109, baseType: !455)
!455 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CBData", file: !443, line: 106, size: 192, elements: !456)
!456 = !{!457, !458, !459, !460, !461, !462}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !455, file: !443, line: 107, baseType: !6, size: 32)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !455, file: !443, line: 107, baseType: !6, size: 32, offset: 32)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !455, file: !443, line: 107, baseType: !6, size: 32, offset: 64)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !455, file: !443, line: 107, baseType: !6, size: 32, offset: 96)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !455, file: !443, line: 107, baseType: !6, size: 32, offset: 128)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !455, file: !443, line: 108, baseType: !12, size: 32, offset: 160)
!463 = !{!464}
!464 = !DISubrange(count: 32)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_spec", scope: !253, file: !254, line: 161, baseType: !441, size: 64, offset: 4800)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "rampin_col", scope: !253, file: !254, line: 162, baseType: !189, size: 8, offset: 4864)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "rampin_spec", scope: !253, file: !254, line: 162, baseType: !189, size: 8, offset: 4872)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "rampblend_col", scope: !253, file: !254, line: 163, baseType: !189, size: 8, offset: 4880)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "rampblend_spec", scope: !253, file: !254, line: 163, baseType: !189, size: 8, offset: 4888)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_show", scope: !253, file: !254, line: 164, baseType: !79, size: 16, offset: 4896)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !253, file: !254, line: 164, baseType: !79, size: 16, offset: 4912)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "rampfac_col", scope: !253, file: !254, line: 165, baseType: !6, size: 32, offset: 4928)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "rampfac_spec", scope: !253, file: !254, line: 165, baseType: !6, size: 32, offset: 4960)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "mtex", scope: !253, file: !254, line: 167, baseType: !475, size: 1152, offset: 4992)
!475 = !DICompositeType(tag: DW_TAG_array_type, baseType: !476, size: 1152, elements: !2238)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64)
!477 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTex", file: !443, line: 57, size: 2496, elements: !478)
!478 = !{!479, !480, !481, !482, !483, !2035, !2179, !2180, !2181, !2182, !2183, !2184, !2185, !2186, !2187, !2188, !2189, !2190, !2191, !2192, !2193, !2194, !2195, !2196, !2197, !2198, !2199, !2200, !2201, !2202, !2203, !2204, !2205, !2206, !2207, !2208, !2209, !2210, !2211, !2212, !2213, !2214, !2215, !2216, !2217, !2218, !2219, !2220, !2221, !2222, !2223, !2224, !2225, !2226, !2227, !2228, !2229, !2230, !2231, !2232, !2233, !2234, !2235, !2236, !2237}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !477, file: !443, line: 59, baseType: !79, size: 16)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !477, file: !443, line: 59, baseType: !79, size: 16, offset: 16)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "maptoneg", scope: !477, file: !443, line: 59, baseType: !79, size: 16, offset: 32)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "blendtype", scope: !477, file: !443, line: 59, baseType: !79, size: 16, offset: 48)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !477, file: !443, line: 60, baseType: !484, size: 64, offset: 64)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!485 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !47, line: 115, size: 11392, elements: !486)
!486 = !{!487, !488, !489, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !506, !515, !529, !530, !572, !573, !576, !577, !593, !594, !595, !596, !597, !598, !599, !601, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !678, !679, !680, !681, !682, !683, !684, !685, !686, !689, !692, !695, !696, !697, !698, !699, !702, !705, !709, !710, !716, !717, !718, !719, !720, !721, !723, !726, !729, !733, !2023, !2024}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !485, file: !47, line: 116, baseType: !257, size: 960)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !485, file: !47, line: 117, baseType: !319, size: 64, offset: 960)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !485, file: !47, line: 119, baseType: !490, size: 64, offset: 1024)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64)
!491 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !47, line: 57, flags: DIFlagFwdDecl)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !485, file: !47, line: 121, baseType: !79, size: 16, offset: 1088)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !485, file: !47, line: 121, baseType: !79, size: 16, offset: 1104)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !485, file: !47, line: 122, baseType: !12, size: 32, offset: 1120)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !485, file: !47, line: 122, baseType: !12, size: 32, offset: 1152)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !485, file: !47, line: 122, baseType: !12, size: 32, offset: 1184)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !485, file: !47, line: 123, baseType: !304, size: 512, offset: 1216)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !485, file: !47, line: 124, baseType: !484, size: 64, offset: 1728)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !485, file: !47, line: 124, baseType: !484, size: 64, offset: 1792)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !485, file: !47, line: 127, baseType: !484, size: 64, offset: 1856)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !485, file: !47, line: 127, baseType: !484, size: 64, offset: 1920)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !485, file: !47, line: 127, baseType: !484, size: 64, offset: 1984)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !485, file: !47, line: 128, baseType: !504, size: 64, offset: 2048)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64)
!505 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !254, line: 49, flags: DIFlagFwdDecl)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !485, file: !47, line: 130, baseType: !507, size: 64, offset: 2112)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64)
!508 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !47, line: 97, size: 832, elements: !509)
!509 = !{!510, !513, !514}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !508, file: !47, line: 98, baseType: !511, size: 768)
!511 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 768, elements: !512)
!512 = !{!131, !98}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !508, file: !47, line: 99, baseType: !12, size: 32, offset: 768)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !508, file: !47, line: 99, baseType: !12, size: 32, offset: 800)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !485, file: !47, line: 131, baseType: !516, size: 64, offset: 2176)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64)
!517 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !518, line: 486, size: 1600, elements: !519)
!518 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!519 = !{!520, !521, !522, !523, !524, !525, !526, !527, !528}
!520 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !517, file: !518, line: 487, baseType: !257, size: 960)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !517, file: !518, line: 489, baseType: !227, size: 128, offset: 960)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !517, file: !518, line: 490, baseType: !227, size: 128, offset: 1088)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !517, file: !518, line: 491, baseType: !227, size: 128, offset: 1216)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !517, file: !518, line: 492, baseType: !227, size: 128, offset: 1344)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !517, file: !518, line: 494, baseType: !12, size: 32, offset: 1472)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !517, file: !518, line: 495, baseType: !12, size: 32, offset: 1504)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !517, file: !518, line: 497, baseType: !12, size: 32, offset: 1536)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !517, file: !518, line: 498, baseType: !12, size: 32, offset: 1568)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !485, file: !47, line: 132, baseType: !516, size: 64, offset: 2240)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !485, file: !47, line: 133, baseType: !531, size: 64, offset: 2304)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64)
!532 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !518, line: 334, size: 1728, elements: !533)
!533 = !{!534, !535, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !571}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !532, file: !518, line: 335, baseType: !227, size: 128)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !532, file: !518, line: 336, baseType: !536, size: 64, offset: 128)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !538, line: 48, flags: DIFlagFwdDecl)
!538 = !DIFile(filename: "blender/source/blender/blenlib/BLI_ghash.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!539 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !532, file: !518, line: 338, baseType: !79, size: 16, offset: 192)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !532, file: !518, line: 338, baseType: !79, size: 16, offset: 208)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !532, file: !518, line: 339, baseType: !48, size: 32, offset: 224)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !532, file: !518, line: 340, baseType: !12, size: 32, offset: 256)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !532, file: !518, line: 342, baseType: !6, size: 32, offset: 288)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !532, file: !518, line: 343, baseType: !96, size: 96, offset: 320)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !532, file: !518, line: 344, baseType: !96, size: 96, offset: 416)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !532, file: !518, line: 347, baseType: !227, size: 128, offset: 512)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !532, file: !518, line: 349, baseType: !12, size: 32, offset: 640)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !532, file: !518, line: 350, baseType: !12, size: 32, offset: 672)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !532, file: !518, line: 351, baseType: !64, size: 64, offset: 704)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !532, file: !518, line: 352, baseType: !64, size: 64, offset: 768)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !532, file: !518, line: 354, baseType: !552, size: 384, offset: 832)
!552 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !518, line: 116, baseType: !553)
!553 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !518, line: 94, size: 384, elements: !554)
!554 = !{!555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !553, file: !518, line: 96, baseType: !12, size: 32)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !553, file: !518, line: 96, baseType: !12, size: 32, offset: 32)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !553, file: !518, line: 97, baseType: !12, size: 32, offset: 64)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !553, file: !518, line: 97, baseType: !12, size: 32, offset: 96)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !553, file: !518, line: 99, baseType: !79, size: 16, offset: 128)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !553, file: !518, line: 100, baseType: !79, size: 16, offset: 144)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !553, file: !518, line: 102, baseType: !79, size: 16, offset: 160)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !553, file: !518, line: 105, baseType: !79, size: 16, offset: 176)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !553, file: !518, line: 108, baseType: !79, size: 16, offset: 192)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !553, file: !518, line: 109, baseType: !79, size: 16, offset: 208)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !553, file: !518, line: 111, baseType: !79, size: 16, offset: 224)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !553, file: !518, line: 112, baseType: !79, size: 16, offset: 240)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !553, file: !518, line: 114, baseType: !12, size: 32, offset: 256)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !553, file: !518, line: 114, baseType: !12, size: 32, offset: 288)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !553, file: !518, line: 115, baseType: !12, size: 32, offset: 320)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !553, file: !518, line: 115, baseType: !12, size: 32, offset: 352)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !532, file: !518, line: 355, baseType: !304, size: 512, offset: 1216)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !485, file: !47, line: 134, baseType: !64, size: 64, offset: 2368)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !485, file: !47, line: 136, baseType: !574, size: 64, offset: 2432)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64)
!575 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !11, line: 61, flags: DIFlagFwdDecl)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !485, file: !47, line: 138, baseType: !552, size: 384, offset: 2496)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !485, file: !47, line: 139, baseType: !578, size: 64, offset: 2880)
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64)
!579 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !518, line: 80, baseType: !580)
!580 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !518, line: 72, size: 192, elements: !581)
!581 = !{!582, !589, !590, !591, !592}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !580, file: !518, line: 73, baseType: !583, size: 64)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64)
!584 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !518, line: 59, baseType: !585)
!585 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !518, line: 56, size: 128, elements: !586)
!586 = !{!587, !588}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !585, file: !518, line: 57, baseType: !96, size: 96)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !585, file: !518, line: 58, baseType: !12, size: 32, offset: 96)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !580, file: !518, line: 74, baseType: !12, size: 32, offset: 64)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !580, file: !518, line: 76, baseType: !12, size: 32, offset: 96)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !580, file: !518, line: 77, baseType: !12, size: 32, offset: 128)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !580, file: !518, line: 79, baseType: !12, size: 32, offset: 160)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !485, file: !47, line: 141, baseType: !227, size: 128, offset: 2944)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !485, file: !47, line: 142, baseType: !227, size: 128, offset: 3072)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !485, file: !47, line: 143, baseType: !227, size: 128, offset: 3200)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !485, file: !47, line: 144, baseType: !227, size: 128, offset: 3328)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !485, file: !47, line: 146, baseType: !12, size: 32, offset: 3456)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !485, file: !47, line: 147, baseType: !12, size: 32, offset: 3488)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !485, file: !47, line: 150, baseType: !600, size: 64, offset: 3520)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !485, file: !47, line: 151, baseType: !602, size: 64, offset: 3584)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !485, file: !47, line: 152, baseType: !12, size: 32, offset: 3648)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !485, file: !47, line: 153, baseType: !12, size: 32, offset: 3680)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !485, file: !47, line: 156, baseType: !96, size: 96, offset: 3712)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !485, file: !47, line: 156, baseType: !96, size: 96, offset: 3808)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !485, file: !47, line: 156, baseType: !96, size: 96, offset: 3904)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !485, file: !47, line: 157, baseType: !96, size: 96, offset: 4000)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !485, file: !47, line: 158, baseType: !96, size: 96, offset: 4096)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !485, file: !47, line: 159, baseType: !96, size: 96, offset: 4192)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !485, file: !47, line: 160, baseType: !96, size: 96, offset: 4288)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !485, file: !47, line: 160, baseType: !96, size: 96, offset: 4384)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !485, file: !47, line: 161, baseType: !433, size: 128, offset: 4480)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !485, file: !47, line: 161, baseType: !433, size: 128, offset: 4608)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !485, file: !47, line: 162, baseType: !96, size: 96, offset: 4736)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !485, file: !47, line: 162, baseType: !96, size: 96, offset: 4832)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !485, file: !47, line: 163, baseType: !6, size: 32, offset: 4928)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !485, file: !47, line: 163, baseType: !6, size: 32, offset: 4960)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !485, file: !47, line: 164, baseType: !620, size: 512, offset: 4992)
!620 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 512, elements: !621)
!621 = !{!435, !435}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !485, file: !47, line: 165, baseType: !620, size: 512, offset: 5504)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !485, file: !47, line: 166, baseType: !620, size: 512, offset: 6016)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !485, file: !47, line: 167, baseType: !620, size: 512, offset: 6528)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !485, file: !47, line: 176, baseType: !620, size: 512, offset: 7040)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !485, file: !47, line: 178, baseType: !48, size: 32, offset: 7552)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !485, file: !47, line: 180, baseType: !79, size: 16, offset: 7584)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !485, file: !47, line: 181, baseType: !79, size: 16, offset: 7600)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !485, file: !47, line: 183, baseType: !79, size: 16, offset: 7616)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !485, file: !47, line: 183, baseType: !79, size: 16, offset: 7632)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !485, file: !47, line: 184, baseType: !79, size: 16, offset: 7648)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !485, file: !47, line: 184, baseType: !79, size: 16, offset: 7664)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !485, file: !47, line: 185, baseType: !79, size: 16, offset: 7680)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !485, file: !47, line: 186, baseType: !79, size: 16, offset: 7696)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !485, file: !47, line: 187, baseType: !79, size: 16, offset: 7712)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !485, file: !47, line: 188, baseType: !189, size: 8, offset: 7728)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !485, file: !47, line: 189, baseType: !189, size: 8, offset: 7736)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !485, file: !47, line: 192, baseType: !12, size: 32, offset: 7744)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !485, file: !47, line: 192, baseType: !12, size: 32, offset: 7776)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !485, file: !47, line: 192, baseType: !12, size: 32, offset: 7808)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !485, file: !47, line: 192, baseType: !12, size: 32, offset: 7840)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !485, file: !47, line: 194, baseType: !12, size: 32, offset: 7872)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !485, file: !47, line: 202, baseType: !6, size: 32, offset: 7904)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !485, file: !47, line: 202, baseType: !6, size: 32, offset: 7936)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !485, file: !47, line: 202, baseType: !6, size: 32, offset: 7968)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !485, file: !47, line: 211, baseType: !6, size: 32, offset: 8000)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !485, file: !47, line: 212, baseType: !6, size: 32, offset: 8032)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !485, file: !47, line: 213, baseType: !6, size: 32, offset: 8064)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !485, file: !47, line: 214, baseType: !6, size: 32, offset: 8096)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !485, file: !47, line: 215, baseType: !6, size: 32, offset: 8128)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !485, file: !47, line: 216, baseType: !6, size: 32, offset: 8160)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !485, file: !47, line: 219, baseType: !6, size: 32, offset: 8192)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !485, file: !47, line: 220, baseType: !6, size: 32, offset: 8224)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !485, file: !47, line: 221, baseType: !6, size: 32, offset: 8256)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !485, file: !47, line: 224, baseType: !77, size: 16, offset: 8288)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !485, file: !47, line: 224, baseType: !77, size: 16, offset: 8304)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !485, file: !47, line: 226, baseType: !79, size: 16, offset: 8320)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !485, file: !47, line: 228, baseType: !189, size: 8, offset: 8336)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !485, file: !47, line: 229, baseType: !189, size: 8, offset: 8344)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !485, file: !47, line: 231, baseType: !79, size: 16, offset: 8352)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !485, file: !47, line: 232, baseType: !189, size: 8, offset: 8368)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !485, file: !47, line: 233, baseType: !189, size: 8, offset: 8376)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !485, file: !47, line: 234, baseType: !6, size: 32, offset: 8384)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !485, file: !47, line: 235, baseType: !6, size: 32, offset: 8416)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !485, file: !47, line: 237, baseType: !227, size: 128, offset: 8448)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !485, file: !47, line: 238, baseType: !227, size: 128, offset: 8576)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !485, file: !47, line: 239, baseType: !227, size: 128, offset: 8704)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !485, file: !47, line: 240, baseType: !227, size: 128, offset: 8832)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !485, file: !47, line: 242, baseType: !6, size: 32, offset: 8960)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !485, file: !47, line: 244, baseType: !79, size: 16, offset: 8992)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !485, file: !47, line: 245, baseType: !77, size: 16, offset: 9008)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !485, file: !47, line: 246, baseType: !433, size: 128, offset: 9024)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !485, file: !47, line: 248, baseType: !12, size: 32, offset: 9152)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !485, file: !47, line: 249, baseType: !12, size: 32, offset: 9184)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !485, file: !47, line: 251, baseType: !676, size: 64, offset: 9216)
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 64)
!677 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !47, line: 251, flags: DIFlagFwdDecl)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !485, file: !47, line: 253, baseType: !189, size: 8, offset: 9280)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !485, file: !47, line: 254, baseType: !189, size: 8, offset: 9288)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !485, file: !47, line: 255, baseType: !79, size: 16, offset: 9296)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !485, file: !47, line: 256, baseType: !96, size: 96, offset: 9312)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !485, file: !47, line: 258, baseType: !227, size: 128, offset: 9408)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !485, file: !47, line: 259, baseType: !227, size: 128, offset: 9536)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !485, file: !47, line: 260, baseType: !227, size: 128, offset: 9664)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !485, file: !47, line: 261, baseType: !227, size: 128, offset: 9792)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !485, file: !47, line: 263, baseType: !687, size: 64, offset: 9920)
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 64)
!688 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !47, line: 52, flags: DIFlagFwdDecl)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !485, file: !47, line: 264, baseType: !690, size: 64, offset: 9984)
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 64)
!691 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !47, line: 53, flags: DIFlagFwdDecl)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !485, file: !47, line: 265, baseType: !693, size: 64, offset: 10048)
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 64)
!694 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !254, line: 46, flags: DIFlagFwdDecl)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !485, file: !47, line: 267, baseType: !189, size: 8, offset: 10112)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !485, file: !47, line: 268, baseType: !189, size: 8, offset: 10120)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !485, file: !47, line: 269, baseType: !79, size: 16, offset: 10128)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !485, file: !47, line: 270, baseType: !6, size: 32, offset: 10144)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !485, file: !47, line: 272, baseType: !700, size: 64, offset: 10176)
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !701, size: 64)
!701 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !47, line: 54, flags: DIFlagFwdDecl)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !485, file: !47, line: 275, baseType: !703, size: 64, offset: 10240)
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 64)
!704 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !47, line: 275, flags: DIFlagFwdDecl)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !485, file: !47, line: 277, baseType: !706, size: 64, offset: 10304)
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 64)
!707 = !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !708, line: 41, flags: DIFlagFwdDecl)
!708 = !DIFile(filename: "blender/source/blender/render/intern/include/occlusion.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!709 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !485, file: !47, line: 277, baseType: !706, size: 64, offset: 10368)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !485, file: !47, line: 278, baseType: !711, size: 64, offset: 10432)
!711 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !712, line: 27, baseType: !713)
!712 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!713 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !714, line: 45, baseType: !715)
!714 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!715 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_mask", scope: !485, file: !47, line: 279, baseType: !711, size: 64, offset: 10496)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !485, file: !47, line: 280, baseType: !48, size: 32, offset: 10560)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !485, file: !47, line: 281, baseType: !48, size: 32, offset: 10592)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "gpulamp", scope: !485, file: !47, line: 283, baseType: !227, size: 128, offset: 10624)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "pc_ids", scope: !485, file: !47, line: 284, baseType: !227, size: 128, offset: 10752)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "duplilist", scope: !485, file: !47, line: 285, baseType: !722, size: 64, offset: 10880)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_object", scope: !485, file: !47, line: 287, baseType: !724, size: 64, offset: 10944)
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 64)
!725 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyOb", file: !47, line: 59, flags: DIFlagFwdDecl)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_constraint", scope: !485, file: !47, line: 288, baseType: !727, size: 64, offset: 11008)
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !728, size: 64)
!728 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyCon", file: !47, line: 288, flags: DIFlagFwdDecl)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "ima_ofs", scope: !485, file: !47, line: 290, baseType: !730, size: 64, offset: 11072)
!730 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 64, elements: !731)
!731 = !{!732}
!732 = !DISubrange(count: 2)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !485, file: !47, line: 291, baseType: !734, size: 64, offset: 11136)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64)
!735 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageUser", file: !736, line: 65, baseType: !737)
!736 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!737 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !736, line: 50, size: 320, elements: !738)
!738 = !{!739, !2010, !2011, !2012, !2013, !2014, !2015, !2016, !2017, !2018, !2019, !2020, !2021, !2022}
!739 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !737, file: !736, line: 51, baseType: !740, size: 64)
!740 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !741, size: 64)
!741 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !11, line: 1216, size: 39680, elements: !742)
!742 = !{!743, !744, !745, !746, !1293, !1294, !1295, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1316, !1317, !1318, !1319, !1322, !1597, !1600, !1883, !1895, !1896, !1897, !1898, !1899, !1900, !1901, !1902, !1905, !1906, !1907, !1908, !1909, !1917, !1984, !1991, !1992, !1999, !2002, !2003, !2004, !2005, !2006, !2007}
!743 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !741, file: !11, line: 1217, baseType: !257, size: 960)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !741, file: !11, line: 1218, baseType: !319, size: 64, offset: 960)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !741, file: !11, line: 1220, baseType: !484, size: 64, offset: 1024)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !741, file: !11, line: 1221, baseType: !747, size: 64, offset: 1088)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64)
!748 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !749, line: 52, size: 4224, elements: !750)
!749 = !DIFile(filename: "blender/source/blender/makesdna/DNA_world_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!750 = !{!751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !826, !842}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !748, file: !749, line: 53, baseType: !257, size: 960)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !748, file: !749, line: 54, baseType: !319, size: 64, offset: 960)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "colormodel", scope: !748, file: !749, line: 56, baseType: !79, size: 16, offset: 1024)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "totex", scope: !748, file: !749, line: 56, baseType: !79, size: 16, offset: 1040)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "texact", scope: !748, file: !749, line: 57, baseType: !79, size: 16, offset: 1056)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "mistype", scope: !748, file: !749, line: 57, baseType: !79, size: 16, offset: 1072)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "horr", scope: !748, file: !749, line: 59, baseType: !6, size: 32, offset: 1088)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "horg", scope: !748, file: !749, line: 59, baseType: !6, size: 32, offset: 1120)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "horb", scope: !748, file: !749, line: 59, baseType: !6, size: 32, offset: 1152)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "zenr", scope: !748, file: !749, line: 60, baseType: !6, size: 32, offset: 1184)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "zeng", scope: !748, file: !749, line: 60, baseType: !6, size: 32, offset: 1216)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "zenb", scope: !748, file: !749, line: 60, baseType: !6, size: 32, offset: 1248)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "ambr", scope: !748, file: !749, line: 61, baseType: !6, size: 32, offset: 1280)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "ambg", scope: !748, file: !749, line: 61, baseType: !6, size: 32, offset: 1312)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "ambb", scope: !748, file: !749, line: 61, baseType: !6, size: 32, offset: 1344)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "exposure", scope: !748, file: !749, line: 68, baseType: !6, size: 32, offset: 1376)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !748, file: !749, line: 68, baseType: !6, size: 32, offset: 1408)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !748, file: !749, line: 68, baseType: !6, size: 32, offset: 1440)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "linfac", scope: !748, file: !749, line: 69, baseType: !6, size: 32, offset: 1472)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "logfac", scope: !748, file: !749, line: 69, baseType: !6, size: 32, offset: 1504)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !748, file: !749, line: 74, baseType: !6, size: 32, offset: 1536)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "activityBoxRadius", scope: !748, file: !749, line: 79, baseType: !6, size: 32, offset: 1568)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "skytype", scope: !748, file: !749, line: 81, baseType: !79, size: 16, offset: 1600)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !748, file: !749, line: 91, baseType: !79, size: 16, offset: 1616)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "occlusionRes", scope: !748, file: !749, line: 92, baseType: !79, size: 16, offset: 1632)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "physicsEngine", scope: !748, file: !749, line: 93, baseType: !79, size: 16, offset: 1648)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "ticrate", scope: !748, file: !749, line: 94, baseType: !79, size: 16, offset: 1664)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "maxlogicstep", scope: !748, file: !749, line: 94, baseType: !79, size: 16, offset: 1680)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "physubstep", scope: !748, file: !749, line: 94, baseType: !79, size: 16, offset: 1696)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "maxphystep", scope: !748, file: !749, line: 94, baseType: !79, size: 16, offset: 1712)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "misi", scope: !748, file: !749, line: 96, baseType: !6, size: 32, offset: 1728)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "miststa", scope: !748, file: !749, line: 96, baseType: !6, size: 32, offset: 1760)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "mistdist", scope: !748, file: !749, line: 96, baseType: !6, size: 32, offset: 1792)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "misthi", scope: !748, file: !749, line: 96, baseType: !6, size: 32, offset: 1824)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "starr", scope: !748, file: !749, line: 98, baseType: !6, size: 32, offset: 1856)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "starg", scope: !748, file: !749, line: 98, baseType: !6, size: 32, offset: 1888)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "starb", scope: !748, file: !749, line: 98, baseType: !6, size: 32, offset: 1920)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "stark", scope: !748, file: !749, line: 98, baseType: !6, size: 32, offset: 1952)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "starsize", scope: !748, file: !749, line: 99, baseType: !6, size: 32, offset: 1984)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "starmindist", scope: !748, file: !749, line: 99, baseType: !6, size: 32, offset: 2016)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "stardist", scope: !748, file: !749, line: 100, baseType: !6, size: 32, offset: 2048)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "starcolnoise", scope: !748, file: !749, line: 100, baseType: !6, size: 32, offset: 2080)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "dofsta", scope: !748, file: !749, line: 103, baseType: !79, size: 16, offset: 2112)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "dofend", scope: !748, file: !749, line: 103, baseType: !79, size: 16, offset: 2128)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "dofmin", scope: !748, file: !749, line: 103, baseType: !79, size: 16, offset: 2144)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "dofmax", scope: !748, file: !749, line: 103, baseType: !79, size: 16, offset: 2160)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "aodist", scope: !748, file: !749, line: 106, baseType: !6, size: 32, offset: 2176)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "aodistfac", scope: !748, file: !749, line: 106, baseType: !6, size: 32, offset: 2208)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "aoenergy", scope: !748, file: !749, line: 106, baseType: !6, size: 32, offset: 2240)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "aobias", scope: !748, file: !749, line: 106, baseType: !6, size: 32, offset: 2272)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "aomode", scope: !748, file: !749, line: 107, baseType: !79, size: 16, offset: 2304)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "aosamp", scope: !748, file: !749, line: 107, baseType: !79, size: 16, offset: 2320)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "aomix", scope: !748, file: !749, line: 107, baseType: !79, size: 16, offset: 2336)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "aocolor", scope: !748, file: !749, line: 107, baseType: !79, size: 16, offset: 2352)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "ao_adapt_thresh", scope: !748, file: !749, line: 108, baseType: !6, size: 32, offset: 2368)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "ao_adapt_speed_fac", scope: !748, file: !749, line: 108, baseType: !6, size: 32, offset: 2400)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_error", scope: !748, file: !749, line: 109, baseType: !6, size: 32, offset: 2432)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_correction", scope: !748, file: !749, line: 109, baseType: !6, size: 32, offset: 2464)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "ao_indirect_energy", scope: !748, file: !749, line: 110, baseType: !6, size: 32, offset: 2496)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "ao_env_energy", scope: !748, file: !749, line: 110, baseType: !6, size: 32, offset: 2528)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "ao_pad2", scope: !748, file: !749, line: 110, baseType: !6, size: 32, offset: 2560)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "ao_indirect_bounces", scope: !748, file: !749, line: 111, baseType: !79, size: 16, offset: 2592)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "ao_pad", scope: !748, file: !749, line: 111, baseType: !79, size: 16, offset: 2608)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "ao_samp_method", scope: !748, file: !749, line: 112, baseType: !79, size: 16, offset: 2624)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "ao_gather_method", scope: !748, file: !749, line: 112, baseType: !79, size: 16, offset: 2640)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_passes", scope: !748, file: !749, line: 112, baseType: !79, size: 16, offset: 2656)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !748, file: !749, line: 115, baseType: !79, size: 16, offset: 2672)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "aosphere", scope: !748, file: !749, line: 118, baseType: !7, size: 64, offset: 2688)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "aotables", scope: !748, file: !749, line: 118, baseType: !7, size: 64, offset: 2752)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !748, file: !749, line: 121, baseType: !504, size: 64, offset: 2816)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "mtex", scope: !748, file: !749, line: 122, baseType: !475, size: 1152, offset: 2880)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "pr_texture", scope: !748, file: !749, line: 123, baseType: !79, size: 16, offset: 4032)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !748, file: !749, line: 123, baseType: !79, size: 16, offset: 4048)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !748, file: !749, line: 123, baseType: !825, size: 32, offset: 4064)
!825 = !DICompositeType(tag: DW_TAG_array_type, baseType: !79, size: 32, elements: !731)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !748, file: !749, line: 126, baseType: !827, size: 64, offset: 4096)
!827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !828, size: 64)
