; ModuleID = 'blender/source/blender/editors/space_outliner/space_outliner.c'
source_filename = "blender/source/blender/editors/space_outliner/space_outliner.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.SpaceType = type { %struct.SpaceType*, %struct.SpaceType*, [64 x i8], i32, i32, %struct.SpaceLink* (%struct.bContext*)*, void (%struct.SpaceLink*)*, void (%struct.wmWindowManager*, %struct.ScrArea*)*, void (%struct.wmWindowManager*, %struct.ScrArea*)*, void (%struct.bScreen*, %struct.ScrArea*, %struct.wmNotifier*)*, void (%struct.bContext*, %struct.ScrArea*)*, %struct.SpaceLink* (%struct.SpaceLink*)*, void ()*, void (%struct.wmKeyConfig*)*, void ()*, i32 (%struct.bContext*, i8*, %struct.bContextDataResult*)*, %struct.ListBase, %struct.ListBase, i32 }
%struct.SpaceLink = type { %struct.SpaceLink*, %struct.SpaceLink*, %struct.ListBase, i32, float, [8 x i16] }
%struct.bContext = type opaque
%struct.wmWindowManager = type { %struct.ID, %struct.wmWindow*, %struct.wmWindow*, %struct.ListBase, i32, i16, i16, %struct.ListBase, %struct.ListBase, %struct.ReportList, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.wmKeyConfig*, %struct.wmKeyConfig*, %struct.wmKeyConfig*, %struct.ListBase, %struct.wmTimer*, i8, [7 x i8] }
%struct.ID = type { i8*, i8*, %struct.ID*, %struct.Library*, [66 x i8], i16, i32, i32, i32, %struct.IDProperty* }

!189 = !DIEnumerator(name: "TH_SEQ_TRANSITION", value: 123, isUnsigned: true)
!190 = !DIEnumerator(name: "TH_SEQ_META", value: 124, isUnsigned: true)
!191 = !DIEnumerator(name: "TH_SEQ_PREVIEW", value: 125, isUnsigned: true)
!192 = !DIEnumerator(name: "TH_EDGE_SHARP", value: 126, isUnsigned: true)
!193 = !DIEnumerator(name: "TH_EDITMESH_ACTIVE", value: 127, isUnsigned: true)
!194 = !DIEnumerator(name: "TH_HANDLE_VERTEX", value: 128, isUnsigned: true)
!195 = !DIEnumerator(name: "TH_HANDLE_VERTEX_SELECT", value: 129, isUnsigned: true)
!196 = !DIEnumerator(name: "TH_HANDLE_VERTEX_SIZE", value: 130, isUnsigned: true)
!197 = !DIEnumerator(name: "TH_DOPESHEET_CHANNELOB", value: 131, isUnsigned: true)
!198 = !DIEnumerator(name: "TH_DOPESHEET_CHANNELSUBOB", value: 132, isUnsigned: true)
!199 = !DIEnumerator(name: "TH_PREVIEW_BACK", value: 133, isUnsigned: true)
!200 = !DIEnumerator(name: "TH_EDGE_CREASE", value: 134, isUnsigned: true)
!201 = !DIEnumerator(name: "TH_DRAWEXTRA_EDGELEN", value: 135, isUnsigned: true)
!202 = !DIEnumerator(name: "TH_DRAWEXTRA_EDGEANG", value: 136, isUnsigned: true)
!203 = !DIEnumerator(name: "TH_DRAWEXTRA_FACEAREA", value: 137, isUnsigned: true)
!204 = !DIEnumerator(name: "TH_DRAWEXTRA_FACEANG", value: 138, isUnsigned: true)
!205 = !DIEnumerator(name: "TH_NODE_CURVING", value: 139, isUnsigned: true)
!206 = !DIEnumerator(name: "TH_MARKER_OUTLINE", value: 140, isUnsigned: true)
!207 = !DIEnumerator(name: "TH_MARKER", value: 141, isUnsigned: true)
!208 = !DIEnumerator(name: "TH_ACT_MARKER", value: 142, isUnsigned: true)
!209 = !DIEnumerator(name: "TH_SEL_MARKER", value: 143, isUnsigned: true)
!210 = !DIEnumerator(name: "TH_BUNDLE_SOLID", value: 144, isUnsigned: true)
!211 = !DIEnumerator(name: "TH_DIS_MARKER", value: 145, isUnsigned: true)
!212 = !DIEnumerator(name: "TH_PATH_BEFORE", value: 146, isUnsigned: true)
!213 = !DIEnumerator(name: "TH_PATH_AFTER", value: 147, isUnsigned: true)
!214 = !DIEnumerator(name: "TH_CAMERA_PATH", value: 148, isUnsigned: true)
!215 = !DIEnumerator(name: "TH_LOCK_MARKER", value: 149, isUnsigned: true)
!216 = !DIEnumerator(name: "TH_STITCH_PREVIEW_FACE", value: 150, isUnsigned: true)
!217 = !DIEnumerator(name: "TH_STITCH_PREVIEW_EDGE", value: 151, isUnsigned: true)
!218 = !DIEnumerator(name: "TH_STITCH_PREVIEW_VERT", value: 152, isUnsigned: true)
!219 = !DIEnumerator(name: "TH_STITCH_PREVIEW_STITCHABLE", value: 153, isUnsigned: true)
!220 = !DIEnumerator(name: "TH_STITCH_PREVIEW_UNSTITCHABLE", value: 154, isUnsigned: true)
!221 = !DIEnumerator(name: "TH_STITCH_PREVIEW_ACTIVE", value: 155, isUnsigned: true)
!222 = !DIEnumerator(name: "TH_PAINT_CURVE_HANDLE", value: 156, isUnsigned: true)
!223 = !DIEnumerator(name: "TH_PAINT_CURVE_PIVOT", value: 157, isUnsigned: true)
!224 = !DIEnumerator(name: "TH_UV_SHADOW", value: 158, isUnsigned: true)
!225 = !DIEnumerator(name: "TH_UV_OTHERS", value: 159, isUnsigned: true)
!226 = !DIEnumerator(name: "TH_FREESTYLE_EDGE_MARK", value: 160, isUnsigned: true)
!227 = !DIEnumerator(name: "TH_FREESTYLE_FACE_MARK", value: 161, isUnsigned: true)
!228 = !DIEnumerator(name: "TH_MATCH", value: 162, isUnsigned: true)
!229 = !DIEnumerator(name: "TH_SELECT_HIGHLIGHT", value: 163, isUnsigned: true)
!230 = !DIEnumerator(name: "TH_SKIN_ROOT", value: 164, isUnsigned: true)
!231 = !DIEnumerator(name: "TH_ANIM_ACTIVE", value: 165, isUnsigned: true)
!232 = !DIEnumerator(name: "TH_ANIM_INACTIVE", value: 166, isUnsigned: true)
!233 = !DIEnumerator(name: "TH_NLA_TWEAK", value: 167, isUnsigned: true)
!234 = !DIEnumerator(name: "TH_NLA_TWEAK_DUPLI", value: 168, isUnsigned: true)
!235 = !DIEnumerator(name: "TH_NLA_TRANSITION", value: 169, isUnsigned: true)
!236 = !DIEnumerator(name: "TH_NLA_TRANSITION_SEL", value: 170, isUnsigned: true)
!237 = !DIEnumerator(name: "TH_NLA_META", value: 171, isUnsigned: true)
!238 = !DIEnumerator(name: "TH_NLA_META_SEL", value: 172, isUnsigned: true)
!239 = !DIEnumerator(name: "TH_NLA_SOUND", value: 173, isUnsigned: true)
!240 = !DIEnumerator(name: "TH_NLA_SOUND_SEL", value: 174, isUnsigned: true)
!241 = !DIEnumerator(name: "TH_EMBOSS", value: 175, isUnsigned: true)
!242 = !DIEnumerator(name: "TH_AXIS_X", value: 176, isUnsigned: true)
!243 = !DIEnumerator(name: "TH_AXIS_Y", value: 177, isUnsigned: true)
!244 = !DIEnumerator(name: "TH_AXIS_Z", value: 178, isUnsigned: true)
!245 = !DIEnumerator(name: "TH_LOW_GRAD", value: 179, isUnsigned: true)
!246 = !DIEnumerator(name: "TH_HIGH_GRAD", value: 180, isUnsigned: true)
!247 = !DIEnumerator(name: "TH_SHOW_BACK_GRAD", value: 181, isUnsigned: true)
!248 = !DIEnumerator(name: "TH_INFO_SELECTED", value: 182, isUnsigned: true)
!249 = !DIEnumerator(name: "TH_INFO_SELECTED_TEXT", value: 183, isUnsigned: true)
!250 = !DIEnumerator(name: "TH_INFO_ERROR", value: 184, isUnsigned: true)
!251 = !DIEnumerator(name: "TH_INFO_ERROR_TEXT", value: 185, isUnsigned: true)
!252 = !DIEnumerator(name: "TH_INFO_WARNING", value: 186, isUnsigned: true)
!253 = !DIEnumerator(name: "TH_INFO_WARNING_TEXT", value: 187, isUnsigned: true)
!254 = !DIEnumerator(name: "TH_INFO_INFO", value: 188, isUnsigned: true)
!255 = !DIEnumerator(name: "TH_INFO_INFO_TEXT", value: 189, isUnsigned: true)
!256 = !DIEnumerator(name: "TH_INFO_DEBUG", value: 190, isUnsigned: true)
!257 = !DIEnumerator(name: "TH_INFO_DEBUG_TEXT", value: 191, isUnsigned: true)
!258 = !DIEnumerator(name: "TH_VIEW_OVERLAY", value: 192, isUnsigned: true)
!259 = !{!260, !283, !273, !378, !567, !2007, !2008, !2010}
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "SpaceLink", file: !4, line: 91, baseType: !262)
!262 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceLink", file: !4, line: 85, size: 448, elements: !263)
!263 = !{!264, !266, !267, !275, !276, !278}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !262, file: !4, line: 86, baseType: !265, size: 64)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !262, file: !4, line: 86, baseType: !265, size: 64, offset: 64)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !262, file: !4, line: 87, baseType: !268, size: 128, offset: 128)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !269, line: 71, baseType: !270)
!269 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !269, line: 69, size: 128, elements: !271)
!271 = !{!272, !274}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !270, file: !269, line: 70, baseType: !273, size: 64)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !270, file: !269, line: 70, baseType: !273, size: 64, offset: 64)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "spacetype", scope: !262, file: !4, line: 88, baseType: !55, size: 32, offset: 256)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "blockscale", scope: !262, file: !4, line: 89, baseType: !277, size: 32, offset: 288)
!277 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "blockhandler", scope: !262, file: !4, line: 90, baseType: !279, size: 128, offset: 320)
!279 = !DICompositeType(tag: DW_TAG_array_type, baseType: !280, size: 128, elements: !281)
!280 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!281 = !{!282}
!282 = !DISubrange(count: 8)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "SpaceOops", file: !4, line: 267, baseType: !285)
!285 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceOops", file: !4, line: 240, size: 2432, elements: !286)
!286 = !{!287, !288, !289, !290, !291, !292, !293, !1987, !1988, !1992, !1993, !2002, !2003, !2004, !2005, !2006}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !285, file: !4, line: 241, baseType: !260, size: 64)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !285, file: !4, line: 241, baseType: !260, size: 64, offset: 64)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !285, file: !4, line: 242, baseType: !268, size: 128, offset: 128)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "spacetype", scope: !285, file: !4, line: 243, baseType: !55, size: 32, offset: 256)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "blockscale", scope: !285, file: !4, line: 244, baseType: !277, size: 32, offset: 288)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "blockhandler", scope: !285, file: !4, line: 245, baseType: !279, size: 128, offset: 320)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "v2d", scope: !285, file: !4, line: 247, baseType: !294, size: 1280, offset: 448)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "View2D", file: !295, line: 71, baseType: !296)
!295 = !DIFile(filename: "blender/source/blender/makesdna/DNA_view2d_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!296 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "View2D", file: !295, line: 40, size: 1280, elements: !297)
!297 = !{!298, !307, !308, !316, !317, !318, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !339, !340, !341, !344}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !296, file: !295, line: 41, baseType: !299, size: 128)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !300, line: 95, baseType: !301)
!300 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!301 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !300, line: 92, size: 128, elements: !302)
!302 = !{!303, !304, !305, !306}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !301, file: !300, line: 93, baseType: !277, size: 32)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !301, file: !300, line: 93, baseType: !277, size: 32, offset: 32)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !301, file: !300, line: 94, baseType: !277, size: 32, offset: 64)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !301, file: !300, line: 94, baseType: !277, size: 32, offset: 96)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !296, file: !295, line: 41, baseType: !299, size: 128, offset: 128)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "vert", scope: !296, file: !295, line: 42, baseType: !309, size: 128, offset: 256)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "rcti", file: !300, line: 89, baseType: !310)
!310 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rcti", file: !300, line: 86, size: 128, elements: !311)
!311 = !{!312, !313, !314, !315}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !310, file: !300, line: 87, baseType: !55, size: 32)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !310, file: !300, line: 87, baseType: !55, size: 32, offset: 32)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !310, file: !300, line: 88, baseType: !55, size: 32, offset: 64)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !310, file: !300, line: 88, baseType: !55, size: 32, offset: 96)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "hor", scope: !296, file: !295, line: 42, baseType: !309, size: 128, offset: 384)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !296, file: !295, line: 43, baseType: !309, size: 128, offset: 512)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !296, file: !295, line: 45, baseType: !319, size: 64, offset: 640)
!319 = !DICompositeType(tag: DW_TAG_array_type, baseType: !277, size: 64, elements: !320)
!320 = !{!321}
!321 = !DISubrange(count: 2)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !296, file: !295, line: 45, baseType: !319, size: 64, offset: 704)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "minzoom", scope: !296, file: !295, line: 46, baseType: !277, size: 32, offset: 768)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "maxzoom", scope: !296, file: !295, line: 46, baseType: !277, size: 32, offset: 800)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "scroll", scope: !296, file: !295, line: 48, baseType: !280, size: 16, offset: 832)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "scroll_ui", scope: !296, file: !295, line: 49, baseType: !280, size: 16, offset: 848)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "keeptot", scope: !296, file: !295, line: 51, baseType: !280, size: 16, offset: 864)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "keepzoom", scope: !296, file: !295, line: 52, baseType: !280, size: 16, offset: 880)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "keepofs", scope: !296, file: !295, line: 53, baseType: !280, size: 16, offset: 896)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !296, file: !295, line: 55, baseType: !280, size: 16, offset: 912)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !296, file: !295, line: 56, baseType: !280, size: 16, offset: 928)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "winx", scope: !296, file: !295, line: 58, baseType: !280, size: 16, offset: 944)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "winy", scope: !296, file: !295, line: 58, baseType: !280, size: 16, offset: 960)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "oldwinx", scope: !296, file: !295, line: 59, baseType: !280, size: 16, offset: 976)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "oldwiny", scope: !296, file: !295, line: 59, baseType: !280, size: 16, offset: 992)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "around", scope: !296, file: !295, line: 61, baseType: !280, size: 16, offset: 1008)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "tab_offset", scope: !296, file: !295, line: 63, baseType: !338, size: 64, offset: 1024)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "tab_num", scope: !296, file: !295, line: 64, baseType: !55, size: 32, offset: 1088)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "tab_cur", scope: !296, file: !295, line: 65, baseType: !55, size: 32, offset: 1120)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "sms", scope: !296, file: !295, line: 68, baseType: !342, size: 64, offset: 1152)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64)
!343 = !DICompositeType(tag: DW_TAG_structure_type, name: "SmoothView2DStore", file: !295, line: 68, flags: DIFlagFwdDecl)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "smooth_timer", scope: !296, file: !295, line: 69, baseType: !345, size: 64, offset: 1216)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!346 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTimer", file: !347, line: 490, size: 768, elements: !348)
!347 = !DIFile(filename: "blender/source/blender/windowmanager/WM_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!348 = !{!349, !350, !351, !1978, !1979, !1980, !1981, !1982, !1983, !1984, !1985, !1986}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !346, file: !347, line: 491, baseType: !345, size: 64)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !346, file: !347, line: 491, baseType: !345, size: 64, offset: 64)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "win", scope: !346, file: !347, line: 493, baseType: !352, size: 64, offset: 128)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindow", file: !354, line: 169, size: 2048, elements: !355)
!354 = !DIFile(filename: "blender/source/blender/makesdna/DNA_windowmanager_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!355 = !{!356, !357, !358, !359, !1893, !1894, !1895, !1896, !1897, !1898, !1899, !1900, !1901, !1902, !1903, !1904, !1905, !1906, !1907, !1908, !1909, !1910, !1953, !1956, !1970, !1971, !1972, !1973, !1974, !1975, !1976, !1977}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !353, file: !354, line: 170, baseType: !352, size: 64)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !353, file: !354, line: 170, baseType: !352, size: 64, offset: 64)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "ghostwin", scope: !353, file: !354, line: 172, baseType: !273, size: 64, offset: 128)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !353, file: !354, line: 174, baseType: !360, size: 64, offset: 192)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!361 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !30, line: 49, size: 1984, elements: !362)
!362 = !{!363, !426, !427, !428, !429, !430, !1876, !1877, !1878, !1879, !1880, !1881, !1882, !1883, !1884, !1885, !1886, !1887, !1888, !1889, !1890, !1891, !1892}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !361, file: !30, line: 50, baseType: !364, size: 960)
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !365, line: 130, baseType: !366)
!365 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!366 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !365, line: 117, size: 960, elements: !367)
!367 = !{!368, !369, !370, !372, !392, !396, !397, !398, !399, !400}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !366, file: !365, line: 118, baseType: !273, size: 64)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !366, file: !365, line: 118, baseType: !273, size: 64, offset: 64)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !366, file: !365, line: 119, baseType: !371, size: 64, offset: 128)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !366, file: !365, line: 120, baseType: !373, size: 64, offset: 192)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64)
!374 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !365, line: 136, size: 17600, elements: !375)
!375 = !{!376, !377, !379, !382, !387, !388, !389}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !374, file: !365, line: 137, baseType: !364, size: 960)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !374, file: !365, line: 138, baseType: !378, size: 64, offset: 960)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !374, file: !365, line: 139, baseType: !380, size: 64, offset: 1024)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!381 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !365, line: 43, flags: DIFlagFwdDecl)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !374, file: !365, line: 140, baseType: !383, size: 8192, offset: 1088)
!383 = !DICompositeType(tag: DW_TAG_array_type, baseType: !384, size: 8192, elements: !385)
!384 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!385 = !{!386}
!386 = !DISubrange(count: 1024)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !374, file: !365, line: 141, baseType: !383, size: 8192, offset: 9280)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !374, file: !365, line: 148, baseType: !373, size: 64, offset: 17472)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !374, file: !365, line: 150, baseType: !390, size: 64, offset: 17536)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!391 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !365, line: 45, flags: DIFlagFwdDecl)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !366, file: !365, line: 121, baseType: !393, size: 528, offset: 256)
!393 = !DICompositeType(tag: DW_TAG_array_type, baseType: !384, size: 528, elements: !394)
!394 = !{!395}
!395 = !DISubrange(count: 66)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !366, file: !365, line: 126, baseType: !280, size: 16, offset: 784)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !366, file: !365, line: 127, baseType: !55, size: 32, offset: 800)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !366, file: !365, line: 128, baseType: !55, size: 32, offset: 832)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !366, file: !365, line: 128, baseType: !55, size: 32, offset: 864)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !366, file: !365, line: 129, baseType: !401, size: 64, offset: 896)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !365, line: 75, baseType: !403)
!403 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !365, line: 62, size: 1024, elements: !404)
!404 = !{!405, !407, !408, !409, !410, !411, !415, !416, !424, !425}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !403, file: !365, line: 63, baseType: !406, size: 64)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !403, file: !365, line: 63, baseType: !406, size: 64, offset: 64)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !403, file: !365, line: 64, baseType: !384, size: 8, offset: 128)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !403, file: !365, line: 64, baseType: !384, size: 8, offset: 136)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !403, file: !365, line: 65, baseType: !280, size: 16, offset: 144)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !403, file: !365, line: 66, baseType: !412, size: 512, offset: 160)
!412 = !DICompositeType(tag: DW_TAG_array_type, baseType: !384, size: 512, elements: !413)
!413 = !{!414}
!414 = !DISubrange(count: 64)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !403, file: !365, line: 67, baseType: !55, size: 32, offset: 672)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !403, file: !365, line: 69, baseType: !417, size: 256, offset: 704)
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !365, line: 60, baseType: !418)
!418 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !365, line: 48, size: 256, elements: !419)
!419 = !{!420, !421, !422, !423}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !418, file: !365, line: 49, baseType: !273, size: 64)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !418, file: !365, line: 58, baseType: !268, size: 128, offset: 64)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !418, file: !365, line: 59, baseType: !55, size: 32, offset: 192)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !418, file: !365, line: 59, baseType: !55, size: 32, offset: 224)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !403, file: !365, line: 70, baseType: !55, size: 32, offset: 960)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !403, file: !365, line: 74, baseType: !55, size: 32, offset: 992)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "vertbase", scope: !361, file: !30, line: 52, baseType: !268, size: 128, offset: 960)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "edgebase", scope: !361, file: !30, line: 53, baseType: !268, size: 128, offset: 1088)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "areabase", scope: !361, file: !30, line: 54, baseType: !268, size: 128, offset: 1216)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !361, file: !30, line: 55, baseType: !268, size: 128, offset: 1344)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !361, file: !30, line: 57, baseType: !431, size: 64, offset: 1472)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !433, line: 1216, size: 39680, elements: !434)
!433 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!434 = !{!435, !436, !440, !731, !734, !735, !736, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !762, !828, !1252, !1467, !1470, !1751, !1763, !1764, !1765, !1766, !1767, !1768, !1769, !1770, !1773, !1774, !1775, !1776, !1777, !1785, !1852, !1859, !1860, !1867, !1868, !1869, !1870, !1871, !1872, !1873}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !432, file: !433, line: 1217, baseType: !364, size: 960)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !432, file: !433, line: 1218, baseType: !437, size: 64, offset: 960)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !439, line: 43, flags: DIFlagFwdDecl)
!439 = !DIFile(filename: "blender/source/blender/makesdna/DNA_movieclip_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!440 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !432, file: !433, line: 1220, baseType: !441, size: 64, offset: 1024)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64)
!442 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !443, line: 115, size: 11392, elements: !444)
!443 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!444 = !{!445, !446, !447, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !465, !475, !489, !490, !534, !535, !539, !540, !556, !557, !558, !559, !560, !561, !562, !566, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !582, !583, !584, !585, !586, !587, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !647, !648, !649, !650, !651, !652, !653, !654, !655, !658, !661, !665, !666, !667, !668, !669, !672, !675, !678, !679, !685, !686, !687, !688, !689, !690, !692, !695, !698, !699, !719, !720}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !442, file: !443, line: 116, baseType: !364, size: 960)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !442, file: !443, line: 117, baseType: !437, size: 64, offset: 960)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !442, file: !443, line: 119, baseType: !448, size: 64, offset: 1024)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64)
!449 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !443, line: 57, flags: DIFlagFwdDecl)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !442, file: !443, line: 121, baseType: !280, size: 16, offset: 1088)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !442, file: !443, line: 121, baseType: !280, size: 16, offset: 1104)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !442, file: !443, line: 122, baseType: !55, size: 32, offset: 1120)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !442, file: !443, line: 122, baseType: !55, size: 32, offset: 1152)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !442, file: !443, line: 122, baseType: !55, size: 32, offset: 1184)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !442, file: !443, line: 123, baseType: !412, size: 512, offset: 1216)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !442, file: !443, line: 124, baseType: !441, size: 64, offset: 1728)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !442, file: !443, line: 124, baseType: !441, size: 64, offset: 1792)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !442, file: !443, line: 127, baseType: !441, size: 64, offset: 1856)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !442, file: !443, line: 127, baseType: !441, size: 64, offset: 1920)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !442, file: !443, line: 127, baseType: !441, size: 64, offset: 1984)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !442, file: !443, line: 128, baseType: !462, size: 64, offset: 2048)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!463 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !464, line: 49, flags: DIFlagFwdDecl)
!464 = !DIFile(filename: "blender/source/blender/makesdna/DNA_sequence_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!465 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !442, file: !443, line: 130, baseType: !466, size: 64, offset: 2112)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!467 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !443, line: 97, size: 832, elements: !468)
!468 = !{!469, !473, !474}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !467, file: !443, line: 98, baseType: !470, size: 768)
!470 = !DICompositeType(tag: DW_TAG_array_type, baseType: !277, size: 768, elements: !471)
!471 = !{!282, !472}
!472 = !DISubrange(count: 3)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !467, file: !443, line: 99, baseType: !55, size: 32, offset: 768)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !467, file: !443, line: 99, baseType: !55, size: 32, offset: 800)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !442, file: !443, line: 131, baseType: !476, size: 64, offset: 2176)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64)
!477 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !478, line: 486, size: 1600, elements: !479)
!478 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!479 = !{!480, !481, !482, !483, !484, !485, !486, !487, !488}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !477, file: !478, line: 487, baseType: !364, size: 960)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !477, file: !478, line: 489, baseType: !268, size: 128, offset: 960)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !477, file: !478, line: 490, baseType: !268, size: 128, offset: 1088)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !477, file: !478, line: 491, baseType: !268, size: 128, offset: 1216)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !477, file: !478, line: 492, baseType: !268, size: 128, offset: 1344)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !477, file: !478, line: 494, baseType: !55, size: 32, offset: 1472)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !477, file: !478, line: 495, baseType: !55, size: 32, offset: 1504)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !477, file: !478, line: 497, baseType: !55, size: 32, offset: 1536)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !477, file: !478, line: 498, baseType: !55, size: 32, offset: 1568)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !442, file: !443, line: 132, baseType: !476, size: 64, offset: 2240)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !442, file: !443, line: 133, baseType: !491, size: 64, offset: 2304)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64)
!492 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !478, line: 334, size: 1728, elements: !493)
!493 = !{!494, !495, !499, !500, !501, !502, !503, !504, !507, !508, !509, !510, !511, !512, !513, !533}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !492, file: !478, line: 335, baseType: !268, size: 128)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !492, file: !478, line: 336, baseType: !496, size: 64, offset: 128)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64)
!497 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !498, line: 30, flags: DIFlagFwdDecl)
!498 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_treehash.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!499 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !492, file: !478, line: 338, baseType: !280, size: 16, offset: 192)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !492, file: !478, line: 338, baseType: !280, size: 16, offset: 208)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !492, file: !478, line: 339, baseType: !5, size: 32, offset: 224)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !492, file: !478, line: 340, baseType: !55, size: 32, offset: 256)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !492, file: !478, line: 342, baseType: !277, size: 32, offset: 288)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !492, file: !478, line: 343, baseType: !505, size: 96, offset: 320)
!505 = !DICompositeType(tag: DW_TAG_array_type, baseType: !277, size: 96, elements: !506)
!506 = !{!472}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !492, file: !478, line: 344, baseType: !505, size: 96, offset: 416)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !492, file: !478, line: 347, baseType: !268, size: 128, offset: 512)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !492, file: !478, line: 349, baseType: !55, size: 32, offset: 640)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !492, file: !478, line: 350, baseType: !55, size: 32, offset: 672)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !492, file: !478, line: 351, baseType: !273, size: 64, offset: 704)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !492, file: !478, line: 352, baseType: !273, size: 64, offset: 768)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !492, file: !478, line: 354, baseType: !514, size: 384, offset: 832)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !478, line: 116, baseType: !515)
!515 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !478, line: 94, size: 384, elements: !516)
!516 = !{!517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532}
!517 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !515, file: !478, line: 96, baseType: !55, size: 32)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !515, file: !478, line: 96, baseType: !55, size: 32, offset: 32)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !515, file: !478, line: 97, baseType: !55, size: 32, offset: 64)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !515, file: !478, line: 97, baseType: !55, size: 32, offset: 96)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !515, file: !478, line: 99, baseType: !280, size: 16, offset: 128)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !515, file: !478, line: 100, baseType: !280, size: 16, offset: 144)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !515, file: !478, line: 102, baseType: !280, size: 16, offset: 160)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !515, file: !478, line: 105, baseType: !280, size: 16, offset: 176)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !515, file: !478, line: 108, baseType: !280, size: 16, offset: 192)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !515, file: !478, line: 109, baseType: !280, size: 16, offset: 208)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !515, file: !478, line: 111, baseType: !280, size: 16, offset: 224)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !515, file: !478, line: 112, baseType: !280, size: 16, offset: 240)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !515, file: !478, line: 114, baseType: !55, size: 32, offset: 256)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !515, file: !478, line: 114, baseType: !55, size: 32, offset: 288)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !515, file: !478, line: 115, baseType: !55, size: 32, offset: 320)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !515, file: !478, line: 115, baseType: !55, size: 32, offset: 352)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !492, file: !478, line: 355, baseType: !412, size: 512, offset: 1216)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !442, file: !443, line: 134, baseType: !273, size: 64, offset: 2368)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !442, file: !443, line: 136, baseType: !536, size: 64, offset: 2432)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !538, line: 45, flags: DIFlagFwdDecl)
!538 = !DIFile(filename: "blender/source/blender/makesdna/DNA_tracking_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!539 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !442, file: !443, line: 138, baseType: !514, size: 384, offset: 2496)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !442, file: !443, line: 139, baseType: !541, size: 64, offset: 2880)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64)
!542 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !478, line: 80, baseType: !543)
!543 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !478, line: 72, size: 192, elements: !544)
!544 = !{!545, !552, !553, !554, !555}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !543, file: !478, line: 73, baseType: !546, size: 64)
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64)
!547 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !478, line: 59, baseType: !548)
!548 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !478, line: 56, size: 128, elements: !549)
!549 = !{!550, !551}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !548, file: !478, line: 57, baseType: !505, size: 96)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !548, file: !478, line: 58, baseType: !55, size: 32, offset: 96)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !543, file: !478, line: 74, baseType: !55, size: 32, offset: 64)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !543, file: !478, line: 76, baseType: !55, size: 32, offset: 96)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !543, file: !478, line: 77, baseType: !55, size: 32, offset: 128)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !543, file: !478, line: 79, baseType: !55, size: 32, offset: 160)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !442, file: !443, line: 141, baseType: !268, size: 128, offset: 2944)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !442, file: !443, line: 142, baseType: !268, size: 128, offset: 3072)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !442, file: !443, line: 143, baseType: !268, size: 128, offset: 3200)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !442, file: !443, line: 144, baseType: !268, size: 128, offset: 3328)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !442, file: !443, line: 146, baseType: !55, size: 32, offset: 3456)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !442, file: !443, line: 147, baseType: !55, size: 32, offset: 3488)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !442, file: !443, line: 150, baseType: !563, size: 64, offset: 3520)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64)
!565 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !433, line: 179, flags: DIFlagFwdDecl)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !442, file: !443, line: 151, baseType: !567, size: 64, offset: 3584)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !442, file: !443, line: 152, baseType: !55, size: 32, offset: 3648)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !442, file: !443, line: 153, baseType: !55, size: 32, offset: 3680)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !442, file: !443, line: 156, baseType: !505, size: 96, offset: 3712)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !442, file: !443, line: 156, baseType: !505, size: 96, offset: 3808)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !442, file: !443, line: 156, baseType: !505, size: 96, offset: 3904)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !442, file: !443, line: 157, baseType: !505, size: 96, offset: 4000)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !442, file: !443, line: 158, baseType: !505, size: 96, offset: 4096)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !442, file: !443, line: 159, baseType: !505, size: 96, offset: 4192)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !442, file: !443, line: 160, baseType: !505, size: 96, offset: 4288)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !442, file: !443, line: 160, baseType: !505, size: 96, offset: 4384)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !442, file: !443, line: 161, baseType: !579, size: 128, offset: 4480)
!579 = !DICompositeType(tag: DW_TAG_array_type, baseType: !277, size: 128, elements: !580)
!580 = !{!581}
!581 = !DISubrange(count: 4)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !442, file: !443, line: 161, baseType: !579, size: 128, offset: 4608)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !442, file: !443, line: 162, baseType: !505, size: 96, offset: 4736)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !442, file: !443, line: 162, baseType: !505, size: 96, offset: 4832)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !442, file: !443, line: 163, baseType: !277, size: 32, offset: 4928)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !442, file: !443, line: 163, baseType: !277, size: 32, offset: 4960)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !442, file: !443, line: 164, baseType: !588, size: 512, offset: 4992)
!588 = !DICompositeType(tag: DW_TAG_array_type, baseType: !277, size: 512, elements: !589)
!589 = !{!581, !581}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !442, file: !443, line: 165, baseType: !588, size: 512, offset: 5504)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !442, file: !443, line: 166, baseType: !588, size: 512, offset: 6016)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !442, file: !443, line: 167, baseType: !588, size: 512, offset: 6528)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !442, file: !443, line: 176, baseType: !588, size: 512, offset: 7040)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !442, file: !443, line: 178, baseType: !5, size: 32, offset: 7552)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !442, file: !443, line: 180, baseType: !280, size: 16, offset: 7584)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !442, file: !443, line: 181, baseType: !280, size: 16, offset: 7600)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !442, file: !443, line: 183, baseType: !280, size: 16, offset: 7616)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !442, file: !443, line: 183, baseType: !280, size: 16, offset: 7632)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !442, file: !443, line: 184, baseType: !280, size: 16, offset: 7648)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !442, file: !443, line: 184, baseType: !280, size: 16, offset: 7664)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !442, file: !443, line: 185, baseType: !280, size: 16, offset: 7680)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !442, file: !443, line: 186, baseType: !280, size: 16, offset: 7696)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !442, file: !443, line: 187, baseType: !280, size: 16, offset: 7712)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !442, file: !443, line: 188, baseType: !384, size: 8, offset: 7728)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !442, file: !443, line: 189, baseType: !384, size: 8, offset: 7736)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !442, file: !443, line: 192, baseType: !55, size: 32, offset: 7744)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !442, file: !443, line: 192, baseType: !55, size: 32, offset: 7776)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !442, file: !443, line: 192, baseType: !55, size: 32, offset: 7808)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !442, file: !443, line: 192, baseType: !55, size: 32, offset: 7840)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !442, file: !443, line: 194, baseType: !55, size: 32, offset: 7872)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !442, file: !443, line: 202, baseType: !277, size: 32, offset: 7904)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !442, file: !443, line: 202, baseType: !277, size: 32, offset: 7936)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !442, file: !443, line: 202, baseType: !277, size: 32, offset: 7968)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !442, file: !443, line: 211, baseType: !277, size: 32, offset: 8000)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !442, file: !443, line: 212, baseType: !277, size: 32, offset: 8032)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !442, file: !443, line: 213, baseType: !277, size: 32, offset: 8064)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !442, file: !443, line: 214, baseType: !277, size: 32, offset: 8096)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !442, file: !443, line: 215, baseType: !277, size: 32, offset: 8128)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !442, file: !443, line: 216, baseType: !277, size: 32, offset: 8160)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !442, file: !443, line: 219, baseType: !277, size: 32, offset: 8192)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !442, file: !443, line: 220, baseType: !277, size: 32, offset: 8224)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !442, file: !443, line: 221, baseType: !277, size: 32, offset: 8256)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !442, file: !443, line: 224, baseType: !624, size: 16, offset: 8288)
!624 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !442, file: !443, line: 224, baseType: !624, size: 16, offset: 8304)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !442, file: !443, line: 226, baseType: !280, size: 16, offset: 8320)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !442, file: !443, line: 228, baseType: !384, size: 8, offset: 8336)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !442, file: !443, line: 229, baseType: !384, size: 8, offset: 8344)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !442, file: !443, line: 231, baseType: !280, size: 16, offset: 8352)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !442, file: !443, line: 232, baseType: !384, size: 8, offset: 8368)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !442, file: !443, line: 233, baseType: !384, size: 8, offset: 8376)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !442, file: !443, line: 234, baseType: !277, size: 32, offset: 8384)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !442, file: !443, line: 235, baseType: !277, size: 32, offset: 8416)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !442, file: !443, line: 237, baseType: !268, size: 128, offset: 8448)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !442, file: !443, line: 238, baseType: !268, size: 128, offset: 8576)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !442, file: !443, line: 239, baseType: !268, size: 128, offset: 8704)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !442, file: !443, line: 240, baseType: !268, size: 128, offset: 8832)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !442, file: !443, line: 242, baseType: !277, size: 32, offset: 8960)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !442, file: !443, line: 244, baseType: !280, size: 16, offset: 8992)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !442, file: !443, line: 245, baseType: !624, size: 16, offset: 9008)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !442, file: !443, line: 246, baseType: !579, size: 128, offset: 9024)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !442, file: !443, line: 248, baseType: !55, size: 32, offset: 9152)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !442, file: !443, line: 249, baseType: !55, size: 32, offset: 9184)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !442, file: !443, line: 251, baseType: !645, size: 64, offset: 9216)
!645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !646, size: 64)
!646 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !443, line: 251, flags: DIFlagFwdDecl)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !442, file: !443, line: 253, baseType: !384, size: 8, offset: 9280)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !442, file: !443, line: 254, baseType: !384, size: 8, offset: 9288)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !442, file: !443, line: 255, baseType: !280, size: 16, offset: 9296)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !442, file: !443, line: 256, baseType: !505, size: 96, offset: 9312)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !442, file: !443, line: 258, baseType: !268, size: 128, offset: 9408)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !442, file: !443, line: 259, baseType: !268, size: 128, offset: 9536)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !442, file: !443, line: 260, baseType: !268, size: 128, offset: 9664)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !442, file: !443, line: 261, baseType: !268, size: 128, offset: 9792)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !442, file: !443, line: 263, baseType: !656, size: 64, offset: 9920)
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 64)
!657 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !443, line: 52, flags: DIFlagFwdDecl)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !442, file: !443, line: 264, baseType: !659, size: 64, offset: 9984)
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 64)
!660 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !443, line: 53, flags: DIFlagFwdDecl)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !442, file: !443, line: 265, baseType: !662, size: 64, offset: 10048)
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !663, size: 64)
!663 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !664, line: 43, flags: DIFlagFwdDecl)
!664 = !DIFile(filename: "blender/source/blender/makesdna/DNA_freestyle_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!665 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !442, file: !443, line: 267, baseType: !384, size: 8, offset: 10112)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !442, file: !443, line: 268, baseType: !384, size: 8, offset: 10120)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !442, file: !443, line: 269, baseType: !280, size: 16, offset: 10128)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !442, file: !443, line: 270, baseType: !277, size: 32, offset: 10144)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !442, file: !443, line: 272, baseType: !670, size: 64, offset: 10176)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64)
!671 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !443, line: 54, flags: DIFlagFwdDecl)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !442, file: !443, line: 275, baseType: !673, size: 64, offset: 10240)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64)
!674 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !443, line: 275, flags: DIFlagFwdDecl)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !442, file: !443, line: 277, baseType: !676, size: 64, offset: 10304)
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 64)
!677 = !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !443, line: 56, flags: DIFlagFwdDecl)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !442, file: !443, line: 277, baseType: !676, size: 64, offset: 10368)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !442, file: !443, line: 278, baseType: !680, size: 64, offset: 10432)
!680 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !681, line: 27, baseType: !682)
!681 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!682 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !683, line: 45, baseType: !684)
!683 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!684 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_mask", scope: !442, file: !443, line: 279, baseType: !680, size: 64, offset: 10496)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !442, file: !443, line: 280, baseType: !5, size: 32, offset: 10560)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !442, file: !443, line: 281, baseType: !5, size: 32, offset: 10592)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "gpulamp", scope: !442, file: !443, line: 283, baseType: !268, size: 128, offset: 10624)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "pc_ids", scope: !442, file: !443, line: 284, baseType: !268, size: 128, offset: 10752)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "duplilist", scope: !442, file: !443, line: 285, baseType: !691, size: 64, offset: 10880)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_object", scope: !442, file: !443, line: 287, baseType: !693, size: 64, offset: 10944)
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 64)
!694 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyOb", file: !443, line: 59, flags: DIFlagFwdDecl)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_constraint", scope: !442, file: !443, line: 288, baseType: !696, size: 64, offset: 11008)
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 64)
!697 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyCon", file: !443, line: 288, flags: DIFlagFwdDecl)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "ima_ofs", scope: !442, file: !443, line: 290, baseType: !319, size: 64, offset: 11072)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !442, file: !443, line: 291, baseType: !700, size: 64, offset: 11136)
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !701, size: 64)
!701 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageUser", file: !702, line: 65, baseType: !703)
!702 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!703 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !702, line: 50, size: 320, elements: !704)
!704 = !{!705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718}
!705 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !703, file: !702, line: 51, baseType: !431, size: 64)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !703, file: !702, line: 53, baseType: !55, size: 32, offset: 64)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !703, file: !702, line: 54, baseType: !55, size: 32, offset: 96)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !703, file: !702, line: 55, baseType: !55, size: 32, offset: 128)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !703, file: !702, line: 55, baseType: !55, size: 32, offset: 160)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !703, file: !702, line: 56, baseType: !384, size: 8, offset: 192)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "cycl", scope: !703, file: !702, line: 56, baseType: !384, size: 8, offset: 200)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !703, file: !702, line: 57, baseType: !384, size: 8, offset: 208)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !703, file: !702, line: 57, baseType: !384, size: 8, offset: 216)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "multi_index", scope: !703, file: !702, line: 59, baseType: !280, size: 16, offset: 224)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !703, file: !702, line: 59, baseType: !280, size: 16, offset: 240)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !703, file: !702, line: 59, baseType: !280, size: 16, offset: 256)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !703, file: !702, line: 61, baseType: !280, size: 16, offset: 272)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !703, file: !702, line: 63, baseType: !55, size: 32, offset: 288)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "lodlevels", scope: !442, file: !443, line: 293, baseType: !268, size: 128, offset: 11200)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "currentlod", scope: !442, file: !443, line: 294, baseType: !721, size: 64, offset: 11328)
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 64)
!722 = !DIDerivedType(tag: DW_TAG_typedef, name: "LodLevel", file: !443, line: 113, baseType: !723)
!723 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LodLevel", file: !443, line: 108, size: 256, elements: !724)
!724 = !{!725, !727, !728, !729, !730}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !723, file: !443, line: 109, baseType: !726, size: 64)
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 64)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !723, file: !443, line: 109, baseType: !726, size: 64, offset: 64)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !723, file: !443, line: 110, baseType: !441, size: 64, offset: 128)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !723, file: !443, line: 111, baseType: !55, size: 32, offset: 192)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "distance", scope: !723, file: !443, line: 112, baseType: !277, size: 32, offset: 224)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !432, file: !433, line: 1221, baseType: !732, size: 64, offset: 1088)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 64)
!733 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !433, line: 52, flags: DIFlagFwdDecl)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !432, file: !433, line: 1223, baseType: !431, size: 64, offset: 1152)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !432, file: !433, line: 1225, baseType: !268, size: 128, offset: 1216)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !432, file: !433, line: 1226, baseType: !737, size: 64, offset: 1344)
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !738, size: 64)
!738 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !433, line: 69, size: 320, elements: !739)
!739 = !{!740, !741, !742, !743, !744, !745, !746, !747}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !738, file: !433, line: 70, baseType: !737, size: 64)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !738, file: !433, line: 70, baseType: !737, size: 64, offset: 64)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !738, file: !433, line: 71, baseType: !5, size: 32, offset: 128)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !738, file: !433, line: 71, baseType: !5, size: 32, offset: 160)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !738, file: !433, line: 72, baseType: !55, size: 32, offset: 192)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !738, file: !433, line: 73, baseType: !280, size: 16, offset: 224)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !738, file: !433, line: 73, baseType: !280, size: 16, offset: 240)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !738, file: !433, line: 74, baseType: !441, size: 64, offset: 256)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !432, file: !433, line: 1227, baseType: !441, size: 64, offset: 1408)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !432, file: !433, line: 1229, baseType: !505, size: 96, offset: 1472)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !432, file: !433, line: 1230, baseType: !505, size: 96, offset: 1568)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !432, file: !433, line: 1231, baseType: !505, size: 96, offset: 1664)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !432, file: !433, line: 1231, baseType: !505, size: 96, offset: 1760)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !432, file: !433, line: 1233, baseType: !5, size: 32, offset: 1856)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !432, file: !433, line: 1234, baseType: !55, size: 32, offset: 1888)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !432, file: !433, line: 1235, baseType: !5, size: 32, offset: 1920)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !432, file: !433, line: 1237, baseType: !280, size: 16, offset: 1952)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !432, file: !433, line: 1239, baseType: !384, size: 8, offset: 1968)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !432, file: !433, line: 1240, baseType: !759, size: 8, offset: 1976)
!759 = !DICompositeType(tag: DW_TAG_array_type, baseType: !384, size: 8, elements: !760)
!760 = !{!761}
!761 = !DISubrange(count: 1)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !432, file: !433, line: 1242, baseType: !763, size: 64, offset: 1984)
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 64)
!764 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !765, line: 328, size: 3456, elements: !766)
!765 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!766 = !{!767, !768, !769, !772, !773, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !799, !804, !805, !808, !812, !816, !820, !824, !825, !826, !827}
!767 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !764, file: !765, line: 329, baseType: !364, size: 960)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !764, file: !765, line: 330, baseType: !437, size: 64, offset: 960)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !764, file: !765, line: 332, baseType: !770, size: 64, offset: 1024)
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !771, size: 64)
!771 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !765, line: 332, flags: DIFlagFwdDecl)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !764, file: !765, line: 333, baseType: !412, size: 512, offset: 1088)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "interface_type", scope: !764, file: !765, line: 335, baseType: !774, size: 64, offset: 1600)
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 64)
!775 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !776, line: 41, flags: DIFlagFwdDecl)
!776 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!777 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !764, file: !765, line: 337, baseType: !536, size: 64, offset: 1664)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "view_center", scope: !764, file: !765, line: 338, baseType: !319, size: 64, offset: 1728)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !764, file: !765, line: 340, baseType: !268, size: 128, offset: 1792)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !764, file: !765, line: 340, baseType: !268, size: 128, offset: 1920)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !764, file: !765, line: 342, baseType: !55, size: 32, offset: 2048)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !764, file: !765, line: 342, baseType: !55, size: 32, offset: 2080)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "cur_index", scope: !764, file: !765, line: 343, baseType: !55, size: 32, offset: 2112)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !764, file: !765, line: 345, baseType: !55, size: 32, offset: 2144)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !764, file: !765, line: 346, baseType: !55, size: 32, offset: 2176)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "is_updating", scope: !764, file: !765, line: 347, baseType: !280, size: 16, offset: 2208)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !764, file: !765, line: 348, baseType: !280, size: 16, offset: 2224)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !764, file: !765, line: 349, baseType: !55, size: 32, offset: 2240)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "nodetype", scope: !764, file: !765, line: 351, baseType: !55, size: 32, offset: 2272)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "edit_quality", scope: !764, file: !765, line: 353, baseType: !280, size: 16, offset: 2304)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "render_quality", scope: !764, file: !765, line: 354, baseType: !280, size: 16, offset: 2320)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "chunksize", scope: !764, file: !765, line: 355, baseType: !55, size: 32, offset: 2336)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "viewer_border", scope: !764, file: !765, line: 357, baseType: !299, size: 128, offset: 2368)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !764, file: !765, line: 363, baseType: !268, size: 128, offset: 2496)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !764, file: !765, line: 363, baseType: !268, size: 128, offset: 2624)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "previews", scope: !764, file: !765, line: 368, baseType: !797, size: 64, offset: 2752)
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !798, size: 64)
!798 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHash", file: !765, line: 48, flags: DIFlagFwdDecl)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "active_viewer_key", scope: !764, file: !765, line: 372, baseType: !800, size: 32, offset: 2816)
!800 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !765, line: 274, baseType: !801)
!801 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !765, line: 271, size: 32, elements: !802)
!802 = !{!803}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !801, file: !765, line: 273, baseType: !5, size: 32)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !764, file: !765, line: 373, baseType: !55, size: 32, offset: 2848)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "execdata", scope: !764, file: !765, line: 382, baseType: !806, size: 64, offset: 2880)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 64)
!807 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeExec", file: !765, line: 46, flags: DIFlagFwdDecl)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !764, file: !765, line: 385, baseType: !809, size: 64, offset: 2944)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64)
!810 = !DISubroutineType(types: !811)
!811 = !{null, !273, !277}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "stats_draw", scope: !764, file: !765, line: 386, baseType: !813, size: 64, offset: 3008)
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 64)
!814 = !DISubroutineType(types: !815)
!815 = !{null, !273, !567}
!816 = !DIDerivedType(tag: DW_TAG_member, name: "test_break", scope: !764, file: !765, line: 387, baseType: !817, size: 64, offset: 3072)
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !818, size: 64)
!818 = !DISubroutineType(types: !819)
!819 = !{!55, !273}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "update_draw", scope: !764, file: !765, line: 388, baseType: !821, size: 64, offset: 3136)
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !822, size: 64)
!822 = !DISubroutineType(types: !823)
!823 = !{null, !273}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "tbh", scope: !764, file: !765, line: 389, baseType: !273, size: 64, offset: 3200)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "prh", scope: !764, file: !765, line: 389, baseType: !273, size: 64, offset: 3264)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "sdh", scope: !764, file: !765, line: 389, baseType: !273, size: 64, offset: 3328)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "udh", scope: !764, file: !765, line: 389, baseType: !273, size: 64, offset: 3392)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !432, file: !433, line: 1244, baseType: !829, size: 64, offset: 2048)
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 64)
!830 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !464, line: 200, size: 17024, elements: !831)
!831 = !{!832, !833, !834, !835, !1245, !1246, !1247, !1248, !1249, !1250, !1251}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "seqbasep", scope: !830, file: !464, line: 201, baseType: !691, size: 64)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !830, file: !464, line: 202, baseType: !268, size: 128, offset: 64)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "metastack", scope: !830, file: !464, line: 203, baseType: !268, size: 128, offset: 192)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "act_seq", scope: !830, file: !464, line: 206, baseType: !836, size: 64, offset: 320)
!836 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !837, size: 64)
!837 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sequence", file: !464, line: 190, baseType: !838)
!838 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sequence", file: !464, line: 126, size: 2816, elements: !839)
!839 = !{!840, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !938, !939, !940, !941, !1216, !1220, !1221, !1222, !1223, !1224, !1225, !1226, !1227, !1230, !1231, !1232, !1233, !1234, !1235, !1236, !1237, !1238, !1239, !1240, !1241, !1242, !1244}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !838, file: !464, line: 127, baseType: !841, size: 64)
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !838, size: 64)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !838, file: !464, line: 127, baseType: !841, size: 64, offset: 64)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !838, file: !464, line: 128, baseType: !273, size: 64, offset: 128)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !838, file: !464, line: 129, baseType: !273, size: 64, offset: 192)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !838, file: !464, line: 130, baseType: !412, size: 512, offset: 256)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !838, file: !464, line: 132, baseType: !55, size: 32, offset: 768)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !838, file: !464, line: 132, baseType: !55, size: 32, offset: 800)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !838, file: !464, line: 133, baseType: !55, size: 32, offset: 832)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !838, file: !464, line: 134, baseType: !55, size: 32, offset: 864)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "startofs", scope: !838, file: !464, line: 134, baseType: !55, size: 32, offset: 896)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "endofs", scope: !838, file: !464, line: 134, baseType: !55, size: 32, offset: 928)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !838, file: !464, line: 135, baseType: !55, size: 32, offset: 960)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !838, file: !464, line: 135, baseType: !55, size: 32, offset: 992)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !838, file: !464, line: 136, baseType: !55, size: 32, offset: 1024)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !838, file: !464, line: 136, baseType: !55, size: 32, offset: 1056)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "startdisp", scope: !838, file: !464, line: 137, baseType: !55, size: 32, offset: 1088)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "enddisp", scope: !838, file: !464, line: 137, baseType: !55, size: 32, offset: 1120)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "sat", scope: !838, file: !464, line: 138, baseType: !277, size: 32, offset: 1152)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "mul", scope: !838, file: !464, line: 139, baseType: !277, size: 32, offset: 1184)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "handsize", scope: !838, file: !464, line: 139, baseType: !277, size: 32, offset: 1216)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "anim_preseek", scope: !838, file: !464, line: 141, baseType: !280, size: 16, offset: 1248)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "streamindex", scope: !838, file: !464, line: 142, baseType: !280, size: 16, offset: 1264)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "multicam_source", scope: !838, file: !464, line: 143, baseType: !55, size: 32, offset: 1280)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "clip_flag", scope: !838, file: !464, line: 144, baseType: !55, size: 32, offset: 1312)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "strip", scope: !838, file: !464, line: 146, baseType: !866, size: 64, offset: 1344)
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !867, size: 64)
!867 = !DIDerivedType(tag: DW_TAG_typedef, name: "Strip", file: !464, line: 114, baseType: !868)
!868 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Strip", file: !464, line: 99, size: 7232, elements: !869)
!869 = !{!870, !872, !873, !874, !875, !876, !877, !888, !892, !906, !915, !922, !932}
!870 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !868, file: !464, line: 100, baseType: !871, size: 64)
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !868, size: 64)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !868, file: !464, line: 100, baseType: !871, size: 64, offset: 64)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !868, file: !464, line: 101, baseType: !55, size: 32, offset: 128)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !868, file: !464, line: 101, baseType: !55, size: 32, offset: 160)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !868, file: !464, line: 102, baseType: !55, size: 32, offset: 192)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !868, file: !464, line: 102, baseType: !55, size: 32, offset: 224)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "stripdata", scope: !868, file: !464, line: 103, baseType: !878, size: 64, offset: 256)
!878 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !879, size: 64)
!879 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripElem", file: !464, line: 59, baseType: !880)
!880 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripElem", file: !464, line: 56, size: 2112, elements: !881)
!881 = !{!882, !886, !887}
!882 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !880, file: !464, line: 57, baseType: !883, size: 2048)
!883 = !DICompositeType(tag: DW_TAG_array_type, baseType: !384, size: 2048, elements: !884)
!884 = !{!885}
!885 = !DISubrange(count: 256)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "orig_width", scope: !880, file: !464, line: 58, baseType: !55, size: 32, offset: 2048)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "orig_height", scope: !880, file: !464, line: 58, baseType: !55, size: 32, offset: 2080)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !868, file: !464, line: 106, baseType: !889, size: 6144, offset: 320)
!889 = !DICompositeType(tag: DW_TAG_array_type, baseType: !384, size: 6144, elements: !890)
!890 = !{!891}
!891 = !DISubrange(count: 768)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !868, file: !464, line: 107, baseType: !893, size: 64, offset: 6464)
!893 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !894, size: 64)
!894 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripProxy", file: !464, line: 97, baseType: !895)
!895 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripProxy", file: !464, line: 83, size: 8320, elements: !896)
!896 = !{!897, !898, !899, !902, !903, !904, !905}
!897 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !895, file: !464, line: 84, baseType: !889, size: 6144)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !895, file: !464, line: 87, baseType: !883, size: 2048, offset: 6144)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !895, file: !464, line: 88, baseType: !900, size: 64, offset: 8192)
!900 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !901, size: 64)
!901 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !702, line: 41, flags: DIFlagFwdDecl)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !895, file: !464, line: 90, baseType: !280, size: 16, offset: 8256)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !895, file: !464, line: 92, baseType: !280, size: 16, offset: 8272)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flags", scope: !895, file: !464, line: 93, baseType: !280, size: 16, offset: 8288)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flags", scope: !895, file: !464, line: 95, baseType: !280, size: 16, offset: 8304)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !868, file: !464, line: 108, baseType: !907, size: 64, offset: 6528)
!907 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !908, size: 64)
!908 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripCrop", file: !464, line: 66, baseType: !909)
!909 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripCrop", file: !464, line: 61, size: 128, elements: !910)
!910 = !{!911, !912, !913, !914}
!911 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !909, file: !464, line: 62, baseType: !55, size: 32)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !909, file: !464, line: 63, baseType: !55, size: 32, offset: 32)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !909, file: !464, line: 64, baseType: !55, size: 32, offset: 64)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !909, file: !464, line: 65, baseType: !55, size: 32, offset: 96)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !868, file: !464, line: 109, baseType: !916, size: 64, offset: 6592)
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 64)
!917 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripTransform", file: !464, line: 71, baseType: !918)
!918 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripTransform", file: !464, line: 68, size: 64, elements: !919)
!919 = !{!920, !921}
!920 = !DIDerivedType(tag: DW_TAG_member, name: "xofs", scope: !918, file: !464, line: 69, baseType: !55, size: 32)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "yofs", scope: !918, file: !464, line: 70, baseType: !55, size: 32, offset: 32)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "color_balance", scope: !868, file: !464, line: 110, baseType: !923, size: 64, offset: 6656)
!923 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !924, size: 64)
!924 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripColorBalance", file: !464, line: 81, baseType: !925)
!925 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripColorBalance", file: !464, line: 73, size: 352, elements: !926)
!926 = !{!927, !928, !929, !930, !931}
!927 = !DIDerivedType(tag: DW_TAG_member, name: "lift", scope: !925, file: !464, line: 74, baseType: !505, size: 96)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !925, file: !464, line: 75, baseType: !505, size: 96, offset: 96)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "gain", scope: !925, file: !464, line: 76, baseType: !505, size: 96, offset: 192)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !925, file: !464, line: 77, baseType: !55, size: 32, offset: 288)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !925, file: !464, line: 78, baseType: !55, size: 32, offset: 320)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !868, file: !464, line: 113, baseType: !933, size: 512, offset: 6720)
!933 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !934, line: 182, baseType: !935)
!934 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!935 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !934, line: 180, size: 512, elements: !936)
!936 = !{!937}
!937 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !935, file: !934, line: 181, baseType: !412, size: 512)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !838, file: !464, line: 148, baseType: !462, size: 64, offset: 1408)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !838, file: !464, line: 151, baseType: !431, size: 64, offset: 1472)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "scene_camera", scope: !838, file: !464, line: 152, baseType: !441, size: 64, offset: 1536)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "clip", scope: !838, file: !464, line: 153, baseType: !942, size: 64, offset: 1600)
!942 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 64)
!943 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClip", file: !439, line: 64, size: 19136, elements: !944)
!944 = !{!945, !946, !947, !948, !949, !950, !952, !953, !954, !955, !958, !959, !1202, !1203, !1211, !1212, !1213, !1214, !1215}
!945 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !943, file: !439, line: 65, baseType: !364, size: 960)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !943, file: !439, line: 66, baseType: !437, size: 64, offset: 960)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !943, file: !439, line: 68, baseType: !383, size: 8192, offset: 1024)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !943, file: !439, line: 70, baseType: !55, size: 32, offset: 9216)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !943, file: !439, line: 71, baseType: !55, size: 32, offset: 9248)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "lastsize", scope: !943, file: !439, line: 72, baseType: !951, size: 64, offset: 9280)
!951 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 64, elements: !320)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !943, file: !439, line: 74, baseType: !277, size: 32, offset: 9344)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !943, file: !439, line: 74, baseType: !277, size: 32, offset: 9376)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !943, file: !439, line: 76, baseType: !900, size: 64, offset: 9408)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !943, file: !439, line: 77, baseType: !956, size: 64, offset: 9472)
!956 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 64)
!957 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipCache", file: !439, line: 77, flags: DIFlagFwdDecl)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !943, file: !439, line: 78, baseType: !536, size: 64, offset: 9536)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "tracking", scope: !943, file: !439, line: 80, baseType: !960, size: 2624, offset: 9600)
!960 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTracking", file: !538, line: 340, size: 2624, elements: !961)
!961 = !{!962, !990, !1008, !1009, !1010, !1025, !1083, !1084, !1182, !1183, !1184, !1185, !1191}
!962 = !DIDerivedType(tag: DW_TAG_member, name: "settings", scope: !960, file: !538, line: 341, baseType: !963, size: 576)
!963 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingSettings", file: !538, line: 251, baseType: !964)
!964 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingSettings", file: !538, line: 207, size: 576, elements: !965)
!965 = !{!966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989}
!966 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !964, file: !538, line: 208, baseType: !55, size: 32)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "default_motion_model", scope: !964, file: !538, line: 211, baseType: !280, size: 16, offset: 32)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "default_algorithm_flag", scope: !964, file: !538, line: 212, baseType: !280, size: 16, offset: 48)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "default_minimum_correlation", scope: !964, file: !538, line: 213, baseType: !277, size: 32, offset: 64)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_size", scope: !964, file: !538, line: 214, baseType: !280, size: 16, offset: 96)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "default_search_size", scope: !964, file: !538, line: 215, baseType: !280, size: 16, offset: 112)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "default_frames_limit", scope: !964, file: !538, line: 216, baseType: !280, size: 16, offset: 128)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "default_margin", scope: !964, file: !538, line: 217, baseType: !280, size: 16, offset: 144)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_match", scope: !964, file: !538, line: 218, baseType: !280, size: 16, offset: 160)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "default_flag", scope: !964, file: !538, line: 219, baseType: !280, size: 16, offset: 176)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "default_weight", scope: !964, file: !538, line: 220, baseType: !277, size: 32, offset: 192)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "motion_flag", scope: !964, file: !538, line: 222, baseType: !280, size: 16, offset: 224)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "speed", scope: !964, file: !538, line: 225, baseType: !280, size: 16, offset: 240)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe1", scope: !964, file: !538, line: 228, baseType: !55, size: 32, offset: 256)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe2", scope: !964, file: !538, line: 229, baseType: !55, size: 32, offset: 288)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction_flag", scope: !964, file: !538, line: 233, baseType: !55, size: 32, offset: 320)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "refine_camera_intrinsics", scope: !964, file: !538, line: 236, baseType: !280, size: 16, offset: 352)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !964, file: !538, line: 236, baseType: !280, size: 16, offset: 368)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !964, file: !538, line: 241, baseType: !277, size: 32, offset: 384)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "clean_frames", scope: !964, file: !538, line: 244, baseType: !55, size: 32, offset: 416)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "clean_action", scope: !964, file: !538, line: 244, baseType: !55, size: 32, offset: 448)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "clean_error", scope: !964, file: !538, line: 245, baseType: !277, size: 32, offset: 480)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "object_distance", scope: !964, file: !538, line: 248, baseType: !277, size: 32, offset: 512)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !964, file: !538, line: 250, baseType: !55, size: 32, offset: 544)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !960, file: !538, line: 342, baseType: !991, size: 448, offset: 576)
!991 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingCamera", file: !538, line: 79, baseType: !992)
!992 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingCamera", file: !538, line: 61, size: 448, elements: !993)
!993 = !{!994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007}
!994 = !DIDerivedType(tag: DW_TAG_member, name: "intrinsics", scope: !992, file: !538, line: 62, baseType: !273, size: 64)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_model", scope: !992, file: !538, line: 64, baseType: !280, size: 16, offset: 64)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !992, file: !538, line: 65, baseType: !280, size: 16, offset: 80)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "sensor_width", scope: !992, file: !538, line: 67, baseType: !277, size: 32, offset: 96)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_aspect", scope: !992, file: !538, line: 68, baseType: !277, size: 32, offset: 128)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "focal", scope: !992, file: !538, line: 69, baseType: !277, size: 32, offset: 160)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !992, file: !538, line: 70, baseType: !280, size: 16, offset: 192)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !992, file: !538, line: 71, baseType: !280, size: 16, offset: 208)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "principal", scope: !992, file: !538, line: 72, baseType: !319, size: 64, offset: 224)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "k1", scope: !992, file: !538, line: 75, baseType: !277, size: 32, offset: 288)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "k2", scope: !992, file: !538, line: 75, baseType: !277, size: 32, offset: 320)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "k3", scope: !992, file: !538, line: 75, baseType: !277, size: 32, offset: 352)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "division_k1", scope: !992, file: !538, line: 78, baseType: !277, size: 32, offset: 384)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "division_k2", scope: !992, file: !538, line: 78, baseType: !277, size: 32, offset: 416)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "tracks", scope: !960, file: !538, line: 343, baseType: !268, size: 128, offset: 1024)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "plane_tracks", scope: !960, file: !538, line: 344, baseType: !268, size: 128, offset: 1152)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction", scope: !960, file: !538, line: 345, baseType: !1011, size: 192, offset: 1280)
!1011 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingReconstruction", file: !538, line: 278, baseType: !1012)
!1012 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingReconstruction", file: !538, line: 270, size: 192, elements: !1013)
!1013 = !{!1014, !1015, !1016, !1017, !1018}
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1012, file: !538, line: 271, baseType: !55, size: 32)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1012, file: !538, line: 273, baseType: !277, size: 32, offset: 32)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "last_camera", scope: !1012, file: !538, line: 275, baseType: !55, size: 32, offset: 64)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "camnr", scope: !1012, file: !538, line: 276, baseType: !55, size: 32, offset: 96)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "cameras", scope: !1012, file: !538, line: 277, baseType: !1019, size: 64, offset: 128)
!1019 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1020, size: 64)
!1020 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieReconstructedCamera", file: !538, line: 55, size: 576, elements: !1021)
!1021 = !{!1022, !1023, !1024}
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !1020, file: !538, line: 56, baseType: !55, size: 32)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1020, file: !538, line: 57, baseType: !277, size: 32, offset: 32)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !1020, file: !538, line: 58, baseType: !588, size: 512, offset: 64)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "stabilization", scope: !960, file: !538, line: 346, baseType: !1026, size: 384, offset: 1472)
!1026 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStabilization", file: !538, line: 268, baseType: !1027)
!1027 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStabilization", file: !538, line: 253, size: 384, elements: !1028)
!1028 = !{!1029, !1030, !1031, !1032, !1033, !1077, !1078, !1079, !1080, !1081, !1082}
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1027, file: !538, line: 254, baseType: !55, size: 32)
