; ModuleID = 'blender/source/blender/editors/mesh/editmesh_inset.c'
source_filename = "blender/source/blender/editors/mesh/editmesh_inset.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.Global = type { %struct.Main*, [1024 x i8], [1024 x i8], i8, i8, i8, %struct.ListBase, i8, i8, i8, i16, i16, i16, i8, i16, i32, i32, i8, i32, i32, [200 x i8] }
%struct.Main = type opaque
%struct.ListBase = type { i8*, i8* }
%struct.wmOperatorType = type { i8*, i8*, i8*, i8*, i32 (%struct.bContext*, %struct.wmOperator*)*, i8 (%struct.bContext*, %struct.wmOperator*)*, i32 (%struct.bContext*, %struct.wmOperator*, %struct.wmEvent*)*, void (%struct.bContext*, %struct.wmOperator*)*, i32 (%struct.bContext*, %struct.wmOperator*, %struct.wmEvent*)*, i32 (%struct.bContext*)*, void (%struct.bContext*, %struct.wmOperator*)*, %struct.StructRNA*, %struct.IDProperty*, %struct.PropertyRNA*, %struct.ListBase, %struct.wmKeyMap*, i8*, i32 (%struct.bContext*, %struct.wmOperatorType*)*, %struct.ExtensionRNA, i16 }
%struct.bContext = type opaque
%struct.wmOperator = type { %struct.wmOperator*, %struct.wmOperator*, [64 x i8], %struct.IDProperty*, %struct.wmOperatorType*, i8*, i8*, %struct.PointerRNA*, %struct.ReportList*, %struct.ListBase, %struct.wmOperator*, %struct.uiLayout*, i16, [3 x i16] }
%struct.PointerRNA = type { %struct.anon, %struct.StructRNA*, i8* }
%struct.anon = type { i8* }

!27 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eBMOpSlotSubType_Map", file: !4, line: 123, baseType: !5, size: 32, elements: !28)
!28 = !{!29, !30, !31, !32, !33, !34}
!29 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_EMPTY", value: 64, isUnsigned: true)
!30 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_ELEM", value: 65, isUnsigned: true)
!31 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_FLT", value: 66, isUnsigned: true)
!32 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_INT", value: 67, isUnsigned: true)
!33 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_BOOL", value: 68, isUnsigned: true)
!34 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_INTERNAL", value: 69, isUnsigned: true)
!35 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 182, baseType: !5, size: 32, elements: !36)
!36 = !{!37, !38, !39, !40, !41}
!37 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_NOP", value: 0, isUnsigned: true)
!38 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_UNTAN_MULTIRES", value: 1, isUnsigned: true)
!39 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_NORMALS_CALC", value: 2, isUnsigned: true)
!40 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_SELECT_FLUSH", value: 4, isUnsigned: true)
!41 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_SELECT_VALIDATE", value: 8, isUnsigned: true)
!42 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !43, line: 351, baseType: !5, size: 32, elements: !44)
!43 = !DIFile(filename: "blender/source/blender/makesdna/DNA_windowmanager_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!44 = !{!45, !46, !47, !48, !49, !50}
!45 = !DIEnumerator(name: "OPERATOR_RUNNING_MODAL", value: 1, isUnsigned: true)
!46 = !DIEnumerator(name: "OPERATOR_CANCELLED", value: 2, isUnsigned: true)
!47 = !DIEnumerator(name: "OPERATOR_FINISHED", value: 4, isUnsigned: true)
!48 = !DIEnumerator(name: "OPERATOR_PASS_THROUGH", value: 8, isUnsigned: true)
!49 = !DIEnumerator(name: "OPERATOR_HANDLED", value: 16, isUnsigned: true)
!50 = !DIEnumerator(name: "OPERATOR_INTERFACE", value: 32, isUnsigned: true)
!51 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !52, line: 64, baseType: !5, size: 32, elements: !53)
!52 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_unit.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!53 = !{!54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64}
!54 = !DIEnumerator(name: "B_UNIT_NONE", value: 0, isUnsigned: true)
!55 = !DIEnumerator(name: "B_UNIT_LENGTH", value: 1, isUnsigned: true)
!56 = !DIEnumerator(name: "B_UNIT_AREA", value: 2, isUnsigned: true)
!57 = !DIEnumerator(name: "B_UNIT_VOLUME", value: 3, isUnsigned: true)
!58 = !DIEnumerator(name: "B_UNIT_MASS", value: 4, isUnsigned: true)
!59 = !DIEnumerator(name: "B_UNIT_ROTATION", value: 5, isUnsigned: true)
!60 = !DIEnumerator(name: "B_UNIT_TIME", value: 6, isUnsigned: true)
!61 = !DIEnumerator(name: "B_UNIT_VELOCITY", value: 7, isUnsigned: true)
!62 = !DIEnumerator(name: "B_UNIT_ACCELERATION", value: 8, isUnsigned: true)
!63 = !DIEnumerator(name: "B_UNIT_CAMERA", value: 9, isUnsigned: true)
!64 = !DIEnumerator(name: "B_UNIT_TYPE_TOT", value: 10, isUnsigned: true)
!65 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !66, line: 260, baseType: !5, size: 32, elements: !67)
!66 = !DIFile(filename: "blender/source/blender/bmesh/bmesh_class.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!67 = !{!68, !69, !70, !71, !72, !73, !74}
!68 = !DIEnumerator(name: "BM_ELEM_SELECT", value: 1, isUnsigned: true)
!69 = !DIEnumerator(name: "BM_ELEM_HIDDEN", value: 2, isUnsigned: true)
!70 = !DIEnumerator(name: "BM_ELEM_SEAM", value: 4, isUnsigned: true)
!71 = !DIEnumerator(name: "BM_ELEM_SMOOTH", value: 8, isUnsigned: true)
!72 = !DIEnumerator(name: "BM_ELEM_TAG", value: 16, isUnsigned: true)
!73 = !DIEnumerator(name: "BM_ELEM_DRAW", value: 32, isUnsigned: true)
!74 = !DIEnumerator(name: "BM_ELEM_INTERNAL_TAG", value: 128, isUnsigned: true)
!75 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !66, line: 249, baseType: !5, size: 32, elements: !76)
!76 = !{!77, !78, !79, !80}
!77 = !DIEnumerator(name: "BM_VERT", value: 1, isUnsigned: true)
!78 = !DIEnumerator(name: "BM_EDGE", value: 2, isUnsigned: true)
!79 = !DIEnumerator(name: "BM_LOOP", value: 4, isUnsigned: true)
!80 = !DIEnumerator(name: "BM_FACE", value: 8, isUnsigned: true)
!81 = !{i32 7, !"Dwarf Version", i32 4}
!82 = !{i32 2, !"Debug Info Version", i32 3}
!83 = !{i32 1, !"wchar_size", i32 4}
!84 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!85 = distinct !DISubprogram(name: "MESH_OT_inset", scope: !1, file: !1, line: 485, type: !86, scopeLine: 486, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !1886)
!86 = !DISubroutineType(types: !87)
!87 = !{null, !88}
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "wmOperatorType", file: !90, line: 568, baseType: !91)
!90 = !DIFile(filename: "blender/source/blender/windowmanager/WM_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!91 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmOperatorType", file: !90, line: 508, size: 1536, elements: !92)
!92 = !{!93, !97, !98, !99, !100, !1812, !1816, !1822, !1826, !1827, !1831, !1832, !1833, !1834, !1838, !1839, !1854, !1855, !1859, !1885}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !91, file: !90, line: 509, baseType: !94, size: 64)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !96)
!96 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !91, file: !90, line: 510, baseType: !94, size: 64, offset: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "translation_context", scope: !91, file: !90, line: 511, baseType: !94, size: 64, offset: 128)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !91, file: !90, line: 512, baseType: !94, size: 64, offset: 192)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !91, file: !90, line: 518, baseType: !101, size: 64, offset: 256)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = !DISubroutineType(types: !103)
!103 = !{!104, !105, !108}
!104 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!106 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !107, line: 44, flags: DIFlagFwdDecl)
!107 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmOperator", file: !43, line: 328, size: 1344, elements: !110)
!110 = !{!111, !112, !113, !117, !149, !151, !152, !153, !165, !1805, !1806, !1807, !1810, !1811}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !109, file: !43, line: 329, baseType: !108, size: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !109, file: !43, line: 329, baseType: !108, size: 64, offset: 64)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !109, file: !43, line: 332, baseType: !114, size: 512, offset: 128)
!114 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 512, elements: !115)
!115 = !{!116}
!116 = !DISubrange(count: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !109, file: !43, line: 333, baseType: !118, size: 64, offset: 640)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !120, line: 75, baseType: !121)
!120 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !120, line: 62, size: 1024, elements: !122)
!122 = !{!123, !125, !126, !127, !128, !130, !131, !132, !147, !148}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !121, file: !120, line: 63, baseType: !124, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !121, file: !120, line: 63, baseType: !124, size: 64, offset: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !121, file: !120, line: 64, baseType: !96, size: 8, offset: 128)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !121, file: !120, line: 64, baseType: !96, size: 8, offset: 136)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !121, file: !120, line: 65, baseType: !129, size: 16, offset: 144)
!129 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !121, file: !120, line: 66, baseType: !114, size: 512, offset: 160)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !121, file: !120, line: 67, baseType: !104, size: 32, offset: 672)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !121, file: !120, line: 69, baseType: !133, size: 256, offset: 704)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !120, line: 60, baseType: !134)
!134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !120, line: 48, size: 256, elements: !135)
!135 = !{!136, !138, !145, !146}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !134, file: !120, line: 49, baseType: !137, size: 64)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !134, file: !120, line: 58, baseType: !139, size: 128, offset: 64)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !140, line: 71, baseType: !141)
!140 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !140, line: 69, size: 128, elements: !142)
!142 = !{!143, !144}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !141, file: !140, line: 70, baseType: !137, size: 64)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !141, file: !140, line: 70, baseType: !137, size: 64, offset: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !134, file: !120, line: 59, baseType: !104, size: 32, offset: 192)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !134, file: !120, line: 59, baseType: !104, size: 32, offset: 224)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !121, file: !120, line: 70, baseType: !104, size: 32, offset: 960)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !121, file: !120, line: 74, baseType: !104, size: 32, offset: 992)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !109, file: !43, line: 336, baseType: !150, size: 64, offset: 704)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !109, file: !43, line: 337, baseType: !137, size: 64, offset: 768)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "py_instance", scope: !109, file: !43, line: 338, baseType: !137, size: 64, offset: 832)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !109, file: !43, line: 340, baseType: !154, size: 64, offset: 896)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !107, line: 55, size: 192, elements: !156)
!156 = !{!157, !161, !164}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !155, file: !107, line: 58, baseType: !158, size: 64)
!158 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !155, file: !107, line: 56, size: 64, elements: !159)
!159 = !{!160}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !158, file: !107, line: 57, baseType: !137, size: 64)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !155, file: !107, line: 60, baseType: !162, size: 64, offset: 64)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !107, line: 41, flags: DIFlagFwdDecl)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !155, file: !107, line: 61, baseType: !137, size: 64, offset: 128)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "reports", scope: !109, file: !43, line: 341, baseType: !166, size: 64, offset: 960)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ReportList", file: !43, line: 106, size: 320, elements: !168)
!168 = !{!169, !170, !171, !172, !173, !174}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !167, file: !43, line: 107, baseType: !139, size: 128)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "printlevel", scope: !167, file: !43, line: 108, baseType: !104, size: 32, offset: 128)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "storelevel", scope: !167, file: !43, line: 109, baseType: !104, size: 32, offset: 160)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !167, file: !43, line: 110, baseType: !104, size: 32, offset: 192)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !167, file: !43, line: 110, baseType: !104, size: 32, offset: 224)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "reporttimer", scope: !167, file: !43, line: 111, baseType: !175, size: 64, offset: 256)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!176 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTimer", file: !90, line: 490, size: 768, elements: !177)
!177 = !{!178, !179, !180, !1796, !1797, !1798, !1799, !1800, !1801, !1802, !1803, !1804}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !176, file: !90, line: 491, baseType: !175, size: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !176, file: !90, line: 491, baseType: !175, size: 64, offset: 64)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "win", scope: !176, file: !90, line: 493, baseType: !181, size: 64, offset: 128)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!182 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindow", file: !43, line: 169, size: 2048, elements: !183)
!183 = !{!184, !185, !186, !187, !1713, !1714, !1715, !1716, !1717, !1718, !1719, !1720, !1721, !1722, !1723, !1724, !1725, !1726, !1727, !1728, !1729, !1730, !1771, !1774, !1788, !1789, !1790, !1791, !1792, !1793, !1794, !1795}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !182, file: !43, line: 170, baseType: !181, size: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !182, file: !43, line: 170, baseType: !181, size: 64, offset: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "ghostwin", scope: !182, file: !43, line: 172, baseType: !137, size: 64, offset: 128)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !182, file: !43, line: 174, baseType: !188, size: 64, offset: 192)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !190, line: 49, size: 1984, elements: !191)
!190 = !DIFile(filename: "blender/source/blender/makesdna/DNA_screen_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!191 = !{!192, !228, !229, !230, !231, !232, !1696, !1697, !1698, !1699, !1700, !1701, !1702, !1703, !1704, !1705, !1706, !1707, !1708, !1709, !1710, !1711, !1712}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !189, file: !190, line: 50, baseType: !193, size: 960)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !120, line: 130, baseType: !194)
!194 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !120, line: 117, size: 960, elements: !195)
!195 = !{!196, !197, !198, !200, !219, !223, !224, !225, !226, !227}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !194, file: !120, line: 118, baseType: !137, size: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !194, file: !120, line: 118, baseType: !137, size: 64, offset: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !194, file: !120, line: 119, baseType: !199, size: 64, offset: 128)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !194, file: !120, line: 120, baseType: !201, size: 64, offset: 192)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !120, line: 136, size: 17600, elements: !203)
!203 = !{!204, !205, !207, !210, !214, !215, !216}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !202, file: !120, line: 137, baseType: !193, size: 960)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !202, file: !120, line: 138, baseType: !206, size: 64, offset: 960)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !202, file: !120, line: 139, baseType: !208, size: 64, offset: 1024)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !120, line: 43, flags: DIFlagFwdDecl)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !202, file: !120, line: 140, baseType: !211, size: 8192, offset: 1088)
!211 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 8192, elements: !212)
!212 = !{!213}
!213 = !DISubrange(count: 1024)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !202, file: !120, line: 141, baseType: !211, size: 8192, offset: 9280)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !202, file: !120, line: 148, baseType: !201, size: 64, offset: 17472)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !202, file: !120, line: 150, baseType: !217, size: 64, offset: 17536)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64)
!218 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !120, line: 45, flags: DIFlagFwdDecl)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !194, file: !120, line: 121, baseType: !220, size: 528, offset: 256)
!220 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 528, elements: !221)
!221 = !{!222}
!222 = !DISubrange(count: 66)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !194, file: !120, line: 126, baseType: !129, size: 16, offset: 784)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !194, file: !120, line: 127, baseType: !104, size: 32, offset: 800)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !194, file: !120, line: 128, baseType: !104, size: 32, offset: 832)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !194, file: !120, line: 128, baseType: !104, size: 32, offset: 864)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !194, file: !120, line: 129, baseType: !118, size: 64, offset: 896)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "vertbase", scope: !189, file: !190, line: 52, baseType: !139, size: 128, offset: 960)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "edgebase", scope: !189, file: !190, line: 53, baseType: !139, size: 128, offset: 1088)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "areabase", scope: !189, file: !190, line: 54, baseType: !139, size: 128, offset: 1216)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !189, file: !190, line: 55, baseType: !139, size: 128, offset: 1344)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !189, file: !190, line: 57, baseType: !233, size: 64, offset: 1472)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !235, line: 1216, size: 39680, elements: !236)
!235 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!236 = !{!237, !238, !242, !534, !537, !538, !539, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !565, !636, !1064, !1280, !1283, !1571, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1593, !1594, !1595, !1596, !1597, !1605, !1672, !1679, !1680, !1687, !1688, !1689, !1690, !1691, !1692, !1693}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !234, file: !235, line: 1217, baseType: !193, size: 960)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !234, file: !235, line: 1218, baseType: !239, size: 64, offset: 960)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!240 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !241, line: 45, flags: DIFlagFwdDecl)
!241 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!242 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !234, file: !235, line: 1220, baseType: !243, size: 64, offset: 1024)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!244 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !245, line: 115, size: 11392, elements: !246)
!245 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!246 = !{!247, !248, !249, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !266, !278, !292, !293, !336, !337, !340, !341, !357, !358, !359, !360, !361, !362, !363, !367, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !383, !384, !385, !386, !387, !388, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !448, !449, !450, !451, !452, !453, !454, !455, !456, !459, !462, !465, !466, !467, !468, !469, !472, !475, !478, !479, !485, !486, !487, !488, !489, !490, !492, !495, !498, !502, !522, !523}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !244, file: !245, line: 116, baseType: !193, size: 960)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !244, file: !245, line: 117, baseType: !239, size: 64, offset: 960)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !244, file: !245, line: 119, baseType: !250, size: 64, offset: 1024)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!251 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !245, line: 57, flags: DIFlagFwdDecl)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !244, file: !245, line: 121, baseType: !129, size: 16, offset: 1088)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !244, file: !245, line: 121, baseType: !129, size: 16, offset: 1104)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !244, file: !245, line: 122, baseType: !104, size: 32, offset: 1120)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !244, file: !245, line: 122, baseType: !104, size: 32, offset: 1152)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !244, file: !245, line: 122, baseType: !104, size: 32, offset: 1184)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !244, file: !245, line: 123, baseType: !114, size: 512, offset: 1216)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !244, file: !245, line: 124, baseType: !243, size: 64, offset: 1728)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !244, file: !245, line: 124, baseType: !243, size: 64, offset: 1792)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !244, file: !245, line: 127, baseType: !243, size: 64, offset: 1856)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !244, file: !245, line: 127, baseType: !243, size: 64, offset: 1920)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !244, file: !245, line: 127, baseType: !243, size: 64, offset: 1984)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !244, file: !245, line: 128, baseType: !264, size: 64, offset: 2048)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !241, line: 46, flags: DIFlagFwdDecl)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !244, file: !245, line: 130, baseType: !267, size: 64, offset: 2112)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !245, line: 97, size: 832, elements: !269)
!269 = !{!270, !276, !277}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !268, file: !245, line: 98, baseType: !271, size: 768)
!271 = !DICompositeType(tag: DW_TAG_array_type, baseType: !272, size: 768, elements: !273)
!272 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!273 = !{!274, !275}
!274 = !DISubrange(count: 8)
!275 = !DISubrange(count: 3)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !268, file: !245, line: 99, baseType: !104, size: 32, offset: 768)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !268, file: !245, line: 99, baseType: !104, size: 32, offset: 800)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !244, file: !245, line: 131, baseType: !279, size: 64, offset: 2176)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64)
!280 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !281, line: 486, size: 1600, elements: !282)
!281 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!282 = !{!283, !284, !285, !286, !287, !288, !289, !290, !291}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !280, file: !281, line: 487, baseType: !193, size: 960)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !280, file: !281, line: 489, baseType: !139, size: 128, offset: 960)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !280, file: !281, line: 490, baseType: !139, size: 128, offset: 1088)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !280, file: !281, line: 491, baseType: !139, size: 128, offset: 1216)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !280, file: !281, line: 492, baseType: !139, size: 128, offset: 1344)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !280, file: !281, line: 494, baseType: !104, size: 32, offset: 1472)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !280, file: !281, line: 495, baseType: !104, size: 32, offset: 1504)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !280, file: !281, line: 497, baseType: !104, size: 32, offset: 1536)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !280, file: !281, line: 498, baseType: !104, size: 32, offset: 1568)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !244, file: !245, line: 132, baseType: !279, size: 64, offset: 2240)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !244, file: !245, line: 133, baseType: !294, size: 64, offset: 2304)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
!295 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !281, line: 334, size: 1728, elements: !296)
!296 = !{!297, !298, !301, !302, !303, !304, !305, !306, !309, !310, !311, !312, !313, !314, !315, !335}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !295, file: !281, line: 335, baseType: !139, size: 128)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !295, file: !281, line: 336, baseType: !299, size: 64, offset: 128)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64)
!300 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !281, line: 47, flags: DIFlagFwdDecl)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !295, file: !281, line: 338, baseType: !129, size: 16, offset: 192)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !295, file: !281, line: 338, baseType: !129, size: 16, offset: 208)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !295, file: !281, line: 339, baseType: !5, size: 32, offset: 224)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !295, file: !281, line: 340, baseType: !104, size: 32, offset: 256)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !295, file: !281, line: 342, baseType: !272, size: 32, offset: 288)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !295, file: !281, line: 343, baseType: !307, size: 96, offset: 320)
!307 = !DICompositeType(tag: DW_TAG_array_type, baseType: !272, size: 96, elements: !308)
!308 = !{!275}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !295, file: !281, line: 344, baseType: !307, size: 96, offset: 416)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !295, file: !281, line: 347, baseType: !139, size: 128, offset: 512)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !295, file: !281, line: 349, baseType: !104, size: 32, offset: 640)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !295, file: !281, line: 350, baseType: !104, size: 32, offset: 672)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !295, file: !281, line: 351, baseType: !137, size: 64, offset: 704)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !295, file: !281, line: 352, baseType: !137, size: 64, offset: 768)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !295, file: !281, line: 354, baseType: !316, size: 384, offset: 832)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !281, line: 116, baseType: !317)
!317 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !281, line: 94, size: 384, elements: !318)
!318 = !{!319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !317, file: !281, line: 96, baseType: !104, size: 32)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !317, file: !281, line: 96, baseType: !104, size: 32, offset: 32)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !317, file: !281, line: 97, baseType: !104, size: 32, offset: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !317, file: !281, line: 97, baseType: !104, size: 32, offset: 96)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !317, file: !281, line: 99, baseType: !129, size: 16, offset: 128)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !317, file: !281, line: 100, baseType: !129, size: 16, offset: 144)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !317, file: !281, line: 102, baseType: !129, size: 16, offset: 160)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !317, file: !281, line: 105, baseType: !129, size: 16, offset: 176)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !317, file: !281, line: 108, baseType: !129, size: 16, offset: 192)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !317, file: !281, line: 109, baseType: !129, size: 16, offset: 208)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !317, file: !281, line: 111, baseType: !129, size: 16, offset: 224)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !317, file: !281, line: 112, baseType: !129, size: 16, offset: 240)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !317, file: !281, line: 114, baseType: !104, size: 32, offset: 256)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !317, file: !281, line: 114, baseType: !104, size: 32, offset: 288)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !317, file: !281, line: 115, baseType: !104, size: 32, offset: 320)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !317, file: !281, line: 115, baseType: !104, size: 32, offset: 352)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !295, file: !281, line: 355, baseType: !114, size: 512, offset: 1216)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !244, file: !245, line: 134, baseType: !137, size: 64, offset: 2368)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !244, file: !245, line: 136, baseType: !338, size: 64, offset: 2432)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!339 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !245, line: 58, flags: DIFlagFwdDecl)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !244, file: !245, line: 138, baseType: !316, size: 384, offset: 2496)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !244, file: !245, line: 139, baseType: !342, size: 64, offset: 2880)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !281, line: 80, baseType: !344)
!344 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !281, line: 72, size: 192, elements: !345)
!345 = !{!346, !353, !354, !355, !356}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !344, file: !281, line: 73, baseType: !347, size: 64)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !281, line: 59, baseType: !349)
!349 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !281, line: 56, size: 128, elements: !350)
!350 = !{!351, !352}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !349, file: !281, line: 57, baseType: !307, size: 96)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !349, file: !281, line: 58, baseType: !104, size: 32, offset: 96)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !344, file: !281, line: 74, baseType: !104, size: 32, offset: 64)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !344, file: !281, line: 76, baseType: !104, size: 32, offset: 96)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !344, file: !281, line: 77, baseType: !104, size: 32, offset: 128)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !344, file: !281, line: 79, baseType: !104, size: 32, offset: 160)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !244, file: !245, line: 141, baseType: !139, size: 128, offset: 2944)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !244, file: !245, line: 142, baseType: !139, size: 128, offset: 3072)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !244, file: !245, line: 143, baseType: !139, size: 128, offset: 3200)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !244, file: !245, line: 144, baseType: !139, size: 128, offset: 3328)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !244, file: !245, line: 146, baseType: !104, size: 32, offset: 3456)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !244, file: !245, line: 147, baseType: !104, size: 32, offset: 3488)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !244, file: !245, line: 150, baseType: !364, size: 64, offset: 3520)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!366 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !245, line: 50, flags: DIFlagFwdDecl)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !244, file: !245, line: 151, baseType: !368, size: 64, offset: 3584)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !244, file: !245, line: 152, baseType: !104, size: 32, offset: 3648)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !244, file: !245, line: 153, baseType: !104, size: 32, offset: 3680)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !244, file: !245, line: 156, baseType: !307, size: 96, offset: 3712)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !244, file: !245, line: 156, baseType: !307, size: 96, offset: 3808)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !244, file: !245, line: 156, baseType: !307, size: 96, offset: 3904)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !244, file: !245, line: 157, baseType: !307, size: 96, offset: 4000)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !244, file: !245, line: 158, baseType: !307, size: 96, offset: 4096)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !244, file: !245, line: 159, baseType: !307, size: 96, offset: 4192)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !244, file: !245, line: 160, baseType: !307, size: 96, offset: 4288)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !244, file: !245, line: 160, baseType: !307, size: 96, offset: 4384)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !244, file: !245, line: 161, baseType: !380, size: 128, offset: 4480)
!380 = !DICompositeType(tag: DW_TAG_array_type, baseType: !272, size: 128, elements: !381)
!381 = !{!382}
!382 = !DISubrange(count: 4)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !244, file: !245, line: 161, baseType: !380, size: 128, offset: 4608)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !244, file: !245, line: 162, baseType: !307, size: 96, offset: 4736)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !244, file: !245, line: 162, baseType: !307, size: 96, offset: 4832)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !244, file: !245, line: 163, baseType: !272, size: 32, offset: 4928)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !244, file: !245, line: 163, baseType: !272, size: 32, offset: 4960)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !244, file: !245, line: 164, baseType: !389, size: 512, offset: 4992)
!389 = !DICompositeType(tag: DW_TAG_array_type, baseType: !272, size: 512, elements: !390)
!390 = !{!382, !382}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !244, file: !245, line: 165, baseType: !389, size: 512, offset: 5504)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !244, file: !245, line: 166, baseType: !389, size: 512, offset: 6016)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !244, file: !245, line: 167, baseType: !389, size: 512, offset: 6528)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !244, file: !245, line: 176, baseType: !389, size: 512, offset: 7040)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !244, file: !245, line: 178, baseType: !5, size: 32, offset: 7552)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !244, file: !245, line: 180, baseType: !129, size: 16, offset: 7584)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !244, file: !245, line: 181, baseType: !129, size: 16, offset: 7600)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !244, file: !245, line: 183, baseType: !129, size: 16, offset: 7616)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !244, file: !245, line: 183, baseType: !129, size: 16, offset: 7632)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !244, file: !245, line: 184, baseType: !129, size: 16, offset: 7648)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !244, file: !245, line: 184, baseType: !129, size: 16, offset: 7664)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !244, file: !245, line: 185, baseType: !129, size: 16, offset: 7680)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !244, file: !245, line: 186, baseType: !129, size: 16, offset: 7696)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !244, file: !245, line: 187, baseType: !129, size: 16, offset: 7712)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !244, file: !245, line: 188, baseType: !96, size: 8, offset: 7728)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !244, file: !245, line: 189, baseType: !96, size: 8, offset: 7736)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !244, file: !245, line: 192, baseType: !104, size: 32, offset: 7744)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !244, file: !245, line: 192, baseType: !104, size: 32, offset: 7776)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !244, file: !245, line: 192, baseType: !104, size: 32, offset: 7808)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !244, file: !245, line: 192, baseType: !104, size: 32, offset: 7840)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !244, file: !245, line: 194, baseType: !104, size: 32, offset: 7872)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !244, file: !245, line: 202, baseType: !272, size: 32, offset: 7904)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !244, file: !245, line: 202, baseType: !272, size: 32, offset: 7936)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !244, file: !245, line: 202, baseType: !272, size: 32, offset: 7968)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !244, file: !245, line: 211, baseType: !272, size: 32, offset: 8000)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !244, file: !245, line: 212, baseType: !272, size: 32, offset: 8032)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !244, file: !245, line: 213, baseType: !272, size: 32, offset: 8064)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !244, file: !245, line: 214, baseType: !272, size: 32, offset: 8096)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !244, file: !245, line: 215, baseType: !272, size: 32, offset: 8128)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !244, file: !245, line: 216, baseType: !272, size: 32, offset: 8160)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !244, file: !245, line: 219, baseType: !272, size: 32, offset: 8192)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !244, file: !245, line: 220, baseType: !272, size: 32, offset: 8224)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !244, file: !245, line: 221, baseType: !272, size: 32, offset: 8256)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !244, file: !245, line: 224, baseType: !425, size: 16, offset: 8288)
!425 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !244, file: !245, line: 224, baseType: !425, size: 16, offset: 8304)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !244, file: !245, line: 226, baseType: !129, size: 16, offset: 8320)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !244, file: !245, line: 228, baseType: !96, size: 8, offset: 8336)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !244, file: !245, line: 229, baseType: !96, size: 8, offset: 8344)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !244, file: !245, line: 231, baseType: !129, size: 16, offset: 8352)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !244, file: !245, line: 232, baseType: !96, size: 8, offset: 8368)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !244, file: !245, line: 233, baseType: !96, size: 8, offset: 8376)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !244, file: !245, line: 234, baseType: !272, size: 32, offset: 8384)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !244, file: !245, line: 235, baseType: !272, size: 32, offset: 8416)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !244, file: !245, line: 237, baseType: !139, size: 128, offset: 8448)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !244, file: !245, line: 238, baseType: !139, size: 128, offset: 8576)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !244, file: !245, line: 239, baseType: !139, size: 128, offset: 8704)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !244, file: !245, line: 240, baseType: !139, size: 128, offset: 8832)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !244, file: !245, line: 242, baseType: !272, size: 32, offset: 8960)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !244, file: !245, line: 244, baseType: !129, size: 16, offset: 8992)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !244, file: !245, line: 245, baseType: !425, size: 16, offset: 9008)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !244, file: !245, line: 246, baseType: !380, size: 128, offset: 9024)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !244, file: !245, line: 248, baseType: !104, size: 32, offset: 9152)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !244, file: !245, line: 249, baseType: !104, size: 32, offset: 9184)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !244, file: !245, line: 251, baseType: !446, size: 64, offset: 9216)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!447 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !245, line: 251, flags: DIFlagFwdDecl)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !244, file: !245, line: 253, baseType: !96, size: 8, offset: 9280)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !244, file: !245, line: 254, baseType: !96, size: 8, offset: 9288)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !244, file: !245, line: 255, baseType: !129, size: 16, offset: 9296)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !244, file: !245, line: 256, baseType: !307, size: 96, offset: 9312)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !244, file: !245, line: 258, baseType: !139, size: 128, offset: 9408)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !244, file: !245, line: 259, baseType: !139, size: 128, offset: 9536)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !244, file: !245, line: 260, baseType: !139, size: 128, offset: 9664)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !244, file: !245, line: 261, baseType: !139, size: 128, offset: 9792)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !244, file: !245, line: 263, baseType: !457, size: 64, offset: 9920)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !245, line: 52, flags: DIFlagFwdDecl)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !244, file: !245, line: 264, baseType: !460, size: 64, offset: 9984)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!461 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !245, line: 53, flags: DIFlagFwdDecl)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !244, file: !245, line: 265, baseType: !463, size: 64, offset: 10048)
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64)
!464 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !281, line: 46, flags: DIFlagFwdDecl)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !244, file: !245, line: 267, baseType: !96, size: 8, offset: 10112)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !244, file: !245, line: 268, baseType: !96, size: 8, offset: 10120)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !244, file: !245, line: 269, baseType: !129, size: 16, offset: 10128)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !244, file: !245, line: 270, baseType: !272, size: 32, offset: 10144)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !244, file: !245, line: 272, baseType: !470, size: 64, offset: 10176)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!471 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !245, line: 54, flags: DIFlagFwdDecl)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !244, file: !245, line: 275, baseType: !473, size: 64, offset: 10240)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64)
!474 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !245, line: 275, flags: DIFlagFwdDecl)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !244, file: !245, line: 277, baseType: !476, size: 64, offset: 10304)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64)
!477 = !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !245, line: 56, flags: DIFlagFwdDecl)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !244, file: !245, line: 277, baseType: !476, size: 64, offset: 10368)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !244, file: !245, line: 278, baseType: !480, size: 64, offset: 10432)
!480 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !481, line: 27, baseType: !482)
!481 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !483, line: 45, baseType: !484)
!483 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!484 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_mask", scope: !244, file: !245, line: 279, baseType: !480, size: 64, offset: 10496)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !244, file: !245, line: 280, baseType: !5, size: 32, offset: 10560)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !244, file: !245, line: 281, baseType: !5, size: 32, offset: 10592)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "gpulamp", scope: !244, file: !245, line: 283, baseType: !139, size: 128, offset: 10624)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "pc_ids", scope: !244, file: !245, line: 284, baseType: !139, size: 128, offset: 10752)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "duplilist", scope: !244, file: !245, line: 285, baseType: !491, size: 64, offset: 10880)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_object", scope: !244, file: !245, line: 287, baseType: !493, size: 64, offset: 10944)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64)
!494 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyOb", file: !245, line: 59, flags: DIFlagFwdDecl)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_constraint", scope: !244, file: !245, line: 288, baseType: !496, size: 64, offset: 11008)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64)
!497 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyCon", file: !245, line: 288, flags: DIFlagFwdDecl)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "ima_ofs", scope: !244, file: !245, line: 290, baseType: !499, size: 64, offset: 11072)
!499 = !DICompositeType(tag: DW_TAG_array_type, baseType: !272, size: 64, elements: !500)
!500 = !{!501}
!501 = !DISubrange(count: 2)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !244, file: !245, line: 291, baseType: !503, size: 64, offset: 11136)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64)
!504 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageUser", file: !505, line: 65, baseType: !506)
!505 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!506 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !505, line: 50, size: 320, elements: !507)
!507 = !{!508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !506, file: !505, line: 51, baseType: !233, size: 64)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !506, file: !505, line: 53, baseType: !104, size: 32, offset: 64)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !506, file: !505, line: 54, baseType: !104, size: 32, offset: 96)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !506, file: !505, line: 55, baseType: !104, size: 32, offset: 128)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !506, file: !505, line: 55, baseType: !104, size: 32, offset: 160)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !506, file: !505, line: 56, baseType: !96, size: 8, offset: 192)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "cycl", scope: !506, file: !505, line: 56, baseType: !96, size: 8, offset: 200)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !506, file: !505, line: 57, baseType: !96, size: 8, offset: 208)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !506, file: !505, line: 57, baseType: !96, size: 8, offset: 216)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "multi_index", scope: !506, file: !505, line: 59, baseType: !129, size: 16, offset: 224)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !506, file: !505, line: 59, baseType: !129, size: 16, offset: 240)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !506, file: !505, line: 59, baseType: !129, size: 16, offset: 256)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !506, file: !505, line: 61, baseType: !129, size: 16, offset: 272)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !506, file: !505, line: 63, baseType: !104, size: 32, offset: 288)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "lodlevels", scope: !244, file: !245, line: 293, baseType: !139, size: 128, offset: 11200)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "currentlod", scope: !244, file: !245, line: 294, baseType: !524, size: 64, offset: 11328)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64)
!525 = !DIDerivedType(tag: DW_TAG_typedef, name: "LodLevel", file: !245, line: 113, baseType: !526)
!526 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LodLevel", file: !245, line: 108, size: 256, elements: !527)
!527 = !{!528, !530, !531, !532, !533}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !526, file: !245, line: 109, baseType: !529, size: 64)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !526, file: !245, line: 109, baseType: !529, size: 64, offset: 64)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !526, file: !245, line: 110, baseType: !243, size: 64, offset: 128)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !526, file: !245, line: 111, baseType: !104, size: 32, offset: 192)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "distance", scope: !526, file: !245, line: 112, baseType: !272, size: 32, offset: 224)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !234, file: !235, line: 1221, baseType: !535, size: 64, offset: 1088)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64)
!536 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !235, line: 52, flags: DIFlagFwdDecl)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !234, file: !235, line: 1223, baseType: !233, size: 64, offset: 1152)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !234, file: !235, line: 1225, baseType: !139, size: 128, offset: 1216)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !234, file: !235, line: 1226, baseType: !540, size: 64, offset: 1344)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64)
!541 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !235, line: 69, size: 320, elements: !542)
!542 = !{!543, !544, !545, !546, !547, !548, !549, !550}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !541, file: !235, line: 70, baseType: !540, size: 64)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !541, file: !235, line: 70, baseType: !540, size: 64, offset: 64)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !541, file: !235, line: 71, baseType: !5, size: 32, offset: 128)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !541, file: !235, line: 71, baseType: !5, size: 32, offset: 160)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !541, file: !235, line: 72, baseType: !104, size: 32, offset: 192)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !541, file: !235, line: 73, baseType: !129, size: 16, offset: 224)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !541, file: !235, line: 73, baseType: !129, size: 16, offset: 240)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !541, file: !235, line: 74, baseType: !243, size: 64, offset: 256)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !234, file: !235, line: 1227, baseType: !243, size: 64, offset: 1408)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !234, file: !235, line: 1229, baseType: !307, size: 96, offset: 1472)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !234, file: !235, line: 1230, baseType: !307, size: 96, offset: 1568)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !234, file: !235, line: 1231, baseType: !307, size: 96, offset: 1664)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !234, file: !235, line: 1231, baseType: !307, size: 96, offset: 1760)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !234, file: !235, line: 1233, baseType: !5, size: 32, offset: 1856)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !234, file: !235, line: 1234, baseType: !104, size: 32, offset: 1888)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !234, file: !235, line: 1235, baseType: !5, size: 32, offset: 1920)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !234, file: !235, line: 1237, baseType: !129, size: 16, offset: 1952)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !234, file: !235, line: 1239, baseType: !96, size: 8, offset: 1968)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !234, file: !235, line: 1240, baseType: !562, size: 8, offset: 1976)
!562 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 8, elements: !563)
!563 = !{!564}
!564 = !DISubrange(count: 1)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !234, file: !235, line: 1242, baseType: !566, size: 64, offset: 1984)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64)
!567 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !568, line: 328, size: 3456, elements: !569)
!568 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!569 = !{!570, !571, !572, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !602, !603, !604, !607, !612, !613, !616, !620, !624, !628, !632, !633, !634, !635}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !567, file: !568, line: 329, baseType: !193, size: 960)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !567, file: !568, line: 330, baseType: !239, size: 64, offset: 960)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !567, file: !568, line: 332, baseType: !573, size: 64, offset: 1024)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64)
!574 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !568, line: 332, flags: DIFlagFwdDecl)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !567, file: !568, line: 333, baseType: !114, size: 512, offset: 1088)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "interface_type", scope: !567, file: !568, line: 335, baseType: !162, size: 64, offset: 1600)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !567, file: !568, line: 337, baseType: !338, size: 64, offset: 1664)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "view_center", scope: !567, file: !568, line: 338, baseType: !499, size: 64, offset: 1728)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !567, file: !568, line: 340, baseType: !139, size: 128, offset: 1792)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !567, file: !568, line: 340, baseType: !139, size: 128, offset: 1920)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !567, file: !568, line: 342, baseType: !104, size: 32, offset: 2048)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !567, file: !568, line: 342, baseType: !104, size: 32, offset: 2080)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "cur_index", scope: !567, file: !568, line: 343, baseType: !104, size: 32, offset: 2112)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !567, file: !568, line: 345, baseType: !104, size: 32, offset: 2144)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !567, file: !568, line: 346, baseType: !104, size: 32, offset: 2176)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "is_updating", scope: !567, file: !568, line: 347, baseType: !129, size: 16, offset: 2208)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !567, file: !568, line: 348, baseType: !129, size: 16, offset: 2224)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !567, file: !568, line: 349, baseType: !104, size: 32, offset: 2240)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "nodetype", scope: !567, file: !568, line: 351, baseType: !104, size: 32, offset: 2272)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "edit_quality", scope: !567, file: !568, line: 353, baseType: !129, size: 16, offset: 2304)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "render_quality", scope: !567, file: !568, line: 354, baseType: !129, size: 16, offset: 2320)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "chunksize", scope: !567, file: !568, line: 355, baseType: !104, size: 32, offset: 2336)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "viewer_border", scope: !567, file: !568, line: 357, baseType: !594, size: 128, offset: 2368)
!594 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !595, line: 95, baseType: !596)
!595 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!596 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !595, line: 92, size: 128, elements: !597)
!597 = !{!598, !599, !600, !601}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !596, file: !595, line: 93, baseType: !272, size: 32)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !596, file: !595, line: 93, baseType: !272, size: 32, offset: 32)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !596, file: !595, line: 94, baseType: !272, size: 32, offset: 64)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !596, file: !595, line: 94, baseType: !272, size: 32, offset: 96)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !567, file: !568, line: 363, baseType: !139, size: 128, offset: 2496)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !567, file: !568, line: 363, baseType: !139, size: 128, offset: 2624)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "previews", scope: !567, file: !568, line: 368, baseType: !605, size: 64, offset: 2752)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!606 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHash", file: !568, line: 48, flags: DIFlagFwdDecl)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "active_viewer_key", scope: !567, file: !568, line: 372, baseType: !608, size: 32, offset: 2816)
!608 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !568, line: 274, baseType: !609)
!609 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !568, line: 271, size: 32, elements: !610)
!610 = !{!611}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !609, file: !568, line: 273, baseType: !5, size: 32)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !567, file: !568, line: 373, baseType: !104, size: 32, offset: 2848)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "execdata", scope: !567, file: !568, line: 382, baseType: !614, size: 64, offset: 2880)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!615 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeExec", file: !568, line: 46, flags: DIFlagFwdDecl)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !567, file: !568, line: 385, baseType: !617, size: 64, offset: 2944)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64)
!618 = !DISubroutineType(types: !619)
!619 = !{null, !137, !272}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "stats_draw", scope: !567, file: !568, line: 386, baseType: !621, size: 64, offset: 3008)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 64)
!622 = !DISubroutineType(types: !623)
!623 = !{null, !137, !368}
!624 = !DIDerivedType(tag: DW_TAG_member, name: "test_break", scope: !567, file: !568, line: 387, baseType: !625, size: 64, offset: 3072)
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 64)
!626 = !DISubroutineType(types: !627)
!627 = !{!104, !137}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "update_draw", scope: !567, file: !568, line: 388, baseType: !629, size: 64, offset: 3136)
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 64)
!630 = !DISubroutineType(types: !631)
!631 = !{null, !137}
!632 = !DIDerivedType(tag: DW_TAG_member, name: "tbh", scope: !567, file: !568, line: 389, baseType: !137, size: 64, offset: 3200)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "prh", scope: !567, file: !568, line: 389, baseType: !137, size: 64, offset: 3264)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "sdh", scope: !567, file: !568, line: 389, baseType: !137, size: 64, offset: 3328)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "udh", scope: !567, file: !568, line: 389, baseType: !137, size: 64, offset: 3392)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !234, file: !235, line: 1244, baseType: !637, size: 64, offset: 2048)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 64)
!638 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !639, line: 200, size: 17024, elements: !640)
!639 = !DIFile(filename: "blender/source/blender/makesdna/DNA_sequence_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!640 = !{!641, !642, !643, !644, !1057, !1058, !1059, !1060, !1061, !1062, !1063}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "seqbasep", scope: !638, file: !639, line: 201, baseType: !491, size: 64)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !638, file: !639, line: 202, baseType: !139, size: 128, offset: 64)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "metastack", scope: !638, file: !639, line: 203, baseType: !139, size: 128, offset: 192)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "act_seq", scope: !638, file: !639, line: 206, baseType: !645, size: 64, offset: 320)
!645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !646, size: 64)
!646 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sequence", file: !639, line: 190, baseType: !647)
!647 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sequence", file: !639, line: 126, size: 2816, elements: !648)
!648 = !{!649, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !747, !748, !749, !750, !1028, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1056}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !647, file: !639, line: 127, baseType: !650, size: 64)
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !647, file: !639, line: 127, baseType: !650, size: 64, offset: 64)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !647, file: !639, line: 128, baseType: !137, size: 64, offset: 128)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !647, file: !639, line: 129, baseType: !137, size: 64, offset: 192)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !647, file: !639, line: 130, baseType: !114, size: 512, offset: 256)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !647, file: !639, line: 132, baseType: !104, size: 32, offset: 768)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !647, file: !639, line: 132, baseType: !104, size: 32, offset: 800)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !647, file: !639, line: 133, baseType: !104, size: 32, offset: 832)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !647, file: !639, line: 134, baseType: !104, size: 32, offset: 864)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "startofs", scope: !647, file: !639, line: 134, baseType: !104, size: 32, offset: 896)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "endofs", scope: !647, file: !639, line: 134, baseType: !104, size: 32, offset: 928)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !647, file: !639, line: 135, baseType: !104, size: 32, offset: 960)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !647, file: !639, line: 135, baseType: !104, size: 32, offset: 992)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !647, file: !639, line: 136, baseType: !104, size: 32, offset: 1024)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !647, file: !639, line: 136, baseType: !104, size: 32, offset: 1056)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "startdisp", scope: !647, file: !639, line: 137, baseType: !104, size: 32, offset: 1088)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "enddisp", scope: !647, file: !639, line: 137, baseType: !104, size: 32, offset: 1120)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "sat", scope: !647, file: !639, line: 138, baseType: !272, size: 32, offset: 1152)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "mul", scope: !647, file: !639, line: 139, baseType: !272, size: 32, offset: 1184)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "handsize", scope: !647, file: !639, line: 139, baseType: !272, size: 32, offset: 1216)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "anim_preseek", scope: !647, file: !639, line: 141, baseType: !129, size: 16, offset: 1248)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "streamindex", scope: !647, file: !639, line: 142, baseType: !129, size: 16, offset: 1264)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "multicam_source", scope: !647, file: !639, line: 143, baseType: !104, size: 32, offset: 1280)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "clip_flag", scope: !647, file: !639, line: 144, baseType: !104, size: 32, offset: 1312)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "strip", scope: !647, file: !639, line: 146, baseType: !675, size: 64, offset: 1344)
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !676, size: 64)
!676 = !DIDerivedType(tag: DW_TAG_typedef, name: "Strip", file: !639, line: 114, baseType: !677)
!677 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Strip", file: !639, line: 99, size: 7232, elements: !678)
!678 = !{!679, !681, !682, !683, !684, !685, !686, !697, !701, !715, !724, !731, !741}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !677, file: !639, line: 100, baseType: !680, size: 64)
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 64)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !677, file: !639, line: 100, baseType: !680, size: 64, offset: 64)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !677, file: !639, line: 101, baseType: !104, size: 32, offset: 128)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !677, file: !639, line: 101, baseType: !104, size: 32, offset: 160)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !677, file: !639, line: 102, baseType: !104, size: 32, offset: 192)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !677, file: !639, line: 102, baseType: !104, size: 32, offset: 224)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "stripdata", scope: !677, file: !639, line: 103, baseType: !687, size: 64, offset: 256)
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 64)
!688 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripElem", file: !639, line: 59, baseType: !689)
!689 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripElem", file: !639, line: 56, size: 2112, elements: !690)
!690 = !{!691, !695, !696}
!691 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !689, file: !639, line: 57, baseType: !692, size: 2048)
!692 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 2048, elements: !693)
!693 = !{!694}
!694 = !DISubrange(count: 256)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "orig_width", scope: !689, file: !639, line: 58, baseType: !104, size: 32, offset: 2048)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "orig_height", scope: !689, file: !639, line: 58, baseType: !104, size: 32, offset: 2080)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !677, file: !639, line: 106, baseType: !698, size: 6144, offset: 320)
!698 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 6144, elements: !699)
!699 = !{!700}
!700 = !DISubrange(count: 768)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !677, file: !639, line: 107, baseType: !702, size: 64, offset: 6464)
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !703, size: 64)
!703 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripProxy", file: !639, line: 97, baseType: !704)
!704 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripProxy", file: !639, line: 83, size: 8320, elements: !705)
!705 = !{!706, !707, !708, !711, !712, !713, !714}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !704, file: !639, line: 84, baseType: !698, size: 6144)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !704, file: !639, line: 87, baseType: !692, size: 2048, offset: 6144)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !704, file: !639, line: 88, baseType: !709, size: 64, offset: 8192)
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 64)
!710 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !505, line: 41, flags: DIFlagFwdDecl)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !704, file: !639, line: 90, baseType: !129, size: 16, offset: 8256)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !704, file: !639, line: 92, baseType: !129, size: 16, offset: 8272)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flags", scope: !704, file: !639, line: 93, baseType: !129, size: 16, offset: 8288)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flags", scope: !704, file: !639, line: 95, baseType: !129, size: 16, offset: 8304)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !677, file: !639, line: 108, baseType: !716, size: 64, offset: 6528)
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 64)
!717 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripCrop", file: !639, line: 66, baseType: !718)
!718 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripCrop", file: !639, line: 61, size: 128, elements: !719)
!719 = !{!720, !721, !722, !723}
!720 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !718, file: !639, line: 62, baseType: !104, size: 32)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !718, file: !639, line: 63, baseType: !104, size: 32, offset: 32)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !718, file: !639, line: 64, baseType: !104, size: 32, offset: 64)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !718, file: !639, line: 65, baseType: !104, size: 32, offset: 96)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !677, file: !639, line: 109, baseType: !725, size: 64, offset: 6592)
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !726, size: 64)
!726 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripTransform", file: !639, line: 71, baseType: !727)
!727 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripTransform", file: !639, line: 68, size: 64, elements: !728)
!728 = !{!729, !730}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "xofs", scope: !727, file: !639, line: 69, baseType: !104, size: 32)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "yofs", scope: !727, file: !639, line: 70, baseType: !104, size: 32, offset: 32)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "color_balance", scope: !677, file: !639, line: 110, baseType: !732, size: 64, offset: 6656)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 64)
!733 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripColorBalance", file: !639, line: 81, baseType: !734)
!734 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripColorBalance", file: !639, line: 73, size: 352, elements: !735)
!735 = !{!736, !737, !738, !739, !740}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "lift", scope: !734, file: !639, line: 74, baseType: !307, size: 96)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !734, file: !639, line: 75, baseType: !307, size: 96, offset: 96)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "gain", scope: !734, file: !639, line: 76, baseType: !307, size: 96, offset: 192)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !734, file: !639, line: 77, baseType: !104, size: 32, offset: 288)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !734, file: !639, line: 78, baseType: !104, size: 32, offset: 320)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !677, file: !639, line: 113, baseType: !742, size: 512, offset: 6720)
!742 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !743, line: 182, baseType: !744)
!743 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!744 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !743, line: 180, size: 512, elements: !745)
!745 = !{!746}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !744, file: !743, line: 181, baseType: !114, size: 512)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !647, file: !639, line: 148, baseType: !264, size: 64, offset: 1408)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !647, file: !639, line: 151, baseType: !233, size: 64, offset: 1472)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "scene_camera", scope: !647, file: !639, line: 152, baseType: !243, size: 64, offset: 1536)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "clip", scope: !647, file: !639, line: 153, baseType: !751, size: 64, offset: 1600)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64)
!752 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClip", file: !753, line: 64, size: 19136, elements: !754)
!753 = !DIFile(filename: "blender/source/blender/makesdna/DNA_movieclip_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!754 = !{!755, !756, !757, !758, !759, !760, !762, !763, !764, !765, !768, !769, !1014, !1015, !1023, !1024, !1025, !1026, !1027}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !752, file: !753, line: 65, baseType: !193, size: 960)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !752, file: !753, line: 66, baseType: !239, size: 64, offset: 960)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !752, file: !753, line: 68, baseType: !211, size: 8192, offset: 1024)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !752, file: !753, line: 70, baseType: !104, size: 32, offset: 9216)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !752, file: !753, line: 71, baseType: !104, size: 32, offset: 9248)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "lastsize", scope: !752, file: !753, line: 72, baseType: !761, size: 64, offset: 9280)
!761 = !DICompositeType(tag: DW_TAG_array_type, baseType: !104, size: 64, elements: !500)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !752, file: !753, line: 74, baseType: !272, size: 32, offset: 9344)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !752, file: !753, line: 74, baseType: !272, size: 32, offset: 9376)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !752, file: !753, line: 76, baseType: !709, size: 64, offset: 9408)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !752, file: !753, line: 77, baseType: !766, size: 64, offset: 9472)
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64)
!767 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipCache", file: !753, line: 77, flags: DIFlagFwdDecl)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !752, file: !753, line: 78, baseType: !338, size: 64, offset: 9536)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "tracking", scope: !752, file: !753, line: 80, baseType: !770, size: 2624, offset: 9600)
!770 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTracking", file: !771, line: 340, size: 2624, elements: !772)
!771 = !DIFile(filename: "blender/source/blender/makesdna/DNA_tracking_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!772 = !{!773, !801, !819, !820, !821, !836, !894, !895, !994, !995, !996, !997, !1003}
!773 = !DIDerivedType(tag: DW_TAG_member, name: "settings", scope: !770, file: !771, line: 341, baseType: !774, size: 576)
!774 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingSettings", file: !771, line: 251, baseType: !775)
!775 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingSettings", file: !771, line: 207, size: 576, elements: !776)
!776 = !{!777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800}
!777 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !775, file: !771, line: 208, baseType: !104, size: 32)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "default_motion_model", scope: !775, file: !771, line: 211, baseType: !129, size: 16, offset: 32)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "default_algorithm_flag", scope: !775, file: !771, line: 212, baseType: !129, size: 16, offset: 48)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "default_minimum_correlation", scope: !775, file: !771, line: 213, baseType: !272, size: 32, offset: 64)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_size", scope: !775, file: !771, line: 214, baseType: !129, size: 16, offset: 96)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "default_search_size", scope: !775, file: !771, line: 215, baseType: !129, size: 16, offset: 112)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "default_frames_limit", scope: !775, file: !771, line: 216, baseType: !129, size: 16, offset: 128)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "default_margin", scope: !775, file: !771, line: 217, baseType: !129, size: 16, offset: 144)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_match", scope: !775, file: !771, line: 218, baseType: !129, size: 16, offset: 160)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "default_flag", scope: !775, file: !771, line: 219, baseType: !129, size: 16, offset: 176)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "default_weight", scope: !775, file: !771, line: 220, baseType: !272, size: 32, offset: 192)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "motion_flag", scope: !775, file: !771, line: 222, baseType: !129, size: 16, offset: 224)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "speed", scope: !775, file: !771, line: 225, baseType: !129, size: 16, offset: 240)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe1", scope: !775, file: !771, line: 228, baseType: !104, size: 32, offset: 256)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe2", scope: !775, file: !771, line: 229, baseType: !104, size: 32, offset: 288)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction_flag", scope: !775, file: !771, line: 233, baseType: !104, size: 32, offset: 320)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "refine_camera_intrinsics", scope: !775, file: !771, line: 236, baseType: !129, size: 16, offset: 352)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !775, file: !771, line: 236, baseType: !129, size: 16, offset: 368)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !775, file: !771, line: 241, baseType: !272, size: 32, offset: 384)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "clean_frames", scope: !775, file: !771, line: 244, baseType: !104, size: 32, offset: 416)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "clean_action", scope: !775, file: !771, line: 244, baseType: !104, size: 32, offset: 448)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "clean_error", scope: !775, file: !771, line: 245, baseType: !272, size: 32, offset: 480)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "object_distance", scope: !775, file: !771, line: 248, baseType: !272, size: 32, offset: 512)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !775, file: !771, line: 250, baseType: !104, size: 32, offset: 544)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !770, file: !771, line: 342, baseType: !802, size: 448, offset: 576)
!802 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingCamera", file: !771, line: 79, baseType: !803)
!803 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingCamera", file: !771, line: 61, size: 448, elements: !804)
!804 = !{!805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "intrinsics", scope: !803, file: !771, line: 62, baseType: !137, size: 64)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_model", scope: !803, file: !771, line: 64, baseType: !129, size: 16, offset: 64)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !803, file: !771, line: 65, baseType: !129, size: 16, offset: 80)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "sensor_width", scope: !803, file: !771, line: 67, baseType: !272, size: 32, offset: 96)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_aspect", scope: !803, file: !771, line: 68, baseType: !272, size: 32, offset: 128)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "focal", scope: !803, file: !771, line: 69, baseType: !272, size: 32, offset: 160)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !803, file: !771, line: 70, baseType: !129, size: 16, offset: 192)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !803, file: !771, line: 71, baseType: !129, size: 16, offset: 208)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "principal", scope: !803, file: !771, line: 72, baseType: !499, size: 64, offset: 224)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "k1", scope: !803, file: !771, line: 75, baseType: !272, size: 32, offset: 288)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "k2", scope: !803, file: !771, line: 75, baseType: !272, size: 32, offset: 320)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "k3", scope: !803, file: !771, line: 75, baseType: !272, size: 32, offset: 352)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "division_k1", scope: !803, file: !771, line: 78, baseType: !272, size: 32, offset: 384)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "division_k2", scope: !803, file: !771, line: 78, baseType: !272, size: 32, offset: 416)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "tracks", scope: !770, file: !771, line: 343, baseType: !139, size: 128, offset: 1024)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "plane_tracks", scope: !770, file: !771, line: 344, baseType: !139, size: 128, offset: 1152)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction", scope: !770, file: !771, line: 345, baseType: !822, size: 192, offset: 1280)
!822 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingReconstruction", file: !771, line: 278, baseType: !823)
!823 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingReconstruction", file: !771, line: 270, size: 192, elements: !824)
!824 = !{!825, !826, !827, !828, !829}
!825 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !823, file: !771, line: 271, baseType: !104, size: 32)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !823, file: !771, line: 273, baseType: !272, size: 32, offset: 32)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "last_camera", scope: !823, file: !771, line: 275, baseType: !104, size: 32, offset: 64)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "camnr", scope: !823, file: !771, line: 276, baseType: !104, size: 32, offset: 96)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "cameras", scope: !823, file: !771, line: 277, baseType: !830, size: 64, offset: 128)
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !831, size: 64)
!831 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieReconstructedCamera", file: !771, line: 55, size: 576, elements: !832)
!832 = !{!833, !834, !835}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !831, file: !771, line: 56, baseType: !104, size: 32)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !831, file: !771, line: 57, baseType: !272, size: 32, offset: 32)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !831, file: !771, line: 58, baseType: !389, size: 512, offset: 64)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "stabilization", scope: !770, file: !771, line: 346, baseType: !837, size: 384, offset: 1472)
!837 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStabilization", file: !771, line: 268, baseType: !838)
!838 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStabilization", file: !771, line: 253, size: 384, elements: !839)
!839 = !{!840, !841, !842, !843, !844, !888, !889, !890, !891, !892, !893}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !838, file: !771, line: 254, baseType: !104, size: 32)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "tot_track", scope: !838, file: !771, line: 255, baseType: !104, size: 32, offset: 32)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !838, file: !771, line: 255, baseType: !104, size: 32, offset: 64)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "maxscale", scope: !838, file: !771, line: 258, baseType: !272, size: 32, offset: 96)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "rot_track", scope: !838, file: !771, line: 259, baseType: !845, size: 64, offset: 128)
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !846, size: 64)
!846 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingTrack", file: !771, line: 164, baseType: !847)
!847 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingTrack", file: !771, line: 108, size: 1664, elements: !848)
!848 = !{!849, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !847, file: !771, line: 109, baseType: !850, size: 64)
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 64)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !847, file: !771, line: 109, baseType: !850, size: 64, offset: 64)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !847, file: !771, line: 111, baseType: !114, size: 512, offset: 128)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "pat_min", scope: !847, file: !771, line: 119, baseType: !499, size: 64, offset: 640)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "pat_max", scope: !847, file: !771, line: 119, baseType: !499, size: 64, offset: 704)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !847, file: !771, line: 125, baseType: !499, size: 64, offset: 768)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !847, file: !771, line: 125, baseType: !499, size: 64, offset: 832)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !847, file: !771, line: 127, baseType: !499, size: 64, offset: 896)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !847, file: !771, line: 130, baseType: !104, size: 32, offset: 960)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !847, file: !771, line: 131, baseType: !104, size: 32, offset: 992)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !847, file: !771, line: 132, baseType: !861, size: 64, offset: 1024)
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !862, size: 64)
!862 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingMarker", file: !771, line: 106, baseType: !863)
!863 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingMarker", file: !771, line: 81, size: 512, elements: !864)
!864 = !{!865, !866, !869, !870, !871, !872}
!865 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !863, file: !771, line: 82, baseType: !499, size: 64)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_corners", scope: !863, file: !771, line: 97, baseType: !867, size: 256, offset: 64)
!867 = !DICompositeType(tag: DW_TAG_array_type, baseType: !272, size: 256, elements: !868)
!868 = !{!382, !501}
