; ModuleID = 'blender/source/blender/bmesh/tools/bmesh_path.c'
source_filename = "blender/source/blender/bmesh/tools/bmesh_path.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.LinkNode = type { %struct.LinkNode*, i8* }
%struct.BMesh = type { i32, i32, i32, i32, i32, i32, i32, i8, i8, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BMVert**, %struct.BMEdge**, %struct.BMFace**, i32, i32, i32, %struct.BLI_mempool*, %struct.BLI_mempool*, %struct.BLI_mempool*, i32, %struct.BMOperator*, %struct.CustomData, %struct.CustomData, %struct.CustomData, %struct.CustomData, i16, i32, i32, i32, %struct.ListBase, %struct.BMFace*, %struct.ListBase, i8* }
%struct.BMEdge = type { %struct.BMHeader, %struct.BMFlagLayer*, %struct.BMVert*, %struct.BMVert*, %struct.BMLoop*, %struct.BMDiskLink, %struct.BMDiskLink }
%struct.BMHeader = type { i8*, i32, i8, i8, i8 }
%struct.BMFlagLayer = type { i16 }
%struct.BMLoop = type { %struct.BMHeader, %struct.BMVert*, %struct.BMEdge*, %struct.BMFace*, %struct.BMLoop*, %struct.BMLoop*, %struct.BMLoop*, %struct.BMLoop* }
%struct.BMDiskLink = type { %struct.BMEdge*, %struct.BMEdge* }
%struct.BLI_mempool = type opaque
%struct.BMOperator = type { [16 x %struct.BMOpSlot], [16 x %struct.BMOpSlot], void (%struct.BMesh*, %struct.BMOperator*)*, %struct.MemArena*, i32, i32, i32 }

!21 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eBMOpSlotSubType_Ptr", file: !4, line: 131, baseType: !5, size: 32, elements: !22)
!22 = !{!23, !24, !25, !26}
!23 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_PTR_BMESH", value: 100, isUnsigned: true)
!24 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_PTR_SCENE", value: 101, isUnsigned: true)
!25 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_PTR_OBJECT", value: 102, isUnsigned: true)
!26 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_PTR_MESH", value: 103, isUnsigned: true)
!27 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eBMOpSlotSubType_Map", file: !4, line: 123, baseType: !5, size: 32, elements: !28)
!28 = !{!29, !30, !31, !32, !33, !34}
!29 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_EMPTY", value: 64, isUnsigned: true)
!30 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_ELEM", value: 65, isUnsigned: true)
!31 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_FLT", value: 66, isUnsigned: true)
!32 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_INT", value: 67, isUnsigned: true)
!33 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_BOOL", value: 68, isUnsigned: true)
!34 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_INTERNAL", value: 69, isUnsigned: true)
!35 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 182, baseType: !5, size: 32, elements: !36)
!36 = !{!37, !38, !39, !40, !41}
!37 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_NOP", value: 0, isUnsigned: true)
!38 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_UNTAN_MULTIRES", value: 1, isUnsigned: true)
!39 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_NORMALS_CALC", value: 2, isUnsigned: true)
!40 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_SELECT_FLUSH", value: 4, isUnsigned: true)
!41 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_SELECT_VALIDATE", value: 8, isUnsigned: true)
!42 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "BMIterType", file: !43, line: 57, baseType: !5, size: 32, elements: !44)
!43 = !DIFile(filename: "blender/source/blender/bmesh/intern/bmesh_iterators.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!44 = !{!45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58}
!45 = !DIEnumerator(name: "BM_VERTS_OF_MESH", value: 1, isUnsigned: true)
!46 = !DIEnumerator(name: "BM_EDGES_OF_MESH", value: 2, isUnsigned: true)
!47 = !DIEnumerator(name: "BM_FACES_OF_MESH", value: 3, isUnsigned: true)
!48 = !DIEnumerator(name: "BM_EDGES_OF_VERT", value: 4, isUnsigned: true)
!49 = !DIEnumerator(name: "BM_FACES_OF_VERT", value: 5, isUnsigned: true)
!50 = !DIEnumerator(name: "BM_LOOPS_OF_VERT", value: 6, isUnsigned: true)
!51 = !DIEnumerator(name: "BM_VERTS_OF_EDGE", value: 7, isUnsigned: true)
!52 = !DIEnumerator(name: "BM_FACES_OF_EDGE", value: 8, isUnsigned: true)
!53 = !DIEnumerator(name: "BM_VERTS_OF_FACE", value: 9, isUnsigned: true)
!54 = !DIEnumerator(name: "BM_EDGES_OF_FACE", value: 10, isUnsigned: true)
!55 = !DIEnumerator(name: "BM_LOOPS_OF_FACE", value: 11, isUnsigned: true)
!56 = !DIEnumerator(name: "BM_ALL_LOOPS_OF_FACE", value: 12, isUnsigned: true)
!57 = !DIEnumerator(name: "BM_LOOPS_OF_LOOP", value: 13, isUnsigned: true)
!58 = !DIEnumerator(name: "BM_LOOPS_OF_EDGE", value: 14, isUnsigned: true)
!59 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !60, line: 260, baseType: !5, size: 32, elements: !61)
!60 = !DIFile(filename: "blender/source/blender/bmesh/bmesh_class.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!61 = !{!62, !63, !64, !65, !66, !67, !68}
!62 = !DIEnumerator(name: "BM_ELEM_SELECT", value: 1, isUnsigned: true)
!63 = !DIEnumerator(name: "BM_ELEM_HIDDEN", value: 2, isUnsigned: true)
!64 = !DIEnumerator(name: "BM_ELEM_SEAM", value: 4, isUnsigned: true)
!65 = !DIEnumerator(name: "BM_ELEM_SMOOTH", value: 8, isUnsigned: true)
!66 = !DIEnumerator(name: "BM_ELEM_TAG", value: 16, isUnsigned: true)
!67 = !DIEnumerator(name: "BM_ELEM_DRAW", value: 32, isUnsigned: true)
!68 = !DIEnumerator(name: "BM_ELEM_INTERNAL_TAG", value: 128, isUnsigned: true)
!69 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !60, line: 249, baseType: !5, size: 32, elements: !70)
!70 = !{!71, !72, !73, !74}
!71 = !DIEnumerator(name: "BM_VERT", value: 1, isUnsigned: true)
!72 = !DIEnumerator(name: "BM_EDGE", value: 2, isUnsigned: true)
!73 = !DIEnumerator(name: "BM_LOOP", value: 4, isUnsigned: true)
!74 = !DIEnumerator(name: "BM_FACE", value: 8, isUnsigned: true)
!75 = !{!76, !77, !78, !82, !86, !152, !154, !136, !98}
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIterType", file: !43, line: 79, baseType: !42)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter__begin_cb", file: !43, line: 158, baseType: !79)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = !DISubroutineType(types: !81)
!81 = !{null, !76}
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter__step_cb", file: !43, line: 159, baseType: !83)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = !DISubroutineType(types: !85)
!85 = !{!76, !76}
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMVert", file: !60, line: 103, baseType: !88)
!88 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMVert", file: !60, line: 90, size: 448, elements: !89)
!89 = !{!90, !101, !107, !112, !113}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !88, file: !60, line: 91, baseType: !91, size: 128)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMHeader", file: !60, line: 82, baseType: !92)
!92 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMHeader", file: !60, line: 64, size: 128, elements: !93)
!93 = !{!94, !95, !97, !99, !100}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !92, file: !60, line: 65, baseType: !76, size: 64)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !92, file: !60, line: 66, baseType: !96, size: 32, offset: 64)
!96 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !92, file: !60, line: 73, baseType: !98, size: 8, offset: 96)
!98 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "hflag", scope: !92, file: !60, line: 74, baseType: !98, size: 8, offset: 104)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "api_flag", scope: !92, file: !60, line: 80, baseType: !98, size: 8, offset: 112)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !88, file: !60, line: 92, baseType: !102, size: 64, offset: 128)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFlagLayer", file: !60, line: 180, size: 16, elements: !104)
!104 = !{!105}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !103, file: !60, line: 181, baseType: !106, size: 16)
!106 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !88, file: !60, line: 94, baseType: !108, size: 96, offset: 192)
!108 = !DICompositeType(tag: DW_TAG_array_type, baseType: !109, size: 96, elements: !110)
!109 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!110 = !{!111}
!111 = !DISubrange(count: 3)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !88, file: !60, line: 95, baseType: !108, size: 96, offset: 288)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !88, file: !60, line: 102, baseType: !114, size: 64, offset: 384)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMEdge", file: !60, line: 110, size: 640, elements: !116)
!116 = !{!117, !118, !119, !121, !122, !145, !151}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !115, file: !60, line: 111, baseType: !91, size: 128)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !115, file: !60, line: 112, baseType: !102, size: 64, offset: 128)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !115, file: !60, line: 114, baseType: !120, size: 64, offset: 192)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !115, file: !60, line: 114, baseType: !120, size: 64, offset: 256)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !115, file: !60, line: 118, baseType: !123, size: 64, offset: 320)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMLoop", file: !60, line: 125, size: 576, elements: !125)
!125 = !{!126, !127, !128, !129, !141, !142, !143, !144}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !124, file: !60, line: 126, baseType: !91, size: 128)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !124, file: !60, line: 129, baseType: !120, size: 64, offset: 128)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !124, file: !60, line: 130, baseType: !114, size: 64, offset: 192)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !124, file: !60, line: 131, baseType: !130, size: 64, offset: 256)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFace", file: !60, line: 164, size: 448, elements: !132)
!132 = !{!133, !134, !135, !138, !139, !140}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !131, file: !60, line: 165, baseType: !91, size: 128)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !131, file: !60, line: 166, baseType: !102, size: 64, offset: 128)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !131, file: !60, line: 172, baseType: !136, size: 64, offset: 192)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMLoop", file: !60, line: 140, baseType: !124)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !131, file: !60, line: 174, baseType: !96, size: 32, offset: 256)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !131, file: !60, line: 175, baseType: !108, size: 96, offset: 288)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !131, file: !60, line: 176, baseType: !106, size: 16, offset: 384)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "radial_next", scope: !124, file: !60, line: 135, baseType: !123, size: 64, offset: 320)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "radial_prev", scope: !124, file: !60, line: 135, baseType: !123, size: 64, offset: 384)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !124, file: !60, line: 139, baseType: !123, size: 64, offset: 448)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !124, file: !60, line: 139, baseType: !123, size: 64, offset: 512)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "v1_disk_link", scope: !115, file: !60, line: 122, baseType: !146, size: 128, offset: 384)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMDiskLink", file: !60, line: 108, baseType: !147)
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMDiskLink", file: !60, line: 106, size: 128, elements: !148)
!148 = !{!149, !150}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !147, file: !60, line: 107, baseType: !114, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !147, file: !60, line: 107, baseType: !114, size: 64, offset: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "v2_disk_link", scope: !115, file: !60, line: 122, baseType: !146, size: 128, offset: 512)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMEdge", file: !60, line: 123, baseType: !115)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMFace", file: !60, line: 178, baseType: !131)
!156 = !{i32 7, !"Dwarf Version", i32 4}
!157 = !{i32 2, !"Debug Info Version", i32 3}
!158 = !{i32 1, !"wchar_size", i32 4}
!159 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!160 = distinct !DISubprogram(name: "BM_mesh_calc_path_vert", scope: !1, file: !1, line: 96, type: !161, scopeLine: 99, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !315)
!161 = !DISubroutineType(types: !162)
!162 = !{!163, !169, !86, !86, !310, !76, !312}
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LinkNode", file: !165, line: 45, size: 128, elements: !166)
!165 = !DIFile(filename: "blender/source/blender/blenlib/BLI_linklist.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!166 = !{!167, !168}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !164, file: !165, line: 46, baseType: !163, size: 64)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !164, file: !165, line: 47, baseType: !76, size: 64, offset: 64)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMesh", file: !60, line: 246, baseType: !171)
!171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMesh", file: !60, line: 186, size: 8064, elements: !172)
!172 = !{!173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !185, !186, !187, !188, !190, !192, !194, !195, !196, !197, !198, !199, !200, !201, !253, !293, !294, !295, !296, !297, !298, !299, !300, !307, !308, !309}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "totvert", scope: !171, file: !60, line: 187, baseType: !96, size: 32)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "totedge", scope: !171, file: !60, line: 187, baseType: !96, size: 32, offset: 32)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !171, file: !60, line: 187, baseType: !96, size: 32, offset: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "totface", scope: !171, file: !60, line: 187, baseType: !96, size: 32, offset: 96)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "totvertsel", scope: !171, file: !60, line: 188, baseType: !96, size: 32, offset: 128)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "totedgesel", scope: !171, file: !60, line: 188, baseType: !96, size: 32, offset: 160)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "totfacesel", scope: !171, file: !60, line: 188, baseType: !96, size: 32, offset: 192)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "elem_index_dirty", scope: !171, file: !60, line: 193, baseType: !98, size: 8, offset: 224)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "elem_table_dirty", scope: !171, file: !60, line: 197, baseType: !98, size: 8, offset: 232)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "vpool", scope: !171, file: !60, line: 201, baseType: !183, size: 64, offset: 256)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool", file: !165, line: 39, flags: DIFlagFwdDecl)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "epool", scope: !171, file: !60, line: 201, baseType: !183, size: 64, offset: 320)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "lpool", scope: !171, file: !60, line: 201, baseType: !183, size: 64, offset: 384)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "fpool", scope: !171, file: !60, line: 201, baseType: !183, size: 64, offset: 448)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !171, file: !60, line: 208, baseType: !189, size: 64, offset: 512)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "etable", scope: !171, file: !60, line: 209, baseType: !191, size: 64, offset: 576)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "ftable", scope: !171, file: !60, line: 210, baseType: !193, size: 64, offset: 640)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "vtable_tot", scope: !171, file: !60, line: 213, baseType: !96, size: 32, offset: 704)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "etable_tot", scope: !171, file: !60, line: 214, baseType: !96, size: 32, offset: 736)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "ftable_tot", scope: !171, file: !60, line: 215, baseType: !96, size: 32, offset: 768)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "vtoolflagpool", scope: !171, file: !60, line: 218, baseType: !183, size: 64, offset: 832)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "etoolflagpool", scope: !171, file: !60, line: 218, baseType: !183, size: 64, offset: 896)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "ftoolflagpool", scope: !171, file: !60, line: 218, baseType: !183, size: 64, offset: 960)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "stackdepth", scope: !171, file: !60, line: 220, baseType: !96, size: 32, offset: 1024)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "currentop", scope: !171, file: !60, line: 221, baseType: !202, size: 64, offset: 1088)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOperator", file: !4, line: 190, size: 10496, elements: !204)
!204 = !{!205, !241, !242, !246, !249, !250, !252}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "slots_in", scope: !203, file: !4, line: 191, baseType: !206, size: 5120)
!206 = !DICompositeType(tag: DW_TAG_array_type, baseType: !207, size: 5120, elements: !239)
!207 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOpSlot", file: !4, line: 147, size: 320, elements: !208)
!208 = !{!209, !212, !214, !224, !225}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "slot_name", scope: !207, file: !4, line: 148, baseType: !210, size: 64)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!211 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !98)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "slot_type", scope: !207, file: !4, line: 149, baseType: !213, size: 32, offset: 64)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotType", file: !4, line: 112, baseType: !3)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "slot_subtype", scope: !207, file: !4, line: 150, baseType: !215, size: 32, offset: 96)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Union", file: !4, line: 142, baseType: !216)
!216 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eBMOpSlotSubType_Union", file: !4, line: 138, size: 32, elements: !217)
!217 = !{!218, !220, !222}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !216, file: !4, line: 139, baseType: !219, size: 32)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Elem", file: !4, line: 122, baseType: !15)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !216, file: !4, line: 140, baseType: !221, size: 32)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Ptr", file: !4, line: 136, baseType: !21)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !216, file: !4, line: 141, baseType: !223, size: 32)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Map", file: !4, line: 130, baseType: !27)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !207, file: !4, line: 152, baseType: !96, size: 32, offset: 128)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !207, file: !4, line: 162, baseType: !226, size: 128, offset: 192)
!226 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !207, file: !4, line: 155, size: 128, elements: !227)
!227 = !{!228, !229, !230, !231, !232, !234}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !226, file: !4, line: 156, baseType: !96, size: 32)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !226, file: !4, line: 157, baseType: !109, size: 32)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !226, file: !4, line: 158, baseType: !76, size: 64)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !226, file: !4, line: 159, baseType: !108, size: 96)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !226, file: !4, line: 160, baseType: !233, size: 64)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "ghash", scope: !226, file: !4, line: 161, baseType: !235, size: 64)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHash", file: !237, line: 48, baseType: !238)
!237 = !DIFile(filename: "blender/source/blender/blenlib/BLI_ghash.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!238 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !237, line: 48, flags: DIFlagFwdDecl)
!239 = !{!240}
!240 = !DISubrange(count: 16)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "slots_out", scope: !203, file: !4, line: 192, baseType: !206, size: 5120, offset: 5120)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !203, file: !4, line: 193, baseType: !243, size: 64, offset: 10240)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!244 = !DISubroutineType(types: !245)
!245 = !{null, !169, !202}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "arena", scope: !203, file: !4, line: 194, baseType: !247, size: 64, offset: 10304)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!248 = !DICompositeType(tag: DW_TAG_structure_type, name: "MemArena", file: !165, line: 38, flags: DIFlagFwdDecl)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !203, file: !4, line: 195, baseType: !96, size: 32, offset: 10368)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "type_flag", scope: !203, file: !4, line: 196, baseType: !251, size: 32, offset: 10400)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMOpTypeFlag", file: !4, line: 188, baseType: !35)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !203, file: !4, line: 197, baseType: !96, size: 32, offset: 10432)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !171, file: !60, line: 223, baseType: !254, size: 1600, offset: 1152)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomData", file: !255, line: 73, baseType: !256)
!255 = !DIFile(filename: "blender/source/blender/makesdna/DNA_customdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!256 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomData", file: !255, line: 64, size: 1600, elements: !257)
!257 = !{!258, !276, !280, !281, !282, !283, !284}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !256, file: !255, line: 65, baseType: !259, size: 64)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataLayer", file: !255, line: 53, baseType: !261)
!261 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataLayer", file: !255, line: 42, size: 832, elements: !262)
!262 = !{!263, !264, !265, !266, !267, !268, !269, !270, !271, !275}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !261, file: !255, line: 43, baseType: !96, size: 32)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !261, file: !255, line: 44, baseType: !96, size: 32, offset: 32)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !261, file: !255, line: 45, baseType: !96, size: 32, offset: 64)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !261, file: !255, line: 46, baseType: !96, size: 32, offset: 96)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "active_rnd", scope: !261, file: !255, line: 47, baseType: !96, size: 32, offset: 128)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "active_clone", scope: !261, file: !255, line: 48, baseType: !96, size: 32, offset: 160)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "active_mask", scope: !261, file: !255, line: 49, baseType: !96, size: 32, offset: 192)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !261, file: !255, line: 50, baseType: !96, size: 32, offset: 224)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !261, file: !255, line: 51, baseType: !272, size: 512, offset: 256)
!272 = !DICompositeType(tag: DW_TAG_array_type, baseType: !98, size: 512, elements: !273)
!273 = !{!274}
!274 = !DISubrange(count: 64)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !261, file: !255, line: 52, baseType: !76, size: 64, offset: 768)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "typemap", scope: !256, file: !255, line: 66, baseType: !277, size: 1312, offset: 64)
!277 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 1312, elements: !278)
!278 = !{!279}
!279 = !DISubrange(count: 41)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "totlayer", scope: !256, file: !255, line: 69, baseType: !96, size: 32, offset: 1376)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "maxlayer", scope: !256, file: !255, line: 69, baseType: !96, size: 32, offset: 1408)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "totsize", scope: !256, file: !255, line: 70, baseType: !96, size: 32, offset: 1440)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !256, file: !255, line: 71, baseType: !183, size: 64, offset: 1472)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !256, file: !255, line: 72, baseType: !285, size: 64, offset: 1536)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataExternal", file: !255, line: 59, baseType: !287)
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataExternal", file: !255, line: 57, size: 8192, elements: !288)
!288 = !{!289}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !287, file: !255, line: 58, baseType: !290, size: 8192)
!290 = !DICompositeType(tag: DW_TAG_array_type, baseType: !98, size: 8192, elements: !291)
!291 = !{!292}
!292 = !DISubrange(count: 1024)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !171, file: !60, line: 223, baseType: !254, size: 1600, offset: 2752)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "ldata", scope: !171, file: !60, line: 223, baseType: !254, size: 1600, offset: 4352)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !171, file: !60, line: 223, baseType: !254, size: 1600, offset: 5952)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !171, file: !60, line: 233, baseType: !106, size: 16, offset: 7552)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !171, file: !60, line: 236, baseType: !96, size: 32, offset: 7584)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "walkers", scope: !171, file: !60, line: 238, baseType: !96, size: 32, offset: 7616)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "totflags", scope: !171, file: !60, line: 238, baseType: !96, size: 32, offset: 7648)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "selected", scope: !171, file: !60, line: 239, baseType: !301, size: 128, offset: 7680)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !302, line: 71, baseType: !303)
!302 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!303 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !302, line: 69, size: 128, elements: !304)
!304 = !{!305, !306}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !303, file: !302, line: 70, baseType: !76, size: 64)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !303, file: !302, line: 70, baseType: !76, size: 64, offset: 64)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "act_face", scope: !171, file: !60, line: 241, baseType: !154, size: 64, offset: 7808)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "errorstack", scope: !171, file: !60, line: 243, baseType: !301, size: 128, offset: 7872)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "py_handle", scope: !171, file: !60, line: 245, baseType: !76, size: 64, offset: 8000)
!310 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !311)
!311 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!313 = !DISubroutineType(types: !314)
!314 = !{!311, !86, !76}
!315 = !{}
!316 = !DILocalVariable(name: "bm", arg: 1, scope: !160, file: !1, line: 97, type: !169)
!317 = !DILocation(line: 97, column: 16, scope: !160)
!318 = !DILocalVariable(name: "v_src", arg: 2, scope: !160, file: !1, line: 97, type: !86)
!319 = !DILocation(line: 97, column: 28, scope: !160)
!320 = !DILocalVariable(name: "v_dst", arg: 3, scope: !160, file: !1, line: 97, type: !86)
!321 = !DILocation(line: 97, column: 43, scope: !160)
!322 = !DILocalVariable(name: "use_length", arg: 4, scope: !160, file: !1, line: 97, type: !310)
!323 = !DILocation(line: 97, column: 61, scope: !160)
!324 = !DILocalVariable(name: "user_data", arg: 5, scope: !160, file: !1, line: 98, type: !76)
!325 = !DILocation(line: 98, column: 15, scope: !160)
!326 = !DILocalVariable(name: "test_fn", arg: 6, scope: !160, file: !1, line: 98, type: !312)
!327 = !DILocation(line: 98, column: 33, scope: !160)
!328 = !DILocalVariable(name: "path", scope: !160, file: !1, line: 100, type: !329)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "LinkNode", file: !165, line: 48, baseType: !164)
!331 = !DILocation(line: 100, column: 12, scope: !160)
!332 = !DILocalVariable(name: "v", scope: !160, file: !1, line: 102, type: !86)
!333 = !DILocation(line: 102, column: 10, scope: !160)
!334 = !DILocalVariable(name: "viter", scope: !160, file: !1, line: 103, type: !335)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMIter", file: !43, line: 186, baseType: !336)
!336 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter", file: !43, line: 164, size: 512, elements: !337)
!337 = !{!338, !418, !419, !420, !421}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !336, file: !43, line: 179, baseType: !339, size: 320)
!339 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !336, file: !43, line: 166, size: 320, elements: !340)
!340 = !{!341, !356, !362, !370, !378, !384, !390, !396, !400, !406, !412}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "elem_of_mesh", scope: !339, file: !43, line: 167, baseType: !342, size: 192)
!342 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__elem_of_mesh", file: !43, line: 113, size: 192, elements: !343)
!343 = !{!344}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "pooliter", scope: !342, file: !43, line: 114, baseType: !345, size: 192)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLI_mempool_iter", file: !346, line: 80, baseType: !347)
!346 = !DIFile(filename: "blender/source/blender/blenlib/BLI_mempool.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!347 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool_iter", file: !346, line: 76, size: 192, elements: !348)
!348 = !{!349, !352, !355}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !347, file: !346, line: 77, baseType: !350, size: 64)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "BLI_mempool", file: !346, line: 47, baseType: !184)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "curchunk", scope: !347, file: !346, line: 78, baseType: !353, size: 64, offset: 64)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!354 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool_chunk", file: !346, line: 45, flags: DIFlagFwdDecl)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "curindex", scope: !347, file: !346, line: 79, baseType: !5, size: 32, offset: 128)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "edge_of_vert", scope: !339, file: !43, line: 169, baseType: !357, size: 192)
!357 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__edge_of_vert", file: !43, line: 116, size: 192, elements: !358)
!358 = !{!359, !360, !361}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !357, file: !43, line: 117, baseType: !86, size: 64)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "e_first", scope: !357, file: !43, line: 118, baseType: !152, size: 64, offset: 64)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "e_next", scope: !357, file: !43, line: 118, baseType: !152, size: 64, offset: 128)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "face_of_vert", scope: !339, file: !43, line: 170, baseType: !363, size: 320)
!363 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__face_of_vert", file: !43, line: 120, size: 320, elements: !364)
!364 = !{!365, !366, !367, !368, !369}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !363, file: !43, line: 121, baseType: !86, size: 64)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !363, file: !43, line: 122, baseType: !136, size: 64, offset: 64)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !363, file: !43, line: 122, baseType: !136, size: 64, offset: 128)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "e_first", scope: !363, file: !43, line: 123, baseType: !152, size: 64, offset: 192)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "e_next", scope: !363, file: !43, line: 123, baseType: !152, size: 64, offset: 256)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_vert", scope: !339, file: !43, line: 171, baseType: !371, size: 320)
!371 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_vert", file: !43, line: 125, size: 320, elements: !372)
!372 = !{!373, !374, !375, !376, !377}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !371, file: !43, line: 126, baseType: !86, size: 64)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !371, file: !43, line: 127, baseType: !136, size: 64, offset: 64)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !371, file: !43, line: 127, baseType: !136, size: 64, offset: 128)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "e_first", scope: !371, file: !43, line: 128, baseType: !152, size: 64, offset: 192)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "e_next", scope: !371, file: !43, line: 128, baseType: !152, size: 64, offset: 256)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_edge", scope: !339, file: !43, line: 172, baseType: !379, size: 192)
!379 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_edge", file: !43, line: 130, size: 192, elements: !380)
!380 = !{!381, !382, !383}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !379, file: !43, line: 131, baseType: !152, size: 64)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !379, file: !43, line: 132, baseType: !136, size: 64, offset: 64)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !379, file: !43, line: 132, baseType: !136, size: 64, offset: 128)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_loop", scope: !339, file: !43, line: 173, baseType: !385, size: 192)
!385 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_loop", file: !43, line: 134, size: 192, elements: !386)
!386 = !{!387, !388, !389}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "ldata", scope: !385, file: !43, line: 135, baseType: !136, size: 64)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !385, file: !43, line: 136, baseType: !136, size: 64, offset: 64)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !385, file: !43, line: 136, baseType: !136, size: 64, offset: 128)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "face_of_edge", scope: !339, file: !43, line: 174, baseType: !391, size: 192)
!391 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__face_of_edge", file: !43, line: 138, size: 192, elements: !392)
!392 = !{!393, !394, !395}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !391, file: !43, line: 139, baseType: !152, size: 64)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !391, file: !43, line: 140, baseType: !136, size: 64, offset: 64)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !391, file: !43, line: 140, baseType: !136, size: 64, offset: 128)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "vert_of_edge", scope: !339, file: !43, line: 175, baseType: !397, size: 64)
!397 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__vert_of_edge", file: !43, line: 142, size: 64, elements: !398)
!398 = !{!399}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !397, file: !43, line: 143, baseType: !152, size: 64)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "vert_of_face", scope: !339, file: !43, line: 176, baseType: !401, size: 192)
!401 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__vert_of_face", file: !43, line: 145, size: 192, elements: !402)
!402 = !{!403, !404, !405}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !401, file: !43, line: 146, baseType: !154, size: 64)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !401, file: !43, line: 147, baseType: !136, size: 64, offset: 64)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !401, file: !43, line: 147, baseType: !136, size: 64, offset: 128)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "edge_of_face", scope: !339, file: !43, line: 177, baseType: !407, size: 192)
!407 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__edge_of_face", file: !43, line: 149, size: 192, elements: !408)
!408 = !{!409, !410, !411}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !407, file: !43, line: 150, baseType: !154, size: 64)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !407, file: !43, line: 151, baseType: !136, size: 64, offset: 64)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !407, file: !43, line: 151, baseType: !136, size: 64, offset: 128)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "loop_of_face", scope: !339, file: !43, line: 178, baseType: !413, size: 192)
!413 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMIter__loop_of_face", file: !43, line: 153, size: 192, elements: !414)
!414 = !{!415, !416, !417}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !413, file: !43, line: 154, baseType: !154, size: 64)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !413, file: !43, line: 155, baseType: !136, size: 64, offset: 64)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "l_next", scope: !413, file: !43, line: 155, baseType: !136, size: 64, offset: 128)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "begin", scope: !336, file: !43, line: 181, baseType: !78, size: 64, offset: 320)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !336, file: !43, line: 182, baseType: !82, size: 64, offset: 384)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !336, file: !43, line: 184, baseType: !96, size: 32, offset: 448)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "itype", scope: !336, file: !43, line: 185, baseType: !98, size: 8, offset: 480)
!422 = !DILocation(line: 103, column: 9, scope: !160)
!423 = !DILocalVariable(name: "heap", scope: !160, file: !1, line: 104, type: !424)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "Heap", file: !426, line: 31, baseType: !427)
!426 = !DIFile(filename: "blender/source/blender/blenlib/BLI_heap.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!427 = !DICompositeType(tag: DW_TAG_structure_type, name: "Heap", file: !426, line: 29, flags: DIFlagFwdDecl)
!428 = !DILocation(line: 104, column: 8, scope: !160)
!429 = !DILocalVariable(name: "cost", scope: !160, file: !1, line: 105, type: !430)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!431 = !DILocation(line: 105, column: 9, scope: !160)
!432 = !DILocalVariable(name: "verts_prev", scope: !160, file: !1, line: 106, type: !189)
!433 = !DILocation(line: 106, column: 11, scope: !160)
!434 = !DILocalVariable(name: "i", scope: !160, file: !1, line: 107, type: !96)
!435 = !DILocation(line: 107, column: 6, scope: !160)
!436 = !DILocalVariable(name: "totvert", scope: !160, file: !1, line: 107, type: !96)
!437 = !DILocation(line: 107, column: 9, scope: !160)
!438 = !DILocation(line: 112, column: 2, scope: !439)
!439 = distinct !DILexicalBlock(scope: !160, file: !1, line: 112, column: 2)
!440 = !DILocation(line: 112, column: 2, scope: !441)
!441 = distinct !DILexicalBlock(scope: !439, file: !1, line: 112, column: 2)
!442 = !DILocation(line: 113, column: 7, scope: !443)
!443 = distinct !DILexicalBlock(scope: !444, file: !1, line: 113, column: 7)
!444 = distinct !DILexicalBlock(scope: !441, file: !1, line: 112, column: 58)
!445 = !DILocation(line: 113, column: 15, scope: !443)
!446 = !DILocation(line: 113, column: 18, scope: !443)
!447 = !DILocation(line: 113, column: 7, scope: !444)
!448 = !DILocation(line: 114, column: 4, scope: !449)
!449 = distinct !DILexicalBlock(scope: !443, file: !1, line: 113, column: 30)
!450 = !DILocation(line: 115, column: 3, scope: !449)
!451 = !DILocation(line: 117, column: 4, scope: !452)
!452 = distinct !DILexicalBlock(scope: !443, file: !1, line: 116, column: 8)
!453 = !DILocation(line: 120, column: 3, scope: !444)
!454 = !DILocation(line: 121, column: 2, scope: !444)
!455 = distinct !{!455, !438, !456}
!456 = !DILocation(line: 121, column: 2, scope: !439)
!457 = !DILocation(line: 122, column: 2, scope: !160)
!458 = !DILocation(line: 122, column: 6, scope: !160)
!459 = !DILocation(line: 122, column: 23, scope: !160)
!460 = !DILocation(line: 125, column: 12, scope: !160)
!461 = !DILocation(line: 125, column: 16, scope: !160)
!462 = !DILocation(line: 125, column: 10, scope: !160)
!463 = !DILocation(line: 126, column: 15, scope: !160)
!464 = !DILocation(line: 126, column: 49, scope: !160)
!465 = !DILocation(line: 126, column: 47, scope: !160)
!466 = !DILocation(line: 126, column: 13, scope: !160)
!467 = !DILocation(line: 127, column: 9, scope: !160)
!468 = !DILocation(line: 127, column: 37, scope: !160)
!469 = !DILocation(line: 127, column: 35, scope: !160)
!470 = !DILocation(line: 127, column: 7, scope: !160)
!471 = !DILocation(line: 129, column: 13, scope: !160)
!472 = !DILocation(line: 129, column: 19, scope: !160)
!473 = !DILocation(line: 129, column: 2, scope: !160)
!474 = !DILocation(line: 143, column: 9, scope: !160)
!475 = !DILocation(line: 143, column: 7, scope: !160)
!476 = !DILocation(line: 144, column: 18, scope: !160)
!477 = !DILocation(line: 144, column: 30, scope: !160)
!478 = !DILocation(line: 144, column: 2, scope: !160)
!479 = !DILocation(line: 145, column: 2, scope: !160)
!480 = !DILocation(line: 145, column: 7, scope: !160)
!481 = !DILocation(line: 145, column: 33, scope: !160)
!482 = !DILocation(line: 147, column: 2, scope: !160)
