; ModuleID = 'blender/source/blender/editors/space_clip/clip_utils.c'
source_filename = "blender/source/blender/editors/space_clip/clip_utils.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.UserDef = type { i32, i32, i32, i32, i32, [768 x i8], [768 x i8], [1024 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [1024 x i8], [1024 x i8], i32, i16, i16, i16, i16, i16, i16, i32, i32, i32, i16, i16, i32, i32, i32, i32, i32, i32, i32, i16, i16, i16, i16, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, [64 x i8], i16, i16, i16, i16, i16, i16, i16, i16, [3 x %struct.SolidLight], i16, i16, i16, i16, i16, i16, i16, i16, i32, i32, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i8, i8, i8, i8, i16, i16, i16, i16, i16, i16, float, float, i32, i16, i16, float, i16, i16, i16, i16, %struct.ColorBand, [3 x float], [4 x float], i16, i8, i8, [80 x i8], [1024 x i8], i32, i32, float, float, i32, i16, i16, i16, i16, i16, i16, %struct.WalkNavigation }
%struct.ListBase = type { i8*, i8* }
%struct.SolidLight = type { i32, i32, [4 x float], [4 x float], [4 x float] }
%struct.ColorBand = type { i16, i16, i8, i8, i8, [1 x i8], [32 x %struct.CBData] }
%struct.CBData = type { float, float, float, float, float, i32 }
%struct.WalkNavigation = type { float, float, float, float, float, float, i16, [3 x i16] }

!170 = !DIEnumerator(name: "TH_ACT_MARKER", value: 142, isUnsigned: true)
!171 = !DIEnumerator(name: "TH_SEL_MARKER", value: 143, isUnsigned: true)
!172 = !DIEnumerator(name: "TH_BUNDLE_SOLID", value: 144, isUnsigned: true)
!173 = !DIEnumerator(name: "TH_DIS_MARKER", value: 145, isUnsigned: true)
!174 = !DIEnumerator(name: "TH_PATH_BEFORE", value: 146, isUnsigned: true)
!175 = !DIEnumerator(name: "TH_PATH_AFTER", value: 147, isUnsigned: true)
!176 = !DIEnumerator(name: "TH_CAMERA_PATH", value: 148, isUnsigned: true)
!177 = !DIEnumerator(name: "TH_LOCK_MARKER", value: 149, isUnsigned: true)
!178 = !DIEnumerator(name: "TH_STITCH_PREVIEW_FACE", value: 150, isUnsigned: true)
!179 = !DIEnumerator(name: "TH_STITCH_PREVIEW_EDGE", value: 151, isUnsigned: true)
!180 = !DIEnumerator(name: "TH_STITCH_PREVIEW_VERT", value: 152, isUnsigned: true)
!181 = !DIEnumerator(name: "TH_STITCH_PREVIEW_STITCHABLE", value: 153, isUnsigned: true)
!182 = !DIEnumerator(name: "TH_STITCH_PREVIEW_UNSTITCHABLE", value: 154, isUnsigned: true)
!183 = !DIEnumerator(name: "TH_STITCH_PREVIEW_ACTIVE", value: 155, isUnsigned: true)
!184 = !DIEnumerator(name: "TH_PAINT_CURVE_HANDLE", value: 156, isUnsigned: true)
!185 = !DIEnumerator(name: "TH_PAINT_CURVE_PIVOT", value: 157, isUnsigned: true)
!186 = !DIEnumerator(name: "TH_UV_SHADOW", value: 158, isUnsigned: true)
!187 = !DIEnumerator(name: "TH_UV_OTHERS", value: 159, isUnsigned: true)
!188 = !DIEnumerator(name: "TH_FREESTYLE_EDGE_MARK", value: 160, isUnsigned: true)
!189 = !DIEnumerator(name: "TH_FREESTYLE_FACE_MARK", value: 161, isUnsigned: true)
!190 = !DIEnumerator(name: "TH_MATCH", value: 162, isUnsigned: true)
!191 = !DIEnumerator(name: "TH_SELECT_HIGHLIGHT", value: 163, isUnsigned: true)
!192 = !DIEnumerator(name: "TH_SKIN_ROOT", value: 164, isUnsigned: true)
!193 = !DIEnumerator(name: "TH_ANIM_ACTIVE", value: 165, isUnsigned: true)
!194 = !DIEnumerator(name: "TH_ANIM_INACTIVE", value: 166, isUnsigned: true)
!195 = !DIEnumerator(name: "TH_NLA_TWEAK", value: 167, isUnsigned: true)
!196 = !DIEnumerator(name: "TH_NLA_TWEAK_DUPLI", value: 168, isUnsigned: true)
!197 = !DIEnumerator(name: "TH_NLA_TRANSITION", value: 169, isUnsigned: true)
!198 = !DIEnumerator(name: "TH_NLA_TRANSITION_SEL", value: 170, isUnsigned: true)
!199 = !DIEnumerator(name: "TH_NLA_META", value: 171, isUnsigned: true)
!200 = !DIEnumerator(name: "TH_NLA_META_SEL", value: 172, isUnsigned: true)
!201 = !DIEnumerator(name: "TH_NLA_SOUND", value: 173, isUnsigned: true)
!202 = !DIEnumerator(name: "TH_NLA_SOUND_SEL", value: 174, isUnsigned: true)
!203 = !DIEnumerator(name: "TH_EMBOSS", value: 175, isUnsigned: true)
!204 = !DIEnumerator(name: "TH_AXIS_X", value: 176, isUnsigned: true)
!205 = !DIEnumerator(name: "TH_AXIS_Y", value: 177, isUnsigned: true)
!206 = !DIEnumerator(name: "TH_AXIS_Z", value: 178, isUnsigned: true)
!207 = !DIEnumerator(name: "TH_LOW_GRAD", value: 179, isUnsigned: true)
!208 = !DIEnumerator(name: "TH_HIGH_GRAD", value: 180, isUnsigned: true)
!209 = !DIEnumerator(name: "TH_SHOW_BACK_GRAD", value: 181, isUnsigned: true)
!210 = !DIEnumerator(name: "TH_INFO_SELECTED", value: 182, isUnsigned: true)
!211 = !DIEnumerator(name: "TH_INFO_SELECTED_TEXT", value: 183, isUnsigned: true)
!212 = !DIEnumerator(name: "TH_INFO_ERROR", value: 184, isUnsigned: true)
!213 = !DIEnumerator(name: "TH_INFO_ERROR_TEXT", value: 185, isUnsigned: true)
!214 = !DIEnumerator(name: "TH_INFO_WARNING", value: 186, isUnsigned: true)
!215 = !DIEnumerator(name: "TH_INFO_WARNING_TEXT", value: 187, isUnsigned: true)
!216 = !DIEnumerator(name: "TH_INFO_INFO", value: 188, isUnsigned: true)
!217 = !DIEnumerator(name: "TH_INFO_INFO_TEXT", value: 189, isUnsigned: true)
!218 = !DIEnumerator(name: "TH_INFO_DEBUG", value: 190, isUnsigned: true)
!219 = !DIEnumerator(name: "TH_INFO_DEBUG_TEXT", value: 191, isUnsigned: true)
!220 = !DIEnumerator(name: "TH_VIEW_OVERLAY", value: 192, isUnsigned: true)
!221 = !{!222, !223}
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!223 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!224 = !{i32 7, !"Dwarf Version", i32 4}
!225 = !{i32 2, !"Debug Info Version", i32 3}
!226 = !{i32 1, !"wchar_size", i32 4}
!227 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!228 = distinct !DISubprogram(name: "clip_graph_tracking_values_iterate_track", scope: !1, file: !1, line: 66, type: !229, scopeLine: 72, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !702)
!229 = !DISubroutineType(types: !230)
!230 = !{null, !231, !443, !222, !693, !696, !699}
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "SpaceClip", file: !233, line: 1110, baseType: !234)
!233 = !DIFile(filename: "blender/source/blender/makesdna/DNA_space_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceClip", file: !233, line: 1074, size: 3264, elements: !235)
!235 = !{!236, !259, !260, !261, !262, !263, !264, !265, !266, !267, !274, !641, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !234, file: !233, line: 1075, baseType: !237, size: 64)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "SpaceLink", file: !233, line: 91, baseType: !239)
!239 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceLink", file: !233, line: 85, size: 448, elements: !240)
!240 = !{!241, !243, !244, !251, !253, !254}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !239, file: !233, line: 86, baseType: !242, size: 64)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !239, file: !233, line: 86, baseType: !242, size: 64, offset: 64)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !239, file: !233, line: 87, baseType: !245, size: 128, offset: 128)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !246, line: 71, baseType: !247)
!246 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!247 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !246, line: 69, size: 128, elements: !248)
!248 = !{!249, !250}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !247, file: !246, line: 70, baseType: !222, size: 64)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !247, file: !246, line: 70, baseType: !222, size: 64, offset: 64)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "spacetype", scope: !239, file: !233, line: 88, baseType: !252, size: 32, offset: 256)
!252 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "blockscale", scope: !239, file: !233, line: 89, baseType: !223, size: 32, offset: 288)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "blockhandler", scope: !239, file: !233, line: 90, baseType: !255, size: 128, offset: 320)
!255 = !DICompositeType(tag: DW_TAG_array_type, baseType: !256, size: 128, elements: !257)
!256 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!257 = !{!258}
!258 = !DISubrange(count: 8)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !234, file: !233, line: 1075, baseType: !237, size: 64, offset: 64)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !234, file: !233, line: 1076, baseType: !245, size: 128, offset: 128)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "spacetype", scope: !234, file: !233, line: 1077, baseType: !252, size: 32, offset: 256)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "xof", scope: !234, file: !233, line: 1079, baseType: !223, size: 32, offset: 288)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "yof", scope: !234, file: !233, line: 1079, baseType: !223, size: 32, offset: 320)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "xlockof", scope: !234, file: !233, line: 1080, baseType: !223, size: 32, offset: 352)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "ylockof", scope: !234, file: !233, line: 1080, baseType: !223, size: 32, offset: 384)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "zoom", scope: !234, file: !233, line: 1081, baseType: !223, size: 32, offset: 416)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !234, file: !233, line: 1083, baseType: !268, size: 64, offset: 448)
!268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipUser", file: !269, line: 50, size: 64, elements: !270)
!269 = !DIFile(filename: "blender/source/blender/makesdna/DNA_movieclip_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!270 = !{!271, !272, !273}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !268, file: !269, line: 51, baseType: !252, size: 32)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "render_size", scope: !268, file: !269, line: 52, baseType: !256, size: 16, offset: 32)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "render_flag", scope: !268, file: !269, line: 52, baseType: !256, size: 16, offset: 48)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "clip", scope: !234, file: !233, line: 1084, baseType: !275, size: 64, offset: 512)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClip", file: !269, line: 64, size: 19136, elements: !277)
!277 = !{!278, !341, !345, !346, !347, !348, !352, !353, !354, !358, !361, !364, !624, !625, !636, !637, !638, !639, !640}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !276, file: !269, line: 65, baseType: !279, size: 960)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !280, line: 130, baseType: !281)
!280 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!281 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !280, line: 117, size: 960, elements: !282)
!282 = !{!283, !284, !285, !287, !307, !311, !312, !313, !314, !315}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !281, file: !280, line: 118, baseType: !222, size: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !281, file: !280, line: 118, baseType: !222, size: 64, offset: 64)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !281, file: !280, line: 119, baseType: !286, size: 64, offset: 128)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !281, file: !280, line: 120, baseType: !288, size: 64, offset: 192)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!289 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !280, line: 136, size: 17600, elements: !290)
!290 = !{!291, !292, !294, !297, !302, !303, !304}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !289, file: !280, line: 137, baseType: !279, size: 960)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !289, file: !280, line: 138, baseType: !293, size: 64, offset: 960)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !289, file: !280, line: 139, baseType: !295, size: 64, offset: 1024)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64)
!296 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !280, line: 43, flags: DIFlagFwdDecl)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !289, file: !280, line: 140, baseType: !298, size: 8192, offset: 1088)
!298 = !DICompositeType(tag: DW_TAG_array_type, baseType: !299, size: 8192, elements: !300)
!299 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!300 = !{!301}
!301 = !DISubrange(count: 1024)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !289, file: !280, line: 141, baseType: !298, size: 8192, offset: 9280)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !289, file: !280, line: 148, baseType: !288, size: 64, offset: 17472)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !289, file: !280, line: 150, baseType: !305, size: 64, offset: 17536)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!306 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !280, line: 45, flags: DIFlagFwdDecl)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !281, file: !280, line: 121, baseType: !308, size: 528, offset: 256)
!308 = !DICompositeType(tag: DW_TAG_array_type, baseType: !299, size: 528, elements: !309)
!309 = !{!310}
!310 = !DISubrange(count: 66)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !281, file: !280, line: 126, baseType: !256, size: 16, offset: 784)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !281, file: !280, line: 127, baseType: !252, size: 32, offset: 800)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !281, file: !280, line: 128, baseType: !252, size: 32, offset: 832)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !281, file: !280, line: 128, baseType: !252, size: 32, offset: 864)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !281, file: !280, line: 129, baseType: !316, size: 64, offset: 896)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !280, line: 75, baseType: !318)
!318 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !280, line: 62, size: 1024, elements: !319)
!319 = !{!320, !322, !323, !324, !325, !326, !330, !331, !339, !340}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !318, file: !280, line: 63, baseType: !321, size: 64)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !318, file: !280, line: 63, baseType: !321, size: 64, offset: 64)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !318, file: !280, line: 64, baseType: !299, size: 8, offset: 128)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !318, file: !280, line: 64, baseType: !299, size: 8, offset: 136)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !318, file: !280, line: 65, baseType: !256, size: 16, offset: 144)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !318, file: !280, line: 66, baseType: !327, size: 512, offset: 160)
!327 = !DICompositeType(tag: DW_TAG_array_type, baseType: !299, size: 512, elements: !328)
!328 = !{!329}
!329 = !DISubrange(count: 64)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !318, file: !280, line: 67, baseType: !252, size: 32, offset: 672)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !318, file: !280, line: 69, baseType: !332, size: 256, offset: 704)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !280, line: 60, baseType: !333)
!333 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !280, line: 48, size: 256, elements: !334)
!334 = !{!335, !336, !337, !338}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !333, file: !280, line: 49, baseType: !222, size: 64)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !333, file: !280, line: 58, baseType: !245, size: 128, offset: 64)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !333, file: !280, line: 59, baseType: !252, size: 32, offset: 192)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !333, file: !280, line: 59, baseType: !252, size: 32, offset: 224)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !318, file: !280, line: 70, baseType: !252, size: 32, offset: 960)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !318, file: !280, line: 74, baseType: !252, size: 32, offset: 992)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !276, file: !269, line: 66, baseType: !342, size: 64, offset: 960)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64)
!343 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !344, line: 58, flags: DIFlagFwdDecl)
!344 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!345 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !276, file: !269, line: 68, baseType: !298, size: 8192, offset: 1024)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !276, file: !269, line: 70, baseType: !252, size: 32, offset: 9216)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !276, file: !269, line: 71, baseType: !252, size: 32, offset: 9248)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "lastsize", scope: !276, file: !269, line: 72, baseType: !349, size: 64, offset: 9280)
!349 = !DICompositeType(tag: DW_TAG_array_type, baseType: !252, size: 64, elements: !350)
!350 = !{!351}
!351 = !DISubrange(count: 2)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !276, file: !269, line: 74, baseType: !223, size: 32, offset: 9344)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !276, file: !269, line: 74, baseType: !223, size: 32, offset: 9376)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !276, file: !269, line: 76, baseType: !355, size: 64, offset: 9408)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!356 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !357, line: 41, flags: DIFlagFwdDecl)
!357 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!358 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !276, file: !269, line: 77, baseType: !359, size: 64, offset: 9472)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!360 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipCache", file: !269, line: 77, flags: DIFlagFwdDecl)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !276, file: !269, line: 78, baseType: !362, size: 64, offset: 9536)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !344, line: 61, flags: DIFlagFwdDecl)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "tracking", scope: !276, file: !269, line: 80, baseType: !365, size: 2624, offset: 9600)
!365 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTracking", file: !4, line: 340, size: 2624, elements: !366)
!366 = !{!367, !395, !414, !415, !416, !434, !495, !496, !601, !602, !603, !604, !613}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "settings", scope: !365, file: !4, line: 341, baseType: !368, size: 576)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingSettings", file: !4, line: 251, baseType: !369)
!369 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingSettings", file: !4, line: 207, size: 576, elements: !370)
!370 = !{!371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !369, file: !4, line: 208, baseType: !252, size: 32)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "default_motion_model", scope: !369, file: !4, line: 211, baseType: !256, size: 16, offset: 32)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "default_algorithm_flag", scope: !369, file: !4, line: 212, baseType: !256, size: 16, offset: 48)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "default_minimum_correlation", scope: !369, file: !4, line: 213, baseType: !223, size: 32, offset: 64)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_size", scope: !369, file: !4, line: 214, baseType: !256, size: 16, offset: 96)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "default_search_size", scope: !369, file: !4, line: 215, baseType: !256, size: 16, offset: 112)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "default_frames_limit", scope: !369, file: !4, line: 216, baseType: !256, size: 16, offset: 128)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "default_margin", scope: !369, file: !4, line: 217, baseType: !256, size: 16, offset: 144)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_match", scope: !369, file: !4, line: 218, baseType: !256, size: 16, offset: 160)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "default_flag", scope: !369, file: !4, line: 219, baseType: !256, size: 16, offset: 176)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "default_weight", scope: !369, file: !4, line: 220, baseType: !223, size: 32, offset: 192)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "motion_flag", scope: !369, file: !4, line: 222, baseType: !256, size: 16, offset: 224)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "speed", scope: !369, file: !4, line: 225, baseType: !256, size: 16, offset: 240)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe1", scope: !369, file: !4, line: 228, baseType: !252, size: 32, offset: 256)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe2", scope: !369, file: !4, line: 229, baseType: !252, size: 32, offset: 288)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction_flag", scope: !369, file: !4, line: 233, baseType: !252, size: 32, offset: 320)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "refine_camera_intrinsics", scope: !369, file: !4, line: 236, baseType: !256, size: 16, offset: 352)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !369, file: !4, line: 236, baseType: !256, size: 16, offset: 368)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !369, file: !4, line: 241, baseType: !223, size: 32, offset: 384)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "clean_frames", scope: !369, file: !4, line: 244, baseType: !252, size: 32, offset: 416)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "clean_action", scope: !369, file: !4, line: 244, baseType: !252, size: 32, offset: 448)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "clean_error", scope: !369, file: !4, line: 245, baseType: !223, size: 32, offset: 480)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "object_distance", scope: !369, file: !4, line: 248, baseType: !223, size: 32, offset: 512)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !369, file: !4, line: 250, baseType: !252, size: 32, offset: 544)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !365, file: !4, line: 342, baseType: !396, size: 448, offset: 576)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingCamera", file: !4, line: 79, baseType: !397)
!397 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingCamera", file: !4, line: 61, size: 448, elements: !398)
!398 = !{!399, !400, !401, !402, !403, !404, !405, !406, !407, !409, !410, !411, !412, !413}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "intrinsics", scope: !397, file: !4, line: 62, baseType: !222, size: 64)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_model", scope: !397, file: !4, line: 64, baseType: !256, size: 16, offset: 64)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !397, file: !4, line: 65, baseType: !256, size: 16, offset: 80)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "sensor_width", scope: !397, file: !4, line: 67, baseType: !223, size: 32, offset: 96)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_aspect", scope: !397, file: !4, line: 68, baseType: !223, size: 32, offset: 128)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "focal", scope: !397, file: !4, line: 69, baseType: !223, size: 32, offset: 160)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !397, file: !4, line: 70, baseType: !256, size: 16, offset: 192)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !397, file: !4, line: 71, baseType: !256, size: 16, offset: 208)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "principal", scope: !397, file: !4, line: 72, baseType: !408, size: 64, offset: 224)
!408 = !DICompositeType(tag: DW_TAG_array_type, baseType: !223, size: 64, elements: !350)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "k1", scope: !397, file: !4, line: 75, baseType: !223, size: 32, offset: 288)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "k2", scope: !397, file: !4, line: 75, baseType: !223, size: 32, offset: 320)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "k3", scope: !397, file: !4, line: 75, baseType: !223, size: 32, offset: 352)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "division_k1", scope: !397, file: !4, line: 78, baseType: !223, size: 32, offset: 384)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "division_k2", scope: !397, file: !4, line: 78, baseType: !223, size: 32, offset: 416)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "tracks", scope: !365, file: !4, line: 343, baseType: !245, size: 128, offset: 1024)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "plane_tracks", scope: !365, file: !4, line: 344, baseType: !245, size: 128, offset: 1152)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction", scope: !365, file: !4, line: 345, baseType: !417, size: 192, offset: 1280)
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingReconstruction", file: !4, line: 278, baseType: !418)
!418 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingReconstruction", file: !4, line: 270, size: 192, elements: !419)
!419 = !{!420, !421, !422, !423, !424}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !418, file: !4, line: 271, baseType: !252, size: 32)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !418, file: !4, line: 273, baseType: !223, size: 32, offset: 32)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "last_camera", scope: !418, file: !4, line: 275, baseType: !252, size: 32, offset: 64)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "camnr", scope: !418, file: !4, line: 276, baseType: !252, size: 32, offset: 96)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "cameras", scope: !418, file: !4, line: 277, baseType: !425, size: 64, offset: 128)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!426 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieReconstructedCamera", file: !4, line: 55, size: 576, elements: !427)
!427 = !{!428, !429, !430}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !426, file: !4, line: 56, baseType: !252, size: 32)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !426, file: !4, line: 57, baseType: !223, size: 32, offset: 32)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !426, file: !4, line: 58, baseType: !431, size: 512, offset: 64)
!431 = !DICompositeType(tag: DW_TAG_array_type, baseType: !223, size: 512, elements: !432)
!432 = !{!433, !433}
!433 = !DISubrange(count: 4)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "stabilization", scope: !365, file: !4, line: 346, baseType: !435, size: 384, offset: 1472)
!435 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStabilization", file: !4, line: 268, baseType: !436)
!436 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStabilization", file: !4, line: 253, size: 384, elements: !437)
!437 = !{!438, !439, !440, !441, !442, !489, !490, !491, !492, !493, !494}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !436, file: !4, line: 254, baseType: !252, size: 32)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "tot_track", scope: !436, file: !4, line: 255, baseType: !252, size: 32, offset: 32)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !436, file: !4, line: 255, baseType: !252, size: 32, offset: 64)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "maxscale", scope: !436, file: !4, line: 258, baseType: !223, size: 32, offset: 96)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "rot_track", scope: !436, file: !4, line: 259, baseType: !443, size: 64, offset: 128)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64)
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingTrack", file: !4, line: 164, baseType: !445)
!445 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingTrack", file: !4, line: 108, size: 1664, elements: !446)
!446 = !{!447, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !471, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !445, file: !4, line: 109, baseType: !448, size: 64)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !445, file: !4, line: 109, baseType: !448, size: 64, offset: 64)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !445, file: !4, line: 111, baseType: !327, size: 512, offset: 128)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "pat_min", scope: !445, file: !4, line: 119, baseType: !408, size: 64, offset: 640)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "pat_max", scope: !445, file: !4, line: 119, baseType: !408, size: 64, offset: 704)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !445, file: !4, line: 125, baseType: !408, size: 64, offset: 768)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !445, file: !4, line: 125, baseType: !408, size: 64, offset: 832)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !445, file: !4, line: 127, baseType: !408, size: 64, offset: 896)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !445, file: !4, line: 130, baseType: !252, size: 32, offset: 960)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !445, file: !4, line: 131, baseType: !252, size: 32, offset: 992)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !445, file: !4, line: 132, baseType: !459, size: 64, offset: 1024)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingMarker", file: !4, line: 106, baseType: !461)
!461 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingMarker", file: !4, line: 81, size: 512, elements: !462)
!462 = !{!463, !464, !467, !468, !469, !470}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !461, file: !4, line: 82, baseType: !408, size: 64)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_corners", scope: !461, file: !4, line: 97, baseType: !465, size: 256, offset: 64)
!465 = !DICompositeType(tag: DW_TAG_array_type, baseType: !223, size: 256, elements: !466)
!466 = !{!433, !351}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !461, file: !4, line: 102, baseType: !408, size: 64, offset: 320)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !461, file: !4, line: 102, baseType: !408, size: 64, offset: 384)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !461, file: !4, line: 104, baseType: !252, size: 32, offset: 448)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !461, file: !4, line: 105, baseType: !252, size: 32, offset: 480)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "bundle_pos", scope: !445, file: !4, line: 135, baseType: !472, size: 96, offset: 1088)
!472 = !DICompositeType(tag: DW_TAG_array_type, baseType: !223, size: 96, elements: !473)
!473 = !{!474}
!474 = !DISubrange(count: 3)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !445, file: !4, line: 136, baseType: !223, size: 32, offset: 1184)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !445, file: !4, line: 139, baseType: !252, size: 32, offset: 1216)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "pat_flag", scope: !445, file: !4, line: 139, baseType: !252, size: 32, offset: 1248)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "search_flag", scope: !445, file: !4, line: 139, baseType: !252, size: 32, offset: 1280)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !445, file: !4, line: 140, baseType: !472, size: 96, offset: 1312)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "frames_limit", scope: !445, file: !4, line: 143, baseType: !256, size: 16, offset: 1408)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !445, file: !4, line: 144, baseType: !256, size: 16, offset: 1424)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_match", scope: !445, file: !4, line: 145, baseType: !256, size: 16, offset: 1440)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "motion_model", scope: !445, file: !4, line: 148, baseType: !256, size: 16, offset: 1456)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm_flag", scope: !445, file: !4, line: 149, baseType: !252, size: 32, offset: 1472)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "minimum_correlation", scope: !445, file: !4, line: 150, baseType: !223, size: 32, offset: 1504)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !445, file: !4, line: 152, baseType: !362, size: 64, offset: 1536)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !445, file: !4, line: 163, baseType: !223, size: 32, offset: 1600)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !445, file: !4, line: 163, baseType: !223, size: 32, offset: 1632)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "locinf", scope: !436, file: !4, line: 261, baseType: !223, size: 32, offset: 192)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "scaleinf", scope: !436, file: !4, line: 261, baseType: !223, size: 32, offset: 224)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "rotinf", scope: !436, file: !4, line: 261, baseType: !223, size: 32, offset: 256)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !436, file: !4, line: 263, baseType: !252, size: 32, offset: 288)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !436, file: !4, line: 266, baseType: !252, size: 32, offset: 320)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !436, file: !4, line: 267, baseType: !223, size: 32, offset: 352)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !365, file: !4, line: 347, baseType: !443, size: 64, offset: 1856)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "act_plane_track", scope: !365, file: !4, line: 348, baseType: !497, size: 64, offset: 1920)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64)
!498 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingPlaneTrack", file: !4, line: 205, baseType: !499)
!499 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingPlaneTrack", file: !4, line: 186, size: 1024, elements: !500)
!500 = !{!501, !503, !504, !505, !507, !508, !509, !517, !518, !519, !599, !600}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !499, file: !4, line: 187, baseType: !502, size: 64)
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !499, file: !4, line: 187, baseType: !502, size: 64, offset: 64)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !499, file: !4, line: 189, baseType: !327, size: 512, offset: 128)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "point_tracks", scope: !499, file: !4, line: 191, baseType: !506, size: 64, offset: 640)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "point_tracksnr", scope: !499, file: !4, line: 193, baseType: !252, size: 32, offset: 704)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !499, file: !4, line: 193, baseType: !252, size: 32, offset: 736)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !499, file: !4, line: 195, baseType: !510, size: 64, offset: 768)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 64)
!511 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingPlaneMarker", file: !4, line: 184, baseType: !512)
!512 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingPlaneMarker", file: !4, line: 166, size: 320, elements: !513)
!513 = !{!514, !515, !516}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "corners", scope: !512, file: !4, line: 180, baseType: !465, size: 256)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !512, file: !4, line: 182, baseType: !252, size: 32, offset: 256)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !512, file: !4, line: 183, baseType: !252, size: 32, offset: 288)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !499, file: !4, line: 196, baseType: !252, size: 32, offset: 832)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !499, file: !4, line: 198, baseType: !252, size: 32, offset: 864)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "image", scope: !499, file: !4, line: 200, baseType: !520, size: 64, offset: 896)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 64)
!521 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !357, line: 77, size: 15424, elements: !522)
!522 = !{!523, !524, !525, !528, !531, !532, !535, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !553, !554, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !580, !581, !582, !588, !589, !593}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !521, file: !357, line: 78, baseType: !279, size: 960)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !521, file: !357, line: 80, baseType: !298, size: 8192, offset: 960)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !521, file: !357, line: 82, baseType: !526, size: 64, offset: 9152)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64)
!527 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !357, line: 43, flags: DIFlagFwdDecl)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !521, file: !357, line: 83, baseType: !529, size: 64, offset: 9216)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64)
!530 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !280, line: 46, flags: DIFlagFwdDecl)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !521, file: !357, line: 86, baseType: !355, size: 64, offset: 9280)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !521, file: !357, line: 87, baseType: !533, size: 64, offset: 9344)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64)
!534 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !357, line: 44, flags: DIFlagFwdDecl)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !521, file: !357, line: 89, baseType: !536, size: 512, offset: 9408)
!536 = !DICompositeType(tag: DW_TAG_array_type, baseType: !533, size: 512, elements: !257)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !521, file: !357, line: 90, baseType: !256, size: 16, offset: 9920)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !521, file: !357, line: 90, baseType: !256, size: 16, offset: 9936)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !521, file: !357, line: 92, baseType: !256, size: 16, offset: 9952)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !521, file: !357, line: 92, baseType: !256, size: 16, offset: 9968)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !521, file: !357, line: 93, baseType: !256, size: 16, offset: 9984)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !521, file: !357, line: 93, baseType: !256, size: 16, offset: 10000)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !521, file: !357, line: 94, baseType: !252, size: 32, offset: 10016)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !521, file: !357, line: 97, baseType: !256, size: 16, offset: 10048)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !521, file: !357, line: 97, baseType: !256, size: 16, offset: 10064)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !521, file: !357, line: 98, baseType: !256, size: 16, offset: 10080)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !521, file: !357, line: 98, baseType: !256, size: 16, offset: 10096)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !521, file: !357, line: 99, baseType: !256, size: 16, offset: 10112)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !521, file: !357, line: 99, baseType: !256, size: 16, offset: 10128)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !521, file: !357, line: 100, baseType: !5, size: 32, offset: 10144)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !521, file: !357, line: 101, baseType: !552, size: 64, offset: 10176)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !521, file: !357, line: 103, baseType: !305, size: 64, offset: 10240)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !521, file: !357, line: 104, baseType: !555, size: 64, offset: 10304)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64)
!556 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !280, line: 159, size: 448, elements: !557)
!557 = !{!558, !560, !561, !563, !564, !566}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !556, file: !280, line: 161, baseType: !559, size: 64)
!559 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 64, elements: !350)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !556, file: !280, line: 162, baseType: !559, size: 64, offset: 64)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !556, file: !280, line: 163, baseType: !562, size: 32, offset: 128)
!562 = !DICompositeType(tag: DW_TAG_array_type, baseType: !256, size: 32, elements: !350)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !556, file: !280, line: 164, baseType: !562, size: 32, offset: 160)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !556, file: !280, line: 165, baseType: !565, size: 128, offset: 192)
!565 = !DICompositeType(tag: DW_TAG_array_type, baseType: !552, size: 128, elements: !350)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !556, file: !280, line: 166, baseType: !567, size: 128, offset: 320)
!567 = !DICompositeType(tag: DW_TAG_array_type, baseType: !529, size: 128, elements: !350)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !521, file: !357, line: 107, baseType: !223, size: 32, offset: 10368)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !521, file: !357, line: 108, baseType: !252, size: 32, offset: 10400)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !521, file: !357, line: 109, baseType: !256, size: 16, offset: 10432)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !521, file: !357, line: 110, baseType: !256, size: 16, offset: 10448)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !521, file: !357, line: 113, baseType: !252, size: 32, offset: 10464)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !521, file: !357, line: 113, baseType: !252, size: 32, offset: 10496)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !521, file: !357, line: 114, baseType: !299, size: 8, offset: 10528)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !521, file: !357, line: 114, baseType: !299, size: 8, offset: 10536)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !521, file: !357, line: 115, baseType: !256, size: 16, offset: 10544)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !521, file: !357, line: 116, baseType: !578, size: 128, offset: 10560)
!578 = !DICompositeType(tag: DW_TAG_array_type, baseType: !223, size: 128, elements: !579)
!579 = !{!433}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !521, file: !357, line: 119, baseType: !223, size: 32, offset: 10688)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !521, file: !357, line: 119, baseType: !223, size: 32, offset: 10720)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !521, file: !357, line: 122, baseType: !583, size: 512, offset: 10752)
!583 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !584, line: 182, baseType: !585)
!584 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!585 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !584, line: 180, size: 512, elements: !586)
!586 = !{!587}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !585, file: !584, line: 181, baseType: !327, size: 512)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !521, file: !357, line: 123, baseType: !299, size: 8, offset: 11264)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !521, file: !357, line: 125, baseType: !590, size: 56, offset: 11272)
!590 = !DICompositeType(tag: DW_TAG_array_type, baseType: !299, size: 56, elements: !591)
!591 = !{!592}
!592 = !DISubrange(count: 7)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !521, file: !357, line: 126, baseType: !594, size: 4096, offset: 11328)
!594 = !DICompositeType(tag: DW_TAG_array_type, baseType: !595, size: 4096, elements: !257)
!595 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !357, line: 69, baseType: !596)
!596 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !357, line: 67, size: 512, elements: !597)
!597 = !{!598}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !596, file: !357, line: 68, baseType: !327, size: 512)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "image_opacity", scope: !499, file: !4, line: 201, baseType: !223, size: 32, offset: 960)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !499, file: !4, line: 204, baseType: !252, size: 32, offset: 992)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !365, file: !4, line: 350, baseType: !245, size: 128, offset: 1984)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "objectnr", scope: !365, file: !4, line: 351, baseType: !252, size: 32, offset: 2112)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "tot_object", scope: !365, file: !4, line: 351, baseType: !252, size: 32, offset: 2144)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !365, file: !4, line: 353, baseType: !605, size: 64, offset: 2176)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!606 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStats", file: !4, line: 297, baseType: !607)
!607 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStats", file: !4, line: 295, size: 2048, elements: !608)
!608 = !{!609}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !607, file: !4, line: 296, baseType: !610, size: 2048)
!610 = !DICompositeType(tag: DW_TAG_array_type, baseType: !299, size: 2048, elements: !611)
!611 = !{!612}
!612 = !DISubrange(count: 256)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "dopesheet", scope: !365, file: !4, line: 355, baseType: !614, size: 384, offset: 2240)
!614 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingDopesheet", file: !4, line: 338, baseType: !615)
!615 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingDopesheet", file: !4, line: 322, size: 384, elements: !616)
!616 = !{!617, !618, !619, !620, !621, !622, !623}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !615, file: !4, line: 323, baseType: !252, size: 32)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "sort_method", scope: !615, file: !4, line: 325, baseType: !256, size: 16, offset: 32)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !615, file: !4, line: 326, baseType: !256, size: 16, offset: 48)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "coverage_segments", scope: !615, file: !4, line: 331, baseType: !245, size: 128, offset: 64)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !615, file: !4, line: 334, baseType: !245, size: 128, offset: 192)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "tot_channel", scope: !615, file: !4, line: 335, baseType: !252, size: 32, offset: 320)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !615, file: !4, line: 337, baseType: !252, size: 32, offset: 352)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "tracking_context", scope: !276, file: !269, line: 81, baseType: !222, size: 64, offset: 12224)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !276, file: !269, line: 85, baseType: !626, size: 6208, offset: 12288)
!626 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipProxy", file: !269, line: 55, size: 6208, elements: !627)
!627 = !{!628, !632, !633, !634, !635}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !626, file: !269, line: 56, baseType: !629, size: 6144)
!629 = !DICompositeType(tag: DW_TAG_array_type, baseType: !299, size: 6144, elements: !630)
!630 = !{!631}
!631 = !DISubrange(count: 768)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !626, file: !269, line: 58, baseType: !256, size: 16, offset: 6144)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !626, file: !269, line: 59, baseType: !256, size: 16, offset: 6160)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flag", scope: !626, file: !269, line: 60, baseType: !256, size: 16, offset: 6176)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flag", scope: !626, file: !269, line: 61, baseType: !256, size: 16, offset: 6192)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !276, file: !269, line: 86, baseType: !252, size: 32, offset: 18496)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !276, file: !269, line: 88, baseType: !252, size: 32, offset: 18528)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !276, file: !269, line: 90, baseType: !252, size: 32, offset: 18560)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "frame_offset", scope: !276, file: !269, line: 94, baseType: !252, size: 32, offset: 18592)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !276, file: !269, line: 100, baseType: !583, size: 512, offset: 18624)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "scopes", scope: !234, file: !233, line: 1085, baseType: !642, size: 1088, offset: 576)
!642 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipScopes", file: !269, line: 103, size: 1088, elements: !643)
!643 = !{!644, !645, !646, !647, !648, !649, !650, !653, !654, !655, !656, !657, !658, !659, !661}
!644 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !642, file: !269, line: 104, baseType: !256, size: 16)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "use_track_mask", scope: !642, file: !269, line: 105, baseType: !256, size: 16, offset: 16)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "track_preview_height", scope: !642, file: !269, line: 106, baseType: !252, size: 32, offset: 32)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "frame_width", scope: !642, file: !269, line: 107, baseType: !252, size: 32, offset: 64)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "frame_height", scope: !642, file: !269, line: 107, baseType: !252, size: 32, offset: 96)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "undist_marker", scope: !642, file: !269, line: 108, baseType: !461, size: 512, offset: 128)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "track_search", scope: !642, file: !269, line: 109, baseType: !651, size: 64, offset: 640)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64)
!652 = !DICompositeType(tag: DW_TAG_structure_type, name: "ImBuf", file: !584, line: 136, flags: DIFlagFwdDecl)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "track_preview", scope: !642, file: !269, line: 110, baseType: !651, size: 64, offset: 704)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "track_pos", scope: !642, file: !269, line: 111, baseType: !408, size: 64, offset: 768)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "track_disabled", scope: !642, file: !269, line: 112, baseType: !256, size: 16, offset: 832)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "track_locked", scope: !642, file: !269, line: 113, baseType: !256, size: 16, offset: 848)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !642, file: !269, line: 114, baseType: !252, size: 32, offset: 864)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !642, file: !269, line: 115, baseType: !448, size: 64, offset: 896)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "marker", scope: !642, file: !269, line: 116, baseType: !660, size: 64, offset: 960)
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "slide_scale", scope: !642, file: !269, line: 117, baseType: !408, size: 64, offset: 1024)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !234, file: !233, line: 1087, baseType: !252, size: 32, offset: 1664)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !234, file: !233, line: 1088, baseType: !256, size: 16, offset: 1696)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !234, file: !233, line: 1089, baseType: !256, size: 16, offset: 1712)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "path_length", scope: !234, file: !233, line: 1091, baseType: !252, size: 32, offset: 1728)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !234, file: !233, line: 1094, baseType: !408, size: 64, offset: 1760)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !234, file: !233, line: 1094, baseType: !223, size: 32, offset: 1824)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "angle", scope: !234, file: !233, line: 1094, baseType: !223, size: 32, offset: 1856)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !234, file: !233, line: 1095, baseType: !252, size: 32, offset: 1888)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "stabmat", scope: !234, file: !233, line: 1096, baseType: !431, size: 512, offset: 1920)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "unistabmat", scope: !234, file: !233, line: 1096, baseType: !431, size: 512, offset: 2432)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "postproc_flag", scope: !234, file: !233, line: 1100, baseType: !252, size: 32, offset: 2944)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "gpencil_src", scope: !234, file: !233, line: 1103, baseType: !256, size: 16, offset: 2976)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !234, file: !233, line: 1103, baseType: !256, size: 16, offset: 2992)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "around", scope: !234, file: !233, line: 1105, baseType: !252, size: 32, offset: 3008)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "pad4", scope: !234, file: !233, line: 1105, baseType: !252, size: 32, offset: 3040)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !234, file: !233, line: 1107, baseType: !408, size: 64, offset: 3072)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "mask_info", scope: !234, file: !233, line: 1109, baseType: !679, size: 128, offset: 3136)
!679 = !DIDerivedType(tag: DW_TAG_typedef, name: "MaskSpaceInfo", file: !233, line: 554, baseType: !680)
!680 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MaskSpaceInfo", file: !233, line: 545, size: 128, elements: !681)
!681 = !{!682, !686, !687, !688, !689}
!682 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !680, file: !233, line: 548, baseType: !683, size: 64)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 64)
!684 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mask", file: !685, line: 264, flags: DIFlagFwdDecl)
!685 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_context.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!686 = !DIDerivedType(tag: DW_TAG_member, name: "draw_flag", scope: !680, file: !233, line: 550, baseType: !299, size: 8, offset: 64)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "draw_type", scope: !680, file: !233, line: 551, baseType: !299, size: 8, offset: 72)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "overlay_mode", scope: !680, file: !233, line: 552, baseType: !299, size: 8, offset: 80)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !680, file: !233, line: 553, baseType: !690, size: 40, offset: 88)
!690 = !DICompositeType(tag: DW_TAG_array_type, baseType: !299, size: 40, elements: !691)
!691 = !{!692}
!692 = !DISubrange(count: 5)
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 64)
!694 = !DISubroutineType(types: !695)
!695 = !{null, !222, !443, !459, !252, !252, !223}
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 64)
!697 = !DISubroutineType(types: !698)
!698 = !{null, !222, !443, !252}
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !700, size: 64)
!700 = !DISubroutineType(types: !701)
!701 = !{null, !222, !252}
!702 = !{}
!703 = !DILocalVariable(name: "sc", arg: 1, scope: !228, file: !1, line: 67, type: !231)
!704 = !DILocation(line: 67, column: 20, scope: !228)
!705 = !DILocalVariable(name: "track", arg: 2, scope: !228, file: !1, line: 67, type: !443)
!706 = !DILocation(line: 67, column: 44, scope: !228)
!707 = !DILocalVariable(name: "userdata", arg: 3, scope: !228, file: !1, line: 67, type: !222)
!708 = !DILocation(line: 67, column: 57, scope: !228)
!709 = !DILocalVariable(name: "func", arg: 4, scope: !228, file: !1, line: 68, type: !693)
!710 = !DILocation(line: 68, column: 16, scope: !228)
!711 = !DILocalVariable(name: "segment_start", arg: 5, scope: !228, file: !1, line: 70, type: !696)
!712 = !DILocation(line: 70, column: 16, scope: !228)
!713 = !DILocalVariable(name: "segment_end", arg: 6, scope: !228, file: !1, line: 71, type: !699)
!714 = !DILocation(line: 71, column: 16, scope: !228)
!715 = !DILocalVariable(name: "clip", scope: !228, file: !1, line: 73, type: !716)
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 64)
!717 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieClip", file: !269, line: 101, baseType: !276)
!718 = !DILocation(line: 73, column: 13, scope: !228)
!719 = !DILocation(line: 73, column: 43, scope: !228)
!720 = !DILocation(line: 73, column: 20, scope: !228)
!721 = !DILocalVariable(name: "width", scope: !228, file: !1, line: 74, type: !252)
!722 = !DILocation(line: 74, column: 6, scope: !228)
!723 = !DILocalVariable(name: "height", scope: !228, file: !1, line: 74, type: !252)
!724 = !DILocation(line: 74, column: 13, scope: !228)
!725 = !DILocalVariable(name: "coord", scope: !228, file: !1, line: 74, type: !252)
!726 = !DILocation(line: 74, column: 21, scope: !228)
!727 = !DILocation(line: 76, column: 25, scope: !228)
!728 = !DILocation(line: 76, column: 32, scope: !228)
!729 = !DILocation(line: 76, column: 36, scope: !228)
!730 = !DILocation(line: 76, column: 2, scope: !228)
!731 = !DILocation(line: 78, column: 13, scope: !732)
!732 = distinct !DILexicalBlock(scope: !228, file: !1, line: 78, column: 2)
!733 = !DILocation(line: 78, column: 7, scope: !732)
!734 = !DILocation(line: 78, column: 18, scope: !735)
!735 = distinct !DILexicalBlock(scope: !732, file: !1, line: 78, column: 2)
!736 = !DILocation(line: 78, column: 24, scope: !735)
!737 = !DILocation(line: 78, column: 2, scope: !732)
!738 = !DILocalVariable(name: "i", scope: !739, file: !1, line: 79, type: !252)
!739 = distinct !DILexicalBlock(scope: !735, file: !1, line: 78, column: 38)
!740 = !DILocation(line: 79, column: 7, scope: !739)
!741 = !DILocalVariable(name: "prevfra", scope: !739, file: !1, line: 79, type: !252)
!742 = !DILocation(line: 79, column: 10, scope: !739)
!743 = !DILocalVariable(name: "open", scope: !739, file: !1, line: 80, type: !744)
!744 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!745 = !DILocation(line: 80, column: 8, scope: !739)
!746 = !DILocalVariable(name: "prevval", scope: !739, file: !1, line: 81, type: !223)
!747 = !DILocation(line: 81, column: 9, scope: !739)
!748 = !DILocation(line: 83, column: 10, scope: !749)
!749 = distinct !DILexicalBlock(scope: !739, file: !1, line: 83, column: 3)
!750 = !DILocation(line: 83, column: 8, scope: !749)
!751 = !DILocation(line: 83, column: 15, scope: !752)
!752 = distinct !DILexicalBlock(scope: !749, file: !1, line: 83, column: 3)
!753 = !DILocation(line: 83, column: 19, scope: !752)
!754 = !DILocation(line: 83, column: 26, scope: !752)
!755 = !DILocation(line: 83, column: 17, scope: !752)
!756 = !DILocation(line: 83, column: 3, scope: !749)
!757 = !DILocalVariable(name: "marker", scope: !758, file: !1, line: 84, type: !459)
!758 = distinct !DILexicalBlock(scope: !752, file: !1, line: 83, column: 42)
!759 = !DILocation(line: 84, column: 25, scope: !758)
!760 = !DILocation(line: 84, column: 35, scope: !758)
!761 = !DILocation(line: 84, column: 42, scope: !758)
!762 = !DILocation(line: 84, column: 50, scope: !758)
!763 = !DILocalVariable(name: "val", scope: !758, file: !1, line: 85, type: !223)
!764 = !DILocation(line: 85, column: 10, scope: !758)
!765 = !DILocation(line: 87, column: 8, scope: !766)
!766 = distinct !DILexicalBlock(scope: !758, file: !1, line: 87, column: 8)
!767 = !DILocation(line: 87, column: 16, scope: !766)
!768 = !DILocation(line: 87, column: 21, scope: !766)
!769 = !DILocation(line: 87, column: 8, scope: !758)
!770 = !DILocation(line: 88, column: 9, scope: !771)
!771 = distinct !DILexicalBlock(scope: !772, file: !1, line: 88, column: 9)
!772 = distinct !DILexicalBlock(scope: !766, file: !1, line: 87, column: 40)
!773 = !DILocation(line: 88, column: 9, scope: !772)
!774 = !DILocation(line: 89, column: 10, scope: !775)
!775 = distinct !DILexicalBlock(scope: !776, file: !1, line: 89, column: 10)
!776 = distinct !DILexicalBlock(scope: !771, file: !1, line: 88, column: 15)
!777 = !DILocation(line: 89, column: 10, scope: !776)
!778 = !DILocation(line: 90, column: 7, scope: !775)
!779 = !DILocation(line: 90, column: 19, scope: !775)
!780 = !DILocation(line: 90, column: 29, scope: !775)
!781 = !DILocation(line: 92, column: 11, scope: !776)
!782 = !DILocation(line: 93, column: 5, scope: !776)
!783 = !DILocation(line: 95, column: 5, scope: !772)
!784 = !DILocation(line: 98, column: 9, scope: !785)
!785 = distinct !DILexicalBlock(scope: !758, file: !1, line: 98, column: 8)
!786 = !DILocation(line: 98, column: 8, scope: !758)
!787 = !DILocation(line: 99, column: 9, scope: !788)
!788 = distinct !DILexicalBlock(scope: !789, file: !1, line: 99, column: 9)
!789 = distinct !DILexicalBlock(scope: !785, file: !1, line: 98, column: 15)
!790 = !DILocation(line: 99, column: 9, scope: !789)
!791 = !DILocation(line: 100, column: 6, scope: !788)
!792 = !DILocation(line: 100, column: 20, scope: !788)
!793 = !DILocation(line: 100, column: 30, scope: !788)
!794 = !DILocation(line: 100, column: 37, scope: !788)
!795 = !DILocation(line: 102, column: 10, scope: !789)
!796 = !DILocation(line: 103, column: 15, scope: !789)
!797 = !DILocation(line: 103, column: 23, scope: !789)
!798 = !DILocation(line: 103, column: 27, scope: !789)
!799 = !DILocation(line: 103, column: 13, scope: !789)
!800 = !DILocation(line: 104, column: 4, scope: !789)
!801 = !DILocation(line: 107, column: 11, scope: !758)
!802 = !DILocation(line: 107, column: 19, scope: !758)
!803 = !DILocation(line: 107, column: 23, scope: !758)
!804 = !DILocation(line: 107, column: 32, scope: !758)
!805 = !DILocation(line: 107, column: 30, scope: !758)
!806 = !DILocation(line: 107, column: 45, scope: !758)
!807 = !DILocation(line: 107, column: 51, scope: !758)
!808 = !DILocation(line: 107, column: 44, scope: !758)
!809 = !DILocation(line: 107, column: 60, scope: !758)
!810 = !DILocation(line: 107, column: 70, scope: !758)
!811 = !DILocation(line: 107, column: 43, scope: !758)
!812 = !DILocation(line: 107, column: 41, scope: !758)
!813 = !DILocation(line: 107, column: 8, scope: !758)
!814 = !DILocation(line: 108, column: 11, scope: !758)
!815 = !DILocation(line: 108, column: 19, scope: !758)
!816 = !DILocation(line: 108, column: 29, scope: !758)
!817 = !DILocation(line: 108, column: 27, scope: !758)
!818 = !DILocation(line: 108, column: 8, scope: !758)
!819 = !DILocation(line: 110, column: 8, scope: !820)
!820 = distinct !DILexicalBlock(scope: !758, file: !1, line: 110, column: 8)
!821 = !DILocation(line: 110, column: 8, scope: !758)
!822 = !DILocalVariable(name: "scene_framenr", scope: !823, file: !1, line: 111, type: !252)
!823 = distinct !DILexicalBlock(scope: !820, file: !1, line: 110, column: 14)
!824 = !DILocation(line: 111, column: 9, scope: !823)
!825 = !DILocation(line: 111, column: 65, scope: !823)
!826 = !DILocation(line: 111, column: 71, scope: !823)
!827 = !DILocation(line: 111, column: 79, scope: !823)
!828 = !DILocation(line: 111, column: 25, scope: !823)
!829 = !DILocation(line: 113, column: 5, scope: !823)
!830 = !DILocation(line: 113, column: 10, scope: !823)
!831 = !DILocation(line: 113, column: 20, scope: !823)
!832 = !DILocation(line: 113, column: 27, scope: !823)
!833 = !DILocation(line: 113, column: 35, scope: !823)
!834 = !DILocation(line: 113, column: 42, scope: !823)
!835 = !DILocation(line: 113, column: 57, scope: !823)
!836 = !DILocation(line: 114, column: 4, scope: !823)
!837 = !DILocation(line: 116, column: 14, scope: !758)
!838 = !DILocation(line: 116, column: 22, scope: !758)
!839 = !DILocation(line: 116, column: 26, scope: !758)
!840 = !DILocation(line: 116, column: 12, scope: !758)
!841 = !DILocation(line: 117, column: 14, scope: !758)
!842 = !DILocation(line: 117, column: 22, scope: !758)
!843 = !DILocation(line: 117, column: 12, scope: !758)
!844 = !DILocation(line: 118, column: 3, scope: !758)
!845 = !DILocation(line: 83, column: 38, scope: !752)
!846 = !DILocation(line: 83, column: 3, scope: !752)
!847 = distinct !{!847, !756, !848}
!848 = !DILocation(line: 118, column: 3, scope: !749)
!849 = !DILocation(line: 120, column: 7, scope: !850)
!850 = distinct !DILexicalBlock(scope: !739, file: !1, line: 120, column: 7)
!851 = !DILocation(line: 120, column: 7, scope: !739)
!852 = !DILocation(line: 121, column: 8, scope: !853)
!853 = distinct !DILexicalBlock(scope: !854, file: !1, line: 121, column: 8)
!854 = distinct !DILexicalBlock(scope: !850, file: !1, line: 120, column: 13)
!855 = !DILocation(line: 121, column: 8, scope: !854)
!856 = !DILocation(line: 122, column: 5, scope: !853)
!857 = !DILocation(line: 122, column: 17, scope: !853)
!858 = !DILocation(line: 122, column: 27, scope: !853)
!859 = !DILocation(line: 123, column: 3, scope: !854)
!860 = !DILocation(line: 124, column: 2, scope: !739)
!861 = !DILocation(line: 78, column: 34, scope: !735)
!862 = !DILocation(line: 78, column: 2, scope: !735)
!863 = distinct !{!863, !737, !864}
!864 = !DILocation(line: 124, column: 2, scope: !732)
!865 = !DILocation(line: 125, column: 1, scope: !228)
!866 = distinct !DISubprogram(name: "clip_graph_tracking_values_iterate", scope: !1, file: !1, line: 127, type: !867, scopeLine: 133, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !702)
!867 = !DISubroutineType(types: !868)
!868 = !{null, !231, !744, !744, !222, !693, !696, !699}
!869 = !DILocalVariable(name: "sc", arg: 1, scope: !866, file: !1, line: 128, type: !231)
!870 = !DILocation(line: 128, column: 20, scope: !866)
!871 = !DILocalVariable(name: "selected_only", arg: 2, scope: !866, file: !1, line: 128, type: !744)
!872 = !DILocation(line: 128, column: 29, scope: !866)
!873 = !DILocalVariable(name: "include_hidden", arg: 3, scope: !866, file: !1, line: 128, type: !744)
!874 = !DILocation(line: 128, column: 49, scope: !866)
!875 = !DILocalVariable(name: "userdata", arg: 4, scope: !866, file: !1, line: 128, type: !222)
!876 = !DILocation(line: 128, column: 71, scope: !866)
!877 = !DILocalVariable(name: "func", arg: 5, scope: !866, file: !1, line: 129, type: !693)
!878 = !DILocation(line: 129, column: 16, scope: !866)
!879 = !DILocalVariable(name: "segment_start", arg: 6, scope: !866, file: !1, line: 131, type: !696)
!880 = !DILocation(line: 131, column: 16, scope: !866)
!881 = !DILocalVariable(name: "segment_end", arg: 7, scope: !866, file: !1, line: 132, type: !699)
!882 = !DILocation(line: 132, column: 16, scope: !866)
!883 = !DILocalVariable(name: "clip", scope: !866, file: !1, line: 134, type: !716)
!884 = !DILocation(line: 134, column: 13, scope: !866)
!885 = !DILocation(line: 134, column: 43, scope: !866)
!886 = !DILocation(line: 134, column: 20, scope: !866)
!887 = !DILocalVariable(name: "tracking", scope: !866, file: !1, line: 135, type: !888)
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 64)
!889 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTracking", file: !4, line: 356, baseType: !365)
!890 = !DILocation(line: 135, column: 17, scope: !866)
!891 = !DILocation(line: 135, column: 29, scope: !866)
!892 = !DILocation(line: 135, column: 35, scope: !866)
!893 = !DILocalVariable(name: "tracksbase", scope: !866, file: !1, line: 136, type: !894)
!894 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!895 = !DILocation(line: 136, column: 12, scope: !866)
!896 = !DILocation(line: 136, column: 56, scope: !866)
!897 = !DILocation(line: 136, column: 25, scope: !866)
!898 = !DILocalVariable(name: "track", scope: !866, file: !1, line: 137, type: !443)
!899 = !DILocation(line: 137, column: 22, scope: !866)
!900 = !DILocation(line: 139, column: 15, scope: !901)
!901 = distinct !DILexicalBlock(scope: !866, file: !1, line: 139, column: 2)
!902 = !DILocation(line: 139, column: 27, scope: !901)
!903 = !DILocation(line: 139, column: 13, scope: !901)
!904 = !DILocation(line: 139, column: 7, scope: !901)
!905 = !DILocation(line: 139, column: 34, scope: !906)
!906 = distinct !DILexicalBlock(scope: !901, file: !1, line: 139, column: 2)
!907 = !DILocation(line: 139, column: 2, scope: !901)
!908 = !DILocation(line: 140, column: 8, scope: !909)
!909 = distinct !DILexicalBlock(scope: !910, file: !1, line: 140, column: 7)
!910 = distinct !DILexicalBlock(scope: !906, file: !1, line: 139, column: 62)
!911 = !DILocation(line: 140, column: 23, scope: !909)
!912 = !DILocation(line: 140, column: 27, scope: !909)
!913 = !DILocation(line: 140, column: 34, scope: !909)
!914 = !DILocation(line: 140, column: 39, scope: !909)
!915 = !DILocation(line: 140, column: 55, scope: !909)
!916 = !DILocation(line: 140, column: 7, scope: !910)
!917 = !DILocation(line: 141, column: 4, scope: !909)
!918 = !DILocation(line: 143, column: 7, scope: !919)
!919 = distinct !DILexicalBlock(scope: !910, file: !1, line: 143, column: 7)
!920 = !DILocation(line: 143, column: 21, scope: !919)
!921 = !DILocation(line: 143, column: 25, scope: !919)
!922 = !DILocation(line: 143, column: 7, scope: !910)
!923 = !DILocation(line: 144, column: 4, scope: !919)
!924 = !DILocation(line: 146, column: 44, scope: !910)
!925 = !DILocation(line: 146, column: 48, scope: !910)
!926 = !DILocation(line: 146, column: 55, scope: !910)
!927 = !DILocation(line: 146, column: 65, scope: !910)
!928 = !DILocation(line: 146, column: 71, scope: !910)
!929 = !DILocation(line: 146, column: 86, scope: !910)
!930 = !DILocation(line: 146, column: 3, scope: !910)
!931 = !DILocation(line: 147, column: 2, scope: !910)
!932 = !DILocation(line: 139, column: 49, scope: !906)
!933 = !DILocation(line: 139, column: 56, scope: !906)
!934 = !DILocation(line: 139, column: 47, scope: !906)
!935 = !DILocation(line: 139, column: 2, scope: !906)
!936 = distinct !{!936, !907, !937}
!937 = !DILocation(line: 147, column: 2, scope: !901)
!938 = !DILocation(line: 148, column: 1, scope: !866)
!939 = distinct !DISubprogram(name: "clip_graph_tracking_iterate", scope: !1, file: !1, line: 150, type: !940, scopeLine: 152, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !702)
!940 = !DISubroutineType(types: !941)
!941 = !{null, !231, !744, !744, !222, !942}
!942 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 64)
!943 = !DISubroutineType(types: !944)
!944 = !{null, !222, !459}
!945 = !DILocalVariable(name: "sc", arg: 1, scope: !939, file: !1, line: 150, type: !231)
!946 = !DILocation(line: 150, column: 45, scope: !939)
!947 = !DILocalVariable(name: "selected_only", arg: 2, scope: !939, file: !1, line: 150, type: !744)
!948 = !DILocation(line: 150, column: 54, scope: !939)
!949 = !DILocalVariable(name: "include_hidden", arg: 3, scope: !939, file: !1, line: 150, type: !744)
!950 = !DILocation(line: 150, column: 74, scope: !939)
!951 = !DILocalVariable(name: "userdata", arg: 4, scope: !939, file: !1, line: 150, type: !222)
!952 = !DILocation(line: 150, column: 96, scope: !939)
!953 = !DILocalVariable(name: "func", arg: 5, scope: !939, file: !1, line: 151, type: !942)
!954 = !DILocation(line: 151, column: 41, scope: !939)
!955 = !DILocalVariable(name: "clip", scope: !939, file: !1, line: 153, type: !716)
!956 = !DILocation(line: 153, column: 13, scope: !939)
!957 = !DILocation(line: 153, column: 43, scope: !939)
!958 = !DILocation(line: 153, column: 20, scope: !939)
!959 = !DILocalVariable(name: "tracking", scope: !939, file: !1, line: 154, type: !888)
!960 = !DILocation(line: 154, column: 17, scope: !939)
!961 = !DILocation(line: 154, column: 29, scope: !939)
!962 = !DILocation(line: 154, column: 35, scope: !939)
!963 = !DILocalVariable(name: "tracksbase", scope: !939, file: !1, line: 155, type: !894)
!964 = !DILocation(line: 155, column: 12, scope: !939)
!965 = !DILocation(line: 155, column: 56, scope: !939)
!966 = !DILocation(line: 155, column: 25, scope: !939)
!967 = !DILocalVariable(name: "track", scope: !939, file: !1, line: 156, type: !443)
!968 = !DILocation(line: 156, column: 22, scope: !939)
!969 = !DILocation(line: 158, column: 15, scope: !970)
!970 = distinct !DILexicalBlock(scope: !939, file: !1, line: 158, column: 2)
!971 = !DILocation(line: 158, column: 27, scope: !970)
!972 = !DILocation(line: 158, column: 13, scope: !970)
!973 = !DILocation(line: 158, column: 7, scope: !970)
!974 = !DILocation(line: 158, column: 34, scope: !975)
!975 = distinct !DILexicalBlock(scope: !970, file: !1, line: 158, column: 2)
!976 = !DILocation(line: 158, column: 2, scope: !970)
!977 = !DILocalVariable(name: "i", scope: !978, file: !1, line: 159, type: !252)
!978 = distinct !DILexicalBlock(scope: !975, file: !1, line: 158, column: 62)
!979 = !DILocation(line: 159, column: 7, scope: !978)
!980 = !DILocation(line: 161, column: 8, scope: !981)
!981 = distinct !DILexicalBlock(scope: !978, file: !1, line: 161, column: 7)
!982 = !DILocation(line: 161, column: 23, scope: !981)
!983 = !DILocation(line: 161, column: 27, scope: !981)
!984 = !DILocation(line: 161, column: 34, scope: !981)
!985 = !DILocation(line: 161, column: 39, scope: !981)
!986 = !DILocation(line: 161, column: 55, scope: !981)
!987 = !DILocation(line: 161, column: 7, scope: !978)
!988 = !DILocation(line: 162, column: 4, scope: !981)
!989 = !DILocation(line: 164, column: 7, scope: !990)
!990 = distinct !DILexicalBlock(scope: !978, file: !1, line: 164, column: 7)
!991 = !DILocation(line: 164, column: 21, scope: !990)
!992 = !DILocation(line: 164, column: 25, scope: !990)
!993 = !DILocation(line: 164, column: 7, scope: !978)
!994 = !DILocation(line: 165, column: 4, scope: !990)
!995 = !DILocation(line: 167, column: 10, scope: !996)
!996 = distinct !DILexicalBlock(scope: !978, file: !1, line: 167, column: 3)
!997 = !DILocation(line: 167, column: 8, scope: !996)
!998 = !DILocation(line: 167, column: 15, scope: !999)
!999 = distinct !DILexicalBlock(scope: !996, file: !1, line: 167, column: 3)
!1000 = !DILocation(line: 167, column: 19, scope: !999)
!1001 = !DILocation(line: 167, column: 26, scope: !999)
!1002 = !DILocation(line: 167, column: 17, scope: !999)
!1003 = !DILocation(line: 167, column: 3, scope: !996)
!1004 = !DILocalVariable(name: "marker", scope: !1005, file: !1, line: 168, type: !459)
!1005 = distinct !DILexicalBlock(scope: !999, file: !1, line: 167, column: 42)
!1006 = !DILocation(line: 168, column: 25, scope: !1005)
!1007 = !DILocation(line: 168, column: 35, scope: !1005)
!1008 = !DILocation(line: 168, column: 42, scope: !1005)
!1009 = !DILocation(line: 168, column: 50, scope: !1005)
!1010 = !DILocation(line: 170, column: 8, scope: !1011)
!1011 = distinct !DILexicalBlock(scope: !1005, file: !1, line: 170, column: 8)
!1012 = !DILocation(line: 170, column: 16, scope: !1011)
!1013 = !DILocation(line: 170, column: 21, scope: !1011)
!1014 = !DILocation(line: 170, column: 8, scope: !1005)
!1015 = !DILocation(line: 171, column: 5, scope: !1011)
!1016 = !DILocation(line: 173, column: 8, scope: !1017)
!1017 = distinct !DILexicalBlock(scope: !1005, file: !1, line: 173, column: 8)
!1018 = !DILocation(line: 173, column: 8, scope: !1005)
!1019 = !DILocation(line: 174, column: 5, scope: !1017)
!1020 = !DILocation(line: 174, column: 10, scope: !1017)
!1021 = !DILocation(line: 174, column: 20, scope: !1017)
!1022 = !DILocation(line: 175, column: 3, scope: !1005)
!1023 = !DILocation(line: 167, column: 38, scope: !999)
!1024 = !DILocation(line: 167, column: 3, scope: !999)
!1025 = distinct !{!1025, !1003, !1026}
!1026 = !DILocation(line: 175, column: 3, scope: !996)
!1027 = !DILocation(line: 176, column: 2, scope: !978)
!1028 = !DILocation(line: 158, column: 49, scope: !975)
!1029 = !DILocation(line: 158, column: 56, scope: !975)
!1030 = !DILocation(line: 158, column: 47, scope: !975)
!1031 = !DILocation(line: 158, column: 2, scope: !975)
!1032 = distinct !{!1032, !976, !1033}
!1033 = !DILocation(line: 176, column: 2, scope: !970)
!1034 = !DILocation(line: 177, column: 1, scope: !939)
!1035 = distinct !DISubprogram(name: "clip_delete_track", scope: !1, file: !1, line: 179, type: !1036, scopeLine: 180, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !702)
!1036 = !DISubroutineType(types: !1037)
!1037 = !{null, !1038, !716, !443}
!1038 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 64)
!1039 = !DIDerivedType(tag: DW_TAG_typedef, name: "bContext", file: !685, line: 69, baseType: !1040)
!1040 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !1041, line: 40, flags: DIFlagFwdDecl)
!1041 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_animsys.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1042 = !DILocalVariable(name: "C", arg: 1, scope: !1035, file: !1, line: 179, type: !1038)
!1043 = !DILocation(line: 179, column: 34, scope: !1035)
!1044 = !DILocalVariable(name: "clip", arg: 2, scope: !1035, file: !1, line: 179, type: !716)
!1045 = !DILocation(line: 179, column: 48, scope: !1035)
!1046 = !DILocalVariable(name: "track", arg: 3, scope: !1035, file: !1, line: 179, type: !443)
!1047 = !DILocation(line: 179, column: 74, scope: !1035)
!1048 = !DILocalVariable(name: "tracking", scope: !1035, file: !1, line: 181, type: !888)
!1049 = !DILocation(line: 181, column: 17, scope: !1035)
!1050 = !DILocation(line: 181, column: 29, scope: !1035)
!1051 = !DILocation(line: 181, column: 35, scope: !1035)
!1052 = !DILocalVariable(name: "stab", scope: !1035, file: !1, line: 182, type: !1053)
!1053 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!1054 = !DILocation(line: 182, column: 30, scope: !1035)
!1055 = !DILocation(line: 182, column: 38, scope: !1035)
!1056 = !DILocation(line: 182, column: 48, scope: !1035)
!1057 = !DILocalVariable(name: "act_track", scope: !1035, file: !1, line: 183, type: !443)
!1058 = !DILocation(line: 183, column: 22, scope: !1035)
!1059 = !DILocation(line: 183, column: 64, scope: !1035)
!1060 = !DILocation(line: 183, column: 34, scope: !1035)
!1061 = !DILocalVariable(name: "plane_track", scope: !1035, file: !1, line: 184, type: !497)
!1062 = !DILocation(line: 184, column: 27, scope: !1035)
!1063 = !DILocalVariable(name: "next_plane_track", scope: !1035, file: !1, line: 184, type: !497)
!1064 = !DILocation(line: 184, column: 41, scope: !1035)
!1065 = !DILocalVariable(name: "tracksbase", scope: !1035, file: !1, line: 185, type: !894)
!1066 = !DILocation(line: 185, column: 12, scope: !1035)
!1067 = !DILocation(line: 185, column: 56, scope: !1035)
!1068 = !DILocation(line: 185, column: 25, scope: !1035)
!1069 = !DILocalVariable(name: "plane_tracks_base", scope: !1035, file: !1, line: 186, type: !894)
!1070 = !DILocation(line: 186, column: 12, scope: !1035)
!1071 = !DILocation(line: 186, column: 69, scope: !1035)
!1072 = !DILocation(line: 186, column: 32, scope: !1035)
!1073 = !DILocalVariable(name: "has_bundle", scope: !1035, file: !1, line: 187, type: !744)
!1074 = !DILocation(line: 187, column: 7, scope: !1035)
!1075 = !DILocalVariable(name: "update_stab", scope: !1035, file: !1, line: 187, type: !744)
!1076 = !DILocation(line: 187, column: 27, scope: !1035)
!1077 = !DILocalVariable(name: "track_name_escaped", scope: !1035, file: !1, line: 188, type: !327)
!1078 = !DILocation(line: 188, column: 7, scope: !1035)
!1079 = !DILocalVariable(name: "prefix", scope: !1035, file: !1, line: 188, type: !1080)
!1080 = !DICompositeType(tag: DW_TAG_array_type, baseType: !299, size: 1024, elements: !1081)
!1081 = !{!1082}
!1082 = !DISubrange(count: 128)
!1083 = !DILocation(line: 188, column: 37, scope: !1035)
!1084 = !DILocation(line: 190, column: 6, scope: !1085)
!1085 = distinct !DILexicalBlock(scope: !1035, file: !1, line: 190, column: 6)
!1086 = !DILocation(line: 190, column: 15, scope: !1085)
!1087 = !DILocation(line: 190, column: 12, scope: !1085)
!1088 = !DILocation(line: 190, column: 6, scope: !1035)
!1089 = !DILocation(line: 191, column: 3, scope: !1085)
!1090 = !DILocation(line: 191, column: 13, scope: !1085)
!1091 = !DILocation(line: 191, column: 23, scope: !1085)
!1092 = !DILocation(line: 193, column: 6, scope: !1093)
!1093 = distinct !DILexicalBlock(scope: !1035, file: !1, line: 193, column: 6)
!1094 = !DILocation(line: 193, column: 15, scope: !1093)
!1095 = !DILocation(line: 193, column: 21, scope: !1093)
!1096 = !DILocation(line: 193, column: 12, scope: !1093)
!1097 = !DILocation(line: 193, column: 6, scope: !1035)
!1098 = !DILocation(line: 194, column: 3, scope: !1099)
!1099 = distinct !DILexicalBlock(scope: !1093, file: !1, line: 193, column: 32)
!1100 = !DILocation(line: 194, column: 9, scope: !1099)
!1101 = !DILocation(line: 194, column: 19, scope: !1099)
!1102 = !DILocation(line: 196, column: 15, scope: !1099)
!1103 = !DILocation(line: 197, column: 2, scope: !1099)
!1104 = !DILocation(line: 200, column: 6, scope: !1105)
!1105 = distinct !DILexicalBlock(scope: !1035, file: !1, line: 200, column: 6)
!1106 = !DILocation(line: 200, column: 13, scope: !1105)
!1107 = !DILocation(line: 200, column: 18, scope: !1105)
!1108 = !DILocation(line: 200, column: 6, scope: !1035)
!1109 = !DILocation(line: 201, column: 14, scope: !1105)
!1110 = !DILocation(line: 201, column: 3, scope: !1105)
!1111 = !DILocation(line: 204, column: 21, scope: !1112)
!1112 = distinct !DILexicalBlock(scope: !1035, file: !1, line: 204, column: 2)
!1113 = !DILocation(line: 204, column: 40, scope: !1112)
!1114 = !DILocation(line: 204, column: 19, scope: !1112)
!1115 = !DILocation(line: 204, column: 7, scope: !1112)
!1116 = !DILocation(line: 205, column: 7, scope: !1117)
!1117 = distinct !DILexicalBlock(scope: !1112, file: !1, line: 204, column: 2)
!1118 = !DILocation(line: 204, column: 2, scope: !1112)
!1119 = !DILocalVariable(name: "found", scope: !1120, file: !1, line: 208, type: !744)
!1120 = distinct !DILexicalBlock(scope: !1117, file: !1, line: 207, column: 2)
!1121 = !DILocation(line: 208, column: 8, scope: !1120)
!1122 = !DILocalVariable(name: "i", scope: !1120, file: !1, line: 209, type: !252)
!1123 = !DILocation(line: 209, column: 7, scope: !1120)
!1124 = !DILocation(line: 211, column: 22, scope: !1120)
!1125 = !DILocation(line: 211, column: 35, scope: !1120)
!1126 = !DILocation(line: 211, column: 20, scope: !1120)
!1127 = !DILocation(line: 213, column: 10, scope: !1128)
!1128 = distinct !DILexicalBlock(scope: !1120, file: !1, line: 213, column: 3)
!1129 = !DILocation(line: 213, column: 8, scope: !1128)
!1130 = !DILocation(line: 213, column: 15, scope: !1131)
!1131 = distinct !DILexicalBlock(scope: !1128, file: !1, line: 213, column: 3)
!1132 = !DILocation(line: 213, column: 19, scope: !1131)
!1133 = !DILocation(line: 213, column: 32, scope: !1131)
!1134 = !DILocation(line: 213, column: 17, scope: !1131)
!1135 = !DILocation(line: 213, column: 3, scope: !1128)
!1136 = !DILocation(line: 214, column: 8, scope: !1137)
!1137 = distinct !DILexicalBlock(scope: !1138, file: !1, line: 214, column: 8)
!1138 = distinct !DILexicalBlock(scope: !1131, file: !1, line: 213, column: 53)
!1139 = !DILocation(line: 214, column: 21, scope: !1137)
!1140 = !DILocation(line: 214, column: 34, scope: !1137)
!1141 = !DILocation(line: 214, column: 40, scope: !1137)
!1142 = !DILocation(line: 214, column: 37, scope: !1137)
!1143 = !DILocation(line: 214, column: 8, scope: !1138)
!1144 = !DILocation(line: 215, column: 11, scope: !1145)
!1145 = distinct !DILexicalBlock(scope: !1137, file: !1, line: 214, column: 47)
!1146 = !DILocation(line: 216, column: 5, scope: !1145)
!1147 = !DILocation(line: 218, column: 3, scope: !1138)
!1148 = !DILocation(line: 213, column: 49, scope: !1131)
!1149 = !DILocation(line: 213, column: 3, scope: !1131)
!1150 = distinct !{!1150, !1135, !1151}
!1151 = !DILocation(line: 218, column: 3, scope: !1128)
!1152 = !DILocation(line: 220, column: 8, scope: !1153)
!1153 = distinct !DILexicalBlock(scope: !1120, file: !1, line: 220, column: 7)
!1154 = !DILocation(line: 220, column: 7, scope: !1120)
!1155 = !DILocation(line: 221, column: 4, scope: !1156)
!1156 = distinct !DILexicalBlock(scope: !1153, file: !1, line: 220, column: 15)
!1157 = !DILocation(line: 224, column: 7, scope: !1158)
!1158 = distinct !DILexicalBlock(scope: !1120, file: !1, line: 224, column: 7)
!1159 = !DILocation(line: 224, column: 20, scope: !1158)
!1160 = !DILocation(line: 224, column: 35, scope: !1158)
!1161 = !DILocation(line: 224, column: 7, scope: !1120)
!1162 = !DILocalVariable(name: "track_index", scope: !1163, file: !1, line: 225, type: !252)
!1163 = distinct !DILexicalBlock(scope: !1158, file: !1, line: 224, column: 40)
!1164 = !DILocation(line: 225, column: 8, scope: !1163)
!1165 = !DILocalVariable(name: "new_point_tracks", scope: !1163, file: !1, line: 226, type: !506)
!1166 = !DILocation(line: 226, column: 25, scope: !1163)
!1167 = !DILocation(line: 228, column: 23, scope: !1163)
!1168 = !DILocation(line: 228, column: 63, scope: !1163)
!1169 = !DILocation(line: 228, column: 76, scope: !1163)
!1170 = !DILocation(line: 228, column: 61, scope: !1163)
!1171 = !DILocation(line: 228, column: 21, scope: !1163)
!1172 = !DILocation(line: 231, column: 11, scope: !1173)
!1173 = distinct !DILexicalBlock(scope: !1163, file: !1, line: 231, column: 4)
!1174 = !DILocation(line: 231, column: 28, scope: !1173)
!1175 = !DILocation(line: 231, column: 9, scope: !1173)
!1176 = !DILocation(line: 231, column: 33, scope: !1177)
!1177 = distinct !DILexicalBlock(scope: !1173, file: !1, line: 231, column: 4)
!1178 = !DILocation(line: 231, column: 37, scope: !1177)
!1179 = !DILocation(line: 231, column: 50, scope: !1177)
!1180 = !DILocation(line: 231, column: 35, scope: !1177)
!1181 = !DILocation(line: 231, column: 4, scope: !1173)
!1182 = !DILocation(line: 232, column: 9, scope: !1183)
!1183 = distinct !DILexicalBlock(scope: !1184, file: !1, line: 232, column: 9)
!1184 = distinct !DILexicalBlock(scope: !1177, file: !1, line: 231, column: 71)
!1185 = !DILocation(line: 232, column: 22, scope: !1183)
!1186 = !DILocation(line: 232, column: 35, scope: !1183)
!1187 = !DILocation(line: 232, column: 41, scope: !1183)
!1188 = !DILocation(line: 232, column: 38, scope: !1183)
!1189 = !DILocation(line: 232, column: 9, scope: !1184)
!1190 = !DILocation(line: 233, column: 40, scope: !1191)
!1191 = distinct !DILexicalBlock(scope: !1183, file: !1, line: 232, column: 48)
!1192 = !DILocation(line: 233, column: 53, scope: !1191)
!1193 = !DILocation(line: 233, column: 66, scope: !1191)
!1194 = !DILocation(line: 233, column: 6, scope: !1191)
!1195 = !DILocation(line: 233, column: 34, scope: !1191)
!1196 = !DILocation(line: 233, column: 38, scope: !1191)
!1197 = !DILocation(line: 234, column: 5, scope: !1191)
!1198 = !DILocation(line: 235, column: 4, scope: !1184)
!1199 = !DILocation(line: 231, column: 67, scope: !1177)
!1200 = !DILocation(line: 231, column: 4, scope: !1177)
!1201 = distinct !{!1201, !1181, !1202}
!1202 = !DILocation(line: 235, column: 4, scope: !1173)
!1203 = !DILocation(line: 237, column: 4, scope: !1163)
!1204 = !DILocation(line: 237, column: 14, scope: !1163)
!1205 = !DILocation(line: 237, column: 27, scope: !1163)
!1206 = !DILocation(line: 238, column: 32, scope: !1163)
!1207 = !DILocation(line: 238, column: 4, scope: !1163)
!1208 = !DILocation(line: 238, column: 17, scope: !1163)
!1209 = !DILocation(line: 238, column: 30, scope: !1163)
!1210 = !DILocation(line: 239, column: 4, scope: !1163)
!1211 = !DILocation(line: 239, column: 17, scope: !1163)
!1212 = !DILocation(line: 239, column: 31, scope: !1163)
!1213 = !DILocation(line: 240, column: 3, scope: !1163)
!1214 = !DILocation(line: 243, column: 34, scope: !1215)
!1215 = distinct !DILexicalBlock(scope: !1158, file: !1, line: 241, column: 8)
!1216 = !DILocation(line: 243, column: 4, scope: !1215)
!1217 = !DILocation(line: 244, column: 18, scope: !1215)
!1218 = !DILocation(line: 244, column: 37, scope: !1215)
!1219 = !DILocation(line: 244, column: 4, scope: !1215)
!1220 = !DILocation(line: 246, column: 2, scope: !1120)
!1221 = !DILocation(line: 206, column: 21, scope: !1117)
!1222 = !DILocation(line: 206, column: 19, scope: !1117)
!1223 = !DILocation(line: 204, column: 2, scope: !1117)
!1224 = distinct !{!1224, !1118, !1225}
!1225 = !DILocation(line: 246, column: 2, scope: !1112)
!1226 = !DILocation(line: 249, column: 16, scope: !1035)
!1227 = !DILocation(line: 249, column: 36, scope: !1035)
!1228 = !DILocation(line: 249, column: 43, scope: !1035)
!1229 = !DILocation(line: 249, column: 2, scope: !1035)
!1230 = !DILocation(line: 250, column: 15, scope: !1035)
!1231 = !DILocation(line: 250, column: 57, scope: !1035)
!1232 = !DILocation(line: 250, column: 2, scope: !1035)
!1233 = !DILocation(line: 251, column: 33, scope: !1035)
!1234 = !DILocation(line: 251, column: 39, scope: !1035)
!1235 = !DILocation(line: 251, column: 43, scope: !1035)
!1236 = !DILocation(line: 251, column: 2, scope: !1035)
!1237 = !DILocation(line: 253, column: 26, scope: !1035)
!1238 = !DILocation(line: 253, column: 2, scope: !1035)
!1239 = !DILocation(line: 254, column: 16, scope: !1035)
!1240 = !DILocation(line: 254, column: 28, scope: !1035)
!1241 = !DILocation(line: 254, column: 2, scope: !1035)
!1242 = !DILocation(line: 256, column: 24, scope: !1035)
!1243 = !DILocation(line: 256, column: 53, scope: !1035)
!1244 = !DILocation(line: 256, column: 2, scope: !1035)
!1245 = !DILocation(line: 258, column: 6, scope: !1246)
!1246 = distinct !DILexicalBlock(scope: !1035, file: !1, line: 258, column: 6)
!1247 = !DILocation(line: 258, column: 6, scope: !1035)
!1248 = !DILocation(line: 259, column: 3, scope: !1249)
!1249 = distinct !DILexicalBlock(scope: !1246, file: !1, line: 258, column: 19)
!1250 = !DILocation(line: 259, column: 13, scope: !1249)
!1251 = !DILocation(line: 259, column: 27, scope: !1249)
!1252 = !DILocation(line: 259, column: 30, scope: !1249)
!1253 = !DILocation(line: 260, column: 25, scope: !1249)
!1254 = !DILocation(line: 260, column: 55, scope: !1249)
!1255 = !DILocation(line: 260, column: 3, scope: !1249)
!1256 = !DILocation(line: 261, column: 2, scope: !1249)
!1257 = !DILocation(line: 263, column: 21, scope: !1035)
!1258 = !DILocation(line: 263, column: 27, scope: !1035)
!1259 = !DILocation(line: 263, column: 2, scope: !1035)
!1260 = !DILocation(line: 265, column: 6, scope: !1261)
!1261 = distinct !DILexicalBlock(scope: !1035, file: !1, line: 265, column: 6)
!1262 = !DILocation(line: 265, column: 6, scope: !1035)
!1263 = !DILocation(line: 266, column: 25, scope: !1261)
!1264 = !DILocation(line: 266, column: 3, scope: !1261)
!1265 = !DILocation(line: 267, column: 1, scope: !1035)
!1266 = distinct !DISubprogram(name: "clip_delete_marker", scope: !1, file: !1, line: 269, type: !1267, scopeLine: 271, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !702)
!1267 = !DISubroutineType(types: !1268)
!1268 = !{null, !1038, !716, !443, !459}
!1269 = !DILocalVariable(name: "C", arg: 1, scope: !1266, file: !1, line: 269, type: !1038)
!1270 = !DILocation(line: 269, column: 35, scope: !1266)
!1271 = !DILocalVariable(name: "clip", arg: 2, scope: !1266, file: !1, line: 269, type: !716)
!1272 = !DILocation(line: 269, column: 49, scope: !1266)
!1273 = !DILocalVariable(name: "track", arg: 3, scope: !1266, file: !1, line: 269, type: !443)
!1274 = !DILocation(line: 269, column: 75, scope: !1266)
!1275 = !DILocalVariable(name: "marker", arg: 4, scope: !1266, file: !1, line: 270, type: !459)
!1276 = !DILocation(line: 270, column: 46, scope: !1266)
!1277 = !DILocation(line: 272, column: 6, scope: !1278)
!1278 = distinct !DILexicalBlock(scope: !1266, file: !1, line: 272, column: 6)
!1279 = !DILocation(line: 272, column: 13, scope: !1278)
!1280 = !DILocation(line: 272, column: 23, scope: !1278)
!1281 = !DILocation(line: 272, column: 6, scope: !1266)
!1282 = !DILocation(line: 273, column: 21, scope: !1283)
!1283 = distinct !DILexicalBlock(scope: !1278, file: !1, line: 272, column: 29)
!1284 = !DILocation(line: 273, column: 24, scope: !1283)
!1285 = !DILocation(line: 273, column: 30, scope: !1283)
!1286 = !DILocation(line: 273, column: 3, scope: !1283)
!1287 = !DILocation(line: 274, column: 2, scope: !1283)
!1288 = !DILocation(line: 276, column: 30, scope: !1289)
!1289 = distinct !DILexicalBlock(scope: !1278, file: !1, line: 275, column: 7)
!1290 = !DILocation(line: 276, column: 37, scope: !1289)
!1291 = !DILocation(line: 276, column: 45, scope: !1289)
!1292 = !DILocation(line: 276, column: 3, scope: !1289)
!1293 = !DILocation(line: 278, column: 25, scope: !1289)
!1294 = !DILocation(line: 278, column: 54, scope: !1289)
!1295 = !DILocation(line: 278, column: 3, scope: !1289)
!1296 = !DILocation(line: 280, column: 1, scope: !1266)
!1297 = distinct !DISubprogram(name: "clip_view_center_to_point", scope: !1, file: !1, line: 282, type: !1298, scopeLine: 283, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !702)
!1298 = !DISubroutineType(types: !1299)
!1299 = !{null, !231, !223, !223}
!1300 = !DILocalVariable(name: "sc", arg: 1, scope: !1297, file: !1, line: 282, type: !231)
!1301 = !DILocation(line: 282, column: 43, scope: !1297)
!1302 = !DILocalVariable(name: "x", arg: 2, scope: !1297, file: !1, line: 282, type: !223)
!1303 = !DILocation(line: 282, column: 53, scope: !1297)
!1304 = !DILocalVariable(name: "y", arg: 3, scope: !1297, file: !1, line: 282, type: !223)
!1305 = !DILocation(line: 282, column: 62, scope: !1297)
!1306 = !DILocalVariable(name: "width", scope: !1297, file: !1, line: 284, type: !252)
!1307 = !DILocation(line: 284, column: 6, scope: !1297)
!1308 = !DILocalVariable(name: "height", scope: !1297, file: !1, line: 284, type: !252)
!1309 = !DILocation(line: 284, column: 13, scope: !1297)
!1310 = !DILocalVariable(name: "aspx", scope: !1297, file: !1, line: 285, type: !223)
!1311 = !DILocation(line: 285, column: 8, scope: !1297)
!1312 = !DILocalVariable(name: "aspy", scope: !1297, file: !1, line: 285, type: !223)
!1313 = !DILocation(line: 285, column: 14, scope: !1297)
!1314 = !DILocation(line: 287, column: 25, scope: !1297)
!1315 = !DILocation(line: 287, column: 2, scope: !1297)
!1316 = !DILocation(line: 288, column: 27, scope: !1297)
!1317 = !DILocation(line: 288, column: 2, scope: !1297)
!1318 = !DILocation(line: 290, column: 13, scope: !1297)
!1319 = !DILocation(line: 290, column: 15, scope: !1297)
!1320 = !DILocation(line: 290, column: 25, scope: !1297)
!1321 = !DILocation(line: 290, column: 23, scope: !1297)
!1322 = !DILocation(line: 290, column: 33, scope: !1297)
!1323 = !DILocation(line: 290, column: 31, scope: !1297)
!1324 = !DILocation(line: 290, column: 2, scope: !1297)
!1325 = !DILocation(line: 290, column: 6, scope: !1297)
