; ModuleID = 'blender/source/blender/editors/armature/armature_add.c'
source_filename = "blender/source/blender/editors/armature/armature_add.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.UserDef = type { i32, i32, i32, i32, i32, [768 x i8], [768 x i8], [1024 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [1024 x i8], [1024 x i8], i32, i16, i16, i16, i16, i16, i16, i32, i32, i32, i16, i16, i32, i32, i32, i32, i32, i32, i32, i16, i16, i16, i16, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, [64 x i8], i16, i16, i16, i16, i16, i16, i16, i16, [3 x %struct.SolidLight], i16, i16, i16, i16, i16, i16, i16, i16, i32, i32, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i8, i8, i8, i8, i16, i16, i16, i16, i16, i16, float, float, i32, i16, i16, float, i16, i16, i16, i16, %struct.ColorBand, [3 x float], [4 x float], i16, i8, i8, [80 x i8], [1024 x i8], i32, i32, float, float, i32, i16, i16, i16, i16, i16, i16, %struct.WalkNavigation }
%struct.ListBase = type { i8*, i8* }
%struct.SolidLight = type { i32, i32, [4 x float], [4 x float], [4 x float] }
%struct.ColorBand = type { i16, i16, i8, i8, i8, [1 x i8], [32 x %struct.CBData] }
%struct.CBData = type { float, float, float, float, float, i32 }
%struct.WalkNavigation = type { float, float, float, float, float, float, i16, [3 x i16] }

!53 = !DIEnumerator(name: "PROP_THICK_WRAP", value: 8388608, isUnsigned: true)
!54 = !DIEnumerator(name: "PROP_BUILTIN", value: 128, isUnsigned: true)
!55 = !DIEnumerator(name: "PROP_EXPORT", value: 256, isUnsigned: true)
!56 = !DIEnumerator(name: "PROP_RUNTIME", value: 512, isUnsigned: true)
!57 = !DIEnumerator(name: "PROP_IDPROPERTY", value: 1024, isUnsigned: true)
!58 = !DIEnumerator(name: "PROP_RAW_ACCESS", value: 8192, isUnsigned: true)
!59 = !DIEnumerator(name: "PROP_RAW_ARRAY", value: 16384, isUnsigned: true)
!60 = !DIEnumerator(name: "PROP_FREE_POINTERS", value: 32768, isUnsigned: true)
!61 = !DIEnumerator(name: "PROP_DYNAMIC", value: 131072, isUnsigned: true)
!62 = !DIEnumerator(name: "PROP_ENUM_NO_CONTEXT", value: 16777216, isUnsigned: true)
!63 = !DIEnumerator(name: "PROP_ENUM_NO_TRANSLATE", value: 536870912, isUnsigned: true)
!64 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !65, line: 351, baseType: !5, size: 32, elements: !66)
!65 = !DIFile(filename: "blender/source/blender/makesdna/DNA_windowmanager_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!66 = !{!67, !68, !69, !70, !71, !72}
!67 = !DIEnumerator(name: "OPERATOR_RUNNING_MODAL", value: 1, isUnsigned: true)
!68 = !DIEnumerator(name: "OPERATOR_CANCELLED", value: 2, isUnsigned: true)
!69 = !DIEnumerator(name: "OPERATOR_FINISHED", value: 4, isUnsigned: true)
!70 = !DIEnumerator(name: "OPERATOR_PASS_THROUGH", value: 8, isUnsigned: true)
!71 = !DIEnumerator(name: "OPERATOR_HANDLED", value: 16, isUnsigned: true)
!72 = !DIEnumerator(name: "OPERATOR_INTERFACE", value: 32, isUnsigned: true)
!73 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eArmature_Flag", file: !4, line: 118, baseType: !5, size: 32, elements: !74)
!74 = !{!75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89}
!75 = !DIEnumerator(name: "ARM_RESTPOS", value: 1, isUnsigned: true)
!76 = !DIEnumerator(name: "ARM_DRAWXRAY", value: 2, isUnsigned: true)
!77 = !DIEnumerator(name: "ARM_DRAWAXES", value: 4, isUnsigned: true)
!78 = !DIEnumerator(name: "ARM_DRAWNAMES", value: 8, isUnsigned: true)
!79 = !DIEnumerator(name: "ARM_POSEMODE", value: 16, isUnsigned: true)
!80 = !DIEnumerator(name: "ARM_EDITMODE", value: 32, isUnsigned: true)
!81 = !DIEnumerator(name: "ARM_DELAYDEFORM", value: 64, isUnsigned: true)
!82 = !DIEnumerator(name: "ARM_DONT_USE", value: 128, isUnsigned: true)
!83 = !DIEnumerator(name: "ARM_MIRROR_EDIT", value: 256, isUnsigned: true)
!84 = !DIEnumerator(name: "ARM_AUTO_IK", value: 512, isUnsigned: true)
!85 = !DIEnumerator(name: "ARM_NO_CUSTOM", value: 1024, isUnsigned: true)
!86 = !DIEnumerator(name: "ARM_COL_CUSTOM", value: 2048, isUnsigned: true)
!87 = !DIEnumerator(name: "ARM_GHOST_ONLYSEL", value: 4096, isUnsigned: true)
!88 = !DIEnumerator(name: "ARM_DS_EXPAND", value: 8192, isUnsigned: true)
!89 = !DIEnumerator(name: "ARM_HAS_VIZ_DEPS", value: 16384, isUnsigned: true)
!90 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eUserPref_Flag", file: !91, line: 569, baseType: !5, size: 32, elements: !92)
!91 = !DIFile(filename: "blender/source/blender/makesdna/DNA_userdef_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!92 = !{!93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112}
!93 = !DIEnumerator(name: "USER_AUTOSAVE", value: 1, isUnsigned: true)
!94 = !DIEnumerator(name: "USER_SCENEGLOBAL", value: 16, isUnsigned: true)
!95 = !DIEnumerator(name: "USER_TRACKBALL", value: 32, isUnsigned: true)
!96 = !DIEnumerator(name: "USER_MAT_ON_OB", value: 256, isUnsigned: true)
!97 = !DIEnumerator(name: "USER_TOOLTIPS", value: 2048, isUnsigned: true)
!98 = !DIEnumerator(name: "USER_TWOBUTTONMOUSE", value: 4096, isUnsigned: true)
!99 = !DIEnumerator(name: "USER_NONUMPAD", value: 8192, isUnsigned: true)
!100 = !DIEnumerator(name: "USER_LMOUSESELECT", value: 16384, isUnsigned: true)
!101 = !DIEnumerator(name: "USER_FILECOMPRESS", value: 32768, isUnsigned: true)
!102 = !DIEnumerator(name: "USER_SAVE_PREVIEWS", value: 65536, isUnsigned: true)
!103 = !DIEnumerator(name: "USER_CUSTOM_RANGE", value: 131072, isUnsigned: true)
!104 = !DIEnumerator(name: "USER_ADD_EDITMODE", value: 262144, isUnsigned: true)
!105 = !DIEnumerator(name: "USER_ADD_VIEWALIGNED", value: 524288, isUnsigned: true)
!106 = !DIEnumerator(name: "USER_RELPATHS", value: 1048576, isUnsigned: true)
!107 = !DIEnumerator(name: "USER_RELEASECONFIRM", value: 2097152, isUnsigned: true)
!108 = !DIEnumerator(name: "USER_SCRIPT_AUTOEXEC_DISABLE", value: 4194304, isUnsigned: true)
!109 = !DIEnumerator(name: "USER_FILENOUI", value: 8388608, isUnsigned: true)
!110 = !DIEnumerator(name: "USER_NONEGFRAMES", value: 16777216, isUnsigned: true)
!111 = !DIEnumerator(name: "USER_TXT_TABSTOSPACES_DISABLE", value: 33554432, isUnsigned: true)
!112 = !DIEnumerator(name: "USER_TOOLTIPS_PYTHON", value: 67108864, isUnsigned: true)
!113 = !{!114, !115, !180, !161}
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "EditBone", file: !117, line: 86, baseType: !118)
!117 = !DIFile(filename: "blender/source/blender/editors/include/ED_armature.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EditBone", file: !117, line: 56, size: 1472, elements: !119)
!119 = !{!120, !122, !123, !157, !158, !159, !160, !162, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !118, file: !117, line: 57, baseType: !121, size: 64)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !118, file: !117, line: 57, baseType: !121, size: 64, offset: 64)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !118, file: !117, line: 58, baseType: !124, size: 64, offset: 128)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !126, line: 62, size: 1024, elements: !127)
!126 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!127 = !{!128, !129, !130, !132, !133, !135, !139, !141, !155, !156}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !125, file: !126, line: 63, baseType: !124, size: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !125, file: !126, line: 63, baseType: !124, size: 64, offset: 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !125, file: !126, line: 64, baseType: !131, size: 8, offset: 128)
!131 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !125, file: !126, line: 64, baseType: !131, size: 8, offset: 136)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !125, file: !126, line: 65, baseType: !134, size: 16, offset: 144)
!134 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !125, file: !126, line: 66, baseType: !136, size: 512, offset: 160)
!136 = !DICompositeType(tag: DW_TAG_array_type, baseType: !131, size: 512, elements: !137)
!137 = !{!138}
!138 = !DISubrange(count: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !125, file: !126, line: 67, baseType: !140, size: 32, offset: 672)
!140 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !125, file: !126, line: 69, baseType: !142, size: 256, offset: 704)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !126, line: 60, baseType: !143)
!143 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !126, line: 48, size: 256, elements: !144)
!144 = !{!145, !146, !153, !154}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !143, file: !126, line: 49, baseType: !114, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !143, file: !126, line: 58, baseType: !147, size: 128, offset: 64)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !148, line: 71, baseType: !149)
!148 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !148, line: 69, size: 128, elements: !150)
!150 = !{!151, !152}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !149, file: !148, line: 70, baseType: !114, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !149, file: !148, line: 70, baseType: !114, size: 64, offset: 64)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !143, file: !126, line: 59, baseType: !140, size: 32, offset: 192)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !143, file: !126, line: 59, baseType: !140, size: 32, offset: 224)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !125, file: !126, line: 70, baseType: !140, size: 32, offset: 960)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !125, file: !126, line: 74, baseType: !140, size: 32, offset: 992)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !118, file: !117, line: 59, baseType: !121, size: 64, offset: 192)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !118, file: !117, line: 62, baseType: !114, size: 64, offset: 256)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !118, file: !117, line: 64, baseType: !136, size: 512, offset: 320)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "roll", scope: !118, file: !117, line: 65, baseType: !161, size: 32, offset: 832)
!161 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !118, file: !117, line: 70, baseType: !163, size: 96, offset: 864)
!163 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 96, elements: !164)
!164 = !{!165}
!165 = !DISubrange(count: 3)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !118, file: !117, line: 71, baseType: !163, size: 96, offset: 960)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !118, file: !117, line: 75, baseType: !140, size: 32, offset: 1056)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !118, file: !117, line: 76, baseType: !140, size: 32, offset: 1088)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !118, file: !117, line: 78, baseType: !161, size: 32, offset: 1120)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !118, file: !117, line: 78, baseType: !161, size: 32, offset: 1152)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "xwidth", scope: !118, file: !117, line: 79, baseType: !161, size: 32, offset: 1184)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !118, file: !117, line: 79, baseType: !161, size: 32, offset: 1216)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "zwidth", scope: !118, file: !117, line: 79, baseType: !161, size: 32, offset: 1248)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "ease1", scope: !118, file: !117, line: 80, baseType: !161, size: 32, offset: 1280)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "ease2", scope: !118, file: !117, line: 80, baseType: !161, size: 32, offset: 1312)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "rad_head", scope: !118, file: !117, line: 81, baseType: !161, size: 32, offset: 1344)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "rad_tail", scope: !118, file: !117, line: 81, baseType: !161, size: 32, offset: 1376)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "oldlength", scope: !118, file: !117, line: 83, baseType: !161, size: 32, offset: 1408)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "segments", scope: !118, file: !117, line: 85, baseType: !134, size: 16, offset: 1440)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "bArmature", file: !4, line: 114, baseType: !182)
!182 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bArmature", file: !4, line: 78, size: 2048, elements: !183)
!183 = !{!184, !222, !225, !226, !227, !229, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !182, file: !4, line: 79, baseType: !185, size: 960)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !126, line: 130, baseType: !186)
!186 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !126, line: 117, size: 960, elements: !187)
!187 = !{!188, !189, !190, !192, !211, !215, !216, !217, !218, !219}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !186, file: !126, line: 118, baseType: !114, size: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !186, file: !126, line: 118, baseType: !114, size: 64, offset: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !186, file: !126, line: 119, baseType: !191, size: 64, offset: 128)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !186, file: !126, line: 120, baseType: !193, size: 64, offset: 192)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!194 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !126, line: 136, size: 17600, elements: !195)
!195 = !{!196, !197, !199, !202, !206, !207, !208}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !194, file: !126, line: 137, baseType: !185, size: 960)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !194, file: !126, line: 138, baseType: !198, size: 64, offset: 960)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !194, file: !126, line: 139, baseType: !200, size: 64, offset: 1024)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!201 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !126, line: 43, flags: DIFlagFwdDecl)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !194, file: !126, line: 140, baseType: !203, size: 8192, offset: 1088)
!203 = !DICompositeType(tag: DW_TAG_array_type, baseType: !131, size: 8192, elements: !204)
!204 = !{!205}
!205 = !DISubrange(count: 1024)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !194, file: !126, line: 141, baseType: !203, size: 8192, offset: 9280)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !194, file: !126, line: 148, baseType: !193, size: 64, offset: 17472)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !194, file: !126, line: 150, baseType: !209, size: 64, offset: 17536)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!210 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !126, line: 45, flags: DIFlagFwdDecl)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !186, file: !126, line: 121, baseType: !212, size: 528, offset: 256)
!212 = !DICompositeType(tag: DW_TAG_array_type, baseType: !131, size: 528, elements: !213)
!213 = !{!214}
!214 = !DISubrange(count: 66)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !186, file: !126, line: 126, baseType: !134, size: 16, offset: 784)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !186, file: !126, line: 127, baseType: !140, size: 32, offset: 800)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !186, file: !126, line: 128, baseType: !140, size: 32, offset: 832)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !186, file: !126, line: 128, baseType: !140, size: 32, offset: 864)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !186, file: !126, line: 129, baseType: !220, size: 64, offset: 896)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !126, line: 75, baseType: !125)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !182, file: !4, line: 80, baseType: !223, size: 64, offset: 960)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !4, line: 37, flags: DIFlagFwdDecl)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "bonebase", scope: !182, file: !4, line: 82, baseType: !147, size: 128, offset: 1024)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "chainbase", scope: !182, file: !4, line: 83, baseType: !147, size: 128, offset: 1152)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "edbo", scope: !182, file: !4, line: 84, baseType: !228, size: 64, offset: 1280)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "act_bone", scope: !182, file: !4, line: 92, baseType: !230, size: 64, offset: 1344)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bone", file: !4, line: 76, baseType: !232)
!232 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Bone", file: !4, line: 48, size: 2624, elements: !233)
!233 = !{!234, !236, !237, !238, !239, !240, !241, !242, !243, !244, !247, !248, !249, !250, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !232, file: !4, line: 49, baseType: !235, size: 64)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !232, file: !4, line: 49, baseType: !235, size: 64, offset: 64)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !232, file: !4, line: 50, baseType: !220, size: 64, offset: 128)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !232, file: !4, line: 51, baseType: !235, size: 64, offset: 192)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "childbase", scope: !232, file: !4, line: 52, baseType: !147, size: 128, offset: 256)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !232, file: !4, line: 53, baseType: !136, size: 512, offset: 384)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "roll", scope: !232, file: !4, line: 55, baseType: !161, size: 32, offset: 896)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !232, file: !4, line: 56, baseType: !163, size: 96, offset: 928)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !232, file: !4, line: 57, baseType: !163, size: 96, offset: 1024)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "bone_mat", scope: !232, file: !4, line: 58, baseType: !245, size: 288, offset: 1120)
!245 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 288, elements: !246)
!246 = !{!165, !165}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !232, file: !4, line: 60, baseType: !140, size: 32, offset: 1408)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "arm_head", scope: !232, file: !4, line: 62, baseType: !163, size: 96, offset: 1440)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "arm_tail", scope: !232, file: !4, line: 63, baseType: !163, size: 96, offset: 1536)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "arm_mat", scope: !232, file: !4, line: 64, baseType: !251, size: 512, offset: 1632)
!251 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 512, elements: !252)
!252 = !{!253, !253}
!253 = !DISubrange(count: 4)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "arm_roll", scope: !232, file: !4, line: 65, baseType: !161, size: 32, offset: 2144)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !232, file: !4, line: 67, baseType: !161, size: 32, offset: 2176)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !232, file: !4, line: 67, baseType: !161, size: 32, offset: 2208)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "xwidth", scope: !232, file: !4, line: 68, baseType: !161, size: 32, offset: 2240)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !232, file: !4, line: 68, baseType: !161, size: 32, offset: 2272)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "zwidth", scope: !232, file: !4, line: 68, baseType: !161, size: 32, offset: 2304)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "ease1", scope: !232, file: !4, line: 69, baseType: !161, size: 32, offset: 2336)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "ease2", scope: !232, file: !4, line: 69, baseType: !161, size: 32, offset: 2368)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "rad_head", scope: !232, file: !4, line: 70, baseType: !161, size: 32, offset: 2400)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "rad_tail", scope: !232, file: !4, line: 70, baseType: !161, size: 32, offset: 2432)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !232, file: !4, line: 72, baseType: !163, size: 96, offset: 2464)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !232, file: !4, line: 73, baseType: !140, size: 32, offset: 2560)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "segments", scope: !232, file: !4, line: 74, baseType: !134, size: 16, offset: 2592)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !232, file: !4, line: 75, baseType: !268, size: 16, offset: 2608)
!268 = !DICompositeType(tag: DW_TAG_array_type, baseType: !134, size: 16, elements: !269)
!269 = !{!270}
!270 = !DISubrange(count: 1)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "act_edbone", scope: !182, file: !4, line: 93, baseType: !121, size: 64, offset: 1408)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "sketch", scope: !182, file: !4, line: 95, baseType: !114, size: 64, offset: 1472)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !182, file: !4, line: 97, baseType: !140, size: 32, offset: 1536)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "drawtype", scope: !182, file: !4, line: 98, baseType: !140, size: 32, offset: 1568)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "gevertdeformer", scope: !182, file: !4, line: 99, baseType: !140, size: 32, offset: 1600)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !182, file: !4, line: 100, baseType: !140, size: 32, offset: 1632)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "deformflag", scope: !182, file: !4, line: 101, baseType: !134, size: 16, offset: 1664)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "pathflag", scope: !182, file: !4, line: 102, baseType: !134, size: 16, offset: 1680)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "layer_used", scope: !182, file: !4, line: 104, baseType: !5, size: 32, offset: 1696)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !182, file: !4, line: 105, baseType: !5, size: 32, offset: 1728)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "layer_protected", scope: !182, file: !4, line: 105, baseType: !5, size: 32, offset: 1760)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "ghostep", scope: !182, file: !4, line: 108, baseType: !134, size: 16, offset: 1792)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "ghostsize", scope: !182, file: !4, line: 108, baseType: !134, size: 16, offset: 1808)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "ghosttype", scope: !182, file: !4, line: 109, baseType: !134, size: 16, offset: 1824)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "pathsize", scope: !182, file: !4, line: 109, baseType: !134, size: 16, offset: 1840)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "ghostsf", scope: !182, file: !4, line: 110, baseType: !140, size: 32, offset: 1856)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "ghostef", scope: !182, file: !4, line: 110, baseType: !140, size: 32, offset: 1888)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "pathsf", scope: !182, file: !4, line: 111, baseType: !140, size: 32, offset: 1920)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "pathef", scope: !182, file: !4, line: 111, baseType: !140, size: 32, offset: 1952)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "pathbc", scope: !182, file: !4, line: 112, baseType: !140, size: 32, offset: 1984)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "pathac", scope: !182, file: !4, line: 112, baseType: !140, size: 32, offset: 2016)
!292 = !{i32 7, !"Dwarf Version", i32 4}
!293 = !{i32 2, !"Debug Info Version", i32 3}
!294 = !{i32 1, !"wchar_size", i32 4}
!295 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!296 = distinct !DISubprogram(name: "ED_armature_edit_bone_add", scope: !1, file: !1, line: 63, type: !297, scopeLine: 64, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !301)
!297 = !DISubroutineType(types: !298)
!298 = !{!115, !180, !299}
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64)
!300 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !131)
!301 = !{}
!302 = !DILocalVariable(name: "arm", arg: 1, scope: !296, file: !1, line: 63, type: !180)
!303 = !DILocation(line: 63, column: 48, scope: !296)
!304 = !DILocalVariable(name: "name", arg: 2, scope: !296, file: !1, line: 63, type: !299)
!305 = !DILocation(line: 63, column: 65, scope: !296)
!306 = !DILocalVariable(name: "bone", scope: !296, file: !1, line: 65, type: !115)
!307 = !DILocation(line: 65, column: 12, scope: !296)
!308 = !DILocation(line: 65, column: 19, scope: !296)
!309 = !DILocation(line: 67, column: 14, scope: !296)
!310 = !DILocation(line: 67, column: 20, scope: !296)
!311 = !DILocation(line: 67, column: 26, scope: !296)
!312 = !DILocation(line: 67, column: 2, scope: !296)
!313 = !DILocation(line: 68, column: 23, scope: !296)
!314 = !DILocation(line: 68, column: 28, scope: !296)
!315 = !DILocation(line: 68, column: 34, scope: !296)
!316 = !DILocation(line: 68, column: 40, scope: !296)
!317 = !DILocation(line: 68, column: 2, scope: !296)
!318 = !DILocation(line: 70, column: 14, scope: !296)
!319 = !DILocation(line: 70, column: 19, scope: !296)
!320 = !DILocation(line: 70, column: 25, scope: !296)
!321 = !DILocation(line: 70, column: 2, scope: !296)
!322 = !DILocation(line: 72, column: 2, scope: !296)
!323 = !DILocation(line: 72, column: 8, scope: !296)
!324 = !DILocation(line: 72, column: 13, scope: !296)
!325 = !DILocation(line: 73, column: 2, scope: !296)
!326 = !DILocation(line: 73, column: 8, scope: !296)
!327 = !DILocation(line: 73, column: 15, scope: !296)
!328 = !DILocation(line: 74, column: 2, scope: !296)
!329 = !DILocation(line: 74, column: 8, scope: !296)
!330 = !DILocation(line: 74, column: 13, scope: !296)
!331 = !DILocation(line: 75, column: 2, scope: !296)
!332 = !DILocation(line: 75, column: 8, scope: !296)
!333 = !DILocation(line: 75, column: 15, scope: !296)
!334 = !DILocation(line: 76, column: 2, scope: !296)
!335 = !DILocation(line: 76, column: 8, scope: !296)
!336 = !DILocation(line: 76, column: 15, scope: !296)
!337 = !DILocation(line: 77, column: 2, scope: !296)
!338 = !DILocation(line: 77, column: 8, scope: !296)
!339 = !DILocation(line: 77, column: 14, scope: !296)
!340 = !DILocation(line: 78, column: 2, scope: !296)
!341 = !DILocation(line: 78, column: 8, scope: !296)
!342 = !DILocation(line: 78, column: 14, scope: !296)
!343 = !DILocation(line: 79, column: 2, scope: !296)
!344 = !DILocation(line: 79, column: 8, scope: !296)
!345 = !DILocation(line: 79, column: 17, scope: !296)
!346 = !DILocation(line: 80, column: 2, scope: !296)
!347 = !DILocation(line: 80, column: 8, scope: !296)
!348 = !DILocation(line: 80, column: 17, scope: !296)
!349 = !DILocation(line: 81, column: 2, scope: !296)
!350 = !DILocation(line: 81, column: 8, scope: !296)
!351 = !DILocation(line: 81, column: 17, scope: !296)
!352 = !DILocation(line: 82, column: 16, scope: !296)
!353 = !DILocation(line: 82, column: 21, scope: !296)
!354 = !DILocation(line: 82, column: 2, scope: !296)
!355 = !DILocation(line: 82, column: 8, scope: !296)
!356 = !DILocation(line: 82, column: 14, scope: !296)
!357 = !DILocation(line: 84, column: 9, scope: !296)
!358 = !DILocation(line: 84, column: 2, scope: !296)
!359 = distinct !DISubprogram(name: "ED_armature_edit_bone_add_primitive", scope: !1, file: !1, line: 87, type: !360, scopeLine: 88, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !301)
!360 = !DISubroutineType(types: !361)
!361 = !{!115, !362, !161, !1182}
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "Object", file: !364, line: 295, baseType: !365)
!364 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!365 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !364, line: 115, size: 11392, elements: !366)
!366 = !{!367, !368, !369, !372, !373, !374, !375, !376, !377, !378, !380, !381, !382, !383, !384, !388, !398, !412, !413, !454, !455, !458, !459, !475, !476, !477, !478, !479, !480, !481, !485, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !563, !564, !565, !566, !567, !568, !569, !570, !571, !574, !577, !580, !581, !582, !583, !584, !587, !590, !593, !594, !600, !601, !602, !603, !604, !605, !606, !609, !612, !616, !1804, !1805}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !365, file: !364, line: 116, baseType: !185, size: 960)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !365, file: !364, line: 117, baseType: !223, size: 64, offset: 960)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !365, file: !364, line: 119, baseType: !370, size: 64, offset: 1024)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!371 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !364, line: 57, flags: DIFlagFwdDecl)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !365, file: !364, line: 121, baseType: !134, size: 16, offset: 1088)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !365, file: !364, line: 121, baseType: !134, size: 16, offset: 1104)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !365, file: !364, line: 122, baseType: !140, size: 32, offset: 1120)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !365, file: !364, line: 122, baseType: !140, size: 32, offset: 1152)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !365, file: !364, line: 122, baseType: !140, size: 32, offset: 1184)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !365, file: !364, line: 123, baseType: !136, size: 512, offset: 1216)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !365, file: !364, line: 124, baseType: !379, size: 64, offset: 1728)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !365, file: !364, line: 124, baseType: !379, size: 64, offset: 1792)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !365, file: !364, line: 127, baseType: !379, size: 64, offset: 1856)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !365, file: !364, line: 127, baseType: !379, size: 64, offset: 1920)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !365, file: !364, line: 127, baseType: !379, size: 64, offset: 1984)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !365, file: !364, line: 128, baseType: !385, size: 64, offset: 2048)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!386 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !387, line: 42, flags: DIFlagFwdDecl)
!387 = !DIFile(filename: "blender/source/blender/makesdna/DNA_constraint_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!388 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !365, file: !364, line: 130, baseType: !389, size: 64, offset: 2112)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !364, line: 97, size: 832, elements: !391)
!391 = !{!392, !396, !397}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !390, file: !364, line: 98, baseType: !393, size: 768)
!393 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 768, elements: !394)
!394 = !{!395, !165}
!395 = !DISubrange(count: 8)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !390, file: !364, line: 99, baseType: !140, size: 32, offset: 768)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !390, file: !364, line: 99, baseType: !140, size: 32, offset: 800)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !365, file: !364, line: 131, baseType: !399, size: 64, offset: 2176)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !401, line: 486, size: 1600, elements: !402)
!401 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!402 = !{!403, !404, !405, !406, !407, !408, !409, !410, !411}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !400, file: !401, line: 487, baseType: !185, size: 960)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !400, file: !401, line: 489, baseType: !147, size: 128, offset: 960)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !400, file: !401, line: 490, baseType: !147, size: 128, offset: 1088)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !400, file: !401, line: 491, baseType: !147, size: 128, offset: 1216)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !400, file: !401, line: 492, baseType: !147, size: 128, offset: 1344)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !400, file: !401, line: 494, baseType: !140, size: 32, offset: 1472)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !400, file: !401, line: 495, baseType: !140, size: 32, offset: 1504)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !400, file: !401, line: 497, baseType: !140, size: 32, offset: 1536)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !400, file: !401, line: 498, baseType: !140, size: 32, offset: 1568)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !365, file: !364, line: 132, baseType: !399, size: 64, offset: 2240)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !365, file: !364, line: 133, baseType: !414, size: 64, offset: 2304)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!415 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !401, line: 334, size: 1728, elements: !416)
!416 = !{!417, !418, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !453}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !415, file: !401, line: 335, baseType: !147, size: 128)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !415, file: !401, line: 336, baseType: !419, size: 64, offset: 128)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64)
!420 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !401, line: 47, flags: DIFlagFwdDecl)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !415, file: !401, line: 338, baseType: !134, size: 16, offset: 192)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !415, file: !401, line: 338, baseType: !134, size: 16, offset: 208)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !415, file: !401, line: 339, baseType: !5, size: 32, offset: 224)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !415, file: !401, line: 340, baseType: !140, size: 32, offset: 256)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !415, file: !401, line: 342, baseType: !161, size: 32, offset: 288)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !415, file: !401, line: 343, baseType: !163, size: 96, offset: 320)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !415, file: !401, line: 344, baseType: !163, size: 96, offset: 416)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !415, file: !401, line: 347, baseType: !147, size: 128, offset: 512)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !415, file: !401, line: 349, baseType: !140, size: 32, offset: 640)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !415, file: !401, line: 350, baseType: !140, size: 32, offset: 672)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !415, file: !401, line: 351, baseType: !114, size: 64, offset: 704)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !415, file: !401, line: 352, baseType: !114, size: 64, offset: 768)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !415, file: !401, line: 354, baseType: !434, size: 384, offset: 832)
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !401, line: 116, baseType: !435)
!435 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !401, line: 94, size: 384, elements: !436)
!436 = !{!437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !435, file: !401, line: 96, baseType: !140, size: 32)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !435, file: !401, line: 96, baseType: !140, size: 32, offset: 32)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !435, file: !401, line: 97, baseType: !140, size: 32, offset: 64)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !435, file: !401, line: 97, baseType: !140, size: 32, offset: 96)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !435, file: !401, line: 99, baseType: !134, size: 16, offset: 128)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !435, file: !401, line: 100, baseType: !134, size: 16, offset: 144)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !435, file: !401, line: 102, baseType: !134, size: 16, offset: 160)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !435, file: !401, line: 105, baseType: !134, size: 16, offset: 176)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !435, file: !401, line: 108, baseType: !134, size: 16, offset: 192)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !435, file: !401, line: 109, baseType: !134, size: 16, offset: 208)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !435, file: !401, line: 111, baseType: !134, size: 16, offset: 224)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !435, file: !401, line: 112, baseType: !134, size: 16, offset: 240)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !435, file: !401, line: 114, baseType: !140, size: 32, offset: 256)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !435, file: !401, line: 114, baseType: !140, size: 32, offset: 288)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !435, file: !401, line: 115, baseType: !140, size: 32, offset: 320)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !435, file: !401, line: 115, baseType: !140, size: 32, offset: 352)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !415, file: !401, line: 355, baseType: !136, size: 512, offset: 1216)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !365, file: !364, line: 134, baseType: !114, size: 64, offset: 2368)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !365, file: !364, line: 136, baseType: !456, size: 64, offset: 2432)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64)
!457 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !364, line: 58, flags: DIFlagFwdDecl)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !365, file: !364, line: 138, baseType: !434, size: 384, offset: 2496)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !365, file: !364, line: 139, baseType: !460, size: 64, offset: 2880)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !401, line: 80, baseType: !462)
!462 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !401, line: 72, size: 192, elements: !463)
!463 = !{!464, !471, !472, !473, !474}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !462, file: !401, line: 73, baseType: !465, size: 64)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64)
!466 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !401, line: 59, baseType: !467)
!467 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !401, line: 56, size: 128, elements: !468)
!468 = !{!469, !470}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !467, file: !401, line: 57, baseType: !163, size: 96)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !467, file: !401, line: 58, baseType: !140, size: 32, offset: 96)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !462, file: !401, line: 74, baseType: !140, size: 32, offset: 64)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !462, file: !401, line: 76, baseType: !140, size: 32, offset: 96)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !462, file: !401, line: 77, baseType: !140, size: 32, offset: 128)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !462, file: !401, line: 79, baseType: !140, size: 32, offset: 160)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !365, file: !364, line: 141, baseType: !147, size: 128, offset: 2944)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !365, file: !364, line: 142, baseType: !147, size: 128, offset: 3072)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !365, file: !364, line: 143, baseType: !147, size: 128, offset: 3200)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !365, file: !364, line: 144, baseType: !147, size: 128, offset: 3328)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !365, file: !364, line: 146, baseType: !140, size: 32, offset: 3456)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !365, file: !364, line: 147, baseType: !140, size: 32, offset: 3488)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !365, file: !364, line: 150, baseType: !482, size: 64, offset: 3520)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64)
!484 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !364, line: 50, flags: DIFlagFwdDecl)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !365, file: !364, line: 151, baseType: !486, size: 64, offset: 3584)
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !365, file: !364, line: 152, baseType: !140, size: 32, offset: 3648)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !365, file: !364, line: 153, baseType: !140, size: 32, offset: 3680)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !365, file: !364, line: 156, baseType: !163, size: 96, offset: 3712)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !365, file: !364, line: 156, baseType: !163, size: 96, offset: 3808)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !365, file: !364, line: 156, baseType: !163, size: 96, offset: 3904)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !365, file: !364, line: 157, baseType: !163, size: 96, offset: 4000)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !365, file: !364, line: 158, baseType: !163, size: 96, offset: 4096)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !365, file: !364, line: 159, baseType: !163, size: 96, offset: 4192)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !365, file: !364, line: 160, baseType: !163, size: 96, offset: 4288)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !365, file: !364, line: 160, baseType: !163, size: 96, offset: 4384)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !365, file: !364, line: 161, baseType: !498, size: 128, offset: 4480)
!498 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 128, elements: !499)
!499 = !{!253}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !365, file: !364, line: 161, baseType: !498, size: 128, offset: 4608)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !365, file: !364, line: 162, baseType: !163, size: 96, offset: 4736)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !365, file: !364, line: 162, baseType: !163, size: 96, offset: 4832)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !365, file: !364, line: 163, baseType: !161, size: 32, offset: 4928)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !365, file: !364, line: 163, baseType: !161, size: 32, offset: 4960)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !365, file: !364, line: 164, baseType: !251, size: 512, offset: 4992)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !365, file: !364, line: 165, baseType: !251, size: 512, offset: 5504)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !365, file: !364, line: 166, baseType: !251, size: 512, offset: 6016)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !365, file: !364, line: 167, baseType: !251, size: 512, offset: 6528)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !365, file: !364, line: 176, baseType: !251, size: 512, offset: 7040)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !365, file: !364, line: 178, baseType: !5, size: 32, offset: 7552)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !365, file: !364, line: 180, baseType: !134, size: 16, offset: 7584)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !365, file: !364, line: 181, baseType: !134, size: 16, offset: 7600)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !365, file: !364, line: 183, baseType: !134, size: 16, offset: 7616)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !365, file: !364, line: 183, baseType: !134, size: 16, offset: 7632)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !365, file: !364, line: 184, baseType: !134, size: 16, offset: 7648)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !365, file: !364, line: 184, baseType: !134, size: 16, offset: 7664)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !365, file: !364, line: 185, baseType: !134, size: 16, offset: 7680)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !365, file: !364, line: 186, baseType: !134, size: 16, offset: 7696)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !365, file: !364, line: 187, baseType: !134, size: 16, offset: 7712)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !365, file: !364, line: 188, baseType: !131, size: 8, offset: 7728)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !365, file: !364, line: 189, baseType: !131, size: 8, offset: 7736)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !365, file: !364, line: 192, baseType: !140, size: 32, offset: 7744)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !365, file: !364, line: 192, baseType: !140, size: 32, offset: 7776)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !365, file: !364, line: 192, baseType: !140, size: 32, offset: 7808)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !365, file: !364, line: 192, baseType: !140, size: 32, offset: 7840)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !365, file: !364, line: 194, baseType: !140, size: 32, offset: 7872)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !365, file: !364, line: 202, baseType: !161, size: 32, offset: 7904)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !365, file: !364, line: 202, baseType: !161, size: 32, offset: 7936)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !365, file: !364, line: 202, baseType: !161, size: 32, offset: 7968)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !365, file: !364, line: 211, baseType: !161, size: 32, offset: 8000)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !365, file: !364, line: 212, baseType: !161, size: 32, offset: 8032)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !365, file: !364, line: 213, baseType: !161, size: 32, offset: 8064)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !365, file: !364, line: 214, baseType: !161, size: 32, offset: 8096)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !365, file: !364, line: 215, baseType: !161, size: 32, offset: 8128)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !365, file: !364, line: 216, baseType: !161, size: 32, offset: 8160)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !365, file: !364, line: 219, baseType: !161, size: 32, offset: 8192)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !365, file: !364, line: 220, baseType: !161, size: 32, offset: 8224)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !365, file: !364, line: 221, baseType: !161, size: 32, offset: 8256)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !365, file: !364, line: 224, baseType: !540, size: 16, offset: 8288)
!540 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !365, file: !364, line: 224, baseType: !540, size: 16, offset: 8304)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !365, file: !364, line: 226, baseType: !134, size: 16, offset: 8320)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !365, file: !364, line: 228, baseType: !131, size: 8, offset: 8336)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !365, file: !364, line: 229, baseType: !131, size: 8, offset: 8344)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !365, file: !364, line: 231, baseType: !134, size: 16, offset: 8352)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !365, file: !364, line: 232, baseType: !131, size: 8, offset: 8368)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !365, file: !364, line: 233, baseType: !131, size: 8, offset: 8376)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !365, file: !364, line: 234, baseType: !161, size: 32, offset: 8384)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !365, file: !364, line: 235, baseType: !161, size: 32, offset: 8416)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !365, file: !364, line: 237, baseType: !147, size: 128, offset: 8448)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !365, file: !364, line: 238, baseType: !147, size: 128, offset: 8576)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !365, file: !364, line: 239, baseType: !147, size: 128, offset: 8704)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !365, file: !364, line: 240, baseType: !147, size: 128, offset: 8832)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !365, file: !364, line: 242, baseType: !161, size: 32, offset: 8960)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !365, file: !364, line: 244, baseType: !134, size: 16, offset: 8992)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !365, file: !364, line: 245, baseType: !540, size: 16, offset: 9008)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !365, file: !364, line: 246, baseType: !498, size: 128, offset: 9024)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !365, file: !364, line: 248, baseType: !140, size: 32, offset: 9152)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !365, file: !364, line: 249, baseType: !140, size: 32, offset: 9184)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !365, file: !364, line: 251, baseType: !561, size: 64, offset: 9216)
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64)
!562 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !364, line: 251, flags: DIFlagFwdDecl)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !365, file: !364, line: 253, baseType: !131, size: 8, offset: 9280)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !365, file: !364, line: 254, baseType: !131, size: 8, offset: 9288)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !365, file: !364, line: 255, baseType: !134, size: 16, offset: 9296)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !365, file: !364, line: 256, baseType: !163, size: 96, offset: 9312)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !365, file: !364, line: 258, baseType: !147, size: 128, offset: 9408)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !365, file: !364, line: 259, baseType: !147, size: 128, offset: 9536)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !365, file: !364, line: 260, baseType: !147, size: 128, offset: 9664)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !365, file: !364, line: 261, baseType: !147, size: 128, offset: 9792)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !365, file: !364, line: 263, baseType: !572, size: 64, offset: 9920)
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 64)
!573 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !364, line: 52, flags: DIFlagFwdDecl)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !365, file: !364, line: 264, baseType: !575, size: 64, offset: 9984)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64)
!576 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !364, line: 53, flags: DIFlagFwdDecl)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !365, file: !364, line: 265, baseType: !578, size: 64, offset: 10048)
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64)
!579 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !401, line: 46, flags: DIFlagFwdDecl)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !365, file: !364, line: 267, baseType: !131, size: 8, offset: 10112)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !365, file: !364, line: 268, baseType: !131, size: 8, offset: 10120)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !365, file: !364, line: 269, baseType: !134, size: 16, offset: 10128)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !365, file: !364, line: 270, baseType: !161, size: 32, offset: 10144)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !365, file: !364, line: 272, baseType: !585, size: 64, offset: 10176)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64)
!586 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !364, line: 54, flags: DIFlagFwdDecl)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !365, file: !364, line: 275, baseType: !588, size: 64, offset: 10240)
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 64)
!589 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !364, line: 275, flags: DIFlagFwdDecl)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !365, file: !364, line: 277, baseType: !591, size: 64, offset: 10304)
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64)
!592 = !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !364, line: 56, flags: DIFlagFwdDecl)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !365, file: !364, line: 277, baseType: !591, size: 64, offset: 10368)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !365, file: !364, line: 278, baseType: !595, size: 64, offset: 10432)
!595 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !596, line: 27, baseType: !597)
!596 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!597 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !598, line: 45, baseType: !599)
!598 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!599 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_mask", scope: !365, file: !364, line: 279, baseType: !595, size: 64, offset: 10496)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !365, file: !364, line: 280, baseType: !5, size: 32, offset: 10560)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !365, file: !364, line: 281, baseType: !5, size: 32, offset: 10592)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "gpulamp", scope: !365, file: !364, line: 283, baseType: !147, size: 128, offset: 10624)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "pc_ids", scope: !365, file: !364, line: 284, baseType: !147, size: 128, offset: 10752)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "duplilist", scope: !365, file: !364, line: 285, baseType: !228, size: 64, offset: 10880)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_object", scope: !365, file: !364, line: 287, baseType: !607, size: 64, offset: 10944)
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64)
!608 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyOb", file: !364, line: 59, flags: DIFlagFwdDecl)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_constraint", scope: !365, file: !364, line: 288, baseType: !610, size: 64, offset: 11008)
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64)
!611 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyCon", file: !364, line: 288, flags: DIFlagFwdDecl)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "ima_ofs", scope: !365, file: !364, line: 290, baseType: !613, size: 64, offset: 11072)
!613 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 64, elements: !614)
!614 = !{!615}
!615 = !DISubrange(count: 2)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !365, file: !364, line: 291, baseType: !617, size: 64, offset: 11136)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64)
!618 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageUser", file: !619, line: 65, baseType: !620)
!619 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!620 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !619, line: 50, size: 320, elements: !621)
!621 = !{!622, !1791, !1792, !1793, !1794, !1795, !1796, !1797, !1798, !1799, !1800, !1801, !1802, !1803}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !620, file: !619, line: 51, baseType: !623, size: 64)
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 64)
!624 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !625, line: 1216, size: 39680, elements: !626)
!625 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!626 = !{!627, !628, !629, !630, !633, !634, !635, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !659, !732, !1160, !1375, !1378, !1666, !1678, !1679, !1680, !1681, !1682, !1683, !1684, !1685, !1688, !1689, !1690, !1691, !1692, !1700, !1767, !1774, !1775, !1782, !1783, !1784, !1785, !1786, !1787, !1788}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !624, file: !625, line: 1217, baseType: !185, size: 960)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !624, file: !625, line: 1218, baseType: !223, size: 64, offset: 960)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !624, file: !625, line: 1220, baseType: !379, size: 64, offset: 1024)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !624, file: !625, line: 1221, baseType: !631, size: 64, offset: 1088)
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64)
!632 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !625, line: 52, flags: DIFlagFwdDecl)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !624, file: !625, line: 1223, baseType: !623, size: 64, offset: 1152)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !624, file: !625, line: 1225, baseType: !147, size: 128, offset: 1216)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !624, file: !625, line: 1226, baseType: !636, size: 64, offset: 1344)
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 64)
!637 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !625, line: 69, size: 320, elements: !638)
!638 = !{!639, !640, !641, !642, !643, !644, !645, !646}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !637, file: !625, line: 70, baseType: !636, size: 64)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !637, file: !625, line: 70, baseType: !636, size: 64, offset: 64)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !637, file: !625, line: 71, baseType: !5, size: 32, offset: 128)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !637, file: !625, line: 71, baseType: !5, size: 32, offset: 160)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !637, file: !625, line: 72, baseType: !140, size: 32, offset: 192)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !637, file: !625, line: 73, baseType: !134, size: 16, offset: 224)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !637, file: !625, line: 73, baseType: !134, size: 16, offset: 240)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !637, file: !625, line: 74, baseType: !379, size: 64, offset: 256)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !624, file: !625, line: 1227, baseType: !379, size: 64, offset: 1408)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !624, file: !625, line: 1229, baseType: !163, size: 96, offset: 1472)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !624, file: !625, line: 1230, baseType: !163, size: 96, offset: 1568)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !624, file: !625, line: 1231, baseType: !163, size: 96, offset: 1664)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !624, file: !625, line: 1231, baseType: !163, size: 96, offset: 1760)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !624, file: !625, line: 1233, baseType: !5, size: 32, offset: 1856)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !624, file: !625, line: 1234, baseType: !140, size: 32, offset: 1888)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !624, file: !625, line: 1235, baseType: !5, size: 32, offset: 1920)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !624, file: !625, line: 1237, baseType: !134, size: 16, offset: 1952)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !624, file: !625, line: 1239, baseType: !131, size: 8, offset: 1968)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !624, file: !625, line: 1240, baseType: !658, size: 8, offset: 1976)
!658 = !DICompositeType(tag: DW_TAG_array_type, baseType: !131, size: 8, elements: !269)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !624, file: !625, line: 1242, baseType: !660, size: 64, offset: 1984)
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 64)
!661 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !662, line: 328, size: 3456, elements: !663)
!662 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!663 = !{!664, !665, !666, !669, !670, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !698, !699, !700, !703, !708, !709, !712, !716, !720, !724, !728, !729, !730, !731}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !661, file: !662, line: 329, baseType: !185, size: 960)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !661, file: !662, line: 330, baseType: !223, size: 64, offset: 960)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !661, file: !662, line: 332, baseType: !667, size: 64, offset: 1024)
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64)
!668 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !662, line: 332, flags: DIFlagFwdDecl)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !661, file: !662, line: 333, baseType: !136, size: 512, offset: 1088)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "interface_type", scope: !661, file: !662, line: 335, baseType: !671, size: 64, offset: 1600)
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 64)
!672 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !31, line: 41, flags: DIFlagFwdDecl)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !661, file: !662, line: 337, baseType: !456, size: 64, offset: 1664)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "view_center", scope: !661, file: !662, line: 338, baseType: !613, size: 64, offset: 1728)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !661, file: !662, line: 340, baseType: !147, size: 128, offset: 1792)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !661, file: !662, line: 340, baseType: !147, size: 128, offset: 1920)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !661, file: !662, line: 342, baseType: !140, size: 32, offset: 2048)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !661, file: !662, line: 342, baseType: !140, size: 32, offset: 2080)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "cur_index", scope: !661, file: !662, line: 343, baseType: !140, size: 32, offset: 2112)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !661, file: !662, line: 345, baseType: !140, size: 32, offset: 2144)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !661, file: !662, line: 346, baseType: !140, size: 32, offset: 2176)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "is_updating", scope: !661, file: !662, line: 347, baseType: !134, size: 16, offset: 2208)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !661, file: !662, line: 348, baseType: !134, size: 16, offset: 2224)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !661, file: !662, line: 349, baseType: !140, size: 32, offset: 2240)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "nodetype", scope: !661, file: !662, line: 351, baseType: !140, size: 32, offset: 2272)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "edit_quality", scope: !661, file: !662, line: 353, baseType: !134, size: 16, offset: 2304)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "render_quality", scope: !661, file: !662, line: 354, baseType: !134, size: 16, offset: 2320)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "chunksize", scope: !661, file: !662, line: 355, baseType: !140, size: 32, offset: 2336)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "viewer_border", scope: !661, file: !662, line: 357, baseType: !690, size: 128, offset: 2368)
!690 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !691, line: 95, baseType: !692)
!691 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!692 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !691, line: 92, size: 128, elements: !693)
!693 = !{!694, !695, !696, !697}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !692, file: !691, line: 93, baseType: !161, size: 32)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !692, file: !691, line: 93, baseType: !161, size: 32, offset: 32)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !692, file: !691, line: 94, baseType: !161, size: 32, offset: 64)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !692, file: !691, line: 94, baseType: !161, size: 32, offset: 96)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !661, file: !662, line: 363, baseType: !147, size: 128, offset: 2496)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !661, file: !662, line: 363, baseType: !147, size: 128, offset: 2624)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "previews", scope: !661, file: !662, line: 368, baseType: !701, size: 64, offset: 2752)
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 64)
!702 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHash", file: !662, line: 48, flags: DIFlagFwdDecl)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "active_viewer_key", scope: !661, file: !662, line: 372, baseType: !704, size: 32, offset: 2816)
!704 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !662, line: 274, baseType: !705)
!705 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !662, line: 271, size: 32, elements: !706)
!706 = !{!707}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !705, file: !662, line: 273, baseType: !5, size: 32)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !661, file: !662, line: 373, baseType: !140, size: 32, offset: 2848)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "execdata", scope: !661, file: !662, line: 382, baseType: !710, size: 64, offset: 2880)
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 64)
!711 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeExec", file: !662, line: 46, flags: DIFlagFwdDecl)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !661, file: !662, line: 385, baseType: !713, size: 64, offset: 2944)
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !714, size: 64)
!714 = !DISubroutineType(types: !715)
!715 = !{null, !114, !161}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "stats_draw", scope: !661, file: !662, line: 386, baseType: !717, size: 64, offset: 3008)
!717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !718, size: 64)
!718 = !DISubroutineType(types: !719)
!719 = !{null, !114, !486}
!720 = !DIDerivedType(tag: DW_TAG_member, name: "test_break", scope: !661, file: !662, line: 387, baseType: !721, size: 64, offset: 3072)
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 64)
!722 = !DISubroutineType(types: !723)
!723 = !{!140, !114}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "update_draw", scope: !661, file: !662, line: 388, baseType: !725, size: 64, offset: 3136)
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !726, size: 64)
!726 = !DISubroutineType(types: !727)
!727 = !{null, !114}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "tbh", scope: !661, file: !662, line: 389, baseType: !114, size: 64, offset: 3200)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "prh", scope: !661, file: !662, line: 389, baseType: !114, size: 64, offset: 3264)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "sdh", scope: !661, file: !662, line: 389, baseType: !114, size: 64, offset: 3328)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "udh", scope: !661, file: !662, line: 389, baseType: !114, size: 64, offset: 3392)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !624, file: !625, line: 1244, baseType: !733, size: 64, offset: 2048)
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !734, size: 64)
!734 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !735, line: 200, size: 17024, elements: !736)
!735 = !DIFile(filename: "blender/source/blender/makesdna/DNA_sequence_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!736 = !{!737, !738, !739, !740, !1153, !1154, !1155, !1156, !1157, !1158, !1159}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "seqbasep", scope: !734, file: !735, line: 201, baseType: !228, size: 64)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !734, file: !735, line: 202, baseType: !147, size: 128, offset: 64)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "metastack", scope: !734, file: !735, line: 203, baseType: !147, size: 128, offset: 192)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "act_seq", scope: !734, file: !735, line: 206, baseType: !741, size: 64, offset: 320)
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 64)
!742 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sequence", file: !735, line: 190, baseType: !743)
!743 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sequence", file: !735, line: 126, size: 2816, elements: !744)
!744 = !{!745, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !843, !844, !845, !846, !1124, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1152}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !743, file: !735, line: 127, baseType: !746, size: 64)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !743, size: 64)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !743, file: !735, line: 127, baseType: !746, size: 64, offset: 64)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !743, file: !735, line: 128, baseType: !114, size: 64, offset: 128)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !743, file: !735, line: 129, baseType: !114, size: 64, offset: 192)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !743, file: !735, line: 130, baseType: !136, size: 512, offset: 256)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !743, file: !735, line: 132, baseType: !140, size: 32, offset: 768)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !743, file: !735, line: 132, baseType: !140, size: 32, offset: 800)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !743, file: !735, line: 133, baseType: !140, size: 32, offset: 832)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !743, file: !735, line: 134, baseType: !140, size: 32, offset: 864)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "startofs", scope: !743, file: !735, line: 134, baseType: !140, size: 32, offset: 896)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "endofs", scope: !743, file: !735, line: 134, baseType: !140, size: 32, offset: 928)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !743, file: !735, line: 135, baseType: !140, size: 32, offset: 960)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !743, file: !735, line: 135, baseType: !140, size: 32, offset: 992)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !743, file: !735, line: 136, baseType: !140, size: 32, offset: 1024)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !743, file: !735, line: 136, baseType: !140, size: 32, offset: 1056)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "startdisp", scope: !743, file: !735, line: 137, baseType: !140, size: 32, offset: 1088)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "enddisp", scope: !743, file: !735, line: 137, baseType: !140, size: 32, offset: 1120)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "sat", scope: !743, file: !735, line: 138, baseType: !161, size: 32, offset: 1152)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "mul", scope: !743, file: !735, line: 139, baseType: !161, size: 32, offset: 1184)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "handsize", scope: !743, file: !735, line: 139, baseType: !161, size: 32, offset: 1216)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "anim_preseek", scope: !743, file: !735, line: 141, baseType: !134, size: 16, offset: 1248)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "streamindex", scope: !743, file: !735, line: 142, baseType: !134, size: 16, offset: 1264)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "multicam_source", scope: !743, file: !735, line: 143, baseType: !140, size: 32, offset: 1280)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "clip_flag", scope: !743, file: !735, line: 144, baseType: !140, size: 32, offset: 1312)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "strip", scope: !743, file: !735, line: 146, baseType: !771, size: 64, offset: 1344)
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 64)
!772 = !DIDerivedType(tag: DW_TAG_typedef, name: "Strip", file: !735, line: 114, baseType: !773)
!773 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Strip", file: !735, line: 99, size: 7232, elements: !774)
!774 = !{!775, !777, !778, !779, !780, !781, !782, !793, !797, !811, !820, !827, !837}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !773, file: !735, line: 100, baseType: !776, size: 64)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 64)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !773, file: !735, line: 100, baseType: !776, size: 64, offset: 64)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !773, file: !735, line: 101, baseType: !140, size: 32, offset: 128)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !773, file: !735, line: 101, baseType: !140, size: 32, offset: 160)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !773, file: !735, line: 102, baseType: !140, size: 32, offset: 192)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !773, file: !735, line: 102, baseType: !140, size: 32, offset: 224)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "stripdata", scope: !773, file: !735, line: 103, baseType: !783, size: 64, offset: 256)
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !784, size: 64)
!784 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripElem", file: !735, line: 59, baseType: !785)
!785 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripElem", file: !735, line: 56, size: 2112, elements: !786)
!786 = !{!787, !791, !792}
!787 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !785, file: !735, line: 57, baseType: !788, size: 2048)
!788 = !DICompositeType(tag: DW_TAG_array_type, baseType: !131, size: 2048, elements: !789)
!789 = !{!790}
!790 = !DISubrange(count: 256)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "orig_width", scope: !785, file: !735, line: 58, baseType: !140, size: 32, offset: 2048)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "orig_height", scope: !785, file: !735, line: 58, baseType: !140, size: 32, offset: 2080)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !773, file: !735, line: 106, baseType: !794, size: 6144, offset: 320)
!794 = !DICompositeType(tag: DW_TAG_array_type, baseType: !131, size: 6144, elements: !795)
!795 = !{!796}
!796 = !DISubrange(count: 768)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !773, file: !735, line: 107, baseType: !798, size: 64, offset: 6464)
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !799, size: 64)
!799 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripProxy", file: !735, line: 97, baseType: !800)
!800 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripProxy", file: !735, line: 83, size: 8320, elements: !801)
!801 = !{!802, !803, !804, !807, !808, !809, !810}
!802 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !800, file: !735, line: 84, baseType: !794, size: 6144)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !800, file: !735, line: 87, baseType: !788, size: 2048, offset: 6144)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !800, file: !735, line: 88, baseType: !805, size: 64, offset: 8192)
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !806, size: 64)
!806 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !619, line: 41, flags: DIFlagFwdDecl)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !800, file: !735, line: 90, baseType: !134, size: 16, offset: 8256)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !800, file: !735, line: 92, baseType: !134, size: 16, offset: 8272)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flags", scope: !800, file: !735, line: 93, baseType: !134, size: 16, offset: 8288)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flags", scope: !800, file: !735, line: 95, baseType: !134, size: 16, offset: 8304)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !773, file: !735, line: 108, baseType: !812, size: 64, offset: 6528)
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !813, size: 64)
!813 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripCrop", file: !735, line: 66, baseType: !814)
!814 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripCrop", file: !735, line: 61, size: 128, elements: !815)
!815 = !{!816, !817, !818, !819}
!816 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !814, file: !735, line: 62, baseType: !140, size: 32)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !814, file: !735, line: 63, baseType: !140, size: 32, offset: 32)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !814, file: !735, line: 64, baseType: !140, size: 32, offset: 64)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !814, file: !735, line: 65, baseType: !140, size: 32, offset: 96)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !773, file: !735, line: 109, baseType: !821, size: 64, offset: 6592)
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !822, size: 64)
!822 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripTransform", file: !735, line: 71, baseType: !823)
!823 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripTransform", file: !735, line: 68, size: 64, elements: !824)
!824 = !{!825, !826}
!825 = !DIDerivedType(tag: DW_TAG_member, name: "xofs", scope: !823, file: !735, line: 69, baseType: !140, size: 32)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "yofs", scope: !823, file: !735, line: 70, baseType: !140, size: 32, offset: 32)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "color_balance", scope: !773, file: !735, line: 110, baseType: !828, size: 64, offset: 6656)
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !829, size: 64)
!829 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripColorBalance", file: !735, line: 81, baseType: !830)
!830 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripColorBalance", file: !735, line: 73, size: 352, elements: !831)
!831 = !{!832, !833, !834, !835, !836}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "lift", scope: !830, file: !735, line: 74, baseType: !163, size: 96)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !830, file: !735, line: 75, baseType: !163, size: 96, offset: 96)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "gain", scope: !830, file: !735, line: 76, baseType: !163, size: 96, offset: 192)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !830, file: !735, line: 77, baseType: !140, size: 32, offset: 288)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !830, file: !735, line: 78, baseType: !140, size: 32, offset: 320)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !773, file: !735, line: 113, baseType: !838, size: 512, offset: 6720)
!838 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !839, line: 182, baseType: !840)
!839 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!840 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !839, line: 180, size: 512, elements: !841)
!841 = !{!842}
!842 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !840, file: !839, line: 181, baseType: !136, size: 512)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !743, file: !735, line: 148, baseType: !385, size: 64, offset: 1408)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !743, file: !735, line: 151, baseType: !623, size: 64, offset: 1472)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "scene_camera", scope: !743, file: !735, line: 152, baseType: !379, size: 64, offset: 1536)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "clip", scope: !743, file: !735, line: 153, baseType: !847, size: 64, offset: 1600)
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !848, size: 64)
!848 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClip", file: !849, line: 64, size: 19136, elements: !850)
!849 = !DIFile(filename: "blender/source/blender/makesdna/DNA_movieclip_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!850 = !{!851, !852, !853, !854, !855, !856, !858, !859, !860, !861, !864, !865, !1110, !1111, !1119, !1120, !1121, !1122, !1123}
!851 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !848, file: !849, line: 65, baseType: !185, size: 960)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !848, file: !849, line: 66, baseType: !223, size: 64, offset: 960)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !848, file: !849, line: 68, baseType: !203, size: 8192, offset: 1024)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !848, file: !849, line: 70, baseType: !140, size: 32, offset: 9216)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !848, file: !849, line: 71, baseType: !140, size: 32, offset: 9248)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "lastsize", scope: !848, file: !849, line: 72, baseType: !857, size: 64, offset: 9280)
!857 = !DICompositeType(tag: DW_TAG_array_type, baseType: !140, size: 64, elements: !614)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !848, file: !849, line: 74, baseType: !161, size: 32, offset: 9344)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !848, file: !849, line: 74, baseType: !161, size: 32, offset: 9376)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !848, file: !849, line: 76, baseType: !805, size: 64, offset: 9408)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !848, file: !849, line: 77, baseType: !862, size: 64, offset: 9472)
!862 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !863, size: 64)
!863 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipCache", file: !849, line: 77, flags: DIFlagFwdDecl)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !848, file: !849, line: 78, baseType: !456, size: 64, offset: 9536)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "tracking", scope: !848, file: !849, line: 80, baseType: !866, size: 2624, offset: 9600)
!866 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTracking", file: !867, line: 340, size: 2624, elements: !868)
!867 = !DIFile(filename: "blender/source/blender/makesdna/DNA_tracking_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!868 = !{!869, !897, !915, !916, !917, !932, !990, !991, !1090, !1091, !1092, !1093, !1099}
!869 = !DIDerivedType(tag: DW_TAG_member, name: "settings", scope: !866, file: !867, line: 341, baseType: !870, size: 576)
!870 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingSettings", file: !867, line: 251, baseType: !871)
!871 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingSettings", file: !867, line: 207, size: 576, elements: !872)
!872 = !{!873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896}
!873 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !871, file: !867, line: 208, baseType: !140, size: 32)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "default_motion_model", scope: !871, file: !867, line: 211, baseType: !134, size: 16, offset: 32)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "default_algorithm_flag", scope: !871, file: !867, line: 212, baseType: !134, size: 16, offset: 48)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "default_minimum_correlation", scope: !871, file: !867, line: 213, baseType: !161, size: 32, offset: 64)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_size", scope: !871, file: !867, line: 214, baseType: !134, size: 16, offset: 96)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "default_search_size", scope: !871, file: !867, line: 215, baseType: !134, size: 16, offset: 112)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "default_frames_limit", scope: !871, file: !867, line: 216, baseType: !134, size: 16, offset: 128)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "default_margin", scope: !871, file: !867, line: 217, baseType: !134, size: 16, offset: 144)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_match", scope: !871, file: !867, line: 218, baseType: !134, size: 16, offset: 160)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "default_flag", scope: !871, file: !867, line: 219, baseType: !134, size: 16, offset: 176)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "default_weight", scope: !871, file: !867, line: 220, baseType: !161, size: 32, offset: 192)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "motion_flag", scope: !871, file: !867, line: 222, baseType: !134, size: 16, offset: 224)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "speed", scope: !871, file: !867, line: 225, baseType: !134, size: 16, offset: 240)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe1", scope: !871, file: !867, line: 228, baseType: !140, size: 32, offset: 256)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe2", scope: !871, file: !867, line: 229, baseType: !140, size: 32, offset: 288)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction_flag", scope: !871, file: !867, line: 233, baseType: !140, size: 32, offset: 320)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "refine_camera_intrinsics", scope: !871, file: !867, line: 236, baseType: !134, size: 16, offset: 352)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !871, file: !867, line: 236, baseType: !134, size: 16, offset: 368)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !871, file: !867, line: 241, baseType: !161, size: 32, offset: 384)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "clean_frames", scope: !871, file: !867, line: 244, baseType: !140, size: 32, offset: 416)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "clean_action", scope: !871, file: !867, line: 244, baseType: !140, size: 32, offset: 448)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "clean_error", scope: !871, file: !867, line: 245, baseType: !161, size: 32, offset: 480)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "object_distance", scope: !871, file: !867, line: 248, baseType: !161, size: 32, offset: 512)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !871, file: !867, line: 250, baseType: !140, size: 32, offset: 544)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !866, file: !867, line: 342, baseType: !898, size: 448, offset: 576)
!898 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingCamera", file: !867, line: 79, baseType: !899)
!899 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingCamera", file: !867, line: 61, size: 448, elements: !900)
!900 = !{!901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914}
!901 = !DIDerivedType(tag: DW_TAG_member, name: "intrinsics", scope: !899, file: !867, line: 62, baseType: !114, size: 64)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_model", scope: !899, file: !867, line: 64, baseType: !134, size: 16, offset: 64)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !899, file: !867, line: 65, baseType: !134, size: 16, offset: 80)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "sensor_width", scope: !899, file: !867, line: 67, baseType: !161, size: 32, offset: 96)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_aspect", scope: !899, file: !867, line: 68, baseType: !161, size: 32, offset: 128)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "focal", scope: !899, file: !867, line: 69, baseType: !161, size: 32, offset: 160)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !899, file: !867, line: 70, baseType: !134, size: 16, offset: 192)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !899, file: !867, line: 71, baseType: !134, size: 16, offset: 208)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "principal", scope: !899, file: !867, line: 72, baseType: !613, size: 64, offset: 224)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "k1", scope: !899, file: !867, line: 75, baseType: !161, size: 32, offset: 288)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "k2", scope: !899, file: !867, line: 75, baseType: !161, size: 32, offset: 320)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "k3", scope: !899, file: !867, line: 75, baseType: !161, size: 32, offset: 352)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "division_k1", scope: !899, file: !867, line: 78, baseType: !161, size: 32, offset: 384)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "division_k2", scope: !899, file: !867, line: 78, baseType: !161, size: 32, offset: 416)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "tracks", scope: !866, file: !867, line: 343, baseType: !147, size: 128, offset: 1024)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "plane_tracks", scope: !866, file: !867, line: 344, baseType: !147, size: 128, offset: 1152)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction", scope: !866, file: !867, line: 345, baseType: !918, size: 192, offset: 1280)
!918 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingReconstruction", file: !867, line: 278, baseType: !919)
!919 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingReconstruction", file: !867, line: 270, size: 192, elements: !920)
!920 = !{!921, !922, !923, !924, !925}
!921 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !919, file: !867, line: 271, baseType: !140, size: 32)
