; ModuleID = 'blender/source/blender/blenkernel/intern/mesh.c'
source_filename = "blender/source/blender/blenkernel/intern/mesh.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.Global = type { %struct.Main*, [1024 x i8], [1024 x i8], i8, i8, i8, %struct.ListBase, i8, i8, i8, i16, i16, i16, i8, i16, i32, i32, i8, i32, i32, [200 x i8] }
%struct.Main = type { %struct.Main*, %struct.Main*, [1024 x i8], i16, i16, i16, i16, i64, [16 x i8], i16, %struct.Library*, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, [256 x i8], %struct.EvaluationContext*, %struct.MainLock* }
%struct.Library = type { %struct.ID, %struct.ID*, %struct.FileData*, [1024 x i8], [1024 x i8], %struct.Library*, %struct.PackedFile* }
%struct.ID = type { i8*, i8*, %struct.ID*, %struct.Library*, [66 x i8], i16, i32, i32, i32, %struct.IDProperty* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "corner_indices", scope: !2, file: !3, line: 969, type: !1111, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "test_index_face", scope: !3, file: !3, line: 921, type: !4, scopeLine: 922, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !65, retainedNodes: !2745)
!3 = !DIFile(filename: "blender/source/blender/blenkernel/intern/mesh.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !DISubroutineType(types: !5)
!5 = !{!6, !7, !22, !6, !6}
!6 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "MFace", file: !9, line: 46, baseType: !10)
!9 = !DIFile(filename: "blender/source/blender/makesdna/DNA_meshdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!10 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MFace", file: !9, line: 42, size: 160, elements: !11)
!11 = !{!12, !14, !15, !16, !17, !19, !21}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !10, file: !9, line: 43, baseType: !13, size: 32)
!13 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !10, file: !9, line: 43, baseType: !13, size: 32, offset: 32)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !10, file: !9, line: 43, baseType: !13, size: 32, offset: 64)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !10, file: !9, line: 43, baseType: !13, size: 32, offset: 96)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !10, file: !9, line: 44, baseType: !18, size: 16, offset: 128)
!18 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "edcode", scope: !10, file: !9, line: 45, baseType: !20, size: 8, offset: 144)
!20 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !10, file: !9, line: 45, baseType: !20, size: 8, offset: 152)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomData", file: !24, line: 73, baseType: !25)
!24 = !DIFile(filename: "blender/source/blender/makesdna/DNA_customdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!25 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomData", file: !24, line: 64, size: 1600, elements: !26)
!26 = !{!27, !46, !50, !51, !52, !53, !56}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !25, file: !24, line: 65, baseType: !28, size: 64)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataLayer", file: !24, line: 53, baseType: !30)
!30 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataLayer", file: !24, line: 42, size: 832, elements: !31)
!31 = !{!32, !33, !34, !35, !36, !37, !38, !39, !40, !44}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !30, file: !24, line: 43, baseType: !6, size: 32)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !30, file: !24, line: 44, baseType: !6, size: 32, offset: 32)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !30, file: !24, line: 45, baseType: !6, size: 32, offset: 64)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !30, file: !24, line: 46, baseType: !6, size: 32, offset: 96)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "active_rnd", scope: !30, file: !24, line: 47, baseType: !6, size: 32, offset: 128)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "active_clone", scope: !30, file: !24, line: 48, baseType: !6, size: 32, offset: 160)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "active_mask", scope: !30, file: !24, line: 49, baseType: !6, size: 32, offset: 192)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !30, file: !24, line: 50, baseType: !6, size: 32, offset: 224)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !30, file: !24, line: 51, baseType: !41, size: 512, offset: 256)
!41 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 512, elements: !42)
!42 = !{!43}
!43 = !DISubrange(count: 64)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !30, file: !24, line: 52, baseType: !45, size: 64, offset: 768)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "typemap", scope: !25, file: !24, line: 66, baseType: !47, size: 1312, offset: 64)
!47 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 1312, elements: !48)
!48 = !{!49}
!49 = !DISubrange(count: 41)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "totlayer", scope: !25, file: !24, line: 69, baseType: !6, size: 32, offset: 1376)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "maxlayer", scope: !25, file: !24, line: 69, baseType: !6, size: 32, offset: 1408)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "totsize", scope: !25, file: !24, line: 70, baseType: !6, size: 32, offset: 1440)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !25, file: !24, line: 71, baseType: !54, size: 64, offset: 1472)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!55 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool", file: !24, line: 71, flags: DIFlagFwdDecl)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !25, file: !24, line: 72, baseType: !57, size: 64, offset: 1536)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataExternal", file: !24, line: 59, baseType: !59)
!59 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataExternal", file: !24, line: 57, size: 8192, elements: !60)
!60 = !{!61}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !59, file: !24, line: 58, baseType: !62, size: 8192)
!62 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 8192, elements: !63)
!63 = !{!64}
!64 = !DISubrange(count: 1024)
!65 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !66, retainedTypes: !268, globals: !2742, splitDebugInlining: false, nameTableKind: None)
!66 = !{!67, !73, !78, !82, !88, !94, !105, !111, !117, !125, !132, !175, !192, !196, !201, !214, !218, !226, !237, !243, !256}
!67 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "DerivedMeshType", file: !68, line: 128, baseType: !13, size: 32, elements: !69)
!68 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_DerivedMesh.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!69 = !{!70, !71, !72}
!70 = !DIEnumerator(name: "DM_TYPE_CDDM", value: 0, isUnsigned: true)
!71 = !DIEnumerator(name: "DM_TYPE_EDITBMESH", value: 1, isUnsigned: true)
!72 = !DIEnumerator(name: "DM_TYPE_CCGDM", value: 2, isUnsigned: true)
!73 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "DMDirtyFlag", file: !68, line: 164, baseType: !13, size: 32, elements: !74)
!74 = !{!75, !76, !77}
!75 = !DIEnumerator(name: "DM_DIRTY_TESS_CDLAYERS", value: 1, isUnsigned: true)
!76 = !DIEnumerator(name: "DM_DIRTY_MCOL_UPDATE_DRAW", value: 2, isUnsigned: true)
!77 = !DIEnumerator(name: "DM_DIRTY_NORMALS", value: 4, isUnsigned: true)
!78 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "DMForeachFlag", file: !68, line: 159, baseType: !13, size: 32, elements: !79)
!79 = !{!80, !81}
!80 = !DIEnumerator(name: "DM_FOREACH_NOP", value: 0, isUnsigned: true)
!81 = !DIEnumerator(name: "DM_FOREACH_USE_NORMAL", value: 1, isUnsigned: true)
!82 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "DMDrawOption", file: !68, line: 134, baseType: !13, size: 32, elements: !83)
!83 = !{!84, !85, !86, !87}
!84 = !DIEnumerator(name: "DM_DRAW_OPTION_SKIP", value: 0, isUnsigned: true)
!85 = !DIEnumerator(name: "DM_DRAW_OPTION_NORMAL", value: 1, isUnsigned: true)
!86 = !DIEnumerator(name: "DM_DRAW_OPTION_NO_MCOL", value: 2, isUnsigned: true)
!87 = !DIEnumerator(name: "DM_DRAW_OPTION_STIPPLE", value: 3, isUnsigned: true)
!88 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "DMDrawFlag", file: !68, line: 152, baseType: !13, size: 32, elements: !89)
!89 = !{!90, !91, !92, !93}
!90 = !DIEnumerator(name: "DM_DRAW_USE_COLORS", value: 1, isUnsigned: true)
!91 = !DIEnumerator(name: "DM_DRAW_ALWAYS_SMOOTH", value: 2, isUnsigned: true)
!92 = !DIEnumerator(name: "DM_DRAW_USE_ACTIVE_UV", value: 4, isUnsigned: true)
!93 = !DIEnumerator(name: "DM_DRAW_USE_TEXPAINT_UV", value: 8, isUnsigned: true)
!94 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eBMOpSlotType", file: !95, line: 94, baseType: !13, size: 32, elements: !96)
!95 = !DIFile(filename: "blender/source/blender/bmesh/intern/bmesh_operator_api.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!96 = !{!97, !98, !99, !100, !101, !102, !103, !104}
!97 = !DIEnumerator(name: "BMO_OP_SLOT_BOOL", value: 1, isUnsigned: true)
!98 = !DIEnumerator(name: "BMO_OP_SLOT_INT", value: 2, isUnsigned: true)
!99 = !DIEnumerator(name: "BMO_OP_SLOT_FLT", value: 3, isUnsigned: true)
!100 = !DIEnumerator(name: "BMO_OP_SLOT_PTR", value: 4, isUnsigned: true)
!101 = !DIEnumerator(name: "BMO_OP_SLOT_MAT", value: 5, isUnsigned: true)
!102 = !DIEnumerator(name: "BMO_OP_SLOT_VEC", value: 8, isUnsigned: true)
!103 = !DIEnumerator(name: "BMO_OP_SLOT_ELEMENT_BUF", value: 9, isUnsigned: true)
!104 = !DIEnumerator(name: "BMO_OP_SLOT_MAPPING", value: 10, isUnsigned: true)
!105 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eBMOpSlotSubType_Elem", file: !95, line: 116, baseType: !13, size: 32, elements: !106)
!106 = !{!107, !108, !109, !110}
!107 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_ELEM_VERT", value: 1, isUnsigned: true)
!108 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_ELEM_EDGE", value: 2, isUnsigned: true)
!109 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_ELEM_FACE", value: 8, isUnsigned: true)
!110 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_ELEM_IS_SINGLE", value: 16, isUnsigned: true)
!111 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eBMOpSlotSubType_Ptr", file: !95, line: 131, baseType: !13, size: 32, elements: !112)
!112 = !{!113, !114, !115, !116}
!113 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_PTR_BMESH", value: 100, isUnsigned: true)
!114 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_PTR_SCENE", value: 101, isUnsigned: true)
!115 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_PTR_OBJECT", value: 102, isUnsigned: true)
!116 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_PTR_MESH", value: 103, isUnsigned: true)
!117 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eBMOpSlotSubType_Map", file: !95, line: 123, baseType: !13, size: 32, elements: !118)
!118 = !{!119, !120, !121, !122, !123, !124}
!119 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_EMPTY", value: 64, isUnsigned: true)
!120 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_ELEM", value: 65, isUnsigned: true)
!121 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_FLT", value: 66, isUnsigned: true)
!122 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_INT", value: 67, isUnsigned: true)
!123 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_BOOL", value: 68, isUnsigned: true)
!124 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_INTERNAL", value: 69, isUnsigned: true)
!125 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !95, line: 182, baseType: !13, size: 32, elements: !126)
!126 = !{!127, !128, !129, !130, !131}
!127 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_NOP", value: 0, isUnsigned: true)
!128 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_UNTAN_MULTIRES", value: 1, isUnsigned: true)
!129 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_NORMALS_CALC", value: 2, isUnsigned: true)
!130 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_SELECT_FLUSH", value: 4, isUnsigned: true)
!131 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_SELECT_VALIDATE", value: 8, isUnsigned: true)
!132 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !24, line: 76, baseType: !13, size: 32, elements: !133)
!133 = !{!134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174}
!134 = !DIEnumerator(name: "CD_MVERT", value: 0, isUnsigned: true)
!135 = !DIEnumerator(name: "CD_MSTICKY", value: 1, isUnsigned: true)
!136 = !DIEnumerator(name: "CD_MDEFORMVERT", value: 2, isUnsigned: true)
!137 = !DIEnumerator(name: "CD_MEDGE", value: 3, isUnsigned: true)
!138 = !DIEnumerator(name: "CD_MFACE", value: 4, isUnsigned: true)
!139 = !DIEnumerator(name: "CD_MTFACE", value: 5, isUnsigned: true)
!140 = !DIEnumerator(name: "CD_MCOL", value: 6, isUnsigned: true)
!141 = !DIEnumerator(name: "CD_ORIGINDEX", value: 7, isUnsigned: true)
!142 = !DIEnumerator(name: "CD_NORMAL", value: 8, isUnsigned: true)
!143 = !DIEnumerator(name: "CD_PROP_FLT", value: 10, isUnsigned: true)
!144 = !DIEnumerator(name: "CD_PROP_INT", value: 11, isUnsigned: true)
!145 = !DIEnumerator(name: "CD_PROP_STR", value: 12, isUnsigned: true)
!146 = !DIEnumerator(name: "CD_ORIGSPACE", value: 13, isUnsigned: true)
!147 = !DIEnumerator(name: "CD_ORCO", value: 14, isUnsigned: true)
!148 = !DIEnumerator(name: "CD_MTEXPOLY", value: 15, isUnsigned: true)
!149 = !DIEnumerator(name: "CD_MLOOPUV", value: 16, isUnsigned: true)
!150 = !DIEnumerator(name: "CD_MLOOPCOL", value: 17, isUnsigned: true)
!151 = !DIEnumerator(name: "CD_TANGENT", value: 18, isUnsigned: true)
!152 = !DIEnumerator(name: "CD_MDISPS", value: 19, isUnsigned: true)
!153 = !DIEnumerator(name: "CD_PREVIEW_MCOL", value: 20, isUnsigned: true)
!154 = !DIEnumerator(name: "CD_ID_MCOL", value: 21, isUnsigned: true)
!155 = !DIEnumerator(name: "CD_TEXTURE_MCOL", value: 22, isUnsigned: true)
!156 = !DIEnumerator(name: "CD_CLOTH_ORCO", value: 23, isUnsigned: true)
!157 = !DIEnumerator(name: "CD_RECAST", value: 24, isUnsigned: true)
!158 = !DIEnumerator(name: "CD_MPOLY", value: 25, isUnsigned: true)
!159 = !DIEnumerator(name: "CD_MLOOP", value: 26, isUnsigned: true)
!160 = !DIEnumerator(name: "CD_SHAPE_KEYINDEX", value: 27, isUnsigned: true)
!161 = !DIEnumerator(name: "CD_SHAPEKEY", value: 28, isUnsigned: true)
!162 = !DIEnumerator(name: "CD_BWEIGHT", value: 29, isUnsigned: true)
!163 = !DIEnumerator(name: "CD_CREASE", value: 30, isUnsigned: true)
!164 = !DIEnumerator(name: "CD_ORIGSPACE_MLOOP", value: 31, isUnsigned: true)
!165 = !DIEnumerator(name: "CD_PREVIEW_MLOOPCOL", value: 32, isUnsigned: true)
!166 = !DIEnumerator(name: "CD_BM_ELEM_PYPTR", value: 33, isUnsigned: true)
!167 = !DIEnumerator(name: "CD_PAINT_MASK", value: 34, isUnsigned: true)
!168 = !DIEnumerator(name: "CD_GRID_PAINT_MASK", value: 35, isUnsigned: true)
!169 = !DIEnumerator(name: "CD_MVERT_SKIN", value: 36, isUnsigned: true)
!170 = !DIEnumerator(name: "CD_FREESTYLE_EDGE", value: 37, isUnsigned: true)
!171 = !DIEnumerator(name: "CD_FREESTYLE_FACE", value: 38, isUnsigned: true)
!172 = !DIEnumerator(name: "CD_MLOOPTANGENT", value: 39, isUnsigned: true)
!173 = !DIEnumerator(name: "CD_TESSLOOPNORMAL", value: 40, isUnsigned: true)
!174 = !DIEnumerator(name: "CD_NUMTYPES", value: 41, isUnsigned: true)
!175 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "BMIterType", file: !176, line: 57, baseType: !13, size: 32, elements: !177)
!176 = !DIFile(filename: "blender/source/blender/bmesh/intern/bmesh_iterators.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!177 = !{!178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191}
!178 = !DIEnumerator(name: "BM_VERTS_OF_MESH", value: 1, isUnsigned: true)
!179 = !DIEnumerator(name: "BM_EDGES_OF_MESH", value: 2, isUnsigned: true)
!180 = !DIEnumerator(name: "BM_FACES_OF_MESH", value: 3, isUnsigned: true)
!181 = !DIEnumerator(name: "BM_EDGES_OF_VERT", value: 4, isUnsigned: true)
!182 = !DIEnumerator(name: "BM_FACES_OF_VERT", value: 5, isUnsigned: true)
!183 = !DIEnumerator(name: "BM_LOOPS_OF_VERT", value: 6, isUnsigned: true)
!184 = !DIEnumerator(name: "BM_VERTS_OF_EDGE", value: 7, isUnsigned: true)
!185 = !DIEnumerator(name: "BM_FACES_OF_EDGE", value: 8, isUnsigned: true)
!186 = !DIEnumerator(name: "BM_VERTS_OF_FACE", value: 9, isUnsigned: true)
!187 = !DIEnumerator(name: "BM_EDGES_OF_FACE", value: 10, isUnsigned: true)
!188 = !DIEnumerator(name: "BM_LOOPS_OF_FACE", value: 11, isUnsigned: true)
!189 = !DIEnumerator(name: "BM_ALL_LOOPS_OF_FACE", value: 12, isUnsigned: true)
!190 = !DIEnumerator(name: "BM_LOOPS_OF_LOOP", value: 13, isUnsigned: true)
!191 = !DIEnumerator(name: "BM_LOOPS_OF_EDGE", value: 14, isUnsigned: true)
!192 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "MVertSkinFlag", file: !9, line: 263, baseType: !13, size: 32, elements: !193)
!193 = !{!194, !195}
!194 = !DIEnumerator(name: "MVERT_SKIN_ROOT", value: 1, isUnsigned: true)
!195 = !DIEnumerator(name: "MVERT_SKIN_LOOSE", value: 2, isUnsigned: true)
!196 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !197, line: 103, baseType: !13, size: 32, elements: !198)
!197 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!198 = !{!199, !200}
!199 = !DIEnumerator(name: "BOUNDBOX_DISABLED", value: 1, isUnsigned: true)
!200 = !DIEnumerator(name: "BOUNDBOX_DIRTY", value: 2, isUnsigned: true)
!201 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !197, line: 339, baseType: !13, size: 32, elements: !202)
!202 = !{!203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213}
!203 = !DIEnumerator(name: "OB_EMPTY", value: 0, isUnsigned: true)
!204 = !DIEnumerator(name: "OB_MESH", value: 1, isUnsigned: true)
!205 = !DIEnumerator(name: "OB_CURVE", value: 2, isUnsigned: true)
!206 = !DIEnumerator(name: "OB_SURF", value: 3, isUnsigned: true)
!207 = !DIEnumerator(name: "OB_FONT", value: 4, isUnsigned: true)
!208 = !DIEnumerator(name: "OB_MBALL", value: 5, isUnsigned: true)
!209 = !DIEnumerator(name: "OB_LAMP", value: 10, isUnsigned: true)
!210 = !DIEnumerator(name: "OB_CAMERA", value: 11, isUnsigned: true)
!211 = !DIEnumerator(name: "OB_SPEAKER", value: 12, isUnsigned: true)
!212 = !DIEnumerator(name: "OB_LATTICE", value: 22, isUnsigned: true)
!213 = !DIEnumerator(name: "OB_ARMATURE", value: 25, isUnsigned: true)
!214 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !9, line: 341, baseType: !13, size: 32, elements: !215)
!215 = !{!216, !217}
!216 = !DIEnumerator(name: "ME_SMOOTH", value: 1, isUnsigned: true)
!217 = !DIEnumerator(name: "ME_FACE_SEL", value: 2, isUnsigned: true)
!218 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !9, line: 313, baseType: !13, size: 32, elements: !219)
!219 = !{!220, !221, !222, !223, !224, !225}
!220 = !DIEnumerator(name: "ME_EDGEDRAW", value: 2, isUnsigned: true)
!221 = !DIEnumerator(name: "ME_SEAM", value: 4, isUnsigned: true)
!222 = !DIEnumerator(name: "ME_EDGERENDER", value: 32, isUnsigned: true)
!223 = !DIEnumerator(name: "ME_LOOSEEDGE", value: 128, isUnsigned: true)
!224 = !DIEnumerator(name: "ME_EDGE_TMP_TAG", value: 256, isUnsigned: true)
!225 = !DIEnumerator(name: "ME_SHARP", value: 512, isUnsigned: true)
!226 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ModifierMode", file: !227, line: 88, baseType: !6, size: 32, elements: !228)
!227 = !DIFile(filename: "blender/source/blender/makesdna/DNA_modifier_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!228 = !{!229, !230, !231, !232, !233, !234, !235, !236}
!229 = !DIEnumerator(name: "eModifierMode_Realtime", value: 1)
!230 = !DIEnumerator(name: "eModifierMode_Render", value: 2)
!231 = !DIEnumerator(name: "eModifierMode_Editmode", value: 4)
!232 = !DIEnumerator(name: "eModifierMode_OnCage", value: 8)
!233 = !DIEnumerator(name: "eModifierMode_Expanded", value: 16)
!234 = !DIEnumerator(name: "eModifierMode_Virtual", value: 32)
!235 = !DIEnumerator(name: "eModifierMode_ApplyOnSpline", value: 64)
!236 = !DIEnumerator(name: "eModifierMode_DisableTemporary", value: -2147483648)
!237 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eEvaluationMode", file: !238, line: 62, baseType: !13, size: 32, elements: !239)
!238 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_depsgraph.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!239 = !{!240, !241, !242}
!240 = !DIEnumerator(name: "DAG_EVAL_VIEWPORT", value: 0, isUnsigned: true)
!241 = !DIEnumerator(name: "DAG_EVAL_PREVIEW", value: 1, isUnsigned: true)
!242 = !DIEnumerator(name: "DAG_EVAL_RENDER", value: 2, isUnsigned: true)
!243 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 65, baseType: !13, size: 32, elements: !244)
!244 = !{!245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255}
!245 = !DIEnumerator(name: "MESHCMP_DVERT_WEIGHTMISMATCH", value: 1, isUnsigned: true)
!246 = !DIEnumerator(name: "MESHCMP_DVERT_GROUPMISMATCH", value: 2, isUnsigned: true)
!247 = !DIEnumerator(name: "MESHCMP_DVERT_TOTGROUPMISMATCH", value: 3, isUnsigned: true)
!248 = !DIEnumerator(name: "MESHCMP_LOOPCOLMISMATCH", value: 4, isUnsigned: true)
!249 = !DIEnumerator(name: "MESHCMP_LOOPUVMISMATCH", value: 5, isUnsigned: true)
!250 = !DIEnumerator(name: "MESHCMP_LOOPMISMATCH", value: 6, isUnsigned: true)
!251 = !DIEnumerator(name: "MESHCMP_POLYVERTMISMATCH", value: 7, isUnsigned: true)
!252 = !DIEnumerator(name: "MESHCMP_POLYMISMATCH", value: 8, isUnsigned: true)
!253 = !DIEnumerator(name: "MESHCMP_EDGEUNKNOWN", value: 9, isUnsigned: true)
!254 = !DIEnumerator(name: "MESHCMP_VERTCOMISMATCH", value: 10, isUnsigned: true)
!255 = !DIEnumerator(name: "MESHCMP_CDLAYERS_MISMATCH", value: 11, isUnsigned: true)
!256 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !257, line: 123, baseType: !13, size: 32, elements: !258)
!257 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_global.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!258 = !{!259, !260, !261, !262, !263, !264, !265, !266, !267}
!259 = !DIEnumerator(name: "G_DEBUG", value: 1, isUnsigned: true)
!260 = !DIEnumerator(name: "G_DEBUG_FFMPEG", value: 2, isUnsigned: true)
!261 = !DIEnumerator(name: "G_DEBUG_PYTHON", value: 4, isUnsigned: true)
!262 = !DIEnumerator(name: "G_DEBUG_EVENTS", value: 8, isUnsigned: true)
!263 = !DIEnumerator(name: "G_DEBUG_HANDLERS", value: 16, isUnsigned: true)
!264 = !DIEnumerator(name: "G_DEBUG_WM", value: 32, isUnsigned: true)
!265 = !DIEnumerator(name: "G_DEBUG_JOBS", value: 64, isUnsigned: true)
!266 = !DIEnumerator(name: "G_DEBUG_FREESTYLE", value: 128, isUnsigned: true)
!267 = !DIEnumerator(name: "G_DEBUG_DEPSGRAPH", value: 256, isUnsigned: true)
!268 = !{!45, !269, !330, !431, !441, !6, !336, !2539, !2641, !2649, !2672, !2707, !2721, !7, !1117, !2723, !2724, !2728, !2332, !2393, !2397, !2375, !18, !2732, !13, !2734}
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !271, line: 130, baseType: !272)
!271 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!272 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !271, line: 117, size: 960, elements: !273)
!273 = !{!274, !275, !276, !278, !293, !297, !298, !299, !300, !301}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !272, file: !271, line: 118, baseType: !45, size: 64)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !272, file: !271, line: 118, baseType: !45, size: 64, offset: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !272, file: !271, line: 119, baseType: !277, size: 64, offset: 128)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !272, file: !271, line: 120, baseType: !279, size: 64, offset: 192)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64)
!280 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !271, line: 136, size: 17600, elements: !281)
!281 = !{!282, !283, !284, !287, !288, !289, !290}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !280, file: !271, line: 137, baseType: !270, size: 960)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !280, file: !271, line: 138, baseType: !269, size: 64, offset: 960)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !280, file: !271, line: 139, baseType: !285, size: 64, offset: 1024)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!286 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !271, line: 43, flags: DIFlagFwdDecl)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !280, file: !271, line: 140, baseType: !62, size: 8192, offset: 1088)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !280, file: !271, line: 141, baseType: !62, size: 8192, offset: 9280)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !280, file: !271, line: 148, baseType: !279, size: 64, offset: 17472)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !280, file: !271, line: 150, baseType: !291, size: 64, offset: 17536)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!292 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !271, line: 45, flags: DIFlagFwdDecl)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !272, file: !271, line: 121, baseType: !294, size: 528, offset: 256)
!294 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 528, elements: !295)
!295 = !{!296}
!296 = !DISubrange(count: 66)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !272, file: !271, line: 126, baseType: !18, size: 16, offset: 784)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !272, file: !271, line: 127, baseType: !6, size: 32, offset: 800)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !272, file: !271, line: 128, baseType: !6, size: 32, offset: 832)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !272, file: !271, line: 128, baseType: !6, size: 32, offset: 864)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !272, file: !271, line: 129, baseType: !302, size: 64, offset: 896)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !271, line: 75, baseType: !304)
!304 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !271, line: 62, size: 1024, elements: !305)
!305 = !{!306, !308, !309, !310, !311, !312, !313, !314, !328, !329}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !304, file: !271, line: 63, baseType: !307, size: 64)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !304, file: !271, line: 63, baseType: !307, size: 64, offset: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !304, file: !271, line: 64, baseType: !20, size: 8, offset: 128)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !304, file: !271, line: 64, baseType: !20, size: 8, offset: 136)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !304, file: !271, line: 65, baseType: !18, size: 16, offset: 144)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !304, file: !271, line: 66, baseType: !41, size: 512, offset: 160)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !304, file: !271, line: 67, baseType: !6, size: 32, offset: 672)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !304, file: !271, line: 69, baseType: !315, size: 256, offset: 704)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !271, line: 60, baseType: !316)
!316 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !271, line: 48, size: 256, elements: !317)
!317 = !{!318, !319, !326, !327}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !316, file: !271, line: 49, baseType: !45, size: 64)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !316, file: !271, line: 58, baseType: !320, size: 128, offset: 64)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !321, line: 71, baseType: !322)
!321 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!322 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !321, line: 69, size: 128, elements: !323)
!323 = !{!324, !325}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !322, file: !321, line: 70, baseType: !45, size: 64)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !322, file: !321, line: 70, baseType: !45, size: 64, offset: 64)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !316, file: !271, line: 59, baseType: !6, size: 32, offset: 192)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !316, file: !271, line: 59, baseType: !6, size: 32, offset: 224)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !304, file: !271, line: 70, baseType: !6, size: 32, offset: 960)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !304, file: !271, line: 74, baseType: !6, size: 32, offset: 992)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "MTFace", file: !9, line: 165, baseType: !332)
!332 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTFace", file: !9, line: 160, size: 384, elements: !333)
!333 = !{!334, !340, !426, !427, !428, !429, !430}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !332, file: !9, line: 161, baseType: !335, size: 256)
!335 = !DICompositeType(tag: DW_TAG_array_type, baseType: !336, size: 256, elements: !337)
!336 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!337 = !{!338, !339}
!338 = !DISubrange(count: 4)
!339 = !DISubrange(count: 2)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "tpage", scope: !332, file: !9, line: 162, baseType: !341, size: 64, offset: 256)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!342 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !343, line: 77, size: 15424, elements: !344)
!343 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!344 = !{!345, !346, !347, !350, !353, !356, !359, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !379, !380, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !407, !408, !409, !415, !416, !420}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !342, file: !343, line: 78, baseType: !270, size: 960)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !342, file: !343, line: 80, baseType: !62, size: 8192, offset: 960)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !342, file: !343, line: 82, baseType: !348, size: 64, offset: 9152)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64)
!349 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !343, line: 43, flags: DIFlagFwdDecl)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !342, file: !343, line: 83, baseType: !351, size: 64, offset: 9216)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!352 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !271, line: 46, flags: DIFlagFwdDecl)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !342, file: !343, line: 86, baseType: !354, size: 64, offset: 9280)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!355 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !343, line: 41, flags: DIFlagFwdDecl)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !342, file: !343, line: 87, baseType: !357, size: 64, offset: 9344)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!358 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !343, line: 44, flags: DIFlagFwdDecl)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !342, file: !343, line: 89, baseType: !360, size: 512, offset: 9408)
!360 = !DICompositeType(tag: DW_TAG_array_type, baseType: !357, size: 512, elements: !361)
!361 = !{!362}
!362 = !DISubrange(count: 8)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !342, file: !343, line: 90, baseType: !18, size: 16, offset: 9920)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !342, file: !343, line: 90, baseType: !18, size: 16, offset: 9936)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !342, file: !343, line: 92, baseType: !18, size: 16, offset: 9952)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !342, file: !343, line: 92, baseType: !18, size: 16, offset: 9968)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !342, file: !343, line: 93, baseType: !18, size: 16, offset: 9984)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !342, file: !343, line: 93, baseType: !18, size: 16, offset: 10000)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !342, file: !343, line: 94, baseType: !6, size: 32, offset: 10016)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !342, file: !343, line: 97, baseType: !18, size: 16, offset: 10048)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !342, file: !343, line: 97, baseType: !18, size: 16, offset: 10064)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !342, file: !343, line: 98, baseType: !18, size: 16, offset: 10080)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !342, file: !343, line: 98, baseType: !18, size: 16, offset: 10096)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !342, file: !343, line: 99, baseType: !18, size: 16, offset: 10112)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !342, file: !343, line: 99, baseType: !18, size: 16, offset: 10128)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !342, file: !343, line: 100, baseType: !13, size: 32, offset: 10144)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !342, file: !343, line: 101, baseType: !378, size: 64, offset: 10176)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !342, file: !343, line: 103, baseType: !291, size: 64, offset: 10240)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !342, file: !343, line: 104, baseType: !381, size: 64, offset: 10304)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!382 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !271, line: 159, size: 448, elements: !383)
!383 = !{!384, !387, !388, !390, !391, !393}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !382, file: !271, line: 161, baseType: !385, size: 64)
!385 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 64, elements: !386)
!386 = !{!339}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !382, file: !271, line: 162, baseType: !385, size: 64, offset: 64)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !382, file: !271, line: 163, baseType: !389, size: 32, offset: 128)
!389 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 32, elements: !386)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !382, file: !271, line: 164, baseType: !389, size: 32, offset: 160)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !382, file: !271, line: 165, baseType: !392, size: 128, offset: 192)
!392 = !DICompositeType(tag: DW_TAG_array_type, baseType: !378, size: 128, elements: !386)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !382, file: !271, line: 166, baseType: !394, size: 128, offset: 320)
!394 = !DICompositeType(tag: DW_TAG_array_type, baseType: !351, size: 128, elements: !386)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !342, file: !343, line: 107, baseType: !336, size: 32, offset: 10368)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !342, file: !343, line: 108, baseType: !6, size: 32, offset: 10400)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !342, file: !343, line: 109, baseType: !18, size: 16, offset: 10432)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !342, file: !343, line: 110, baseType: !18, size: 16, offset: 10448)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !342, file: !343, line: 113, baseType: !6, size: 32, offset: 10464)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !342, file: !343, line: 113, baseType: !6, size: 32, offset: 10496)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !342, file: !343, line: 114, baseType: !20, size: 8, offset: 10528)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !342, file: !343, line: 114, baseType: !20, size: 8, offset: 10536)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !342, file: !343, line: 115, baseType: !18, size: 16, offset: 10544)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !342, file: !343, line: 116, baseType: !405, size: 128, offset: 10560)
!405 = !DICompositeType(tag: DW_TAG_array_type, baseType: !336, size: 128, elements: !406)
!406 = !{!338}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !342, file: !343, line: 119, baseType: !336, size: 32, offset: 10688)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !342, file: !343, line: 119, baseType: !336, size: 32, offset: 10720)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !342, file: !343, line: 122, baseType: !410, size: 512, offset: 10752)
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !411, line: 182, baseType: !412)
!411 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!412 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !411, line: 180, size: 512, elements: !413)
!413 = !{!414}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !412, file: !411, line: 181, baseType: !41, size: 512)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !342, file: !343, line: 123, baseType: !20, size: 8, offset: 11264)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !342, file: !343, line: 125, baseType: !417, size: 56, offset: 11272)
!417 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 56, elements: !418)
!418 = !{!419}
!419 = !DISubrange(count: 7)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !342, file: !343, line: 126, baseType: !421, size: 4096, offset: 11328)
!421 = !DICompositeType(tag: DW_TAG_array_type, baseType: !422, size: 4096, elements: !361)
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !343, line: 69, baseType: !423)
!423 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !343, line: 67, size: 512, elements: !424)
!424 = !{!425}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !423, file: !343, line: 68, baseType: !41, size: 512)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !332, file: !9, line: 163, baseType: !20, size: 8, offset: 320)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "transp", scope: !332, file: !9, line: 163, baseType: !20, size: 8, offset: 328)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !332, file: !9, line: 164, baseType: !18, size: 16, offset: 336)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "tile", scope: !332, file: !9, line: 164, baseType: !18, size: 16, offset: 352)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "unwrap", scope: !332, file: !9, line: 164, baseType: !18, size: 16, offset: 368)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "MTexPoly", file: !9, line: 97, baseType: !433)
!433 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTexPoly", file: !9, line: 93, size: 128, elements: !434)
!434 = !{!435, !436, !437, !438, !439, !440}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "tpage", scope: !433, file: !9, line: 94, baseType: !341, size: 64)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !433, file: !9, line: 95, baseType: !20, size: 8, offset: 64)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "transp", scope: !433, file: !9, line: 95, baseType: !20, size: 8, offset: 72)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !433, file: !9, line: 96, baseType: !18, size: 16, offset: 80)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "tile", scope: !433, file: !9, line: 96, baseType: !18, size: 16, offset: 96)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !433, file: !9, line: 96, baseType: !18, size: 16, offset: 112)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64)
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mesh", file: !443, line: 133, baseType: !444)
!443 = !DIFile(filename: "blender/source/blender/makesdna/DNA_mesh_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!444 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Mesh", file: !443, line: 58, size: 11008, elements: !445)
!445 = !{!446, !447, !451, !461, !481, !524, !2255, !2261, !2262, !2264, !2265, !2271, !2279, !2280, !2281, !2294, !2295, !2296, !2297, !2305, !2307, !2491, !2492, !2493, !2494, !2495, !2496, !2497, !2498, !2499, !2500, !2501, !2502, !2503, !2504, !2505, !2506, !2507, !2508, !2509, !2510, !2511, !2512, !2513, !2514, !2515, !2516, !2517, !2518}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !444, file: !443, line: 59, baseType: !270, size: 960)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !444, file: !443, line: 60, baseType: !448, size: 64, offset: 960)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64)
!449 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !450, line: 58, flags: DIFlagFwdDecl)
!450 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!451 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !444, file: !443, line: 62, baseType: !452, size: 64, offset: 1024)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64)
!453 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !197, line: 97, size: 832, elements: !454)
!454 = !{!455, !459, !460}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !453, file: !197, line: 98, baseType: !456, size: 768)
!456 = !DICompositeType(tag: DW_TAG_array_type, baseType: !336, size: 768, elements: !457)
!457 = !{!362, !458}
!458 = !DISubrange(count: 3)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !453, file: !197, line: 99, baseType: !6, size: 32, offset: 768)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !453, file: !197, line: 99, baseType: !6, size: 32, offset: 800)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !444, file: !443, line: 64, baseType: !462, size: 64, offset: 1088)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!463 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !464, line: 91, size: 1280, elements: !465)
!464 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ipo_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!465 = !{!466, !467, !468, !477, !478, !479, !480}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !463, file: !464, line: 92, baseType: !270, size: 960)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "curve", scope: !463, file: !464, line: 94, baseType: !320, size: 128, offset: 960)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !463, file: !464, line: 95, baseType: !469, size: 128, offset: 1088)
!469 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !470, line: 95, baseType: !471)
!470 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!471 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !470, line: 92, size: 128, elements: !472)
!472 = !{!473, !474, !475, !476}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !471, file: !470, line: 93, baseType: !336, size: 32)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !471, file: !470, line: 93, baseType: !336, size: 32, offset: 32)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !471, file: !470, line: 94, baseType: !336, size: 32, offset: 64)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !471, file: !470, line: 94, baseType: !336, size: 32, offset: 96)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "blocktype", scope: !463, file: !464, line: 97, baseType: !18, size: 16, offset: 1216)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "showkey", scope: !463, file: !464, line: 97, baseType: !18, size: 16, offset: 1232)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "muteipo", scope: !463, file: !464, line: 98, baseType: !18, size: 16, offset: 1248)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !463, file: !464, line: 98, baseType: !18, size: 16, offset: 1264)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !444, file: !443, line: 65, baseType: !482, size: 64, offset: 1152)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64)
!483 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Key", file: !484, line: 73, size: 1792, elements: !485)
!484 = !DIFile(filename: "blender/source/blender/makesdna/DNA_key_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!485 = !{!486, !487, !488, !509, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !483, file: !484, line: 74, baseType: !270, size: 960)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !483, file: !484, line: 75, baseType: !448, size: 64, offset: 960)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "refkey", scope: !483, file: !484, line: 80, baseType: !489, size: 64, offset: 1024)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64)
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "KeyBlock", file: !484, line: 70, baseType: !491)
!491 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "KeyBlock", file: !484, line: 45, size: 1472, elements: !492)
!492 = !{!493, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !491, file: !484, line: 46, baseType: !494, size: 64)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !491, file: !484, line: 46, baseType: !494, size: 64, offset: 64)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !491, file: !484, line: 48, baseType: !336, size: 32, offset: 128)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "curval", scope: !491, file: !484, line: 51, baseType: !336, size: 32, offset: 160)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !491, file: !484, line: 53, baseType: !18, size: 16, offset: 192)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !491, file: !484, line: 54, baseType: !18, size: 16, offset: 208)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "relative", scope: !491, file: !484, line: 56, baseType: !18, size: 16, offset: 224)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !491, file: !484, line: 57, baseType: !18, size: 16, offset: 240)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "totelem", scope: !491, file: !484, line: 59, baseType: !6, size: 32, offset: 256)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !491, file: !484, line: 60, baseType: !6, size: 32, offset: 288)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !491, file: !484, line: 62, baseType: !45, size: 64, offset: 320)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !491, file: !484, line: 63, baseType: !41, size: 512, offset: 384)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "vgroup", scope: !491, file: !484, line: 64, baseType: !41, size: 512, offset: 896)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "slidermin", scope: !491, file: !484, line: 67, baseType: !336, size: 32, offset: 1408)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "slidermax", scope: !491, file: !484, line: 68, baseType: !336, size: 32, offset: 1440)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "elemstr", scope: !483, file: !484, line: 85, baseType: !510, size: 256, offset: 1088)
!510 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 256, elements: !511)
!511 = !{!512}
!512 = !DISubrange(count: 32)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "elemsize", scope: !483, file: !484, line: 86, baseType: !6, size: 32, offset: 1344)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !483, file: !484, line: 87, baseType: !6, size: 32, offset: 1376)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !483, file: !484, line: 89, baseType: !320, size: 128, offset: 1408)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !483, file: !484, line: 90, baseType: !462, size: 64, offset: 1536)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "from", scope: !483, file: !484, line: 92, baseType: !269, size: 64, offset: 1600)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !483, file: !484, line: 94, baseType: !18, size: 16, offset: 1664)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "totkey", scope: !483, file: !484, line: 95, baseType: !18, size: 16, offset: 1680)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "slurph", scope: !483, file: !484, line: 96, baseType: !18, size: 16, offset: 1696)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !483, file: !484, line: 97, baseType: !18, size: 16, offset: 1712)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !483, file: !484, line: 101, baseType: !336, size: 32, offset: 1728)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "uidgen", scope: !483, file: !484, line: 104, baseType: !6, size: 32, offset: 1760)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !444, file: !443, line: 66, baseType: !525, size: 64, offset: 1216)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64)
!527 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !528, line: 93, size: 7552, elements: !529)
!528 = !DIFile(filename: "blender/source/blender/makesdna/DNA_material_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!529 = !{!530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !580, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !2214, !2215, !2216, !2217, !2218, !2219, !2220, !2221, !2222, !2223, !2224, !2225, !2226, !2227, !2228, !2229, !2230, !2231, !2232, !2233, !2234, !2235, !2236, !2237, !2238, !2239, !2240, !2241, !2242, !2243, !2244, !2245, !2246, !2254}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !527, file: !528, line: 94, baseType: !270, size: 960)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !527, file: !528, line: 95, baseType: !448, size: 64, offset: 960)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "material_type", scope: !527, file: !528, line: 97, baseType: !18, size: 16, offset: 1024)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !527, file: !528, line: 97, baseType: !18, size: 16, offset: 1040)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !527, file: !528, line: 99, baseType: !336, size: 32, offset: 1056)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !527, file: !528, line: 99, baseType: !336, size: 32, offset: 1088)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !527, file: !528, line: 99, baseType: !336, size: 32, offset: 1120)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "specr", scope: !527, file: !528, line: 100, baseType: !336, size: 32, offset: 1152)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "specg", scope: !527, file: !528, line: 100, baseType: !336, size: 32, offset: 1184)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "specb", scope: !527, file: !528, line: 100, baseType: !336, size: 32, offset: 1216)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "mirr", scope: !527, file: !528, line: 101, baseType: !336, size: 32, offset: 1248)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "mirg", scope: !527, file: !528, line: 101, baseType: !336, size: 32, offset: 1280)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "mirb", scope: !527, file: !528, line: 101, baseType: !336, size: 32, offset: 1312)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "ambr", scope: !527, file: !528, line: 102, baseType: !336, size: 32, offset: 1344)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "ambb", scope: !527, file: !528, line: 102, baseType: !336, size: 32, offset: 1376)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "ambg", scope: !527, file: !528, line: 102, baseType: !336, size: 32, offset: 1408)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "amb", scope: !527, file: !528, line: 103, baseType: !336, size: 32, offset: 1440)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "emit", scope: !527, file: !528, line: 103, baseType: !336, size: 32, offset: 1472)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "ang", scope: !527, file: !528, line: 103, baseType: !336, size: 32, offset: 1504)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "spectra", scope: !527, file: !528, line: 103, baseType: !336, size: 32, offset: 1536)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "ray_mirror", scope: !527, file: !528, line: 103, baseType: !336, size: 32, offset: 1568)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !527, file: !528, line: 104, baseType: !336, size: 32, offset: 1600)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !527, file: !528, line: 104, baseType: !336, size: 32, offset: 1632)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "spec", scope: !527, file: !528, line: 104, baseType: !336, size: 32, offset: 1664)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "zoffs", scope: !527, file: !528, line: 104, baseType: !336, size: 32, offset: 1696)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "add", scope: !527, file: !528, line: 104, baseType: !336, size: 32, offset: 1728)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "translucency", scope: !527, file: !528, line: 105, baseType: !336, size: 32, offset: 1760)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "vol", scope: !527, file: !528, line: 108, baseType: !558, size: 704, offset: 1792)
!558 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VolumeSettings", file: !528, line: 53, size: 704, elements: !559)
!559 = !{!560, !561, !562, !563, !564, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "density", scope: !558, file: !528, line: 54, baseType: !336, size: 32)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "emission", scope: !558, file: !528, line: 55, baseType: !336, size: 32, offset: 32)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "scattering", scope: !558, file: !528, line: 56, baseType: !336, size: 32, offset: 64)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "reflection", scope: !558, file: !528, line: 57, baseType: !336, size: 32, offset: 96)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "emission_col", scope: !558, file: !528, line: 59, baseType: !565, size: 96, offset: 128)
!565 = !DICompositeType(tag: DW_TAG_array_type, baseType: !336, size: 96, elements: !566)
!566 = !{!458}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "transmission_col", scope: !558, file: !528, line: 60, baseType: !565, size: 96, offset: 224)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "reflection_col", scope: !558, file: !528, line: 61, baseType: !565, size: 96, offset: 320)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "density_scale", scope: !558, file: !528, line: 63, baseType: !336, size: 32, offset: 416)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "depth_cutoff", scope: !558, file: !528, line: 64, baseType: !336, size: 32, offset: 448)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "asymmetry", scope: !558, file: !528, line: 65, baseType: !336, size: 32, offset: 480)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "stepsize_type", scope: !558, file: !528, line: 67, baseType: !18, size: 16, offset: 512)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "shadeflag", scope: !558, file: !528, line: 68, baseType: !18, size: 16, offset: 528)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "shade_type", scope: !558, file: !528, line: 69, baseType: !18, size: 16, offset: 544)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "precache_resolution", scope: !558, file: !528, line: 70, baseType: !18, size: 16, offset: 560)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "stepsize", scope: !558, file: !528, line: 72, baseType: !336, size: 32, offset: 576)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "ms_diff", scope: !558, file: !528, line: 73, baseType: !336, size: 32, offset: 608)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "ms_intensity", scope: !558, file: !528, line: 74, baseType: !336, size: 32, offset: 640)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "ms_spread", scope: !558, file: !528, line: 75, baseType: !336, size: 32, offset: 672)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "game", scope: !527, file: !528, line: 109, baseType: !581, size: 128, offset: 2496)
!581 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GameSettings", file: !528, line: 79, size: 128, elements: !582)
!582 = !{!583, !584, !585, !586}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !581, file: !528, line: 80, baseType: !6, size: 32)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_blend", scope: !581, file: !528, line: 81, baseType: !6, size: 32, offset: 32)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "face_orientation", scope: !581, file: !528, line: 82, baseType: !6, size: 32, offset: 64)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !581, file: !528, line: 83, baseType: !6, size: 32, offset: 96)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_mir", scope: !527, file: !528, line: 111, baseType: !336, size: 32, offset: 2624)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_mir_i", scope: !527, file: !528, line: 111, baseType: !336, size: 32, offset: 2656)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_tra", scope: !527, file: !528, line: 112, baseType: !336, size: 32, offset: 2688)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_tra_i", scope: !527, file: !528, line: 112, baseType: !336, size: 32, offset: 2720)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !527, file: !528, line: 113, baseType: !336, size: 32, offset: 2752)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "tx_limit", scope: !527, file: !528, line: 114, baseType: !336, size: 32, offset: 2784)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "tx_falloff", scope: !527, file: !528, line: 114, baseType: !336, size: 32, offset: 2816)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "ray_depth", scope: !527, file: !528, line: 115, baseType: !18, size: 16, offset: 2848)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "ray_depth_tra", scope: !527, file: !528, line: 115, baseType: !18, size: 16, offset: 2864)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "har", scope: !527, file: !528, line: 116, baseType: !18, size: 16, offset: 2880)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "seed1", scope: !527, file: !528, line: 117, baseType: !20, size: 8, offset: 2896)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "seed2", scope: !527, file: !528, line: 117, baseType: !20, size: 8, offset: 2904)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "gloss_mir", scope: !527, file: !528, line: 119, baseType: !336, size: 32, offset: 2912)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "gloss_tra", scope: !527, file: !528, line: 119, baseType: !336, size: 32, offset: 2944)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "samp_gloss_mir", scope: !527, file: !528, line: 120, baseType: !18, size: 16, offset: 2976)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "samp_gloss_tra", scope: !527, file: !528, line: 120, baseType: !18, size: 16, offset: 2992)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "adapt_thresh_mir", scope: !527, file: !528, line: 121, baseType: !336, size: 32, offset: 3008)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "adapt_thresh_tra", scope: !527, file: !528, line: 121, baseType: !336, size: 32, offset: 3040)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "aniso_gloss_mir", scope: !527, file: !528, line: 122, baseType: !336, size: 32, offset: 3072)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "dist_mir", scope: !527, file: !528, line: 123, baseType: !336, size: 32, offset: 3104)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "fadeto_mir", scope: !527, file: !528, line: 124, baseType: !18, size: 16, offset: 3136)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "shade_flag", scope: !527, file: !528, line: 125, baseType: !18, size: 16, offset: 3152)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !527, file: !528, line: 127, baseType: !6, size: 32, offset: 3168)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "mode_l", scope: !527, file: !528, line: 127, baseType: !6, size: 32, offset: 3200)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "mode2", scope: !527, file: !528, line: 128, baseType: !6, size: 32, offset: 3232)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "mode2_l", scope: !527, file: !528, line: 128, baseType: !6, size: 32, offset: 3264)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "flarec", scope: !527, file: !528, line: 129, baseType: !18, size: 16, offset: 3296)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "starc", scope: !527, file: !528, line: 129, baseType: !18, size: 16, offset: 3312)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "linec", scope: !527, file: !528, line: 129, baseType: !18, size: 16, offset: 3328)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "ringc", scope: !527, file: !528, line: 129, baseType: !18, size: 16, offset: 3344)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "hasize", scope: !527, file: !528, line: 130, baseType: !336, size: 32, offset: 3360)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "flaresize", scope: !527, file: !528, line: 130, baseType: !336, size: 32, offset: 3392)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "subsize", scope: !527, file: !528, line: 130, baseType: !336, size: 32, offset: 3424)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "flareboost", scope: !527, file: !528, line: 130, baseType: !336, size: 32, offset: 3456)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "strand_sta", scope: !527, file: !528, line: 131, baseType: !336, size: 32, offset: 3488)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "strand_end", scope: !527, file: !528, line: 131, baseType: !336, size: 32, offset: 3520)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "strand_ease", scope: !527, file: !528, line: 131, baseType: !336, size: 32, offset: 3552)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "strand_surfnor", scope: !527, file: !528, line: 131, baseType: !336, size: 32, offset: 3584)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "strand_min", scope: !527, file: !528, line: 132, baseType: !336, size: 32, offset: 3616)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "strand_widthfade", scope: !527, file: !528, line: 132, baseType: !336, size: 32, offset: 3648)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "strand_uvname", scope: !527, file: !528, line: 133, baseType: !41, size: 512, offset: 3680)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "sbias", scope: !527, file: !528, line: 135, baseType: !336, size: 32, offset: 4192)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "lbias", scope: !527, file: !528, line: 136, baseType: !336, size: 32, offset: 4224)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "shad_alpha", scope: !527, file: !528, line: 137, baseType: !336, size: 32, offset: 4256)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "septex", scope: !527, file: !528, line: 138, baseType: !6, size: 32, offset: 4288)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "rgbsel", scope: !527, file: !528, line: 141, baseType: !20, size: 8, offset: 4320)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "texact", scope: !527, file: !528, line: 141, baseType: !20, size: 8, offset: 4328)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "pr_type", scope: !527, file: !528, line: 141, baseType: !20, size: 8, offset: 4336)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !527, file: !528, line: 141, baseType: !20, size: 8, offset: 4344)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "pr_lamp", scope: !527, file: !528, line: 142, baseType: !18, size: 16, offset: 4352)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "pr_texture", scope: !527, file: !528, line: 142, baseType: !18, size: 16, offset: 4368)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flag", scope: !527, file: !528, line: 142, baseType: !18, size: 16, offset: 4384)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "mapflag", scope: !527, file: !528, line: 145, baseType: !20, size: 8, offset: 4400)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !527, file: !528, line: 145, baseType: !20, size: 8, offset: 4408)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "diff_shader", scope: !527, file: !528, line: 148, baseType: !18, size: 16, offset: 4416)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "spec_shader", scope: !527, file: !528, line: 148, baseType: !18, size: 16, offset: 4432)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "roughness", scope: !527, file: !528, line: 149, baseType: !336, size: 32, offset: 4448)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "refrac", scope: !527, file: !528, line: 149, baseType: !336, size: 32, offset: 4480)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !527, file: !528, line: 152, baseType: !405, size: 128, offset: 4512)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "rms", scope: !527, file: !528, line: 153, baseType: !336, size: 32, offset: 4640)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "darkness", scope: !527, file: !528, line: 154, baseType: !336, size: 32, offset: 4672)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !527, file: !528, line: 157, baseType: !18, size: 16, offset: 4704)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !527, file: !528, line: 157, baseType: !18, size: 16, offset: 4720)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_col", scope: !527, file: !528, line: 160, baseType: !651, size: 64, offset: 4736)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64)
!652 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorBand", file: !653, line: 113, size: 6208, elements: !654)
!653 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!654 = !{!655, !656, !657, !658, !659, !660, !664}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !652, file: !653, line: 114, baseType: !18, size: 16)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !652, file: !653, line: 114, baseType: !18, size: 16, offset: 16)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype", scope: !652, file: !653, line: 115, baseType: !20, size: 8, offset: 32)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype_hue", scope: !652, file: !653, line: 115, baseType: !20, size: 8, offset: 40)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "color_mode", scope: !652, file: !653, line: 116, baseType: !20, size: 8, offset: 48)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !652, file: !653, line: 117, baseType: !661, size: 8, offset: 56)
!661 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 8, elements: !662)
!662 = !{!663}
!663 = !DISubrange(count: 1)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !652, file: !653, line: 119, baseType: !665, size: 6144, offset: 64)
!665 = !DICompositeType(tag: DW_TAG_array_type, baseType: !666, size: 6144, elements: !511)
!666 = !DIDerivedType(tag: DW_TAG_typedef, name: "CBData", file: !653, line: 109, baseType: !667)
!667 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CBData", file: !653, line: 106, size: 192, elements: !668)
!668 = !{!669, !670, !671, !672, !673, !674}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !667, file: !653, line: 107, baseType: !336, size: 32)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !667, file: !653, line: 107, baseType: !336, size: 32, offset: 32)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !667, file: !653, line: 107, baseType: !336, size: 32, offset: 64)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !667, file: !653, line: 107, baseType: !336, size: 32, offset: 96)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !667, file: !653, line: 107, baseType: !336, size: 32, offset: 128)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !667, file: !653, line: 108, baseType: !6, size: 32, offset: 160)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_spec", scope: !527, file: !528, line: 161, baseType: !651, size: 64, offset: 4800)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "rampin_col", scope: !527, file: !528, line: 162, baseType: !20, size: 8, offset: 4864)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "rampin_spec", scope: !527, file: !528, line: 162, baseType: !20, size: 8, offset: 4872)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "rampblend_col", scope: !527, file: !528, line: 163, baseType: !20, size: 8, offset: 4880)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "rampblend_spec", scope: !527, file: !528, line: 163, baseType: !20, size: 8, offset: 4888)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_show", scope: !527, file: !528, line: 164, baseType: !18, size: 16, offset: 4896)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !527, file: !528, line: 164, baseType: !18, size: 16, offset: 4912)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "rampfac_col", scope: !527, file: !528, line: 165, baseType: !336, size: 32, offset: 4928)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "rampfac_spec", scope: !527, file: !528, line: 165, baseType: !336, size: 32, offset: 4960)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "mtex", scope: !527, file: !528, line: 167, baseType: !685, size: 1152, offset: 4992)
!685 = !DICompositeType(tag: DW_TAG_array_type, baseType: !686, size: 1152, elements: !2212)
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !687, size: 64)
!687 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTex", file: !653, line: 57, size: 2496, elements: !688)
!688 = !{!689, !690, !691, !692, !693, !2007, !2153, !2154, !2155, !2156, !2157, !2158, !2159, !2160, !2161, !2162, !2163, !2164, !2165, !2166, !2167, !2168, !2169, !2170, !2171, !2172, !2173, !2174, !2175, !2176, !2177, !2178, !2179, !2180, !2181, !2182, !2183, !2184, !2185, !2186, !2187, !2188, !2189, !2190, !2191, !2192, !2193, !2194, !2195, !2196, !2197, !2198, !2199, !2200, !2201, !2202, !2203, !2204, !2205, !2206, !2207, !2208, !2209, !2210, !2211}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !687, file: !653, line: 59, baseType: !18, size: 16)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !687, file: !653, line: 59, baseType: !18, size: 16, offset: 16)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "maptoneg", scope: !687, file: !653, line: 59, baseType: !18, size: 16, offset: 32)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "blendtype", scope: !687, file: !653, line: 59, baseType: !18, size: 16, offset: 48)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !687, file: !653, line: 60, baseType: !694, size: 64, offset: 64)
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 64)
!695 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !197, line: 115, size: 11392, elements: !696)
!696 = !{!697, !698, !699, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !729, !730, !771, !772, !775, !776, !792, !793, !794, !795, !796, !797, !798, !799, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !877, !878, !879, !880, !881, !882, !883, !884, !885, !888, !891, !895, !896, !897, !898, !899, !902, !925, !1273, !1274, !1280, !1281, !1282, !1283, !1284, !1285, !1287, !1290, !1293, !1295, !1995, !1996}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !695, file: !197, line: 116, baseType: !270, size: 960)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !695, file: !197, line: 117, baseType: !448, size: 64, offset: 960)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !695, file: !197, line: 119, baseType: !700, size: 64, offset: 1024)
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !701, size: 64)
!701 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !197, line: 57, flags: DIFlagFwdDecl)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !695, file: !197, line: 121, baseType: !18, size: 16, offset: 1088)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !695, file: !197, line: 121, baseType: !18, size: 16, offset: 1104)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !695, file: !197, line: 122, baseType: !6, size: 32, offset: 1120)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !695, file: !197, line: 122, baseType: !6, size: 32, offset: 1152)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !695, file: !197, line: 122, baseType: !6, size: 32, offset: 1184)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !695, file: !197, line: 123, baseType: !41, size: 512, offset: 1216)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !695, file: !197, line: 124, baseType: !694, size: 64, offset: 1728)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !695, file: !197, line: 124, baseType: !694, size: 64, offset: 1792)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !695, file: !197, line: 127, baseType: !694, size: 64, offset: 1856)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !695, file: !197, line: 127, baseType: !694, size: 64, offset: 1920)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !695, file: !197, line: 127, baseType: !694, size: 64, offset: 1984)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !695, file: !197, line: 128, baseType: !462, size: 64, offset: 2048)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !695, file: !197, line: 130, baseType: !452, size: 64, offset: 2112)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !695, file: !197, line: 131, baseType: !716, size: 64, offset: 2176)
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 64)
!717 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !718, line: 486, size: 1600, elements: !719)
!718 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!719 = !{!720, !721, !722, !723, !724, !725, !726, !727, !728}
!720 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !717, file: !718, line: 487, baseType: !270, size: 960)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !717, file: !718, line: 489, baseType: !320, size: 128, offset: 960)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !717, file: !718, line: 490, baseType: !320, size: 128, offset: 1088)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !717, file: !718, line: 491, baseType: !320, size: 128, offset: 1216)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !717, file: !718, line: 492, baseType: !320, size: 128, offset: 1344)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !717, file: !718, line: 494, baseType: !6, size: 32, offset: 1472)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !717, file: !718, line: 495, baseType: !6, size: 32, offset: 1504)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !717, file: !718, line: 497, baseType: !6, size: 32, offset: 1536)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !717, file: !718, line: 498, baseType: !6, size: 32, offset: 1568)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !695, file: !197, line: 132, baseType: !716, size: 64, offset: 2240)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !695, file: !197, line: 133, baseType: !731, size: 64, offset: 2304)
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !732, size: 64)
!732 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !718, line: 334, size: 1728, elements: !733)
!733 = !{!734, !735, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !770}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !732, file: !718, line: 335, baseType: !320, size: 128)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !732, file: !718, line: 336, baseType: !736, size: 64, offset: 128)
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !737, size: 64)
!737 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !718, line: 47, flags: DIFlagFwdDecl)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !732, file: !718, line: 338, baseType: !18, size: 16, offset: 192)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !732, file: !718, line: 338, baseType: !18, size: 16, offset: 208)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !732, file: !718, line: 339, baseType: !13, size: 32, offset: 224)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !732, file: !718, line: 340, baseType: !6, size: 32, offset: 256)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !732, file: !718, line: 342, baseType: !336, size: 32, offset: 288)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !732, file: !718, line: 343, baseType: !565, size: 96, offset: 320)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !732, file: !718, line: 344, baseType: !565, size: 96, offset: 416)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !732, file: !718, line: 347, baseType: !320, size: 128, offset: 512)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !732, file: !718, line: 349, baseType: !6, size: 32, offset: 640)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !732, file: !718, line: 350, baseType: !6, size: 32, offset: 672)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !732, file: !718, line: 351, baseType: !45, size: 64, offset: 704)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !732, file: !718, line: 352, baseType: !45, size: 64, offset: 768)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !732, file: !718, line: 354, baseType: !751, size: 384, offset: 832)
!751 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !718, line: 116, baseType: !752)
!752 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !718, line: 94, size: 384, elements: !753)
!753 = !{!754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !752, file: !718, line: 96, baseType: !6, size: 32)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !752, file: !718, line: 96, baseType: !6, size: 32, offset: 32)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !752, file: !718, line: 97, baseType: !6, size: 32, offset: 64)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !752, file: !718, line: 97, baseType: !6, size: 32, offset: 96)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !752, file: !718, line: 99, baseType: !18, size: 16, offset: 128)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !752, file: !718, line: 100, baseType: !18, size: 16, offset: 144)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !752, file: !718, line: 102, baseType: !18, size: 16, offset: 160)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !752, file: !718, line: 105, baseType: !18, size: 16, offset: 176)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !752, file: !718, line: 108, baseType: !18, size: 16, offset: 192)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !752, file: !718, line: 109, baseType: !18, size: 16, offset: 208)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !752, file: !718, line: 111, baseType: !18, size: 16, offset: 224)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !752, file: !718, line: 112, baseType: !18, size: 16, offset: 240)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !752, file: !718, line: 114, baseType: !6, size: 32, offset: 256)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !752, file: !718, line: 114, baseType: !6, size: 32, offset: 288)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !752, file: !718, line: 115, baseType: !6, size: 32, offset: 320)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !752, file: !718, line: 115, baseType: !6, size: 32, offset: 352)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !732, file: !718, line: 355, baseType: !41, size: 512, offset: 1216)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !695, file: !197, line: 134, baseType: !45, size: 64, offset: 2368)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !695, file: !197, line: 136, baseType: !773, size: 64, offset: 2432)
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 64)
!774 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !450, line: 61, flags: DIFlagFwdDecl)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !695, file: !197, line: 138, baseType: !751, size: 384, offset: 2496)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !695, file: !197, line: 139, baseType: !777, size: 64, offset: 2880)
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 64)
!778 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !718, line: 80, baseType: !779)
!779 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !718, line: 72, size: 192, elements: !780)
!780 = !{!781, !788, !789, !790, !791}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !779, file: !718, line: 73, baseType: !782, size: 64)
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !783, size: 64)
!783 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !718, line: 59, baseType: !784)
!784 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !718, line: 56, size: 128, elements: !785)
!785 = !{!786, !787}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !784, file: !718, line: 57, baseType: !565, size: 96)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !784, file: !718, line: 58, baseType: !6, size: 32, offset: 96)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !779, file: !718, line: 74, baseType: !6, size: 32, offset: 64)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !779, file: !718, line: 76, baseType: !6, size: 32, offset: 96)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !779, file: !718, line: 77, baseType: !6, size: 32, offset: 128)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !779, file: !718, line: 79, baseType: !6, size: 32, offset: 160)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !695, file: !197, line: 141, baseType: !320, size: 128, offset: 2944)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !695, file: !197, line: 142, baseType: !320, size: 128, offset: 3072)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !695, file: !197, line: 143, baseType: !320, size: 128, offset: 3200)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !695, file: !197, line: 144, baseType: !320, size: 128, offset: 3328)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !695, file: !197, line: 146, baseType: !6, size: 32, offset: 3456)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !695, file: !197, line: 147, baseType: !6, size: 32, offset: 3488)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !695, file: !197, line: 150, baseType: !525, size: 64, offset: 3520)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !695, file: !197, line: 151, baseType: !800, size: 64, offset: 3584)
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !695, file: !197, line: 152, baseType: !6, size: 32, offset: 3648)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !695, file: !197, line: 153, baseType: !6, size: 32, offset: 3680)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !695, file: !197, line: 156, baseType: !565, size: 96, offset: 3712)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !695, file: !197, line: 156, baseType: !565, size: 96, offset: 3808)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !695, file: !197, line: 156, baseType: !565, size: 96, offset: 3904)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !695, file: !197, line: 157, baseType: !565, size: 96, offset: 4000)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !695, file: !197, line: 158, baseType: !565, size: 96, offset: 4096)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !695, file: !197, line: 159, baseType: !565, size: 96, offset: 4192)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !695, file: !197, line: 160, baseType: !565, size: 96, offset: 4288)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !695, file: !197, line: 160, baseType: !565, size: 96, offset: 4384)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !695, file: !197, line: 161, baseType: !405, size: 128, offset: 4480)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !695, file: !197, line: 161, baseType: !405, size: 128, offset: 4608)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !695, file: !197, line: 162, baseType: !565, size: 96, offset: 4736)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !695, file: !197, line: 162, baseType: !565, size: 96, offset: 4832)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !695, file: !197, line: 163, baseType: !336, size: 32, offset: 4928)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !695, file: !197, line: 163, baseType: !336, size: 32, offset: 4960)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !695, file: !197, line: 164, baseType: !818, size: 512, offset: 4992)
!818 = !DICompositeType(tag: DW_TAG_array_type, baseType: !336, size: 512, elements: !819)
!819 = !{!338, !338}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !695, file: !197, line: 165, baseType: !818, size: 512, offset: 5504)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !695, file: !197, line: 166, baseType: !818, size: 512, offset: 6016)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !695, file: !197, line: 167, baseType: !818, size: 512, offset: 6528)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !695, file: !197, line: 176, baseType: !818, size: 512, offset: 7040)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !695, file: !197, line: 178, baseType: !13, size: 32, offset: 7552)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !695, file: !197, line: 180, baseType: !18, size: 16, offset: 7584)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !695, file: !197, line: 181, baseType: !18, size: 16, offset: 7600)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !695, file: !197, line: 183, baseType: !18, size: 16, offset: 7616)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !695, file: !197, line: 183, baseType: !18, size: 16, offset: 7632)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !695, file: !197, line: 184, baseType: !18, size: 16, offset: 7648)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !695, file: !197, line: 184, baseType: !18, size: 16, offset: 7664)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !695, file: !197, line: 185, baseType: !18, size: 16, offset: 7680)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !695, file: !197, line: 186, baseType: !18, size: 16, offset: 7696)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !695, file: !197, line: 187, baseType: !18, size: 16, offset: 7712)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !695, file: !197, line: 188, baseType: !20, size: 8, offset: 7728)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !695, file: !197, line: 189, baseType: !20, size: 8, offset: 7736)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !695, file: !197, line: 192, baseType: !6, size: 32, offset: 7744)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !695, file: !197, line: 192, baseType: !6, size: 32, offset: 7776)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !695, file: !197, line: 192, baseType: !6, size: 32, offset: 7808)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !695, file: !197, line: 192, baseType: !6, size: 32, offset: 7840)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !695, file: !197, line: 194, baseType: !6, size: 32, offset: 7872)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !695, file: !197, line: 202, baseType: !336, size: 32, offset: 7904)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !695, file: !197, line: 202, baseType: !336, size: 32, offset: 7936)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !695, file: !197, line: 202, baseType: !336, size: 32, offset: 7968)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !695, file: !197, line: 211, baseType: !336, size: 32, offset: 8000)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !695, file: !197, line: 212, baseType: !336, size: 32, offset: 8032)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !695, file: !197, line: 213, baseType: !336, size: 32, offset: 8064)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !695, file: !197, line: 214, baseType: !336, size: 32, offset: 8096)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !695, file: !197, line: 215, baseType: !336, size: 32, offset: 8128)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !695, file: !197, line: 216, baseType: !336, size: 32, offset: 8160)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !695, file: !197, line: 219, baseType: !336, size: 32, offset: 8192)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !695, file: !197, line: 220, baseType: !336, size: 32, offset: 8224)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !695, file: !197, line: 221, baseType: !336, size: 32, offset: 8256)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !695, file: !197, line: 224, baseType: !854, size: 16, offset: 8288)
!854 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !695, file: !197, line: 224, baseType: !854, size: 16, offset: 8304)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !695, file: !197, line: 226, baseType: !18, size: 16, offset: 8320)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !695, file: !197, line: 228, baseType: !20, size: 8, offset: 8336)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !695, file: !197, line: 229, baseType: !20, size: 8, offset: 8344)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !695, file: !197, line: 231, baseType: !18, size: 16, offset: 8352)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !695, file: !197, line: 232, baseType: !20, size: 8, offset: 8368)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !695, file: !197, line: 233, baseType: !20, size: 8, offset: 8376)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !695, file: !197, line: 234, baseType: !336, size: 32, offset: 8384)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !695, file: !197, line: 235, baseType: !336, size: 32, offset: 8416)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !695, file: !197, line: 237, baseType: !320, size: 128, offset: 8448)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !695, file: !197, line: 238, baseType: !320, size: 128, offset: 8576)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !695, file: !197, line: 239, baseType: !320, size: 128, offset: 8704)
