; ModuleID = 'blender/source/blender/nodes/shader/nodes/node_shader_bsdf_velvet.c'
source_filename = "blender/source/blender/nodes/shader/nodes/node_shader_bsdf_velvet.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "ntype", scope: !2, file: !3, line: 55, type: !2246, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "register_node_type_sh_bsdf_velvet", scope: !3, file: !3, line: 53, type: !4, scopeLine: 54, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !2245)
!3 = !DIFile(filename: "blender/source/blender/nodes/shader/nodes/node_shader_bsdf_velvet.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !DISubroutineType(types: !5)
!5 = !{null}
!6 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !7, globals: !32, splitDebugInlining: false, nameTableKind: None)
!7 = !{!8, !22}
!8 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "GPUType", file: !9, line: 69, baseType: !10, size: 32, elements: !11)
!9 = !DIFile(filename: "blender/source/blender/gpu/GPU_material.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!10 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!11 = !{!12, !13, !14, !15, !16, !17, !18, !19, !20, !21}
!12 = !DIEnumerator(name: "GPU_NONE", value: 0, isUnsigned: true)
!13 = !DIEnumerator(name: "GPU_FLOAT", value: 1, isUnsigned: true)
!14 = !DIEnumerator(name: "GPU_VEC2", value: 2, isUnsigned: true)
!15 = !DIEnumerator(name: "GPU_VEC3", value: 3, isUnsigned: true)
!16 = !DIEnumerator(name: "GPU_VEC4", value: 4, isUnsigned: true)
!17 = !DIEnumerator(name: "GPU_MAT3", value: 9, isUnsigned: true)
!18 = !DIEnumerator(name: "GPU_MAT4", value: 16, isUnsigned: true)
!19 = !DIEnumerator(name: "GPU_TEX2D", value: 1002, isUnsigned: true)
!20 = !DIEnumerator(name: "GPU_SHADOW2D", value: 1003, isUnsigned: true)
!21 = !DIEnumerator(name: "GPU_ATTRIB", value: 3001, isUnsigned: true)
!22 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "GPUBuiltin", file: !9, line: 82, baseType: !10, size: 32, elements: !23)
!23 = !{!24, !25, !26, !27, !28, !29, !30, !31}
!24 = !DIEnumerator(name: "GPU_VIEW_MATRIX", value: 1, isUnsigned: true)
!25 = !DIEnumerator(name: "GPU_OBJECT_MATRIX", value: 2, isUnsigned: true)
!26 = !DIEnumerator(name: "GPU_INVERSE_VIEW_MATRIX", value: 4, isUnsigned: true)
!27 = !DIEnumerator(name: "GPU_INVERSE_OBJECT_MATRIX", value: 8, isUnsigned: true)
!28 = !DIEnumerator(name: "GPU_VIEW_POSITION", value: 16, isUnsigned: true)
!29 = !DIEnumerator(name: "GPU_VIEW_NORMAL", value: 32, isUnsigned: true)
!30 = !DIEnumerator(name: "GPU_OBCOLOR", value: 64, isUnsigned: true)
!31 = !DIEnumerator(name: "GPU_AUTO_BUMPSCALE", value: 128, isUnsigned: true)
!32 = !{!0, !33, !2242}
!33 = !DIGlobalVariableExpression(var: !34, expr: !DIExpression())
!34 = distinct !DIGlobalVariable(name: "sh_node_bsdf_velvet_in", scope: !6, file: !3, line: 32, type: !35, isLocal: true, isDefinition: true)
!35 = !DICompositeType(tag: DW_TAG_array_type, baseType: !36, size: 5632, elements: !451)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeSocketTemplate", file: !37, line: 109, baseType: !38)
!37 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_node.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!38 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocketTemplate", file: !37, line: 98, size: 1408, elements: !39)
!39 = !{!40, !42, !43, !48, !50, !51, !52, !53, !54, !55, !56, !57, !2241}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !38, file: !37, line: 99, baseType: !41, size: 32)
!41 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !38, file: !37, line: 99, baseType: !41, size: 32, offset: 32)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !38, file: !37, line: 100, baseType: !44, size: 512, offset: 64)
!44 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 512, elements: !46)
!45 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!46 = !{!47}
!47 = !DISubrange(count: 64)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "val1", scope: !38, file: !37, line: 101, baseType: !49, size: 32, offset: 576)
!49 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !38, file: !37, line: 101, baseType: !49, size: 32, offset: 608)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "val3", scope: !38, file: !37, line: 101, baseType: !49, size: 32, offset: 640)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "val4", scope: !38, file: !37, line: 101, baseType: !49, size: 32, offset: 672)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !38, file: !37, line: 102, baseType: !49, size: 32, offset: 704)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !38, file: !37, line: 102, baseType: !49, size: 32, offset: 736)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !38, file: !37, line: 103, baseType: !41, size: 32, offset: 768)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !38, file: !37, line: 104, baseType: !41, size: 32, offset: 800)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "sock", scope: !38, file: !37, line: 107, baseType: !58, size: 64, offset: 832)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!59 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocket", file: !60, line: 87, size: 2816, elements: !61)
!60 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!61 = !{!62, !63, !64, !65, !97, !98, !99, !100, !101, !102, !103, !104, !2227, !2228, !2229, !2230, !2231, !2232, !2233, !2234, !2235, !2236, !2237, !2238, !2239}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !59, file: !60, line: 88, baseType: !58, size: 64)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !59, file: !60, line: 88, baseType: !58, size: 64, offset: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "new_sock", scope: !59, file: !60, line: 88, baseType: !58, size: 64, offset: 128)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !59, file: !60, line: 90, baseType: !66, size: 64, offset: 192)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !68, line: 75, baseType: !69)
!68 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!69 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !68, line: 62, size: 1024, elements: !70)
!70 = !{!71, !73, !74, !75, !76, !78, !79, !80, !95, !96}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !69, file: !68, line: 63, baseType: !72, size: 64)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !69, file: !68, line: 63, baseType: !72, size: 64, offset: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !69, file: !68, line: 64, baseType: !45, size: 8, offset: 128)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !69, file: !68, line: 64, baseType: !45, size: 8, offset: 136)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !69, file: !68, line: 65, baseType: !77, size: 16, offset: 144)
!77 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !69, file: !68, line: 66, baseType: !44, size: 512, offset: 160)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !69, file: !68, line: 67, baseType: !41, size: 32, offset: 672)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !69, file: !68, line: 69, baseType: !81, size: 256, offset: 704)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !68, line: 60, baseType: !82)
!82 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !68, line: 48, size: 256, elements: !83)
!83 = !{!84, !86, !93, !94}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !82, file: !68, line: 49, baseType: !85, size: 64)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !82, file: !68, line: 58, baseType: !87, size: 128, offset: 64)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !88, line: 71, baseType: !89)
!88 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!89 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !88, line: 69, size: 128, elements: !90)
!90 = !{!91, !92}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !89, file: !88, line: 70, baseType: !85, size: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !89, file: !88, line: 70, baseType: !85, size: 64, offset: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !82, file: !68, line: 59, baseType: !41, size: 32, offset: 192)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !82, file: !68, line: 59, baseType: !41, size: 32, offset: 224)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !69, file: !68, line: 70, baseType: !41, size: 32, offset: 960)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !69, file: !68, line: 74, baseType: !41, size: 32, offset: 992)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !59, file: !60, line: 92, baseType: !44, size: 512, offset: 256)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !59, file: !60, line: 94, baseType: !44, size: 512, offset: 768)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !59, file: !60, line: 99, baseType: !85, size: 64, offset: 1280)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !59, file: !60, line: 101, baseType: !77, size: 16, offset: 1344)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !59, file: !60, line: 101, baseType: !77, size: 16, offset: 1360)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !59, file: !60, line: 102, baseType: !77, size: 16, offset: 1376)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "in_out", scope: !59, file: !60, line: 103, baseType: !77, size: 16, offset: 1392)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !59, file: !60, line: 104, baseType: !105, size: 64, offset: 1408)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocketType", file: !37, line: 114, size: 1600, elements: !107)
!107 = !{!108, !109, !132, !137, !141, !145, !2214, !2218, !2219, !2223, !2224, !2225, !2226}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !106, file: !37, line: 115, baseType: !44, size: 512)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "draw", scope: !106, file: !37, line: 117, baseType: !110, size: 64, offset: 512)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DISubroutineType(types: !112)
!112 = !{null, !113, !116, !118, !118, !130}
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !115, line: 60, flags: DIFlagFwdDecl)
!115 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_blender.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DICompositeType(tag: DW_TAG_structure_type, name: "uiLayout", file: !37, line: 73, flags: DIFlagFwdDecl)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !120, line: 55, size: 192, elements: !121)
!120 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!121 = !{!122, !126, !129}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !119, file: !120, line: 58, baseType: !123, size: 64)
!123 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !119, file: !120, line: 56, size: 64, elements: !124)
!124 = !{!125}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !123, file: !120, line: 57, baseType: !85, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !119, file: !120, line: 60, baseType: !127, size: 64, offset: 64)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !60, line: 335, flags: DIFlagFwdDecl)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !119, file: !120, line: 61, baseType: !85, size: 64, offset: 128)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !45)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "draw_color", scope: !106, file: !37, line: 118, baseType: !133, size: 64, offset: 576)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = !DISubroutineType(types: !135)
!135 = !{null, !113, !118, !118, !136}
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "interface_draw", scope: !106, file: !37, line: 120, baseType: !138, size: 64, offset: 640)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = !DISubroutineType(types: !140)
!140 = !{null, !113, !116, !118}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "interface_draw_color", scope: !106, file: !37, line: 121, baseType: !142, size: 64, offset: 704)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!143 = !DISubroutineType(types: !144)
!144 = !{null, !113, !118, !136}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "interface_register_properties", scope: !106, file: !37, line: 122, baseType: !146, size: 64, offset: 768)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = !DISubroutineType(types: !148)
!148 = !{null, !149, !58, !127}
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!150 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !60, line: 328, size: 3456, elements: !151)
!151 = !{!152, !188, !192, !2170, !2171, !2172, !2173, !2174, !2175, !2176, !2177, !2178, !2179, !2180, !2181, !2182, !2183, !2184, !2185, !2186, !2187, !2188, !2189, !2190, !2191, !2192, !2193, !2194, !2197, !2201, !2205, !2209, !2210, !2211, !2212, !2213}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !150, file: !60, line: 329, baseType: !153, size: 960)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !68, line: 130, baseType: !154)
!154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !68, line: 117, size: 960, elements: !155)
!155 = !{!156, !157, !158, !160, !179, !183, !184, !185, !186, !187}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !154, file: !68, line: 118, baseType: !85, size: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !154, file: !68, line: 118, baseType: !85, size: 64, offset: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !154, file: !68, line: 119, baseType: !159, size: 64, offset: 128)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !154, file: !68, line: 120, baseType: !161, size: 64, offset: 192)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !68, line: 136, size: 17600, elements: !163)
!163 = !{!164, !165, !167, !170, !174, !175, !176}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !162, file: !68, line: 137, baseType: !153, size: 960)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !162, file: !68, line: 138, baseType: !166, size: 64, offset: 960)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !162, file: !68, line: 139, baseType: !168, size: 64, offset: 1024)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !68, line: 43, flags: DIFlagFwdDecl)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !162, file: !68, line: 140, baseType: !171, size: 8192, offset: 1088)
!171 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 8192, elements: !172)
!172 = !{!173}
!173 = !DISubrange(count: 1024)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !162, file: !68, line: 141, baseType: !171, size: 8192, offset: 9280)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !162, file: !68, line: 148, baseType: !161, size: 64, offset: 17472)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !162, file: !68, line: 150, baseType: !177, size: 64, offset: 17536)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!178 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !68, line: 45, flags: DIFlagFwdDecl)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !154, file: !68, line: 121, baseType: !180, size: 528, offset: 256)
!180 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 528, elements: !181)
!181 = !{!182}
!182 = !DISubrange(count: 66)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !154, file: !68, line: 126, baseType: !77, size: 16, offset: 784)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !154, file: !68, line: 127, baseType: !41, size: 32, offset: 800)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !154, file: !68, line: 128, baseType: !41, size: 32, offset: 832)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !154, file: !68, line: 128, baseType: !41, size: 32, offset: 864)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !154, file: !68, line: 129, baseType: !66, size: 64, offset: 896)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !150, file: !60, line: 330, baseType: !189, size: 64, offset: 960)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!190 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !191, line: 48, flags: DIFlagFwdDecl)
!191 = !DIFile(filename: "blender/source/blender/makesdna/DNA_material_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!192 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !150, file: !60, line: 332, baseType: !193, size: 64, offset: 1024)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!194 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !37, line: 283, size: 4096, elements: !195)
!195 = !{!196, !197, !198, !199, !203, !204, !208, !564, !2132, !2136, !2142, !2146, !2147, !2148, !2149, !2168, !2169}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !194, file: !37, line: 284, baseType: !41, size: 32)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !194, file: !37, line: 285, baseType: !44, size: 512, offset: 32)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "ui_name", scope: !194, file: !37, line: 287, baseType: !44, size: 512, offset: 544)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "ui_description", scope: !194, file: !37, line: 288, baseType: !200, size: 2048, offset: 1056)
!200 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 2048, elements: !201)
!201 = !{!202}
!202 = !DISubrange(count: 256)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "ui_icon", scope: !194, file: !37, line: 289, baseType: !41, size: 32, offset: 3104)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "free_cache", scope: !194, file: !37, line: 292, baseType: !205, size: 64, offset: 3136)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = !DISubroutineType(types: !207)
!207 = !{null, !149}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "free_node_cache", scope: !194, file: !37, line: 293, baseType: !209, size: 64, offset: 3200)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!210 = !DISubroutineType(types: !211)
!211 = !{null, !149, !212}
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!213 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNode", file: !60, line: 167, size: 3712, elements: !214)
!214 = !{!215, !216, !217, !218, !219, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !556, !557, !558, !559, !560, !561}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !213, file: !60, line: 168, baseType: !212, size: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !213, file: !60, line: 168, baseType: !212, size: 64, offset: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "new_node", scope: !213, file: !60, line: 168, baseType: !212, size: 64, offset: 128)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !213, file: !60, line: 170, baseType: !66, size: 64, offset: 192)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !213, file: !60, line: 172, baseType: !220, size: 64, offset: 256)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!221 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeType", file: !37, line: 144, size: 6016, elements: !222)
!222 = !{!223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !242, !243, !244, !258, !262, !266, !267, !351, !356, !360, !361, !362, !363, !367, !368, !372, !376, !380, !384, !388, !392, !396, !397, !416, !421, !464, !484}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !221, file: !37, line: 145, baseType: !85, size: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !221, file: !37, line: 145, baseType: !85, size: 64, offset: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "needs_free", scope: !221, file: !37, line: 146, baseType: !77, size: 16, offset: 128)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !221, file: !37, line: 148, baseType: !44, size: 512, offset: 144)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !221, file: !37, line: 149, baseType: !41, size: 32, offset: 672)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "ui_name", scope: !221, file: !37, line: 151, baseType: !44, size: 512, offset: 704)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "ui_description", scope: !221, file: !37, line: 152, baseType: !200, size: 2048, offset: 1216)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "ui_icon", scope: !221, file: !37, line: 153, baseType: !41, size: 32, offset: 3264)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !221, file: !37, line: 155, baseType: !49, size: 32, offset: 3296)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "minwidth", scope: !221, file: !37, line: 155, baseType: !49, size: 32, offset: 3328)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "maxwidth", scope: !221, file: !37, line: 155, baseType: !49, size: 32, offset: 3360)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !221, file: !37, line: 156, baseType: !49, size: 32, offset: 3392)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "minheight", scope: !221, file: !37, line: 156, baseType: !49, size: 32, offset: 3424)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "maxheight", scope: !221, file: !37, line: 156, baseType: !49, size: 32, offset: 3456)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "nclass", scope: !221, file: !37, line: 157, baseType: !77, size: 16, offset: 3488)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !221, file: !37, line: 157, baseType: !77, size: 16, offset: 3504)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "compatibility", scope: !221, file: !37, line: 157, baseType: !77, size: 16, offset: 3520)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !221, file: !37, line: 160, baseType: !241, size: 64, offset: 3584)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !221, file: !37, line: 160, baseType: !241, size: 64, offset: 3648)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "storagename", scope: !221, file: !37, line: 162, baseType: !44, size: 512, offset: 3712)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "draw_nodetype", scope: !221, file: !37, line: 165, baseType: !245, size: 64, offset: 4224)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!246 = !DISubroutineType(types: !247)
!247 = !{null, !248, !250, !252, !149, !212, !254}
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!249 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !114)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!251 = !DICompositeType(tag: DW_TAG_structure_type, name: "ARegion", file: !37, line: 81, flags: DIFlagFwdDecl)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!253 = !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceNode", file: !60, line: 43, flags: DIFlagFwdDecl)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !60, line: 274, baseType: !255)
!255 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !60, line: 271, size: 32, elements: !256)
!256 = !{!257}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !255, file: !60, line: 273, baseType: !10, size: 32)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "draw_nodetype_prepare", scope: !221, file: !37, line: 168, baseType: !259, size: 64, offset: 4288)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = !DISubroutineType(types: !261)
!261 = !{null, !248, !149, !212}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "draw_buttons", scope: !221, file: !37, line: 171, baseType: !263, size: 64, offset: 4352)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!264 = !DISubroutineType(types: !265)
!265 = !{null, !116, !113, !118}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "draw_buttons_ex", scope: !221, file: !37, line: 173, baseType: !263, size: 64, offset: 4416)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "draw_backdrop", scope: !221, file: !37, line: 176, baseType: !268, size: 64, offset: 4480)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!269 = !DISubroutineType(types: !270)
!270 = !{null, !252, !271, !212, !41, !41}
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!272 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImBuf", file: !273, line: 70, size: 19840, elements: !274)
!273 = !DIFile(filename: "blender/source/blender/imbuf/IMB_imbuf_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!274 = !{!275, !276, !277, !278, !279, !281, !282, !283, !284, !286, !287, !292, !293, !294, !295, !296, !298, !300, !301, !302, !306, !307, !308, !309, !310, !313, !314, !315, !316, !317, !320, !321, !323, !324, !325, !329, !330, !331, !334, !335, !344}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !272, file: !273, line: 71, baseType: !271, size: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !272, file: !273, line: 71, baseType: !271, size: 64, offset: 64)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !272, file: !273, line: 74, baseType: !41, size: 32, offset: 128)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !272, file: !273, line: 74, baseType: !41, size: 32, offset: 160)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !272, file: !273, line: 79, baseType: !280, size: 8, offset: 192)
!280 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !272, file: !273, line: 80, baseType: !41, size: 32, offset: 224)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !272, file: !273, line: 83, baseType: !41, size: 32, offset: 256)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "mall", scope: !272, file: !273, line: 84, baseType: !41, size: 32, offset: 288)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !272, file: !273, line: 87, baseType: !285, size: 64, offset: 320)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "rect_float", scope: !272, file: !273, line: 88, baseType: !136, size: 64, offset: 384)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "ppm", scope: !272, file: !273, line: 93, baseType: !288, size: 128, offset: 448)
!288 = !DICompositeType(tag: DW_TAG_array_type, baseType: !289, size: 128, elements: !290)
!289 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!290 = !{!291}
!291 = !DISubrange(count: 2)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "tilex", scope: !272, file: !273, line: 96, baseType: !41, size: 32, offset: 576)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "tiley", scope: !272, file: !273, line: 96, baseType: !41, size: 32, offset: 608)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "xtiles", scope: !272, file: !273, line: 97, baseType: !41, size: 32, offset: 640)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "ytiles", scope: !272, file: !273, line: 97, baseType: !41, size: 32, offset: 672)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "tiles", scope: !272, file: !273, line: 98, baseType: !297, size: 64, offset: 704)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "zbuf", scope: !272, file: !273, line: 101, baseType: !299, size: 64, offset: 768)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "zbuf_float", scope: !272, file: !273, line: 102, baseType: !136, size: 64, offset: 832)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !272, file: !273, line: 105, baseType: !49, size: 32, offset: 896)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "mipmap", scope: !272, file: !273, line: 108, baseType: !303, size: 1280, offset: 960)
!303 = !DICompositeType(tag: DW_TAG_array_type, baseType: !271, size: 1280, elements: !304)
!304 = !{!305}
!305 = !DISubrange(count: 20)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "miptot", scope: !272, file: !273, line: 109, baseType: !41, size: 32, offset: 2240)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "miplevel", scope: !272, file: !273, line: 109, baseType: !41, size: 32, offset: 2272)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !272, file: !273, line: 112, baseType: !41, size: 32, offset: 2304)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "userflags", scope: !272, file: !273, line: 113, baseType: !41, size: 32, offset: 2336)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !272, file: !273, line: 114, baseType: !311, size: 64, offset: 2368)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!312 = !DICompositeType(tag: DW_TAG_structure_type, name: "ImMetaData", file: !273, line: 50, flags: DIFlagFwdDecl)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "userdata", scope: !272, file: !273, line: 115, baseType: !85, size: 64, offset: 2432)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "ftype", scope: !272, file: !273, line: 118, baseType: !41, size: 32, offset: 2496)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !272, file: !273, line: 119, baseType: !171, size: 8192, offset: 2528)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "cachename", scope: !272, file: !273, line: 120, baseType: !171, size: 8192, offset: 10720)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "c_handle", scope: !272, file: !273, line: 123, baseType: !318, size: 64, offset: 18944)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!319 = !DICompositeType(tag: DW_TAG_structure_type, name: "MEM_CacheLimiterHandle_s", file: !273, line: 123, flags: DIFlagFwdDecl)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "refcounter", scope: !272, file: !273, line: 124, baseType: !41, size: 32, offset: 19008)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "encodedbuffer", scope: !272, file: !273, line: 127, baseType: !322, size: 64, offset: 19072)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "encodedsize", scope: !272, file: !273, line: 128, baseType: !10, size: 32, offset: 19136)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "encodedbuffersize", scope: !272, file: !273, line: 129, baseType: !10, size: 32, offset: 19168)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "rect_colorspace", scope: !272, file: !273, line: 132, baseType: !326, size: 64, offset: 19200)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!327 = !DICompositeType(tag: DW_TAG_structure_type, name: "ColorSpace", file: !328, line: 63, flags: DIFlagFwdDecl)
!328 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!329 = !DIDerivedType(tag: DW_TAG_member, name: "float_colorspace", scope: !272, file: !273, line: 133, baseType: !326, size: 64, offset: 19264)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "display_buffer_flags", scope: !272, file: !273, line: 134, baseType: !285, size: 64, offset: 19328)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "colormanage_cache", scope: !272, file: !273, line: 135, baseType: !332, size: 64, offset: 19392)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!333 = !DICompositeType(tag: DW_TAG_structure_type, name: "ColormanageCache", file: !273, line: 135, flags: DIFlagFwdDecl)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "colormanage_flag", scope: !272, file: !273, line: 136, baseType: !41, size: 32, offset: 19456)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "invalid_rect", scope: !272, file: !273, line: 137, baseType: !336, size: 128, offset: 19488)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "rcti", file: !337, line: 89, baseType: !338)
!337 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!338 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rcti", file: !337, line: 86, size: 128, elements: !339)
!339 = !{!340, !341, !342, !343}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !338, file: !337, line: 87, baseType: !41, size: 32)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !338, file: !337, line: 87, baseType: !41, size: 32, offset: 32)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !338, file: !337, line: 88, baseType: !41, size: 32, offset: 64)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !338, file: !337, line: 88, baseType: !41, size: 32, offset: 96)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "dds_data", scope: !272, file: !273, line: 140, baseType: !345, size: 192, offset: 19648)
!345 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DDSData", file: !273, line: 55, size: 192, elements: !346)
!346 = !{!347, !348, !349, !350}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "fourcc", scope: !345, file: !273, line: 56, baseType: !10, size: 32)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "nummipmaps", scope: !345, file: !273, line: 57, baseType: !10, size: 32, offset: 32)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !345, file: !273, line: 58, baseType: !322, size: 64, offset: 64)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !345, file: !273, line: 59, baseType: !10, size: 32, offset: 128)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "labelfunc", scope: !221, file: !37, line: 179, baseType: !352, size: 64, offset: 4544)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = !DISubroutineType(types: !354)
!354 = !{null, !149, !212, !355, !41}
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "resize_area_func", scope: !221, file: !37, line: 181, baseType: !357, size: 64, offset: 4608)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!358 = !DISubroutineType(types: !359)
!359 = !{!41, !212, !41, !41}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "select_area_func", scope: !221, file: !37, line: 183, baseType: !357, size: 64, offset: 4672)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "tweak_area_func", scope: !221, file: !37, line: 185, baseType: !357, size: 64, offset: 4736)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "updatefunc", scope: !221, file: !37, line: 188, baseType: !209, size: 64, offset: 4800)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "verifyfunc", scope: !221, file: !37, line: 190, baseType: !364, size: 64, offset: 4864)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!365 = !DISubroutineType(types: !366)
!366 = !{null, !149, !212, !159}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "initfunc", scope: !221, file: !37, line: 193, baseType: !209, size: 64, offset: 4928)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "freefunc", scope: !221, file: !37, line: 195, baseType: !369, size: 64, offset: 4992)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!370 = !DISubroutineType(types: !371)
!371 = !{null, !212}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "copyfunc", scope: !221, file: !37, line: 197, baseType: !373, size: 64, offset: 5056)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64)
!374 = !DISubroutineType(types: !375)
!375 = !{null, !149, !212, !212}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "initfunc_api", scope: !221, file: !37, line: 200, baseType: !377, size: 64, offset: 5120)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!378 = !DISubroutineType(types: !379)
!379 = !{null, !248, !118}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "freefunc_api", scope: !221, file: !37, line: 201, baseType: !381, size: 64, offset: 5184)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!382 = !DISubroutineType(types: !383)
!383 = !{null, !118}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "copyfunc_api", scope: !221, file: !37, line: 202, baseType: !385, size: 64, offset: 5248)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!386 = !DISubroutineType(types: !387)
!387 = !{null, !118, !212}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "poll", scope: !221, file: !37, line: 205, baseType: !389, size: 64, offset: 5312)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = !DISubroutineType(types: !391)
!391 = !{!41, !220, !149}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "poll_instance", scope: !221, file: !37, line: 207, baseType: !393, size: 64, offset: 5376)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64)
!394 = !DISubroutineType(types: !395)
!395 = !{!41, !212, !149}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "update_internal_links", scope: !221, file: !37, line: 210, baseType: !209, size: 64, offset: 5440)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "initexecfunc", scope: !221, file: !37, line: 213, baseType: !398, size: 64, offset: 5504)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "NodeInitExecFunction", file: !37, line: 135, baseType: !399)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = !DISubroutineType(types: !401)
!401 = !{!85, !402, !212, !254}
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!403 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeExecContext", file: !404, line: 54, size: 64, elements: !405)
!404 = !DIFile(filename: "blender/source/blender/nodes/intern/node_util.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!405 = !{!406}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "previews", scope: !403, file: !404, line: 55, baseType: !407, size: 64)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!408 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHash", file: !37, line: 500, size: 64, elements: !409)
!409 = !{!410}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "ghash", scope: !408, file: !37, line: 502, baseType: !411, size: 64)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHash", file: !413, line: 48, baseType: !414)
!413 = !DIFile(filename: "blender/source/blender/blenlib/BLI_ghash.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!414 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !415, line: 47, flags: DIFlagFwdDecl)
!415 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!416 = !DIDerivedType(tag: DW_TAG_member, name: "freeexecfunc", scope: !221, file: !37, line: 214, baseType: !417, size: 64, offset: 5568)
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "NodeFreeExecFunction", file: !37, line: 136, baseType: !418)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!419 = !DISubroutineType(types: !420)
!420 = !{null, !85}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "execfunc", scope: !221, file: !37, line: 215, baseType: !422, size: 64, offset: 5632)
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "NodeExecFunction", file: !37, line: 137, baseType: !423)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!424 = !DISubroutineType(types: !425)
!425 = !{null, !85, !41, !212, !426, !445, !445}
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!427 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeExecData", file: !404, line: 58, size: 128, elements: !428)
!428 = !{!429, !430}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !427, file: !404, line: 59, baseType: !85, size: 64)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !427, file: !404, line: 60, baseType: !431, size: 64, offset: 64)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodePreview", file: !60, line: 289, size: 192, elements: !433)
!433 = !{!434, !441, !442, !443, !444}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "hash_entry", scope: !432, file: !60, line: 290, baseType: !435, size: 64)
!435 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceHashEntry", file: !60, line: 286, baseType: !436)
!436 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHashEntry", file: !60, line: 280, size: 64, elements: !437)
!437 = !{!438, !439, !440}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !436, file: !60, line: 281, baseType: !254, size: 32)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !436, file: !60, line: 284, baseType: !77, size: 16, offset: 32)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !436, file: !60, line: 285, baseType: !77, size: 16, offset: 48)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !432, file: !60, line: 292, baseType: !322, size: 64, offset: 64)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "xsize", scope: !432, file: !60, line: 293, baseType: !77, size: 16, offset: 128)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "ysize", scope: !432, file: !60, line: 293, baseType: !77, size: 16, offset: 144)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !432, file: !60, line: 294, baseType: !41, size: 32, offset: 160)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!447 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeStack", file: !60, line: 62, size: 384, elements: !448)
!448 = !{!449, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !447, file: !60, line: 63, baseType: !450, size: 128)
!450 = !DICompositeType(tag: DW_TAG_array_type, baseType: !49, size: 128, elements: !451)
!451 = !{!452}
!452 = !DISubrange(count: 4)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !447, file: !60, line: 64, baseType: !49, size: 32, offset: 128)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !447, file: !60, line: 64, baseType: !49, size: 32, offset: 160)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !447, file: !60, line: 65, baseType: !85, size: 64, offset: 192)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "hasinput", scope: !447, file: !60, line: 66, baseType: !77, size: 16, offset: 256)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "hasoutput", scope: !447, file: !60, line: 67, baseType: !77, size: 16, offset: 272)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "datatype", scope: !447, file: !60, line: 68, baseType: !77, size: 16, offset: 288)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "sockettype", scope: !447, file: !60, line: 69, baseType: !77, size: 16, offset: 304)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !447, file: !60, line: 70, baseType: !77, size: 16, offset: 320)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !447, file: !60, line: 71, baseType: !77, size: 16, offset: 336)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !447, file: !60, line: 72, baseType: !463, size: 32, offset: 352)
!463 = !DICompositeType(tag: DW_TAG_array_type, baseType: !77, size: 32, elements: !290)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "gpufunc", scope: !221, file: !37, line: 217, baseType: !465, size: 64, offset: 5696)
!465 = !DIDerivedType(tag: DW_TAG_typedef, name: "NodeGPUExecFunction", file: !37, line: 138, baseType: !466)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!467 = !DISubroutineType(types: !468)
!468 = !{!41, !469, !212, !426, !471, !471}
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64)
!470 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUMaterial", file: !37, line: 64, flags: DIFlagFwdDecl)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64)
!472 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GPUNodeStack", file: !9, line: 106, size: 384, elements: !473)
!473 = !{!474, !476, !477, !478, !481, !482, !483}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !472, file: !9, line: 107, baseType: !475, size: 32)
!475 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPUType", file: !9, line: 80, baseType: !8)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !472, file: !9, line: 108, baseType: !130, size: 64, offset: 64)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !472, file: !9, line: 109, baseType: !450, size: 128, offset: 128)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !472, file: !9, line: 110, baseType: !479, size: 64, offset: 256)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64)
!480 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUNodeLink", file: !9, line: 55, flags: DIFlagFwdDecl)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "hasinput", scope: !472, file: !9, line: 111, baseType: !280, size: 8, offset: 320)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "hasoutput", scope: !472, file: !9, line: 112, baseType: !280, size: 8, offset: 328)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "sockettype", scope: !472, file: !9, line: 113, baseType: !77, size: 16, offset: 336)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "ext", scope: !221, file: !37, line: 220, baseType: !485, size: 256, offset: 5760)
!485 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExtensionRNA", file: !120, line: 436, baseType: !486)
!486 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ExtensionRNA", file: !120, line: 430, size: 256, elements: !487)
!487 = !{!488, !489, !492, !508}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !486, file: !120, line: 431, baseType: !85, size: 64)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "srna", scope: !486, file: !120, line: 432, baseType: !490, size: 64, offset: 64)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64)
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructRNA", file: !120, line: 417, baseType: !128)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !486, file: !120, line: 433, baseType: !493, size: 64, offset: 128)
!493 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructCallbackFunc", file: !120, line: 408, baseType: !494)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64)
!495 = !DISubroutineType(types: !496)
!496 = !{!41, !113, !118, !497, !499}
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64)
!498 = !DICompositeType(tag: DW_TAG_structure_type, name: "FunctionRNA", file: !120, line: 38, flags: DIFlagFwdDecl)
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64)
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "ParameterList", file: !120, line: 348, baseType: !501)
!501 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParameterList", file: !120, line: 337, size: 256, elements: !502)
!502 = !{!503, !504, !505, !506, !507}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !501, file: !120, line: 339, baseType: !85, size: 64)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !501, file: !120, line: 342, baseType: !497, size: 64, offset: 64)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_size", scope: !501, file: !120, line: 345, baseType: !41, size: 32, offset: 128)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !501, file: !120, line: 347, baseType: !41, size: 32, offset: 160)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "ret_count", scope: !501, file: !120, line: 347, baseType: !41, size: 32, offset: 192)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !486, file: !120, line: 434, baseType: !509, size: 64, offset: 192)
!509 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructFreeFunc", file: !120, line: 409, baseType: !418)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !213, file: !60, line: 173, baseType: !44, size: 512, offset: 320)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !213, file: !60, line: 175, baseType: !44, size: 512, offset: 832)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !213, file: !60, line: 176, baseType: !41, size: 32, offset: 1344)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !213, file: !60, line: 177, baseType: !77, size: 16, offset: 1376)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !213, file: !60, line: 177, baseType: !77, size: 16, offset: 1392)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !213, file: !60, line: 178, baseType: !77, size: 16, offset: 1408)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !213, file: !60, line: 178, baseType: !77, size: 16, offset: 1424)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "lasty", scope: !213, file: !60, line: 179, baseType: !77, size: 16, offset: 1440)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "menunr", scope: !213, file: !60, line: 179, baseType: !77, size: 16, offset: 1456)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "stack_index", scope: !213, file: !60, line: 180, baseType: !77, size: 16, offset: 1472)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !213, file: !60, line: 181, baseType: !77, size: 16, offset: 1488)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !213, file: !60, line: 182, baseType: !522, size: 96, offset: 1504)
!522 = !DICompositeType(tag: DW_TAG_array_type, baseType: !49, size: 96, elements: !523)
!523 = !{!524}
!524 = !DISubrange(count: 3)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !213, file: !60, line: 184, baseType: !87, size: 128, offset: 1600)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !213, file: !60, line: 184, baseType: !87, size: 128, offset: 1728)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !213, file: !60, line: 185, baseType: !212, size: 64, offset: 1856)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !213, file: !60, line: 186, baseType: !159, size: 64, offset: 1920)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !213, file: !60, line: 187, baseType: !85, size: 64, offset: 1984)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "original", scope: !213, file: !60, line: 188, baseType: !212, size: 64, offset: 2048)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "internal_links", scope: !213, file: !60, line: 189, baseType: !87, size: 128, offset: 2112)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "locx", scope: !213, file: !60, line: 191, baseType: !49, size: 32, offset: 2240)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "locy", scope: !213, file: !60, line: 191, baseType: !49, size: 32, offset: 2272)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !213, file: !60, line: 192, baseType: !49, size: 32, offset: 2304)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !213, file: !60, line: 192, baseType: !49, size: 32, offset: 2336)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "miniwidth", scope: !213, file: !60, line: 193, baseType: !49, size: 32, offset: 2368)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "offsetx", scope: !213, file: !60, line: 194, baseType: !49, size: 32, offset: 2400)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "offsety", scope: !213, file: !60, line: 194, baseType: !49, size: 32, offset: 2432)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !213, file: !60, line: 196, baseType: !41, size: 32, offset: 2464)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !213, file: !60, line: 198, baseType: !44, size: 512, offset: 2496)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "custom1", scope: !213, file: !60, line: 199, baseType: !77, size: 16, offset: 3008)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "custom2", scope: !213, file: !60, line: 199, baseType: !77, size: 16, offset: 3024)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "custom3", scope: !213, file: !60, line: 200, baseType: !49, size: 32, offset: 3040)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "custom4", scope: !213, file: !60, line: 200, baseType: !49, size: 32, offset: 3072)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "need_exec", scope: !213, file: !60, line: 202, baseType: !77, size: 16, offset: 3104)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !213, file: !60, line: 202, baseType: !77, size: 16, offset: 3120)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "threaddata", scope: !213, file: !60, line: 203, baseType: !85, size: 64, offset: 3136)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "totr", scope: !213, file: !60, line: 204, baseType: !549, size: 128, offset: 3200)
!549 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !337, line: 95, baseType: !550)
!550 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !337, line: 92, size: 128, elements: !551)
!551 = !{!552, !553, !554, !555}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !550, file: !337, line: 93, baseType: !49, size: 32)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !550, file: !337, line: 93, baseType: !49, size: 32, offset: 32)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !550, file: !337, line: 94, baseType: !49, size: 32, offset: 64)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !550, file: !337, line: 94, baseType: !49, size: 32, offset: 96)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "butr", scope: !213, file: !60, line: 205, baseType: !549, size: 128, offset: 3328)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "prvr", scope: !213, file: !60, line: 206, baseType: !549, size: 128, offset: 3456)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "preview_xsize", scope: !213, file: !60, line: 215, baseType: !77, size: 16, offset: 3584)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "preview_ysize", scope: !213, file: !60, line: 215, baseType: !77, size: 16, offset: 3600)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !213, file: !60, line: 216, baseType: !41, size: 32, offset: 3616)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !213, file: !60, line: 217, baseType: !562, size: 64, offset: 3648)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64)
!563 = !DICompositeType(tag: DW_TAG_structure_type, name: "uiBlock", file: !60, line: 51, flags: DIFlagFwdDecl)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "foreach_nodeclass", scope: !194, file: !37, line: 294, baseType: !565, size: 64, offset: 3264)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64)
!566 = !DISubroutineType(types: !567)
!567 = !{null, !568, !85, !2128}
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64)
!569 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !328, line: 1216, size: 39680, elements: !570)
!570 = !{!571, !572, !573, !1434, !1515, !1516, !1517, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1544, !1756, !1759, !2002, !2014, !2015, !2016, !2017, !2018, !2019, !2020, !2021, !2024, !2025, !2026, !2027, !2028, !2036, !2102, !2109, !2110, !2117, !2120, !2121, !2122, !2123, !2124, !2125}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !569, file: !328, line: 1217, baseType: !153, size: 960)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !569, file: !328, line: 1218, baseType: !189, size: 64, offset: 960)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !569, file: !328, line: 1220, baseType: !574, size: 64, offset: 1024)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64)
!575 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !576, line: 115, size: 11392, elements: !577)
!576 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!577 = !{!578, !579, !580, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !597, !607, !620, !621, !661, !662, !665, !666, !682, !683, !684, !685, !686, !687, !688, !1295, !1296, !1297, !1298, !1299, !1300, !1301, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1316, !1317, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1341, !1342, !1343, !1344, !1345, !1346, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1355, !1356, !1357, !1358, !1359, !1360, !1361, !1362, !1363, !1364, !1365, !1366, !1367, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1381, !1384, !1385, !1386, !1387, !1388, !1389, !1392, !1395, !1398, !1399, !1405, !1406, !1407, !1408, !1409, !1410, !1412, !1415, !1418, !1419, !1422, !1423}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !575, file: !576, line: 116, baseType: !153, size: 960)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !575, file: !576, line: 117, baseType: !189, size: 64, offset: 960)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !575, file: !576, line: 119, baseType: !581, size: 64, offset: 1024)
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64)
!582 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !576, line: 57, flags: DIFlagFwdDecl)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !575, file: !576, line: 121, baseType: !77, size: 16, offset: 1088)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !575, file: !576, line: 121, baseType: !77, size: 16, offset: 1104)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !575, file: !576, line: 122, baseType: !41, size: 32, offset: 1120)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !575, file: !576, line: 122, baseType: !41, size: 32, offset: 1152)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !575, file: !576, line: 122, baseType: !41, size: 32, offset: 1184)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !575, file: !576, line: 123, baseType: !44, size: 512, offset: 1216)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !575, file: !576, line: 124, baseType: !574, size: 64, offset: 1728)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !575, file: !576, line: 124, baseType: !574, size: 64, offset: 1792)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !575, file: !576, line: 127, baseType: !574, size: 64, offset: 1856)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !575, file: !576, line: 127, baseType: !574, size: 64, offset: 1920)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !575, file: !576, line: 127, baseType: !574, size: 64, offset: 1984)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !575, file: !576, line: 128, baseType: !595, size: 64, offset: 2048)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64)
!596 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !191, line: 49, flags: DIFlagFwdDecl)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !575, file: !576, line: 130, baseType: !598, size: 64, offset: 2112)
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !599, size: 64)
!599 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !576, line: 97, size: 832, elements: !600)
!600 = !{!601, !605, !606}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !599, file: !576, line: 98, baseType: !602, size: 768)
!602 = !DICompositeType(tag: DW_TAG_array_type, baseType: !49, size: 768, elements: !603)
!603 = !{!604, !524}
!604 = !DISubrange(count: 8)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !599, file: !576, line: 99, baseType: !41, size: 32, offset: 768)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !599, file: !576, line: 99, baseType: !41, size: 32, offset: 800)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !575, file: !576, line: 131, baseType: !608, size: 64, offset: 2176)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64)
!609 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !415, line: 486, size: 1600, elements: !610)
!610 = !{!611, !612, !613, !614, !615, !616, !617, !618, !619}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !609, file: !415, line: 487, baseType: !153, size: 960)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !609, file: !415, line: 489, baseType: !87, size: 128, offset: 960)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !609, file: !415, line: 490, baseType: !87, size: 128, offset: 1088)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !609, file: !415, line: 491, baseType: !87, size: 128, offset: 1216)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !609, file: !415, line: 492, baseType: !87, size: 128, offset: 1344)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !609, file: !415, line: 494, baseType: !41, size: 32, offset: 1472)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !609, file: !415, line: 495, baseType: !41, size: 32, offset: 1504)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !609, file: !415, line: 497, baseType: !41, size: 32, offset: 1536)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !609, file: !415, line: 498, baseType: !41, size: 32, offset: 1568)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !575, file: !576, line: 132, baseType: !608, size: 64, offset: 2240)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !575, file: !576, line: 133, baseType: !622, size: 64, offset: 2304)
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 64)
!623 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !415, line: 334, size: 1728, elements: !624)
!624 = !{!625, !626, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !660}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !623, file: !415, line: 335, baseType: !87, size: 128)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !623, file: !415, line: 336, baseType: !627, size: 64, offset: 128)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !623, file: !415, line: 338, baseType: !77, size: 16, offset: 192)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !623, file: !415, line: 338, baseType: !77, size: 16, offset: 208)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !623, file: !415, line: 339, baseType: !10, size: 32, offset: 224)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !623, file: !415, line: 340, baseType: !41, size: 32, offset: 256)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !623, file: !415, line: 342, baseType: !49, size: 32, offset: 288)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !623, file: !415, line: 343, baseType: !522, size: 96, offset: 320)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !623, file: !415, line: 344, baseType: !522, size: 96, offset: 416)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !623, file: !415, line: 347, baseType: !87, size: 128, offset: 512)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !623, file: !415, line: 349, baseType: !41, size: 32, offset: 640)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !623, file: !415, line: 350, baseType: !41, size: 32, offset: 672)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !623, file: !415, line: 351, baseType: !85, size: 64, offset: 704)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !623, file: !415, line: 352, baseType: !85, size: 64, offset: 768)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !623, file: !415, line: 354, baseType: !641, size: 384, offset: 832)
!641 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !415, line: 116, baseType: !642)
!642 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !415, line: 94, size: 384, elements: !643)
!643 = !{!644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659}
!644 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !642, file: !415, line: 96, baseType: !41, size: 32)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !642, file: !415, line: 96, baseType: !41, size: 32, offset: 32)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !642, file: !415, line: 97, baseType: !41, size: 32, offset: 64)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !642, file: !415, line: 97, baseType: !41, size: 32, offset: 96)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !642, file: !415, line: 99, baseType: !77, size: 16, offset: 128)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !642, file: !415, line: 100, baseType: !77, size: 16, offset: 144)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !642, file: !415, line: 102, baseType: !77, size: 16, offset: 160)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !642, file: !415, line: 105, baseType: !77, size: 16, offset: 176)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !642, file: !415, line: 108, baseType: !77, size: 16, offset: 192)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !642, file: !415, line: 109, baseType: !77, size: 16, offset: 208)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !642, file: !415, line: 111, baseType: !77, size: 16, offset: 224)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !642, file: !415, line: 112, baseType: !77, size: 16, offset: 240)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !642, file: !415, line: 114, baseType: !41, size: 32, offset: 256)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !642, file: !415, line: 114, baseType: !41, size: 32, offset: 288)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !642, file: !415, line: 115, baseType: !41, size: 32, offset: 320)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !642, file: !415, line: 115, baseType: !41, size: 32, offset: 352)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !623, file: !415, line: 355, baseType: !44, size: 512, offset: 1216)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !575, file: !576, line: 134, baseType: !85, size: 64, offset: 2368)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !575, file: !576, line: 136, baseType: !663, size: 64, offset: 2432)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64)
!664 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !328, line: 61, flags: DIFlagFwdDecl)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !575, file: !576, line: 138, baseType: !641, size: 384, offset: 2496)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !575, file: !576, line: 139, baseType: !667, size: 64, offset: 2880)
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64)
!668 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !415, line: 80, baseType: !669)
!669 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !415, line: 72, size: 192, elements: !670)
!670 = !{!671, !678, !679, !680, !681}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !669, file: !415, line: 73, baseType: !672, size: 64)
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 64)
!673 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !415, line: 59, baseType: !674)
!674 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !415, line: 56, size: 128, elements: !675)
!675 = !{!676, !677}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !674, file: !415, line: 57, baseType: !522, size: 96)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !674, file: !415, line: 58, baseType: !41, size: 32, offset: 96)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !669, file: !415, line: 74, baseType: !41, size: 32, offset: 64)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !669, file: !415, line: 76, baseType: !41, size: 32, offset: 96)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !669, file: !415, line: 77, baseType: !41, size: 32, offset: 128)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !669, file: !415, line: 79, baseType: !41, size: 32, offset: 160)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !575, file: !576, line: 141, baseType: !87, size: 128, offset: 2944)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !575, file: !576, line: 142, baseType: !87, size: 128, offset: 3072)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !575, file: !576, line: 143, baseType: !87, size: 128, offset: 3200)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !575, file: !576, line: 144, baseType: !87, size: 128, offset: 3328)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !575, file: !576, line: 146, baseType: !41, size: 32, offset: 3456)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !575, file: !576, line: 147, baseType: !41, size: 32, offset: 3488)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !575, file: !576, line: 150, baseType: !689, size: 64, offset: 3520)
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 64)
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 64)
!691 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !191, line: 93, size: 7552, elements: !692)
!692 = !{!693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !741, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !1254, !1255, !1256, !1257, !1258, !1259, !1260, !1261, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1278, !1279, !1280, !1281, !1282, !1283, !1284, !1285, !1286, !1294}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !691, file: !191, line: 94, baseType: !153, size: 960)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !691, file: !191, line: 95, baseType: !189, size: 64, offset: 960)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "material_type", scope: !691, file: !191, line: 97, baseType: !77, size: 16, offset: 1024)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !691, file: !191, line: 97, baseType: !77, size: 16, offset: 1040)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !691, file: !191, line: 99, baseType: !49, size: 32, offset: 1056)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !691, file: !191, line: 99, baseType: !49, size: 32, offset: 1088)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !691, file: !191, line: 99, baseType: !49, size: 32, offset: 1120)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "specr", scope: !691, file: !191, line: 100, baseType: !49, size: 32, offset: 1152)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "specg", scope: !691, file: !191, line: 100, baseType: !49, size: 32, offset: 1184)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "specb", scope: !691, file: !191, line: 100, baseType: !49, size: 32, offset: 1216)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "mirr", scope: !691, file: !191, line: 101, baseType: !49, size: 32, offset: 1248)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "mirg", scope: !691, file: !191, line: 101, baseType: !49, size: 32, offset: 1280)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "mirb", scope: !691, file: !191, line: 101, baseType: !49, size: 32, offset: 1312)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "ambr", scope: !691, file: !191, line: 102, baseType: !49, size: 32, offset: 1344)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "ambb", scope: !691, file: !191, line: 102, baseType: !49, size: 32, offset: 1376)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "ambg", scope: !691, file: !191, line: 102, baseType: !49, size: 32, offset: 1408)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "amb", scope: !691, file: !191, line: 103, baseType: !49, size: 32, offset: 1440)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "emit", scope: !691, file: !191, line: 103, baseType: !49, size: 32, offset: 1472)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "ang", scope: !691, file: !191, line: 103, baseType: !49, size: 32, offset: 1504)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "spectra", scope: !691, file: !191, line: 103, baseType: !49, size: 32, offset: 1536)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "ray_mirror", scope: !691, file: !191, line: 103, baseType: !49, size: 32, offset: 1568)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !691, file: !191, line: 104, baseType: !49, size: 32, offset: 1600)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !691, file: !191, line: 104, baseType: !49, size: 32, offset: 1632)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "spec", scope: !691, file: !191, line: 104, baseType: !49, size: 32, offset: 1664)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "zoffs", scope: !691, file: !191, line: 104, baseType: !49, size: 32, offset: 1696)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "add", scope: !691, file: !191, line: 104, baseType: !49, size: 32, offset: 1728)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "translucency", scope: !691, file: !191, line: 105, baseType: !49, size: 32, offset: 1760)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "vol", scope: !691, file: !191, line: 108, baseType: !721, size: 704, offset: 1792)
!721 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VolumeSettings", file: !191, line: 53, size: 704, elements: !722)
!722 = !{!723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "density", scope: !721, file: !191, line: 54, baseType: !49, size: 32)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "emission", scope: !721, file: !191, line: 55, baseType: !49, size: 32, offset: 32)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "scattering", scope: !721, file: !191, line: 56, baseType: !49, size: 32, offset: 64)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "reflection", scope: !721, file: !191, line: 57, baseType: !49, size: 32, offset: 96)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "emission_col", scope: !721, file: !191, line: 59, baseType: !522, size: 96, offset: 128)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "transmission_col", scope: !721, file: !191, line: 60, baseType: !522, size: 96, offset: 224)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "reflection_col", scope: !721, file: !191, line: 61, baseType: !522, size: 96, offset: 320)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "density_scale", scope: !721, file: !191, line: 63, baseType: !49, size: 32, offset: 416)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "depth_cutoff", scope: !721, file: !191, line: 64, baseType: !49, size: 32, offset: 448)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "asymmetry", scope: !721, file: !191, line: 65, baseType: !49, size: 32, offset: 480)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "stepsize_type", scope: !721, file: !191, line: 67, baseType: !77, size: 16, offset: 512)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "shadeflag", scope: !721, file: !191, line: 68, baseType: !77, size: 16, offset: 528)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "shade_type", scope: !721, file: !191, line: 69, baseType: !77, size: 16, offset: 544)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "precache_resolution", scope: !721, file: !191, line: 70, baseType: !77, size: 16, offset: 560)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "stepsize", scope: !721, file: !191, line: 72, baseType: !49, size: 32, offset: 576)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "ms_diff", scope: !721, file: !191, line: 73, baseType: !49, size: 32, offset: 608)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "ms_intensity", scope: !721, file: !191, line: 74, baseType: !49, size: 32, offset: 640)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "ms_spread", scope: !721, file: !191, line: 75, baseType: !49, size: 32, offset: 672)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "game", scope: !691, file: !191, line: 109, baseType: !742, size: 128, offset: 2496)
!742 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GameSettings", file: !191, line: 79, size: 128, elements: !743)
!743 = !{!744, !745, !746, !747}
!744 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !742, file: !191, line: 80, baseType: !41, size: 32)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_blend", scope: !742, file: !191, line: 81, baseType: !41, size: 32, offset: 32)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "face_orientation", scope: !742, file: !191, line: 82, baseType: !41, size: 32, offset: 64)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !742, file: !191, line: 83, baseType: !41, size: 32, offset: 96)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_mir", scope: !691, file: !191, line: 111, baseType: !49, size: 32, offset: 2624)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_mir_i", scope: !691, file: !191, line: 111, baseType: !49, size: 32, offset: 2656)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_tra", scope: !691, file: !191, line: 112, baseType: !49, size: 32, offset: 2688)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_tra_i", scope: !691, file: !191, line: 112, baseType: !49, size: 32, offset: 2720)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !691, file: !191, line: 113, baseType: !49, size: 32, offset: 2752)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "tx_limit", scope: !691, file: !191, line: 114, baseType: !49, size: 32, offset: 2784)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "tx_falloff", scope: !691, file: !191, line: 114, baseType: !49, size: 32, offset: 2816)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "ray_depth", scope: !691, file: !191, line: 115, baseType: !77, size: 16, offset: 2848)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "ray_depth_tra", scope: !691, file: !191, line: 115, baseType: !77, size: 16, offset: 2864)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "har", scope: !691, file: !191, line: 116, baseType: !77, size: 16, offset: 2880)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "seed1", scope: !691, file: !191, line: 117, baseType: !45, size: 8, offset: 2896)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "seed2", scope: !691, file: !191, line: 117, baseType: !45, size: 8, offset: 2904)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "gloss_mir", scope: !691, file: !191, line: 119, baseType: !49, size: 32, offset: 2912)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "gloss_tra", scope: !691, file: !191, line: 119, baseType: !49, size: 32, offset: 2944)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "samp_gloss_mir", scope: !691, file: !191, line: 120, baseType: !77, size: 16, offset: 2976)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "samp_gloss_tra", scope: !691, file: !191, line: 120, baseType: !77, size: 16, offset: 2992)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "adapt_thresh_mir", scope: !691, file: !191, line: 121, baseType: !49, size: 32, offset: 3008)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "adapt_thresh_tra", scope: !691, file: !191, line: 121, baseType: !49, size: 32, offset: 3040)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "aniso_gloss_mir", scope: !691, file: !191, line: 122, baseType: !49, size: 32, offset: 3072)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "dist_mir", scope: !691, file: !191, line: 123, baseType: !49, size: 32, offset: 3104)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "fadeto_mir", scope: !691, file: !191, line: 124, baseType: !77, size: 16, offset: 3136)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "shade_flag", scope: !691, file: !191, line: 125, baseType: !77, size: 16, offset: 3152)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !691, file: !191, line: 127, baseType: !41, size: 32, offset: 3168)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "mode_l", scope: !691, file: !191, line: 127, baseType: !41, size: 32, offset: 3200)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "mode2", scope: !691, file: !191, line: 128, baseType: !41, size: 32, offset: 3232)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "mode2_l", scope: !691, file: !191, line: 128, baseType: !41, size: 32, offset: 3264)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "flarec", scope: !691, file: !191, line: 129, baseType: !77, size: 16, offset: 3296)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "starc", scope: !691, file: !191, line: 129, baseType: !77, size: 16, offset: 3312)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "linec", scope: !691, file: !191, line: 129, baseType: !77, size: 16, offset: 3328)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "ringc", scope: !691, file: !191, line: 129, baseType: !77, size: 16, offset: 3344)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "hasize", scope: !691, file: !191, line: 130, baseType: !49, size: 32, offset: 3360)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "flaresize", scope: !691, file: !191, line: 130, baseType: !49, size: 32, offset: 3392)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "subsize", scope: !691, file: !191, line: 130, baseType: !49, size: 32, offset: 3424)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "flareboost", scope: !691, file: !191, line: 130, baseType: !49, size: 32, offset: 3456)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "strand_sta", scope: !691, file: !191, line: 131, baseType: !49, size: 32, offset: 3488)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "strand_end", scope: !691, file: !191, line: 131, baseType: !49, size: 32, offset: 3520)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "strand_ease", scope: !691, file: !191, line: 131, baseType: !49, size: 32, offset: 3552)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "strand_surfnor", scope: !691, file: !191, line: 131, baseType: !49, size: 32, offset: 3584)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "strand_min", scope: !691, file: !191, line: 132, baseType: !49, size: 32, offset: 3616)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "strand_widthfade", scope: !691, file: !191, line: 132, baseType: !49, size: 32, offset: 3648)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "strand_uvname", scope: !691, file: !191, line: 133, baseType: !44, size: 512, offset: 3680)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "sbias", scope: !691, file: !191, line: 135, baseType: !49, size: 32, offset: 4192)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "lbias", scope: !691, file: !191, line: 136, baseType: !49, size: 32, offset: 4224)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "shad_alpha", scope: !691, file: !191, line: 137, baseType: !49, size: 32, offset: 4256)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "septex", scope: !691, file: !191, line: 138, baseType: !41, size: 32, offset: 4288)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "rgbsel", scope: !691, file: !191, line: 141, baseType: !45, size: 8, offset: 4320)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "texact", scope: !691, file: !191, line: 141, baseType: !45, size: 8, offset: 4328)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "pr_type", scope: !691, file: !191, line: 141, baseType: !45, size: 8, offset: 4336)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !691, file: !191, line: 141, baseType: !45, size: 8, offset: 4344)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "pr_lamp", scope: !691, file: !191, line: 142, baseType: !77, size: 16, offset: 4352)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "pr_texture", scope: !691, file: !191, line: 142, baseType: !77, size: 16, offset: 4368)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flag", scope: !691, file: !191, line: 142, baseType: !77, size: 16, offset: 4384)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "mapflag", scope: !691, file: !191, line: 145, baseType: !45, size: 8, offset: 4400)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !691, file: !191, line: 145, baseType: !45, size: 8, offset: 4408)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "diff_shader", scope: !691, file: !191, line: 148, baseType: !77, size: 16, offset: 4416)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "spec_shader", scope: !691, file: !191, line: 148, baseType: !77, size: 16, offset: 4432)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "roughness", scope: !691, file: !191, line: 149, baseType: !49, size: 32, offset: 4448)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "refrac", scope: !691, file: !191, line: 149, baseType: !49, size: 32, offset: 4480)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !691, file: !191, line: 152, baseType: !450, size: 128, offset: 4512)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "rms", scope: !691, file: !191, line: 153, baseType: !49, size: 32, offset: 4640)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "darkness", scope: !691, file: !191, line: 154, baseType: !49, size: 32, offset: 4672)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !691, file: !191, line: 157, baseType: !77, size: 16, offset: 4704)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !691, file: !191, line: 157, baseType: !77, size: 16, offset: 4720)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_col", scope: !691, file: !191, line: 160, baseType: !812, size: 64, offset: 4736)
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !813, size: 64)
!813 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorBand", file: !814, line: 113, size: 6208, elements: !815)
!814 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!815 = !{!816, !817, !818, !819, !820, !821, !825}
!816 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !813, file: !814, line: 114, baseType: !77, size: 16)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !813, file: !814, line: 114, baseType: !77, size: 16, offset: 16)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype", scope: !813, file: !814, line: 115, baseType: !45, size: 8, offset: 32)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype_hue", scope: !813, file: !814, line: 115, baseType: !45, size: 8, offset: 40)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "color_mode", scope: !813, file: !814, line: 116, baseType: !45, size: 8, offset: 48)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !813, file: !814, line: 117, baseType: !822, size: 8, offset: 56)
!822 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 8, elements: !823)
!823 = !{!824}
!824 = !DISubrange(count: 1)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !813, file: !814, line: 119, baseType: !826, size: 6144, offset: 64)
!826 = !DICompositeType(tag: DW_TAG_array_type, baseType: !827, size: 6144, elements: !836)
!827 = !DIDerivedType(tag: DW_TAG_typedef, name: "CBData", file: !814, line: 109, baseType: !828)
!828 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CBData", file: !814, line: 106, size: 192, elements: !829)
!829 = !{!830, !831, !832, !833, !834, !835}
!830 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !828, file: !814, line: 107, baseType: !49, size: 32)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !828, file: !814, line: 107, baseType: !49, size: 32, offset: 32)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !828, file: !814, line: 107, baseType: !49, size: 32, offset: 64)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !828, file: !814, line: 107, baseType: !49, size: 32, offset: 96)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !828, file: !814, line: 107, baseType: !49, size: 32, offset: 128)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !828, file: !814, line: 108, baseType: !41, size: 32, offset: 160)
!836 = !{!837}
!837 = !DISubrange(count: 32)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_spec", scope: !691, file: !191, line: 161, baseType: !812, size: 64, offset: 4800)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "rampin_col", scope: !691, file: !191, line: 162, baseType: !45, size: 8, offset: 4864)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "rampin_spec", scope: !691, file: !191, line: 162, baseType: !45, size: 8, offset: 4872)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "rampblend_col", scope: !691, file: !191, line: 163, baseType: !45, size: 8, offset: 4880)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "rampblend_spec", scope: !691, file: !191, line: 163, baseType: !45, size: 8, offset: 4888)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_show", scope: !691, file: !191, line: 164, baseType: !77, size: 16, offset: 4896)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !691, file: !191, line: 164, baseType: !77, size: 16, offset: 4912)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "rampfac_col", scope: !691, file: !191, line: 165, baseType: !49, size: 32, offset: 4928)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "rampfac_spec", scope: !691, file: !191, line: 165, baseType: !49, size: 32, offset: 4960)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "mtex", scope: !691, file: !191, line: 167, baseType: !848, size: 1152, offset: 4992)
!848 = !DICompositeType(tag: DW_TAG_array_type, baseType: !849, size: 1152, elements: !1252)
!849 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !850, size: 64)
!850 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTex", file: !814, line: 57, size: 2496, elements: !851)
!851 = !{!852, !853, !854, !855, !856, !857, !1193, !1194, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1218, !1219, !1220, !1221, !1222, !1223, !1224, !1225, !1226, !1227, !1228, !1229, !1230, !1231, !1232, !1233, !1234, !1235, !1236, !1237, !1238, !1239, !1240, !1241, !1242, !1243, !1244, !1245, !1246, !1247, !1248, !1249, !1250, !1251}
!852 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !850, file: !814, line: 59, baseType: !77, size: 16)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !850, file: !814, line: 59, baseType: !77, size: 16, offset: 16)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "maptoneg", scope: !850, file: !814, line: 59, baseType: !77, size: 16, offset: 32)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "blendtype", scope: !850, file: !814, line: 59, baseType: !77, size: 16, offset: 48)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !850, file: !814, line: 60, baseType: !574, size: 64, offset: 64)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "tex", scope: !850, file: !814, line: 61, baseType: !858, size: 64, offset: 128)
!858 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !859, size: 64)
!859 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Tex", file: !814, line: 202, size: 3328, elements: !860)
!860 = !{!861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !930, !931, !932, !1063, !1064, !1092, !1093, !1162, !1183, !1191, !1192}
!861 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !859, file: !814, line: 203, baseType: !153, size: 960)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !859, file: !814, line: 204, baseType: !189, size: 64, offset: 960)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "noisesize", scope: !859, file: !814, line: 206, baseType: !49, size: 32, offset: 1024)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "turbul", scope: !859, file: !814, line: 206, baseType: !49, size: 32, offset: 1056)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "bright", scope: !859, file: !814, line: 207, baseType: !49, size: 32, offset: 1088)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "contrast", scope: !859, file: !814, line: 207, baseType: !49, size: 32, offset: 1120)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "saturation", scope: !859, file: !814, line: 207, baseType: !49, size: 32, offset: 1152)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "rfac", scope: !859, file: !814, line: 207, baseType: !49, size: 32, offset: 1184)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "gfac", scope: !859, file: !814, line: 207, baseType: !49, size: 32, offset: 1216)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "bfac", scope: !859, file: !814, line: 207, baseType: !49, size: 32, offset: 1248)
