; ModuleID = 'blender_bin/source/blender/makesrna/intern/rna_boid_gen.c'
source_filename = "blender_bin/source/blender/makesrna/intern/rna_boid_gen.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.EnumPropertyItem = type { i32, i8*, i32, i8*, i8* }
%struct.CollectionPropertyRNA = type { %struct.PropertyRNA, void (%struct.CollectionPropertyIterator*, %struct.PointerRNA*)*, void (%struct.CollectionPropertyIterator*)*, void (%struct.CollectionPropertyIterator*)*, void (%struct.PointerRNA*, %struct.CollectionPropertyIterator*)*, i32 (%struct.PointerRNA*)*, i32 (%struct.PointerRNA*, i32, %struct.PointerRNA*)*, i32 (%struct.PointerRNA*, i8*, %struct.PointerRNA*)*, i32 (%struct.PointerRNA*, i32, %struct.PointerRNA*)*, %struct.StructRNA* }
%struct.PropertyRNA = type { %struct.PropertyRNA*, %struct.PropertyRNA*, i32, i8*, i32, i8*, i8*, i32, i8*, i32, i32, i32 (%struct.PointerRNA*, i32*)*, i32, [3 x i32], i32, void (%struct.Main*, %struct.Scene*, %struct.PointerRNA*)*, i32, i32 (%struct.PointerRNA*)*, i32 (%struct.PointerRNA*, i32)*, i32, i32, %struct.StructRNA*, i8* }
%struct.PointerRNA = type { %struct.anon, %struct.StructRNA*, i8* }
%struct.anon = type { i8* }

!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !63, globals: !2216, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "blender_bin/source/blender/makesrna/intern/rna_boid_gen.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !{!5, !16, !47, !56}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PropertyType", file: !6, line: 71, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15}
!9 = !DIEnumerator(name: "PROP_BOOLEAN", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "PROP_INT", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "PROP_FLOAT", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "PROP_STRING", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "PROP_ENUM", value: 4, isUnsigned: true)
!14 = !DIEnumerator(name: "PROP_POINTER", value: 5, isUnsigned: true)
!15 = !DIEnumerator(name: "PROP_COLLECTION", value: 6, isUnsigned: true)
!16 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PropertySubType", file: !6, line: 107, baseType: !7, size: 32, elements: !17)
!17 = !{!18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46}
!18 = !DIEnumerator(name: "PROP_NONE", value: 0, isUnsigned: true)
!19 = !DIEnumerator(name: "PROP_FILEPATH", value: 1, isUnsigned: true)
!20 = !DIEnumerator(name: "PROP_DIRPATH", value: 2, isUnsigned: true)
!21 = !DIEnumerator(name: "PROP_FILENAME", value: 3, isUnsigned: true)
!22 = !DIEnumerator(name: "PROP_BYTESTRING", value: 4, isUnsigned: true)
!23 = !DIEnumerator(name: "PROP_PASSWORD", value: 6, isUnsigned: true)
!24 = !DIEnumerator(name: "PROP_PIXEL", value: 12, isUnsigned: true)
!25 = !DIEnumerator(name: "PROP_UNSIGNED", value: 13, isUnsigned: true)
!26 = !DIEnumerator(name: "PROP_PERCENTAGE", value: 14, isUnsigned: true)
!27 = !DIEnumerator(name: "PROP_FACTOR", value: 15, isUnsigned: true)
!28 = !DIEnumerator(name: "PROP_ANGLE", value: 327696, isUnsigned: true)
!29 = !DIEnumerator(name: "PROP_TIME", value: 393233, isUnsigned: true)
!30 = !DIEnumerator(name: "PROP_DISTANCE", value: 65554, isUnsigned: true)
!31 = !DIEnumerator(name: "PROP_DISTANCE_CAMERA", value: 589843, isUnsigned: true)
!32 = !DIEnumerator(name: "PROP_COLOR", value: 20, isUnsigned: true)
!33 = !DIEnumerator(name: "PROP_TRANSLATION", value: 65557, isUnsigned: true)
!34 = !DIEnumerator(name: "PROP_DIRECTION", value: 22, isUnsigned: true)
!35 = !DIEnumerator(name: "PROP_VELOCITY", value: 458775, isUnsigned: true)
!36 = !DIEnumerator(name: "PROP_ACCELERATION", value: 524312, isUnsigned: true)
!37 = !DIEnumerator(name: "PROP_MATRIX", value: 25, isUnsigned: true)
!38 = !DIEnumerator(name: "PROP_EULER", value: 327706, isUnsigned: true)
!39 = !DIEnumerator(name: "PROP_QUATERNION", value: 27, isUnsigned: true)
!40 = !DIEnumerator(name: "PROP_AXISANGLE", value: 28, isUnsigned: true)
!41 = !DIEnumerator(name: "PROP_XYZ", value: 29, isUnsigned: true)
!42 = !DIEnumerator(name: "PROP_XYZ_LENGTH", value: 65565, isUnsigned: true)
!43 = !DIEnumerator(name: "PROP_COLOR_GAMMA", value: 30, isUnsigned: true)
!44 = !DIEnumerator(name: "PROP_COORDS", value: 31, isUnsigned: true)
!45 = !DIEnumerator(name: "PROP_LAYER", value: 40, isUnsigned: true)
!46 = !DIEnumerator(name: "PROP_LAYER_MEMBER", value: 41, isUnsigned: true)
!47 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "RawPropertyType", file: !6, line: 286, baseType: !48, size: 32, elements: !49)
!48 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!49 = !{!50, !51, !52, !53, !54, !55}
!50 = !DIEnumerator(name: "PROP_RAW_UNSET", value: -1)
!51 = !DIEnumerator(name: "PROP_RAW_INT", value: 0)
!52 = !DIEnumerator(name: "PROP_RAW_SHORT", value: 1)
!53 = !DIEnumerator(name: "PROP_RAW_CHAR", value: 2)
!54 = !DIEnumerator(name: "PROP_RAW_DOUBLE", value: 3)
!55 = !DIEnumerator(name: "PROP_RAW_FLOAT", value: 4)
!56 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !57, line: 519, baseType: !7, size: 32, elements: !58)
!57 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!58 = !{!59, !60, !61, !62}
!59 = !DIEnumerator(name: "OB_RECALC_OB", value: 1, isUnsigned: true)
!60 = !DIEnumerator(name: "OB_RECALC_DATA", value: 2, isUnsigned: true)
!61 = !DIEnumerator(name: "OB_RECALC_TIME", value: 4, isUnsigned: true)
!62 = !DIEnumerator(name: "OB_RECALC_ALL", value: 7, isUnsigned: true)
!63 = !{!64, !1536, !48, !1547, !222, !364, !1557, !1564, !1576, !1585, !1592, !1611, !98, !1638, !1647, !141, !2215}
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "PropertyRNA", file: !6, line: 333, baseType: !66)
!66 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PropertyRNA", file: !67, line: 157, size: 1344, elements: !68)
!67 = !DIFile(filename: "blender/source/blender/makesrna/intern/rna_internal_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!68 = !{!69, !71, !72, !73, !77, !78, !79, !80, !81, !82, !84, !86, !463, !464, !468, !469, !1520, !1521, !1526, !1531, !1532, !1534, !1535}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !66, file: !67, line: 158, baseType: !70, size: 64)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !66, file: !67, line: 158, baseType: !70, size: 64, offset: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !66, file: !67, line: 161, baseType: !48, size: 32, offset: 128)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !66, file: !67, line: 164, baseType: !74, size: 64, offset: 192)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !76)
!76 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !66, file: !67, line: 166, baseType: !48, size: 32, offset: 256)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !66, file: !67, line: 169, baseType: !74, size: 64, offset: 320)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !66, file: !67, line: 171, baseType: !74, size: 64, offset: 384)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "icon", scope: !66, file: !67, line: 173, baseType: !48, size: 32, offset: 448)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "translation_context", scope: !66, file: !67, line: 175, baseType: !74, size: 64, offset: 512)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !66, file: !67, line: 178, baseType: !83, size: 32, offset: 576)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "PropertyType", file: !6, line: 79, baseType: !5)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !66, file: !67, line: 180, baseType: !85, size: 32, offset: 608)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "PropertySubType", file: !6, line: 147, baseType: !16)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "getlength", scope: !66, file: !67, line: 182, baseType: !87, size: 64, offset: 640)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "PropArrayLengthGetFunc", file: !67, line: 73, baseType: !88)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!89 = !DISubroutineType(types: !90)
!90 = !{!48, !91, !409}
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !6, line: 55, size: 192, elements: !93)
!93 = !{!94, !99, !462}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !92, file: !6, line: 58, baseType: !95, size: 64)
!95 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !92, file: !6, line: 56, size: 64, elements: !96)
!96 = !{!97}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !95, file: !6, line: 57, baseType: !98, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !92, file: !6, line: 60, baseType: !100, size: 64, offset: 64)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !67, line: 339, size: 1600, elements: !102)
!102 = !{!103, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !136, !142, !444, !449, !455, !461}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "cont", scope: !101, file: !67, line: 341, baseType: !104, size: 320)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "ContainerRNA", file: !67, line: 135, baseType: !105)
!105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ContainerRNA", file: !67, line: 130, size: 320, elements: !106)
!106 = !{!107, !108, !109, !112}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !105, file: !67, line: 131, baseType: !98, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !105, file: !67, line: 131, baseType: !98, size: 64, offset: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "prophash", scope: !105, file: !67, line: 133, baseType: !110, size: 64, offset: 128)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !67, line: 46, flags: DIFlagFwdDecl)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !105, file: !67, line: 134, baseType: !113, size: 128, offset: 192)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !114, line: 71, baseType: !115)
!114 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !114, line: 69, size: 128, elements: !116)
!116 = !{!117, !118}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !115, file: !114, line: 70, baseType: !98, size: 64)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !115, file: !114, line: 70, baseType: !98, size: 64, offset: 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !101, file: !67, line: 344, baseType: !74, size: 64, offset: 320)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "py_type", scope: !101, file: !67, line: 348, baseType: !98, size: 64, offset: 384)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "blender_type", scope: !101, file: !67, line: 349, baseType: !98, size: 64, offset: 448)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !101, file: !67, line: 352, baseType: !48, size: 32, offset: 512)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !101, file: !67, line: 355, baseType: !74, size: 64, offset: 576)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !101, file: !67, line: 357, baseType: !74, size: 64, offset: 640)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "translation_context", scope: !101, file: !67, line: 359, baseType: !74, size: 64, offset: 704)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "icon", scope: !101, file: !67, line: 361, baseType: !48, size: 32, offset: 768)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "nameproperty", scope: !101, file: !67, line: 364, baseType: !64, size: 64, offset: 832)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "iteratorproperty", scope: !101, file: !67, line: 367, baseType: !64, size: 64, offset: 896)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !101, file: !67, line: 370, baseType: !100, size: 64, offset: 960)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "nested", scope: !101, file: !67, line: 376, baseType: !100, size: 64, offset: 1024)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "refine", scope: !101, file: !67, line: 379, baseType: !132, size: 64, offset: 1088)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructRefineFunc", file: !67, line: 70, baseType: !133)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = !DISubroutineType(types: !135)
!135 = !{!100, !91}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !101, file: !67, line: 382, baseType: !137, size: 64, offset: 1152)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructPathFunc", file: !67, line: 71, baseType: !138)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = !DISubroutineType(types: !140)
!140 = !{!141, !91}
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !101, file: !67, line: 385, baseType: !143, size: 64, offset: 1216)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructRegisterFunc", file: !6, line: 410, baseType: !144)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = !DISubroutineType(types: !146)
!146 = !{!100, !147, !279, !98, !74, !405, !410, !440}
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!148 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Main", file: !149, line: 53, size: 15232, elements: !150)
!149 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_main.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!150 = !{!151, !152, !153, !157, !159, !160, !161, !162, !168, !172, !173, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !270, !276}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !148, file: !149, line: 54, baseType: !147, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !148, file: !149, line: 54, baseType: !147, size: 64, offset: 64)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !148, file: !149, line: 55, baseType: !154, size: 8192, offset: 128)
!154 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 8192, elements: !155)
!155 = !{!156}
!156 = !DISubrange(count: 1024)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "versionfile", scope: !148, file: !149, line: 56, baseType: !158, size: 16, offset: 8320)
!158 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "subversionfile", scope: !148, file: !149, line: 56, baseType: !158, size: 16, offset: 8336)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "minversionfile", scope: !148, file: !149, line: 57, baseType: !158, size: 16, offset: 8352)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "minsubversionfile", scope: !148, file: !149, line: 57, baseType: !158, size: 16, offset: 8368)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "build_commit_timestamp", scope: !148, file: !149, line: 58, baseType: !163, size: 64, offset: 8384)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !164, line: 27, baseType: !165)
!164 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !166, line: 45, baseType: !167)
!166 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!167 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "build_hash", scope: !148, file: !149, line: 59, baseType: !169, size: 128, offset: 8448)
!169 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 128, elements: !170)
!170 = !{!171}
!171 = !DISubrange(count: 16)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "recovered", scope: !148, file: !149, line: 60, baseType: !158, size: 16, offset: 8576)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "curlib", scope: !148, file: !149, line: 62, baseType: !174, size: 64, offset: 8640)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !176, line: 136, size: 17600, elements: !177)
!176 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!177 = !{!178, !221, !223, !226, !227, !228, !229}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !175, file: !176, line: 137, baseType: !179, size: 960)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !176, line: 130, baseType: !180)
!180 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !176, line: 117, size: 960, elements: !181)
!181 = !{!182, !183, !184, !186, !187, !191, !192, !193, !194, !195}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !180, file: !176, line: 118, baseType: !98, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !180, file: !176, line: 118, baseType: !98, size: 64, offset: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !180, file: !176, line: 119, baseType: !185, size: 64, offset: 128)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !180, file: !176, line: 120, baseType: !174, size: 64, offset: 192)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !180, file: !176, line: 121, baseType: !188, size: 528, offset: 256)
!188 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 528, elements: !189)
!189 = !{!190}
!190 = !DISubrange(count: 66)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !180, file: !176, line: 126, baseType: !158, size: 16, offset: 784)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !180, file: !176, line: 127, baseType: !48, size: 32, offset: 800)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !180, file: !176, line: 128, baseType: !48, size: 32, offset: 832)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !180, file: !176, line: 128, baseType: !48, size: 32, offset: 864)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !180, file: !176, line: 129, baseType: !196, size: 64, offset: 896)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !176, line: 75, baseType: !198)
!198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !176, line: 62, size: 1024, elements: !199)
!199 = !{!200, !202, !203, !204, !205, !206, !210, !211, !219, !220}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !198, file: !176, line: 63, baseType: !201, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !198, file: !176, line: 63, baseType: !201, size: 64, offset: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !198, file: !176, line: 64, baseType: !76, size: 8, offset: 128)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !198, file: !176, line: 64, baseType: !76, size: 8, offset: 136)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !198, file: !176, line: 65, baseType: !158, size: 16, offset: 144)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !198, file: !176, line: 66, baseType: !207, size: 512, offset: 160)
!207 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 512, elements: !208)
!208 = !{!209}
!209 = !DISubrange(count: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !198, file: !176, line: 67, baseType: !48, size: 32, offset: 672)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !198, file: !176, line: 69, baseType: !212, size: 256, offset: 704)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !176, line: 60, baseType: !213)
!213 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !176, line: 48, size: 256, elements: !214)
!214 = !{!215, !216, !217, !218}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !213, file: !176, line: 49, baseType: !98, size: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !213, file: !176, line: 58, baseType: !113, size: 128, offset: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !213, file: !176, line: 59, baseType: !48, size: 32, offset: 192)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !213, file: !176, line: 59, baseType: !48, size: 32, offset: 224)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !198, file: !176, line: 70, baseType: !48, size: 32, offset: 960)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !198, file: !176, line: 74, baseType: !48, size: 32, offset: 992)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !175, file: !176, line: 138, baseType: !222, size: 64, offset: 960)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !175, file: !176, line: 139, baseType: !224, size: 64, offset: 1024)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!225 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !176, line: 43, flags: DIFlagFwdDecl)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !175, file: !176, line: 140, baseType: !154, size: 8192, offset: 1088)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !175, file: !176, line: 141, baseType: !154, size: 8192, offset: 9280)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !175, file: !176, line: 148, baseType: !174, size: 64, offset: 17472)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !175, file: !176, line: 150, baseType: !230, size: 64, offset: 17536)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!231 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !176, line: 45, flags: DIFlagFwdDecl)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !148, file: !149, line: 63, baseType: !113, size: 128, offset: 8704)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "library", scope: !148, file: !149, line: 64, baseType: !113, size: 128, offset: 8832)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !148, file: !149, line: 65, baseType: !113, size: 128, offset: 8960)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "mesh", scope: !148, file: !149, line: 66, baseType: !113, size: 128, offset: 9088)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "curve", scope: !148, file: !149, line: 67, baseType: !113, size: 128, offset: 9216)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "mball", scope: !148, file: !149, line: 68, baseType: !113, size: 128, offset: 9344)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !148, file: !149, line: 69, baseType: !113, size: 128, offset: 9472)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "tex", scope: !148, file: !149, line: 70, baseType: !113, size: 128, offset: 9600)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "image", scope: !148, file: !149, line: 71, baseType: !113, size: 128, offset: 9728)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "latt", scope: !148, file: !149, line: 72, baseType: !113, size: 128, offset: 9856)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "lamp", scope: !148, file: !149, line: 73, baseType: !113, size: 128, offset: 9984)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !148, file: !149, line: 74, baseType: !113, size: 128, offset: 10112)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !148, file: !149, line: 75, baseType: !113, size: 128, offset: 10240)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !148, file: !149, line: 76, baseType: !113, size: 128, offset: 10368)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !148, file: !149, line: 77, baseType: !113, size: 128, offset: 10496)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !148, file: !149, line: 78, baseType: !113, size: 128, offset: 10624)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "script", scope: !148, file: !149, line: 79, baseType: !113, size: 128, offset: 10752)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "vfont", scope: !148, file: !149, line: 80, baseType: !113, size: 128, offset: 10880)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !148, file: !149, line: 81, baseType: !113, size: 128, offset: 11008)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "speaker", scope: !148, file: !149, line: 82, baseType: !113, size: 128, offset: 11136)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "sound", scope: !148, file: !149, line: 83, baseType: !113, size: 128, offset: 11264)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !148, file: !149, line: 84, baseType: !113, size: 128, offset: 11392)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "armature", scope: !148, file: !149, line: 85, baseType: !113, size: 128, offset: 11520)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !148, file: !149, line: 86, baseType: !113, size: 128, offset: 11648)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !148, file: !149, line: 87, baseType: !113, size: 128, offset: 11776)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !148, file: !149, line: 88, baseType: !113, size: 128, offset: 11904)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "particle", scope: !148, file: !149, line: 89, baseType: !113, size: 128, offset: 12032)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "palettes", scope: !148, file: !149, line: 90, baseType: !113, size: 128, offset: 12160)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "paintcurves", scope: !148, file: !149, line: 91, baseType: !113, size: 128, offset: 12288)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "wm", scope: !148, file: !149, line: 92, baseType: !113, size: 128, offset: 12416)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "gpencil", scope: !148, file: !149, line: 93, baseType: !113, size: 128, offset: 12544)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "movieclip", scope: !148, file: !149, line: 94, baseType: !113, size: 128, offset: 12672)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !148, file: !149, line: 95, baseType: !113, size: 128, offset: 12800)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "linestyle", scope: !148, file: !149, line: 96, baseType: !113, size: 128, offset: 12928)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "id_tag_update", scope: !148, file: !149, line: 98, baseType: !267, size: 2048, offset: 13056)
!267 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 2048, elements: !268)
!268 = !{!269}
!269 = !DISubrange(count: 256)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "eval_ctx", scope: !148, file: !149, line: 101, baseType: !271, size: 64, offset: 15104)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!272 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EvaluationContext", file: !273, line: 58, size: 32, elements: !274)
!273 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_depsgraph.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!274 = !{!275}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !272, file: !273, line: 59, baseType: !48, size: 32)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !148, file: !149, line: 103, baseType: !277, size: 64, offset: 15168)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!278 = !DICompositeType(tag: DW_TAG_structure_type, name: "MainLock", file: !149, line: 51, flags: DIFlagFwdDecl)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64)
!280 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ReportList", file: !281, line: 106, size: 320, elements: !282)
!281 = !DIFile(filename: "blender/source/blender/makesdna/DNA_windowmanager_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!282 = !{!283, !284, !285, !286, !287, !288}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !280, file: !281, line: 107, baseType: !113, size: 128)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "printlevel", scope: !280, file: !281, line: 108, baseType: !48, size: 32, offset: 128)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "storelevel", scope: !280, file: !281, line: 109, baseType: !48, size: 32, offset: 160)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !280, file: !281, line: 110, baseType: !48, size: 32, offset: 192)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !280, file: !281, line: 110, baseType: !48, size: 32, offset: 224)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "reporttimer", scope: !280, file: !281, line: 111, baseType: !289, size: 64, offset: 256)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64)
!290 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTimer", file: !291, line: 490, size: 768, elements: !292)
!291 = !DIFile(filename: "blender/source/blender/windowmanager/WM_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!292 = !{!293, !294, !295, !396, !397, !398, !399, !400, !401, !402, !403, !404}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !290, file: !291, line: 491, baseType: !289, size: 64)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !290, file: !291, line: 491, baseType: !289, size: 64, offset: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "win", scope: !290, file: !291, line: 493, baseType: !296, size: 64, offset: 128)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64)
!297 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindow", file: !281, line: 169, size: 2048, elements: !298)
!298 = !{!299, !300, !301, !302, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !371, !374, !388, !389, !390, !391, !392, !393, !394, !395}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !297, file: !281, line: 170, baseType: !296, size: 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !297, file: !281, line: 170, baseType: !296, size: 64, offset: 64)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "ghostwin", scope: !297, file: !281, line: 172, baseType: !98, size: 64, offset: 128)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !297, file: !281, line: 174, baseType: !303, size: 64, offset: 192)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64)
!304 = !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !305, line: 41, flags: DIFlagFwdDecl)
!305 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_context.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!306 = !DIDerivedType(tag: DW_TAG_member, name: "newscreen", scope: !297, file: !281, line: 175, baseType: !303, size: 64, offset: 256)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "screenname", scope: !297, file: !281, line: 176, baseType: !207, size: 512, offset: 320)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "posx", scope: !297, file: !281, line: 178, baseType: !158, size: 16, offset: 832)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "posy", scope: !297, file: !281, line: 178, baseType: !158, size: 16, offset: 848)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "sizex", scope: !297, file: !281, line: 178, baseType: !158, size: 16, offset: 864)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "sizey", scope: !297, file: !281, line: 178, baseType: !158, size: 16, offset: 880)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "windowstate", scope: !297, file: !281, line: 179, baseType: !158, size: 16, offset: 896)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !297, file: !281, line: 180, baseType: !158, size: 16, offset: 912)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !297, file: !281, line: 181, baseType: !158, size: 16, offset: 928)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !297, file: !281, line: 182, baseType: !158, size: 16, offset: 944)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "lastcursor", scope: !297, file: !281, line: 183, baseType: !158, size: 16, offset: 960)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "modalcursor", scope: !297, file: !281, line: 184, baseType: !158, size: 16, offset: 976)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "grabcursor", scope: !297, file: !281, line: 185, baseType: !158, size: 16, offset: 992)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "addmousemove", scope: !297, file: !281, line: 186, baseType: !158, size: 16, offset: 1008)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "winid", scope: !297, file: !281, line: 188, baseType: !48, size: 32, offset: 1024)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "lock_pie_event", scope: !297, file: !281, line: 190, baseType: !158, size: 16, offset: 1056)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "last_pie_event", scope: !297, file: !281, line: 191, baseType: !158, size: 16, offset: 1072)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "eventstate", scope: !297, file: !281, line: 194, baseType: !324, size: 64, offset: 1088)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64)
!325 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmEvent", file: !291, line: 421, size: 960, elements: !326)
!326 = !{!327, !328, !329, !330, !331, !332, !333, !337, !341, !342, !343, !344, !345, !346, !347, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !367, !368, !369, !370}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !325, file: !291, line: 422, baseType: !324, size: 64)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !325, file: !291, line: 422, baseType: !324, size: 64, offset: 64)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !325, file: !291, line: 424, baseType: !158, size: 16, offset: 128)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !325, file: !291, line: 425, baseType: !158, size: 16, offset: 144)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !325, file: !291, line: 426, baseType: !48, size: 32, offset: 160)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !325, file: !291, line: 426, baseType: !48, size: 32, offset: 192)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "mval", scope: !325, file: !291, line: 427, baseType: !334, size: 64, offset: 224)
!334 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 64, elements: !335)
!335 = !{!336}
!336 = !DISubrange(count: 2)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "utf8_buf", scope: !325, file: !291, line: 428, baseType: !338, size: 48, offset: 288)
!338 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 48, elements: !339)
!339 = !{!340}
!340 = !DISubrange(count: 6)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "ascii", scope: !325, file: !291, line: 431, baseType: !76, size: 8, offset: 336)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !325, file: !291, line: 432, baseType: !76, size: 8, offset: 344)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "prevtype", scope: !325, file: !291, line: 435, baseType: !158, size: 16, offset: 352)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "prevval", scope: !325, file: !291, line: 436, baseType: !158, size: 16, offset: 368)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "prevx", scope: !325, file: !291, line: 437, baseType: !48, size: 32, offset: 384)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "prevy", scope: !325, file: !291, line: 437, baseType: !48, size: 32, offset: 416)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "prevclicktime", scope: !325, file: !291, line: 438, baseType: !348, size: 64, offset: 448)
!348 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "prevclickx", scope: !325, file: !291, line: 439, baseType: !48, size: 32, offset: 512)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "prevclicky", scope: !325, file: !291, line: 439, baseType: !48, size: 32, offset: 544)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !325, file: !291, line: 442, baseType: !158, size: 16, offset: 576)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "ctrl", scope: !325, file: !291, line: 442, baseType: !158, size: 16, offset: 592)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "alt", scope: !325, file: !291, line: 442, baseType: !158, size: 16, offset: 608)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "oskey", scope: !325, file: !291, line: 442, baseType: !158, size: 16, offset: 624)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "keymodifier", scope: !325, file: !291, line: 443, baseType: !158, size: 16, offset: 640)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "check_click", scope: !325, file: !291, line: 446, baseType: !158, size: 16, offset: 656)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "keymap_idname", scope: !325, file: !291, line: 449, baseType: !74, size: 64, offset: 704)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "tablet_data", scope: !325, file: !291, line: 452, baseType: !359, size: 64, offset: 768)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!360 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTabletData", file: !291, line: 463, size: 128, elements: !361)
!361 = !{!362, !363, !365, !366}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "Active", scope: !360, file: !291, line: 464, baseType: !48, size: 32)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "Pressure", scope: !360, file: !291, line: 465, baseType: !364, size: 32, offset: 32)
!364 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "Xtilt", scope: !360, file: !291, line: 466, baseType: !364, size: 32, offset: 64)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "Ytilt", scope: !360, file: !291, line: 467, baseType: !364, size: 32, offset: 96)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "custom", scope: !325, file: !291, line: 455, baseType: !158, size: 16, offset: 832)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "customdatafree", scope: !325, file: !291, line: 456, baseType: !158, size: 16, offset: 848)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !325, file: !291, line: 457, baseType: !48, size: 32, offset: 864)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !325, file: !291, line: 458, baseType: !98, size: 64, offset: 896)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "curswin", scope: !297, file: !281, line: 196, baseType: !372, size: 64, offset: 1152)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!373 = !DICompositeType(tag: DW_TAG_structure_type, name: "wmSubWindow", file: !281, line: 55, flags: DIFlagFwdDecl)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "tweak", scope: !297, file: !281, line: 198, baseType: !375, size: 64, offset: 1216)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64)
!376 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmGesture", file: !291, line: 398, size: 448, elements: !377)
!377 = !{!378, !379, !380, !381, !382, !383, !384, !385, !386, !387}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !376, file: !291, line: 399, baseType: !375, size: 64)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !376, file: !291, line: 399, baseType: !375, size: 64, offset: 64)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "event_type", scope: !376, file: !291, line: 400, baseType: !48, size: 32, offset: 128)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !376, file: !291, line: 401, baseType: !48, size: 32, offset: 160)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !376, file: !291, line: 402, baseType: !48, size: 32, offset: 192)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "swinid", scope: !376, file: !291, line: 403, baseType: !48, size: 32, offset: 224)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !376, file: !291, line: 404, baseType: !48, size: 32, offset: 256)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !376, file: !291, line: 405, baseType: !48, size: 32, offset: 288)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !376, file: !291, line: 407, baseType: !98, size: 64, offset: 320)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "userdata", scope: !376, file: !291, line: 414, baseType: !98, size: 64, offset: 384)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "drawmethod", scope: !297, file: !281, line: 200, baseType: !48, size: 32, offset: 1280)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "drawfail", scope: !297, file: !281, line: 200, baseType: !48, size: 32, offset: 1312)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "drawdata", scope: !297, file: !281, line: 201, baseType: !98, size: 64, offset: 1344)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !297, file: !281, line: 203, baseType: !113, size: 128, offset: 1408)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "handlers", scope: !297, file: !281, line: 204, baseType: !113, size: 128, offset: 1536)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "modalhandlers", scope: !297, file: !281, line: 205, baseType: !113, size: 128, offset: 1664)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "subwindows", scope: !297, file: !281, line: 207, baseType: !113, size: 128, offset: 1792)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "gesture", scope: !297, file: !281, line: 208, baseType: !113, size: 128, offset: 1920)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "timestep", scope: !290, file: !291, line: 495, baseType: !348, size: 64, offset: 192)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "event_type", scope: !290, file: !291, line: 496, baseType: !48, size: 32, offset: 256)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !290, file: !291, line: 497, baseType: !98, size: 64, offset: 320)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !290, file: !291, line: 499, baseType: !348, size: 64, offset: 384)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !290, file: !291, line: 500, baseType: !348, size: 64, offset: 448)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "ltime", scope: !290, file: !291, line: 502, baseType: !348, size: 64, offset: 512)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "ntime", scope: !290, file: !291, line: 503, baseType: !348, size: 64, offset: 576)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "stime", scope: !290, file: !291, line: 504, baseType: !348, size: 64, offset: 640)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "sleep", scope: !290, file: !291, line: 505, baseType: !48, size: 32, offset: 704)
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructValidateFunc", file: !6, line: 407, baseType: !406)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!407 = !DISubroutineType(types: !408)
!408 = !{!48, !91, !98, !409}
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructCallbackFunc", file: !6, line: 408, baseType: !411)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!412 = !DISubroutineType(types: !413)
!413 = !{!48, !414, !91, !416, !430}
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!415 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !6, line: 44, flags: DIFlagFwdDecl)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!417 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FunctionRNA", file: !67, line: 137, size: 640, elements: !418)
!418 = !{!419, !420, !421, !422, !423, !439}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "cont", scope: !417, file: !67, line: 139, baseType: !104, size: 320)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !417, file: !67, line: 142, baseType: !74, size: 64, offset: 320)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !417, file: !67, line: 144, baseType: !48, size: 32, offset: 384)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !417, file: !67, line: 147, baseType: !74, size: 64, offset: 448)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !417, file: !67, line: 150, baseType: !424, size: 64, offset: 512)
!424 = !DIDerivedType(tag: DW_TAG_typedef, name: "CallFunc", file: !6, line: 388, baseType: !425)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!426 = !DISubroutineType(types: !427)
!427 = !{null, !414, !279, !428, !430}
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "PointerRNA", file: !6, line: 62, baseType: !92)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "ParameterList", file: !6, line: 348, baseType: !432)
!432 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParameterList", file: !6, line: 337, size: 256, elements: !433)
!433 = !{!434, !435, !436, !437, !438}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !432, file: !6, line: 339, baseType: !98, size: 64)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !432, file: !6, line: 342, baseType: !416, size: 64, offset: 64)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_size", scope: !432, file: !6, line: 345, baseType: !48, size: 32, offset: 128)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !432, file: !6, line: 347, baseType: !48, size: 32, offset: 160)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "ret_count", scope: !432, file: !6, line: 347, baseType: !48, size: 32, offset: 192)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "c_ret", scope: !417, file: !67, line: 154, baseType: !64, size: 64, offset: 576)
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructFreeFunc", file: !6, line: 409, baseType: !441)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64)
!442 = !DISubroutineType(types: !443)
!443 = !{null, !98}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "unreg", scope: !101, file: !67, line: 386, baseType: !445, size: 64, offset: 1280)
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructUnregisterFunc", file: !6, line: 414, baseType: !446)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!447 = !DISubroutineType(types: !448)
!448 = !{null, !147, !100}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "instance", scope: !101, file: !67, line: 387, baseType: !450, size: 64, offset: 1344)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructInstanceFunc", file: !6, line: 415, baseType: !451)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!452 = !DISubroutineType(types: !453)
!453 = !{!454, !428}
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "idproperties", scope: !101, file: !67, line: 390, baseType: !456, size: 64, offset: 1408)
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertiesFunc", file: !67, line: 69, baseType: !457)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = !DISubroutineType(types: !459)
!459 = !{!201, !91, !460}
!460 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "functions", scope: !101, file: !67, line: 393, baseType: !113, size: 128, offset: 1472)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !92, file: !6, line: 61, baseType: !98, size: 64, offset: 128)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "arraydimension", scope: !66, file: !67, line: 184, baseType: !7, size: 32, offset: 704)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "arraylength", scope: !66, file: !67, line: 186, baseType: !465, size: 96, offset: 736)
!465 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 96, elements: !466)
!466 = !{!467}
!467 = !DISubrange(count: 3)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "totarraylength", scope: !66, file: !67, line: 187, baseType: !7, size: 32, offset: 832)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !66, file: !67, line: 190, baseType: !470, size: 64, offset: 896)
!470 = !DIDerivedType(tag: DW_TAG_typedef, name: "UpdateFunc", file: !67, line: 64, baseType: !471)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64)
!472 = !DISubroutineType(types: !473)
!473 = !{null, !147, !474, !91}
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64)
!475 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !476, line: 1216, size: 39680, elements: !477)
!476 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!477 = !{!478, !479, !482, !762, !765, !766, !767, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !793, !796, !799, !1094, !1097, !1393, !1405, !1406, !1407, !1408, !1409, !1410, !1411, !1412, !1415, !1416, !1417, !1418, !1419, !1427, !1494, !1501, !1502, !1509, !1512, !1513, !1514, !1515, !1516, !1517}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !475, file: !476, line: 1217, baseType: !179, size: 960)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !475, file: !476, line: 1218, baseType: !480, size: 64, offset: 960)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64)
!481 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !476, line: 58, flags: DIFlagFwdDecl)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !475, file: !476, line: 1220, baseType: !483, size: 64, offset: 1024)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64)
!484 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !57, line: 115, size: 11392, elements: !485)
!485 = !{!486, !487, !488, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !506, !516, !530, !531, !571, !572, !575, !576, !592, !593, !594, !595, !596, !597, !598, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !617, !618, !619, !620, !621, !622, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !682, !683, !684, !685, !686, !687, !688, !689, !690, !693, !696, !700, !701, !702, !703, !704, !707, !710, !713, !714, !715, !716, !717, !718, !719, !720, !722, !725, !728, !730, !750, !751}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !484, file: !57, line: 116, baseType: !179, size: 960)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !484, file: !57, line: 117, baseType: !480, size: 64, offset: 960)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !484, file: !57, line: 119, baseType: !489, size: 64, offset: 1024)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64)
!490 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !57, line: 57, flags: DIFlagFwdDecl)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !484, file: !57, line: 121, baseType: !158, size: 16, offset: 1088)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !484, file: !57, line: 121, baseType: !158, size: 16, offset: 1104)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !484, file: !57, line: 122, baseType: !48, size: 32, offset: 1120)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !484, file: !57, line: 122, baseType: !48, size: 32, offset: 1152)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !484, file: !57, line: 122, baseType: !48, size: 32, offset: 1184)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !484, file: !57, line: 123, baseType: !207, size: 512, offset: 1216)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !484, file: !57, line: 124, baseType: !483, size: 64, offset: 1728)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !484, file: !57, line: 124, baseType: !483, size: 64, offset: 1792)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !484, file: !57, line: 127, baseType: !483, size: 64, offset: 1856)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !484, file: !57, line: 127, baseType: !483, size: 64, offset: 1920)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !484, file: !57, line: 127, baseType: !483, size: 64, offset: 1984)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !484, file: !57, line: 128, baseType: !503, size: 64, offset: 2048)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64)
!504 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !505, line: 46, flags: DIFlagFwdDecl)
!505 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!506 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !484, file: !57, line: 130, baseType: !507, size: 64, offset: 2112)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64)
!508 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !57, line: 97, size: 832, elements: !509)
!509 = !{!510, !514, !515}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !508, file: !57, line: 98, baseType: !511, size: 768)
!511 = !DICompositeType(tag: DW_TAG_array_type, baseType: !364, size: 768, elements: !512)
!512 = !{!513, !467}
!513 = !DISubrange(count: 8)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !508, file: !57, line: 99, baseType: !48, size: 32, offset: 768)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !508, file: !57, line: 99, baseType: !48, size: 32, offset: 800)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !484, file: !57, line: 131, baseType: !517, size: 64, offset: 2176)
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64)
!518 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !519, line: 486, size: 1600, elements: !520)
!519 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!520 = !{!521, !522, !523, !524, !525, !526, !527, !528, !529}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !518, file: !519, line: 487, baseType: !179, size: 960)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !518, file: !519, line: 489, baseType: !113, size: 128, offset: 960)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !518, file: !519, line: 490, baseType: !113, size: 128, offset: 1088)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !518, file: !519, line: 491, baseType: !113, size: 128, offset: 1216)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !518, file: !519, line: 492, baseType: !113, size: 128, offset: 1344)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !518, file: !519, line: 494, baseType: !48, size: 32, offset: 1472)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !518, file: !519, line: 495, baseType: !48, size: 32, offset: 1504)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !518, file: !519, line: 497, baseType: !48, size: 32, offset: 1536)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !518, file: !519, line: 498, baseType: !48, size: 32, offset: 1568)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !484, file: !57, line: 132, baseType: !517, size: 64, offset: 2240)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !484, file: !57, line: 133, baseType: !532, size: 64, offset: 2304)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64)
!533 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !519, line: 334, size: 1728, elements: !534)
!534 = !{!535, !536, !537, !538, !539, !540, !541, !542, !544, !545, !546, !547, !548, !549, !550, !570}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !533, file: !519, line: 335, baseType: !113, size: 128)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !533, file: !519, line: 336, baseType: !110, size: 64, offset: 128)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !533, file: !519, line: 338, baseType: !158, size: 16, offset: 192)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !533, file: !519, line: 338, baseType: !158, size: 16, offset: 208)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !533, file: !519, line: 339, baseType: !7, size: 32, offset: 224)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !533, file: !519, line: 340, baseType: !48, size: 32, offset: 256)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !533, file: !519, line: 342, baseType: !364, size: 32, offset: 288)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !533, file: !519, line: 343, baseType: !543, size: 96, offset: 320)
!543 = !DICompositeType(tag: DW_TAG_array_type, baseType: !364, size: 96, elements: !466)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !533, file: !519, line: 344, baseType: !543, size: 96, offset: 416)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !533, file: !519, line: 347, baseType: !113, size: 128, offset: 512)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !533, file: !519, line: 349, baseType: !48, size: 32, offset: 640)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !533, file: !519, line: 350, baseType: !48, size: 32, offset: 672)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !533, file: !519, line: 351, baseType: !98, size: 64, offset: 704)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !533, file: !519, line: 352, baseType: !98, size: 64, offset: 768)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !533, file: !519, line: 354, baseType: !551, size: 384, offset: 832)
!551 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !519, line: 116, baseType: !552)
!552 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !519, line: 94, size: 384, elements: !553)
!553 = !{!554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569}
!554 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !552, file: !519, line: 96, baseType: !48, size: 32)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !552, file: !519, line: 96, baseType: !48, size: 32, offset: 32)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !552, file: !519, line: 97, baseType: !48, size: 32, offset: 64)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !552, file: !519, line: 97, baseType: !48, size: 32, offset: 96)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !552, file: !519, line: 99, baseType: !158, size: 16, offset: 128)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !552, file: !519, line: 100, baseType: !158, size: 16, offset: 144)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !552, file: !519, line: 102, baseType: !158, size: 16, offset: 160)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !552, file: !519, line: 105, baseType: !158, size: 16, offset: 176)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !552, file: !519, line: 108, baseType: !158, size: 16, offset: 192)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !552, file: !519, line: 109, baseType: !158, size: 16, offset: 208)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !552, file: !519, line: 111, baseType: !158, size: 16, offset: 224)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !552, file: !519, line: 112, baseType: !158, size: 16, offset: 240)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !552, file: !519, line: 114, baseType: !48, size: 32, offset: 256)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !552, file: !519, line: 114, baseType: !48, size: 32, offset: 288)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !552, file: !519, line: 115, baseType: !48, size: 32, offset: 320)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !552, file: !519, line: 115, baseType: !48, size: 32, offset: 352)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !533, file: !519, line: 355, baseType: !207, size: 512, offset: 1216)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !484, file: !57, line: 134, baseType: !98, size: 64, offset: 2368)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !484, file: !57, line: 136, baseType: !573, size: 64, offset: 2432)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64)
!574 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !476, line: 61, flags: DIFlagFwdDecl)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !484, file: !57, line: 138, baseType: !551, size: 384, offset: 2496)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !484, file: !57, line: 139, baseType: !577, size: 64, offset: 2880)
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 64)
!578 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !519, line: 80, baseType: !579)
!579 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !519, line: 72, size: 192, elements: !580)
!580 = !{!581, !588, !589, !590, !591}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !579, file: !519, line: 73, baseType: !582, size: 64)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!583 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !519, line: 59, baseType: !584)
!584 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !519, line: 56, size: 128, elements: !585)
!585 = !{!586, !587}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !584, file: !519, line: 57, baseType: !543, size: 96)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !584, file: !519, line: 58, baseType: !48, size: 32, offset: 96)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !579, file: !519, line: 74, baseType: !48, size: 32, offset: 64)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !579, file: !519, line: 76, baseType: !48, size: 32, offset: 96)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !579, file: !519, line: 77, baseType: !48, size: 32, offset: 128)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !579, file: !519, line: 79, baseType: !48, size: 32, offset: 160)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !484, file: !57, line: 141, baseType: !113, size: 128, offset: 2944)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !484, file: !57, line: 142, baseType: !113, size: 128, offset: 3072)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !484, file: !57, line: 143, baseType: !113, size: 128, offset: 3200)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !484, file: !57, line: 144, baseType: !113, size: 128, offset: 3328)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !484, file: !57, line: 146, baseType: !48, size: 32, offset: 3456)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !484, file: !57, line: 147, baseType: !48, size: 32, offset: 3488)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !484, file: !57, line: 150, baseType: !599, size: 64, offset: 3520)
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64)
!601 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !476, line: 179, flags: DIFlagFwdDecl)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !484, file: !57, line: 151, baseType: !141, size: 64, offset: 3584)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !484, file: !57, line: 152, baseType: !48, size: 32, offset: 3648)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !484, file: !57, line: 153, baseType: !48, size: 32, offset: 3680)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !484, file: !57, line: 156, baseType: !543, size: 96, offset: 3712)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !484, file: !57, line: 156, baseType: !543, size: 96, offset: 3808)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !484, file: !57, line: 156, baseType: !543, size: 96, offset: 3904)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !484, file: !57, line: 157, baseType: !543, size: 96, offset: 4000)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !484, file: !57, line: 158, baseType: !543, size: 96, offset: 4096)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !484, file: !57, line: 159, baseType: !543, size: 96, offset: 4192)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !484, file: !57, line: 160, baseType: !543, size: 96, offset: 4288)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !484, file: !57, line: 160, baseType: !543, size: 96, offset: 4384)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !484, file: !57, line: 161, baseType: !614, size: 128, offset: 4480)
!614 = !DICompositeType(tag: DW_TAG_array_type, baseType: !364, size: 128, elements: !615)
!615 = !{!616}
!616 = !DISubrange(count: 4)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !484, file: !57, line: 161, baseType: !614, size: 128, offset: 4608)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !484, file: !57, line: 162, baseType: !543, size: 96, offset: 4736)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !484, file: !57, line: 162, baseType: !543, size: 96, offset: 4832)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !484, file: !57, line: 163, baseType: !364, size: 32, offset: 4928)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !484, file: !57, line: 163, baseType: !364, size: 32, offset: 4960)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !484, file: !57, line: 164, baseType: !623, size: 512, offset: 4992)
!623 = !DICompositeType(tag: DW_TAG_array_type, baseType: !364, size: 512, elements: !624)
!624 = !{!616, !616}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !484, file: !57, line: 165, baseType: !623, size: 512, offset: 5504)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !484, file: !57, line: 166, baseType: !623, size: 512, offset: 6016)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !484, file: !57, line: 167, baseType: !623, size: 512, offset: 6528)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !484, file: !57, line: 176, baseType: !623, size: 512, offset: 7040)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !484, file: !57, line: 178, baseType: !7, size: 32, offset: 7552)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !484, file: !57, line: 180, baseType: !158, size: 16, offset: 7584)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !484, file: !57, line: 181, baseType: !158, size: 16, offset: 7600)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !484, file: !57, line: 183, baseType: !158, size: 16, offset: 7616)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !484, file: !57, line: 183, baseType: !158, size: 16, offset: 7632)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !484, file: !57, line: 184, baseType: !158, size: 16, offset: 7648)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !484, file: !57, line: 184, baseType: !158, size: 16, offset: 7664)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !484, file: !57, line: 185, baseType: !158, size: 16, offset: 7680)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !484, file: !57, line: 186, baseType: !158, size: 16, offset: 7696)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !484, file: !57, line: 187, baseType: !158, size: 16, offset: 7712)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !484, file: !57, line: 188, baseType: !76, size: 8, offset: 7728)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !484, file: !57, line: 189, baseType: !76, size: 8, offset: 7736)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !484, file: !57, line: 192, baseType: !48, size: 32, offset: 7744)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !484, file: !57, line: 192, baseType: !48, size: 32, offset: 7776)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !484, file: !57, line: 192, baseType: !48, size: 32, offset: 7808)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !484, file: !57, line: 192, baseType: !48, size: 32, offset: 7840)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !484, file: !57, line: 194, baseType: !48, size: 32, offset: 7872)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !484, file: !57, line: 202, baseType: !364, size: 32, offset: 7904)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !484, file: !57, line: 202, baseType: !364, size: 32, offset: 7936)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !484, file: !57, line: 202, baseType: !364, size: 32, offset: 7968)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !484, file: !57, line: 211, baseType: !364, size: 32, offset: 8000)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !484, file: !57, line: 212, baseType: !364, size: 32, offset: 8032)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !484, file: !57, line: 213, baseType: !364, size: 32, offset: 8064)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !484, file: !57, line: 214, baseType: !364, size: 32, offset: 8096)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !484, file: !57, line: 215, baseType: !364, size: 32, offset: 8128)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !484, file: !57, line: 216, baseType: !364, size: 32, offset: 8160)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !484, file: !57, line: 219, baseType: !364, size: 32, offset: 8192)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !484, file: !57, line: 220, baseType: !364, size: 32, offset: 8224)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !484, file: !57, line: 221, baseType: !364, size: 32, offset: 8256)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !484, file: !57, line: 224, baseType: !659, size: 16, offset: 8288)
!659 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !484, file: !57, line: 224, baseType: !659, size: 16, offset: 8304)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !484, file: !57, line: 226, baseType: !158, size: 16, offset: 8320)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !484, file: !57, line: 228, baseType: !76, size: 8, offset: 8336)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !484, file: !57, line: 229, baseType: !76, size: 8, offset: 8344)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !484, file: !57, line: 231, baseType: !158, size: 16, offset: 8352)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !484, file: !57, line: 232, baseType: !76, size: 8, offset: 8368)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !484, file: !57, line: 233, baseType: !76, size: 8, offset: 8376)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !484, file: !57, line: 234, baseType: !364, size: 32, offset: 8384)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !484, file: !57, line: 235, baseType: !364, size: 32, offset: 8416)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !484, file: !57, line: 237, baseType: !113, size: 128, offset: 8448)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !484, file: !57, line: 238, baseType: !113, size: 128, offset: 8576)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !484, file: !57, line: 239, baseType: !113, size: 128, offset: 8704)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !484, file: !57, line: 240, baseType: !113, size: 128, offset: 8832)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !484, file: !57, line: 242, baseType: !364, size: 32, offset: 8960)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !484, file: !57, line: 244, baseType: !158, size: 16, offset: 8992)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !484, file: !57, line: 245, baseType: !659, size: 16, offset: 9008)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !484, file: !57, line: 246, baseType: !614, size: 128, offset: 9024)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !484, file: !57, line: 248, baseType: !48, size: 32, offset: 9152)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !484, file: !57, line: 249, baseType: !48, size: 32, offset: 9184)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !484, file: !57, line: 251, baseType: !680, size: 64, offset: 9216)
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !681, size: 64)
!681 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !57, line: 251, flags: DIFlagFwdDecl)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !484, file: !57, line: 253, baseType: !76, size: 8, offset: 9280)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !484, file: !57, line: 254, baseType: !76, size: 8, offset: 9288)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !484, file: !57, line: 255, baseType: !158, size: 16, offset: 9296)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !484, file: !57, line: 256, baseType: !543, size: 96, offset: 9312)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !484, file: !57, line: 258, baseType: !113, size: 128, offset: 9408)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !484, file: !57, line: 259, baseType: !113, size: 128, offset: 9536)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !484, file: !57, line: 260, baseType: !113, size: 128, offset: 9664)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !484, file: !57, line: 261, baseType: !113, size: 128, offset: 9792)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !484, file: !57, line: 263, baseType: !691, size: 64, offset: 9920)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 64)
!692 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !57, line: 52, flags: DIFlagFwdDecl)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !484, file: !57, line: 264, baseType: !694, size: 64, offset: 9984)
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 64)
!695 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !57, line: 53, flags: DIFlagFwdDecl)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !484, file: !57, line: 265, baseType: !697, size: 64, offset: 10048)
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 64)
!698 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !699, line: 43, flags: DIFlagFwdDecl)
!699 = !DIFile(filename: "blender/source/blender/makesdna/DNA_freestyle_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!700 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !484, file: !57, line: 267, baseType: !76, size: 8, offset: 10112)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !484, file: !57, line: 268, baseType: !76, size: 8, offset: 10120)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !484, file: !57, line: 269, baseType: !158, size: 16, offset: 10128)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !484, file: !57, line: 270, baseType: !364, size: 32, offset: 10144)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !484, file: !57, line: 272, baseType: !705, size: 64, offset: 10176)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 64)
!706 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !57, line: 54, flags: DIFlagFwdDecl)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !484, file: !57, line: 275, baseType: !708, size: 64, offset: 10240)
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 64)
!709 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !57, line: 275, flags: DIFlagFwdDecl)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !484, file: !57, line: 277, baseType: !711, size: 64, offset: 10304)
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 64)
!712 = !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !57, line: 56, flags: DIFlagFwdDecl)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !484, file: !57, line: 277, baseType: !711, size: 64, offset: 10368)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !484, file: !57, line: 278, baseType: !163, size: 64, offset: 10432)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_mask", scope: !484, file: !57, line: 279, baseType: !163, size: 64, offset: 10496)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !484, file: !57, line: 280, baseType: !7, size: 32, offset: 10560)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !484, file: !57, line: 281, baseType: !7, size: 32, offset: 10592)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "gpulamp", scope: !484, file: !57, line: 283, baseType: !113, size: 128, offset: 10624)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "pc_ids", scope: !484, file: !57, line: 284, baseType: !113, size: 128, offset: 10752)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "duplilist", scope: !484, file: !57, line: 285, baseType: !721, size: 64, offset: 10880)
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_object", scope: !484, file: !57, line: 287, baseType: !723, size: 64, offset: 10944)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 64)
!724 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyOb", file: !57, line: 59, flags: DIFlagFwdDecl)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_constraint", scope: !484, file: !57, line: 288, baseType: !726, size: 64, offset: 11008)
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 64)
!727 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyCon", file: !57, line: 288, flags: DIFlagFwdDecl)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "ima_ofs", scope: !484, file: !57, line: 290, baseType: !729, size: 64, offset: 11072)
!729 = !DICompositeType(tag: DW_TAG_array_type, baseType: !364, size: 64, elements: !335)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !484, file: !57, line: 291, baseType: !731, size: 64, offset: 11136)
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !732, size: 64)
!732 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageUser", file: !733, line: 65, baseType: !734)
!733 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!734 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !733, line: 50, size: 320, elements: !735)
!735 = !{!736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !734, file: !733, line: 51, baseType: !474, size: 64)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !734, file: !733, line: 53, baseType: !48, size: 32, offset: 64)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !734, file: !733, line: 54, baseType: !48, size: 32, offset: 96)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !734, file: !733, line: 55, baseType: !48, size: 32, offset: 128)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !734, file: !733, line: 55, baseType: !48, size: 32, offset: 160)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !734, file: !733, line: 56, baseType: !76, size: 8, offset: 192)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "cycl", scope: !734, file: !733, line: 56, baseType: !76, size: 8, offset: 200)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !734, file: !733, line: 57, baseType: !76, size: 8, offset: 208)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !734, file: !733, line: 57, baseType: !76, size: 8, offset: 216)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "multi_index", scope: !734, file: !733, line: 59, baseType: !158, size: 16, offset: 224)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !734, file: !733, line: 59, baseType: !158, size: 16, offset: 240)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !734, file: !733, line: 59, baseType: !158, size: 16, offset: 256)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !734, file: !733, line: 61, baseType: !158, size: 16, offset: 272)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !734, file: !733, line: 63, baseType: !48, size: 32, offset: 288)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "lodlevels", scope: !484, file: !57, line: 293, baseType: !113, size: 128, offset: 11200)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "currentlod", scope: !484, file: !57, line: 294, baseType: !752, size: 64, offset: 11328)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 64)
!753 = !DIDerivedType(tag: DW_TAG_typedef, name: "LodLevel", file: !57, line: 113, baseType: !754)
!754 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LodLevel", file: !57, line: 108, size: 256, elements: !755)
!755 = !{!756, !758, !759, !760, !761}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !754, file: !57, line: 109, baseType: !757, size: 64)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 64)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !754, file: !57, line: 109, baseType: !757, size: 64, offset: 64)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !754, file: !57, line: 110, baseType: !483, size: 64, offset: 128)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !754, file: !57, line: 111, baseType: !48, size: 32, offset: 192)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "distance", scope: !754, file: !57, line: 112, baseType: !364, size: 32, offset: 224)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !475, file: !476, line: 1221, baseType: !763, size: 64, offset: 1088)
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 64)
!764 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !476, line: 52, flags: DIFlagFwdDecl)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !475, file: !476, line: 1223, baseType: !474, size: 64, offset: 1152)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !475, file: !476, line: 1225, baseType: !113, size: 128, offset: 1216)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !475, file: !476, line: 1226, baseType: !768, size: 64, offset: 1344)
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 64)
!769 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !476, line: 69, size: 320, elements: !770)
!770 = !{!771, !772, !773, !774, !775, !776, !777, !778}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !769, file: !476, line: 70, baseType: !768, size: 64)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !769, file: !476, line: 70, baseType: !768, size: 64, offset: 64)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !769, file: !476, line: 71, baseType: !7, size: 32, offset: 128)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !769, file: !476, line: 71, baseType: !7, size: 32, offset: 160)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !769, file: !476, line: 72, baseType: !48, size: 32, offset: 192)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !769, file: !476, line: 73, baseType: !158, size: 16, offset: 224)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !769, file: !476, line: 73, baseType: !158, size: 16, offset: 240)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !769, file: !476, line: 74, baseType: !483, size: 64, offset: 256)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !475, file: !476, line: 1227, baseType: !483, size: 64, offset: 1408)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !475, file: !476, line: 1229, baseType: !543, size: 96, offset: 1472)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !475, file: !476, line: 1230, baseType: !543, size: 96, offset: 1568)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !475, file: !476, line: 1231, baseType: !543, size: 96, offset: 1664)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !475, file: !476, line: 1231, baseType: !543, size: 96, offset: 1760)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !475, file: !476, line: 1233, baseType: !7, size: 32, offset: 1856)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !475, file: !476, line: 1234, baseType: !48, size: 32, offset: 1888)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !475, file: !476, line: 1235, baseType: !7, size: 32, offset: 1920)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !475, file: !476, line: 1237, baseType: !158, size: 16, offset: 1952)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !475, file: !476, line: 1239, baseType: !76, size: 8, offset: 1968)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !475, file: !476, line: 1240, baseType: !790, size: 8, offset: 1976)
!790 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 8, elements: !791)
!791 = !{!792}
!792 = !DISubrange(count: 1)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !475, file: !476, line: 1242, baseType: !794, size: 64, offset: 1984)
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !795, size: 64)
!795 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !476, line: 57, flags: DIFlagFwdDecl)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !475, file: !476, line: 1244, baseType: !797, size: 64, offset: 2048)
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !798, size: 64)
!798 = !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !476, line: 59, flags: DIFlagFwdDecl)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "toolsettings", scope: !475, file: !476, line: 1246, baseType: !800, size: 64, offset: 2112)
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !801, size: 64)
!801 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolSettings", file: !476, line: 1067, size: 5184, elements: !802)
!802 = !{!803, !833, !834, !849, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !871, !966, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1077}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint", scope: !801, file: !476, line: 1068, baseType: !804, size: 64)
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 64)
!805 = !DIDerivedType(tag: DW_TAG_typedef, name: "VPaint", file: !476, line: 934, baseType: !806)
!806 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VPaint", file: !476, line: 925, size: 576, elements: !807)
!807 = !{!808, !824, !825, !826, !827, !829, !832}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !806, file: !476, line: 926, baseType: !809, size: 320)
!809 = !DIDerivedType(tag: DW_TAG_typedef, name: "Paint", file: !476, line: 830, baseType: !810)
!810 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Paint", file: !476, line: 813, size: 320, elements: !811)
!811 = !{!812, !815, !818, !819, !821, !822, !823}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !810, file: !476, line: 814, baseType: !813, size: 64)
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 64)
!814 = !DICompositeType(tag: DW_TAG_structure_type, name: "Brush", file: !476, line: 51, flags: DIFlagFwdDecl)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "palette", scope: !810, file: !476, line: 815, baseType: !816, size: 64, offset: 64)
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 64)
!817 = !DICompositeType(tag: DW_TAG_structure_type, name: "Palette", file: !476, line: 815, flags: DIFlagFwdDecl)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor", scope: !810, file: !476, line: 818, baseType: !98, size: 64, offset: 128)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor_col", scope: !810, file: !476, line: 819, baseType: !820, size: 32, offset: 192)
!820 = !DICompositeType(tag: DW_TAG_array_type, baseType: !460, size: 32, elements: !615)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !810, file: !476, line: 822, baseType: !48, size: 32, offset: 224)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "num_input_samples", scope: !810, file: !476, line: 826, baseType: !48, size: 32, offset: 256)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "symmetry_flags", scope: !810, file: !476, line: 829, baseType: !48, size: 32, offset: 288)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !806, file: !476, line: 928, baseType: !158, size: 16, offset: 320)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !806, file: !476, line: 928, baseType: !158, size: 16, offset: 336)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !806, file: !476, line: 929, baseType: !48, size: 32, offset: 352)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint_prev", scope: !806, file: !476, line: 930, baseType: !828, size: 64, offset: 384)
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint_prev", scope: !806, file: !476, line: 931, baseType: !830, size: 64, offset: 448)
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !831, size: 64)
!831 = !DICompositeType(tag: DW_TAG_structure_type, name: "MDeformVert", file: !476, line: 931, flags: DIFlagFwdDecl)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !806, file: !476, line: 933, baseType: !98, size: 64, offset: 512)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint", scope: !801, file: !476, line: 1069, baseType: !804, size: 64, offset: 64)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !801, file: !476, line: 1070, baseType: !835, size: 64, offset: 128)
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !836, size: 64)
!836 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sculpt", file: !476, line: 916, baseType: !837)
!837 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sculpt", file: !476, line: 891, size: 704, elements: !838)
!838 = !{!839, !840, !841, !843, !844, !845, !846, !847, !848}
!839 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !837, file: !476, line: 892, baseType: !809, size: 320)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !837, file: !476, line: 896, baseType: !48, size: 32, offset: 320)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "radial_symm", scope: !837, file: !476, line: 900, baseType: !842, size: 96, offset: 352)
!842 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 96, elements: !466)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "detail_size", scope: !837, file: !476, line: 903, baseType: !364, size: 32, offset: 448)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "symmetrize_direction", scope: !837, file: !476, line: 906, baseType: !48, size: 32, offset: 480)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "gravity_factor", scope: !837, file: !476, line: 909, baseType: !364, size: 32, offset: 512)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "constant_detail", scope: !837, file: !476, line: 912, baseType: !364, size: 32, offset: 544)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "gravity_object", scope: !837, file: !476, line: 914, baseType: !483, size: 64, offset: 576)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !837, file: !476, line: 915, baseType: !98, size: 64, offset: 640)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "uvsculpt", scope: !801, file: !476, line: 1071, baseType: !850, size: 64, offset: 192)
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !851, size: 64)
!851 = !DIDerivedType(tag: DW_TAG_typedef, name: "UvSculpt", file: !476, line: 920, baseType: !852)
!852 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UvSculpt", file: !476, line: 918, size: 320, elements: !853)
!853 = !{!854}
!854 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !852, file: !476, line: 919, baseType: !809, size: 320)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "vgroup_weight", scope: !801, file: !476, line: 1075, baseType: !364, size: 32, offset: 256)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "doublimit", scope: !801, file: !476, line: 1077, baseType: !364, size: 32, offset: 288)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "normalsize", scope: !801, file: !476, line: 1078, baseType: !364, size: 32, offset: 320)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "automerge", scope: !801, file: !476, line: 1079, baseType: !158, size: 16, offset: 352)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !801, file: !476, line: 1082, baseType: !158, size: 16, offset: 368)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "unwrapper", scope: !801, file: !476, line: 1085, baseType: !76, size: 8, offset: 384)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "uvcalc_flag", scope: !801, file: !476, line: 1086, baseType: !76, size: 8, offset: 392)
