; ModuleID = 'blender/source/blender/editors/space_image/image_buttons.c'
source_filename = "blender/source/blender/editors/space_image/image_buttons.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.UserDef = type { i32, i32, i32, i32, i32, [768 x i8], [768 x i8], [1024 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [1024 x i8], [1024 x i8], i32, i16, i16, i16, i16, i16, i16, i32, i32, i32, i16, i16, i32, i32, i32, i32, i32, i32, i32, i16, i16, i16, i16, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, [64 x i8], i16, i16, i16, i16, i16, i16, i16, i16, [3 x %struct.SolidLight], i16, i16, i16, i16, i16, i16, i16, i16, i32, i32, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i8, i8, i8, i8, i16, i16, i16, i16, i16, i16, float, float, i32, i16, i16, float, i16, i16, i16, i16, %struct.ColorBand, [3 x float], [4 x float], i16, i8, i8, [80 x i8], [1024 x i8], i32, i32, float, float, i32, i16, i16, i16, i16, i16, i16, %struct.WalkNavigation }
%struct.ListBase = type { i8*, i8* }
%struct.SolidLight = type { i32, i32, [4 x float], [4 x float], [4 x float] }
%struct.ColorBand = type { i16, i16, i8, i8, i8, [1 x i8], [32 x %struct.CBData] }
%struct.CBData = type { float, float, float, float, float, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "rnd_pt", scope: !2, file: !3, line: 525, type: !3667, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "uiblock_layer_pass_buttons", scope: !3, file: !3, line: 523, type: !4, scopeLine: 524, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2720, retainedNodes: !3666)
!3 = !DIFile(filename: "blender/source/blender/editors/space_image/image_buttons.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !DISubroutineType(types: !5)
!5 = !{null, !6, !11, !2715, !2717, !53, !2719}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "uiLayout", file: !8, line: 85, baseType: !9)
!8 = !DIFile(filename: "blender/source/blender/editors/include/UI_interface.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!9 = !DICompositeType(tag: DW_TAG_structure_type, name: "uiLayout", file: !10, line: 73, flags: DIFlagFwdDecl)
!10 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_node.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "Image", file: !13, line: 127, baseType: !14)
!13 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!14 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !13, line: 77, size: 15424, elements: !15)
!15 = !{!16, !88, !89, !92, !95, !98, !2675, !2677, !2678, !2679, !2680, !2681, !2682, !2683, !2684, !2685, !2686, !2687, !2688, !2689, !2690, !2691, !2692, !2693, !2694, !2695, !2696, !2697, !2698, !2699, !2700, !2701, !2702, !2703, !2704, !2705, !2706, !2707, !2708, !2709}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !14, file: !13, line: 78, baseType: !17, size: 960)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !18, line: 130, baseType: !19)
!18 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!19 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !18, line: 117, size: 960, elements: !20)
!20 = !{!21, !23, !24, !26, !46, !50, !52, !54, !55, !56}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !19, file: !18, line: 118, baseType: !22, size: 64)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !19, file: !18, line: 118, baseType: !22, size: 64, offset: 64)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !19, file: !18, line: 119, baseType: !25, size: 64, offset: 128)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !19, file: !18, line: 120, baseType: !27, size: 64, offset: 192)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!28 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !18, line: 136, size: 17600, elements: !29)
!29 = !{!30, !31, !33, !36, !41, !42, !43}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !28, file: !18, line: 137, baseType: !17, size: 960)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !28, file: !18, line: 138, baseType: !32, size: 64, offset: 960)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !28, file: !18, line: 139, baseType: !34, size: 64, offset: 1024)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!35 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !18, line: 43, flags: DIFlagFwdDecl)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !28, file: !18, line: 140, baseType: !37, size: 8192, offset: 1088)
!37 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 8192, elements: !39)
!38 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!39 = !{!40}
!40 = !DISubrange(count: 1024)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !28, file: !18, line: 141, baseType: !37, size: 8192, offset: 9280)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !28, file: !18, line: 148, baseType: !27, size: 64, offset: 17472)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !28, file: !18, line: 150, baseType: !44, size: 64, offset: 17536)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!45 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !18, line: 45, flags: DIFlagFwdDecl)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !19, file: !18, line: 121, baseType: !47, size: 528, offset: 256)
!47 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 528, elements: !48)
!48 = !{!49}
!49 = !DISubrange(count: 66)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !19, file: !18, line: 126, baseType: !51, size: 16, offset: 784)
!51 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !19, file: !18, line: 127, baseType: !53, size: 32, offset: 800)
!53 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !19, file: !18, line: 128, baseType: !53, size: 32, offset: 832)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !19, file: !18, line: 128, baseType: !53, size: 32, offset: 864)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !19, file: !18, line: 129, baseType: !57, size: 64, offset: 896)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !18, line: 75, baseType: !59)
!59 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !18, line: 62, size: 1024, elements: !60)
!60 = !{!61, !63, !64, !65, !66, !67, !71, !72, !86, !87}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !59, file: !18, line: 63, baseType: !62, size: 64)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !59, file: !18, line: 63, baseType: !62, size: 64, offset: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !59, file: !18, line: 64, baseType: !38, size: 8, offset: 128)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !59, file: !18, line: 64, baseType: !38, size: 8, offset: 136)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !59, file: !18, line: 65, baseType: !51, size: 16, offset: 144)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !59, file: !18, line: 66, baseType: !68, size: 512, offset: 160)
!68 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 512, elements: !69)
!69 = !{!70}
!70 = !DISubrange(count: 64)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !59, file: !18, line: 67, baseType: !53, size: 32, offset: 672)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !59, file: !18, line: 69, baseType: !73, size: 256, offset: 704)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !18, line: 60, baseType: !74)
!74 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !18, line: 48, size: 256, elements: !75)
!75 = !{!76, !77, !84, !85}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !74, file: !18, line: 49, baseType: !22, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !74, file: !18, line: 58, baseType: !78, size: 128, offset: 64)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !79, line: 71, baseType: !80)
!79 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !79, line: 69, size: 128, elements: !81)
!81 = !{!82, !83}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !80, file: !79, line: 70, baseType: !22, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !80, file: !79, line: 70, baseType: !22, size: 64, offset: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !74, file: !18, line: 59, baseType: !53, size: 32, offset: 192)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !74, file: !18, line: 59, baseType: !53, size: 32, offset: 224)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !59, file: !18, line: 70, baseType: !53, size: 32, offset: 960)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !59, file: !18, line: 74, baseType: !53, size: 32, offset: 992)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !14, file: !13, line: 80, baseType: !37, size: 8192, offset: 960)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !14, file: !13, line: 82, baseType: !90, size: 64, offset: 9152)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !13, line: 43, flags: DIFlagFwdDecl)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !14, file: !13, line: 83, baseType: !93, size: 64, offset: 9216)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !18, line: 46, flags: DIFlagFwdDecl)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !14, file: !13, line: 86, baseType: !96, size: 64, offset: 9280)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !13, line: 41, flags: DIFlagFwdDecl)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !14, file: !13, line: 87, baseType: !99, size: 64, offset: 9344)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !101, line: 110, size: 1152, elements: !102)
!101 = !DIFile(filename: "blender/source/blender/render/extern/include/RE_pipeline.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!102 = !{!103, !104, !105, !106, !107, !108, !109, !111, !114, !115, !124, !125, !126, !127, !129, !2671, !2672, !2673, !2674}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !100, file: !101, line: 111, baseType: !99, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !100, file: !101, line: 111, baseType: !99, size: 64, offset: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "rectx", scope: !100, file: !101, line: 114, baseType: !53, size: 32, offset: 128)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "recty", scope: !100, file: !101, line: 114, baseType: !53, size: 32, offset: 160)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !100, file: !101, line: 115, baseType: !51, size: 16, offset: 192)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "sample_nr", scope: !100, file: !101, line: 115, baseType: !51, size: 16, offset: 208)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "rect32", scope: !100, file: !101, line: 118, baseType: !110, size: 64, offset: 256)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "rectf", scope: !100, file: !101, line: 120, baseType: !112, size: 64, offset: 320)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "rectz", scope: !100, file: !101, line: 122, baseType: !112, size: 64, offset: 384)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "tilerect", scope: !100, file: !101, line: 125, baseType: !116, size: 128, offset: 448)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "rcti", file: !117, line: 89, baseType: !118)
!117 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rcti", file: !117, line: 86, size: 128, elements: !119)
!119 = !{!120, !121, !122, !123}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !118, file: !117, line: 87, baseType: !53, size: 32)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !118, file: !117, line: 87, baseType: !53, size: 32, offset: 32)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !118, file: !117, line: 88, baseType: !53, size: 32, offset: 64)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !118, file: !117, line: 88, baseType: !53, size: 32, offset: 96)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "xof", scope: !100, file: !101, line: 127, baseType: !53, size: 32, offset: 576)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "yof", scope: !100, file: !101, line: 127, baseType: !53, size: 32, offset: 608)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !100, file: !101, line: 130, baseType: !78, size: 128, offset: 640)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "renrect", scope: !100, file: !101, line: 133, baseType: !128, size: 128, offset: 768)
!128 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !116)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "renlay", scope: !100, file: !101, line: 134, baseType: !130, size: 64, offset: 896)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !132)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderLayer", file: !101, line: 108, baseType: !133)
!133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderLayer", file: !101, line: 85, size: 1600, elements: !134)
!134 = !{!135, !137, !138, !142, !144, !145, !146, !147, !148, !149, !2662, !2663, !2664, !2665, !2666, !2667, !2668, !2669, !2670}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !133, file: !101, line: 86, baseType: !136, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !133, file: !101, line: 86, baseType: !136, size: 64, offset: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !133, file: !101, line: 89, baseType: !139, size: 592, offset: 128)
!139 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 592, elements: !140)
!140 = !{!141}
!141 = !DISubrange(count: 74)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !133, file: !101, line: 90, baseType: !143, size: 32, offset: 736)
!143 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "lay_zmask", scope: !133, file: !101, line: 90, baseType: !143, size: 32, offset: 768)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "lay_exclude", scope: !133, file: !101, line: 90, baseType: !143, size: 32, offset: 800)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "layflag", scope: !133, file: !101, line: 91, baseType: !53, size: 32, offset: 832)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "passflag", scope: !133, file: !101, line: 91, baseType: !53, size: 32, offset: 864)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "pass_xor", scope: !133, file: !101, line: 91, baseType: !53, size: 32, offset: 896)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "mat_override", scope: !133, file: !101, line: 93, baseType: !150, size: 64, offset: 960)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !152, line: 93, size: 7552, elements: !153)
!152 = !DIFile(filename: "blender/source/blender/makesdna/DNA_material_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!153 = !{!154, !155, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !208, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !277, !278, !279, !280, !281, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !2619, !2620, !2621, !2624, !2625, !2626, !2627, !2628, !2629, !2630, !2631, !2632, !2633, !2634, !2635, !2636, !2637, !2638, !2639, !2640, !2641, !2642, !2643, !2644, !2645, !2646, !2647, !2648, !2649, !2650, !2651, !2652, !2653, !2661}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !151, file: !152, line: 94, baseType: !17, size: 960)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !151, file: !152, line: 95, baseType: !156, size: 64, offset: 960)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!157 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !158, line: 45, flags: DIFlagFwdDecl)
!158 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!159 = !DIDerivedType(tag: DW_TAG_member, name: "material_type", scope: !151, file: !152, line: 97, baseType: !51, size: 16, offset: 1024)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !151, file: !152, line: 97, baseType: !51, size: 16, offset: 1040)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !151, file: !152, line: 99, baseType: !113, size: 32, offset: 1056)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !151, file: !152, line: 99, baseType: !113, size: 32, offset: 1088)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !151, file: !152, line: 99, baseType: !113, size: 32, offset: 1120)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "specr", scope: !151, file: !152, line: 100, baseType: !113, size: 32, offset: 1152)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "specg", scope: !151, file: !152, line: 100, baseType: !113, size: 32, offset: 1184)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "specb", scope: !151, file: !152, line: 100, baseType: !113, size: 32, offset: 1216)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "mirr", scope: !151, file: !152, line: 101, baseType: !113, size: 32, offset: 1248)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "mirg", scope: !151, file: !152, line: 101, baseType: !113, size: 32, offset: 1280)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "mirb", scope: !151, file: !152, line: 101, baseType: !113, size: 32, offset: 1312)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "ambr", scope: !151, file: !152, line: 102, baseType: !113, size: 32, offset: 1344)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "ambb", scope: !151, file: !152, line: 102, baseType: !113, size: 32, offset: 1376)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "ambg", scope: !151, file: !152, line: 102, baseType: !113, size: 32, offset: 1408)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "amb", scope: !151, file: !152, line: 103, baseType: !113, size: 32, offset: 1440)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "emit", scope: !151, file: !152, line: 103, baseType: !113, size: 32, offset: 1472)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "ang", scope: !151, file: !152, line: 103, baseType: !113, size: 32, offset: 1504)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "spectra", scope: !151, file: !152, line: 103, baseType: !113, size: 32, offset: 1536)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "ray_mirror", scope: !151, file: !152, line: 103, baseType: !113, size: 32, offset: 1568)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !151, file: !152, line: 104, baseType: !113, size: 32, offset: 1600)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !151, file: !152, line: 104, baseType: !113, size: 32, offset: 1632)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "spec", scope: !151, file: !152, line: 104, baseType: !113, size: 32, offset: 1664)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "zoffs", scope: !151, file: !152, line: 104, baseType: !113, size: 32, offset: 1696)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "add", scope: !151, file: !152, line: 104, baseType: !113, size: 32, offset: 1728)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "translucency", scope: !151, file: !152, line: 105, baseType: !113, size: 32, offset: 1760)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "vol", scope: !151, file: !152, line: 108, baseType: !185, size: 704, offset: 1792)
!185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VolumeSettings", file: !152, line: 53, size: 704, elements: !186)
!186 = !{!187, !188, !189, !190, !191, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "density", scope: !185, file: !152, line: 54, baseType: !113, size: 32)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "emission", scope: !185, file: !152, line: 55, baseType: !113, size: 32, offset: 32)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "scattering", scope: !185, file: !152, line: 56, baseType: !113, size: 32, offset: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "reflection", scope: !185, file: !152, line: 57, baseType: !113, size: 32, offset: 96)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "emission_col", scope: !185, file: !152, line: 59, baseType: !192, size: 96, offset: 128)
!192 = !DICompositeType(tag: DW_TAG_array_type, baseType: !113, size: 96, elements: !193)
!193 = !{!194}
!194 = !DISubrange(count: 3)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "transmission_col", scope: !185, file: !152, line: 60, baseType: !192, size: 96, offset: 224)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "reflection_col", scope: !185, file: !152, line: 61, baseType: !192, size: 96, offset: 320)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "density_scale", scope: !185, file: !152, line: 63, baseType: !113, size: 32, offset: 416)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "depth_cutoff", scope: !185, file: !152, line: 64, baseType: !113, size: 32, offset: 448)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "asymmetry", scope: !185, file: !152, line: 65, baseType: !113, size: 32, offset: 480)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "stepsize_type", scope: !185, file: !152, line: 67, baseType: !51, size: 16, offset: 512)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "shadeflag", scope: !185, file: !152, line: 68, baseType: !51, size: 16, offset: 528)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "shade_type", scope: !185, file: !152, line: 69, baseType: !51, size: 16, offset: 544)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "precache_resolution", scope: !185, file: !152, line: 70, baseType: !51, size: 16, offset: 560)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "stepsize", scope: !185, file: !152, line: 72, baseType: !113, size: 32, offset: 576)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "ms_diff", scope: !185, file: !152, line: 73, baseType: !113, size: 32, offset: 608)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "ms_intensity", scope: !185, file: !152, line: 74, baseType: !113, size: 32, offset: 640)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "ms_spread", scope: !185, file: !152, line: 75, baseType: !113, size: 32, offset: 672)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "game", scope: !151, file: !152, line: 109, baseType: !209, size: 128, offset: 2496)
!209 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GameSettings", file: !152, line: 79, size: 128, elements: !210)
!210 = !{!211, !212, !213, !214}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !209, file: !152, line: 80, baseType: !53, size: 32)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_blend", scope: !209, file: !152, line: 81, baseType: !53, size: 32, offset: 32)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "face_orientation", scope: !209, file: !152, line: 82, baseType: !53, size: 32, offset: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !209, file: !152, line: 83, baseType: !53, size: 32, offset: 96)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_mir", scope: !151, file: !152, line: 111, baseType: !113, size: 32, offset: 2624)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_mir_i", scope: !151, file: !152, line: 111, baseType: !113, size: 32, offset: 2656)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_tra", scope: !151, file: !152, line: 112, baseType: !113, size: 32, offset: 2688)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "fresnel_tra_i", scope: !151, file: !152, line: 112, baseType: !113, size: 32, offset: 2720)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !151, file: !152, line: 113, baseType: !113, size: 32, offset: 2752)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "tx_limit", scope: !151, file: !152, line: 114, baseType: !113, size: 32, offset: 2784)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "tx_falloff", scope: !151, file: !152, line: 114, baseType: !113, size: 32, offset: 2816)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "ray_depth", scope: !151, file: !152, line: 115, baseType: !51, size: 16, offset: 2848)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "ray_depth_tra", scope: !151, file: !152, line: 115, baseType: !51, size: 16, offset: 2864)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "har", scope: !151, file: !152, line: 116, baseType: !51, size: 16, offset: 2880)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "seed1", scope: !151, file: !152, line: 117, baseType: !38, size: 8, offset: 2896)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "seed2", scope: !151, file: !152, line: 117, baseType: !38, size: 8, offset: 2904)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "gloss_mir", scope: !151, file: !152, line: 119, baseType: !113, size: 32, offset: 2912)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "gloss_tra", scope: !151, file: !152, line: 119, baseType: !113, size: 32, offset: 2944)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "samp_gloss_mir", scope: !151, file: !152, line: 120, baseType: !51, size: 16, offset: 2976)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "samp_gloss_tra", scope: !151, file: !152, line: 120, baseType: !51, size: 16, offset: 2992)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "adapt_thresh_mir", scope: !151, file: !152, line: 121, baseType: !113, size: 32, offset: 3008)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "adapt_thresh_tra", scope: !151, file: !152, line: 121, baseType: !113, size: 32, offset: 3040)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "aniso_gloss_mir", scope: !151, file: !152, line: 122, baseType: !113, size: 32, offset: 3072)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "dist_mir", scope: !151, file: !152, line: 123, baseType: !113, size: 32, offset: 3104)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "fadeto_mir", scope: !151, file: !152, line: 124, baseType: !51, size: 16, offset: 3136)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "shade_flag", scope: !151, file: !152, line: 125, baseType: !51, size: 16, offset: 3152)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !151, file: !152, line: 127, baseType: !53, size: 32, offset: 3168)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "mode_l", scope: !151, file: !152, line: 127, baseType: !53, size: 32, offset: 3200)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "mode2", scope: !151, file: !152, line: 128, baseType: !53, size: 32, offset: 3232)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "mode2_l", scope: !151, file: !152, line: 128, baseType: !53, size: 32, offset: 3264)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "flarec", scope: !151, file: !152, line: 129, baseType: !51, size: 16, offset: 3296)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "starc", scope: !151, file: !152, line: 129, baseType: !51, size: 16, offset: 3312)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "linec", scope: !151, file: !152, line: 129, baseType: !51, size: 16, offset: 3328)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "ringc", scope: !151, file: !152, line: 129, baseType: !51, size: 16, offset: 3344)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "hasize", scope: !151, file: !152, line: 130, baseType: !113, size: 32, offset: 3360)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "flaresize", scope: !151, file: !152, line: 130, baseType: !113, size: 32, offset: 3392)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "subsize", scope: !151, file: !152, line: 130, baseType: !113, size: 32, offset: 3424)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "flareboost", scope: !151, file: !152, line: 130, baseType: !113, size: 32, offset: 3456)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "strand_sta", scope: !151, file: !152, line: 131, baseType: !113, size: 32, offset: 3488)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "strand_end", scope: !151, file: !152, line: 131, baseType: !113, size: 32, offset: 3520)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "strand_ease", scope: !151, file: !152, line: 131, baseType: !113, size: 32, offset: 3552)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "strand_surfnor", scope: !151, file: !152, line: 131, baseType: !113, size: 32, offset: 3584)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "strand_min", scope: !151, file: !152, line: 132, baseType: !113, size: 32, offset: 3616)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "strand_widthfade", scope: !151, file: !152, line: 132, baseType: !113, size: 32, offset: 3648)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "strand_uvname", scope: !151, file: !152, line: 133, baseType: !68, size: 512, offset: 3680)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "sbias", scope: !151, file: !152, line: 135, baseType: !113, size: 32, offset: 4192)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "lbias", scope: !151, file: !152, line: 136, baseType: !113, size: 32, offset: 4224)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "shad_alpha", scope: !151, file: !152, line: 137, baseType: !113, size: 32, offset: 4256)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "septex", scope: !151, file: !152, line: 138, baseType: !53, size: 32, offset: 4288)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "rgbsel", scope: !151, file: !152, line: 141, baseType: !38, size: 8, offset: 4320)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "texact", scope: !151, file: !152, line: 141, baseType: !38, size: 8, offset: 4328)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "pr_type", scope: !151, file: !152, line: 141, baseType: !38, size: 8, offset: 4336)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !151, file: !152, line: 141, baseType: !38, size: 8, offset: 4344)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "pr_lamp", scope: !151, file: !152, line: 142, baseType: !51, size: 16, offset: 4352)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "pr_texture", scope: !151, file: !152, line: 142, baseType: !51, size: 16, offset: 4368)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "ml_flag", scope: !151, file: !152, line: 142, baseType: !51, size: 16, offset: 4384)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "mapflag", scope: !151, file: !152, line: 145, baseType: !38, size: 8, offset: 4400)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !151, file: !152, line: 145, baseType: !38, size: 8, offset: 4408)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "diff_shader", scope: !151, file: !152, line: 148, baseType: !51, size: 16, offset: 4416)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "spec_shader", scope: !151, file: !152, line: 148, baseType: !51, size: 16, offset: 4432)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "roughness", scope: !151, file: !152, line: 149, baseType: !113, size: 32, offset: 4448)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "refrac", scope: !151, file: !152, line: 149, baseType: !113, size: 32, offset: 4480)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !151, file: !152, line: 152, baseType: !274, size: 128, offset: 4512)
!274 = !DICompositeType(tag: DW_TAG_array_type, baseType: !113, size: 128, elements: !275)
!275 = !{!276}
!276 = !DISubrange(count: 4)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "rms", scope: !151, file: !152, line: 153, baseType: !113, size: 32, offset: 4640)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "darkness", scope: !151, file: !152, line: 154, baseType: !113, size: 32, offset: 4672)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !151, file: !152, line: 157, baseType: !51, size: 16, offset: 4704)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !151, file: !152, line: 157, baseType: !51, size: 16, offset: 4720)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_col", scope: !151, file: !152, line: 160, baseType: !282, size: 64, offset: 4736)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!283 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorBand", file: !158, line: 113, size: 6208, elements: !284)
!284 = !{!285, !286, !287, !288, !289, !290, !294}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !283, file: !158, line: 114, baseType: !51, size: 16)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !283, file: !158, line: 114, baseType: !51, size: 16, offset: 16)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype", scope: !283, file: !158, line: 115, baseType: !38, size: 8, offset: 32)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "ipotype_hue", scope: !283, file: !158, line: 115, baseType: !38, size: 8, offset: 40)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "color_mode", scope: !283, file: !158, line: 116, baseType: !38, size: 8, offset: 48)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !283, file: !158, line: 117, baseType: !291, size: 8, offset: 56)
!291 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 8, elements: !292)
!292 = !{!293}
!293 = !DISubrange(count: 1)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !283, file: !158, line: 119, baseType: !295, size: 6144, offset: 64)
!295 = !DICompositeType(tag: DW_TAG_array_type, baseType: !296, size: 6144, elements: !305)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "CBData", file: !158, line: 109, baseType: !297)
!297 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CBData", file: !158, line: 106, size: 192, elements: !298)
!298 = !{!299, !300, !301, !302, !303, !304}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !297, file: !158, line: 107, baseType: !113, size: 32)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !297, file: !158, line: 107, baseType: !113, size: 32, offset: 32)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !297, file: !158, line: 107, baseType: !113, size: 32, offset: 64)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !297, file: !158, line: 107, baseType: !113, size: 32, offset: 96)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !297, file: !158, line: 107, baseType: !113, size: 32, offset: 128)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !297, file: !158, line: 108, baseType: !53, size: 32, offset: 160)
!305 = !{!306}
!306 = !DISubrange(count: 32)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_spec", scope: !151, file: !152, line: 161, baseType: !282, size: 64, offset: 4800)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "rampin_col", scope: !151, file: !152, line: 162, baseType: !38, size: 8, offset: 4864)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "rampin_spec", scope: !151, file: !152, line: 162, baseType: !38, size: 8, offset: 4872)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "rampblend_col", scope: !151, file: !152, line: 163, baseType: !38, size: 8, offset: 4880)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "rampblend_spec", scope: !151, file: !152, line: 163, baseType: !38, size: 8, offset: 4888)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "ramp_show", scope: !151, file: !152, line: 164, baseType: !51, size: 16, offset: 4896)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !151, file: !152, line: 164, baseType: !51, size: 16, offset: 4912)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "rampfac_col", scope: !151, file: !152, line: 165, baseType: !113, size: 32, offset: 4928)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "rampfac_spec", scope: !151, file: !152, line: 165, baseType: !113, size: 32, offset: 4960)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "mtex", scope: !151, file: !152, line: 167, baseType: !317, size: 1152, offset: 4992)
!317 = !DICompositeType(tag: DW_TAG_array_type, baseType: !318, size: 1152, elements: !2617)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!319 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTex", file: !158, line: 57, size: 2496, elements: !320)
!320 = !{!321, !322, !323, !324, !325, !328, !2558, !2559, !2560, !2561, !2562, !2563, !2564, !2565, !2566, !2567, !2568, !2569, !2570, !2571, !2572, !2573, !2574, !2575, !2576, !2577, !2578, !2579, !2580, !2581, !2582, !2583, !2584, !2585, !2586, !2587, !2588, !2589, !2590, !2591, !2592, !2593, !2594, !2595, !2596, !2597, !2598, !2599, !2600, !2601, !2602, !2603, !2604, !2605, !2606, !2607, !2608, !2609, !2610, !2611, !2612, !2613, !2614, !2615, !2616}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !319, file: !158, line: 59, baseType: !51, size: 16)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !319, file: !158, line: 59, baseType: !51, size: 16, offset: 16)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "maptoneg", scope: !319, file: !158, line: 59, baseType: !51, size: 16, offset: 32)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "blendtype", scope: !319, file: !158, line: 59, baseType: !51, size: 16, offset: 48)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !319, file: !158, line: 60, baseType: !326, size: 64, offset: 64)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!327 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !158, line: 49, flags: DIFlagFwdDecl)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "tex", scope: !319, file: !158, line: 61, baseType: !329, size: 64, offset: 128)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!330 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Tex", file: !158, line: 202, size: 3328, elements: !331)
!331 = !{!332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !2470, !2471, !2472, !2473, !2474, !2498, !2499, !2528, !2548, !2556, !2557}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !330, file: !158, line: 203, baseType: !17, size: 960)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !330, file: !158, line: 204, baseType: !156, size: 64, offset: 960)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "noisesize", scope: !330, file: !158, line: 206, baseType: !113, size: 32, offset: 1024)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "turbul", scope: !330, file: !158, line: 206, baseType: !113, size: 32, offset: 1056)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "bright", scope: !330, file: !158, line: 207, baseType: !113, size: 32, offset: 1088)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "contrast", scope: !330, file: !158, line: 207, baseType: !113, size: 32, offset: 1120)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "saturation", scope: !330, file: !158, line: 207, baseType: !113, size: 32, offset: 1152)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "rfac", scope: !330, file: !158, line: 207, baseType: !113, size: 32, offset: 1184)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "gfac", scope: !330, file: !158, line: 207, baseType: !113, size: 32, offset: 1216)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "bfac", scope: !330, file: !158, line: 207, baseType: !113, size: 32, offset: 1248)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "filtersize", scope: !330, file: !158, line: 208, baseType: !113, size: 32, offset: 1280)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !330, file: !158, line: 208, baseType: !113, size: 32, offset: 1312)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "mg_H", scope: !330, file: !158, line: 211, baseType: !113, size: 32, offset: 1344)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "mg_lacunarity", scope: !330, file: !158, line: 211, baseType: !113, size: 32, offset: 1376)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "mg_octaves", scope: !330, file: !158, line: 211, baseType: !113, size: 32, offset: 1408)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "mg_offset", scope: !330, file: !158, line: 211, baseType: !113, size: 32, offset: 1440)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "mg_gain", scope: !330, file: !158, line: 211, baseType: !113, size: 32, offset: 1472)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "dist_amount", scope: !330, file: !158, line: 214, baseType: !113, size: 32, offset: 1504)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "ns_outscale", scope: !330, file: !158, line: 214, baseType: !113, size: 32, offset: 1536)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w1", scope: !330, file: !158, line: 217, baseType: !113, size: 32, offset: 1568)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w2", scope: !330, file: !158, line: 218, baseType: !113, size: 32, offset: 1600)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w3", scope: !330, file: !158, line: 219, baseType: !113, size: 32, offset: 1632)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w4", scope: !330, file: !158, line: 220, baseType: !113, size: 32, offset: 1664)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "vn_mexp", scope: !330, file: !158, line: 221, baseType: !113, size: 32, offset: 1696)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "vn_distm", scope: !330, file: !158, line: 222, baseType: !51, size: 16, offset: 1728)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "vn_coltype", scope: !330, file: !158, line: 222, baseType: !51, size: 16, offset: 1744)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "noisedepth", scope: !330, file: !158, line: 224, baseType: !51, size: 16, offset: 1760)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "noisetype", scope: !330, file: !158, line: 224, baseType: !51, size: 16, offset: 1776)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis", scope: !330, file: !158, line: 227, baseType: !51, size: 16, offset: 1792)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis2", scope: !330, file: !158, line: 227, baseType: !51, size: 16, offset: 1808)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "imaflag", scope: !330, file: !158, line: 229, baseType: !51, size: 16, offset: 1824)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !330, file: !158, line: 229, baseType: !51, size: 16, offset: 1840)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !330, file: !158, line: 230, baseType: !51, size: 16, offset: 1856)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "stype", scope: !330, file: !158, line: 230, baseType: !51, size: 16, offset: 1872)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmin", scope: !330, file: !158, line: 232, baseType: !113, size: 32, offset: 1888)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "cropymin", scope: !330, file: !158, line: 232, baseType: !113, size: 32, offset: 1920)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmax", scope: !330, file: !158, line: 232, baseType: !113, size: 32, offset: 1952)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "cropymax", scope: !330, file: !158, line: 232, baseType: !113, size: 32, offset: 1984)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "texfilter", scope: !330, file: !158, line: 233, baseType: !53, size: 32, offset: 2016)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "afmax", scope: !330, file: !158, line: 234, baseType: !53, size: 32, offset: 2048)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "xrepeat", scope: !330, file: !158, line: 235, baseType: !51, size: 16, offset: 2080)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "yrepeat", scope: !330, file: !158, line: 235, baseType: !51, size: 16, offset: 2096)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "extend", scope: !330, file: !158, line: 236, baseType: !51, size: 16, offset: 2112)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !330, file: !158, line: 239, baseType: !51, size: 16, offset: 2128)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !330, file: !158, line: 240, baseType: !53, size: 32, offset: 2144)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !330, file: !158, line: 241, baseType: !53, size: 32, offset: 2176)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !330, file: !158, line: 241, baseType: !53, size: 32, offset: 2208)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !330, file: !158, line: 241, baseType: !53, size: 32, offset: 2240)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "checkerdist", scope: !330, file: !158, line: 243, baseType: !113, size: 32, offset: 2272)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "nabla", scope: !330, file: !158, line: 243, baseType: !113, size: 32, offset: 2304)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !330, file: !158, line: 244, baseType: !113, size: 32, offset: 2336)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !330, file: !158, line: 246, baseType: !384, size: 320, offset: 2368)
!384 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !13, line: 50, size: 320, elements: !385)
!385 = !{!386, !2457, !2458, !2459, !2460, !2461, !2462, !2463, !2464, !2465, !2466, !2467, !2468, !2469}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !384, file: !13, line: 51, baseType: !387, size: 64)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!388 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !389, line: 1216, size: 39680, elements: !390)
!389 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!390 = !{!391, !392, !393, !394, !1457, !1458, !1459, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1835, !2047, !2050, !2327, !2339, !2340, !2341, !2342, !2343, !2344, !2345, !2346, !2349, !2350, !2351, !2352, !2353, !2361, !2428, !2435, !2436, !2443, !2444, !2450, !2451, !2452, !2453, !2454}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !388, file: !389, line: 1217, baseType: !17, size: 960)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !388, file: !389, line: 1218, baseType: !156, size: 64, offset: 960)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !388, file: !389, line: 1220, baseType: !326, size: 64, offset: 1024)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !388, file: !389, line: 1221, baseType: !395, size: 64, offset: 1088)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !397, line: 52, size: 4224, elements: !398)
!397 = !DIFile(filename: "blender/source/blender/makesdna/DNA_world_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!398 = !{!399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !471, !472, !473, !474, !478, !492}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !396, file: !397, line: 53, baseType: !17, size: 960)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !396, file: !397, line: 54, baseType: !156, size: 64, offset: 960)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "colormodel", scope: !396, file: !397, line: 56, baseType: !51, size: 16, offset: 1024)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "totex", scope: !396, file: !397, line: 56, baseType: !51, size: 16, offset: 1040)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "texact", scope: !396, file: !397, line: 57, baseType: !51, size: 16, offset: 1056)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "mistype", scope: !396, file: !397, line: 57, baseType: !51, size: 16, offset: 1072)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "horr", scope: !396, file: !397, line: 59, baseType: !113, size: 32, offset: 1088)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "horg", scope: !396, file: !397, line: 59, baseType: !113, size: 32, offset: 1120)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "horb", scope: !396, file: !397, line: 59, baseType: !113, size: 32, offset: 1152)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "zenr", scope: !396, file: !397, line: 60, baseType: !113, size: 32, offset: 1184)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "zeng", scope: !396, file: !397, line: 60, baseType: !113, size: 32, offset: 1216)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "zenb", scope: !396, file: !397, line: 60, baseType: !113, size: 32, offset: 1248)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "ambr", scope: !396, file: !397, line: 61, baseType: !113, size: 32, offset: 1280)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "ambg", scope: !396, file: !397, line: 61, baseType: !113, size: 32, offset: 1312)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "ambb", scope: !396, file: !397, line: 61, baseType: !113, size: 32, offset: 1344)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "exposure", scope: !396, file: !397, line: 68, baseType: !113, size: 32, offset: 1376)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !396, file: !397, line: 68, baseType: !113, size: 32, offset: 1408)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !396, file: !397, line: 68, baseType: !113, size: 32, offset: 1440)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "linfac", scope: !396, file: !397, line: 69, baseType: !113, size: 32, offset: 1472)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "logfac", scope: !396, file: !397, line: 69, baseType: !113, size: 32, offset: 1504)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !396, file: !397, line: 74, baseType: !113, size: 32, offset: 1536)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "activityBoxRadius", scope: !396, file: !397, line: 79, baseType: !113, size: 32, offset: 1568)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "skytype", scope: !396, file: !397, line: 81, baseType: !51, size: 16, offset: 1600)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !396, file: !397, line: 91, baseType: !51, size: 16, offset: 1616)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "occlusionRes", scope: !396, file: !397, line: 92, baseType: !51, size: 16, offset: 1632)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "physicsEngine", scope: !396, file: !397, line: 93, baseType: !51, size: 16, offset: 1648)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "ticrate", scope: !396, file: !397, line: 94, baseType: !51, size: 16, offset: 1664)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "maxlogicstep", scope: !396, file: !397, line: 94, baseType: !51, size: 16, offset: 1680)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "physubstep", scope: !396, file: !397, line: 94, baseType: !51, size: 16, offset: 1696)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "maxphystep", scope: !396, file: !397, line: 94, baseType: !51, size: 16, offset: 1712)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "misi", scope: !396, file: !397, line: 96, baseType: !113, size: 32, offset: 1728)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "miststa", scope: !396, file: !397, line: 96, baseType: !113, size: 32, offset: 1760)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "mistdist", scope: !396, file: !397, line: 96, baseType: !113, size: 32, offset: 1792)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "misthi", scope: !396, file: !397, line: 96, baseType: !113, size: 32, offset: 1824)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "starr", scope: !396, file: !397, line: 98, baseType: !113, size: 32, offset: 1856)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "starg", scope: !396, file: !397, line: 98, baseType: !113, size: 32, offset: 1888)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "starb", scope: !396, file: !397, line: 98, baseType: !113, size: 32, offset: 1920)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "stark", scope: !396, file: !397, line: 98, baseType: !113, size: 32, offset: 1952)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "starsize", scope: !396, file: !397, line: 99, baseType: !113, size: 32, offset: 1984)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "starmindist", scope: !396, file: !397, line: 99, baseType: !113, size: 32, offset: 2016)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "stardist", scope: !396, file: !397, line: 100, baseType: !113, size: 32, offset: 2048)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "starcolnoise", scope: !396, file: !397, line: 100, baseType: !113, size: 32, offset: 2080)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "dofsta", scope: !396, file: !397, line: 103, baseType: !51, size: 16, offset: 2112)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "dofend", scope: !396, file: !397, line: 103, baseType: !51, size: 16, offset: 2128)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "dofmin", scope: !396, file: !397, line: 103, baseType: !51, size: 16, offset: 2144)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "dofmax", scope: !396, file: !397, line: 103, baseType: !51, size: 16, offset: 2160)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "aodist", scope: !396, file: !397, line: 106, baseType: !113, size: 32, offset: 2176)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "aodistfac", scope: !396, file: !397, line: 106, baseType: !113, size: 32, offset: 2208)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "aoenergy", scope: !396, file: !397, line: 106, baseType: !113, size: 32, offset: 2240)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "aobias", scope: !396, file: !397, line: 106, baseType: !113, size: 32, offset: 2272)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "aomode", scope: !396, file: !397, line: 107, baseType: !51, size: 16, offset: 2304)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "aosamp", scope: !396, file: !397, line: 107, baseType: !51, size: 16, offset: 2320)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "aomix", scope: !396, file: !397, line: 107, baseType: !51, size: 16, offset: 2336)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "aocolor", scope: !396, file: !397, line: 107, baseType: !51, size: 16, offset: 2352)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "ao_adapt_thresh", scope: !396, file: !397, line: 108, baseType: !113, size: 32, offset: 2368)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "ao_adapt_speed_fac", scope: !396, file: !397, line: 108, baseType: !113, size: 32, offset: 2400)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_error", scope: !396, file: !397, line: 109, baseType: !113, size: 32, offset: 2432)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_correction", scope: !396, file: !397, line: 109, baseType: !113, size: 32, offset: 2464)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "ao_indirect_energy", scope: !396, file: !397, line: 110, baseType: !113, size: 32, offset: 2496)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "ao_env_energy", scope: !396, file: !397, line: 110, baseType: !113, size: 32, offset: 2528)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "ao_pad2", scope: !396, file: !397, line: 110, baseType: !113, size: 32, offset: 2560)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "ao_indirect_bounces", scope: !396, file: !397, line: 111, baseType: !51, size: 16, offset: 2592)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "ao_pad", scope: !396, file: !397, line: 111, baseType: !51, size: 16, offset: 2608)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "ao_samp_method", scope: !396, file: !397, line: 112, baseType: !51, size: 16, offset: 2624)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "ao_gather_method", scope: !396, file: !397, line: 112, baseType: !51, size: 16, offset: 2640)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_passes", scope: !396, file: !397, line: 112, baseType: !51, size: 16, offset: 2656)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !396, file: !397, line: 115, baseType: !51, size: 16, offset: 2672)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "aosphere", scope: !396, file: !397, line: 118, baseType: !112, size: 64, offset: 2688)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "aotables", scope: !396, file: !397, line: 118, baseType: !112, size: 64, offset: 2752)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !396, file: !397, line: 121, baseType: !469, size: 64, offset: 2816)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64)
!470 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !158, line: 46, flags: DIFlagFwdDecl)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "mtex", scope: !396, file: !397, line: 122, baseType: !317, size: 1152, offset: 2880)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "pr_texture", scope: !396, file: !397, line: 123, baseType: !51, size: 16, offset: 4032)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !396, file: !397, line: 123, baseType: !51, size: 16, offset: 4048)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !396, file: !397, line: 123, baseType: !475, size: 32, offset: 4064)
!475 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 32, elements: !476)
!476 = !{!477}
!477 = !DISubrange(count: 2)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !396, file: !397, line: 126, baseType: !479, size: 64, offset: 4096)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64)
!480 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !18, line: 159, size: 448, elements: !481)
!481 = !{!482, !484, !485, !486, !487, !490}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !480, file: !18, line: 161, baseType: !483, size: 64)
!483 = !DICompositeType(tag: DW_TAG_array_type, baseType: !143, size: 64, elements: !476)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !480, file: !18, line: 162, baseType: !483, size: 64, offset: 64)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !480, file: !18, line: 163, baseType: !475, size: 32, offset: 128)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !480, file: !18, line: 164, baseType: !475, size: 32, offset: 160)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !480, file: !18, line: 165, baseType: !488, size: 128, offset: 192)
!488 = !DICompositeType(tag: DW_TAG_array_type, baseType: !489, size: 128, elements: !476)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !480, file: !18, line: 166, baseType: !491, size: 128, offset: 320)
!491 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, size: 128, elements: !476)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !396, file: !397, line: 129, baseType: !493, size: 64, offset: 4160)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64)
!494 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !495, line: 328, size: 3456, elements: !496)
!495 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!496 = !{!497, !498, !499, !1405, !1406, !1407, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1416, !1417, !1418, !1419, !1420, !1421, !1422, !1423, !1424, !1425, !1426, !1435, !1436, !1437, !1440, !1444, !1448, !1452, !1453, !1454, !1455, !1456}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !494, file: !495, line: 329, baseType: !17, size: 960)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !494, file: !495, line: 330, baseType: !156, size: 64, offset: 960)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !494, file: !495, line: 332, baseType: !500, size: 64, offset: 1024)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!501 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !10, line: 283, size: 4096, elements: !502)
!502 = !{!503, !504, !505, !506, !510, !511, !515, !1374, !1382, !1386, !1392, !1396, !1397, !1398, !1399, !1403, !1404}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !501, file: !10, line: 284, baseType: !53, size: 32)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !501, file: !10, line: 285, baseType: !68, size: 512, offset: 32)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "ui_name", scope: !501, file: !10, line: 287, baseType: !68, size: 512, offset: 544)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "ui_description", scope: !501, file: !10, line: 288, baseType: !507, size: 2048, offset: 1056)
!507 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 2048, elements: !508)
!508 = !{!509}
!509 = !DISubrange(count: 256)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "ui_icon", scope: !501, file: !10, line: 289, baseType: !53, size: 32, offset: 3104)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "free_cache", scope: !501, file: !10, line: 292, baseType: !512, size: 64, offset: 3136)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64)
!513 = !DISubroutineType(types: !514)
!514 = !{null, !493}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "free_node_cache", scope: !501, file: !10, line: 293, baseType: !516, size: 64, offset: 3200)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64)
!517 = !DISubroutineType(types: !518)
!518 = !{null, !493, !519}
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!520 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNode", file: !495, line: 167, size: 3712, elements: !521)
!521 = !{!522, !523, !524, !525, !526, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1355, !1356, !1357, !1358, !1359, !1360, !1361, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !520, file: !495, line: 168, baseType: !519, size: 64)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !520, file: !495, line: 168, baseType: !519, size: 64, offset: 64)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "new_node", scope: !520, file: !495, line: 168, baseType: !519, size: 64, offset: 128)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !520, file: !495, line: 170, baseType: !57, size: 64, offset: 192)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !520, file: !495, line: 172, baseType: !527, size: 64, offset: 256)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64)
!528 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeType", file: !10, line: 144, size: 6016, elements: !529)
!529 = !{!530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !704, !705, !706, !1178, !1182, !1186, !1187, !1257, !1261, !1265, !1266, !1267, !1268, !1272, !1273, !1277, !1281, !1285, !1289, !1293, !1297, !1301, !1302, !1309, !1311, !1320, !1329}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !528, file: !10, line: 145, baseType: !22, size: 64)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !528, file: !10, line: 145, baseType: !22, size: 64, offset: 64)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "needs_free", scope: !528, file: !10, line: 146, baseType: !51, size: 16, offset: 128)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !528, file: !10, line: 148, baseType: !68, size: 512, offset: 144)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !528, file: !10, line: 149, baseType: !53, size: 32, offset: 672)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "ui_name", scope: !528, file: !10, line: 151, baseType: !68, size: 512, offset: 704)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "ui_description", scope: !528, file: !10, line: 152, baseType: !507, size: 2048, offset: 1216)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "ui_icon", scope: !528, file: !10, line: 153, baseType: !53, size: 32, offset: 3264)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !528, file: !10, line: 155, baseType: !113, size: 32, offset: 3296)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "minwidth", scope: !528, file: !10, line: 155, baseType: !113, size: 32, offset: 3328)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "maxwidth", scope: !528, file: !10, line: 155, baseType: !113, size: 32, offset: 3360)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !528, file: !10, line: 156, baseType: !113, size: 32, offset: 3392)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "minheight", scope: !528, file: !10, line: 156, baseType: !113, size: 32, offset: 3424)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "maxheight", scope: !528, file: !10, line: 156, baseType: !113, size: 32, offset: 3456)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "nclass", scope: !528, file: !10, line: 157, baseType: !51, size: 16, offset: 3488)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !528, file: !10, line: 157, baseType: !51, size: 16, offset: 3504)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "compatibility", scope: !528, file: !10, line: 157, baseType: !51, size: 16, offset: 3520)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !528, file: !10, line: 160, baseType: !548, size: 64, offset: 3584)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64)
!549 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeSocketTemplate", file: !10, line: 109, baseType: !550)
!550 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocketTemplate", file: !10, line: 98, size: 1408, elements: !551)
!551 = !{!552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !703}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !550, file: !10, line: 99, baseType: !53, size: 32)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !550, file: !10, line: 99, baseType: !53, size: 32, offset: 32)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !550, file: !10, line: 100, baseType: !68, size: 512, offset: 64)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "val1", scope: !550, file: !10, line: 101, baseType: !113, size: 32, offset: 576)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !550, file: !10, line: 101, baseType: !113, size: 32, offset: 608)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "val3", scope: !550, file: !10, line: 101, baseType: !113, size: 32, offset: 640)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "val4", scope: !550, file: !10, line: 101, baseType: !113, size: 32, offset: 672)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !550, file: !10, line: 102, baseType: !113, size: 32, offset: 704)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !550, file: !10, line: 102, baseType: !113, size: 32, offset: 736)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !550, file: !10, line: 103, baseType: !53, size: 32, offset: 768)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !550, file: !10, line: 104, baseType: !53, size: 32, offset: 800)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "sock", scope: !550, file: !10, line: 107, baseType: !564, size: 64, offset: 832)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64)
!565 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocket", file: !495, line: 87, size: 2816, elements: !566)
!566 = !{!567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !688}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !565, file: !495, line: 88, baseType: !564, size: 64)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !565, file: !495, line: 88, baseType: !564, size: 64, offset: 64)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "new_sock", scope: !565, file: !495, line: 88, baseType: !564, size: 64, offset: 128)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !565, file: !495, line: 90, baseType: !57, size: 64, offset: 192)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !565, file: !495, line: 92, baseType: !68, size: 512, offset: 256)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !565, file: !495, line: 94, baseType: !68, size: 512, offset: 768)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !565, file: !495, line: 99, baseType: !22, size: 64, offset: 1280)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !565, file: !495, line: 101, baseType: !51, size: 16, offset: 1344)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !565, file: !495, line: 101, baseType: !51, size: 16, offset: 1360)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !565, file: !495, line: 102, baseType: !51, size: 16, offset: 1376)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "in_out", scope: !565, file: !495, line: 103, baseType: !51, size: 16, offset: 1392)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !565, file: !495, line: 104, baseType: !579, size: 64, offset: 1408)
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64)
!580 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeSocketType", file: !10, line: 114, size: 1600, elements: !581)
!581 = !{!582, !583, !604, !608, !612, !616, !620, !624, !625, !629, !658, !659, !660}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !580, file: !10, line: 115, baseType: !68, size: 512)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "draw", scope: !580, file: !10, line: 117, baseType: !584, size: 64, offset: 512)
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64)
!585 = !DISubroutineType(types: !586)
!586 = !{null, !587, !590, !591, !591, !602}
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 64)
!588 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !589, line: 44, flags: DIFlagFwdDecl)
!589 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64)
!592 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !589, line: 55, size: 192, elements: !593)
!593 = !{!594, !598, !601}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !592, file: !589, line: 58, baseType: !595, size: 64)
!595 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !592, file: !589, line: 56, size: 64, elements: !596)
!596 = !{!597}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !595, file: !589, line: 57, baseType: !22, size: 64)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !592, file: !589, line: 60, baseType: !599, size: 64, offset: 64)
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64)
!600 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !495, line: 335, flags: DIFlagFwdDecl)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !592, file: !589, line: 61, baseType: !22, size: 64, offset: 128)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64)
!603 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !38)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "draw_color", scope: !580, file: !10, line: 118, baseType: !605, size: 64, offset: 576)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!606 = !DISubroutineType(types: !607)
!607 = !{null, !587, !591, !591, !112}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "interface_draw", scope: !580, file: !10, line: 120, baseType: !609, size: 64, offset: 640)
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 64)
!610 = !DISubroutineType(types: !611)
!611 = !{null, !587, !590, !591}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "interface_draw_color", scope: !580, file: !10, line: 121, baseType: !613, size: 64, offset: 704)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 64)
!614 = !DISubroutineType(types: !615)
!615 = !{null, !587, !591, !112}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "interface_register_properties", scope: !580, file: !10, line: 122, baseType: !617, size: 64, offset: 768)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64)
!618 = !DISubroutineType(types: !619)
!619 = !{null, !493, !564, !599}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "interface_init_socket", scope: !580, file: !10, line: 123, baseType: !621, size: 64, offset: 832)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 64)
!622 = !DISubroutineType(types: !623)
!623 = !{null, !493, !564, !519, !564, !602}
!624 = !DIDerivedType(tag: DW_TAG_member, name: "interface_verify_socket", scope: !580, file: !10, line: 124, baseType: !621, size: 64, offset: 896)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "interface_from_socket", scope: !580, file: !10, line: 125, baseType: !626, size: 64, offset: 960)
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 64)
!627 = !DISubroutineType(types: !628)
!628 = !{null, !493, !564, !519, !564}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "ext_socket", scope: !580, file: !10, line: 128, baseType: !630, size: 256, offset: 1024)
!630 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExtensionRNA", file: !589, line: 436, baseType: !631)
!631 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ExtensionRNA", file: !589, line: 430, size: 256, elements: !632)
!632 = !{!633, !634, !637, !653}
!633 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !631, file: !589, line: 431, baseType: !22, size: 64)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "srna", scope: !631, file: !589, line: 432, baseType: !635, size: 64, offset: 64)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 64)
!636 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructRNA", file: !589, line: 417, baseType: !600)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !631, file: !589, line: 433, baseType: !638, size: 64, offset: 128)
!638 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructCallbackFunc", file: !589, line: 408, baseType: !639)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64)
!640 = !DISubroutineType(types: !641)
!641 = !{!53, !587, !591, !642, !644}
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 64)
!643 = !DICompositeType(tag: DW_TAG_structure_type, name: "FunctionRNA", file: !589, line: 38, flags: DIFlagFwdDecl)
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 64)
!645 = !DIDerivedType(tag: DW_TAG_typedef, name: "ParameterList", file: !589, line: 348, baseType: !646)
!646 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParameterList", file: !589, line: 337, size: 256, elements: !647)
!647 = !{!648, !649, !650, !651, !652}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !646, file: !589, line: 339, baseType: !22, size: 64)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !646, file: !589, line: 342, baseType: !642, size: 64, offset: 64)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_size", scope: !646, file: !589, line: 345, baseType: !53, size: 32, offset: 128)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "arg_count", scope: !646, file: !589, line: 347, baseType: !53, size: 32, offset: 160)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "ret_count", scope: !646, file: !589, line: 347, baseType: !53, size: 32, offset: 192)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !631, file: !589, line: 434, baseType: !654, size: 64, offset: 192)
!654 = !DIDerivedType(tag: DW_TAG_typedef, name: "StructFreeFunc", file: !589, line: 409, baseType: !655)
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 64)
!656 = !DISubroutineType(types: !657)
!657 = !{null, !22}
!658 = !DIDerivedType(tag: DW_TAG_member, name: "ext_interface", scope: !580, file: !10, line: 129, baseType: !630, size: 256, offset: 1280)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !580, file: !10, line: 132, baseType: !53, size: 32, offset: 1536)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !580, file: !10, line: 132, baseType: !53, size: 32, offset: 1568)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !565, file: !495, line: 105, baseType: !68, size: 512, offset: 1472)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "locx", scope: !565, file: !495, line: 107, baseType: !113, size: 32, offset: 1984)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "locy", scope: !565, file: !495, line: 107, baseType: !113, size: 32, offset: 2016)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "default_value", scope: !565, file: !495, line: 109, baseType: !22, size: 64, offset: 2048)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "stack_index", scope: !565, file: !495, line: 112, baseType: !51, size: 16, offset: 2112)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "stack_type", scope: !565, file: !495, line: 114, baseType: !51, size: 16, offset: 2128)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !565, file: !495, line: 115, baseType: !53, size: 32, offset: 2144)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !565, file: !495, line: 117, baseType: !22, size: 64, offset: 2176)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "own_index", scope: !565, file: !495, line: 122, baseType: !53, size: 32, offset: 2240)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "to_index", scope: !565, file: !495, line: 124, baseType: !53, size: 32, offset: 2272)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "groupsock", scope: !565, file: !495, line: 126, baseType: !564, size: 64, offset: 2304)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "link", scope: !565, file: !495, line: 128, baseType: !673, size: 64, offset: 2368)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64)
!674 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeLink", file: !495, line: 298, size: 448, elements: !675)
!675 = !{!676, !677, !678, !681, !682, !685, !686, !687}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !674, file: !495, line: 299, baseType: !673, size: 64)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !674, file: !495, line: 299, baseType: !673, size: 64, offset: 64)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "fromnode", scope: !674, file: !495, line: 301, baseType: !679, size: 64, offset: 128)
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 64)
!680 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNode", file: !495, line: 218, baseType: !520)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "tonode", scope: !674, file: !495, line: 301, baseType: !679, size: 64, offset: 192)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "fromsock", scope: !674, file: !495, line: 302, baseType: !683, size: 64, offset: 256)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 64)
!684 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeSocket", file: !495, line: 132, baseType: !565)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "tosock", scope: !674, file: !495, line: 302, baseType: !683, size: 64, offset: 320)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !674, file: !495, line: 304, baseType: !53, size: 32, offset: 384)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !674, file: !495, line: 305, baseType: !53, size: 32, offset: 416)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "ns", scope: !565, file: !495, line: 131, baseType: !689, size: 384, offset: 2432)
!689 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeStack", file: !495, line: 73, baseType: !690)
!690 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeStack", file: !495, line: 62, size: 384, elements: !691)
!691 = !{!692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702}
!692 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !690, file: !495, line: 63, baseType: !274, size: 128)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !690, file: !495, line: 64, baseType: !113, size: 32, offset: 128)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !690, file: !495, line: 64, baseType: !113, size: 32, offset: 160)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !690, file: !495, line: 65, baseType: !22, size: 64, offset: 192)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "hasinput", scope: !690, file: !495, line: 66, baseType: !51, size: 16, offset: 256)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "hasoutput", scope: !690, file: !495, line: 67, baseType: !51, size: 16, offset: 272)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "datatype", scope: !690, file: !495, line: 68, baseType: !51, size: 16, offset: 288)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "sockettype", scope: !690, file: !495, line: 69, baseType: !51, size: 16, offset: 304)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !690, file: !495, line: 70, baseType: !51, size: 16, offset: 320)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !690, file: !495, line: 71, baseType: !51, size: 16, offset: 336)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !690, file: !495, line: 72, baseType: !475, size: 32, offset: 352)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !550, file: !10, line: 108, baseType: !68, size: 512, offset: 896)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !528, file: !10, line: 160, baseType: !548, size: 64, offset: 3648)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "storagename", scope: !528, file: !10, line: 162, baseType: !68, size: 512, offset: 3712)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "draw_nodetype", scope: !528, file: !10, line: 165, baseType: !707, size: 64, offset: 4224)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 64)
!708 = !DISubroutineType(types: !709)
!709 = !{null, !710, !712, !1138, !493, !519, !1174}
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 64)
!711 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !588)
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 64)
!713 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ARegion", file: !714, line: 230, size: 3072, elements: !715)
!714 = !DIFile(filename: "blender/source/blender/makesdna/DNA_screen_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!715 = !{!716, !717, !718, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1137}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !713, file: !714, line: 231, baseType: !712, size: 64)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !713, file: !714, line: 231, baseType: !712, size: 64, offset: 64)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "v2d", scope: !713, file: !714, line: 233, baseType: !719, size: 1280, offset: 128)
!719 = !DIDerivedType(tag: DW_TAG_typedef, name: "View2D", file: !720, line: 71, baseType: !721)
!720 = !DIFile(filename: "blender/source/blender/makesdna/DNA_view2d_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!721 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "View2D", file: !720, line: 40, size: 1280, elements: !722)
!722 = !{!723, !731, !732, !733, !734, !735, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !758}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !721, file: !720, line: 41, baseType: !724, size: 128)
!724 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !117, line: 95, baseType: !725)
!725 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !117, line: 92, size: 128, elements: !726)
!726 = !{!727, !728, !729, !730}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !725, file: !117, line: 93, baseType: !113, size: 32)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !725, file: !117, line: 93, baseType: !113, size: 32, offset: 32)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !725, file: !117, line: 94, baseType: !113, size: 32, offset: 64)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !725, file: !117, line: 94, baseType: !113, size: 32, offset: 96)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !721, file: !720, line: 41, baseType: !724, size: 128, offset: 128)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "vert", scope: !721, file: !720, line: 42, baseType: !116, size: 128, offset: 256)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "hor", scope: !721, file: !720, line: 42, baseType: !116, size: 128, offset: 384)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !721, file: !720, line: 43, baseType: !116, size: 128, offset: 512)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !721, file: !720, line: 45, baseType: !736, size: 64, offset: 640)
!736 = !DICompositeType(tag: DW_TAG_array_type, baseType: !113, size: 64, elements: !476)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !721, file: !720, line: 45, baseType: !736, size: 64, offset: 704)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "minzoom", scope: !721, file: !720, line: 46, baseType: !113, size: 32, offset: 768)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "maxzoom", scope: !721, file: !720, line: 46, baseType: !113, size: 32, offset: 800)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "scroll", scope: !721, file: !720, line: 48, baseType: !51, size: 16, offset: 832)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "scroll_ui", scope: !721, file: !720, line: 49, baseType: !51, size: 16, offset: 848)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "keeptot", scope: !721, file: !720, line: 51, baseType: !51, size: 16, offset: 864)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "keepzoom", scope: !721, file: !720, line: 52, baseType: !51, size: 16, offset: 880)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "keepofs", scope: !721, file: !720, line: 53, baseType: !51, size: 16, offset: 896)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !721, file: !720, line: 55, baseType: !51, size: 16, offset: 912)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !721, file: !720, line: 56, baseType: !51, size: 16, offset: 928)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "winx", scope: !721, file: !720, line: 58, baseType: !51, size: 16, offset: 944)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "winy", scope: !721, file: !720, line: 58, baseType: !51, size: 16, offset: 960)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "oldwinx", scope: !721, file: !720, line: 59, baseType: !51, size: 16, offset: 976)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "oldwiny", scope: !721, file: !720, line: 59, baseType: !51, size: 16, offset: 992)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "around", scope: !721, file: !720, line: 61, baseType: !51, size: 16, offset: 1008)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "tab_offset", scope: !721, file: !720, line: 63, baseType: !112, size: 64, offset: 1024)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "tab_num", scope: !721, file: !720, line: 64, baseType: !53, size: 32, offset: 1088)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "tab_cur", scope: !721, file: !720, line: 65, baseType: !53, size: 32, offset: 1120)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "sms", scope: !721, file: !720, line: 68, baseType: !756, size: 64, offset: 1152)
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !757, size: 64)
!757 = !DICompositeType(tag: DW_TAG_structure_type, name: "SmoothView2DStore", file: !720, line: 68, flags: DIFlagFwdDecl)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "smooth_timer", scope: !721, file: !720, line: 69, baseType: !759, size: 64, offset: 1216)
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !760, size: 64)
!760 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTimer", file: !761, line: 490, size: 768, elements: !762)
!761 = !DIFile(filename: "blender/source/blender/windowmanager/WM_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!762 = !{!763, !764, !765, !887, !888, !889, !890, !891, !892, !893, !894, !895}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !760, file: !761, line: 491, baseType: !759, size: 64)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !760, file: !761, line: 491, baseType: !759, size: 64, offset: 64)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "win", scope: !760, file: !761, line: 493, baseType: !766, size: 64, offset: 128)
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64)
!767 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindow", file: !768, line: 169, size: 2048, elements: !769)
!768 = !DIFile(filename: "blender/source/blender/makesdna/DNA_windowmanager_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!769 = !{!770, !771, !772, !773, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !862, !865, !879, !880, !881, !882, !883, !884, !885, !886}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !767, file: !768, line: 170, baseType: !766, size: 64)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !767, file: !768, line: 170, baseType: !766, size: 64, offset: 64)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "ghostwin", scope: !767, file: !768, line: 172, baseType: !22, size: 64, offset: 128)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !767, file: !768, line: 174, baseType: !774, size: 64, offset: 192)
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 64)
!775 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !714, line: 49, size: 1984, elements: !776)
!776 = !{!777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799}
!777 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !775, file: !714, line: 50, baseType: !17, size: 960)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "vertbase", scope: !775, file: !714, line: 52, baseType: !78, size: 128, offset: 960)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "edgebase", scope: !775, file: !714, line: 53, baseType: !78, size: 128, offset: 1088)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "areabase", scope: !775, file: !714, line: 54, baseType: !78, size: 128, offset: 1216)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !775, file: !714, line: 55, baseType: !78, size: 128, offset: 1344)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !775, file: !714, line: 57, baseType: !387, size: 64, offset: 1472)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "newscene", scope: !775, file: !714, line: 58, baseType: !387, size: 64, offset: 1536)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "redraws_flag", scope: !775, file: !714, line: 60, baseType: !53, size: 32, offset: 1600)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !775, file: !714, line: 61, baseType: !53, size: 32, offset: 1632)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !775, file: !714, line: 63, baseType: !51, size: 16, offset: 1664)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !775, file: !714, line: 64, baseType: !51, size: 16, offset: 1680)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "winid", scope: !775, file: !714, line: 65, baseType: !51, size: 16, offset: 1696)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "do_draw", scope: !775, file: !714, line: 66, baseType: !51, size: 16, offset: 1712)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "do_refresh", scope: !775, file: !714, line: 67, baseType: !51, size: 16, offset: 1728)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "do_draw_gesture", scope: !775, file: !714, line: 68, baseType: !51, size: 16, offset: 1744)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "do_draw_paintcursor", scope: !775, file: !714, line: 69, baseType: !51, size: 16, offset: 1760)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "do_draw_drag", scope: !775, file: !714, line: 70, baseType: !51, size: 16, offset: 1776)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "swap", scope: !775, file: !714, line: 71, baseType: !51, size: 16, offset: 1792)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "mainwin", scope: !775, file: !714, line: 73, baseType: !51, size: 16, offset: 1808)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "subwinactive", scope: !775, file: !714, line: 74, baseType: !51, size: 16, offset: 1824)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !775, file: !714, line: 76, baseType: !51, size: 16, offset: 1840)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "animtimer", scope: !775, file: !714, line: 78, baseType: !759, size: 64, offset: 1856)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !775, file: !714, line: 79, baseType: !22, size: 64, offset: 1920)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "newscreen", scope: !767, file: !768, line: 175, baseType: !774, size: 64, offset: 256)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "screenname", scope: !767, file: !768, line: 176, baseType: !68, size: 512, offset: 320)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "posx", scope: !767, file: !768, line: 178, baseType: !51, size: 16, offset: 832)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "posy", scope: !767, file: !768, line: 178, baseType: !51, size: 16, offset: 848)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "sizex", scope: !767, file: !768, line: 178, baseType: !51, size: 16, offset: 864)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "sizey", scope: !767, file: !768, line: 178, baseType: !51, size: 16, offset: 880)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "windowstate", scope: !767, file: !768, line: 179, baseType: !51, size: 16, offset: 896)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "monitor", scope: !767, file: !768, line: 180, baseType: !51, size: 16, offset: 912)
