; ModuleID = 'blender/source/blender/editors/space_info/info_report.c'
source_filename = "blender/source/blender/editors/space_info/info_report.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.SpaceInfo = type { %struct.SpaceLink*, %struct.SpaceLink*, %struct.ListBase, i32, float, [8 x i16], i8, [7 x i8] }
%struct.SpaceLink = type { %struct.SpaceLink*, %struct.SpaceLink*, %struct.ListBase, i32, float, [8 x i16] }
%struct.ListBase = type { i8*, i8* }
%struct.wmOperatorType = type { i8*, i8*, i8*, i8*, i32 (%struct.bContext*, %struct.wmOperator*)*, i8 (%struct.bContext*, %struct.wmOperator*)*, i32 (%struct.bContext*, %struct.wmOperator*, %struct.wmEvent*)*, void (%struct.bContext*, %struct.wmOperator*)*, i32 (%struct.bContext*, %struct.wmOperator*, %struct.wmEvent*)*, i32 (%struct.bContext*)*, void (%struct.bContext*, %struct.wmOperator*)*, %struct.StructRNA*, %struct.IDProperty*, %struct.PropertyRNA*, %struct.ListBase, %struct.wmKeyMap*, i8*, i32 (%struct.bContext*, %struct.wmOperatorType*)*, %struct.ExtensionRNA, i16 }
%struct.bContext = type opaque
%struct.wmOperator = type { %struct.wmOperator*, %struct.wmOperator*, [64 x i8], %struct.IDProperty*, %struct.wmOperatorType*, i8*, i8*, %struct.PointerRNA*, %struct.ReportList*, %struct.ListBase, %struct.wmOperator*, %struct.uiLayout*, i16, [3 x i16] }
%struct.PointerRNA = type { %struct.anon, %struct.StructRNA*, i8* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !38, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "blender/source/blender/editors/space_info/info_report.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!2 = !{!3, !16, !24}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ReportType", file: !4, line: 67, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "blender/source/blender/makesdna/DNA_windowmanager_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9, !10, !11, !12, !13, !14, !15}
!7 = !DIEnumerator(name: "RPT_DEBUG", value: 1, isUnsigned: true)
!8 = !DIEnumerator(name: "RPT_INFO", value: 2, isUnsigned: true)
!9 = !DIEnumerator(name: "RPT_OPERATOR", value: 4, isUnsigned: true)
!10 = !DIEnumerator(name: "RPT_PROPERTY", value: 8, isUnsigned: true)
!11 = !DIEnumerator(name: "RPT_WARNING", value: 16, isUnsigned: true)
!12 = !DIEnumerator(name: "RPT_ERROR", value: 32, isUnsigned: true)
!13 = !DIEnumerator(name: "RPT_ERROR_INVALID_INPUT", value: 64, isUnsigned: true)
!14 = !DIEnumerator(name: "RPT_ERROR_INVALID_CONTEXT", value: 128, isUnsigned: true)
!15 = !DIEnumerator(name: "RPT_ERROR_OUT_OF_MEMORY", value: 256, isUnsigned: true)
!16 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 351, baseType: !5, size: 32, elements: !17)
!17 = !{!18, !19, !20, !21, !22, !23}
!18 = !DIEnumerator(name: "OPERATOR_RUNNING_MODAL", value: 1, isUnsigned: true)
!19 = !DIEnumerator(name: "OPERATOR_CANCELLED", value: 2, isUnsigned: true)
!20 = !DIEnumerator(name: "OPERATOR_FINISHED", value: 4, isUnsigned: true)
!21 = !DIEnumerator(name: "OPERATOR_PASS_THROUGH", value: 8, isUnsigned: true)
!22 = !DIEnumerator(name: "OPERATOR_HANDLED", value: 16, isUnsigned: true)
!23 = !DIEnumerator(name: "OPERATOR_INTERFACE", value: 32, isUnsigned: true)
!24 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 394, baseType: !5, size: 32, elements: !26)
!25 = !DIFile(filename: "blender/source/blender/windowmanager/wm_event_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!26 = !{!27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37}
!27 = !DIEnumerator(name: "GESTURE_MODAL_CANCEL", value: 1, isUnsigned: true)
!28 = !DIEnumerator(name: "GESTURE_MODAL_CONFIRM", value: 2, isUnsigned: true)
!29 = !DIEnumerator(name: "GESTURE_MODAL_SELECT", value: 3, isUnsigned: true)
!30 = !DIEnumerator(name: "GESTURE_MODAL_DESELECT", value: 4, isUnsigned: true)
!31 = !DIEnumerator(name: "GESTURE_MODAL_NOP", value: 5, isUnsigned: true)
!32 = !DIEnumerator(name: "GESTURE_MODAL_CIRCLE_ADD", value: 6, isUnsigned: true)
!33 = !DIEnumerator(name: "GESTURE_MODAL_CIRCLE_SUB", value: 7, isUnsigned: true)
!34 = !DIEnumerator(name: "GESTURE_MODAL_BEGIN", value: 8, isUnsigned: true)
!35 = !DIEnumerator(name: "GESTURE_MODAL_IN", value: 9, isUnsigned: true)
!36 = !DIEnumerator(name: "GESTURE_MODAL_OUT", value: 10, isUnsigned: true)
!37 = !DIEnumerator(name: "GESTURE_MODAL_CIRCLE_SIZE", value: 11, isUnsigned: true)
!38 = !{!39}
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!40 = !{i32 7, !"Dwarf Version", i32 4}
!41 = !{i32 2, !"Debug Info Version", i32 3}
!42 = !{i32 1, !"wchar_size", i32 4}
!43 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!44 = distinct !DISubprogram(name: "info_report_mask", scope: !1, file: !1, line: 50, type: !45, scopeLine: 51, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !87)
!45 = !DISubroutineType(types: !46)
!46 = !{!47, !48}
!47 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "SpaceInfo", file: !50, line: 106, baseType: !51)
!50 = !DIFile(filename: "blender/source/blender/makesdna/DNA_space_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!51 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceInfo", file: !50, line: 97, size: 512, elements: !52)
!52 = !{!53, !76, !77, !78, !79, !80, !81, !83}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !51, file: !50, line: 98, baseType: !54, size: 64)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "SpaceLink", file: !50, line: 91, baseType: !56)
!56 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SpaceLink", file: !50, line: 85, size: 448, elements: !57)
!57 = !{!58, !60, !61, !68, !69, !71}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !56, file: !50, line: 86, baseType: !59, size: 64)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !56, file: !50, line: 86, baseType: !59, size: 64, offset: 64)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !56, file: !50, line: 87, baseType: !62, size: 128, offset: 128)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !63, line: 71, baseType: !64)
!63 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!64 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !63, line: 69, size: 128, elements: !65)
!65 = !{!66, !67}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !64, file: !63, line: 70, baseType: !39, size: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !64, file: !63, line: 70, baseType: !39, size: 64, offset: 64)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "spacetype", scope: !56, file: !50, line: 88, baseType: !47, size: 32, offset: 256)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "blockscale", scope: !56, file: !50, line: 89, baseType: !70, size: 32, offset: 288)
!70 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "blockhandler", scope: !56, file: !50, line: 90, baseType: !72, size: 128, offset: 320)
!72 = !DICompositeType(tag: DW_TAG_array_type, baseType: !73, size: 128, elements: !74)
!73 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!74 = !{!75}
!75 = !DISubrange(count: 8)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !51, file: !50, line: 98, baseType: !54, size: 64, offset: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !51, file: !50, line: 99, baseType: !62, size: 128, offset: 128)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "spacetype", scope: !51, file: !50, line: 100, baseType: !47, size: 32, offset: 256)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "blockscale", scope: !51, file: !50, line: 101, baseType: !70, size: 32, offset: 288)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "blockhandler", scope: !51, file: !50, line: 102, baseType: !72, size: 128, offset: 320)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "rpt_mask", scope: !51, file: !50, line: 104, baseType: !82, size: 8, offset: 448)
!82 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !51, file: !50, line: 105, baseType: !84, size: 56, offset: 456)
!84 = !DICompositeType(tag: DW_TAG_array_type, baseType: !82, size: 56, elements: !85)
!85 = !{!86}
!86 = !DISubrange(count: 7)
!87 = !{}
!88 = !DILocalVariable(name: "UNUSED_sinfo", arg: 1, scope: !44, file: !1, line: 50, type: !48)
!89 = !DILocation(line: 50, column: 33, scope: !44)
!90 = !DILocation(line: 64, column: 2, scope: !44)
!91 = distinct !DISubprogram(name: "INFO_OT_report_replay", scope: !1, file: !1, line: 97, type: !92, scopeLine: 98, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !87)
!92 = !DISubroutineType(types: !93)
!93 = !{null, !94}
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "wmOperatorType", file: !96, line: 568, baseType: !97)
!96 = !DIFile(filename: "blender/source/blender/windowmanager/WM_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!97 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmOperatorType", file: !96, line: 508, size: 1536, elements: !98)
!98 = !{!99, !102, !103, !104, !105, !1536, !1540, !1546, !1550, !1551, !1555, !1556, !1557, !1558, !1562, !1563, !1578, !1579, !1583, !1609}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !97, file: !96, line: 509, baseType: !100, size: 64)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !82)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !97, file: !96, line: 510, baseType: !100, size: 64, offset: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "translation_context", scope: !97, file: !96, line: 511, baseType: !100, size: 64, offset: 128)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !97, file: !96, line: 512, baseType: !100, size: 64, offset: 192)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !97, file: !96, line: 518, baseType: !106, size: 64, offset: 256)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = !DISubroutineType(types: !108)
!108 = !{!47, !109, !112}
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !111, line: 44, flags: DIFlagFwdDecl)
!111 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmOperator", file: !4, line: 328, size: 1344, elements: !114)
!114 = !{!115, !116, !117, !121, !145, !147, !148, !149, !161, !1529, !1530, !1531, !1534, !1535}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !113, file: !4, line: 329, baseType: !112, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !113, file: !4, line: 329, baseType: !112, size: 64, offset: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !113, file: !4, line: 332, baseType: !118, size: 512, offset: 128)
!118 = !DICompositeType(tag: DW_TAG_array_type, baseType: !82, size: 512, elements: !119)
!119 = !{!120}
!120 = !DISubrange(count: 64)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !113, file: !4, line: 333, baseType: !122, size: 64, offset: 640)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !124, line: 75, baseType: !125)
!124 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !124, line: 62, size: 1024, elements: !126)
!126 = !{!127, !129, !130, !131, !132, !133, !134, !135, !143, !144}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !125, file: !124, line: 63, baseType: !128, size: 64)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !125, file: !124, line: 63, baseType: !128, size: 64, offset: 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !125, file: !124, line: 64, baseType: !82, size: 8, offset: 128)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !125, file: !124, line: 64, baseType: !82, size: 8, offset: 136)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !125, file: !124, line: 65, baseType: !73, size: 16, offset: 144)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !125, file: !124, line: 66, baseType: !118, size: 512, offset: 160)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !125, file: !124, line: 67, baseType: !47, size: 32, offset: 672)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !125, file: !124, line: 69, baseType: !136, size: 256, offset: 704)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !124, line: 60, baseType: !137)
!137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !124, line: 48, size: 256, elements: !138)
!138 = !{!139, !140, !141, !142}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !137, file: !124, line: 49, baseType: !39, size: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !137, file: !124, line: 58, baseType: !62, size: 128, offset: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !137, file: !124, line: 59, baseType: !47, size: 32, offset: 192)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !137, file: !124, line: 59, baseType: !47, size: 32, offset: 224)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !125, file: !124, line: 70, baseType: !47, size: 32, offset: 960)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !125, file: !124, line: 74, baseType: !47, size: 32, offset: 992)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !113, file: !4, line: 336, baseType: !146, size: 64, offset: 704)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !113, file: !4, line: 337, baseType: !39, size: 64, offset: 768)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "py_instance", scope: !113, file: !4, line: 338, baseType: !39, size: 64, offset: 832)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !113, file: !4, line: 340, baseType: !150, size: 64, offset: 896)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !111, line: 55, size: 192, elements: !152)
!152 = !{!153, !157, !160}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !151, file: !111, line: 58, baseType: !154, size: 64)
!154 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !151, file: !111, line: 56, size: 64, elements: !155)
!155 = !{!156}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !154, file: !111, line: 57, baseType: !39, size: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !151, file: !111, line: 60, baseType: !158, size: 64, offset: 64)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !111, line: 41, flags: DIFlagFwdDecl)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !151, file: !111, line: 61, baseType: !39, size: 64, offset: 128)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "reports", scope: !113, file: !4, line: 341, baseType: !162, size: 64, offset: 960)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ReportList", file: !4, line: 106, size: 320, elements: !164)
!164 = !{!165, !166, !167, !168, !169, !170}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !163, file: !4, line: 107, baseType: !62, size: 128)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "printlevel", scope: !163, file: !4, line: 108, baseType: !47, size: 32, offset: 128)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "storelevel", scope: !163, file: !4, line: 109, baseType: !47, size: 32, offset: 160)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !163, file: !4, line: 110, baseType: !47, size: 32, offset: 192)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !163, file: !4, line: 110, baseType: !47, size: 32, offset: 224)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "reporttimer", scope: !163, file: !4, line: 111, baseType: !171, size: 64, offset: 256)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!172 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTimer", file: !96, line: 490, size: 768, elements: !173)
!173 = !{!174, !175, !176, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !172, file: !96, line: 491, baseType: !171, size: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !172, file: !96, line: 491, baseType: !171, size: 64, offset: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "win", scope: !172, file: !96, line: 493, baseType: !177, size: 64, offset: 128)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!178 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindow", file: !4, line: 169, size: 2048, elements: !179)
!179 = !{!180, !181, !182, !183, !1437, !1438, !1439, !1440, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1495, !1498, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !178, file: !4, line: 170, baseType: !177, size: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !178, file: !4, line: 170, baseType: !177, size: 64, offset: 64)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "ghostwin", scope: !178, file: !4, line: 172, baseType: !39, size: 64, offset: 128)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !178, file: !4, line: 174, baseType: !184, size: 64, offset: 192)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !186, line: 49, size: 1984, elements: !187)
!186 = !DIFile(filename: "blender/source/blender/makesdna/DNA_screen_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!187 = !{!188, !224, !225, !226, !227, !228, !1420, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !185, file: !186, line: 50, baseType: !189, size: 960)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !124, line: 130, baseType: !190)
!190 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !124, line: 117, size: 960, elements: !191)
!191 = !{!192, !193, !194, !196, !215, !219, !220, !221, !222, !223}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !190, file: !124, line: 118, baseType: !39, size: 64)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !190, file: !124, line: 118, baseType: !39, size: 64, offset: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !190, file: !124, line: 119, baseType: !195, size: 64, offset: 128)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !190, file: !124, line: 120, baseType: !197, size: 64, offset: 192)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !124, line: 136, size: 17600, elements: !199)
!199 = !{!200, !201, !203, !206, !210, !211, !212}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !198, file: !124, line: 137, baseType: !189, size: 960)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !198, file: !124, line: 138, baseType: !202, size: 64, offset: 960)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !198, file: !124, line: 139, baseType: !204, size: 64, offset: 1024)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!205 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !124, line: 43, flags: DIFlagFwdDecl)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !198, file: !124, line: 140, baseType: !207, size: 8192, offset: 1088)
!207 = !DICompositeType(tag: DW_TAG_array_type, baseType: !82, size: 8192, elements: !208)
!208 = !{!209}
!209 = !DISubrange(count: 1024)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !198, file: !124, line: 141, baseType: !207, size: 8192, offset: 9280)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !198, file: !124, line: 148, baseType: !197, size: 64, offset: 17472)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !198, file: !124, line: 150, baseType: !213, size: 64, offset: 17536)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !124, line: 45, flags: DIFlagFwdDecl)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !190, file: !124, line: 121, baseType: !216, size: 528, offset: 256)
!216 = !DICompositeType(tag: DW_TAG_array_type, baseType: !82, size: 528, elements: !217)
!217 = !{!218}
!218 = !DISubrange(count: 66)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !190, file: !124, line: 126, baseType: !73, size: 16, offset: 784)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !190, file: !124, line: 127, baseType: !47, size: 32, offset: 800)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !190, file: !124, line: 128, baseType: !47, size: 32, offset: 832)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !190, file: !124, line: 128, baseType: !47, size: 32, offset: 864)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !190, file: !124, line: 129, baseType: !122, size: 64, offset: 896)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "vertbase", scope: !185, file: !186, line: 52, baseType: !62, size: 128, offset: 960)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "edgebase", scope: !185, file: !186, line: 53, baseType: !62, size: 128, offset: 1088)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "areabase", scope: !185, file: !186, line: 54, baseType: !62, size: 128, offset: 1216)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !185, file: !186, line: 55, baseType: !62, size: 128, offset: 1344)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !185, file: !186, line: 57, baseType: !229, size: 64, offset: 1472)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!230 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !231, line: 1216, size: 39680, elements: !232)
!231 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!232 = !{!233, !234, !238, !242, !245, !246, !247, !259, !260, !264, !265, !266, !267, !268, !269, !270, !271, !272, !276, !354, !784, !999, !1002, !1290, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1309, !1312, !1313, !1314, !1315, !1316, !1324, !1391, !1398, !1399, !1406, !1407, !1413, !1414, !1415, !1416, !1417}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !230, file: !231, line: 1217, baseType: !189, size: 960)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !230, file: !231, line: 1218, baseType: !235, size: 64, offset: 960)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!236 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !237, line: 43, flags: DIFlagFwdDecl)
!237 = !DIFile(filename: "blender/source/blender/makesdna/DNA_movieclip_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!238 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !230, file: !231, line: 1220, baseType: !239, size: 64, offset: 1024)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!240 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !241, line: 44, flags: DIFlagFwdDecl)
!241 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_context.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!242 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !230, file: !231, line: 1221, baseType: !243, size: 64, offset: 1088)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!244 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !231, line: 52, flags: DIFlagFwdDecl)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !230, file: !231, line: 1223, baseType: !229, size: 64, offset: 1152)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !230, file: !231, line: 1225, baseType: !62, size: 128, offset: 1216)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !230, file: !231, line: 1226, baseType: !248, size: 64, offset: 1344)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!249 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !231, line: 69, size: 320, elements: !250)
!250 = !{!251, !252, !253, !254, !255, !256, !257, !258}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !249, file: !231, line: 70, baseType: !248, size: 64)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !249, file: !231, line: 70, baseType: !248, size: 64, offset: 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !249, file: !231, line: 71, baseType: !5, size: 32, offset: 128)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !249, file: !231, line: 71, baseType: !5, size: 32, offset: 160)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !249, file: !231, line: 72, baseType: !47, size: 32, offset: 192)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !249, file: !231, line: 73, baseType: !73, size: 16, offset: 224)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !249, file: !231, line: 73, baseType: !73, size: 16, offset: 240)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !249, file: !231, line: 74, baseType: !239, size: 64, offset: 256)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !230, file: !231, line: 1227, baseType: !239, size: 64, offset: 1408)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !230, file: !231, line: 1229, baseType: !261, size: 96, offset: 1472)
!261 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 96, elements: !262)
!262 = !{!263}
!263 = !DISubrange(count: 3)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !230, file: !231, line: 1230, baseType: !261, size: 96, offset: 1568)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !230, file: !231, line: 1231, baseType: !261, size: 96, offset: 1664)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !230, file: !231, line: 1231, baseType: !261, size: 96, offset: 1760)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !230, file: !231, line: 1233, baseType: !5, size: 32, offset: 1856)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !230, file: !231, line: 1234, baseType: !47, size: 32, offset: 1888)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !230, file: !231, line: 1235, baseType: !5, size: 32, offset: 1920)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !230, file: !231, line: 1237, baseType: !73, size: 16, offset: 1952)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !230, file: !231, line: 1239, baseType: !82, size: 8, offset: 1968)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !230, file: !231, line: 1240, baseType: !273, size: 8, offset: 1976)
!273 = !DICompositeType(tag: DW_TAG_array_type, baseType: !82, size: 8, elements: !274)
!274 = !{!275}
!275 = !DISubrange(count: 1)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !230, file: !231, line: 1242, baseType: !277, size: 64, offset: 1984)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!278 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !279, line: 328, size: 3456, elements: !280)
!279 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!280 = !{!281, !282, !283, !286, !287, !288, !292, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !319, !320, !321, !324, !329, !330, !333, !337, !342, !346, !350, !351, !352, !353}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !278, file: !279, line: 329, baseType: !189, size: 960)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !278, file: !279, line: 330, baseType: !235, size: 64, offset: 960)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !278, file: !279, line: 332, baseType: !284, size: 64, offset: 1024)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64)
!285 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !279, line: 332, flags: DIFlagFwdDecl)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !278, file: !279, line: 333, baseType: !118, size: 512, offset: 1088)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "interface_type", scope: !278, file: !279, line: 335, baseType: !158, size: 64, offset: 1600)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !278, file: !279, line: 337, baseType: !289, size: 64, offset: 1664)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64)
!290 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !291, line: 45, flags: DIFlagFwdDecl)
!291 = !DIFile(filename: "blender/source/blender/makesdna/DNA_tracking_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!292 = !DIDerivedType(tag: DW_TAG_member, name: "view_center", scope: !278, file: !279, line: 338, baseType: !293, size: 64, offset: 1728)
!293 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 64, elements: !294)
!294 = !{!295}
!295 = !DISubrange(count: 2)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !278, file: !279, line: 340, baseType: !62, size: 128, offset: 1792)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !278, file: !279, line: 340, baseType: !62, size: 128, offset: 1920)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !278, file: !279, line: 342, baseType: !47, size: 32, offset: 2048)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !278, file: !279, line: 342, baseType: !47, size: 32, offset: 2080)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "cur_index", scope: !278, file: !279, line: 343, baseType: !47, size: 32, offset: 2112)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !278, file: !279, line: 345, baseType: !47, size: 32, offset: 2144)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !278, file: !279, line: 346, baseType: !47, size: 32, offset: 2176)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "is_updating", scope: !278, file: !279, line: 347, baseType: !73, size: 16, offset: 2208)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !278, file: !279, line: 348, baseType: !73, size: 16, offset: 2224)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !278, file: !279, line: 349, baseType: !47, size: 32, offset: 2240)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "nodetype", scope: !278, file: !279, line: 351, baseType: !47, size: 32, offset: 2272)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "edit_quality", scope: !278, file: !279, line: 353, baseType: !73, size: 16, offset: 2304)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "render_quality", scope: !278, file: !279, line: 354, baseType: !73, size: 16, offset: 2320)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "chunksize", scope: !278, file: !279, line: 355, baseType: !47, size: 32, offset: 2336)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "viewer_border", scope: !278, file: !279, line: 357, baseType: !311, size: 128, offset: 2368)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !312, line: 95, baseType: !313)
!312 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!313 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !312, line: 92, size: 128, elements: !314)
!314 = !{!315, !316, !317, !318}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !313, file: !312, line: 93, baseType: !70, size: 32)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !313, file: !312, line: 93, baseType: !70, size: 32, offset: 32)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !313, file: !312, line: 94, baseType: !70, size: 32, offset: 64)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !313, file: !312, line: 94, baseType: !70, size: 32, offset: 96)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !278, file: !279, line: 363, baseType: !62, size: 128, offset: 2496)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !278, file: !279, line: 363, baseType: !62, size: 128, offset: 2624)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "previews", scope: !278, file: !279, line: 368, baseType: !322, size: 64, offset: 2752)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!323 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHash", file: !279, line: 48, flags: DIFlagFwdDecl)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "active_viewer_key", scope: !278, file: !279, line: 372, baseType: !325, size: 32, offset: 2816)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !279, line: 274, baseType: !326)
!326 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !279, line: 271, size: 32, elements: !327)
!327 = !{!328}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !326, file: !279, line: 273, baseType: !5, size: 32)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !278, file: !279, line: 373, baseType: !47, size: 32, offset: 2848)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "execdata", scope: !278, file: !279, line: 382, baseType: !331, size: 64, offset: 2880)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!332 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeExec", file: !279, line: 46, flags: DIFlagFwdDecl)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !278, file: !279, line: 385, baseType: !334, size: 64, offset: 2944)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64)
!335 = !DISubroutineType(types: !336)
!336 = !{null, !39, !70}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "stats_draw", scope: !278, file: !279, line: 386, baseType: !338, size: 64, offset: 3008)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!339 = !DISubroutineType(types: !340)
!340 = !{null, !39, !341}
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "test_break", scope: !278, file: !279, line: 387, baseType: !343, size: 64, offset: 3072)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!344 = !DISubroutineType(types: !345)
!345 = !{!47, !39}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "update_draw", scope: !278, file: !279, line: 388, baseType: !347, size: 64, offset: 3136)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!348 = !DISubroutineType(types: !349)
!349 = !{null, !39}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "tbh", scope: !278, file: !279, line: 389, baseType: !39, size: 64, offset: 3200)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "prh", scope: !278, file: !279, line: 389, baseType: !39, size: 64, offset: 3264)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "sdh", scope: !278, file: !279, line: 389, baseType: !39, size: 64, offset: 3328)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "udh", scope: !278, file: !279, line: 389, baseType: !39, size: 64, offset: 3392)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !230, file: !231, line: 1244, baseType: !355, size: 64, offset: 2048)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!356 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !357, line: 200, size: 17024, elements: !358)
!357 = !DIFile(filename: "blender/source/blender/makesdna/DNA_sequence_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!358 = !{!359, !361, !362, !363, !777, !778, !779, !780, !781, !782, !783}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "seqbasep", scope: !356, file: !357, line: 201, baseType: !360, size: 64)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !356, file: !357, line: 202, baseType: !62, size: 128, offset: 64)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "metastack", scope: !356, file: !357, line: 203, baseType: !62, size: 128, offset: 192)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "act_seq", scope: !356, file: !357, line: 206, baseType: !364, size: 64, offset: 320)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sequence", file: !357, line: 190, baseType: !366)
!366 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sequence", file: !357, line: 126, size: 2816, elements: !367)
!367 = !{!368, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !467, !470, !471, !472, !749, !752, !753, !754, !755, !756, !757, !758, !759, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !776}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !366, file: !357, line: 127, baseType: !369, size: 64)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !366, file: !357, line: 127, baseType: !369, size: 64, offset: 64)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !366, file: !357, line: 128, baseType: !39, size: 64, offset: 128)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !366, file: !357, line: 129, baseType: !39, size: 64, offset: 192)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !366, file: !357, line: 130, baseType: !118, size: 512, offset: 256)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !366, file: !357, line: 132, baseType: !47, size: 32, offset: 768)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !366, file: !357, line: 132, baseType: !47, size: 32, offset: 800)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !366, file: !357, line: 133, baseType: !47, size: 32, offset: 832)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !366, file: !357, line: 134, baseType: !47, size: 32, offset: 864)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "startofs", scope: !366, file: !357, line: 134, baseType: !47, size: 32, offset: 896)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "endofs", scope: !366, file: !357, line: 134, baseType: !47, size: 32, offset: 928)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !366, file: !357, line: 135, baseType: !47, size: 32, offset: 960)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !366, file: !357, line: 135, baseType: !47, size: 32, offset: 992)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !366, file: !357, line: 136, baseType: !47, size: 32, offset: 1024)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !366, file: !357, line: 136, baseType: !47, size: 32, offset: 1056)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "startdisp", scope: !366, file: !357, line: 137, baseType: !47, size: 32, offset: 1088)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "enddisp", scope: !366, file: !357, line: 137, baseType: !47, size: 32, offset: 1120)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "sat", scope: !366, file: !357, line: 138, baseType: !70, size: 32, offset: 1152)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "mul", scope: !366, file: !357, line: 139, baseType: !70, size: 32, offset: 1184)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "handsize", scope: !366, file: !357, line: 139, baseType: !70, size: 32, offset: 1216)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "anim_preseek", scope: !366, file: !357, line: 141, baseType: !73, size: 16, offset: 1248)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "streamindex", scope: !366, file: !357, line: 142, baseType: !73, size: 16, offset: 1264)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "multicam_source", scope: !366, file: !357, line: 143, baseType: !47, size: 32, offset: 1280)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "clip_flag", scope: !366, file: !357, line: 144, baseType: !47, size: 32, offset: 1312)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "strip", scope: !366, file: !357, line: 146, baseType: !394, size: 64, offset: 1344)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "Strip", file: !357, line: 114, baseType: !396)
!396 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Strip", file: !357, line: 99, size: 7232, elements: !397)
!397 = !{!398, !400, !401, !402, !403, !404, !405, !416, !420, !435, !444, !451, !461}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !396, file: !357, line: 100, baseType: !399, size: 64)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !396, file: !357, line: 100, baseType: !399, size: 64, offset: 64)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !396, file: !357, line: 101, baseType: !47, size: 32, offset: 128)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !396, file: !357, line: 101, baseType: !47, size: 32, offset: 160)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !396, file: !357, line: 102, baseType: !47, size: 32, offset: 192)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !396, file: !357, line: 102, baseType: !47, size: 32, offset: 224)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "stripdata", scope: !396, file: !357, line: 103, baseType: !406, size: 64, offset: 256)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripElem", file: !357, line: 59, baseType: !408)
!408 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripElem", file: !357, line: 56, size: 2112, elements: !409)
!409 = !{!410, !414, !415}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !408, file: !357, line: 57, baseType: !411, size: 2048)
!411 = !DICompositeType(tag: DW_TAG_array_type, baseType: !82, size: 2048, elements: !412)
!412 = !{!413}
!413 = !DISubrange(count: 256)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "orig_width", scope: !408, file: !357, line: 58, baseType: !47, size: 32, offset: 2048)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "orig_height", scope: !408, file: !357, line: 58, baseType: !47, size: 32, offset: 2080)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !396, file: !357, line: 106, baseType: !417, size: 6144, offset: 320)
!417 = !DICompositeType(tag: DW_TAG_array_type, baseType: !82, size: 6144, elements: !418)
!418 = !{!419}
!419 = !DISubrange(count: 768)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !396, file: !357, line: 107, baseType: !421, size: 64, offset: 6464)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripProxy", file: !357, line: 97, baseType: !423)
!423 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripProxy", file: !357, line: 83, size: 8320, elements: !424)
!424 = !{!425, !426, !427, !431, !432, !433, !434}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !423, file: !357, line: 84, baseType: !417, size: 6144)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !423, file: !357, line: 87, baseType: !411, size: 2048, offset: 6144)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !423, file: !357, line: 88, baseType: !428, size: 64, offset: 8192)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!429 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !430, line: 41, flags: DIFlagFwdDecl)
!430 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!431 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !423, file: !357, line: 90, baseType: !73, size: 16, offset: 8256)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !423, file: !357, line: 92, baseType: !73, size: 16, offset: 8272)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flags", scope: !423, file: !357, line: 93, baseType: !73, size: 16, offset: 8288)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flags", scope: !423, file: !357, line: 95, baseType: !73, size: 16, offset: 8304)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !396, file: !357, line: 108, baseType: !436, size: 64, offset: 6528)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!437 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripCrop", file: !357, line: 66, baseType: !438)
!438 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripCrop", file: !357, line: 61, size: 128, elements: !439)
!439 = !{!440, !441, !442, !443}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !438, file: !357, line: 62, baseType: !47, size: 32)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !438, file: !357, line: 63, baseType: !47, size: 32, offset: 32)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !438, file: !357, line: 64, baseType: !47, size: 32, offset: 64)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !438, file: !357, line: 65, baseType: !47, size: 32, offset: 96)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !396, file: !357, line: 109, baseType: !445, size: 64, offset: 6592)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64)
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripTransform", file: !357, line: 71, baseType: !447)
!447 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripTransform", file: !357, line: 68, size: 64, elements: !448)
!448 = !{!449, !450}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "xofs", scope: !447, file: !357, line: 69, baseType: !47, size: 32)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "yofs", scope: !447, file: !357, line: 70, baseType: !47, size: 32, offset: 32)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "color_balance", scope: !396, file: !357, line: 110, baseType: !452, size: 64, offset: 6656)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64)
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripColorBalance", file: !357, line: 81, baseType: !454)
!454 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripColorBalance", file: !357, line: 73, size: 352, elements: !455)
!455 = !{!456, !457, !458, !459, !460}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "lift", scope: !454, file: !357, line: 74, baseType: !261, size: 96)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !454, file: !357, line: 75, baseType: !261, size: 96, offset: 96)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "gain", scope: !454, file: !357, line: 76, baseType: !261, size: 96, offset: 192)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !454, file: !357, line: 77, baseType: !47, size: 32, offset: 288)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !454, file: !357, line: 78, baseType: !47, size: 32, offset: 320)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !396, file: !357, line: 113, baseType: !462, size: 512, offset: 6720)
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !463, line: 182, baseType: !464)
!463 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!464 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !463, line: 180, size: 512, elements: !465)
!465 = !{!466}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !464, file: !463, line: 181, baseType: !118, size: 512)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !366, file: !357, line: 148, baseType: !468, size: 64, offset: 1408)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64)
!469 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !357, line: 49, flags: DIFlagFwdDecl)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !366, file: !357, line: 151, baseType: !229, size: 64, offset: 1472)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "scene_camera", scope: !366, file: !357, line: 152, baseType: !239, size: 64, offset: 1536)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "clip", scope: !366, file: !357, line: 153, baseType: !473, size: 64, offset: 1600)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64)
!474 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClip", file: !237, line: 64, size: 19136, elements: !475)
!475 = !{!476, !477, !478, !479, !480, !481, !483, !484, !485, !486, !489, !490, !735, !736, !744, !745, !746, !747, !748}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !474, file: !237, line: 65, baseType: !189, size: 960)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !474, file: !237, line: 66, baseType: !235, size: 64, offset: 960)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !474, file: !237, line: 68, baseType: !207, size: 8192, offset: 1024)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !474, file: !237, line: 70, baseType: !47, size: 32, offset: 9216)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !474, file: !237, line: 71, baseType: !47, size: 32, offset: 9248)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "lastsize", scope: !474, file: !237, line: 72, baseType: !482, size: 64, offset: 9280)
!482 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 64, elements: !294)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !474, file: !237, line: 74, baseType: !70, size: 32, offset: 9344)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !474, file: !237, line: 74, baseType: !70, size: 32, offset: 9376)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !474, file: !237, line: 76, baseType: !428, size: 64, offset: 9408)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !474, file: !237, line: 77, baseType: !487, size: 64, offset: 9472)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!488 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipCache", file: !237, line: 77, flags: DIFlagFwdDecl)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !474, file: !237, line: 78, baseType: !289, size: 64, offset: 9536)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "tracking", scope: !474, file: !237, line: 80, baseType: !491, size: 2624, offset: 9600)
!491 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTracking", file: !291, line: 340, size: 2624, elements: !492)
!492 = !{!493, !521, !539, !540, !541, !559, !617, !618, !715, !716, !717, !718, !724}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "settings", scope: !491, file: !291, line: 341, baseType: !494, size: 576)
!494 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingSettings", file: !291, line: 251, baseType: !495)
!495 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingSettings", file: !291, line: 207, size: 576, elements: !496)
!496 = !{!497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !495, file: !291, line: 208, baseType: !47, size: 32)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "default_motion_model", scope: !495, file: !291, line: 211, baseType: !73, size: 16, offset: 32)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "default_algorithm_flag", scope: !495, file: !291, line: 212, baseType: !73, size: 16, offset: 48)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "default_minimum_correlation", scope: !495, file: !291, line: 213, baseType: !70, size: 32, offset: 64)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_size", scope: !495, file: !291, line: 214, baseType: !73, size: 16, offset: 96)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "default_search_size", scope: !495, file: !291, line: 215, baseType: !73, size: 16, offset: 112)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "default_frames_limit", scope: !495, file: !291, line: 216, baseType: !73, size: 16, offset: 128)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "default_margin", scope: !495, file: !291, line: 217, baseType: !73, size: 16, offset: 144)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_match", scope: !495, file: !291, line: 218, baseType: !73, size: 16, offset: 160)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "default_flag", scope: !495, file: !291, line: 219, baseType: !73, size: 16, offset: 176)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "default_weight", scope: !495, file: !291, line: 220, baseType: !70, size: 32, offset: 192)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "motion_flag", scope: !495, file: !291, line: 222, baseType: !73, size: 16, offset: 224)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "speed", scope: !495, file: !291, line: 225, baseType: !73, size: 16, offset: 240)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe1", scope: !495, file: !291, line: 228, baseType: !47, size: 32, offset: 256)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe2", scope: !495, file: !291, line: 229, baseType: !47, size: 32, offset: 288)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction_flag", scope: !495, file: !291, line: 233, baseType: !47, size: 32, offset: 320)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "refine_camera_intrinsics", scope: !495, file: !291, line: 236, baseType: !73, size: 16, offset: 352)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !495, file: !291, line: 236, baseType: !73, size: 16, offset: 368)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !495, file: !291, line: 241, baseType: !70, size: 32, offset: 384)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "clean_frames", scope: !495, file: !291, line: 244, baseType: !47, size: 32, offset: 416)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "clean_action", scope: !495, file: !291, line: 244, baseType: !47, size: 32, offset: 448)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "clean_error", scope: !495, file: !291, line: 245, baseType: !70, size: 32, offset: 480)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "object_distance", scope: !495, file: !291, line: 248, baseType: !70, size: 32, offset: 512)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !495, file: !291, line: 250, baseType: !47, size: 32, offset: 544)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !491, file: !291, line: 342, baseType: !522, size: 448, offset: 576)
!522 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingCamera", file: !291, line: 79, baseType: !523)
!523 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingCamera", file: !291, line: 61, size: 448, elements: !524)
!524 = !{!525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "intrinsics", scope: !523, file: !291, line: 62, baseType: !39, size: 64)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_model", scope: !523, file: !291, line: 64, baseType: !73, size: 16, offset: 64)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !523, file: !291, line: 65, baseType: !73, size: 16, offset: 80)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "sensor_width", scope: !523, file: !291, line: 67, baseType: !70, size: 32, offset: 96)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_aspect", scope: !523, file: !291, line: 68, baseType: !70, size: 32, offset: 128)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "focal", scope: !523, file: !291, line: 69, baseType: !70, size: 32, offset: 160)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !523, file: !291, line: 70, baseType: !73, size: 16, offset: 192)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !523, file: !291, line: 71, baseType: !73, size: 16, offset: 208)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "principal", scope: !523, file: !291, line: 72, baseType: !293, size: 64, offset: 224)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "k1", scope: !523, file: !291, line: 75, baseType: !70, size: 32, offset: 288)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "k2", scope: !523, file: !291, line: 75, baseType: !70, size: 32, offset: 320)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "k3", scope: !523, file: !291, line: 75, baseType: !70, size: 32, offset: 352)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "division_k1", scope: !523, file: !291, line: 78, baseType: !70, size: 32, offset: 384)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "division_k2", scope: !523, file: !291, line: 78, baseType: !70, size: 32, offset: 416)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "tracks", scope: !491, file: !291, line: 343, baseType: !62, size: 128, offset: 1024)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "plane_tracks", scope: !491, file: !291, line: 344, baseType: !62, size: 128, offset: 1152)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction", scope: !491, file: !291, line: 345, baseType: !542, size: 192, offset: 1280)
!542 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingReconstruction", file: !291, line: 278, baseType: !543)
!543 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingReconstruction", file: !291, line: 270, size: 192, elements: !544)
!544 = !{!545, !546, !547, !548, !549}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !543, file: !291, line: 271, baseType: !47, size: 32)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !543, file: !291, line: 273, baseType: !70, size: 32, offset: 32)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "last_camera", scope: !543, file: !291, line: 275, baseType: !47, size: 32, offset: 64)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "camnr", scope: !543, file: !291, line: 276, baseType: !47, size: 32, offset: 96)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "cameras", scope: !543, file: !291, line: 277, baseType: !550, size: 64, offset: 128)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64)
!551 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieReconstructedCamera", file: !291, line: 55, size: 576, elements: !552)
!552 = !{!553, !554, !555}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !551, file: !291, line: 56, baseType: !47, size: 32)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !551, file: !291, line: 57, baseType: !70, size: 32, offset: 32)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !551, file: !291, line: 58, baseType: !556, size: 512, offset: 64)
!556 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 512, elements: !557)
!557 = !{!558, !558}
!558 = !DISubrange(count: 4)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "stabilization", scope: !491, file: !291, line: 346, baseType: !560, size: 384, offset: 1472)
!560 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStabilization", file: !291, line: 268, baseType: !561)
!561 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStabilization", file: !291, line: 253, size: 384, elements: !562)
!562 = !{!563, !564, !565, !566, !567, !611, !612, !613, !614, !615, !616}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !561, file: !291, line: 254, baseType: !47, size: 32)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "tot_track", scope: !561, file: !291, line: 255, baseType: !47, size: 32, offset: 32)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !561, file: !291, line: 255, baseType: !47, size: 32, offset: 64)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "maxscale", scope: !561, file: !291, line: 258, baseType: !70, size: 32, offset: 96)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "rot_track", scope: !561, file: !291, line: 259, baseType: !568, size: 64, offset: 128)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64)
!569 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingTrack", file: !291, line: 164, baseType: !570)
!570 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingTrack", file: !291, line: 108, size: 1664, elements: !571)
!571 = !{!572, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !570, file: !291, line: 109, baseType: !573, size: 64)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 64)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !570, file: !291, line: 109, baseType: !573, size: 64, offset: 64)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !570, file: !291, line: 111, baseType: !118, size: 512, offset: 128)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "pat_min", scope: !570, file: !291, line: 119, baseType: !293, size: 64, offset: 640)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "pat_max", scope: !570, file: !291, line: 119, baseType: !293, size: 64, offset: 704)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !570, file: !291, line: 125, baseType: !293, size: 64, offset: 768)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !570, file: !291, line: 125, baseType: !293, size: 64, offset: 832)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !570, file: !291, line: 127, baseType: !293, size: 64, offset: 896)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !570, file: !291, line: 130, baseType: !47, size: 32, offset: 960)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !570, file: !291, line: 131, baseType: !47, size: 32, offset: 992)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !570, file: !291, line: 132, baseType: !584, size: 64, offset: 1024)
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64)
!585 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingMarker", file: !291, line: 106, baseType: !586)
!586 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingMarker", file: !291, line: 81, size: 512, elements: !587)
!587 = !{!588, !589, !592, !593, !594, !595}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !586, file: !291, line: 82, baseType: !293, size: 64)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_corners", scope: !586, file: !291, line: 97, baseType: !590, size: 256, offset: 64)
!590 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 256, elements: !591)
!591 = !{!558, !295}
!592 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !586, file: !291, line: 102, baseType: !293, size: 64, offset: 320)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !586, file: !291, line: 102, baseType: !293, size: 64, offset: 384)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !586, file: !291, line: 104, baseType: !47, size: 32, offset: 448)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !586, file: !291, line: 105, baseType: !47, size: 32, offset: 480)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "bundle_pos", scope: !570, file: !291, line: 135, baseType: !261, size: 96, offset: 1088)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !570, file: !291, line: 136, baseType: !70, size: 32, offset: 1184)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !570, file: !291, line: 139, baseType: !47, size: 32, offset: 1216)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "pat_flag", scope: !570, file: !291, line: 139, baseType: !47, size: 32, offset: 1248)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "search_flag", scope: !570, file: !291, line: 139, baseType: !47, size: 32, offset: 1280)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !570, file: !291, line: 140, baseType: !261, size: 96, offset: 1312)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "frames_limit", scope: !570, file: !291, line: 143, baseType: !73, size: 16, offset: 1408)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !570, file: !291, line: 144, baseType: !73, size: 16, offset: 1424)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_match", scope: !570, file: !291, line: 145, baseType: !73, size: 16, offset: 1440)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "motion_model", scope: !570, file: !291, line: 148, baseType: !73, size: 16, offset: 1456)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm_flag", scope: !570, file: !291, line: 149, baseType: !47, size: 32, offset: 1472)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "minimum_correlation", scope: !570, file: !291, line: 150, baseType: !70, size: 32, offset: 1504)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !570, file: !291, line: 152, baseType: !289, size: 64, offset: 1536)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !570, file: !291, line: 163, baseType: !70, size: 32, offset: 1600)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !570, file: !291, line: 163, baseType: !70, size: 32, offset: 1632)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "locinf", scope: !561, file: !291, line: 261, baseType: !70, size: 32, offset: 192)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "scaleinf", scope: !561, file: !291, line: 261, baseType: !70, size: 32, offset: 224)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "rotinf", scope: !561, file: !291, line: 261, baseType: !70, size: 32, offset: 256)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !561, file: !291, line: 263, baseType: !47, size: 32, offset: 288)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !561, file: !291, line: 266, baseType: !47, size: 32, offset: 320)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !561, file: !291, line: 267, baseType: !70, size: 32, offset: 352)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !491, file: !291, line: 347, baseType: !568, size: 64, offset: 1856)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "act_plane_track", scope: !491, file: !291, line: 348, baseType: !619, size: 64, offset: 1920)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64)
!620 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingPlaneTrack", file: !291, line: 205, baseType: !621)
!621 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingPlaneTrack", file: !291, line: 186, size: 1024, elements: !622)
!622 = !{!623, !625, !626, !627, !629, !630, !631, !639, !640, !641, !713, !714}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !621, file: !291, line: 187, baseType: !624, size: 64)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !621, file: !291, line: 187, baseType: !624, size: 64, offset: 64)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !621, file: !291, line: 189, baseType: !118, size: 512, offset: 128)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "point_tracks", scope: !621, file: !291, line: 191, baseType: !628, size: 64, offset: 640)
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "point_tracksnr", scope: !621, file: !291, line: 193, baseType: !47, size: 32, offset: 704)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !621, file: !291, line: 193, baseType: !47, size: 32, offset: 736)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !621, file: !291, line: 195, baseType: !632, size: 64, offset: 768)
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !633, size: 64)
!633 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingPlaneMarker", file: !291, line: 184, baseType: !634)
!634 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingPlaneMarker", file: !291, line: 166, size: 320, elements: !635)
!635 = !{!636, !637, !638}
!636 = !DIDerivedType(tag: DW_TAG_member, name: "corners", scope: !634, file: !291, line: 180, baseType: !590, size: 256)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !634, file: !291, line: 182, baseType: !47, size: 32, offset: 256)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !634, file: !291, line: 183, baseType: !47, size: 32, offset: 288)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !621, file: !291, line: 196, baseType: !47, size: 32, offset: 832)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !621, file: !291, line: 198, baseType: !47, size: 32, offset: 864)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "image", scope: !621, file: !291, line: 200, baseType: !642, size: 64, offset: 896)
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 64)
!643 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !430, line: 77, size: 15424, elements: !644)
!644 = !{!645, !646, !647, !650, !653, !654, !657, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !675, !676, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !702, !703, !704, !705, !706, !707}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !643, file: !430, line: 78, baseType: !189, size: 960)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !643, file: !430, line: 80, baseType: !207, size: 8192, offset: 960)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !643, file: !430, line: 82, baseType: !648, size: 64, offset: 9152)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 64)
!649 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !430, line: 43, flags: DIFlagFwdDecl)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !643, file: !430, line: 83, baseType: !651, size: 64, offset: 9216)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64)
!652 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !124, line: 46, flags: DIFlagFwdDecl)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !643, file: !430, line: 86, baseType: !428, size: 64, offset: 9280)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !643, file: !430, line: 87, baseType: !655, size: 64, offset: 9344)
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 64)
!656 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !430, line: 44, flags: DIFlagFwdDecl)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !643, file: !430, line: 89, baseType: !658, size: 512, offset: 9408)
!658 = !DICompositeType(tag: DW_TAG_array_type, baseType: !655, size: 512, elements: !74)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !643, file: !430, line: 90, baseType: !73, size: 16, offset: 9920)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !643, file: !430, line: 90, baseType: !73, size: 16, offset: 9936)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !643, file: !430, line: 92, baseType: !73, size: 16, offset: 9952)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !643, file: !430, line: 92, baseType: !73, size: 16, offset: 9968)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !643, file: !430, line: 93, baseType: !73, size: 16, offset: 9984)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !643, file: !430, line: 93, baseType: !73, size: 16, offset: 10000)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !643, file: !430, line: 94, baseType: !47, size: 32, offset: 10016)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !643, file: !430, line: 97, baseType: !73, size: 16, offset: 10048)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !643, file: !430, line: 97, baseType: !73, size: 16, offset: 10064)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !643, file: !430, line: 98, baseType: !73, size: 16, offset: 10080)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !643, file: !430, line: 98, baseType: !73, size: 16, offset: 10096)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !643, file: !430, line: 99, baseType: !73, size: 16, offset: 10112)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !643, file: !430, line: 99, baseType: !73, size: 16, offset: 10128)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !643, file: !430, line: 100, baseType: !5, size: 32, offset: 10144)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !643, file: !430, line: 101, baseType: !674, size: 64, offset: 10176)
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !643, file: !430, line: 103, baseType: !213, size: 64, offset: 10240)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !643, file: !430, line: 104, baseType: !677, size: 64, offset: 10304)
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !678, size: 64)
!678 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !124, line: 159, size: 448, elements: !679)
!679 = !{!680, !682, !683, !685, !686, !688}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !678, file: !124, line: 161, baseType: !681, size: 64)
!681 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 64, elements: !294)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !678, file: !124, line: 162, baseType: !681, size: 64, offset: 64)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !678, file: !124, line: 163, baseType: !684, size: 32, offset: 128)
!684 = !DICompositeType(tag: DW_TAG_array_type, baseType: !73, size: 32, elements: !294)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !678, file: !124, line: 164, baseType: !684, size: 32, offset: 160)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !678, file: !124, line: 165, baseType: !687, size: 128, offset: 192)
!687 = !DICompositeType(tag: DW_TAG_array_type, baseType: !674, size: 128, elements: !294)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !678, file: !124, line: 166, baseType: !689, size: 128, offset: 320)
!689 = !DICompositeType(tag: DW_TAG_array_type, baseType: !651, size: 128, elements: !294)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !643, file: !430, line: 107, baseType: !70, size: 32, offset: 10368)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !643, file: !430, line: 108, baseType: !47, size: 32, offset: 10400)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !643, file: !430, line: 109, baseType: !73, size: 16, offset: 10432)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !643, file: !430, line: 110, baseType: !73, size: 16, offset: 10448)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !643, file: !430, line: 113, baseType: !47, size: 32, offset: 10464)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !643, file: !430, line: 113, baseType: !47, size: 32, offset: 10496)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !643, file: !430, line: 114, baseType: !82, size: 8, offset: 10528)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !643, file: !430, line: 114, baseType: !82, size: 8, offset: 10536)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !643, file: !430, line: 115, baseType: !73, size: 16, offset: 10544)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !643, file: !430, line: 116, baseType: !700, size: 128, offset: 10560)
!700 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 128, elements: !701)
!701 = !{!558}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !643, file: !430, line: 119, baseType: !70, size: 32, offset: 10688)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !643, file: !430, line: 119, baseType: !70, size: 32, offset: 10720)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !643, file: !430, line: 122, baseType: !462, size: 512, offset: 10752)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !643, file: !430, line: 123, baseType: !82, size: 8, offset: 11264)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !643, file: !430, line: 125, baseType: !84, size: 56, offset: 11272)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !643, file: !430, line: 126, baseType: !708, size: 4096, offset: 11328)
!708 = !DICompositeType(tag: DW_TAG_array_type, baseType: !709, size: 4096, elements: !74)
!709 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !430, line: 69, baseType: !710)
!710 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !430, line: 67, size: 512, elements: !711)
!711 = !{!712}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !710, file: !430, line: 68, baseType: !118, size: 512)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "image_opacity", scope: !621, file: !291, line: 201, baseType: !70, size: 32, offset: 960)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !621, file: !291, line: 204, baseType: !47, size: 32, offset: 992)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !491, file: !291, line: 350, baseType: !62, size: 128, offset: 1984)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "objectnr", scope: !491, file: !291, line: 351, baseType: !47, size: 32, offset: 2112)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "tot_object", scope: !491, file: !291, line: 351, baseType: !47, size: 32, offset: 2144)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !491, file: !291, line: 353, baseType: !719, size: 64, offset: 2176)
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 64)
!720 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStats", file: !291, line: 297, baseType: !721)
!721 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStats", file: !291, line: 295, size: 2048, elements: !722)
!722 = !{!723}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !721, file: !291, line: 296, baseType: !411, size: 2048)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "dopesheet", scope: !491, file: !291, line: 355, baseType: !725, size: 384, offset: 2240)
!725 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingDopesheet", file: !291, line: 338, baseType: !726)
!726 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingDopesheet", file: !291, line: 322, size: 384, elements: !727)
!727 = !{!728, !729, !730, !731, !732, !733, !734}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !726, file: !291, line: 323, baseType: !47, size: 32)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "sort_method", scope: !726, file: !291, line: 325, baseType: !73, size: 16, offset: 32)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !726, file: !291, line: 326, baseType: !73, size: 16, offset: 48)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "coverage_segments", scope: !726, file: !291, line: 331, baseType: !62, size: 128, offset: 64)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !726, file: !291, line: 334, baseType: !62, size: 128, offset: 192)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "tot_channel", scope: !726, file: !291, line: 335, baseType: !47, size: 32, offset: 320)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !726, file: !291, line: 337, baseType: !47, size: 32, offset: 352)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "tracking_context", scope: !474, file: !237, line: 81, baseType: !39, size: 64, offset: 12224)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !474, file: !237, line: 85, baseType: !737, size: 6208, offset: 12288)
!737 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipProxy", file: !237, line: 55, size: 6208, elements: !738)
!738 = !{!739, !740, !741, !742, !743}
!739 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !737, file: !237, line: 56, baseType: !417, size: 6144)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !737, file: !237, line: 58, baseType: !73, size: 16, offset: 6144)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !737, file: !237, line: 59, baseType: !73, size: 16, offset: 6160)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flag", scope: !737, file: !237, line: 60, baseType: !73, size: 16, offset: 6176)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flag", scope: !737, file: !237, line: 61, baseType: !73, size: 16, offset: 6192)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !474, file: !237, line: 86, baseType: !47, size: 32, offset: 18496)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !474, file: !237, line: 88, baseType: !47, size: 32, offset: 18528)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !474, file: !237, line: 90, baseType: !47, size: 32, offset: 18560)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "frame_offset", scope: !474, file: !237, line: 94, baseType: !47, size: 32, offset: 18592)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !474, file: !237, line: 100, baseType: !462, size: 512, offset: 18624)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !366, file: !357, line: 154, baseType: !750, size: 64, offset: 1664)
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !751, size: 64)
!751 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mask", file: !241, line: 264, flags: DIFlagFwdDecl)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !366, file: !357, line: 156, baseType: !428, size: 64, offset: 1728)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "effect_fader", scope: !366, file: !357, line: 158, baseType: !70, size: 32, offset: 1792)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "speed_fader", scope: !366, file: !357, line: 159, baseType: !70, size: 32, offset: 1824)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "seq1", scope: !366, file: !357, line: 162, baseType: !369, size: 64, offset: 1856)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "seq2", scope: !366, file: !357, line: 162, baseType: !369, size: 64, offset: 1920)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "seq3", scope: !366, file: !357, line: 162, baseType: !369, size: 64, offset: 1984)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !366, file: !357, line: 164, baseType: !62, size: 128, offset: 2048)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "sound", scope: !366, file: !357, line: 166, baseType: !760, size: 64, offset: 2176)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64)
!761 = !DICompositeType(tag: DW_TAG_structure_type, name: "bSound", file: !357, line: 51, flags: DIFlagFwdDecl)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "scene_sound", scope: !366, file: !357, line: 167, baseType: !39, size: 64, offset: 2240)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "volume", scope: !366, file: !357, line: 168, baseType: !70, size: 32, offset: 2304)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "pitch", scope: !366, file: !357, line: 170, baseType: !70, size: 32, offset: 2336)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "pan", scope: !366, file: !357, line: 170, baseType: !70, size: 32, offset: 2368)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "strobe", scope: !366, file: !357, line: 171, baseType: !70, size: 32, offset: 2400)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "effectdata", scope: !366, file: !357, line: 173, baseType: !39, size: 64, offset: 2432)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "anim_startofs", scope: !366, file: !357, line: 175, baseType: !47, size: 32, offset: 2496)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "anim_endofs", scope: !366, file: !357, line: 176, baseType: !47, size: 32, offset: 2528)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "blend_mode", scope: !366, file: !357, line: 179, baseType: !47, size: 32, offset: 2560)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "blend_opacity", scope: !366, file: !357, line: 180, baseType: !70, size: 32, offset: 2592)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !366, file: !357, line: 183, baseType: !47, size: 32, offset: 2624)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !366, file: !357, line: 185, baseType: !82, size: 8, offset: 2656)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !366, file: !357, line: 186, baseType: !775, size: 24, offset: 2664)
!775 = !DICompositeType(tag: DW_TAG_array_type, baseType: !82, size: 24, elements: !262)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !366, file: !357, line: 189, baseType: !62, size: 128, offset: 2688)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "act_imagedir", scope: !356, file: !357, line: 207, baseType: !207, size: 8192, offset: 384)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "act_sounddir", scope: !356, file: !357, line: 208, baseType: !207, size: 8192, offset: 8576)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "over_ofs", scope: !356, file: !357, line: 210, baseType: !47, size: 32, offset: 16768)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "over_cfra", scope: !356, file: !357, line: 210, baseType: !47, size: 32, offset: 16800)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "over_flag", scope: !356, file: !357, line: 211, baseType: !47, size: 32, offset: 16832)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !356, file: !357, line: 211, baseType: !47, size: 32, offset: 16864)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "over_border", scope: !356, file: !357, line: 212, baseType: !311, size: 128, offset: 16896)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "toolsettings", scope: !230, file: !231, line: 1246, baseType: !785, size: 64, offset: 2112)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 64)
!786 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolSettings", file: !231, line: 1067, size: 5184, elements: !787)
!787 = !{!788, !818, !819, !834, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !856, !872, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !982}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint", scope: !786, file: !231, line: 1068, baseType: !789, size: 64)
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !790, size: 64)
!790 = !DIDerivedType(tag: DW_TAG_typedef, name: "VPaint", file: !231, line: 934, baseType: !791)
!791 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VPaint", file: !231, line: 925, size: 576, elements: !792)
!792 = !{!793, !810, !811, !812, !813, !814, !817}
!793 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !791, file: !231, line: 926, baseType: !794, size: 320)
!794 = !DIDerivedType(tag: DW_TAG_typedef, name: "Paint", file: !231, line: 830, baseType: !795)
!795 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Paint", file: !231, line: 813, size: 320, elements: !796)
!796 = !{!797, !800, !803, !804, !807, !808, !809}
!797 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !795, file: !231, line: 814, baseType: !798, size: 64)
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !799, size: 64)
!799 = !DICompositeType(tag: DW_TAG_structure_type, name: "Brush", file: !231, line: 51, flags: DIFlagFwdDecl)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "palette", scope: !795, file: !231, line: 815, baseType: !801, size: 64, offset: 64)
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 64)
!802 = !DICompositeType(tag: DW_TAG_structure_type, name: "Palette", file: !231, line: 815, flags: DIFlagFwdDecl)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor", scope: !795, file: !231, line: 818, baseType: !39, size: 64, offset: 128)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor_col", scope: !795, file: !231, line: 819, baseType: !805, size: 32, offset: 192)
!805 = !DICompositeType(tag: DW_TAG_array_type, baseType: !806, size: 32, elements: !701)
!806 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !795, file: !231, line: 822, baseType: !47, size: 32, offset: 224)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "num_input_samples", scope: !795, file: !231, line: 826, baseType: !47, size: 32, offset: 256)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "symmetry_flags", scope: !795, file: !231, line: 829, baseType: !47, size: 32, offset: 288)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !791, file: !231, line: 928, baseType: !73, size: 16, offset: 320)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !791, file: !231, line: 928, baseType: !73, size: 16, offset: 336)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !791, file: !231, line: 929, baseType: !47, size: 32, offset: 352)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint_prev", scope: !791, file: !231, line: 930, baseType: !674, size: 64, offset: 384)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint_prev", scope: !791, file: !231, line: 931, baseType: !815, size: 64, offset: 448)
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !816, size: 64)
!816 = !DICompositeType(tag: DW_TAG_structure_type, name: "MDeformVert", file: !231, line: 931, flags: DIFlagFwdDecl)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !791, file: !231, line: 933, baseType: !39, size: 64, offset: 512)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint", scope: !786, file: !231, line: 1069, baseType: !789, size: 64, offset: 64)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !786, file: !231, line: 1070, baseType: !820, size: 64, offset: 128)
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !821, size: 64)
!821 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sculpt", file: !231, line: 916, baseType: !822)
!822 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sculpt", file: !231, line: 891, size: 704, elements: !823)
!823 = !{!824, !825, !826, !828, !829, !830, !831, !832, !833}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !822, file: !231, line: 892, baseType: !794, size: 320)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !822, file: !231, line: 896, baseType: !47, size: 32, offset: 320)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "radial_symm", scope: !822, file: !231, line: 900, baseType: !827, size: 96, offset: 352)
!827 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 96, elements: !262)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "detail_size", scope: !822, file: !231, line: 903, baseType: !70, size: 32, offset: 448)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "symmetrize_direction", scope: !822, file: !231, line: 906, baseType: !47, size: 32, offset: 480)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "gravity_factor", scope: !822, file: !231, line: 909, baseType: !70, size: 32, offset: 512)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "constant_detail", scope: !822, file: !231, line: 912, baseType: !70, size: 32, offset: 544)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "gravity_object", scope: !822, file: !231, line: 914, baseType: !239, size: 64, offset: 576)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !822, file: !231, line: 915, baseType: !39, size: 64, offset: 640)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "uvsculpt", scope: !786, file: !231, line: 1071, baseType: !835, size: 64, offset: 192)
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !836, size: 64)
!836 = !DIDerivedType(tag: DW_TAG_typedef, name: "UvSculpt", file: !231, line: 920, baseType: !837)
!837 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UvSculpt", file: !231, line: 918, size: 320, elements: !838)
!838 = !{!839}
!839 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !837, file: !231, line: 919, baseType: !794, size: 320)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "vgroup_weight", scope: !786, file: !231, line: 1075, baseType: !70, size: 32, offset: 256)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "doublimit", scope: !786, file: !231, line: 1077, baseType: !70, size: 32, offset: 288)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "normalsize", scope: !786, file: !231, line: 1078, baseType: !70, size: 32, offset: 320)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "automerge", scope: !786, file: !231, line: 1079, baseType: !73, size: 16, offset: 352)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !786, file: !231, line: 1082, baseType: !73, size: 16, offset: 368)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "unwrapper", scope: !786, file: !231, line: 1085, baseType: !82, size: 8, offset: 384)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "uvcalc_flag", scope: !786, file: !231, line: 1086, baseType: !82, size: 8, offset: 392)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "uv_flag", scope: !786, file: !231, line: 1087, baseType: !82, size: 8, offset: 400)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "uv_selectmode", scope: !786, file: !231, line: 1088, baseType: !82, size: 8, offset: 408)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "uvcalc_margin", scope: !786, file: !231, line: 1090, baseType: !70, size: 32, offset: 416)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "autoik_chainlen", scope: !786, file: !231, line: 1093, baseType: !73, size: 16, offset: 448)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "gpencil_flags", scope: !786, file: !231, line: 1096, baseType: !82, size: 8, offset: 464)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !786, file: !231, line: 1098, baseType: !853, size: 40, offset: 472)
