; ModuleID = 'blender/source/blender/render/intern/source/envmap.c'
source_filename = "blender/source/blender/render/intern/source/envmap.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "blender/source/blender/render/intern/source/envmap.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!5 = !{i32 7, !"Dwarf Version", i32 4}
!6 = !{i32 2, !"Debug Info Version", i32 3}
!7 = !{i32 1, !"wchar_size", i32 4}
!8 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!9 = distinct !DISubprogram(name: "env_rotate_scene", scope: !1, file: !1, line: 266, type: !10, scopeLine: 267, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!10 = !DISubroutineType(types: !11)
!11 = !{null, !12, !1993, !27}
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "Render", file: !14, line: 58, baseType: !15)
!14 = !DIFile(filename: "blender/source/blender/render/extern/include/RE_pipeline.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!15 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Render", file: !16, line: 126, size: 49920, elements: !17)
!16 = !DIFile(filename: "blender/source/blender/render/intern/include/render_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!17 = !{!18, !20, !21, !26, !28, !30, !31, !32, !33, !35, !180, !181, !182, !191, !192, !193, !194, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !219, !223, !224, !225, !226, !227, !228, !247, !252, !253, !255, !259, !320, !1722, !1724, !1726, !1727, !1728, !1729, !1730, !1733, !1736, !1739, !1742, !1743, !1744, !1745, !1746, !1747, !1748, !1749, !1750, !1751, !1752, !1791, !1792, !1793, !1794, !2008, !2009, !2010, !2011, !2012, !2013, !2014, !2015, !2016, !2017, !2018, !2019, !2022, !2026, !2027, !2028, !2029, !2034, !2035, !2039, !2040, !2071, !2072, !2076, !2077, !2081, !2082, !2086, !2087, !2088, !2091, !2092}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !15, file: !16, line: 128, baseType: !19, size: 64)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !15, file: !16, line: 128, baseType: !19, size: 64, offset: 64)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !15, file: !16, line: 129, baseType: !22, size: 592, offset: 128)
!22 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 592, elements: !24)
!23 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!24 = !{!25}
!25 = !DISubrange(count: 74)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "slot", scope: !15, file: !16, line: 130, baseType: !27, size: 32, offset: 736)
!27 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !15, file: !16, line: 133, baseType: !29, size: 16, offset: 768)
!29 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "osa", scope: !15, file: !16, line: 133, baseType: !29, size: 16, offset: 784)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !15, file: !16, line: 133, baseType: !29, size: 16, offset: 800)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "result_ok", scope: !15, file: !16, line: 133, baseType: !29, size: 16, offset: 816)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "scene_color_manage", scope: !15, file: !16, line: 136, baseType: !34, size: 8, offset: 832)
!34 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !15, file: !16, line: 139, baseType: !36, size: 64, offset: 896)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderResult", file: !14, line: 148, baseType: !38)
!38 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !14, line: 110, size: 1152, elements: !39)
!39 = !{!40, !42, !43, !44, !45, !46, !47, !49, !52, !53, !62, !63, !64, !71, !73, !175, !176, !177, !178}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !38, file: !14, line: 111, baseType: !41, size: 64)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !38, file: !14, line: 111, baseType: !41, size: 64, offset: 64)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "rectx", scope: !38, file: !14, line: 114, baseType: !27, size: 32, offset: 128)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "recty", scope: !38, file: !14, line: 114, baseType: !27, size: 32, offset: 160)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !38, file: !14, line: 115, baseType: !29, size: 16, offset: 192)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "sample_nr", scope: !38, file: !14, line: 115, baseType: !29, size: 16, offset: 208)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "rect32", scope: !38, file: !14, line: 118, baseType: !48, size: 64, offset: 256)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "rectf", scope: !38, file: !14, line: 120, baseType: !50, size: 64, offset: 320)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!51 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "rectz", scope: !38, file: !14, line: 122, baseType: !50, size: 64, offset: 384)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "tilerect", scope: !38, file: !14, line: 125, baseType: !54, size: 128, offset: 448)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "rcti", file: !55, line: 89, baseType: !56)
!55 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!56 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rcti", file: !55, line: 86, size: 128, elements: !57)
!57 = !{!58, !59, !60, !61}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !56, file: !55, line: 87, baseType: !27, size: 32)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !56, file: !55, line: 87, baseType: !27, size: 32, offset: 32)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !56, file: !55, line: 88, baseType: !27, size: 32, offset: 64)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !56, file: !55, line: 88, baseType: !27, size: 32, offset: 96)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "xof", scope: !38, file: !14, line: 127, baseType: !27, size: 32, offset: 576)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "yof", scope: !38, file: !14, line: 127, baseType: !27, size: 32, offset: 608)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !38, file: !14, line: 130, baseType: !65, size: 128, offset: 640)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !66, line: 71, baseType: !67)
!66 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!67 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !66, line: 69, size: 128, elements: !68)
!68 = !{!69, !70}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !67, file: !66, line: 70, baseType: !4, size: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !67, file: !66, line: 70, baseType: !4, size: 64, offset: 64)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "renrect", scope: !38, file: !14, line: 133, baseType: !72, size: 128, offset: 768)
!72 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !54)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "renlay", scope: !38, file: !14, line: 134, baseType: !74, size: 64, offset: 896)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !76)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderLayer", file: !14, line: 108, baseType: !77)
!77 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderLayer", file: !14, line: 85, size: 1600, elements: !78)
!78 = !{!79, !81, !82, !83, !85, !86, !87, !88, !89, !90, !94, !167, !168, !169, !170, !171, !172, !173, !174}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !77, file: !14, line: 86, baseType: !80, size: 64)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !77, file: !14, line: 86, baseType: !80, size: 64, offset: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !77, file: !14, line: 89, baseType: !22, size: 592, offset: 128)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !77, file: !14, line: 90, baseType: !84, size: 32, offset: 736)
!84 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "lay_zmask", scope: !77, file: !14, line: 90, baseType: !84, size: 32, offset: 768)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "lay_exclude", scope: !77, file: !14, line: 90, baseType: !84, size: 32, offset: 800)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "layflag", scope: !77, file: !14, line: 91, baseType: !27, size: 32, offset: 832)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "passflag", scope: !77, file: !14, line: 91, baseType: !27, size: 32, offset: 864)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "pass_xor", scope: !77, file: !14, line: 91, baseType: !27, size: 32, offset: 896)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "mat_override", scope: !77, file: !14, line: 93, baseType: !91, size: 64, offset: 960)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !93, line: 50, flags: DIFlagFwdDecl)
!93 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!94 = !DIDerivedType(tag: DW_TAG_member, name: "light_override", scope: !77, file: !14, line: 94, baseType: !95, size: 64, offset: 1024)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !97, line: 51, size: 1216, elements: !98)
!97 = !DIFile(filename: "blender/source/blender/makesdna/DNA_group_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!98 = !{!99, !161, !162, !163}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !96, file: !97, line: 52, baseType: !100, size: 960)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !101, line: 130, baseType: !102)
!101 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !101, line: 117, size: 960, elements: !103)
!103 = !{!104, !105, !106, !108, !127, !131, !132, !133, !134, !135}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !102, file: !101, line: 118, baseType: !4, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !102, file: !101, line: 118, baseType: !4, size: 64, offset: 64)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !102, file: !101, line: 119, baseType: !107, size: 64, offset: 128)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !102, file: !101, line: 120, baseType: !109, size: 64, offset: 192)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !101, line: 136, size: 17600, elements: !111)
!111 = !{!112, !113, !115, !118, !122, !123, !124}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !110, file: !101, line: 137, baseType: !100, size: 960)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !110, file: !101, line: 138, baseType: !114, size: 64, offset: 960)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !110, file: !101, line: 139, baseType: !116, size: 64, offset: 1024)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !101, line: 43, flags: DIFlagFwdDecl)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !110, file: !101, line: 140, baseType: !119, size: 8192, offset: 1088)
!119 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 8192, elements: !120)
!120 = !{!121}
!121 = !DISubrange(count: 1024)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !110, file: !101, line: 141, baseType: !119, size: 8192, offset: 9280)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !110, file: !101, line: 148, baseType: !109, size: 64, offset: 17472)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !110, file: !101, line: 150, baseType: !125, size: 64, offset: 17536)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !101, line: 45, flags: DIFlagFwdDecl)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !102, file: !101, line: 121, baseType: !128, size: 528, offset: 256)
!128 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 528, elements: !129)
!129 = !{!130}
!130 = !DISubrange(count: 66)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !102, file: !101, line: 126, baseType: !29, size: 16, offset: 784)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !102, file: !101, line: 127, baseType: !27, size: 32, offset: 800)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !102, file: !101, line: 128, baseType: !27, size: 32, offset: 832)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !102, file: !101, line: 128, baseType: !27, size: 32, offset: 864)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !102, file: !101, line: 129, baseType: !136, size: 64, offset: 896)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !101, line: 75, baseType: !138)
!138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !101, line: 62, size: 1024, elements: !139)
!139 = !{!140, !142, !143, !144, !145, !146, !150, !151, !159, !160}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !138, file: !101, line: 63, baseType: !141, size: 64)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !138, file: !101, line: 63, baseType: !141, size: 64, offset: 64)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !138, file: !101, line: 64, baseType: !23, size: 8, offset: 128)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !138, file: !101, line: 64, baseType: !23, size: 8, offset: 136)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !138, file: !101, line: 65, baseType: !29, size: 16, offset: 144)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !138, file: !101, line: 66, baseType: !147, size: 512, offset: 160)
!147 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 512, elements: !148)
!148 = !{!149}
!149 = !DISubrange(count: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !138, file: !101, line: 67, baseType: !27, size: 32, offset: 672)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !138, file: !101, line: 69, baseType: !152, size: 256, offset: 704)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !101, line: 60, baseType: !153)
!153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !101, line: 48, size: 256, elements: !154)
!154 = !{!155, !156, !157, !158}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !153, file: !101, line: 49, baseType: !4, size: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !153, file: !101, line: 58, baseType: !65, size: 128, offset: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !153, file: !101, line: 59, baseType: !27, size: 32, offset: 192)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !153, file: !101, line: 59, baseType: !27, size: 32, offset: 224)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !138, file: !101, line: 70, baseType: !27, size: 32, offset: 960)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !138, file: !101, line: 74, baseType: !27, size: 32, offset: 992)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "gobject", scope: !96, file: !97, line: 54, baseType: !65, size: 128, offset: 960)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !96, file: !97, line: 59, baseType: !84, size: 32, offset: 1088)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "dupli_ofs", scope: !96, file: !97, line: 60, baseType: !164, size: 96, offset: 1120)
!164 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 96, elements: !165)
!165 = !{!166}
!166 = !DISubrange(count: 3)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "rectf", scope: !77, file: !14, line: 96, baseType: !50, size: 64, offset: 1088)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "acolrect", scope: !77, file: !14, line: 97, baseType: !50, size: 64, offset: 1152)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "scolrect", scope: !77, file: !14, line: 98, baseType: !50, size: 64, offset: 1216)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "display_buffer", scope: !77, file: !14, line: 99, baseType: !48, size: 64, offset: 1280)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "rectx", scope: !77, file: !14, line: 101, baseType: !27, size: 32, offset: 1344)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "recty", scope: !77, file: !14, line: 101, baseType: !27, size: 32, offset: 1376)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "exrhandle", scope: !77, file: !14, line: 104, baseType: !4, size: 64, offset: 1408)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "passes", scope: !77, file: !14, line: 106, baseType: !65, size: 128, offset: 1472)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "do_exr_tile", scope: !38, file: !14, line: 137, baseType: !27, size: 32, offset: 960)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !38, file: !14, line: 140, baseType: !27, size: 32, offset: 992)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "have_combined", scope: !38, file: !14, line: 143, baseType: !27, size: 32, offset: 1024)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !38, file: !14, line: 146, baseType: !179, size: 64, offset: 1088)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "pushedresult", scope: !15, file: !16, line: 141, baseType: !36, size: 64, offset: 960)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "fullresult", scope: !15, file: !16, line: 143, baseType: !65, size: 128, offset: 1024)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "resultmutex", scope: !15, file: !16, line: 147, baseType: !183, size: 32, offset: 1152)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "ThreadRWMutex", file: !184, line: 148, baseType: !185)
!184 = !DIFile(filename: "blender/source/blender/blenlib/BLI_threads.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "spec_null_rwlock_t", file: !186, line: 10, baseType: !187)
!186 = !DIFile(filename: "include/spec_pthread.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !188, line: 26, baseType: !189)
!188 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !190, line: 42, baseType: !84)
!190 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!191 = !DIDerivedType(tag: DW_TAG_member, name: "winx", scope: !15, file: !16, line: 150, baseType: !27, size: 32, offset: 1184)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "winy", scope: !15, file: !16, line: 150, baseType: !27, size: 32, offset: 1216)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "disprect", scope: !15, file: !16, line: 152, baseType: !54, size: 128, offset: 1248)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "viewplane", scope: !15, file: !16, line: 153, baseType: !195, size: 128, offset: 1376)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !55, line: 95, baseType: !196)
!196 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !55, line: 92, size: 128, elements: !197)
!197 = !{!198, !199, !200, !201}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !196, file: !55, line: 93, baseType: !51, size: 32)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !196, file: !55, line: 93, baseType: !51, size: 32, offset: 32)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !196, file: !55, line: 94, baseType: !51, size: 32, offset: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !196, file: !55, line: 94, baseType: !51, size: 32, offset: 96)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "viewdx", scope: !15, file: !16, line: 154, baseType: !51, size: 32, offset: 1504)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "viewdy", scope: !15, file: !16, line: 154, baseType: !51, size: 32, offset: 1536)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "clipcrop", scope: !15, file: !16, line: 155, baseType: !51, size: 32, offset: 1568)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "rectx", scope: !15, file: !16, line: 158, baseType: !27, size: 32, offset: 1600)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "recty", scope: !15, file: !16, line: 158, baseType: !27, size: 32, offset: 1632)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "partx", scope: !15, file: !16, line: 162, baseType: !27, size: 32, offset: 1664)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "party", scope: !15, file: !16, line: 162, baseType: !27, size: 32, offset: 1696)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "ycor", scope: !15, file: !16, line: 165, baseType: !51, size: 32, offset: 1728)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "panophi", scope: !15, file: !16, line: 167, baseType: !51, size: 32, offset: 1760)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "panosi", scope: !15, file: !16, line: 167, baseType: !51, size: 32, offset: 1792)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "panoco", scope: !15, file: !16, line: 167, baseType: !51, size: 32, offset: 1824)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "panodxp", scope: !15, file: !16, line: 167, baseType: !51, size: 32, offset: 1856)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "panodxv", scope: !15, file: !16, line: 167, baseType: !51, size: 32, offset: 1888)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "grvec", scope: !15, file: !16, line: 170, baseType: !164, size: 96, offset: 1920)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !15, file: !16, line: 171, baseType: !217, size: 288, offset: 2016)
!217 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 288, elements: !218)
!218 = !{!166, !166}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "viewmat", scope: !15, file: !16, line: 172, baseType: !220, size: 512, offset: 2304)
!220 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 512, elements: !221)
!221 = !{!222, !222}
!222 = !DISubrange(count: 4)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "viewinv", scope: !15, file: !16, line: 172, baseType: !220, size: 512, offset: 2816)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "viewmat_orig", scope: !15, file: !16, line: 173, baseType: !220, size: 512, offset: 3328)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "winmat", scope: !15, file: !16, line: 174, baseType: !220, size: 512, offset: 3840)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "clipsta", scope: !15, file: !16, line: 177, baseType: !51, size: 32, offset: 4352)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "clipend", scope: !15, file: !16, line: 178, baseType: !51, size: 32, offset: 4384)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !15, file: !16, line: 181, baseType: !229, size: 64, offset: 4416)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "SampleTables", file: !16, line: 77, baseType: !231)
!231 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SampleTables", file: !16, line: 72, size: 3776, elements: !232)
!232 = !{!233, !237, !241, !242, !246}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "centLut", scope: !231, file: !16, line: 73, baseType: !234, size: 512)
!234 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 512, elements: !235)
!235 = !{!236}
!236 = !DISubrange(count: 16)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "fmask1", scope: !231, file: !16, line: 74, baseType: !238, size: 576, offset: 512)
!238 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 576, elements: !239)
!239 = !{!240}
!240 = !DISubrange(count: 9)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "fmask2", scope: !231, file: !16, line: 74, baseType: !238, size: 576, offset: 1088)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "cmask", scope: !231, file: !16, line: 75, baseType: !243, size: 2048, offset: 1664)
!243 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 2048, elements: !244)
!244 = !{!245}
!245 = !DISubrange(count: 256)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "centmask", scope: !231, file: !16, line: 75, baseType: !179, size: 64, offset: 3712)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "jit", scope: !15, file: !16, line: 182, baseType: !248, size: 2048, offset: 4480)
!248 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 2048, elements: !249)
!249 = !{!250, !251}
!250 = !DISubrange(count: 32)
!251 = !DISubrange(count: 2)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "mblur_jit", scope: !15, file: !16, line: 183, baseType: !248, size: 2048, offset: 6528)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "qmcsamplers", scope: !15, file: !16, line: 184, baseType: !254, size: 64, offset: 8576)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "shadowsamplenr", scope: !15, file: !16, line: 187, baseType: !256, size: 32, offset: 8640)
!256 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 32, elements: !257)
!257 = !{!258}
!258 = !DISubrange(count: 1)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "main", scope: !15, file: !16, line: 190, baseType: !260, size: 64, offset: 8704)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!261 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Main", file: !262, line: 53, size: 15232, elements: !263)
!262 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_main.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!263 = !{!264, !265, !266, !267, !268, !269, !270, !271, !275, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !317}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !261, file: !262, line: 54, baseType: !260, size: 64)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !261, file: !262, line: 54, baseType: !260, size: 64, offset: 64)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !261, file: !262, line: 55, baseType: !119, size: 8192, offset: 128)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "versionfile", scope: !261, file: !262, line: 56, baseType: !29, size: 16, offset: 8320)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "subversionfile", scope: !261, file: !262, line: 56, baseType: !29, size: 16, offset: 8336)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "minversionfile", scope: !261, file: !262, line: 57, baseType: !29, size: 16, offset: 8352)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "minsubversionfile", scope: !261, file: !262, line: 57, baseType: !29, size: 16, offset: 8368)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "build_commit_timestamp", scope: !261, file: !262, line: 58, baseType: !272, size: 64, offset: 8384)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !188, line: 27, baseType: !273)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !190, line: 45, baseType: !274)
!274 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "build_hash", scope: !261, file: !262, line: 59, baseType: !276, size: 128, offset: 8448)
!276 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 128, elements: !235)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "recovered", scope: !261, file: !262, line: 60, baseType: !29, size: 16, offset: 8576)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "curlib", scope: !261, file: !262, line: 62, baseType: !109, size: 64, offset: 8640)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !261, file: !262, line: 63, baseType: !65, size: 128, offset: 8704)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "library", scope: !261, file: !262, line: 64, baseType: !65, size: 128, offset: 8832)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !261, file: !262, line: 65, baseType: !65, size: 128, offset: 8960)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "mesh", scope: !261, file: !262, line: 66, baseType: !65, size: 128, offset: 9088)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "curve", scope: !261, file: !262, line: 67, baseType: !65, size: 128, offset: 9216)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "mball", scope: !261, file: !262, line: 68, baseType: !65, size: 128, offset: 9344)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !261, file: !262, line: 69, baseType: !65, size: 128, offset: 9472)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "tex", scope: !261, file: !262, line: 70, baseType: !65, size: 128, offset: 9600)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "image", scope: !261, file: !262, line: 71, baseType: !65, size: 128, offset: 9728)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "latt", scope: !261, file: !262, line: 72, baseType: !65, size: 128, offset: 9856)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "lamp", scope: !261, file: !262, line: 73, baseType: !65, size: 128, offset: 9984)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !261, file: !262, line: 74, baseType: !65, size: 128, offset: 10112)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !261, file: !262, line: 75, baseType: !65, size: 128, offset: 10240)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !261, file: !262, line: 76, baseType: !65, size: 128, offset: 10368)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !261, file: !262, line: 77, baseType: !65, size: 128, offset: 10496)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !261, file: !262, line: 78, baseType: !65, size: 128, offset: 10624)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "script", scope: !261, file: !262, line: 79, baseType: !65, size: 128, offset: 10752)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "vfont", scope: !261, file: !262, line: 80, baseType: !65, size: 128, offset: 10880)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !261, file: !262, line: 81, baseType: !65, size: 128, offset: 11008)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "speaker", scope: !261, file: !262, line: 82, baseType: !65, size: 128, offset: 11136)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "sound", scope: !261, file: !262, line: 83, baseType: !65, size: 128, offset: 11264)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !261, file: !262, line: 84, baseType: !65, size: 128, offset: 11392)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "armature", scope: !261, file: !262, line: 85, baseType: !65, size: 128, offset: 11520)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !261, file: !262, line: 86, baseType: !65, size: 128, offset: 11648)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !261, file: !262, line: 87, baseType: !65, size: 128, offset: 11776)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !261, file: !262, line: 88, baseType: !65, size: 128, offset: 11904)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "particle", scope: !261, file: !262, line: 89, baseType: !65, size: 128, offset: 12032)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "palettes", scope: !261, file: !262, line: 90, baseType: !65, size: 128, offset: 12160)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "paintcurves", scope: !261, file: !262, line: 91, baseType: !65, size: 128, offset: 12288)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "wm", scope: !261, file: !262, line: 92, baseType: !65, size: 128, offset: 12416)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "gpencil", scope: !261, file: !262, line: 93, baseType: !65, size: 128, offset: 12544)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "movieclip", scope: !261, file: !262, line: 94, baseType: !65, size: 128, offset: 12672)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !261, file: !262, line: 95, baseType: !65, size: 128, offset: 12800)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "linestyle", scope: !261, file: !262, line: 96, baseType: !65, size: 128, offset: 12928)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "id_tag_update", scope: !261, file: !262, line: 98, baseType: !243, size: 2048, offset: 13056)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "eval_ctx", scope: !261, file: !262, line: 101, baseType: !315, size: 64, offset: 15104)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!316 = !DICompositeType(tag: DW_TAG_structure_type, name: "EvaluationContext", file: !262, line: 49, flags: DIFlagFwdDecl)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !261, file: !262, line: 103, baseType: !318, size: 64, offset: 15168)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!319 = !DICompositeType(tag: DW_TAG_structure_type, name: "MainLock", file: !262, line: 51, flags: DIFlagFwdDecl)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !15, file: !16, line: 191, baseType: !321, size: 64, offset: 8768)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "Scene", file: !323, line: 1299, baseType: !324)
!323 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!324 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !323, line: 1216, size: 39680, elements: !325)
!325 = !{!326, !327, !331, !604, !1109, !1110, !1111, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1138, !1350, !1353, !1596, !1608, !1609, !1610, !1611, !1612, !1613, !1614, !1615, !1618, !1619, !1620, !1621, !1622, !1630, !1696, !1703, !1704, !1711, !1714, !1715, !1716, !1717, !1718, !1719}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !324, file: !323, line: 1217, baseType: !100, size: 960)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !324, file: !323, line: 1218, baseType: !328, size: 64, offset: 960)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!329 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !330, line: 42, flags: DIFlagFwdDecl)
!330 = !DIFile(filename: "blender/source/blender/makesdna/DNA_lamp_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!331 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !324, file: !323, line: 1220, baseType: !332, size: 64, offset: 1024)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!333 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !93, line: 115, size: 11392, elements: !334)
!334 = !{!335, !336, !337, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !354, !364, !378, !379, !420, !421, !424, !425, !441, !442, !443, !444, !445, !446, !447, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !526, !527, !528, !529, !530, !531, !532, !533, !534, !537, !540, !541, !542, !543, !544, !545, !548, !551, !554, !555, !556, !557, !558, !559, !560, !561, !562, !565, !568, !571, !592, !593}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !333, file: !93, line: 116, baseType: !100, size: 960)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !333, file: !93, line: 117, baseType: !328, size: 64, offset: 960)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !333, file: !93, line: 119, baseType: !338, size: 64, offset: 1024)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!339 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !93, line: 57, flags: DIFlagFwdDecl)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !333, file: !93, line: 121, baseType: !29, size: 16, offset: 1088)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !333, file: !93, line: 121, baseType: !29, size: 16, offset: 1104)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !333, file: !93, line: 122, baseType: !27, size: 32, offset: 1120)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !333, file: !93, line: 122, baseType: !27, size: 32, offset: 1152)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !333, file: !93, line: 122, baseType: !27, size: 32, offset: 1184)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !333, file: !93, line: 123, baseType: !147, size: 512, offset: 1216)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !333, file: !93, line: 124, baseType: !332, size: 64, offset: 1728)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !333, file: !93, line: 124, baseType: !332, size: 64, offset: 1792)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !333, file: !93, line: 127, baseType: !332, size: 64, offset: 1856)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !333, file: !93, line: 127, baseType: !332, size: 64, offset: 1920)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !333, file: !93, line: 127, baseType: !332, size: 64, offset: 1984)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !333, file: !93, line: 128, baseType: !352, size: 64, offset: 2048)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !330, line: 45, flags: DIFlagFwdDecl)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !333, file: !93, line: 130, baseType: !355, size: 64, offset: 2112)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!356 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !93, line: 97, size: 832, elements: !357)
!357 = !{!358, !362, !363}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !356, file: !93, line: 98, baseType: !359, size: 768)
!359 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 768, elements: !360)
!360 = !{!361, !166}
!361 = !DISubrange(count: 8)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !356, file: !93, line: 99, baseType: !27, size: 32, offset: 768)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !356, file: !93, line: 99, baseType: !27, size: 32, offset: 800)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !333, file: !93, line: 131, baseType: !365, size: 64, offset: 2176)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!366 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !367, line: 486, size: 1600, elements: !368)
!367 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!368 = !{!369, !370, !371, !372, !373, !374, !375, !376, !377}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !366, file: !367, line: 487, baseType: !100, size: 960)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !366, file: !367, line: 489, baseType: !65, size: 128, offset: 960)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !366, file: !367, line: 490, baseType: !65, size: 128, offset: 1088)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !366, file: !367, line: 491, baseType: !65, size: 128, offset: 1216)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !366, file: !367, line: 492, baseType: !65, size: 128, offset: 1344)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !366, file: !367, line: 494, baseType: !27, size: 32, offset: 1472)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !366, file: !367, line: 495, baseType: !27, size: 32, offset: 1504)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !366, file: !367, line: 497, baseType: !27, size: 32, offset: 1536)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !366, file: !367, line: 498, baseType: !27, size: 32, offset: 1568)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !333, file: !93, line: 132, baseType: !365, size: 64, offset: 2240)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !333, file: !93, line: 133, baseType: !380, size: 64, offset: 2304)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!381 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !367, line: 334, size: 1728, elements: !382)
!382 = !{!383, !384, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !419}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !381, file: !367, line: 335, baseType: !65, size: 128)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !381, file: !367, line: 336, baseType: !385, size: 64, offset: 128)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!386 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !367, line: 47, flags: DIFlagFwdDecl)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !381, file: !367, line: 338, baseType: !29, size: 16, offset: 192)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !381, file: !367, line: 338, baseType: !29, size: 16, offset: 208)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !381, file: !367, line: 339, baseType: !84, size: 32, offset: 224)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !381, file: !367, line: 340, baseType: !27, size: 32, offset: 256)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !381, file: !367, line: 342, baseType: !51, size: 32, offset: 288)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !381, file: !367, line: 343, baseType: !164, size: 96, offset: 320)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !381, file: !367, line: 344, baseType: !164, size: 96, offset: 416)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !381, file: !367, line: 347, baseType: !65, size: 128, offset: 512)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !381, file: !367, line: 349, baseType: !27, size: 32, offset: 640)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !381, file: !367, line: 350, baseType: !27, size: 32, offset: 672)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !381, file: !367, line: 351, baseType: !4, size: 64, offset: 704)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !381, file: !367, line: 352, baseType: !4, size: 64, offset: 768)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !381, file: !367, line: 354, baseType: !400, size: 384, offset: 832)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !367, line: 116, baseType: !401)
!401 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !367, line: 94, size: 384, elements: !402)
!402 = !{!403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !401, file: !367, line: 96, baseType: !27, size: 32)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !401, file: !367, line: 96, baseType: !27, size: 32, offset: 32)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !401, file: !367, line: 97, baseType: !27, size: 32, offset: 64)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !401, file: !367, line: 97, baseType: !27, size: 32, offset: 96)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !401, file: !367, line: 99, baseType: !29, size: 16, offset: 128)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !401, file: !367, line: 100, baseType: !29, size: 16, offset: 144)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !401, file: !367, line: 102, baseType: !29, size: 16, offset: 160)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !401, file: !367, line: 105, baseType: !29, size: 16, offset: 176)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !401, file: !367, line: 108, baseType: !29, size: 16, offset: 192)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !401, file: !367, line: 109, baseType: !29, size: 16, offset: 208)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !401, file: !367, line: 111, baseType: !29, size: 16, offset: 224)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !401, file: !367, line: 112, baseType: !29, size: 16, offset: 240)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !401, file: !367, line: 114, baseType: !27, size: 32, offset: 256)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !401, file: !367, line: 114, baseType: !27, size: 32, offset: 288)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !401, file: !367, line: 115, baseType: !27, size: 32, offset: 320)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !401, file: !367, line: 115, baseType: !27, size: 32, offset: 352)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !381, file: !367, line: 355, baseType: !147, size: 512, offset: 1216)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !333, file: !93, line: 134, baseType: !4, size: 64, offset: 2368)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !333, file: !93, line: 136, baseType: !422, size: 64, offset: 2432)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!423 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !93, line: 58, flags: DIFlagFwdDecl)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !333, file: !93, line: 138, baseType: !400, size: 384, offset: 2496)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !333, file: !93, line: 139, baseType: !426, size: 64, offset: 2880)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !367, line: 80, baseType: !428)
!428 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !367, line: 72, size: 192, elements: !429)
!429 = !{!430, !437, !438, !439, !440}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !428, file: !367, line: 73, baseType: !431, size: 64)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !367, line: 59, baseType: !433)
!433 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !367, line: 56, size: 128, elements: !434)
!434 = !{!435, !436}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !433, file: !367, line: 57, baseType: !164, size: 96)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !433, file: !367, line: 58, baseType: !27, size: 32, offset: 96)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !428, file: !367, line: 74, baseType: !27, size: 32, offset: 64)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !428, file: !367, line: 76, baseType: !27, size: 32, offset: 96)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !428, file: !367, line: 77, baseType: !27, size: 32, offset: 128)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !428, file: !367, line: 79, baseType: !27, size: 32, offset: 160)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !333, file: !93, line: 141, baseType: !65, size: 128, offset: 2944)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !333, file: !93, line: 142, baseType: !65, size: 128, offset: 3072)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !333, file: !93, line: 143, baseType: !65, size: 128, offset: 3200)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !333, file: !93, line: 144, baseType: !65, size: 128, offset: 3328)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !333, file: !93, line: 146, baseType: !27, size: 32, offset: 3456)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !333, file: !93, line: 147, baseType: !27, size: 32, offset: 3488)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !333, file: !93, line: 150, baseType: !448, size: 64, offset: 3520)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !333, file: !93, line: 151, baseType: !179, size: 64, offset: 3584)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !333, file: !93, line: 152, baseType: !27, size: 32, offset: 3648)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !333, file: !93, line: 153, baseType: !27, size: 32, offset: 3680)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !333, file: !93, line: 156, baseType: !164, size: 96, offset: 3712)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !333, file: !93, line: 156, baseType: !164, size: 96, offset: 3808)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !333, file: !93, line: 156, baseType: !164, size: 96, offset: 3904)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !333, file: !93, line: 157, baseType: !164, size: 96, offset: 4000)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !333, file: !93, line: 158, baseType: !164, size: 96, offset: 4096)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !333, file: !93, line: 159, baseType: !164, size: 96, offset: 4192)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !333, file: !93, line: 160, baseType: !164, size: 96, offset: 4288)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !333, file: !93, line: 160, baseType: !164, size: 96, offset: 4384)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !333, file: !93, line: 161, baseType: !461, size: 128, offset: 4480)
!461 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 128, elements: !462)
!462 = !{!222}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !333, file: !93, line: 161, baseType: !461, size: 128, offset: 4608)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !333, file: !93, line: 162, baseType: !164, size: 96, offset: 4736)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !333, file: !93, line: 162, baseType: !164, size: 96, offset: 4832)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !333, file: !93, line: 163, baseType: !51, size: 32, offset: 4928)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !333, file: !93, line: 163, baseType: !51, size: 32, offset: 4960)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !333, file: !93, line: 164, baseType: !220, size: 512, offset: 4992)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !333, file: !93, line: 165, baseType: !220, size: 512, offset: 5504)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !333, file: !93, line: 166, baseType: !220, size: 512, offset: 6016)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !333, file: !93, line: 167, baseType: !220, size: 512, offset: 6528)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !333, file: !93, line: 176, baseType: !220, size: 512, offset: 7040)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !333, file: !93, line: 178, baseType: !84, size: 32, offset: 7552)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !333, file: !93, line: 180, baseType: !29, size: 16, offset: 7584)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !333, file: !93, line: 181, baseType: !29, size: 16, offset: 7600)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !333, file: !93, line: 183, baseType: !29, size: 16, offset: 7616)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !333, file: !93, line: 183, baseType: !29, size: 16, offset: 7632)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !333, file: !93, line: 184, baseType: !29, size: 16, offset: 7648)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !333, file: !93, line: 184, baseType: !29, size: 16, offset: 7664)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !333, file: !93, line: 185, baseType: !29, size: 16, offset: 7680)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !333, file: !93, line: 186, baseType: !29, size: 16, offset: 7696)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !333, file: !93, line: 187, baseType: !29, size: 16, offset: 7712)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !333, file: !93, line: 188, baseType: !23, size: 8, offset: 7728)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !333, file: !93, line: 189, baseType: !23, size: 8, offset: 7736)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !333, file: !93, line: 192, baseType: !27, size: 32, offset: 7744)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !333, file: !93, line: 192, baseType: !27, size: 32, offset: 7776)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !333, file: !93, line: 192, baseType: !27, size: 32, offset: 7808)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !333, file: !93, line: 192, baseType: !27, size: 32, offset: 7840)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !333, file: !93, line: 194, baseType: !27, size: 32, offset: 7872)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !333, file: !93, line: 202, baseType: !51, size: 32, offset: 7904)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !333, file: !93, line: 202, baseType: !51, size: 32, offset: 7936)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !333, file: !93, line: 202, baseType: !51, size: 32, offset: 7968)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !333, file: !93, line: 211, baseType: !51, size: 32, offset: 8000)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !333, file: !93, line: 212, baseType: !51, size: 32, offset: 8032)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !333, file: !93, line: 213, baseType: !51, size: 32, offset: 8064)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !333, file: !93, line: 214, baseType: !51, size: 32, offset: 8096)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !333, file: !93, line: 215, baseType: !51, size: 32, offset: 8128)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !333, file: !93, line: 216, baseType: !51, size: 32, offset: 8160)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !333, file: !93, line: 219, baseType: !51, size: 32, offset: 8192)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !333, file: !93, line: 220, baseType: !51, size: 32, offset: 8224)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !333, file: !93, line: 221, baseType: !51, size: 32, offset: 8256)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !333, file: !93, line: 224, baseType: !503, size: 16, offset: 8288)
!503 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !333, file: !93, line: 224, baseType: !503, size: 16, offset: 8304)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !333, file: !93, line: 226, baseType: !29, size: 16, offset: 8320)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !333, file: !93, line: 228, baseType: !23, size: 8, offset: 8336)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !333, file: !93, line: 229, baseType: !23, size: 8, offset: 8344)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !333, file: !93, line: 231, baseType: !29, size: 16, offset: 8352)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !333, file: !93, line: 232, baseType: !23, size: 8, offset: 8368)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !333, file: !93, line: 233, baseType: !23, size: 8, offset: 8376)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !333, file: !93, line: 234, baseType: !51, size: 32, offset: 8384)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !333, file: !93, line: 235, baseType: !51, size: 32, offset: 8416)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !333, file: !93, line: 237, baseType: !65, size: 128, offset: 8448)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !333, file: !93, line: 238, baseType: !65, size: 128, offset: 8576)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !333, file: !93, line: 239, baseType: !65, size: 128, offset: 8704)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !333, file: !93, line: 240, baseType: !65, size: 128, offset: 8832)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !333, file: !93, line: 242, baseType: !51, size: 32, offset: 8960)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !333, file: !93, line: 244, baseType: !29, size: 16, offset: 8992)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !333, file: !93, line: 245, baseType: !503, size: 16, offset: 9008)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !333, file: !93, line: 246, baseType: !461, size: 128, offset: 9024)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !333, file: !93, line: 248, baseType: !27, size: 32, offset: 9152)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !333, file: !93, line: 249, baseType: !27, size: 32, offset: 9184)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !333, file: !93, line: 251, baseType: !524, size: 64, offset: 9216)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64)
!525 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !93, line: 251, flags: DIFlagFwdDecl)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !333, file: !93, line: 253, baseType: !23, size: 8, offset: 9280)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !333, file: !93, line: 254, baseType: !23, size: 8, offset: 9288)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !333, file: !93, line: 255, baseType: !29, size: 16, offset: 9296)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !333, file: !93, line: 256, baseType: !164, size: 96, offset: 9312)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !333, file: !93, line: 258, baseType: !65, size: 128, offset: 9408)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !333, file: !93, line: 259, baseType: !65, size: 128, offset: 9536)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !333, file: !93, line: 260, baseType: !65, size: 128, offset: 9664)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !333, file: !93, line: 261, baseType: !65, size: 128, offset: 9792)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !333, file: !93, line: 263, baseType: !535, size: 64, offset: 9920)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64)
!536 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !93, line: 52, flags: DIFlagFwdDecl)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !333, file: !93, line: 264, baseType: !538, size: 64, offset: 9984)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64)
!539 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !93, line: 53, flags: DIFlagFwdDecl)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !333, file: !93, line: 265, baseType: !95, size: 64, offset: 10048)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !333, file: !93, line: 267, baseType: !23, size: 8, offset: 10112)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !333, file: !93, line: 268, baseType: !23, size: 8, offset: 10120)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !333, file: !93, line: 269, baseType: !29, size: 16, offset: 10128)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !333, file: !93, line: 270, baseType: !51, size: 32, offset: 10144)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !333, file: !93, line: 272, baseType: !546, size: 64, offset: 10176)
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64)
!547 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !93, line: 54, flags: DIFlagFwdDecl)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !333, file: !93, line: 275, baseType: !549, size: 64, offset: 10240)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64)
!550 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !93, line: 275, flags: DIFlagFwdDecl)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !333, file: !93, line: 277, baseType: !552, size: 64, offset: 10304)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64)
!553 = !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !93, line: 56, flags: DIFlagFwdDecl)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !333, file: !93, line: 277, baseType: !552, size: 64, offset: 10368)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !333, file: !93, line: 278, baseType: !272, size: 64, offset: 10432)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_mask", scope: !333, file: !93, line: 279, baseType: !272, size: 64, offset: 10496)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !333, file: !93, line: 280, baseType: !84, size: 32, offset: 10560)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !333, file: !93, line: 281, baseType: !84, size: 32, offset: 10592)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "gpulamp", scope: !333, file: !93, line: 283, baseType: !65, size: 128, offset: 10624)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "pc_ids", scope: !333, file: !93, line: 284, baseType: !65, size: 128, offset: 10752)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "duplilist", scope: !333, file: !93, line: 285, baseType: !254, size: 64, offset: 10880)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_object", scope: !333, file: !93, line: 287, baseType: !563, size: 64, offset: 10944)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64)
!564 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyOb", file: !93, line: 59, flags: DIFlagFwdDecl)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_constraint", scope: !333, file: !93, line: 288, baseType: !566, size: 64, offset: 11008)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64)
!567 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyCon", file: !93, line: 288, flags: DIFlagFwdDecl)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "ima_ofs", scope: !333, file: !93, line: 290, baseType: !569, size: 64, offset: 11072)
!569 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 64, elements: !570)
!570 = !{!251}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !333, file: !93, line: 291, baseType: !572, size: 64, offset: 11136)
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 64)
!573 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageUser", file: !574, line: 65, baseType: !575)
!574 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!575 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !574, line: 50, size: 320, elements: !576)
!576 = !{!577, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !575, file: !574, line: 51, baseType: !578, size: 64)
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !575, file: !574, line: 53, baseType: !27, size: 32, offset: 64)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !575, file: !574, line: 54, baseType: !27, size: 32, offset: 96)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !575, file: !574, line: 55, baseType: !27, size: 32, offset: 128)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !575, file: !574, line: 55, baseType: !27, size: 32, offset: 160)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !575, file: !574, line: 56, baseType: !23, size: 8, offset: 192)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "cycl", scope: !575, file: !574, line: 56, baseType: !23, size: 8, offset: 200)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !575, file: !574, line: 57, baseType: !23, size: 8, offset: 208)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !575, file: !574, line: 57, baseType: !23, size: 8, offset: 216)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "multi_index", scope: !575, file: !574, line: 59, baseType: !29, size: 16, offset: 224)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !575, file: !574, line: 59, baseType: !29, size: 16, offset: 240)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !575, file: !574, line: 59, baseType: !29, size: 16, offset: 256)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !575, file: !574, line: 61, baseType: !29, size: 16, offset: 272)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !575, file: !574, line: 63, baseType: !27, size: 32, offset: 288)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "lodlevels", scope: !333, file: !93, line: 293, baseType: !65, size: 128, offset: 11200)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "currentlod", scope: !333, file: !93, line: 294, baseType: !594, size: 64, offset: 11328)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 64)
!595 = !DIDerivedType(tag: DW_TAG_typedef, name: "LodLevel", file: !93, line: 113, baseType: !596)
!596 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LodLevel", file: !93, line: 108, size: 256, elements: !597)
!597 = !{!598, !600, !601, !602, !603}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !596, file: !93, line: 109, baseType: !599, size: 64)
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !596, file: !93, line: 109, baseType: !599, size: 64, offset: 64)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !596, file: !93, line: 110, baseType: !332, size: 64, offset: 128)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !596, file: !93, line: 111, baseType: !27, size: 32, offset: 192)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "distance", scope: !596, file: !93, line: 112, baseType: !51, size: 32, offset: 224)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !324, file: !323, line: 1221, baseType: !605, size: 64, offset: 1088)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!606 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !607, line: 52, size: 4224, elements: !608)
!607 = !DIFile(filename: "blender/source/blender/makesdna/DNA_world_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!608 = !{!609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !1104, !1105, !1106, !1107, !1108}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !606, file: !607, line: 53, baseType: !100, size: 960)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !606, file: !607, line: 54, baseType: !328, size: 64, offset: 960)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "colormodel", scope: !606, file: !607, line: 56, baseType: !29, size: 16, offset: 1024)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "totex", scope: !606, file: !607, line: 56, baseType: !29, size: 16, offset: 1040)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "texact", scope: !606, file: !607, line: 57, baseType: !29, size: 16, offset: 1056)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "mistype", scope: !606, file: !607, line: 57, baseType: !29, size: 16, offset: 1072)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "horr", scope: !606, file: !607, line: 59, baseType: !51, size: 32, offset: 1088)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "horg", scope: !606, file: !607, line: 59, baseType: !51, size: 32, offset: 1120)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "horb", scope: !606, file: !607, line: 59, baseType: !51, size: 32, offset: 1152)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "zenr", scope: !606, file: !607, line: 60, baseType: !51, size: 32, offset: 1184)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "zeng", scope: !606, file: !607, line: 60, baseType: !51, size: 32, offset: 1216)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "zenb", scope: !606, file: !607, line: 60, baseType: !51, size: 32, offset: 1248)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "ambr", scope: !606, file: !607, line: 61, baseType: !51, size: 32, offset: 1280)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "ambg", scope: !606, file: !607, line: 61, baseType: !51, size: 32, offset: 1312)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "ambb", scope: !606, file: !607, line: 61, baseType: !51, size: 32, offset: 1344)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "exposure", scope: !606, file: !607, line: 68, baseType: !51, size: 32, offset: 1376)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !606, file: !607, line: 68, baseType: !51, size: 32, offset: 1408)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !606, file: !607, line: 68, baseType: !51, size: 32, offset: 1440)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "linfac", scope: !606, file: !607, line: 69, baseType: !51, size: 32, offset: 1472)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "logfac", scope: !606, file: !607, line: 69, baseType: !51, size: 32, offset: 1504)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !606, file: !607, line: 74, baseType: !51, size: 32, offset: 1536)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "activityBoxRadius", scope: !606, file: !607, line: 79, baseType: !51, size: 32, offset: 1568)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "skytype", scope: !606, file: !607, line: 81, baseType: !29, size: 16, offset: 1600)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !606, file: !607, line: 91, baseType: !29, size: 16, offset: 1616)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "occlusionRes", scope: !606, file: !607, line: 92, baseType: !29, size: 16, offset: 1632)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "physicsEngine", scope: !606, file: !607, line: 93, baseType: !29, size: 16, offset: 1648)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "ticrate", scope: !606, file: !607, line: 94, baseType: !29, size: 16, offset: 1664)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "maxlogicstep", scope: !606, file: !607, line: 94, baseType: !29, size: 16, offset: 1680)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "physubstep", scope: !606, file: !607, line: 94, baseType: !29, size: 16, offset: 1696)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "maxphystep", scope: !606, file: !607, line: 94, baseType: !29, size: 16, offset: 1712)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "misi", scope: !606, file: !607, line: 96, baseType: !51, size: 32, offset: 1728)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "miststa", scope: !606, file: !607, line: 96, baseType: !51, size: 32, offset: 1760)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "mistdist", scope: !606, file: !607, line: 96, baseType: !51, size: 32, offset: 1792)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "misthi", scope: !606, file: !607, line: 96, baseType: !51, size: 32, offset: 1824)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "starr", scope: !606, file: !607, line: 98, baseType: !51, size: 32, offset: 1856)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "starg", scope: !606, file: !607, line: 98, baseType: !51, size: 32, offset: 1888)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "starb", scope: !606, file: !607, line: 98, baseType: !51, size: 32, offset: 1920)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "stark", scope: !606, file: !607, line: 98, baseType: !51, size: 32, offset: 1952)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "starsize", scope: !606, file: !607, line: 99, baseType: !51, size: 32, offset: 1984)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "starmindist", scope: !606, file: !607, line: 99, baseType: !51, size: 32, offset: 2016)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "stardist", scope: !606, file: !607, line: 100, baseType: !51, size: 32, offset: 2048)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "starcolnoise", scope: !606, file: !607, line: 100, baseType: !51, size: 32, offset: 2080)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "dofsta", scope: !606, file: !607, line: 103, baseType: !29, size: 16, offset: 2112)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "dofend", scope: !606, file: !607, line: 103, baseType: !29, size: 16, offset: 2128)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "dofmin", scope: !606, file: !607, line: 103, baseType: !29, size: 16, offset: 2144)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "dofmax", scope: !606, file: !607, line: 103, baseType: !29, size: 16, offset: 2160)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "aodist", scope: !606, file: !607, line: 106, baseType: !51, size: 32, offset: 2176)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "aodistfac", scope: !606, file: !607, line: 106, baseType: !51, size: 32, offset: 2208)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "aoenergy", scope: !606, file: !607, line: 106, baseType: !51, size: 32, offset: 2240)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "aobias", scope: !606, file: !607, line: 106, baseType: !51, size: 32, offset: 2272)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "aomode", scope: !606, file: !607, line: 107, baseType: !29, size: 16, offset: 2304)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "aosamp", scope: !606, file: !607, line: 107, baseType: !29, size: 16, offset: 2320)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "aomix", scope: !606, file: !607, line: 107, baseType: !29, size: 16, offset: 2336)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "aocolor", scope: !606, file: !607, line: 107, baseType: !29, size: 16, offset: 2352)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "ao_adapt_thresh", scope: !606, file: !607, line: 108, baseType: !51, size: 32, offset: 2368)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "ao_adapt_speed_fac", scope: !606, file: !607, line: 108, baseType: !51, size: 32, offset: 2400)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_error", scope: !606, file: !607, line: 109, baseType: !51, size: 32, offset: 2432)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_correction", scope: !606, file: !607, line: 109, baseType: !51, size: 32, offset: 2464)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "ao_indirect_energy", scope: !606, file: !607, line: 110, baseType: !51, size: 32, offset: 2496)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "ao_env_energy", scope: !606, file: !607, line: 110, baseType: !51, size: 32, offset: 2528)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "ao_pad2", scope: !606, file: !607, line: 110, baseType: !51, size: 32, offset: 2560)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "ao_indirect_bounces", scope: !606, file: !607, line: 111, baseType: !29, size: 16, offset: 2592)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "ao_pad", scope: !606, file: !607, line: 111, baseType: !29, size: 16, offset: 2608)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "ao_samp_method", scope: !606, file: !607, line: 112, baseType: !29, size: 16, offset: 2624)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "ao_gather_method", scope: !606, file: !607, line: 112, baseType: !29, size: 16, offset: 2640)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_passes", scope: !606, file: !607, line: 112, baseType: !29, size: 16, offset: 2656)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !606, file: !607, line: 115, baseType: !29, size: 16, offset: 2672)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "aosphere", scope: !606, file: !607, line: 118, baseType: !50, size: 64, offset: 2688)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "aotables", scope: !606, file: !607, line: 118, baseType: !50, size: 64, offset: 2752)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !606, file: !607, line: 121, baseType: !352, size: 64, offset: 2816)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "mtex", scope: !606, file: !607, line: 122, baseType: !680, size: 1152, offset: 2880)
!680 = !DICompositeType(tag: DW_TAG_array_type, baseType: !681, size: 1152, elements: !1102)
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64)
!682 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTex", file: !683, line: 57, size: 2496, elements: !684)
!683 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!684 = !{!685, !686, !687, !688, !689, !690, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !682, file: !683, line: 59, baseType: !29, size: 16)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !682, file: !683, line: 59, baseType: !29, size: 16, offset: 16)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "maptoneg", scope: !682, file: !683, line: 59, baseType: !29, size: 16, offset: 32)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "blendtype", scope: !682, file: !683, line: 59, baseType: !29, size: 16, offset: 48)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !682, file: !683, line: 60, baseType: !332, size: 64, offset: 64)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "tex", scope: !682, file: !683, line: 61, baseType: !691, size: 64, offset: 128)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 64)
!692 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Tex", file: !683, line: 202, size: 3328, elements: !693)
!693 = !{!694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !749, !750, !830, !853, !943, !944, !1012, !1033, !1041, !1042}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !692, file: !683, line: 203, baseType: !100, size: 960)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !692, file: !683, line: 204, baseType: !328, size: 64, offset: 960)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "noisesize", scope: !692, file: !683, line: 206, baseType: !51, size: 32, offset: 1024)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "turbul", scope: !692, file: !683, line: 206, baseType: !51, size: 32, offset: 1056)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "bright", scope: !692, file: !683, line: 207, baseType: !51, size: 32, offset: 1088)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "contrast", scope: !692, file: !683, line: 207, baseType: !51, size: 32, offset: 1120)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "saturation", scope: !692, file: !683, line: 207, baseType: !51, size: 32, offset: 1152)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "rfac", scope: !692, file: !683, line: 207, baseType: !51, size: 32, offset: 1184)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "gfac", scope: !692, file: !683, line: 207, baseType: !51, size: 32, offset: 1216)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "bfac", scope: !692, file: !683, line: 207, baseType: !51, size: 32, offset: 1248)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "filtersize", scope: !692, file: !683, line: 208, baseType: !51, size: 32, offset: 1280)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !692, file: !683, line: 208, baseType: !51, size: 32, offset: 1312)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "mg_H", scope: !692, file: !683, line: 211, baseType: !51, size: 32, offset: 1344)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "mg_lacunarity", scope: !692, file: !683, line: 211, baseType: !51, size: 32, offset: 1376)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "mg_octaves", scope: !692, file: !683, line: 211, baseType: !51, size: 32, offset: 1408)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "mg_offset", scope: !692, file: !683, line: 211, baseType: !51, size: 32, offset: 1440)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "mg_gain", scope: !692, file: !683, line: 211, baseType: !51, size: 32, offset: 1472)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "dist_amount", scope: !692, file: !683, line: 214, baseType: !51, size: 32, offset: 1504)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "ns_outscale", scope: !692, file: !683, line: 214, baseType: !51, size: 32, offset: 1536)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w1", scope: !692, file: !683, line: 217, baseType: !51, size: 32, offset: 1568)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w2", scope: !692, file: !683, line: 218, baseType: !51, size: 32, offset: 1600)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w3", scope: !692, file: !683, line: 219, baseType: !51, size: 32, offset: 1632)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w4", scope: !692, file: !683, line: 220, baseType: !51, size: 32, offset: 1664)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "vn_mexp", scope: !692, file: !683, line: 221, baseType: !51, size: 32, offset: 1696)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "vn_distm", scope: !692, file: !683, line: 222, baseType: !29, size: 16, offset: 1728)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "vn_coltype", scope: !692, file: !683, line: 222, baseType: !29, size: 16, offset: 1744)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "noisedepth", scope: !692, file: !683, line: 224, baseType: !29, size: 16, offset: 1760)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "noisetype", scope: !692, file: !683, line: 224, baseType: !29, size: 16, offset: 1776)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis", scope: !692, file: !683, line: 227, baseType: !29, size: 16, offset: 1792)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis2", scope: !692, file: !683, line: 227, baseType: !29, size: 16, offset: 1808)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "imaflag", scope: !692, file: !683, line: 229, baseType: !29, size: 16, offset: 1824)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !692, file: !683, line: 229, baseType: !29, size: 16, offset: 1840)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !692, file: !683, line: 230, baseType: !29, size: 16, offset: 1856)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "stype", scope: !692, file: !683, line: 230, baseType: !29, size: 16, offset: 1872)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmin", scope: !692, file: !683, line: 232, baseType: !51, size: 32, offset: 1888)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "cropymin", scope: !692, file: !683, line: 232, baseType: !51, size: 32, offset: 1920)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmax", scope: !692, file: !683, line: 232, baseType: !51, size: 32, offset: 1952)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "cropymax", scope: !692, file: !683, line: 232, baseType: !51, size: 32, offset: 1984)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "texfilter", scope: !692, file: !683, line: 233, baseType: !27, size: 32, offset: 2016)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "afmax", scope: !692, file: !683, line: 234, baseType: !27, size: 32, offset: 2048)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "xrepeat", scope: !692, file: !683, line: 235, baseType: !29, size: 16, offset: 2080)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "yrepeat", scope: !692, file: !683, line: 235, baseType: !29, size: 16, offset: 2096)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "extend", scope: !692, file: !683, line: 236, baseType: !29, size: 16, offset: 2112)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !692, file: !683, line: 239, baseType: !29, size: 16, offset: 2128)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !692, file: !683, line: 240, baseType: !27, size: 32, offset: 2144)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !692, file: !683, line: 241, baseType: !27, size: 32, offset: 2176)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !692, file: !683, line: 241, baseType: !27, size: 32, offset: 2208)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !692, file: !683, line: 241, baseType: !27, size: 32, offset: 2240)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "checkerdist", scope: !692, file: !683, line: 243, baseType: !51, size: 32, offset: 2272)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "nabla", scope: !692, file: !683, line: 243, baseType: !51, size: 32, offset: 2304)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !692, file: !683, line: 244, baseType: !51, size: 32, offset: 2336)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !692, file: !683, line: 246, baseType: !575, size: 320, offset: 2368)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !692, file: !683, line: 248, baseType: !747, size: 64, offset: 2688)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64)
!748 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !330, line: 43, flags: DIFlagFwdDecl)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !692, file: !683, line: 249, baseType: !352, size: 64, offset: 2752)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "ima", scope: !692, file: !683, line: 250, baseType: !751, size: 64, offset: 2816)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64)
!752 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !574, line: 77, size: 15424, elements: !753)
!753 = !{!754, !755, !756, !759, !762, !766, !767, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !786, !787, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !819, !820, !824}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !752, file: !574, line: 78, baseType: !100, size: 960)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !752, file: !574, line: 80, baseType: !119, size: 8192, offset: 960)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !752, file: !574, line: 82, baseType: !757, size: 64, offset: 9152)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 64)
!758 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !574, line: 43, flags: DIFlagFwdDecl)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !752, file: !574, line: 83, baseType: !760, size: 64, offset: 9216)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64)
!761 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !101, line: 46, flags: DIFlagFwdDecl)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !752, file: !574, line: 86, baseType: !763, size: 64, offset: 9280)
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 64)
!764 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !765, line: 85, flags: DIFlagFwdDecl)
!765 = !DIFile(filename: "blender/source/blender/imbuf/IMB_imbuf.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!766 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !752, file: !574, line: 87, baseType: !41, size: 64, offset: 9344)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !752, file: !574, line: 89, baseType: !768, size: 512, offset: 9408)
!768 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 512, elements: !769)
!769 = !{!361}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !752, file: !574, line: 90, baseType: !29, size: 16, offset: 9920)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !752, file: !574, line: 90, baseType: !29, size: 16, offset: 9936)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !752, file: !574, line: 92, baseType: !29, size: 16, offset: 9952)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !752, file: !574, line: 92, baseType: !29, size: 16, offset: 9968)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !752, file: !574, line: 93, baseType: !29, size: 16, offset: 9984)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !752, file: !574, line: 93, baseType: !29, size: 16, offset: 10000)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !752, file: !574, line: 94, baseType: !27, size: 32, offset: 10016)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !752, file: !574, line: 97, baseType: !29, size: 16, offset: 10048)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !752, file: !574, line: 97, baseType: !29, size: 16, offset: 10064)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !752, file: !574, line: 98, baseType: !29, size: 16, offset: 10080)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !752, file: !574, line: 98, baseType: !29, size: 16, offset: 10096)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !752, file: !574, line: 99, baseType: !29, size: 16, offset: 10112)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !752, file: !574, line: 99, baseType: !29, size: 16, offset: 10128)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !752, file: !574, line: 100, baseType: !84, size: 32, offset: 10144)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !752, file: !574, line: 101, baseType: !785, size: 64, offset: 10176)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !752, file: !574, line: 103, baseType: !125, size: 64, offset: 10240)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !752, file: !574, line: 104, baseType: !788, size: 64, offset: 10304)
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !789, size: 64)
!789 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !101, line: 159, size: 448, elements: !790)
!790 = !{!791, !793, !794, !796, !797, !799}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !789, file: !101, line: 161, baseType: !792, size: 64)
!792 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 64, elements: !570)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !789, file: !101, line: 162, baseType: !792, size: 64, offset: 64)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !789, file: !101, line: 163, baseType: !795, size: 32, offset: 128)
!795 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 32, elements: !570)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !789, file: !101, line: 164, baseType: !795, size: 32, offset: 160)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !789, file: !101, line: 165, baseType: !798, size: 128, offset: 192)
!798 = !DICompositeType(tag: DW_TAG_array_type, baseType: !785, size: 128, elements: !570)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !789, file: !101, line: 166, baseType: !800, size: 128, offset: 320)
!800 = !DICompositeType(tag: DW_TAG_array_type, baseType: !760, size: 128, elements: !570)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !752, file: !574, line: 107, baseType: !51, size: 32, offset: 10368)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !752, file: !574, line: 108, baseType: !27, size: 32, offset: 10400)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !752, file: !574, line: 109, baseType: !29, size: 16, offset: 10432)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !752, file: !574, line: 110, baseType: !29, size: 16, offset: 10448)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !752, file: !574, line: 113, baseType: !27, size: 32, offset: 10464)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !752, file: !574, line: 113, baseType: !27, size: 32, offset: 10496)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !752, file: !574, line: 114, baseType: !23, size: 8, offset: 10528)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !752, file: !574, line: 114, baseType: !23, size: 8, offset: 10536)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !752, file: !574, line: 115, baseType: !29, size: 16, offset: 10544)
