; ModuleID = 'blender/source/blender/render/intern/source/sss.c'
source_filename = "blender/source/blender/render/intern/source/sss.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.Global = type { %struct.Main*, [1024 x i8], [1024 x i8], i8, i8, i8, %struct.ListBase, i8, i8, i8, i16, i16, i16, i8, i16, i32, i32, i8, i32, i32, [200 x i8] }
%struct.Main = type { %struct.Main*, %struct.Main*, [1024 x i8], i16, i16, i16, i16, i64, [16 x i8], i16, %struct.Library*, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, [256 x i8], %struct.EvaluationContext*, %struct.MainLock* }
%struct.Library = type { %struct.ID, %struct.ID*, %struct.FileData*, [1024 x i8], [1024 x i8], %struct.Library*, %struct.PackedFile* }
%struct.ID = type { i8*, i8*, %struct.ID*, %struct.Library*, [66 x i8], i16, i32, i32, i32, %struct.IDProperty* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "blender/source/blender/render/intern/source/sss.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!2 = !{}
!3 = !{!4, !5, !6, !7}
!4 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!6 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!8 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_gh_Entry", file: !9, line: 94, size: 192, elements: !10)
!9 = !DIFile(filename: "blender/source/blender/blenlib/BLI_ghash.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!10 = !{!11, !12, !13}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !8, file: !9, line: 94, baseType: !5, size: 64)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !8, file: !9, line: 94, baseType: !5, size: 64, offset: 64)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !8, file: !9, line: 94, baseType: !5, size: 64, offset: 128)
!14 = !{i32 7, !"Dwarf Version", i32 4}
!15 = !{i32 2, !"Debug Info Version", i32 3}
!16 = !{i32 1, !"wchar_size", i32 4}
!17 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!18 = distinct !DISubprogram(name: "scatter_settings_new", scope: !1, file: !1, line: 298, type: !19, scopeLine: 299, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!19 = !DISubroutineType(types: !20)
!20 = !{!21, !4, !4, !4, !4, !4, !4}
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "ScatterSettings", file: !23, line: 39, baseType: !24)
!23 = !DIFile(filename: "blender/source/blender/render/intern/include/sss.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!24 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ScatterSettings", file: !1, line: 97, size: 704, elements: !25)
!25 = !{!26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !45}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "eta", scope: !24, file: !1, line: 98, baseType: !4, size: 32)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "sigma_a", scope: !24, file: !1, line: 99, baseType: !4, size: 32, offset: 32)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "sigma_s_", scope: !24, file: !1, line: 100, baseType: !4, size: 32, offset: 64)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "sigma_t_", scope: !24, file: !1, line: 101, baseType: !4, size: 32, offset: 96)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "sigma", scope: !24, file: !1, line: 102, baseType: !4, size: 32, offset: 128)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "Fdr", scope: !24, file: !1, line: 103, baseType: !4, size: 32, offset: 160)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "D", scope: !24, file: !1, line: 104, baseType: !4, size: 32, offset: 192)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "A", scope: !24, file: !1, line: 105, baseType: !4, size: 32, offset: 224)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_", scope: !24, file: !1, line: 106, baseType: !4, size: 32, offset: 256)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "zr", scope: !24, file: !1, line: 107, baseType: !4, size: 32, offset: 288)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "zv", scope: !24, file: !1, line: 108, baseType: !4, size: 32, offset: 320)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "ld", scope: !24, file: !1, line: 109, baseType: !4, size: 32, offset: 352)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "ro", scope: !24, file: !1, line: 110, baseType: !4, size: 32, offset: 384)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !24, file: !1, line: 111, baseType: !4, size: 32, offset: 416)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "invsigma_t_", scope: !24, file: !1, line: 112, baseType: !4, size: 32, offset: 448)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "frontweight", scope: !24, file: !1, line: 113, baseType: !4, size: 32, offset: 480)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "backweight", scope: !24, file: !1, line: 114, baseType: !4, size: 32, offset: 512)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "tableRd", scope: !24, file: !1, line: 116, baseType: !44, size: 64, offset: 576)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "tableRd2", scope: !24, file: !1, line: 117, baseType: !44, size: 64, offset: 640)
!46 = !DILocalVariable(name: "refl", arg: 1, scope: !18, file: !1, line: 298, type: !4)
!47 = !DILocation(line: 298, column: 45, scope: !18)
!48 = !DILocalVariable(name: "radius", arg: 2, scope: !18, file: !1, line: 298, type: !4)
!49 = !DILocation(line: 298, column: 57, scope: !18)
!50 = !DILocalVariable(name: "ior", arg: 3, scope: !18, file: !1, line: 298, type: !4)
!51 = !DILocation(line: 298, column: 71, scope: !18)
!52 = !DILocalVariable(name: "reflfac", arg: 4, scope: !18, file: !1, line: 298, type: !4)
!53 = !DILocation(line: 298, column: 82, scope: !18)
!54 = !DILocalVariable(name: "frontweight", arg: 5, scope: !18, file: !1, line: 298, type: !4)
!55 = !DILocation(line: 298, column: 97, scope: !18)
!56 = !DILocalVariable(name: "backweight", arg: 6, scope: !18, file: !1, line: 298, type: !4)
!57 = !DILocation(line: 298, column: 116, scope: !18)
!58 = !DILocalVariable(name: "ss", scope: !18, file: !1, line: 300, type: !21)
!59 = !DILocation(line: 300, column: 19, scope: !18)
!60 = !DILocation(line: 302, column: 6, scope: !18)
!61 = !DILocation(line: 302, column: 4, scope: !18)
!62 = !DILocation(line: 305, column: 11, scope: !18)
!63 = !DILocation(line: 305, column: 2, scope: !18)
!64 = !DILocation(line: 305, column: 6, scope: !18)
!65 = !DILocation(line: 305, column: 9, scope: !18)
!66 = !DILocation(line: 306, column: 19, scope: !18)
!67 = !DILocation(line: 306, column: 18, scope: !18)
!68 = !DILocation(line: 306, column: 23, scope: !18)
!69 = !DILocation(line: 306, column: 22, scope: !18)
!70 = !DILocation(line: 306, column: 36, scope: !18)
!71 = !DILocation(line: 306, column: 35, scope: !18)
!72 = !DILocation(line: 306, column: 27, scope: !18)
!73 = !DILocation(line: 306, column: 40, scope: !18)
!74 = !DILocation(line: 306, column: 59, scope: !18)
!75 = !DILocation(line: 306, column: 58, scope: !18)
!76 = !DILocation(line: 306, column: 49, scope: !18)
!77 = !DILocation(line: 306, column: 2, scope: !18)
!78 = !DILocation(line: 306, column: 6, scope: !18)
!79 = !DILocation(line: 306, column: 9, scope: !18)
!80 = !DILocation(line: 307, column: 17, scope: !18)
!81 = !DILocation(line: 307, column: 21, scope: !18)
!82 = !DILocation(line: 307, column: 15, scope: !18)
!83 = !DILocation(line: 307, column: 34, scope: !18)
!84 = !DILocation(line: 307, column: 38, scope: !18)
!85 = !DILocation(line: 307, column: 32, scope: !18)
!86 = !DILocation(line: 307, column: 25, scope: !18)
!87 = !DILocation(line: 307, column: 2, scope: !18)
!88 = !DILocation(line: 307, column: 6, scope: !18)
!89 = !DILocation(line: 307, column: 7, scope: !18)
!90 = !DILocation(line: 308, column: 10, scope: !18)
!91 = !DILocation(line: 308, column: 2, scope: !18)
!92 = !DILocation(line: 308, column: 6, scope: !18)
!93 = !DILocation(line: 308, column: 8, scope: !18)
!94 = !DILocation(line: 309, column: 17, scope: !18)
!95 = !DILocation(line: 309, column: 10, scope: !18)
!96 = !DILocation(line: 309, column: 2, scope: !18)
!97 = !DILocation(line: 309, column: 6, scope: !18)
!98 = !DILocation(line: 309, column: 8, scope: !18)
!99 = !DILocation(line: 310, column: 13, scope: !18)
!100 = !DILocation(line: 310, column: 17, scope: !18)
!101 = !DILocation(line: 310, column: 20, scope: !18)
!102 = !DILocation(line: 310, column: 19, scope: !18)
!103 = !DILocation(line: 310, column: 36, scope: !18)
!104 = !DILocation(line: 310, column: 35, scope: !18)
!105 = !DILocation(line: 310, column: 28, scope: !18)
!106 = !DILocation(line: 310, column: 2, scope: !18)
!107 = !DILocation(line: 310, column: 6, scope: !18)
!108 = !DILocation(line: 310, column: 11, scope: !18)
!109 = !DILocation(line: 312, column: 37, scope: !18)
!110 = !DILocation(line: 312, column: 14, scope: !18)
!111 = !DILocation(line: 312, column: 2, scope: !18)
!112 = !DILocation(line: 312, column: 6, scope: !18)
!113 = !DILocation(line: 312, column: 12, scope: !18)
!114 = !DILocation(line: 314, column: 18, scope: !18)
!115 = !DILocation(line: 314, column: 22, scope: !18)
!116 = !DILocation(line: 314, column: 17, scope: !18)
!117 = !DILocation(line: 314, column: 2, scope: !18)
!118 = !DILocation(line: 314, column: 6, scope: !18)
!119 = !DILocation(line: 314, column: 11, scope: !18)
!120 = !DILocation(line: 315, column: 16, scope: !18)
!121 = !DILocation(line: 315, column: 20, scope: !18)
!122 = !DILocation(line: 315, column: 45, scope: !18)
!123 = !DILocation(line: 315, column: 49, scope: !18)
!124 = !DILocation(line: 315, column: 43, scope: !18)
!125 = !DILocation(line: 315, column: 36, scope: !18)
!126 = !DILocation(line: 315, column: 26, scope: !18)
!127 = !DILocation(line: 315, column: 25, scope: !18)
!128 = !DILocation(line: 315, column: 2, scope: !18)
!129 = !DILocation(line: 315, column: 6, scope: !18)
!130 = !DILocation(line: 315, column: 14, scope: !18)
!131 = !DILocation(line: 316, column: 16, scope: !18)
!132 = !DILocation(line: 316, column: 20, scope: !18)
!133 = !DILocation(line: 316, column: 27, scope: !18)
!134 = !DILocation(line: 316, column: 31, scope: !18)
!135 = !DILocation(line: 316, column: 26, scope: !18)
!136 = !DILocation(line: 316, column: 2, scope: !18)
!137 = !DILocation(line: 316, column: 6, scope: !18)
!138 = !DILocation(line: 316, column: 14, scope: !18)
!139 = !DILocation(line: 317, column: 15, scope: !18)
!140 = !DILocation(line: 317, column: 19, scope: !18)
!141 = !DILocation(line: 317, column: 30, scope: !18)
!142 = !DILocation(line: 317, column: 34, scope: !18)
!143 = !DILocation(line: 317, column: 28, scope: !18)
!144 = !DILocation(line: 317, column: 2, scope: !18)
!145 = !DILocation(line: 317, column: 6, scope: !18)
!146 = !DILocation(line: 317, column: 13, scope: !18)
!147 = !DILocation(line: 319, column: 20, scope: !18)
!148 = !DILocation(line: 319, column: 24, scope: !18)
!149 = !DILocation(line: 319, column: 19, scope: !18)
!150 = !DILocation(line: 319, column: 13, scope: !18)
!151 = !DILocation(line: 319, column: 2, scope: !18)
!152 = !DILocation(line: 319, column: 6, scope: !18)
!153 = !DILocation(line: 319, column: 7, scope: !18)
!154 = !DILocation(line: 321, column: 15, scope: !18)
!155 = !DILocation(line: 321, column: 19, scope: !18)
!156 = !DILocation(line: 321, column: 14, scope: !18)
!157 = !DILocation(line: 321, column: 2, scope: !18)
!158 = !DILocation(line: 321, column: 6, scope: !18)
!159 = !DILocation(line: 321, column: 8, scope: !18)
!160 = !DILocation(line: 322, column: 10, scope: !18)
!161 = !DILocation(line: 322, column: 14, scope: !18)
!162 = !DILocation(line: 322, column: 24, scope: !18)
!163 = !DILocation(line: 322, column: 28, scope: !18)
!164 = !DILocation(line: 322, column: 23, scope: !18)
!165 = !DILocation(line: 322, column: 30, scope: !18)
!166 = !DILocation(line: 322, column: 34, scope: !18)
!167 = !DILocation(line: 322, column: 29, scope: !18)
!168 = !DILocation(line: 322, column: 17, scope: !18)
!169 = !DILocation(line: 322, column: 2, scope: !18)
!170 = !DILocation(line: 322, column: 6, scope: !18)
!171 = !DILocation(line: 322, column: 8, scope: !18)
!172 = !DILocation(line: 324, column: 24, scope: !18)
!173 = !DILocation(line: 324, column: 28, scope: !18)
!174 = !DILocation(line: 324, column: 23, scope: !18)
!175 = !DILocation(line: 324, column: 2, scope: !18)
!176 = !DILocation(line: 324, column: 6, scope: !18)
!177 = !DILocation(line: 324, column: 17, scope: !18)
!178 = !DILocation(line: 326, column: 19, scope: !18)
!179 = !DILocation(line: 326, column: 2, scope: !18)
!180 = !DILocation(line: 326, column: 6, scope: !18)
!181 = !DILocation(line: 326, column: 17, scope: !18)
!182 = !DILocation(line: 327, column: 18, scope: !18)
!183 = !DILocation(line: 327, column: 2, scope: !18)
!184 = !DILocation(line: 327, column: 6, scope: !18)
!185 = !DILocation(line: 327, column: 16, scope: !18)
!186 = !DILocation(line: 330, column: 17, scope: !18)
!187 = !DILocation(line: 330, column: 2, scope: !18)
!188 = !DILocation(line: 332, column: 9, scope: !18)
!189 = !DILocation(line: 332, column: 2, scope: !18)
!190 = distinct !DISubprogram(name: "min_ff", scope: !191, file: !191, line: 202, type: !192, scopeLine: 203, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !2)
!191 = !DIFile(filename: "blender/source/blender/blenlib/intern/math_base_inline.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!192 = !DISubroutineType(types: !193)
!193 = !{!4, !4, !4}
!194 = !DILocalVariable(name: "a", arg: 1, scope: !190, file: !191, line: 202, type: !4)
!195 = !DILocation(line: 202, column: 28, scope: !190)
!196 = !DILocalVariable(name: "b", arg: 2, scope: !190, file: !191, line: 202, type: !4)
!197 = !DILocation(line: 202, column: 37, scope: !190)
!198 = !DILocation(line: 204, column: 10, scope: !190)
!199 = !DILocation(line: 204, column: 14, scope: !190)
!200 = !DILocation(line: 204, column: 12, scope: !190)
!201 = !DILocation(line: 204, column: 9, scope: !190)
!202 = !DILocation(line: 204, column: 19, scope: !190)
!203 = !DILocation(line: 204, column: 23, scope: !190)
!204 = !DILocation(line: 204, column: 2, scope: !190)
!205 = distinct !DISubprogram(name: "compute_reduced_albedo", scope: !1, file: !1, line: 172, type: !206, scopeLine: 173, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !2)
!206 = !DISubroutineType(types: !207)
!207 = !{!4, !21}
!208 = !DILocalVariable(name: "ss", arg: 1, scope: !205, file: !1, line: 172, type: !21)
!209 = !DILocation(line: 172, column: 54, scope: !205)
!210 = !DILocalVariable(name: "tolerance", scope: !205, file: !1, line: 174, type: !211)
!211 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!212 = !DILocation(line: 174, column: 14, scope: !205)
!213 = !DILocalVariable(name: "max_iteration_count", scope: !205, file: !1, line: 175, type: !214)
!214 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !6)
!215 = !DILocation(line: 175, column: 12, scope: !205)
!216 = !DILocalVariable(name: "d", scope: !205, file: !1, line: 176, type: !4)
!217 = !DILocation(line: 176, column: 8, scope: !205)
!218 = !DILocalVariable(name: "fsub", scope: !205, file: !1, line: 176, type: !4)
!219 = !DILocation(line: 176, column: 11, scope: !205)
!220 = !DILocalVariable(name: "xn_1", scope: !205, file: !1, line: 176, type: !4)
!221 = !DILocation(line: 176, column: 17, scope: !205)
!222 = !DILocalVariable(name: "xn", scope: !205, file: !1, line: 176, type: !4)
!223 = !DILocation(line: 176, column: 29, scope: !205)
!224 = !DILocalVariable(name: "fxn", scope: !205, file: !1, line: 176, type: !4)
!225 = !DILocation(line: 176, column: 39, scope: !205)
!226 = !DILocalVariable(name: "fxn_1", scope: !205, file: !1, line: 176, type: !4)
!227 = !DILocation(line: 176, column: 44, scope: !205)
!228 = !DILocalVariable(name: "i", scope: !205, file: !1, line: 177, type: !6)
!229 = !DILocation(line: 177, column: 6, scope: !205)
!230 = !DILocation(line: 181, column: 12, scope: !205)
!231 = !DILocation(line: 181, column: 16, scope: !205)
!232 = !DILocation(line: 181, column: 20, scope: !205)
!233 = !DILocation(line: 181, column: 23, scope: !205)
!234 = !DILocation(line: 181, column: 27, scope: !205)
!235 = !DILocation(line: 181, column: 7, scope: !205)
!236 = !DILocation(line: 181, column: 5, scope: !205)
!237 = !DILocation(line: 182, column: 14, scope: !205)
!238 = !DILocation(line: 182, column: 20, scope: !205)
!239 = !DILocation(line: 182, column: 24, scope: !205)
!240 = !DILocation(line: 182, column: 27, scope: !205)
!241 = !DILocation(line: 182, column: 31, scope: !205)
!242 = !DILocation(line: 182, column: 9, scope: !205)
!243 = !DILocation(line: 182, column: 7, scope: !205)
!244 = !DILocation(line: 184, column: 8, scope: !245)
!245 = distinct !DILexicalBlock(scope: !205, file: !1, line: 184, column: 2)
!246 = !DILocation(line: 184, column: 7, scope: !245)
!247 = !DILocation(line: 184, column: 13, scope: !248)
!248 = distinct !DILexicalBlock(scope: !245, file: !1, line: 184, column: 2)
!249 = !DILocation(line: 184, column: 15, scope: !248)
!250 = !DILocation(line: 184, column: 2, scope: !245)
!251 = !DILocation(line: 185, column: 10, scope: !252)
!252 = distinct !DILexicalBlock(scope: !248, file: !1, line: 184, column: 43)
!253 = !DILocation(line: 185, column: 16, scope: !252)
!254 = !DILocation(line: 185, column: 14, scope: !252)
!255 = !DILocation(line: 185, column: 7, scope: !252)
!256 = !DILocation(line: 186, column: 13, scope: !257)
!257 = distinct !DILexicalBlock(scope: !252, file: !1, line: 186, column: 7)
!258 = !DILocation(line: 186, column: 7, scope: !257)
!259 = !DILocation(line: 186, column: 19, scope: !257)
!260 = !DILocation(line: 186, column: 7, scope: !252)
!261 = !DILocation(line: 187, column: 4, scope: !257)
!262 = !DILocation(line: 188, column: 8, scope: !252)
!263 = !DILocation(line: 188, column: 13, scope: !252)
!264 = !DILocation(line: 188, column: 11, scope: !252)
!265 = !DILocation(line: 188, column: 19, scope: !252)
!266 = !DILocation(line: 188, column: 18, scope: !252)
!267 = !DILocation(line: 188, column: 25, scope: !252)
!268 = !DILocation(line: 188, column: 24, scope: !252)
!269 = !DILocation(line: 188, column: 4, scope: !252)
!270 = !DILocation(line: 189, column: 13, scope: !271)
!271 = distinct !DILexicalBlock(scope: !252, file: !1, line: 189, column: 7)
!272 = !DILocation(line: 189, column: 7, scope: !271)
!273 = !DILocation(line: 189, column: 16, scope: !271)
!274 = !DILocation(line: 189, column: 7, scope: !252)
!275 = !DILocation(line: 190, column: 4, scope: !271)
!276 = !DILocation(line: 192, column: 9, scope: !252)
!277 = !DILocation(line: 192, column: 7, scope: !252)
!278 = !DILocation(line: 193, column: 10, scope: !252)
!279 = !DILocation(line: 193, column: 8, scope: !252)
!280 = !DILocation(line: 194, column: 7, scope: !252)
!281 = !DILocation(line: 194, column: 12, scope: !252)
!282 = !DILocation(line: 194, column: 10, scope: !252)
!283 = !DILocation(line: 194, column: 5, scope: !252)
!284 = !DILocation(line: 196, column: 7, scope: !285)
!285 = distinct !DILexicalBlock(scope: !252, file: !1, line: 196, column: 7)
!286 = !DILocation(line: 196, column: 10, scope: !285)
!287 = !DILocation(line: 196, column: 7, scope: !252)
!288 = !DILocation(line: 196, column: 20, scope: !285)
!289 = !DILocation(line: 196, column: 18, scope: !285)
!290 = !DILocation(line: 197, column: 7, scope: !291)
!291 = distinct !DILexicalBlock(scope: !252, file: !1, line: 197, column: 7)
!292 = !DILocation(line: 197, column: 12, scope: !291)
!293 = !DILocation(line: 197, column: 7, scope: !252)
!294 = !DILocation(line: 197, column: 24, scope: !291)
!295 = !DILocation(line: 197, column: 20, scope: !291)
!296 = !DILocation(line: 199, column: 13, scope: !252)
!297 = !DILocation(line: 199, column: 17, scope: !252)
!298 = !DILocation(line: 199, column: 21, scope: !252)
!299 = !DILocation(line: 199, column: 24, scope: !252)
!300 = !DILocation(line: 199, column: 28, scope: !252)
!301 = !DILocation(line: 199, column: 8, scope: !252)
!302 = !DILocation(line: 199, column: 6, scope: !252)
!303 = !DILocation(line: 200, column: 2, scope: !252)
!304 = !DILocation(line: 184, column: 39, scope: !248)
!305 = !DILocation(line: 184, column: 2, scope: !248)
!306 = distinct !{!306, !250, !307}
!307 = !DILocation(line: 200, column: 2, scope: !245)
!308 = !DILocation(line: 203, column: 6, scope: !309)
!309 = distinct !DILexicalBlock(scope: !205, file: !1, line: 203, column: 6)
!310 = !DILocation(line: 203, column: 9, scope: !309)
!311 = !DILocation(line: 203, column: 6, scope: !205)
!312 = !DILocation(line: 204, column: 5, scope: !309)
!313 = !DILocation(line: 204, column: 3, scope: !309)
!314 = !DILocation(line: 206, column: 9, scope: !205)
!315 = !DILocation(line: 206, column: 2, scope: !205)
!316 = distinct !DISubprogram(name: "build_Rd_table", scope: !1, file: !1, line: 277, type: !317, scopeLine: 278, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !2)
!317 = !DISubroutineType(types: !318)
!318 = !{null, !21}
!319 = !DILocalVariable(name: "ss", arg: 1, scope: !316, file: !1, line: 277, type: !21)
!320 = !DILocation(line: 277, column: 45, scope: !316)
!321 = !DILocalVariable(name: "r", scope: !316, file: !1, line: 279, type: !4)
!322 = !DILocation(line: 279, column: 8, scope: !316)
!323 = !DILocalVariable(name: "i", scope: !316, file: !1, line: 280, type: !6)
!324 = !DILocation(line: 280, column: 6, scope: !316)
!325 = !DILocalVariable(name: "size", scope: !316, file: !1, line: 280, type: !6)
!326 = !DILocation(line: 280, column: 9, scope: !316)
!327 = !DILocation(line: 282, column: 15, scope: !316)
!328 = !DILocation(line: 282, column: 41, scope: !316)
!329 = !DILocation(line: 282, column: 40, scope: !316)
!330 = !DILocation(line: 282, column: 2, scope: !316)
!331 = !DILocation(line: 282, column: 6, scope: !316)
!332 = !DILocation(line: 282, column: 13, scope: !316)
!333 = !DILocation(line: 283, column: 16, scope: !316)
!334 = !DILocation(line: 283, column: 42, scope: !316)
!335 = !DILocation(line: 283, column: 41, scope: !316)
!336 = !DILocation(line: 283, column: 2, scope: !316)
!337 = !DILocation(line: 283, column: 6, scope: !316)
!338 = !DILocation(line: 283, column: 14, scope: !316)
!339 = !DILocation(line: 285, column: 8, scope: !340)
!340 = distinct !DILexicalBlock(scope: !316, file: !1, line: 285, column: 2)
!341 = !DILocation(line: 285, column: 7, scope: !340)
!342 = !DILocation(line: 285, column: 13, scope: !343)
!343 = distinct !DILexicalBlock(scope: !340, file: !1, line: 285, column: 2)
!344 = !DILocation(line: 285, column: 17, scope: !343)
!345 = !DILocation(line: 285, column: 15, scope: !343)
!346 = !DILocation(line: 285, column: 2, scope: !340)
!347 = !DILocation(line: 286, column: 6, scope: !348)
!348 = distinct !DILexicalBlock(scope: !343, file: !1, line: 285, column: 28)
!349 = !DILocation(line: 286, column: 7, scope: !348)
!350 = !DILocation(line: 286, column: 4, scope: !348)
!351 = !DILocation(line: 289, column: 22, scope: !348)
!352 = !DILocation(line: 289, column: 32, scope: !348)
!353 = !DILocation(line: 289, column: 26, scope: !348)
!354 = !DILocation(line: 289, column: 19, scope: !348)
!355 = !DILocation(line: 289, column: 3, scope: !348)
!356 = !DILocation(line: 289, column: 7, scope: !348)
!357 = !DILocation(line: 289, column: 15, scope: !348)
!358 = !DILocation(line: 289, column: 17, scope: !348)
!359 = !DILocation(line: 291, column: 6, scope: !348)
!360 = !DILocation(line: 291, column: 7, scope: !348)
!361 = !DILocation(line: 291, column: 4, scope: !348)
!362 = !DILocation(line: 294, column: 23, scope: !348)
!363 = !DILocation(line: 294, column: 27, scope: !348)
!364 = !DILocation(line: 294, column: 20, scope: !348)
!365 = !DILocation(line: 294, column: 3, scope: !348)
!366 = !DILocation(line: 294, column: 7, scope: !348)
!367 = !DILocation(line: 294, column: 16, scope: !348)
!368 = !DILocation(line: 294, column: 18, scope: !348)
!369 = !DILocation(line: 295, column: 2, scope: !348)
!370 = !DILocation(line: 285, column: 24, scope: !343)
!371 = !DILocation(line: 285, column: 2, scope: !343)
!372 = distinct !{!372, !346, !373}
!373 = !DILocation(line: 295, column: 2, scope: !340)
!374 = !DILocation(line: 296, column: 1, scope: !316)
!375 = distinct !DISubprogram(name: "scatter_settings_free", scope: !1, file: !1, line: 335, type: !317, scopeLine: 336, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!376 = !DILocalVariable(name: "ss", arg: 1, scope: !375, file: !1, line: 335, type: !21)
!377 = !DILocation(line: 335, column: 45, scope: !375)
!378 = !DILocation(line: 337, column: 2, scope: !375)
!379 = !DILocation(line: 337, column: 12, scope: !375)
!380 = !DILocation(line: 337, column: 16, scope: !375)
!381 = !DILocation(line: 338, column: 2, scope: !375)
!382 = !DILocation(line: 338, column: 12, scope: !375)
!383 = !DILocation(line: 338, column: 16, scope: !375)
!384 = !DILocation(line: 339, column: 2, scope: !375)
!385 = !DILocation(line: 339, column: 12, scope: !375)
!386 = !DILocation(line: 340, column: 1, scope: !375)
!387 = distinct !DISubprogram(name: "scatter_tree_new", scope: !1, file: !1, line: 734, type: !388, scopeLine: 736, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!388 = !DISubroutineType(types: !389)
!389 = !{!390, !439, !4, !4, !440, !440, !44, !6}
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "ScatterTree", file: !23, line: 42, baseType: !392)
!392 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ScatterTree", file: !1, line: 140, size: 832, elements: !393)
!393 = !{!394, !399, !403, !404, !405, !432, !433, !435, !436, !437, !438}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "arena", scope: !392, file: !1, line: 141, baseType: !395, size: 64)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "MemArena", file: !397, line: 53, baseType: !398)
!397 = !DIFile(filename: "blender/source/blender/blenlib/BLI_memarena.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!398 = !DICompositeType(tag: DW_TAG_structure_type, name: "MemArena", file: !397, line: 52, flags: DIFlagFwdDecl)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "ss", scope: !392, file: !1, line: 143, baseType: !400, size: 192, offset: 64)
!400 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 192, elements: !401)
!401 = !{!402}
!402 = !DISubrange(count: 3)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !392, file: !1, line: 144, baseType: !4, size: 32, offset: 256)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !392, file: !1, line: 144, baseType: !4, size: 32, offset: 288)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !392, file: !1, line: 146, baseType: !406, size: 64, offset: 320)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "ScatterNode", file: !1, line: 138, baseType: !408)
!408 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ScatterNode", file: !1, line: 127, size: 1088, elements: !409)
!409 = !{!410, !412, !413, !414, !415, !416, !417, !426, !427}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !408, file: !1, line: 128, baseType: !411, size: 96)
!411 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !401)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "rad", scope: !408, file: !1, line: 129, baseType: !411, size: 96, offset: 96)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "backrad", scope: !408, file: !1, line: 130, baseType: !411, size: 96, offset: 192)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "area", scope: !408, file: !1, line: 131, baseType: !4, size: 32, offset: 288)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "backarea", scope: !408, file: !1, line: 131, baseType: !4, size: 32, offset: 320)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "totpoint", scope: !408, file: !1, line: 133, baseType: !6, size: 32, offset: 352)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !408, file: !1, line: 134, baseType: !418, size: 64, offset: 384)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "ScatterPoint", file: !1, line: 125, baseType: !420)
!420 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ScatterPoint", file: !1, line: 120, size: 256, elements: !421)
!421 = !{!422, !423, !424, !425}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !420, file: !1, line: 121, baseType: !411, size: 96)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "rad", scope: !420, file: !1, line: 122, baseType: !411, size: 96, offset: 96)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "area", scope: !420, file: !1, line: 123, baseType: !4, size: 32, offset: 192)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "back", scope: !420, file: !1, line: 124, baseType: !6, size: 32, offset: 224)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "split", scope: !408, file: !1, line: 136, baseType: !411, size: 96, offset: 448)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !408, file: !1, line: 137, baseType: !428, size: 512, offset: 576)
!428 = !DICompositeType(tag: DW_TAG_array_type, baseType: !429, size: 512, elements: !430)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!430 = !{!431}
!431 = !DISubrange(count: 8)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !392, file: !1, line: 147, baseType: !418, size: 64, offset: 384)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "refpoints", scope: !392, file: !1, line: 148, baseType: !434, size: 64, offset: 448)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "tmppoints", scope: !392, file: !1, line: 149, baseType: !434, size: 64, offset: 512)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "totpoint", scope: !392, file: !1, line: 150, baseType: !6, size: 32, offset: 576)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !392, file: !1, line: 151, baseType: !411, size: 96, offset: 608)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !392, file: !1, line: 151, baseType: !411, size: 96, offset: 704)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!441 = !DILocalVariable(name: "ss", arg: 1, scope: !387, file: !1, line: 734, type: !439)
!442 = !DILocation(line: 734, column: 48, scope: !387)
!443 = !DILocalVariable(name: "scale", arg: 2, scope: !387, file: !1, line: 734, type: !4)
!444 = !DILocation(line: 734, column: 61, scope: !387)
!445 = !DILocalVariable(name: "error", arg: 3, scope: !387, file: !1, line: 734, type: !4)
!446 = !DILocation(line: 734, column: 74, scope: !387)
!447 = !DILocalVariable(name: "co", arg: 4, scope: !387, file: !1, line: 735, type: !440)
!448 = !DILocation(line: 735, column: 10, scope: !387)
!449 = !DILocalVariable(name: "color", arg: 5, scope: !387, file: !1, line: 735, type: !440)
!450 = !DILocation(line: 735, column: 26, scope: !387)
!451 = !DILocalVariable(name: "area", arg: 6, scope: !387, file: !1, line: 735, type: !44)
!452 = !DILocation(line: 735, column: 44, scope: !387)
!453 = !DILocalVariable(name: "totpoint", arg: 7, scope: !387, file: !1, line: 735, type: !6)
!454 = !DILocation(line: 735, column: 54, scope: !387)
!455 = !DILocalVariable(name: "tree", scope: !387, file: !1, line: 737, type: !390)
!456 = !DILocation(line: 737, column: 15, scope: !387)
!457 = !DILocalVariable(name: "points", scope: !387, file: !1, line: 738, type: !418)
!458 = !DILocation(line: 738, column: 16, scope: !387)
!459 = !DILocalVariable(name: "refpoints", scope: !387, file: !1, line: 738, type: !434)
!460 = !DILocation(line: 738, column: 26, scope: !387)
!461 = !DILocalVariable(name: "i", scope: !387, file: !1, line: 739, type: !6)
!462 = !DILocation(line: 739, column: 6, scope: !387)
!463 = !DILocation(line: 742, column: 8, scope: !387)
!464 = !DILocation(line: 742, column: 6, scope: !387)
!465 = !DILocation(line: 743, column: 15, scope: !387)
!466 = !DILocation(line: 743, column: 2, scope: !387)
!467 = !DILocation(line: 743, column: 8, scope: !387)
!468 = !DILocation(line: 743, column: 13, scope: !387)
!469 = !DILocation(line: 744, column: 15, scope: !387)
!470 = !DILocation(line: 744, column: 2, scope: !387)
!471 = !DILocation(line: 744, column: 8, scope: !387)
!472 = !DILocation(line: 744, column: 13, scope: !387)
!473 = !DILocation(line: 745, column: 18, scope: !387)
!474 = !DILocation(line: 745, column: 2, scope: !387)
!475 = !DILocation(line: 745, column: 8, scope: !387)
!476 = !DILocation(line: 745, column: 16, scope: !387)
!477 = !DILocation(line: 747, column: 15, scope: !387)
!478 = !DILocation(line: 747, column: 2, scope: !387)
!479 = !DILocation(line: 747, column: 8, scope: !387)
!480 = !DILocation(line: 747, column: 13, scope: !387)
!481 = !DILocation(line: 748, column: 15, scope: !387)
!482 = !DILocation(line: 748, column: 2, scope: !387)
!483 = !DILocation(line: 748, column: 8, scope: !387)
!484 = !DILocation(line: 748, column: 13, scope: !387)
!485 = !DILocation(line: 749, column: 15, scope: !387)
!486 = !DILocation(line: 749, column: 2, scope: !387)
!487 = !DILocation(line: 749, column: 8, scope: !387)
!488 = !DILocation(line: 749, column: 13, scope: !387)
!489 = !DILocation(line: 751, column: 11, scope: !387)
!490 = !DILocation(line: 751, column: 46, scope: !387)
!491 = !DILocation(line: 751, column: 44, scope: !387)
!492 = !DILocation(line: 751, column: 9, scope: !387)
!493 = !DILocation(line: 752, column: 14, scope: !387)
!494 = !DILocation(line: 752, column: 51, scope: !387)
!495 = !DILocation(line: 752, column: 49, scope: !387)
!496 = !DILocation(line: 752, column: 12, scope: !387)
!497 = !DILocation(line: 754, column: 16, scope: !387)
!498 = !DILocation(line: 754, column: 2, scope: !387)
!499 = !DILocation(line: 754, column: 8, scope: !387)
!500 = !DILocation(line: 754, column: 14, scope: !387)
!501 = !DILocation(line: 755, column: 19, scope: !387)
!502 = !DILocation(line: 755, column: 2, scope: !387)
!503 = !DILocation(line: 755, column: 8, scope: !387)
!504 = !DILocation(line: 755, column: 17, scope: !387)
!505 = !DILocation(line: 758, column: 2, scope: !506)
!506 = distinct !DILexicalBlock(scope: !387, file: !1, line: 758, column: 2)
!507 = !DILocation(line: 760, column: 8, scope: !508)
!508 = distinct !DILexicalBlock(scope: !387, file: !1, line: 760, column: 2)
!509 = !DILocation(line: 760, column: 7, scope: !508)
!510 = !DILocation(line: 760, column: 12, scope: !511)
!511 = distinct !DILexicalBlock(scope: !508, file: !1, line: 760, column: 2)
!512 = !DILocation(line: 760, column: 14, scope: !511)
!513 = !DILocation(line: 760, column: 13, scope: !511)
!514 = !DILocation(line: 760, column: 2, scope: !508)
!515 = !DILocation(line: 761, column: 14, scope: !516)
!516 = distinct !DILexicalBlock(scope: !511, file: !1, line: 760, column: 29)
!517 = !DILocation(line: 761, column: 21, scope: !516)
!518 = !DILocation(line: 761, column: 24, scope: !516)
!519 = !DILocation(line: 761, column: 28, scope: !516)
!520 = !DILocation(line: 761, column: 31, scope: !516)
!521 = !DILocation(line: 761, column: 3, scope: !516)
!522 = !DILocation(line: 762, column: 14, scope: !516)
!523 = !DILocation(line: 762, column: 21, scope: !516)
!524 = !DILocation(line: 762, column: 24, scope: !516)
!525 = !DILocation(line: 762, column: 29, scope: !516)
!526 = !DILocation(line: 762, column: 35, scope: !516)
!527 = !DILocation(line: 762, column: 3, scope: !516)
!528 = !DILocation(line: 763, column: 25, scope: !516)
!529 = !DILocation(line: 763, column: 30, scope: !516)
!530 = !DILocation(line: 763, column: 19, scope: !516)
!531 = !DILocation(line: 763, column: 35, scope: !516)
!532 = !DILocation(line: 763, column: 41, scope: !516)
!533 = !DILocation(line: 763, column: 47, scope: !516)
!534 = !DILocation(line: 763, column: 53, scope: !516)
!535 = !DILocation(line: 763, column: 46, scope: !516)
!536 = !DILocation(line: 763, column: 33, scope: !516)
!537 = !DILocation(line: 763, column: 3, scope: !516)
!538 = !DILocation(line: 763, column: 10, scope: !516)
!539 = !DILocation(line: 763, column: 13, scope: !516)
!540 = !DILocation(line: 763, column: 17, scope: !516)
!541 = !DILocation(line: 764, column: 20, scope: !516)
!542 = !DILocation(line: 764, column: 25, scope: !516)
!543 = !DILocation(line: 764, column: 28, scope: !516)
!544 = !DILocation(line: 764, column: 3, scope: !516)
!545 = !DILocation(line: 764, column: 10, scope: !516)
!546 = !DILocation(line: 764, column: 13, scope: !516)
!547 = !DILocation(line: 764, column: 17, scope: !516)
!548 = !DILocation(line: 766, column: 13, scope: !516)
!549 = !DILocation(line: 766, column: 20, scope: !516)
!550 = !DILocation(line: 766, column: 23, scope: !516)
!551 = !DILocation(line: 766, column: 34, scope: !516)
!552 = !DILocation(line: 766, column: 40, scope: !516)
!553 = !DILocation(line: 766, column: 32, scope: !516)
!554 = !DILocation(line: 766, column: 3, scope: !516)
!555 = !DILocation(line: 767, column: 18, scope: !516)
!556 = !DILocation(line: 767, column: 24, scope: !516)
!557 = !DILocation(line: 767, column: 29, scope: !516)
!558 = !DILocation(line: 767, column: 35, scope: !516)
!559 = !DILocation(line: 767, column: 40, scope: !516)
!560 = !DILocation(line: 767, column: 47, scope: !516)
!561 = !DILocation(line: 767, column: 50, scope: !516)
!562 = !DILocation(line: 767, column: 3, scope: !516)
!563 = !DILocation(line: 769, column: 17, scope: !516)
!564 = !DILocation(line: 769, column: 26, scope: !516)
!565 = !DILocation(line: 769, column: 24, scope: !516)
!566 = !DILocation(line: 769, column: 3, scope: !516)
!567 = !DILocation(line: 769, column: 13, scope: !516)
!568 = !DILocation(line: 769, column: 15, scope: !516)
!569 = !DILocation(line: 770, column: 2, scope: !516)
!570 = !DILocation(line: 760, column: 25, scope: !511)
!571 = !DILocation(line: 760, column: 2, scope: !511)
!572 = distinct !{!572, !514, !573}
!573 = !DILocation(line: 770, column: 2, scope: !508)
!574 = !DILocation(line: 772, column: 9, scope: !387)
!575 = !DILocation(line: 772, column: 2, scope: !387)
!576 = distinct !DISubprogram(name: "copy_v3_v3", scope: !577, file: !577, line: 64, type: !578, scopeLine: 65, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !2)
!577 = !DIFile(filename: "blender/source/blender/blenlib/intern/math_vector_inline.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!578 = !DISubroutineType(types: !579)
!579 = !{null, !44, !580}
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!581 = !DILocalVariable(name: "r", arg: 1, scope: !576, file: !577, line: 64, type: !44)
!582 = !DILocation(line: 64, column: 31, scope: !576)
!583 = !DILocalVariable(name: "a", arg: 2, scope: !576, file: !577, line: 64, type: !580)
!584 = !DILocation(line: 64, column: 49, scope: !576)
!585 = !DILocation(line: 66, column: 9, scope: !576)
!586 = !DILocation(line: 66, column: 2, scope: !576)
!587 = !DILocation(line: 66, column: 7, scope: !576)
!588 = !DILocation(line: 67, column: 9, scope: !576)
!589 = !DILocation(line: 67, column: 2, scope: !576)
!590 = !DILocation(line: 67, column: 7, scope: !576)
!591 = !DILocation(line: 68, column: 9, scope: !576)
!592 = !DILocation(line: 68, column: 2, scope: !576)
!593 = !DILocation(line: 68, column: 7, scope: !576)
!594 = !DILocation(line: 69, column: 1, scope: !576)
!595 = distinct !DISubprogram(name: "mul_v3_fl", scope: !577, file: !577, line: 392, type: !596, scopeLine: 393, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !2)
!596 = !DISubroutineType(types: !597)
!597 = !{null, !44, !4}
!598 = !DILocalVariable(name: "r", arg: 1, scope: !595, file: !577, line: 392, type: !44)
!599 = !DILocation(line: 392, column: 30, scope: !595)
!600 = !DILocalVariable(name: "f", arg: 2, scope: !595, file: !577, line: 392, type: !4)
!601 = !DILocation(line: 392, column: 42, scope: !595)
!602 = !DILocation(line: 394, column: 10, scope: !595)
!603 = !DILocation(line: 394, column: 2, scope: !595)
!604 = !DILocation(line: 394, column: 7, scope: !595)
!605 = !DILocation(line: 395, column: 10, scope: !595)
!606 = !DILocation(line: 395, column: 2, scope: !595)
!607 = !DILocation(line: 395, column: 7, scope: !595)
!608 = !DILocation(line: 396, column: 10, scope: !595)
!609 = !DILocation(line: 396, column: 2, scope: !595)
!610 = !DILocation(line: 396, column: 7, scope: !595)
!611 = !DILocation(line: 397, column: 1, scope: !595)
!612 = distinct !DISubprogram(name: "scatter_tree_build", scope: !1, file: !1, line: 775, type: !613, scopeLine: 776, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!613 = !DISubroutineType(types: !614)
!614 = !{null, !390}
!615 = !DILocalVariable(name: "tree", arg: 1, scope: !612, file: !1, line: 775, type: !390)
!616 = !DILocation(line: 775, column: 38, scope: !612)
!617 = !DILocalVariable(name: "newpoints", scope: !612, file: !1, line: 777, type: !418)
!618 = !DILocation(line: 777, column: 16, scope: !612)
!619 = !DILocalVariable(name: "tmppoints", scope: !612, file: !1, line: 777, type: !434)
!620 = !DILocation(line: 777, column: 29, scope: !612)
!621 = !DILocalVariable(name: "mid", scope: !612, file: !1, line: 778, type: !411)
!622 = !DILocation(line: 778, column: 8, scope: !612)
!623 = !DILocalVariable(name: "size", scope: !612, file: !1, line: 778, type: !411)
!624 = !DILocation(line: 778, column: 16, scope: !612)
!625 = !DILocalVariable(name: "totpoint", scope: !612, file: !1, line: 779, type: !6)
!626 = !DILocation(line: 779, column: 6, scope: !612)
!627 = !DILocation(line: 779, column: 16, scope: !612)
!628 = !DILocation(line: 779, column: 22, scope: !612)
!629 = !DILocation(line: 781, column: 14, scope: !612)
!630 = !DILocation(line: 781, column: 49, scope: !612)
!631 = !DILocation(line: 781, column: 47, scope: !612)
!632 = !DILocation(line: 781, column: 12, scope: !612)
!633 = !DILocation(line: 782, column: 14, scope: !612)
!634 = !DILocation(line: 782, column: 51, scope: !612)
!635 = !DILocation(line: 782, column: 49, scope: !612)
!636 = !DILocation(line: 782, column: 12, scope: !612)
!637 = !DILocation(line: 783, column: 19, scope: !612)
!638 = !DILocation(line: 783, column: 2, scope: !612)
!639 = !DILocation(line: 783, column: 8, scope: !612)
!640 = !DILocation(line: 783, column: 17, scope: !612)
!641 = !DILocation(line: 785, column: 15, scope: !612)
!642 = !DILocation(line: 785, column: 2, scope: !612)
!643 = !DILocation(line: 785, column: 8, scope: !612)
!644 = !DILocation(line: 785, column: 13, scope: !612)
!645 = !DILocation(line: 786, column: 26, scope: !612)
!646 = !DILocation(line: 786, column: 32, scope: !612)
!647 = !DILocation(line: 786, column: 2, scope: !612)
!648 = !DILocation(line: 789, column: 33, scope: !612)
!649 = !DILocation(line: 789, column: 39, scope: !612)
!650 = !DILocation(line: 789, column: 14, scope: !612)
!651 = !DILocation(line: 789, column: 2, scope: !612)
!652 = !DILocation(line: 789, column: 8, scope: !612)
!653 = !DILocation(line: 789, column: 12, scope: !612)
!654 = !DILocation(line: 790, column: 22, scope: !612)
!655 = !DILocation(line: 790, column: 2, scope: !612)
!656 = !DILocation(line: 790, column: 8, scope: !612)
!657 = !DILocation(line: 790, column: 14, scope: !612)
!658 = !DILocation(line: 790, column: 20, scope: !612)
!659 = !DILocation(line: 791, column: 24, scope: !612)
!660 = !DILocation(line: 791, column: 2, scope: !612)
!661 = !DILocation(line: 791, column: 8, scope: !612)
!662 = !DILocation(line: 791, column: 14, scope: !612)
!663 = !DILocation(line: 791, column: 22, scope: !612)
!664 = !DILocation(line: 793, column: 11, scope: !612)
!665 = !DILocation(line: 793, column: 17, scope: !612)
!666 = !DILocation(line: 793, column: 24, scope: !612)
!667 = !DILocation(line: 793, column: 30, scope: !612)
!668 = !DILocation(line: 793, column: 23, scope: !612)
!669 = !DILocation(line: 793, column: 37, scope: !612)
!670 = !DILocation(line: 793, column: 2, scope: !612)
!671 = !DILocation(line: 793, column: 8, scope: !612)
!672 = !DILocation(line: 794, column: 11, scope: !612)
!673 = !DILocation(line: 794, column: 17, scope: !612)
!674 = !DILocation(line: 794, column: 24, scope: !612)
!675 = !DILocation(line: 794, column: 30, scope: !612)
!676 = !DILocation(line: 794, column: 23, scope: !612)
!677 = !DILocation(line: 794, column: 37, scope: !612)
!678 = !DILocation(line: 794, column: 2, scope: !612)
!679 = !DILocation(line: 794, column: 8, scope: !612)
!680 = !DILocation(line: 795, column: 11, scope: !612)
!681 = !DILocation(line: 795, column: 17, scope: !612)
!682 = !DILocation(line: 795, column: 24, scope: !612)
!683 = !DILocation(line: 795, column: 30, scope: !612)
!684 = !DILocation(line: 795, column: 23, scope: !612)
!685 = !DILocation(line: 795, column: 37, scope: !612)
!686 = !DILocation(line: 795, column: 2, scope: !612)
!687 = !DILocation(line: 795, column: 8, scope: !612)
!688 = !DILocation(line: 797, column: 12, scope: !612)
!689 = !DILocation(line: 797, column: 18, scope: !612)
!690 = !DILocation(line: 797, column: 25, scope: !612)
!691 = !DILocation(line: 797, column: 31, scope: !612)
!692 = !DILocation(line: 797, column: 24, scope: !612)
!693 = !DILocation(line: 797, column: 38, scope: !612)
!694 = !DILocation(line: 797, column: 2, scope: !612)
!695 = !DILocation(line: 797, column: 9, scope: !612)
!696 = !DILocation(line: 798, column: 12, scope: !612)
!697 = !DILocation(line: 798, column: 18, scope: !612)
!698 = !DILocation(line: 798, column: 25, scope: !612)
!699 = !DILocation(line: 798, column: 31, scope: !612)
!700 = !DILocation(line: 798, column: 24, scope: !612)
!701 = !DILocation(line: 798, column: 38, scope: !612)
!702 = !DILocation(line: 798, column: 2, scope: !612)
!703 = !DILocation(line: 798, column: 9, scope: !612)
!704 = !DILocation(line: 799, column: 12, scope: !612)
!705 = !DILocation(line: 799, column: 18, scope: !612)
!706 = !DILocation(line: 799, column: 25, scope: !612)
!707 = !DILocation(line: 799, column: 31, scope: !612)
!708 = !DILocation(line: 799, column: 24, scope: !612)
!709 = !DILocation(line: 799, column: 38, scope: !612)
!710 = !DILocation(line: 799, column: 2, scope: !612)
!711 = !DILocation(line: 799, column: 9, scope: !612)
!712 = !DILocation(line: 801, column: 21, scope: !612)
!713 = !DILocation(line: 801, column: 27, scope: !612)
!714 = !DILocation(line: 801, column: 33, scope: !612)
!715 = !DILocation(line: 801, column: 39, scope: !612)
!716 = !DILocation(line: 801, column: 44, scope: !612)
!717 = !DILocation(line: 801, column: 50, scope: !612)
!718 = !DILocation(line: 801, column: 56, scope: !612)
!719 = !DILocation(line: 801, column: 2, scope: !612)
!720 = !DILocation(line: 803, column: 2, scope: !612)
!721 = !DILocation(line: 803, column: 12, scope: !612)
!722 = !DILocation(line: 803, column: 18, scope: !612)
!723 = !DILocation(line: 804, column: 2, scope: !612)
!724 = !DILocation(line: 804, column: 12, scope: !612)
!725 = !DILocation(line: 804, column: 18, scope: !612)
!726 = !DILocation(line: 805, column: 2, scope: !612)
!727 = !DILocation(line: 805, column: 12, scope: !612)
!728 = !DILocation(line: 805, column: 18, scope: !612)
!729 = !DILocation(line: 806, column: 2, scope: !612)
!730 = !DILocation(line: 806, column: 8, scope: !612)
!731 = !DILocation(line: 806, column: 17, scope: !612)
!732 = !DILocation(line: 807, column: 2, scope: !612)
!733 = !DILocation(line: 807, column: 8, scope: !612)
!734 = !DILocation(line: 807, column: 17, scope: !612)
!735 = !DILocation(line: 808, column: 16, scope: !612)
!736 = !DILocation(line: 808, column: 2, scope: !612)
!737 = !DILocation(line: 808, column: 8, scope: !612)
!738 = !DILocation(line: 808, column: 14, scope: !612)
!739 = !DILocation(line: 811, column: 15, scope: !612)
!740 = !DILocation(line: 811, column: 21, scope: !612)
!741 = !DILocation(line: 811, column: 27, scope: !612)
!742 = !DILocation(line: 811, column: 2, scope: !612)
!743 = !DILocation(line: 812, column: 1, scope: !612)
!744 = distinct !DISubprogram(name: "create_octree_node", scope: !1, file: !1, line: 652, type: !745, scopeLine: 653, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !2)
!745 = !DISubroutineType(types: !746)
!746 = !{null, !390, !406, !44, !44, !434, !6}
!747 = !DILocalVariable(name: "tree", arg: 1, scope: !744, file: !1, line: 652, type: !390)
!748 = !DILocation(line: 652, column: 45, scope: !744)
!749 = !DILocalVariable(name: "node", arg: 2, scope: !744, file: !1, line: 652, type: !406)
!750 = !DILocation(line: 652, column: 64, scope: !744)
!751 = !DILocalVariable(name: "mid", arg: 3, scope: !744, file: !1, line: 652, type: !44)
!752 = !DILocation(line: 652, column: 77, scope: !744)
!753 = !DILocalVariable(name: "size", arg: 4, scope: !744, file: !1, line: 652, type: !44)
!754 = !DILocation(line: 652, column: 89, scope: !744)
!755 = !DILocalVariable(name: "refpoints", arg: 5, scope: !744, file: !1, line: 652, type: !434)
!756 = !DILocation(line: 652, column: 110, scope: !744)
!757 = !DILocalVariable(name: "depth", arg: 6, scope: !744, file: !1, line: 652, type: !6)
!758 = !DILocation(line: 652, column: 125, scope: !744)
!759 = !DILocalVariable(name: "subnode", scope: !744, file: !1, line: 654, type: !406)
!760 = !DILocation(line: 654, column: 15, scope: !744)
!761 = !DILocalVariable(name: "subrefpoints", scope: !744, file: !1, line: 655, type: !434)
!762 = !DILocation(line: 655, column: 17, scope: !744)
!763 = !DILocalVariable(name: "tmppoints", scope: !744, file: !1, line: 655, type: !434)
!764 = !DILocation(line: 655, column: 33, scope: !744)
!765 = !DILocation(line: 655, column: 44, scope: !744)
!766 = !DILocation(line: 655, column: 50, scope: !744)
!767 = !DILocalVariable(name: "index", scope: !744, file: !1, line: 656, type: !6)
!768 = !DILocation(line: 656, column: 6, scope: !744)
!769 = !DILocalVariable(name: "nsize", scope: !744, file: !1, line: 656, type: !770)
!770 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 256, elements: !430)
!771 = !DILocation(line: 656, column: 13, scope: !744)
!772 = !DILocalVariable(name: "noffset", scope: !744, file: !1, line: 656, type: !770)
!773 = !DILocation(line: 656, column: 23, scope: !744)
!774 = !DILocalVariable(name: "i", scope: !744, file: !1, line: 656, type: !6)
!775 = !DILocation(line: 656, column: 35, scope: !744)
!776 = !DILocalVariable(name: "subco", scope: !744, file: !1, line: 656, type: !6)
!777 = !DILocation(line: 656, column: 38, scope: !744)
!778 = !DILocalVariable(name: "used_nodes", scope: !744, file: !1, line: 656, type: !6)
!779 = !DILocation(line: 656, column: 45, scope: !744)
!780 = !DILocalVariable(name: "usedi", scope: !744, file: !1, line: 656, type: !6)
!781 = !DILocation(line: 656, column: 57, scope: !744)
!782 = !DILocalVariable(name: "submid", scope: !744, file: !1, line: 657, type: !411)
!783 = !DILocation(line: 657, column: 8, scope: !744)
!784 = !DILocalVariable(name: "subsize", scope: !744, file: !1, line: 657, type: !411)
!785 = !DILocation(line: 657, column: 19, scope: !744)
!786 = !DILocation(line: 660, column: 6, scope: !787)
!787 = distinct !DILexicalBlock(scope: !744, file: !1, line: 660, column: 6)
!788 = !DILocation(line: 660, column: 12, scope: !787)
!789 = !DILocation(line: 660, column: 21, scope: !787)
!790 = !DILocation(line: 660, column: 47, scope: !787)
!791 = !DILocation(line: 660, column: 50, scope: !787)
!792 = !DILocation(line: 660, column: 56, scope: !787)
!793 = !DILocation(line: 660, column: 6, scope: !744)
!794 = !DILocation(line: 661, column: 9, scope: !795)
!795 = distinct !DILexicalBlock(scope: !796, file: !1, line: 661, column: 3)
!796 = distinct !DILexicalBlock(scope: !787, file: !1, line: 660, column: 77)
!797 = !DILocation(line: 661, column: 8, scope: !795)
!798 = !DILocation(line: 661, column: 13, scope: !799)
!799 = distinct !DILexicalBlock(scope: !795, file: !1, line: 661, column: 3)
!800 = !DILocation(line: 661, column: 15, scope: !799)
!801 = !DILocation(line: 661, column: 21, scope: !799)
!802 = !DILocation(line: 661, column: 14, scope: !799)
!803 = !DILocation(line: 661, column: 3, scope: !795)
!804 = !DILocation(line: 662, column: 4, scope: !799)
!805 = !DILocation(line: 662, column: 10, scope: !799)
!806 = !DILocation(line: 662, column: 17, scope: !799)
!807 = !DILocation(line: 662, column: 23, scope: !799)
!808 = !DILocation(line: 662, column: 33, scope: !799)
!809 = !DILocation(line: 662, column: 21, scope: !799)
!810 = !DILocation(line: 661, column: 32, scope: !799)
!811 = !DILocation(line: 661, column: 3, scope: !799)
!812 = distinct !{!812, !803, !813}
!813 = !DILocation(line: 662, column: 35, scope: !795)
!814 = !DILocation(line: 664, column: 3, scope: !796)
!815 = !DILocation(line: 667, column: 14, scope: !744)
!816 = !DILocation(line: 667, column: 21, scope: !744)
!817 = !DILocation(line: 667, column: 2, scope: !744)
!818 = !DILocation(line: 667, column: 12, scope: !744)
!819 = !DILocation(line: 668, column: 14, scope: !744)
!820 = !DILocation(line: 668, column: 21, scope: !744)
!821 = !DILocation(line: 668, column: 2, scope: !744)
!822 = !DILocation(line: 668, column: 12, scope: !744)
!823 = !DILocation(line: 669, column: 14, scope: !744)
!824 = !DILocation(line: 669, column: 21, scope: !744)
!825 = !DILocation(line: 669, column: 2, scope: !744)
!826 = !DILocation(line: 669, column: 12, scope: !744)
!827 = !DILocation(line: 671, column: 18, scope: !744)
!828 = !DILocation(line: 671, column: 2, scope: !744)
!829 = !DILocation(line: 671, column: 8, scope: !744)
!830 = !DILocation(line: 671, column: 16, scope: !744)
!831 = !DILocation(line: 672, column: 18, scope: !744)
!832 = !DILocation(line: 672, column: 2, scope: !744)
!833 = !DILocation(line: 672, column: 8, scope: !744)
!834 = !DILocation(line: 672, column: 16, scope: !744)
!835 = !DILocation(line: 673, column: 18, scope: !744)
!836 = !DILocation(line: 673, column: 2, scope: !744)
!837 = !DILocation(line: 673, column: 8, scope: !744)
!838 = !DILocation(line: 673, column: 16, scope: !744)
!839 = !DILocation(line: 675, column: 2, scope: !744)
!840 = !DILocation(line: 676, column: 2, scope: !744)
!841 = !DILocation(line: 679, column: 8, scope: !842)
!842 = distinct !DILexicalBlock(scope: !744, file: !1, line: 679, column: 2)
!843 = !DILocation(line: 679, column: 7, scope: !842)
!844 = !DILocation(line: 679, column: 12, scope: !845)
!845 = distinct !DILexicalBlock(scope: !842, file: !1, line: 679, column: 2)
!846 = !DILocation(line: 679, column: 14, scope: !845)
!847 = !DILocation(line: 679, column: 20, scope: !845)
!848 = !DILocation(line: 679, column: 13, scope: !845)
!849 = !DILocation(line: 679, column: 2, scope: !842)
!850 = !DILocation(line: 680, column: 10, scope: !851)
!851 = distinct !DILexicalBlock(scope: !845, file: !1, line: 679, column: 35)
!852 = !DILocation(line: 680, column: 8, scope: !851)
!853 = !DILocation(line: 681, column: 17, scope: !851)
!854 = !DILocation(line: 681, column: 27, scope: !851)
!855 = !DILocation(line: 681, column: 3, scope: !851)
!856 = !DILocation(line: 681, column: 13, scope: !851)
!857 = !DILocation(line: 681, column: 15, scope: !851)
!858 = !DILocation(line: 682, column: 9, scope: !851)
!859 = !DILocation(line: 682, column: 3, scope: !851)
!860 = !DILocation(line: 682, column: 15, scope: !851)
!861 = !DILocation(line: 683, column: 2, scope: !851)
!862 = !DILocation(line: 679, column: 31, scope: !845)
!863 = !DILocation(line: 679, column: 2, scope: !845)
!864 = distinct !{!864, !849, !865}
!865 = !DILocation(line: 683, column: 2, scope: !842)
!866 = !DILocation(line: 688, column: 12, scope: !867)
!867 = distinct !DILexicalBlock(scope: !744, file: !1, line: 688, column: 2)
!868 = !DILocation(line: 688, column: 26, scope: !867)
!869 = !DILocation(line: 688, column: 31, scope: !867)
!870 = !DILocation(line: 688, column: 7, scope: !867)
!871 = !DILocation(line: 688, column: 35, scope: !872)
!872 = distinct !DILexicalBlock(scope: !867, file: !1, line: 688, column: 2)
!873 = !DILocation(line: 688, column: 36, scope: !872)
!874 = !DILocation(line: 688, column: 2, scope: !867)
!875 = !DILocation(line: 689, column: 13, scope: !876)
!876 = distinct !DILexicalBlock(scope: !877, file: !1, line: 689, column: 7)
!877 = distinct !DILexicalBlock(scope: !872, file: !1, line: 688, column: 45)
!878 = !DILocation(line: 689, column: 7, scope: !876)
!879 = !DILocation(line: 689, column: 7, scope: !877)
!880 = !DILocation(line: 690, column: 14, scope: !881)
!881 = distinct !DILexicalBlock(scope: !876, file: !1, line: 689, column: 17)
!882 = !DILocation(line: 691, column: 12, scope: !881)
!883 = !DILocation(line: 691, column: 10, scope: !881)
!884 = !DILocation(line: 692, column: 3, scope: !881)
!885 = !DILocation(line: 693, column: 7, scope: !886)
!886 = distinct !DILexicalBlock(scope: !877, file: !1, line: 693, column: 7)
!887 = !DILocation(line: 693, column: 9, scope: !886)
!888 = !DILocation(line: 693, column: 7, scope: !877)
!889 = !DILocation(line: 694, column: 24, scope: !886)
!890 = !DILocation(line: 694, column: 25, scope: !886)
!891 = !DILocation(line: 694, column: 16, scope: !886)
!892 = !DILocation(line: 694, column: 35, scope: !886)
!893 = !DILocation(line: 694, column: 36, scope: !886)
!894 = !DILocation(line: 694, column: 29, scope: !886)
!895 = !DILocation(line: 694, column: 28, scope: !886)
!896 = !DILocation(line: 694, column: 12, scope: !886)
!897 = !DILocation(line: 694, column: 4, scope: !886)
!898 = !DILocation(line: 694, column: 14, scope: !886)
!899 = !DILocation(line: 695, column: 2, scope: !877)
!900 = !DILocation(line: 688, column: 41, scope: !872)
!901 = !DILocation(line: 688, column: 2, scope: !872)
!902 = distinct !{!902, !874, !903}
!903 = !DILocation(line: 695, column: 2, scope: !867)
!904 = !DILocation(line: 697, column: 6, scope: !905)
!905 = distinct !DILexicalBlock(scope: !744, file: !1, line: 697, column: 6)
!906 = !DILocation(line: 697, column: 17, scope: !905)
!907 = !DILocation(line: 697, column: 6, scope: !744)
!908 = !DILocation(line: 698, column: 18, scope: !909)
!909 = distinct !DILexicalBlock(scope: !905, file: !1, line: 697, column: 23)
!910 = !DILocation(line: 698, column: 25, scope: !909)
!911 = !DILocation(line: 698, column: 30, scope: !909)
!912 = !DILocation(line: 698, column: 39, scope: !909)
!913 = !DILocation(line: 698, column: 3, scope: !909)
!914 = !DILocation(line: 699, column: 22, scope: !909)
!915 = !DILocation(line: 699, column: 28, scope: !909)
!916 = !DILocation(line: 699, column: 34, scope: !909)
!917 = !DILocation(line: 699, column: 42, scope: !909)
!918 = !DILocation(line: 699, column: 51, scope: !909)
!919 = !DILocation(line: 699, column: 62, scope: !909)
!920 = !DILocation(line: 699, column: 67, scope: !909)
!921 = !DILocation(line: 699, column: 3, scope: !909)
!922 = !DILocation(line: 700, column: 3, scope: !909)
!923 = !DILocation(line: 704, column: 8, scope: !924)
!924 = distinct !DILexicalBlock(scope: !744, file: !1, line: 704, column: 2)
!925 = !DILocation(line: 704, column: 7, scope: !924)
!926 = !DILocation(line: 704, column: 12, scope: !927)
!927 = distinct !DILexicalBlock(scope: !924, file: !1, line: 704, column: 2)
!928 = !DILocation(line: 704, column: 14, scope: !927)
!929 = !DILocation(line: 704, column: 20, scope: !927)
!930 = !DILocation(line: 704, column: 13, scope: !927)
!931 = !DILocation(line: 704, column: 2, scope: !924)
!932 = !DILocation(line: 705, column: 10, scope: !933)
!933 = distinct !DILexicalBlock(scope: !927, file: !1, line: 704, column: 35)
!934 = !DILocation(line: 705, column: 8, scope: !933)
!935 = !DILocation(line: 706, column: 30, scope: !933)
!936 = !DILocation(line: 706, column: 40, scope: !933)
!937 = !DILocation(line: 706, column: 3, scope: !933)
!938 = !DILocation(line: 706, column: 21, scope: !933)
!939 = !DILocation(line: 706, column: 13, scope: !933)
!940 = !DILocation(line: 706, column: 28, scope: !933)
!941 = !DILocation(line: 707, column: 11, scope: !933)
!942 = !DILocation(line: 707, column: 3, scope: !933)
!943 = !DILocation(line: 707, column: 17, scope: !933)
!944 = !DILocation(line: 708, column: 2, scope: !933)
!945 = !DILocation(line: 704, column: 31, scope: !927)
!946 = !DILocation(line: 704, column: 2, scope: !927)
!947 = distinct !{!947, !931, !948}
!948 = !DILocation(line: 708, column: 2, scope: !924)
!949 = !DILocation(line: 711, column: 12, scope: !950)
!950 = distinct !DILexicalBlock(scope: !744, file: !1, line: 711, column: 2)
!951 = !DILocation(line: 711, column: 17, scope: !950)
!952 = !DILocation(line: 711, column: 7, scope: !950)
!953 = !DILocation(line: 711, column: 21, scope: !954)
!954 = distinct !DILexicalBlock(scope: !950, file: !1, line: 711, column: 2)
!955 = !DILocation(line: 711, column: 22, scope: !954)
!956 = !DILocation(line: 711, column: 2, scope: !950)
!957 = !DILocation(line: 712, column: 13, scope: !958)
!958 = distinct !DILexicalBlock(scope: !959, file: !1, line: 712, column: 7)
!959 = distinct !DILexicalBlock(scope: !954, file: !1, line: 711, column: 48)
!960 = !DILocation(line: 712, column: 7, scope: !958)
!961 = !DILocation(line: 712, column: 16, scope: !958)
!962 = !DILocation(line: 712, column: 7, scope: !959)
!963 = !DILocation(line: 713, column: 32, scope: !964)
!964 = distinct !DILexicalBlock(scope: !958, file: !1, line: 712, column: 21)
!965 = !DILocation(line: 713, column: 38, scope: !964)
!966 = !DILocation(line: 713, column: 13, scope: !964)
!967 = !DILocation(line: 713, column: 11, scope: !964)
!968 = !DILocation(line: 714, column: 20, scope: !964)
!969 = !DILocation(line: 714, column: 4, scope: !964)
!970 = !DILocation(line: 714, column: 10, scope: !964)
!971 = !DILocation(line: 714, column: 16, scope: !964)
!972 = !DILocation(line: 714, column: 18, scope: !964)
!973 = !DILocation(line: 715, column: 21, scope: !964)
!974 = !DILocation(line: 715, column: 27, scope: !964)
!975 = !DILocation(line: 715, column: 36, scope: !964)
!976 = !DILocation(line: 715, column: 34, scope: !964)
!977 = !DILocation(line: 715, column: 4, scope: !964)
!978 = !DILocation(line: 715, column: 13, scope: !964)
!979 = !DILocation(line: 715, column: 19, scope: !964)
!980 = !DILocation(line: 716, column: 29, scope: !964)
!981 = !DILocation(line: 716, column: 23, scope: !964)
!982 = !DILocation(line: 716, column: 4, scope: !964)
!983 = !DILocation(line: 716, column: 13, scope: !964)
!984 = !DILocation(line: 716, column: 21, scope: !964)
!985 = !DILocation(line: 717, column: 18, scope: !964)
!986 = !DILocation(line: 717, column: 30, scope: !964)
!987 = !DILocation(line: 717, column: 28, scope: !964)
!988 = !DILocation(line: 717, column: 16, scope: !964)
!989 = !DILocation(line: 719, column: 19, scope: !964)
!990 = !DILocation(line: 719, column: 22, scope: !964)
!991 = !DILocation(line: 719, column: 27, scope: !964)
!992 = !DILocation(line: 719, column: 36, scope: !964)
!993 = !DILocation(line: 719, column: 4, scope: !964)
!994 = !DILocation(line: 721, column: 23, scope: !964)
!995 = !DILocation(line: 721, column: 29, scope: !964)
!996 = !DILocation(line: 721, column: 38, scope: !964)
!997 = !DILocation(line: 721, column: 46, scope: !964)
!998 = !DILocation(line: 721, column: 55, scope: !964)
!999 = !DILocation(line: 722, column: 5, scope: !964)
!1000 = !DILocation(line: 722, column: 10, scope: !964)
!1001 = !DILocation(line: 721, column: 4, scope: !964)
!1002 = !DILocation(line: 723, column: 3, scope: !964)
!1003 = !DILocation(line: 725, column: 4, scope: !958)
!1004 = !DILocation(line: 725, column: 10, scope: !958)
!1005 = !DILocation(line: 725, column: 16, scope: !958)
!1006 = !DILocation(line: 725, column: 18, scope: !958)
!1007 = !DILocation(line: 726, column: 2, scope: !959)
!1008 = !DILocation(line: 711, column: 39, scope: !954)
!1009 = !DILocation(line: 711, column: 33, scope: !954)
!1010 = !DILocation(line: 711, column: 31, scope: !954)
!1011 = !DILocation(line: 711, column: 44, scope: !954)
!1012 = !DILocation(line: 711, column: 2, scope: !954)
!1013 = distinct !{!1013, !956, !1014}
!1014 = !DILocation(line: 726, column: 2, scope: !950)
!1015 = !DILocation(line: 728, column: 2, scope: !744)
!1016 = !DILocation(line: 728, column: 8, scope: !744)
!1017 = !DILocation(line: 728, column: 14, scope: !744)
!1018 = !DILocation(line: 729, column: 2, scope: !744)
!1019 = !DILocation(line: 729, column: 8, scope: !744)
!1020 = !DILocation(line: 729, column: 16, scope: !744)
!1021 = !DILocation(line: 730, column: 1, scope: !744)
!1022 = distinct !DISubprogram(name: "sum_radiance", scope: !1, file: !1, line: 627, type: !1023, scopeLine: 628, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !2)
!1023 = !DISubroutineType(types: !1024)
!1024 = !{null, !390, !406}
!1025 = !DILocalVariable(name: "tree", arg: 1, scope: !1022, file: !1, line: 627, type: !390)
!1026 = !DILocation(line: 627, column: 39, scope: !1022)
!1027 = !DILocalVariable(name: "node", arg: 2, scope: !1022, file: !1, line: 627, type: !406)
!1028 = !DILocation(line: 627, column: 58, scope: !1022)
!1029 = !DILocation(line: 629, column: 6, scope: !1030)
!1030 = distinct !DILexicalBlock(scope: !1022, file: !1, line: 629, column: 6)
!1031 = !DILocation(line: 629, column: 12, scope: !1030)
!1032 = !DILocation(line: 629, column: 21, scope: !1030)
!1033 = !DILocation(line: 629, column: 6, scope: !1022)
!1034 = !DILocation(line: 630, column: 21, scope: !1035)
!1035 = distinct !DILexicalBlock(scope: !1030, file: !1, line: 629, column: 26)
!1036 = !DILocation(line: 630, column: 27, scope: !1035)
!1037 = !DILocation(line: 630, column: 3, scope: !1035)
!1038 = !DILocation(line: 631, column: 2, scope: !1035)
!1039 = !DILocalVariable(name: "i", scope: !1040, file: !1, line: 633, type: !6)
!1040 = distinct !DILexicalBlock(scope: !1030, file: !1, line: 632, column: 7)
!1041 = !DILocation(line: 633, column: 7, scope: !1040)
!1042 = !DILocation(line: 635, column: 9, scope: !1043)
!1043 = distinct !DILexicalBlock(scope: !1040, file: !1, line: 635, column: 3)
!1044 = !DILocation(line: 635, column: 8, scope: !1043)
!1045 = !DILocation(line: 635, column: 13, scope: !1046)
!1046 = distinct !DILexicalBlock(scope: !1043, file: !1, line: 635, column: 3)
!1047 = !DILocation(line: 635, column: 14, scope: !1046)
!1048 = !DILocation(line: 635, column: 3, scope: !1043)
!1049 = !DILocation(line: 636, column: 8, scope: !1050)
!1050 = distinct !DILexicalBlock(scope: !1046, file: !1, line: 636, column: 8)
!1051 = !DILocation(line: 636, column: 14, scope: !1050)
!1052 = !DILocation(line: 636, column: 20, scope: !1050)
!1053 = !DILocation(line: 636, column: 8, scope: !1046)
!1054 = !DILocation(line: 637, column: 18, scope: !1050)
!1055 = !DILocation(line: 637, column: 24, scope: !1050)
!1056 = !DILocation(line: 637, column: 30, scope: !1050)
!1057 = !DILocation(line: 637, column: 36, scope: !1050)
!1058 = !DILocation(line: 637, column: 5, scope: !1050)
!1059 = !DILocation(line: 636, column: 21, scope: !1050)
!1060 = !DILocation(line: 635, column: 19, scope: !1046)
!1061 = !DILocation(line: 635, column: 3, scope: !1046)
!1062 = distinct !{!1062, !1048, !1063}
!1063 = !DILocation(line: 637, column: 38, scope: !1043)
!1064 = !DILocation(line: 639, column: 23, scope: !1040)
!1065 = !DILocation(line: 639, column: 29, scope: !1040)
!1066 = !DILocation(line: 639, column: 3, scope: !1040)
!1067 = !DILocation(line: 641, column: 1, scope: !1022)
!1068 = distinct !DISubprogram(name: "scatter_tree_sample", scope: !1, file: !1, line: 814, type: !1069, scopeLine: 815, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!1069 = !DISubroutineType(types: !1070)
!1070 = !{null, !390, !580, !44}
!1071 = !DILocalVariable(name: "tree", arg: 1, scope: !1068, file: !1, line: 814, type: !390)
!1072 = !DILocation(line: 814, column: 39, scope: !1068)
!1073 = !DILocalVariable(name: "co", arg: 2, scope: !1068, file: !1, line: 814, type: !580)
!1074 = !DILocation(line: 814, column: 57, scope: !1068)
!1075 = !DILocalVariable(name: "color", arg: 3, scope: !1068, file: !1, line: 814, type: !44)
!1076 = !DILocation(line: 814, column: 70, scope: !1068)
!1077 = !DILocalVariable(name: "sco", scope: !1068, file: !1, line: 816, type: !411)
!1078 = !DILocation(line: 816, column: 8, scope: !1068)
!1079 = !DILocation(line: 818, column: 13, scope: !1068)
!1080 = !DILocation(line: 818, column: 18, scope: !1068)
!1081 = !DILocation(line: 818, column: 2, scope: !1068)
!1082 = !DILocation(line: 819, column: 12, scope: !1068)
!1083 = !DILocation(line: 819, column: 24, scope: !1068)
!1084 = !DILocation(line: 819, column: 30, scope: !1068)
!1085 = !DILocation(line: 819, column: 22, scope: !1068)
!1086 = !DILocation(line: 819, column: 2, scope: !1068)
!1087 = !DILocation(line: 821, column: 19, scope: !1068)
!1088 = !DILocation(line: 821, column: 25, scope: !1068)
!1089 = !DILocation(line: 821, column: 30, scope: !1068)
!1090 = !DILocation(line: 821, column: 2, scope: !1068)
!1091 = !DILocation(line: 822, column: 1, scope: !1068)
!1092 = distinct !DISubprogram(name: "compute_radiance", scope: !1, file: !1, line: 434, type: !1069, scopeLine: 435, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !2)
!1093 = !DILocalVariable(name: "tree", arg: 1, scope: !1092, file: !1, line: 434, type: !390)
!1094 = !DILocation(line: 434, column: 43, scope: !1092)
!1095 = !DILocalVariable(name: "co", arg: 2, scope: !1092, file: !1, line: 434, type: !580)
!1096 = !DILocation(line: 434, column: 61, scope: !1092)
!1097 = !DILocalVariable(name: "rad", arg: 3, scope: !1092, file: !1, line: 434, type: !44)
!1098 = !DILocation(line: 434, column: 75, scope: !1092)
!1099 = !DILocalVariable(name: "result", scope: !1092, file: !1, line: 436, type: !1100)
!1100 = !DIDerivedType(tag: DW_TAG_typedef, name: "ScatterResult", file: !1, line: 159, baseType: !1101)
!1101 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ScatterResult", file: !1, line: 154, size: 384, elements: !1102)
!1102 = !{!1103, !1104, !1105, !1106}
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "rad", scope: !1101, file: !1, line: 155, baseType: !411, size: 96)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "backrad", scope: !1101, file: !1, line: 156, baseType: !411, size: 96, offset: 96)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "rdsum", scope: !1101, file: !1, line: 157, baseType: !411, size: 96, offset: 192)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "backrdsum", scope: !1101, file: !1, line: 158, baseType: !411, size: 96, offset: 288)
!1107 = !DILocation(line: 436, column: 16, scope: !1092)
!1108 = !DILocalVariable(name: "rdsum", scope: !1092, file: !1, line: 437, type: !411)
!1109 = !DILocation(line: 437, column: 8, scope: !1092)
!1110 = !DILocalVariable(name: "backrad", scope: !1092, file: !1, line: 437, type: !411)
!1111 = !DILocation(line: 437, column: 18, scope: !1092)
!1112 = !DILocalVariable(name: "backrdsum", scope: !1092, file: !1, line: 437, type: !411)
!1113 = !DILocation(line: 437, column: 30, scope: !1092)
!1114 = !DILocation(line: 439, column: 2, scope: !1092)
!1115 = !DILocation(line: 441, column: 18, scope: !1092)
!1116 = !DILocation(line: 441, column: 24, scope: !1092)
!1117 = !DILocation(line: 441, column: 30, scope: !1092)
!1118 = !DILocation(line: 441, column: 36, scope: !1092)
!1119 = !DILocation(line: 441, column: 2, scope: !1092)
!1120 = !DILocation(line: 449, column: 19, scope: !1092)
!1121 = !DILocation(line: 449, column: 12, scope: !1092)
!1122 = !DILocation(line: 449, column: 24, scope: !1092)
!1123 = !DILocation(line: 449, column: 30, scope: !1092)
!1124 = !DILocation(line: 449, column: 37, scope: !1092)
!1125 = !DILocation(line: 449, column: 2, scope: !1092)
!1126 = !DILocation(line: 450, column: 19, scope: !1092)
!1127 = !DILocation(line: 450, column: 12, scope: !1092)
!1128 = !DILocation(line: 450, column: 28, scope: !1092)
!1129 = !DILocation(line: 450, column: 34, scope: !1092)
!1130 = !DILocation(line: 450, column: 41, scope: !1092)
!1131 = !DILocation(line: 450, column: 2, scope: !1092)
!1132 = !DILocation(line: 452, column: 13, scope: !1092)
!1133 = !DILocation(line: 452, column: 25, scope: !1092)
!1134 = !DILocation(line: 452, column: 18, scope: !1092)
!1135 = !DILocation(line: 452, column: 2, scope: !1092)
!1136 = !DILocation(line: 453, column: 14, scope: !1092)
!1137 = !DILocation(line: 453, column: 30, scope: !1092)
!1138 = !DILocation(line: 453, column: 23, scope: !1092)
!1139 = !DILocation(line: 453, column: 42, scope: !1092)
!1140 = !DILocation(line: 453, column: 35, scope: !1092)
!1141 = !DILocation(line: 453, column: 2, scope: !1092)
!1142 = !DILocation(line: 455, column: 13, scope: !1092)
!1143 = !DILocation(line: 455, column: 27, scope: !1092)
!1144 = !DILocation(line: 455, column: 20, scope: !1092)
!1145 = !DILocation(line: 455, column: 2, scope: !1092)
!1146 = !DILocation(line: 456, column: 14, scope: !1092)
!1147 = !DILocation(line: 456, column: 32, scope: !1092)
!1148 = !DILocation(line: 456, column: 25, scope: !1092)
!1149 = !DILocation(line: 456, column: 46, scope: !1092)
!1150 = !DILocation(line: 456, column: 39, scope: !1092)
!1151 = !DILocation(line: 456, column: 2, scope: !1092)
!1152 = !DILocation(line: 458, column: 6, scope: !1153)
!1153 = distinct !DILexicalBlock(scope: !1092, file: !1, line: 458, column: 6)
!1154 = !DILocation(line: 458, column: 15, scope: !1153)
!1155 = !DILocation(line: 458, column: 6, scope: !1092)
!1156 = !DILocation(line: 458, column: 33, scope: !1153)
!1157 = !DILocation(line: 458, column: 39, scope: !1153)
!1158 = !DILocation(line: 458, column: 46, scope: !1153)
!1159 = !DILocation(line: 458, column: 52, scope: !1153)
!1160 = !DILocation(line: 458, column: 51, scope: !1153)
!1161 = !DILocation(line: 458, column: 59, scope: !1153)
!1162 = !DILocation(line: 458, column: 58, scope: !1153)
!1163 = !DILocation(line: 458, column: 25, scope: !1153)
!1164 = !DILocation(line: 458, column: 31, scope: !1153)
!1165 = !DILocation(line: 459, column: 6, scope: !1166)
!1166 = distinct !DILexicalBlock(scope: !1092, file: !1, line: 459, column: 6)
!1167 = !DILocation(line: 459, column: 15, scope: !1166)
!1168 = !DILocation(line: 459, column: 6, scope: !1092)
!1169 = !DILocation(line: 459, column: 33, scope: !1166)
!1170 = !DILocation(line: 459, column: 39, scope: !1166)
!1171 = !DILocation(line: 459, column: 46, scope: !1166)
!1172 = !DILocation(line: 459, column: 52, scope: !1166)
!1173 = !DILocation(line: 459, column: 51, scope: !1166)
!1174 = !DILocation(line: 459, column: 59, scope: !1166)
!1175 = !DILocation(line: 459, column: 58, scope: !1166)
!1176 = !DILocation(line: 459, column: 25, scope: !1166)
!1177 = !DILocation(line: 459, column: 31, scope: !1166)
!1178 = !DILocation(line: 460, column: 6, scope: !1179)
!1179 = distinct !DILexicalBlock(scope: !1092, file: !1, line: 460, column: 6)
!1180 = !DILocation(line: 460, column: 15, scope: !1179)
!1181 = !DILocation(line: 460, column: 6, scope: !1092)
!1182 = !DILocation(line: 460, column: 33, scope: !1179)
!1183 = !DILocation(line: 460, column: 39, scope: !1179)
!1184 = !DILocation(line: 460, column: 46, scope: !1179)
!1185 = !DILocation(line: 460, column: 52, scope: !1179)
!1186 = !DILocation(line: 460, column: 51, scope: !1179)
!1187 = !DILocation(line: 460, column: 59, scope: !1179)
!1188 = !DILocation(line: 460, column: 58, scope: !1179)
!1189 = !DILocation(line: 460, column: 25, scope: !1179)
!1190 = !DILocation(line: 460, column: 31, scope: !1179)
!1191 = !DILocation(line: 462, column: 6, scope: !1192)
!1192 = distinct !DILexicalBlock(scope: !1092, file: !1, line: 462, column: 6)
!1193 = !DILocation(line: 462, column: 19, scope: !1192)
!1194 = !DILocation(line: 462, column: 6, scope: !1092)
!1195 = !DILocation(line: 462, column: 41, scope: !1192)
!1196 = !DILocation(line: 462, column: 47, scope: !1192)
!1197 = !DILocation(line: 462, column: 54, scope: !1192)
!1198 = !DILocation(line: 462, column: 60, scope: !1192)
!1199 = !DILocation(line: 462, column: 59, scope: !1192)
!1200 = !DILocation(line: 462, column: 71, scope: !1192)
!1201 = !DILocation(line: 462, column: 70, scope: !1192)
!1202 = !DILocation(line: 462, column: 29, scope: !1192)
!1203 = !DILocation(line: 462, column: 39, scope: !1192)
!1204 = !DILocation(line: 463, column: 6, scope: !1205)
!1205 = distinct !DILexicalBlock(scope: !1092, file: !1, line: 463, column: 6)
!1206 = !DILocation(line: 463, column: 19, scope: !1205)
!1207 = !DILocation(line: 463, column: 6, scope: !1092)
!1208 = !DILocation(line: 463, column: 41, scope: !1205)
!1209 = !DILocation(line: 463, column: 47, scope: !1205)
!1210 = !DILocation(line: 463, column: 54, scope: !1205)
!1211 = !DILocation(line: 463, column: 60, scope: !1205)
!1212 = !DILocation(line: 463, column: 59, scope: !1205)
!1213 = !DILocation(line: 463, column: 71, scope: !1205)
!1214 = !DILocation(line: 463, column: 70, scope: !1205)
!1215 = !DILocation(line: 463, column: 29, scope: !1205)
!1216 = !DILocation(line: 463, column: 39, scope: !1205)
!1217 = !DILocation(line: 464, column: 6, scope: !1218)
!1218 = distinct !DILexicalBlock(scope: !1092, file: !1, line: 464, column: 6)
!1219 = !DILocation(line: 464, column: 19, scope: !1218)
!1220 = !DILocation(line: 464, column: 6, scope: !1092)
!1221 = !DILocation(line: 464, column: 41, scope: !1218)
!1222 = !DILocation(line: 464, column: 47, scope: !1218)
!1223 = !DILocation(line: 464, column: 54, scope: !1218)
!1224 = !DILocation(line: 464, column: 60, scope: !1218)
!1225 = !DILocation(line: 464, column: 59, scope: !1218)
!1226 = !DILocation(line: 464, column: 71, scope: !1218)
!1227 = !DILocation(line: 464, column: 70, scope: !1218)
!1228 = !DILocation(line: 464, column: 29, scope: !1218)
!1229 = !DILocation(line: 464, column: 39, scope: !1218)
!1230 = !DILocation(line: 466, column: 10, scope: !1092)
!1231 = !DILocation(line: 466, column: 2, scope: !1092)
!1232 = !DILocation(line: 466, column: 8, scope: !1092)
!1233 = !DILocation(line: 467, column: 10, scope: !1092)
!1234 = !DILocation(line: 467, column: 2, scope: !1092)
!1235 = !DILocation(line: 467, column: 8, scope: !1092)
!1236 = !DILocation(line: 468, column: 10, scope: !1092)
!1237 = !DILocation(line: 468, column: 2, scope: !1092)
!1238 = !DILocation(line: 468, column: 8, scope: !1092)
!1239 = !DILocation(line: 469, column: 1, scope: !1092)
!1240 = distinct !DISubprogram(name: "scatter_tree_free", scope: !1, file: !1, line: 824, type: !613, scopeLine: 825, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!1241 = !DILocalVariable(name: "tree", arg: 1, scope: !1240, file: !1, line: 824, type: !390)
!1242 = !DILocation(line: 824, column: 37, scope: !1240)
!1243 = !DILocation(line: 826, column: 6, scope: !1244)
!1244 = distinct !DILexicalBlock(scope: !1240, file: !1, line: 826, column: 6)
!1245 = !DILocation(line: 826, column: 12, scope: !1244)
!1246 = !DILocation(line: 826, column: 6, scope: !1240)
!1247 = !DILocation(line: 826, column: 37, scope: !1244)
!1248 = !DILocation(line: 826, column: 43, scope: !1244)
!1249 = !DILocation(line: 826, column: 19, scope: !1244)
!1250 = !DILocation(line: 827, column: 6, scope: !1251)
!1251 = distinct !DILexicalBlock(scope: !1240, file: !1, line: 827, column: 6)
!1252 = !DILocation(line: 827, column: 12, scope: !1251)
!1253 = !DILocation(line: 827, column: 6, scope: !1240)
!1254 = !DILocation(line: 827, column: 20, scope: !1251)
!1255 = !DILocation(line: 827, column: 30, scope: !1251)
!1256 = !DILocation(line: 827, column: 36, scope: !1251)
!1257 = !DILocation(line: 828, column: 6, scope: !1258)
!1258 = distinct !DILexicalBlock(scope: !1240, file: !1, line: 828, column: 6)
!1259 = !DILocation(line: 828, column: 12, scope: !1258)
!1260 = !DILocation(line: 828, column: 6, scope: !1240)
!1261 = !DILocation(line: 828, column: 23, scope: !1258)
!1262 = !DILocation(line: 828, column: 33, scope: !1258)
!1263 = !DILocation(line: 828, column: 39, scope: !1258)
!1264 = !DILocation(line: 830, column: 2, scope: !1240)
!1265 = !DILocation(line: 830, column: 12, scope: !1240)
!1266 = !DILocation(line: 831, column: 1, scope: !1240)
!1267 = distinct !DISubprogram(name: "sss_add_points", scope: !1, file: !1, line: 963, type: !1268, scopeLine: 964, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!1268 = !DISubroutineType(types: !1269)
!1269 = !{null, !1270, !440, !440, !44, !6}
!1270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1271, size: 64)
!1271 = !DIDerivedType(tag: DW_TAG_typedef, name: "Render", file: !1272, line: 58, baseType: !1273)
!1272 = !DIFile(filename: "blender/source/blender/render/extern/include/RE_pipeline.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1273 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Render", file: !1274, line: 126, size: 49920, elements: !1275)
!1274 = !DIFile(filename: "blender/source/blender/render/intern/include/render_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1275 = !{!1276, !1278, !1279, !1284, !1285, !1287, !1288, !1289, !1290, !1292, !2953, !2954, !2955, !2962, !2963, !2964, !2965, !2966, !2967, !2968, !2969, !2970, !2971, !2972, !2973, !2974, !2975, !2976, !2977, !2978, !2979, !2980, !2981, !2982, !2983, !2984, !2985, !2986, !2987, !3006, !3009, !3010, !3011, !3013, !3071, !3074, !3076, !3078, !3079, !3080, !3081, !3082, !3085, !3088, !3091, !3094, !3095, !3096, !3097, !3098, !3099, !3100, !3101, !3102, !3103, !3104, !3143, !3144, !3145, !3146, !3359, !3360, !3361, !3362, !3363, !3364, !3365, !3366, !3367, !3368, !3369, !3370, !3372, !3376, !3377, !3378, !3379, !3384, !3385, !3389, !3390, !3422, !3423, !3427, !3428, !3432, !3433, !3437, !3438, !3439, !3442, !3443}
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1273, file: !1274, line: 128, baseType: !1277, size: 64)
!1277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1273, size: 64)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1273, file: !1274, line: 128, baseType: !1277, size: 64, offset: 64)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1273, file: !1274, line: 129, baseType: !1280, size: 592, offset: 128)
!1280 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1281, size: 592, elements: !1282)
!1281 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!1282 = !{!1283}
!1283 = !DISubrange(count: 74)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "slot", scope: !1273, file: !1274, line: 130, baseType: !6, size: 32, offset: 736)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1273, file: !1274, line: 133, baseType: !1286, size: 16, offset: 768)
!1286 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "osa", scope: !1273, file: !1274, line: 133, baseType: !1286, size: 16, offset: 784)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !1273, file: !1274, line: 133, baseType: !1286, size: 16, offset: 800)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "result_ok", scope: !1273, file: !1274, line: 133, baseType: !1286, size: 16, offset: 816)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "scene_color_manage", scope: !1273, file: !1274, line: 136, baseType: !1291, size: 8, offset: 832)
!1291 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1273, file: !1274, line: 139, baseType: !1293, size: 64, offset: 896)
!1293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1294, size: 64)
!1294 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderResult", file: !1272, line: 148, baseType: !1295)
!1295 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !1272, line: 110, size: 1152, elements: !1296)
!1296 = !{!1297, !1299, !1300, !1301, !1302, !1303, !1304, !1306, !1307, !1308, !1317, !1318, !1319, !1326, !1328, !2949, !2950, !2951, !2952}
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1295, file: !1272, line: 111, baseType: !1298, size: 64)
!1298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1295, size: 64)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1295, file: !1272, line: 111, baseType: !1298, size: 64, offset: 64)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "rectx", scope: !1295, file: !1272, line: 114, baseType: !6, size: 32, offset: 128)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "recty", scope: !1295, file: !1272, line: 114, baseType: !6, size: 32, offset: 160)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !1295, file: !1272, line: 115, baseType: !1286, size: 16, offset: 192)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "sample_nr", scope: !1295, file: !1272, line: 115, baseType: !1286, size: 16, offset: 208)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "rect32", scope: !1295, file: !1272, line: 118, baseType: !1305, size: 64, offset: 256)
!1305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "rectf", scope: !1295, file: !1272, line: 120, baseType: !44, size: 64, offset: 320)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "rectz", scope: !1295, file: !1272, line: 122, baseType: !44, size: 64, offset: 384)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "tilerect", scope: !1295, file: !1272, line: 125, baseType: !1309, size: 128, offset: 448)
!1309 = !DIDerivedType(tag: DW_TAG_typedef, name: "rcti", file: !1310, line: 89, baseType: !1311)
!1310 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1311 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rcti", file: !1310, line: 86, size: 128, elements: !1312)
!1312 = !{!1313, !1314, !1315, !1316}
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !1311, file: !1310, line: 87, baseType: !6, size: 32)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !1311, file: !1310, line: 87, baseType: !6, size: 32, offset: 32)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !1311, file: !1310, line: 88, baseType: !6, size: 32, offset: 64)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !1311, file: !1310, line: 88, baseType: !6, size: 32, offset: 96)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "xof", scope: !1295, file: !1272, line: 127, baseType: !6, size: 32, offset: 576)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "yof", scope: !1295, file: !1272, line: 127, baseType: !6, size: 32, offset: 608)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !1295, file: !1272, line: 130, baseType: !1320, size: 128, offset: 640)
!1320 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !1321, line: 71, baseType: !1322)
!1321 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1322 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !1321, line: 69, size: 128, elements: !1323)
!1323 = !{!1324, !1325}
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !1322, file: !1321, line: 70, baseType: !5, size: 64)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !1322, file: !1321, line: 70, baseType: !5, size: 64, offset: 64)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "renrect", scope: !1295, file: !1272, line: 133, baseType: !1327, size: 128, offset: 768)
!1327 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !1309)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "renlay", scope: !1295, file: !1272, line: 134, baseType: !1329, size: 64, offset: 896)
!1329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1330, size: 64)
!1330 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !1331)
!1331 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderLayer", file: !1272, line: 108, baseType: !1332)
!1332 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderLayer", file: !1272, line: 85, size: 1600, elements: !1333)
!1333 = !{!1334, !1336, !1337, !1338, !1340, !1341, !1342, !1343, !1344, !1345, !2940, !2941, !2942, !2943, !2944, !2945, !2946, !2947, !2948}
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1332, file: !1272, line: 86, baseType: !1335, size: 64)
!1335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1332, size: 64)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1332, file: !1272, line: 86, baseType: !1335, size: 64, offset: 64)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1332, file: !1272, line: 89, baseType: !1280, size: 592, offset: 128)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !1332, file: !1272, line: 90, baseType: !1339, size: 32, offset: 736)
!1339 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "lay_zmask", scope: !1332, file: !1272, line: 90, baseType: !1339, size: 32, offset: 768)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "lay_exclude", scope: !1332, file: !1272, line: 90, baseType: !1339, size: 32, offset: 800)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "layflag", scope: !1332, file: !1272, line: 91, baseType: !6, size: 32, offset: 832)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "passflag", scope: !1332, file: !1272, line: 91, baseType: !6, size: 32, offset: 864)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "pass_xor", scope: !1332, file: !1272, line: 91, baseType: !6, size: 32, offset: 896)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "mat_override", scope: !1332, file: !1272, line: 93, baseType: !1346, size: 64, offset: 960)
!1346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1347, size: 64)
!1347 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !1348, line: 93, size: 7552, elements: !1349)
!1348 = !DIFile(filename: "blender/source/blender/makesdna/DNA_material_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1349 = !{!1350, !1412, !1415, !1416, !1417, !1418, !1419, !1420, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1440, !1461, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1530, !1531, !1532, !1533, !1534, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !2899, !2900, !2901, !2902, !2903, !2904, !2905, !2906, !2907, !2908, !2909, !2910, !2911, !2912, !2913, !2914, !2915, !2916, !2917, !2918, !2919, !2920, !2921, !2922, !2923, !2924, !2925, !2926, !2927, !2928, !2929, !2930, !2931, !2939}
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1347, file: !1348, line: 94, baseType: !1351, size: 960)
!1351 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !1352, line: 130, baseType: !1353)
!1352 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1353 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !1352, line: 117, size: 960, elements: !1354)
!1354 = !{!1355, !1356, !1357, !1359, !1378, !1382, !1383, !1384, !1385, !1386}
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1353, file: !1352, line: 118, baseType: !5, size: 64)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1353, file: !1352, line: 118, baseType: !5, size: 64, offset: 64)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !1353, file: !1352, line: 119, baseType: !1358, size: 64, offset: 128)
!1358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1353, size: 64)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !1353, file: !1352, line: 120, baseType: !1360, size: 64, offset: 192)
!1360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1361, size: 64)
!1361 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !1352, line: 136, size: 17600, elements: !1362)
!1362 = !{!1363, !1364, !1366, !1369, !1373, !1374, !1375}
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1361, file: !1352, line: 137, baseType: !1351, size: 960)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !1361, file: !1352, line: 138, baseType: !1365, size: 64, offset: 960)
!1365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1351, size: 64)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !1361, file: !1352, line: 139, baseType: !1367, size: 64, offset: 1024)
!1367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1368, size: 64)
!1368 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !1352, line: 43, flags: DIFlagFwdDecl)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1361, file: !1352, line: 140, baseType: !1370, size: 8192, offset: 1088)
!1370 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1281, size: 8192, elements: !1371)
!1371 = !{!1372}
!1372 = !DISubrange(count: 1024)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !1361, file: !1352, line: 141, baseType: !1370, size: 8192, offset: 9280)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !1361, file: !1352, line: 148, baseType: !1360, size: 64, offset: 17472)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !1361, file: !1352, line: 150, baseType: !1376, size: 64, offset: 17536)
!1376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1377, size: 64)
!1377 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !1352, line: 45, flags: DIFlagFwdDecl)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1353, file: !1352, line: 121, baseType: !1379, size: 528, offset: 256)
!1379 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1281, size: 528, elements: !1380)
!1380 = !{!1381}
!1381 = !DISubrange(count: 66)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1353, file: !1352, line: 126, baseType: !1286, size: 16, offset: 784)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !1353, file: !1352, line: 127, baseType: !6, size: 32, offset: 800)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !1353, file: !1352, line: 128, baseType: !6, size: 32, offset: 832)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1353, file: !1352, line: 128, baseType: !6, size: 32, offset: 864)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !1353, file: !1352, line: 129, baseType: !1387, size: 64, offset: 896)
!1387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1388, size: 64)
!1388 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !1352, line: 75, baseType: !1389)
!1389 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !1352, line: 62, size: 1024, elements: !1390)
!1390 = !{!1391, !1393, !1394, !1395, !1396, !1397, !1401, !1402, !1410, !1411}
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1389, file: !1352, line: 63, baseType: !1392, size: 64)
!1392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1389, size: 64)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1389, file: !1352, line: 63, baseType: !1392, size: 64, offset: 64)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1389, file: !1352, line: 64, baseType: !1281, size: 8, offset: 128)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !1389, file: !1352, line: 64, baseType: !1281, size: 8, offset: 136)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1389, file: !1352, line: 65, baseType: !1286, size: 16, offset: 144)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1389, file: !1352, line: 66, baseType: !1398, size: 512, offset: 160)
!1398 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1281, size: 512, elements: !1399)
!1399 = !{!1400}
!1400 = !DISubrange(count: 64)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !1389, file: !1352, line: 67, baseType: !6, size: 32, offset: 672)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1389, file: !1352, line: 69, baseType: !1403, size: 256, offset: 704)
!1403 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !1352, line: 60, baseType: !1404)
!1404 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !1352, line: 48, size: 256, elements: !1405)
!1405 = !{!1406, !1407, !1408, !1409}
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !1404, file: !1352, line: 49, baseType: !5, size: 64)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !1404, file: !1352, line: 58, baseType: !1320, size: 128, offset: 64)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1404, file: !1352, line: 59, baseType: !6, size: 32, offset: 192)
