; ModuleID = 'blender/source/blender/editors/interface/interface_style.c'
source_filename = "blender/source/blender/editors/interface/interface_style.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.UserDef = type { i32, i32, i32, i32, i32, [768 x i8], [768 x i8], [1024 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [1024 x i8], [1024 x i8], i32, i16, i16, i16, i16, i16, i16, i32, i32, i32, i16, i16, i32, i32, i32, i32, i32, i32, i32, i16, i16, i16, i16, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, [64 x i8], i16, i16, i16, i16, i16, i16, i16, i16, [3 x %struct.SolidLight], i16, i16, i16, i16, i16, i16, i16, i16, i32, i32, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i8, i8, i8, i8, i16, i16, i16, i16, i16, i16, float, float, i32, i16, i16, float, i16, i16, i16, i16, %struct.ColorBand, [3 x float], [4 x float], i16, i8, i8, [80 x i8], [1024 x i8], i32, i32, float, float, i32, i16, i16, i16, i16, i16, i16, %struct.WalkNavigation }
%struct.ListBase = type { i8*, i8* }
%struct.SolidLight = type { i32, i32, [4 x float], [4 x float], [4 x float] }
%struct.ColorBand = type { i16, i16, i8, i8, i8, [1 x i8], [32 x %struct.CBData] }
%struct.CBData = type { float, float, float, float, float, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_style", scope: !2, file: !3, line: 270, type: !7, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "UI_GetStyleDraw", scope: !3, file: !3, line: 267, type: !4, scopeLine: 268, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !54, retainedNodes: !84)
!3 = !DIFile(filename: "blender/source/blender/editors/interface/interface_style.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !DISubroutineType(types: !5)
!5 = !{!6}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "uiStyle", file: !8, line: 120, baseType: !9)
!8 = !DIFile(filename: "blender/source/blender/makesdna/DNA_userdef_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uiStyle", file: !8, line: 96, size: 1856, elements: !10)
!10 = !{!11, !13, !14, !19, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !9, file: !8, line: 97, baseType: !12, size: 64)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !9, file: !8, line: 97, baseType: !12, size: 64, offset: 64)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !9, file: !8, line: 99, baseType: !15, size: 512, offset: 128)
!15 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 512, elements: !17)
!16 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!17 = !{!18}
!18 = !DISubrange(count: 64)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "paneltitle", scope: !9, file: !8, line: 101, baseType: !20, size: 256, offset: 640)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "uiFontStyle", file: !8, line: 84, baseType: !21)
!21 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uiFontStyle", file: !8, line: 73, size: 256, elements: !22)
!22 = !{!23, !25, !26, !27, !31, !32, !33, !34, !35, !36, !37, !39}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "uifont_id", scope: !21, file: !8, line: 74, baseType: !24, size: 16)
!24 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !21, file: !8, line: 75, baseType: !24, size: 16, offset: 16)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "kerning", scope: !21, file: !8, line: 76, baseType: !24, size: 16, offset: 32)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !21, file: !8, line: 77, baseType: !28, size: 48, offset: 48)
!28 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 48, elements: !29)
!29 = !{!30}
!30 = !DISubrange(count: 6)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "italic", scope: !21, file: !8, line: 78, baseType: !24, size: 16, offset: 96)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "bold", scope: !21, file: !8, line: 78, baseType: !24, size: 16, offset: 112)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "shadow", scope: !21, file: !8, line: 79, baseType: !24, size: 16, offset: 128)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "shadx", scope: !21, file: !8, line: 80, baseType: !24, size: 16, offset: 144)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "shady", scope: !21, file: !8, line: 80, baseType: !24, size: 16, offset: 160)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !21, file: !8, line: 81, baseType: !24, size: 16, offset: 176)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "shadowalpha", scope: !21, file: !8, line: 82, baseType: !38, size: 32, offset: 192)
!38 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "shadowcolor", scope: !21, file: !8, line: 83, baseType: !38, size: 32, offset: 224)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "grouplabel", scope: !9, file: !8, line: 102, baseType: !20, size: 256, offset: 896)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "widgetlabel", scope: !9, file: !8, line: 103, baseType: !20, size: 256, offset: 1152)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "widget", scope: !9, file: !8, line: 104, baseType: !20, size: 256, offset: 1408)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "panelzoom", scope: !9, file: !8, line: 106, baseType: !38, size: 32, offset: 1664)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "minlabelchars", scope: !9, file: !8, line: 108, baseType: !24, size: 16, offset: 1696)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "minwidgetchars", scope: !9, file: !8, line: 109, baseType: !24, size: 16, offset: 1712)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "columnspace", scope: !9, file: !8, line: 111, baseType: !24, size: 16, offset: 1728)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "templatespace", scope: !9, file: !8, line: 112, baseType: !24, size: 16, offset: 1744)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "boxspace", scope: !9, file: !8, line: 113, baseType: !24, size: 16, offset: 1760)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "buttonspacex", scope: !9, file: !8, line: 114, baseType: !24, size: 16, offset: 1776)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "buttonspacey", scope: !9, file: !8, line: 115, baseType: !24, size: 16, offset: 1792)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "panelspace", scope: !9, file: !8, line: 116, baseType: !24, size: 16, offset: 1808)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "panelouter", scope: !9, file: !8, line: 117, baseType: !24, size: 16, offset: 1824)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !9, file: !8, line: 119, baseType: !24, size: 16, offset: 1840)
!54 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !55, retainedTypes: !79, globals: !83, splitDebugInlining: false, nameTableKind: None)
!55 = !{!56, !62, !67}
!56 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eFontStyle_Align", file: !8, line: 87, baseType: !57, size: 32, elements: !58)
!57 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!58 = !{!59, !60, !61}
!59 = !DIEnumerator(name: "UI_STYLE_TEXT_LEFT", value: 0, isUnsigned: true)
!60 = !DIEnumerator(name: "UI_STYLE_TEXT_CENTER", value: 1, isUnsigned: true)
!61 = !DIEnumerator(name: "UI_STYLE_TEXT_RIGHT", value: 2, isUnsigned: true)
!62 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eUIFont_ID", file: !8, line: 52, baseType: !57, size: 32, elements: !63)
!63 = !{!64, !65, !66}
!64 = !DIEnumerator(name: "UIFONT_DEFAULT", value: 0, isUnsigned: true)
!65 = !DIEnumerator(name: "UIFONT_CUSTOM1", value: 2, isUnsigned: true)
!66 = !DIEnumerator(name: "UIFONT_CUSTOM2", value: 3, isUnsigned: true)
!67 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !68, line: 123, baseType: !57, size: 32, elements: !69)
!68 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_global.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!69 = !{!70, !71, !72, !73, !74, !75, !76, !77, !78}
!70 = !DIEnumerator(name: "G_DEBUG", value: 1, isUnsigned: true)
!71 = !DIEnumerator(name: "G_DEBUG_FFMPEG", value: 2, isUnsigned: true)
!72 = !DIEnumerator(name: "G_DEBUG_PYTHON", value: 4, isUnsigned: true)
!73 = !DIEnumerator(name: "G_DEBUG_EVENTS", value: 8, isUnsigned: true)
!74 = !DIEnumerator(name: "G_DEBUG_HANDLERS", value: 16, isUnsigned: true)
!75 = !DIEnumerator(name: "G_DEBUG_WM", value: 32, isUnsigned: true)
!76 = !DIEnumerator(name: "G_DEBUG_JOBS", value: 64, isUnsigned: true)
!77 = !DIEnumerator(name: "G_DEBUG_FREESTYLE", value: 128, isUnsigned: true)
!78 = !DIEnumerator(name: "G_DEBUG_DEPSGRAPH", value: 256, isUnsigned: true)
!79 = !{!38, !80, !24, !81}
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!82 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!83 = !{!0}
!84 = !{}
!85 = !{i32 7, !"Dwarf Version", i32 4}
!86 = !{i32 2, !"Debug Info Version", i32 3}
!87 = !{i32 1, !"wchar_size", i32 4}
!88 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!89 = distinct !DISubprogram(name: "uiStyleFontDrawExt", scope: !3, file: !3, line: 148, type: !90, scopeLine: 150, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !54, retainedNodes: !84)
!90 = !DISubroutineType(types: !91)
!91 = !{null, !92, !93, !104, !106, !109, !109}
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !95)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "rcti", file: !96, line: 89, baseType: !97)
!96 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!97 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rcti", file: !96, line: 86, size: 128, elements: !98)
!98 = !{!99, !101, !102, !103}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !97, file: !96, line: 87, baseType: !100, size: 32)
!100 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !97, file: !96, line: 87, baseType: !100, size: 32, offset: 32)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !97, file: !96, line: 88, baseType: !100, size: 32, offset: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !97, file: !96, line: 88, baseType: !100, size: 32, offset: 96)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !16)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !107, line: 46, baseType: !108)
!107 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!108 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!110 = !DILocalVariable(name: "fs", arg: 1, scope: !89, file: !3, line: 148, type: !92)
!111 = !DILocation(line: 148, column: 38, scope: !89)
!112 = !DILocalVariable(name: "rect", arg: 2, scope: !89, file: !3, line: 148, type: !93)
!113 = !DILocation(line: 148, column: 54, scope: !89)
!114 = !DILocalVariable(name: "str", arg: 3, scope: !89, file: !3, line: 148, type: !104)
!115 = !DILocation(line: 148, column: 72, scope: !89)
!116 = !DILocalVariable(name: "len", arg: 4, scope: !89, file: !3, line: 149, type: !106)
!117 = !DILocation(line: 149, column: 32, scope: !89)
!118 = !DILocalVariable(name: "r_xofs", arg: 5, scope: !89, file: !3, line: 149, type: !109)
!119 = !DILocation(line: 149, column: 44, scope: !89)
!120 = !DILocalVariable(name: "r_yofs", arg: 6, scope: !89, file: !3, line: 149, type: !109)
!121 = !DILocation(line: 149, column: 59, scope: !89)
!122 = !DILocalVariable(name: "height", scope: !89, file: !3, line: 151, type: !38)
!123 = !DILocation(line: 151, column: 8, scope: !89)
!124 = !DILocalVariable(name: "xofs", scope: !89, file: !3, line: 152, type: !100)
!125 = !DILocation(line: 152, column: 6, scope: !89)
!126 = !DILocalVariable(name: "yofs", scope: !89, file: !3, line: 152, type: !100)
!127 = !DILocation(line: 152, column: 16, scope: !89)
!128 = !DILocation(line: 154, column: 17, scope: !89)
!129 = !DILocation(line: 154, column: 2, scope: !89)
!130 = !DILocation(line: 156, column: 24, scope: !89)
!131 = !DILocation(line: 156, column: 28, scope: !89)
!132 = !DILocation(line: 156, column: 11, scope: !89)
!133 = !DILocation(line: 156, column: 9, scope: !89)
!134 = !DILocation(line: 157, column: 38, scope: !89)
!135 = !DILocation(line: 157, column: 22, scope: !89)
!136 = !DILocation(line: 157, column: 46, scope: !89)
!137 = !DILocation(line: 157, column: 44, scope: !89)
!138 = !DILocation(line: 157, column: 19, scope: !89)
!139 = !DILocation(line: 157, column: 14, scope: !89)
!140 = !DILocation(line: 157, column: 9, scope: !89)
!141 = !DILocation(line: 157, column: 7, scope: !89)
!142 = !DILocation(line: 159, column: 6, scope: !143)
!143 = distinct !DILexicalBlock(scope: !89, file: !3, line: 159, column: 6)
!144 = !DILocation(line: 159, column: 10, scope: !143)
!145 = !DILocation(line: 159, column: 16, scope: !143)
!146 = !DILocation(line: 159, column: 6, scope: !89)
!147 = !DILocation(line: 160, column: 40, scope: !148)
!148 = distinct !DILexicalBlock(scope: !143, file: !3, line: 159, column: 41)
!149 = !DILocation(line: 160, column: 24, scope: !148)
!150 = !DILocation(line: 160, column: 58, scope: !148)
!151 = !DILocation(line: 160, column: 62, scope: !148)
!152 = !DILocation(line: 160, column: 73, scope: !148)
!153 = !DILocation(line: 160, column: 78, scope: !148)
!154 = !DILocation(line: 160, column: 48, scope: !148)
!155 = !DILocation(line: 160, column: 46, scope: !148)
!156 = !DILocation(line: 160, column: 21, scope: !148)
!157 = !DILocation(line: 160, column: 16, scope: !148)
!158 = !DILocation(line: 160, column: 10, scope: !148)
!159 = !DILocation(line: 160, column: 8, scope: !148)
!160 = !DILocation(line: 162, column: 7, scope: !161)
!161 = distinct !DILexicalBlock(scope: !148, file: !3, line: 162, column: 7)
!162 = !DILocation(line: 162, column: 12, scope: !161)
!163 = !DILocation(line: 162, column: 7, scope: !148)
!164 = !DILocation(line: 163, column: 9, scope: !165)
!165 = distinct !DILexicalBlock(scope: !161, file: !3, line: 162, column: 17)
!166 = !DILocation(line: 164, column: 3, scope: !165)
!167 = !DILocation(line: 165, column: 2, scope: !148)
!168 = !DILocation(line: 166, column: 11, scope: !169)
!169 = distinct !DILexicalBlock(scope: !143, file: !3, line: 166, column: 11)
!170 = !DILocation(line: 166, column: 15, scope: !169)
!171 = !DILocation(line: 166, column: 21, scope: !169)
!172 = !DILocation(line: 166, column: 11, scope: !143)
!173 = !DILocation(line: 167, column: 26, scope: !174)
!174 = distinct !DILexicalBlock(scope: !169, file: !3, line: 166, column: 45)
!175 = !DILocation(line: 167, column: 10, scope: !174)
!176 = !DILocation(line: 167, column: 44, scope: !174)
!177 = !DILocation(line: 167, column: 48, scope: !174)
!178 = !DILocation(line: 167, column: 59, scope: !174)
!179 = !DILocation(line: 167, column: 64, scope: !174)
!180 = !DILocation(line: 167, column: 34, scope: !174)
!181 = !DILocation(line: 167, column: 32, scope: !174)
!182 = !DILocation(line: 167, column: 80, scope: !174)
!183 = !DILocation(line: 167, column: 78, scope: !174)
!184 = !DILocation(line: 167, column: 76, scope: !174)
!185 = !DILocation(line: 167, column: 69, scope: !174)
!186 = !DILocation(line: 167, column: 8, scope: !174)
!187 = !DILocation(line: 168, column: 2, scope: !174)
!188 = !DILocation(line: 171, column: 15, scope: !89)
!189 = !DILocation(line: 171, column: 19, scope: !89)
!190 = !DILocation(line: 171, column: 30, scope: !89)
!191 = !DILocation(line: 171, column: 36, scope: !89)
!192 = !DILocation(line: 171, column: 41, scope: !89)
!193 = !DILocation(line: 171, column: 46, scope: !89)
!194 = !DILocation(line: 171, column: 52, scope: !89)
!195 = !DILocation(line: 171, column: 57, scope: !89)
!196 = !DILocation(line: 171, column: 62, scope: !89)
!197 = !DILocation(line: 171, column: 68, scope: !89)
!198 = !DILocation(line: 171, column: 73, scope: !89)
!199 = !DILocation(line: 171, column: 78, scope: !89)
!200 = !DILocation(line: 171, column: 84, scope: !89)
!201 = !DILocation(line: 171, column: 89, scope: !89)
!202 = !DILocation(line: 171, column: 2, scope: !89)
!203 = !DILocation(line: 172, column: 13, scope: !89)
!204 = !DILocation(line: 172, column: 17, scope: !89)
!205 = !DILocation(line: 172, column: 2, scope: !89)
!206 = !DILocation(line: 173, column: 15, scope: !89)
!207 = !DILocation(line: 173, column: 19, scope: !89)
!208 = !DILocation(line: 173, column: 30, scope: !89)
!209 = !DILocation(line: 173, column: 36, scope: !89)
!210 = !DILocation(line: 173, column: 43, scope: !89)
!211 = !DILocation(line: 173, column: 41, scope: !89)
!212 = !DILocation(line: 173, column: 49, scope: !89)
!213 = !DILocation(line: 173, column: 55, scope: !89)
!214 = !DILocation(line: 173, column: 62, scope: !89)
!215 = !DILocation(line: 173, column: 60, scope: !89)
!216 = !DILocation(line: 173, column: 2, scope: !89)
!217 = !DILocation(line: 175, column: 6, scope: !218)
!218 = distinct !DILexicalBlock(scope: !89, file: !3, line: 175, column: 6)
!219 = !DILocation(line: 175, column: 10, scope: !218)
!220 = !DILocation(line: 175, column: 6, scope: !89)
!221 = !DILocation(line: 176, column: 14, scope: !222)
!222 = distinct !DILexicalBlock(scope: !218, file: !3, line: 175, column: 18)
!223 = !DILocation(line: 176, column: 18, scope: !222)
!224 = !DILocation(line: 176, column: 3, scope: !222)
!225 = !DILocation(line: 177, column: 14, scope: !222)
!226 = !DILocation(line: 177, column: 18, scope: !222)
!227 = !DILocation(line: 177, column: 29, scope: !222)
!228 = !DILocation(line: 177, column: 33, scope: !222)
!229 = !DILocation(line: 177, column: 41, scope: !222)
!230 = !DILocation(line: 177, column: 45, scope: !222)
!231 = !DILocation(line: 177, column: 58, scope: !222)
!232 = !DILocation(line: 177, column: 62, scope: !222)
!233 = !DILocation(line: 177, column: 75, scope: !222)
!234 = !DILocation(line: 177, column: 79, scope: !222)
!235 = !DILocation(line: 177, column: 92, scope: !222)
!236 = !DILocation(line: 177, column: 96, scope: !222)
!237 = !DILocation(line: 177, column: 3, scope: !222)
!238 = !DILocation(line: 178, column: 21, scope: !222)
!239 = !DILocation(line: 178, column: 25, scope: !222)
!240 = !DILocation(line: 178, column: 36, scope: !222)
!241 = !DILocation(line: 178, column: 40, scope: !222)
!242 = !DILocation(line: 178, column: 47, scope: !222)
!243 = !DILocation(line: 178, column: 51, scope: !222)
!244 = !DILocation(line: 178, column: 3, scope: !222)
!245 = !DILocation(line: 179, column: 2, scope: !222)
!246 = !DILocation(line: 181, column: 6, scope: !247)
!247 = distinct !DILexicalBlock(scope: !89, file: !3, line: 181, column: 6)
!248 = !DILocation(line: 181, column: 10, scope: !247)
!249 = !DILocation(line: 181, column: 18, scope: !247)
!250 = !DILocation(line: 181, column: 6, scope: !89)
!251 = !DILocation(line: 182, column: 14, scope: !247)
!252 = !DILocation(line: 182, column: 18, scope: !247)
!253 = !DILocation(line: 182, column: 3, scope: !247)
!254 = !DILocation(line: 184, column: 11, scope: !89)
!255 = !DILocation(line: 184, column: 15, scope: !89)
!256 = !DILocation(line: 184, column: 26, scope: !89)
!257 = !DILocation(line: 184, column: 31, scope: !89)
!258 = !DILocation(line: 184, column: 2, scope: !89)
!259 = !DILocation(line: 185, column: 14, scope: !89)
!260 = !DILocation(line: 185, column: 18, scope: !89)
!261 = !DILocation(line: 185, column: 2, scope: !89)
!262 = !DILocation(line: 186, column: 6, scope: !263)
!263 = distinct !DILexicalBlock(scope: !89, file: !3, line: 186, column: 6)
!264 = !DILocation(line: 186, column: 10, scope: !263)
!265 = !DILocation(line: 186, column: 6, scope: !89)
!266 = !DILocation(line: 187, column: 15, scope: !263)
!267 = !DILocation(line: 187, column: 19, scope: !263)
!268 = !DILocation(line: 187, column: 3, scope: !263)
!269 = !DILocation(line: 188, column: 6, scope: !270)
!270 = distinct !DILexicalBlock(scope: !89, file: !3, line: 188, column: 6)
!271 = !DILocation(line: 188, column: 10, scope: !270)
!272 = !DILocation(line: 188, column: 18, scope: !270)
!273 = !DILocation(line: 188, column: 6, scope: !89)
!274 = !DILocation(line: 189, column: 15, scope: !270)
!275 = !DILocation(line: 189, column: 19, scope: !270)
!276 = !DILocation(line: 189, column: 3, scope: !270)
!277 = !DILocation(line: 191, column: 12, scope: !89)
!278 = !DILocation(line: 191, column: 3, scope: !89)
!279 = !DILocation(line: 191, column: 10, scope: !89)
!280 = !DILocation(line: 192, column: 12, scope: !89)
!281 = !DILocation(line: 192, column: 3, scope: !89)
!282 = !DILocation(line: 192, column: 10, scope: !89)
!283 = !DILocation(line: 193, column: 1, scope: !89)
!284 = distinct !DISubprogram(name: "uiStyleFontSet", scope: !3, file: !3, line: 454, type: !285, scopeLine: 455, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !54, retainedNodes: !84)
!285 = !DISubroutineType(types: !286)
!286 = !{null, !92}
!287 = !DILocalVariable(name: "fs", arg: 1, scope: !284, file: !3, line: 454, type: !92)
!288 = !DILocation(line: 454, column: 34, scope: !284)
!289 = !DILocalVariable(name: "font", scope: !284, file: !3, line: 456, type: !290)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "uiFont", file: !8, line: 70, baseType: !292)
!292 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uiFont", file: !8, line: 63, size: 8384, elements: !293)
!293 = !{!294, !296, !297, !301, !302, !303, !304}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !292, file: !8, line: 64, baseType: !295, size: 64)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !292, file: !8, line: 64, baseType: !295, size: 64, offset: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !292, file: !8, line: 65, baseType: !298, size: 8192, offset: 128)
!298 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 8192, elements: !299)
!299 = !{!300}
!300 = !DISubrange(count: 1024)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "blf_id", scope: !292, file: !8, line: 66, baseType: !24, size: 16, offset: 8320)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "uifont_id", scope: !292, file: !8, line: 67, baseType: !24, size: 16, offset: 8336)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "r_to_l", scope: !292, file: !8, line: 68, baseType: !24, size: 16, offset: 8352)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "hinting", scope: !292, file: !8, line: 69, baseType: !24, size: 16, offset: 8368)
!305 = !DILocation(line: 456, column: 10, scope: !284)
!306 = !DILocation(line: 456, column: 34, scope: !284)
!307 = !DILocation(line: 456, column: 38, scope: !284)
!308 = !DILocation(line: 456, column: 17, scope: !284)
!309 = !DILocation(line: 458, column: 11, scope: !284)
!310 = !DILocation(line: 458, column: 17, scope: !284)
!311 = !DILocation(line: 458, column: 25, scope: !284)
!312 = !DILocation(line: 458, column: 29, scope: !284)
!313 = !DILocation(line: 458, column: 40, scope: !284)
!314 = !DILocation(line: 458, column: 36, scope: !284)
!315 = !DILocation(line: 458, column: 53, scope: !284)
!316 = !DILocation(line: 458, column: 2, scope: !284)
!317 = !DILocation(line: 459, column: 1, scope: !284)
!318 = distinct !DISubprogram(name: "BLI_rcti_size_y", scope: !319, file: !319, line: 106, type: !320, scopeLine: 106, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !54, retainedNodes: !84)
!319 = !DIFile(filename: "blender/source/blender/blenlib/BLI_rect.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!320 = !DISubroutineType(types: !321)
!321 = !{!100, !322}
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!323 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !97)
!324 = !DILocalVariable(name: "rct", arg: 1, scope: !318, file: !319, line: 106, type: !322)
!325 = !DILocation(line: 106, column: 53, scope: !318)
!326 = !DILocation(line: 106, column: 68, scope: !318)
!327 = !DILocation(line: 106, column: 73, scope: !318)
!328 = !DILocation(line: 106, column: 80, scope: !318)
!329 = !DILocation(line: 106, column: 85, scope: !318)
!330 = !DILocation(line: 106, column: 78, scope: !318)
!331 = !DILocation(line: 106, column: 60, scope: !318)
!332 = distinct !DISubprogram(name: "BLI_rcti_size_x", scope: !319, file: !319, line: 105, type: !320, scopeLine: 105, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !54, retainedNodes: !84)
!333 = !DILocalVariable(name: "rct", arg: 1, scope: !332, file: !319, line: 105, type: !322)
!334 = !DILocation(line: 105, column: 53, scope: !332)
!335 = !DILocation(line: 105, column: 68, scope: !332)
!336 = !DILocation(line: 105, column: 73, scope: !332)
!337 = !DILocation(line: 105, column: 80, scope: !332)
!338 = !DILocation(line: 105, column: 85, scope: !332)
!339 = !DILocation(line: 105, column: 78, scope: !332)
!340 = !DILocation(line: 105, column: 60, scope: !332)
!341 = distinct !DISubprogram(name: "uiStyleFontDraw", scope: !3, file: !3, line: 195, type: !342, scopeLine: 196, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !54, retainedNodes: !84)
!342 = !DISubroutineType(types: !343)
!343 = !{null, !92, !93, !104}
!344 = !DILocalVariable(name: "fs", arg: 1, scope: !341, file: !3, line: 195, type: !92)
!345 = !DILocation(line: 195, column: 35, scope: !341)
!346 = !DILocalVariable(name: "rect", arg: 2, scope: !341, file: !3, line: 195, type: !93)
!347 = !DILocation(line: 195, column: 51, scope: !341)
!348 = !DILocalVariable(name: "str", arg: 3, scope: !341, file: !3, line: 195, type: !104)
!349 = !DILocation(line: 195, column: 69, scope: !341)
!350 = !DILocalVariable(name: "xofs", scope: !341, file: !3, line: 197, type: !38)
!351 = !DILocation(line: 197, column: 8, scope: !341)
!352 = !DILocalVariable(name: "yofs", scope: !341, file: !3, line: 197, type: !38)
!353 = !DILocation(line: 197, column: 14, scope: !341)
!354 = !DILocation(line: 198, column: 21, scope: !341)
!355 = !DILocation(line: 198, column: 25, scope: !341)
!356 = !DILocation(line: 198, column: 31, scope: !341)
!357 = !DILocation(line: 198, column: 2, scope: !341)
!358 = !DILocation(line: 200, column: 1, scope: !341)
!359 = distinct !DISubprogram(name: "uiStyleFontDrawRotated", scope: !3, file: !3, line: 203, type: !342, scopeLine: 204, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !54, retainedNodes: !84)
!360 = !DILocalVariable(name: "fs", arg: 1, scope: !359, file: !3, line: 203, type: !92)
!361 = !DILocation(line: 203, column: 42, scope: !359)
!362 = !DILocalVariable(name: "rect", arg: 2, scope: !359, file: !3, line: 203, type: !93)
!363 = !DILocation(line: 203, column: 58, scope: !359)
!364 = !DILocalVariable(name: "str", arg: 3, scope: !359, file: !3, line: 203, type: !104)
!365 = !DILocation(line: 203, column: 76, scope: !359)
!366 = !DILocalVariable(name: "height", scope: !359, file: !3, line: 205, type: !38)
!367 = !DILocation(line: 205, column: 8, scope: !359)
!368 = !DILocalVariable(name: "xofs", scope: !359, file: !3, line: 206, type: !100)
!369 = !DILocation(line: 206, column: 6, scope: !359)
!370 = !DILocalVariable(name: "yofs", scope: !359, file: !3, line: 206, type: !100)
!371 = !DILocation(line: 206, column: 12, scope: !359)
!372 = !DILocalVariable(name: "angle", scope: !359, file: !3, line: 207, type: !38)
!373 = !DILocation(line: 207, column: 8, scope: !359)
!374 = !DILocalVariable(name: "txtrect", scope: !359, file: !3, line: 208, type: !95)
!375 = !DILocation(line: 208, column: 7, scope: !359)
!376 = !DILocation(line: 210, column: 17, scope: !359)
!377 = !DILocation(line: 210, column: 2, scope: !359)
!378 = !DILocation(line: 212, column: 24, scope: !359)
!379 = !DILocation(line: 212, column: 28, scope: !359)
!380 = !DILocation(line: 212, column: 11, scope: !359)
!381 = !DILocation(line: 212, column: 9, scope: !359)
!382 = !DILocation(line: 214, column: 38, scope: !359)
!383 = !DILocation(line: 214, column: 22, scope: !359)
!384 = !DILocation(line: 214, column: 46, scope: !359)
!385 = !DILocation(line: 214, column: 44, scope: !359)
!386 = !DILocation(line: 214, column: 19, scope: !359)
!387 = !DILocation(line: 214, column: 14, scope: !359)
!388 = !DILocation(line: 214, column: 9, scope: !359)
!389 = !DILocation(line: 214, column: 7, scope: !359)
!390 = !DILocation(line: 219, column: 10, scope: !359)
!391 = !DILocation(line: 219, column: 7, scope: !359)
!392 = !DILocation(line: 220, column: 19, scope: !359)
!393 = !DILocation(line: 220, column: 23, scope: !359)
!394 = !DILocation(line: 220, column: 34, scope: !359)
!395 = !DILocation(line: 220, column: 9, scope: !359)
!396 = !DILocation(line: 220, column: 63, scope: !359)
!397 = !DILocation(line: 220, column: 7, scope: !359)
!398 = !DILocation(line: 221, column: 8, scope: !359)
!399 = !DILocation(line: 224, column: 17, scope: !359)
!400 = !DILocation(line: 224, column: 23, scope: !359)
!401 = !DILocation(line: 224, column: 46, scope: !359)
!402 = !DILocation(line: 224, column: 30, scope: !359)
!403 = !DILocation(line: 224, column: 28, scope: !359)
!404 = !DILocation(line: 224, column: 10, scope: !359)
!405 = !DILocation(line: 224, column: 15, scope: !359)
!406 = !DILocation(line: 225, column: 17, scope: !359)
!407 = !DILocation(line: 225, column: 23, scope: !359)
!408 = !DILocation(line: 225, column: 46, scope: !359)
!409 = !DILocation(line: 225, column: 30, scope: !359)
!410 = !DILocation(line: 225, column: 28, scope: !359)
!411 = !DILocation(line: 225, column: 10, scope: !359)
!412 = !DILocation(line: 225, column: 15, scope: !359)
!413 = !DILocation(line: 226, column: 17, scope: !359)
!414 = !DILocation(line: 226, column: 23, scope: !359)
!415 = !DILocation(line: 226, column: 10, scope: !359)
!416 = !DILocation(line: 226, column: 15, scope: !359)
!417 = !DILocation(line: 227, column: 17, scope: !359)
!418 = !DILocation(line: 227, column: 23, scope: !359)
!419 = !DILocation(line: 227, column: 10, scope: !359)
!420 = !DILocation(line: 227, column: 15, scope: !359)
!421 = !DILocation(line: 231, column: 15, scope: !359)
!422 = !DILocation(line: 231, column: 19, scope: !359)
!423 = !DILocation(line: 231, column: 38, scope: !359)
!424 = !DILocation(line: 231, column: 43, scope: !359)
!425 = !DILocation(line: 231, column: 30, scope: !359)
!426 = !DILocation(line: 231, column: 56, scope: !359)
!427 = !DILocation(line: 231, column: 63, scope: !359)
!428 = !DILocation(line: 231, column: 61, scope: !359)
!429 = !DILocation(line: 231, column: 70, scope: !359)
!430 = !DILocation(line: 231, column: 68, scope: !359)
!431 = !DILocation(line: 231, column: 75, scope: !359)
!432 = !DILocation(line: 231, column: 48, scope: !359)
!433 = !DILocation(line: 231, column: 80, scope: !359)
!434 = !DILocation(line: 231, column: 86, scope: !359)
!435 = !DILocation(line: 231, column: 91, scope: !359)
!436 = !DILocation(line: 231, column: 96, scope: !359)
!437 = !DILocation(line: 231, column: 102, scope: !359)
!438 = !DILocation(line: 231, column: 107, scope: !359)
!439 = !DILocation(line: 231, column: 2, scope: !359)
!440 = !DILocation(line: 232, column: 13, scope: !359)
!441 = !DILocation(line: 232, column: 17, scope: !359)
!442 = !DILocation(line: 232, column: 2, scope: !359)
!443 = !DILocation(line: 233, column: 15, scope: !359)
!444 = !DILocation(line: 233, column: 19, scope: !359)
!445 = !DILocation(line: 233, column: 38, scope: !359)
!446 = !DILocation(line: 233, column: 45, scope: !359)
!447 = !DILocation(line: 233, column: 43, scope: !359)
!448 = !DILocation(line: 233, column: 30, scope: !359)
!449 = !DILocation(line: 233, column: 59, scope: !359)
!450 = !DILocation(line: 233, column: 66, scope: !359)
!451 = !DILocation(line: 233, column: 64, scope: !359)
!452 = !DILocation(line: 233, column: 51, scope: !359)
!453 = !DILocation(line: 233, column: 2, scope: !359)
!454 = !DILocation(line: 235, column: 13, scope: !359)
!455 = !DILocation(line: 235, column: 17, scope: !359)
!456 = !DILocation(line: 235, column: 2, scope: !359)
!457 = !DILocation(line: 236, column: 15, scope: !359)
!458 = !DILocation(line: 236, column: 19, scope: !359)
!459 = !DILocation(line: 236, column: 30, scope: !359)
!460 = !DILocation(line: 236, column: 2, scope: !359)
!461 = !DILocation(line: 238, column: 6, scope: !462)
!462 = distinct !DILexicalBlock(scope: !359, file: !3, line: 238, column: 6)
!463 = !DILocation(line: 238, column: 10, scope: !462)
!464 = !DILocation(line: 238, column: 6, scope: !359)
!465 = !DILocation(line: 239, column: 14, scope: !466)
!466 = distinct !DILexicalBlock(scope: !462, file: !3, line: 238, column: 18)
!467 = !DILocation(line: 239, column: 18, scope: !466)
!468 = !DILocation(line: 239, column: 3, scope: !466)
!469 = !DILocation(line: 240, column: 14, scope: !466)
!470 = !DILocation(line: 240, column: 18, scope: !466)
!471 = !DILocation(line: 240, column: 29, scope: !466)
!472 = !DILocation(line: 240, column: 33, scope: !466)
!473 = !DILocation(line: 240, column: 41, scope: !466)
!474 = !DILocation(line: 240, column: 45, scope: !466)
!475 = !DILocation(line: 240, column: 58, scope: !466)
!476 = !DILocation(line: 240, column: 62, scope: !466)
!477 = !DILocation(line: 240, column: 75, scope: !466)
!478 = !DILocation(line: 240, column: 79, scope: !466)
!479 = !DILocation(line: 240, column: 92, scope: !466)
!480 = !DILocation(line: 240, column: 96, scope: !466)
!481 = !DILocation(line: 240, column: 3, scope: !466)
!482 = !DILocation(line: 241, column: 21, scope: !466)
!483 = !DILocation(line: 241, column: 25, scope: !466)
!484 = !DILocation(line: 241, column: 36, scope: !466)
!485 = !DILocation(line: 241, column: 40, scope: !466)
!486 = !DILocation(line: 241, column: 47, scope: !466)
!487 = !DILocation(line: 241, column: 51, scope: !466)
!488 = !DILocation(line: 241, column: 3, scope: !466)
!489 = !DILocation(line: 242, column: 2, scope: !466)
!490 = !DILocation(line: 244, column: 6, scope: !491)
!491 = distinct !DILexicalBlock(scope: !359, file: !3, line: 244, column: 6)
!492 = !DILocation(line: 244, column: 10, scope: !491)
!493 = !DILocation(line: 244, column: 18, scope: !491)
!494 = !DILocation(line: 244, column: 6, scope: !359)
!495 = !DILocation(line: 245, column: 14, scope: !491)
!496 = !DILocation(line: 245, column: 18, scope: !491)
!497 = !DILocation(line: 245, column: 3, scope: !491)
!498 = !DILocation(line: 247, column: 11, scope: !359)
!499 = !DILocation(line: 247, column: 15, scope: !359)
!500 = !DILocation(line: 247, column: 26, scope: !359)
!501 = !DILocation(line: 247, column: 2, scope: !359)
!502 = !DILocation(line: 248, column: 14, scope: !359)
!503 = !DILocation(line: 248, column: 18, scope: !359)
!504 = !DILocation(line: 248, column: 2, scope: !359)
!505 = !DILocation(line: 249, column: 14, scope: !359)
!506 = !DILocation(line: 249, column: 18, scope: !359)
!507 = !DILocation(line: 249, column: 2, scope: !359)
!508 = !DILocation(line: 250, column: 6, scope: !509)
!509 = distinct !DILexicalBlock(scope: !359, file: !3, line: 250, column: 6)
!510 = !DILocation(line: 250, column: 10, scope: !509)
!511 = !DILocation(line: 250, column: 6, scope: !359)
!512 = !DILocation(line: 251, column: 15, scope: !509)
!513 = !DILocation(line: 251, column: 19, scope: !509)
!514 = !DILocation(line: 251, column: 3, scope: !509)
!515 = !DILocation(line: 252, column: 6, scope: !516)
!516 = distinct !DILexicalBlock(scope: !359, file: !3, line: 252, column: 6)
!517 = !DILocation(line: 252, column: 10, scope: !516)
!518 = !DILocation(line: 252, column: 18, scope: !516)
!519 = !DILocation(line: 252, column: 6, scope: !359)
!520 = !DILocation(line: 253, column: 15, scope: !516)
!521 = !DILocation(line: 253, column: 19, scope: !516)
!522 = !DILocation(line: 253, column: 3, scope: !516)
!523 = !DILocation(line: 254, column: 1, scope: !359)
!524 = distinct !DISubprogram(name: "UI_GetStyle", scope: !3, file: !3, line: 258, type: !4, scopeLine: 259, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !54, retainedNodes: !84)
!525 = !DILocalVariable(name: "style", scope: !524, file: !3, line: 260, type: !6)
!526 = !DILocation(line: 260, column: 11, scope: !524)
!527 = !DILocation(line: 263, column: 10, scope: !524)
!528 = !DILocation(line: 263, column: 16, scope: !524)
!529 = !DILocation(line: 263, column: 9, scope: !524)
!530 = !DILocation(line: 263, column: 27, scope: !524)
!531 = !DILocation(line: 263, column: 46, scope: !524)
!532 = !DILocation(line: 263, column: 2, scope: !524)
!533 = !DILocalVariable(name: "style", scope: !2, file: !3, line: 269, type: !6)
!534 = !DILocation(line: 269, column: 11, scope: !2)
!535 = !DILocation(line: 269, column: 19, scope: !2)
!536 = !DILocation(line: 272, column: 12, scope: !2)
!537 = !DILocation(line: 272, column: 11, scope: !2)
!538 = !DILocation(line: 274, column: 36, scope: !2)
!539 = !DILocation(line: 274, column: 67, scope: !2)
!540 = !DILocation(line: 274, column: 49, scope: !2)
!541 = !DILocation(line: 274, column: 47, scope: !2)
!542 = !DILocation(line: 274, column: 28, scope: !2)
!543 = !DILocation(line: 274, column: 26, scope: !2)
!544 = !DILocation(line: 275, column: 36, scope: !2)
!545 = !DILocation(line: 275, column: 67, scope: !2)
!546 = !DILocation(line: 275, column: 49, scope: !2)
!547 = !DILocation(line: 275, column: 47, scope: !2)
!548 = !DILocation(line: 275, column: 28, scope: !2)
!549 = !DILocation(line: 275, column: 26, scope: !2)
!550 = !DILocation(line: 276, column: 36, scope: !2)
!551 = !DILocation(line: 276, column: 67, scope: !2)
!552 = !DILocation(line: 276, column: 49, scope: !2)
!553 = !DILocation(line: 276, column: 47, scope: !2)
!554 = !DILocation(line: 276, column: 28, scope: !2)
!555 = !DILocation(line: 276, column: 26, scope: !2)
!556 = !DILocation(line: 277, column: 36, scope: !2)
!557 = !DILocation(line: 277, column: 67, scope: !2)
!558 = !DILocation(line: 277, column: 49, scope: !2)
!559 = !DILocation(line: 277, column: 47, scope: !2)
!560 = !DILocation(line: 277, column: 28, scope: !2)
!561 = !DILocation(line: 277, column: 26, scope: !2)
!562 = !DILocation(line: 278, column: 37, scope: !2)
!563 = !DILocation(line: 278, column: 69, scope: !2)
!564 = !DILocation(line: 278, column: 50, scope: !2)
!565 = !DILocation(line: 278, column: 48, scope: !2)
!566 = !DILocation(line: 278, column: 29, scope: !2)
!567 = !DILocation(line: 278, column: 27, scope: !2)
!568 = !DILocation(line: 279, column: 37, scope: !2)
!569 = !DILocation(line: 279, column: 69, scope: !2)
!570 = !DILocation(line: 279, column: 50, scope: !2)
!571 = !DILocation(line: 279, column: 48, scope: !2)
!572 = !DILocation(line: 279, column: 29, scope: !2)
!573 = !DILocation(line: 279, column: 27, scope: !2)
!574 = !DILocation(line: 281, column: 31, scope: !2)
!575 = !DILocation(line: 281, column: 51, scope: !2)
!576 = !DILocation(line: 281, column: 44, scope: !2)
!577 = !DILocation(line: 281, column: 42, scope: !2)
!578 = !DILocation(line: 281, column: 23, scope: !2)
!579 = !DILocation(line: 281, column: 21, scope: !2)
!580 = !DILocation(line: 282, column: 33, scope: !2)
!581 = !DILocation(line: 282, column: 53, scope: !2)
!582 = !DILocation(line: 282, column: 46, scope: !2)
!583 = !DILocation(line: 282, column: 44, scope: !2)
!584 = !DILocation(line: 282, column: 25, scope: !2)
!585 = !DILocation(line: 282, column: 23, scope: !2)
!586 = !DILocation(line: 283, column: 28, scope: !2)
!587 = !DILocation(line: 283, column: 48, scope: !2)
!588 = !DILocation(line: 283, column: 41, scope: !2)
!589 = !DILocation(line: 283, column: 39, scope: !2)
!590 = !DILocation(line: 283, column: 20, scope: !2)
!591 = !DILocation(line: 283, column: 18, scope: !2)
!592 = !DILocation(line: 284, column: 32, scope: !2)
!593 = !DILocation(line: 284, column: 52, scope: !2)
!594 = !DILocation(line: 284, column: 45, scope: !2)
!595 = !DILocation(line: 284, column: 43, scope: !2)
!596 = !DILocation(line: 284, column: 24, scope: !2)
!597 = !DILocation(line: 284, column: 22, scope: !2)
!598 = !DILocation(line: 285, column: 32, scope: !2)
!599 = !DILocation(line: 285, column: 52, scope: !2)
!600 = !DILocation(line: 285, column: 45, scope: !2)
!601 = !DILocation(line: 285, column: 43, scope: !2)
!602 = !DILocation(line: 285, column: 24, scope: !2)
!603 = !DILocation(line: 285, column: 22, scope: !2)
!604 = !DILocation(line: 286, column: 30, scope: !2)
!605 = !DILocation(line: 286, column: 50, scope: !2)
!606 = !DILocation(line: 286, column: 43, scope: !2)
!607 = !DILocation(line: 286, column: 41, scope: !2)
!608 = !DILocation(line: 286, column: 22, scope: !2)
!609 = !DILocation(line: 286, column: 20, scope: !2)
!610 = !DILocation(line: 287, column: 30, scope: !2)
!611 = !DILocation(line: 287, column: 50, scope: !2)
!612 = !DILocation(line: 287, column: 43, scope: !2)
!613 = !DILocation(line: 287, column: 41, scope: !2)
!614 = !DILocation(line: 287, column: 22, scope: !2)
!615 = !DILocation(line: 287, column: 20, scope: !2)
!616 = !DILocation(line: 289, column: 2, scope: !2)
!617 = distinct !DISubprogram(name: "UI_GetStringWidth", scope: !3, file: !3, line: 293, type: !618, scopeLine: 294, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !54, retainedNodes: !84)
!618 = !DISubroutineType(types: !619)
!619 = !{!100, !104}
!620 = !DILocalVariable(name: "str", arg: 1, scope: !617, file: !3, line: 293, type: !104)
!621 = !DILocation(line: 293, column: 35, scope: !617)
!622 = !DILocalVariable(name: "style", scope: !617, file: !3, line: 295, type: !6)
!623 = !DILocation(line: 295, column: 11, scope: !617)
!624 = !DILocation(line: 295, column: 19, scope: !617)
!625 = !DILocalVariable(name: "fstyle", scope: !617, file: !3, line: 296, type: !92)
!626 = !DILocation(line: 296, column: 15, scope: !617)
!627 = !DILocation(line: 296, column: 25, scope: !617)
!628 = !DILocation(line: 296, column: 32, scope: !617)
!629 = !DILocalVariable(name: "width", scope: !617, file: !3, line: 297, type: !100)
!630 = !DILocation(line: 297, column: 6, scope: !617)
!631 = !DILocation(line: 299, column: 6, scope: !632)
!632 = distinct !DILexicalBlock(scope: !617, file: !3, line: 299, column: 6)
!633 = !DILocation(line: 299, column: 14, scope: !632)
!634 = !DILocation(line: 299, column: 22, scope: !632)
!635 = !DILocation(line: 299, column: 6, scope: !617)
!636 = !DILocation(line: 300, column: 14, scope: !632)
!637 = !DILocation(line: 300, column: 22, scope: !632)
!638 = !DILocation(line: 300, column: 3, scope: !632)
!639 = !DILocation(line: 302, column: 17, scope: !617)
!640 = !DILocation(line: 302, column: 2, scope: !617)
!641 = !DILocation(line: 303, column: 20, scope: !617)
!642 = !DILocation(line: 303, column: 28, scope: !617)
!643 = !DILocation(line: 303, column: 39, scope: !617)
!644 = !DILocation(line: 303, column: 10, scope: !617)
!645 = !DILocation(line: 303, column: 8, scope: !617)
!646 = !DILocation(line: 305, column: 6, scope: !647)
!647 = distinct !DILexicalBlock(scope: !617, file: !3, line: 305, column: 6)
!648 = !DILocation(line: 305, column: 14, scope: !647)
!649 = !DILocation(line: 305, column: 22, scope: !647)
!650 = !DILocation(line: 305, column: 6, scope: !617)
!651 = !DILocation(line: 306, column: 15, scope: !647)
!652 = !DILocation(line: 306, column: 23, scope: !647)
!653 = !DILocation(line: 306, column: 3, scope: !647)
!654 = !DILocation(line: 308, column: 9, scope: !617)
!655 = !DILocation(line: 308, column: 2, scope: !617)
!656 = distinct !DISubprogram(name: "UI_DrawString", scope: !3, file: !3, line: 312, type: !657, scopeLine: 313, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !54, retainedNodes: !84)
!657 = !DISubroutineType(types: !658)
!658 = !{null, !38, !38, !104}
!659 = !DILocalVariable(name: "x", arg: 1, scope: !656, file: !3, line: 312, type: !38)
!660 = !DILocation(line: 312, column: 26, scope: !656)
!661 = !DILocalVariable(name: "y", arg: 2, scope: !656, file: !3, line: 312, type: !38)
!662 = !DILocation(line: 312, column: 35, scope: !656)
!663 = !DILocalVariable(name: "str", arg: 3, scope: !656, file: !3, line: 312, type: !104)
!664 = !DILocation(line: 312, column: 50, scope: !656)
!665 = !DILocalVariable(name: "style", scope: !656, file: !3, line: 314, type: !6)
!666 = !DILocation(line: 314, column: 11, scope: !656)
!667 = !DILocation(line: 314, column: 19, scope: !656)
!668 = !DILocation(line: 316, column: 6, scope: !669)
!669 = distinct !DILexicalBlock(scope: !656, file: !3, line: 316, column: 6)
!670 = !DILocation(line: 316, column: 13, scope: !669)
!671 = !DILocation(line: 316, column: 20, scope: !669)
!672 = !DILocation(line: 316, column: 28, scope: !669)
!673 = !DILocation(line: 316, column: 6, scope: !656)
!674 = !DILocation(line: 317, column: 14, scope: !669)
!675 = !DILocation(line: 317, column: 21, scope: !669)
!676 = !DILocation(line: 317, column: 28, scope: !669)
!677 = !DILocation(line: 317, column: 3, scope: !669)
!678 = !DILocation(line: 319, column: 18, scope: !656)
!679 = !DILocation(line: 319, column: 25, scope: !656)
!680 = !DILocation(line: 319, column: 2, scope: !656)
!681 = !DILocation(line: 320, column: 15, scope: !656)
!682 = !DILocation(line: 320, column: 22, scope: !656)
!683 = !DILocation(line: 320, column: 29, scope: !656)
!684 = !DILocation(line: 320, column: 40, scope: !656)
!685 = !DILocation(line: 320, column: 43, scope: !656)
!686 = !DILocation(line: 320, column: 2, scope: !656)
!687 = !DILocation(line: 321, column: 11, scope: !656)
!688 = !DILocation(line: 321, column: 18, scope: !656)
!689 = !DILocation(line: 321, column: 25, scope: !656)
!690 = !DILocation(line: 321, column: 36, scope: !656)
!691 = !DILocation(line: 321, column: 2, scope: !656)
!692 = !DILocation(line: 323, column: 6, scope: !693)
!693 = distinct !DILexicalBlock(scope: !656, file: !3, line: 323, column: 6)
!694 = !DILocation(line: 323, column: 13, scope: !693)
!695 = !DILocation(line: 323, column: 20, scope: !693)
!696 = !DILocation(line: 323, column: 28, scope: !693)
!697 = !DILocation(line: 323, column: 6, scope: !656)
!698 = !DILocation(line: 324, column: 15, scope: !693)
!699 = !DILocation(line: 324, column: 22, scope: !693)
!700 = !DILocation(line: 324, column: 29, scope: !693)
!701 = !DILocation(line: 324, column: 3, scope: !693)
!702 = !DILocation(line: 325, column: 1, scope: !656)
!703 = distinct !DISubprogram(name: "uiStyleInit", scope: !3, file: !3, line: 331, type: !704, scopeLine: 332, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !54, retainedNodes: !84)
!704 = !DISubroutineType(types: !705)
!705 = !{null}
!706 = !DILocalVariable(name: "font", scope: !703, file: !3, line: 333, type: !290)
!707 = !DILocation(line: 333, column: 10, scope: !703)
!708 = !DILocalVariable(name: "style", scope: !703, file: !3, line: 334, type: !6)
!709 = !DILocation(line: 334, column: 11, scope: !703)
!710 = !DILocation(line: 334, column: 30, scope: !703)
!711 = !DILocation(line: 334, column: 19, scope: !703)
!712 = !DILocalVariable(name: "monofont_size", scope: !703, file: !3, line: 335, type: !100)
!713 = !DILocation(line: 335, column: 6, scope: !703)
!714 = !DILocation(line: 335, column: 22, scope: !703)
!715 = !DILocalVariable(name: "monofont_ttf", scope: !703, file: !3, line: 336, type: !81)
!716 = !DILocation(line: 336, column: 17, scope: !703)
!717 = !DILocation(line: 339, column: 8, scope: !718)
!718 = distinct !DILexicalBlock(scope: !703, file: !3, line: 339, column: 6)
!719 = !DILocation(line: 339, column: 12, scope: !718)
!720 = !DILocation(line: 339, column: 6, scope: !703)
!721 = !DILocation(line: 340, column: 9, scope: !718)
!722 = !DILocation(line: 340, column: 3, scope: !718)
!723 = !DILocation(line: 341, column: 2, scope: !724)
!724 = distinct !DILexicalBlock(scope: !725, file: !3, line: 341, column: 2)
!725 = distinct !DILexicalBlock(scope: !703, file: !3, line: 341, column: 2)
!726 = !DILocation(line: 341, column: 2, scope: !725)
!727 = !DILocation(line: 341, column: 2, scope: !728)
!728 = distinct !DILexicalBlock(scope: !724, file: !3, line: 341, column: 2)
!729 = !DILocation(line: 343, column: 24, scope: !730)
!730 = distinct !DILexicalBlock(scope: !703, file: !3, line: 343, column: 2)
!731 = !DILocation(line: 343, column: 14, scope: !730)
!732 = !DILocation(line: 343, column: 12, scope: !730)
!733 = !DILocation(line: 343, column: 7, scope: !730)
!734 = !DILocation(line: 343, column: 31, scope: !735)
!735 = distinct !DILexicalBlock(scope: !730, file: !3, line: 343, column: 2)
!736 = !DILocation(line: 343, column: 2, scope: !730)
!737 = !DILocation(line: 344, column: 17, scope: !738)
!738 = distinct !DILexicalBlock(scope: !735, file: !3, line: 343, column: 56)
!739 = !DILocation(line: 344, column: 23, scope: !738)
!740 = !DILocation(line: 344, column: 3, scope: !738)
!741 = !DILocation(line: 345, column: 2, scope: !738)
!742 = !DILocation(line: 343, column: 44, scope: !735)
!743 = !DILocation(line: 343, column: 50, scope: !735)
!744 = !DILocation(line: 343, column: 42, scope: !735)
!745 = !DILocation(line: 343, column: 2, scope: !735)
!746 = distinct !{!746, !736, !747}
!747 = !DILocation(line: 345, column: 2, scope: !730)
!748 = !DILocation(line: 347, column: 19, scope: !703)
!749 = !DILocation(line: 347, column: 9, scope: !703)
!750 = !DILocation(line: 347, column: 7, scope: !703)
!751 = !DILocation(line: 350, column: 6, scope: !752)
!752 = distinct !DILexicalBlock(scope: !703, file: !3, line: 350, column: 6)
!753 = !DILocation(line: 350, column: 11, scope: !752)
!754 = !DILocation(line: 350, column: 6, scope: !703)
!755 = !DILocation(line: 351, column: 10, scope: !756)
!756 = distinct !DILexicalBlock(scope: !752, file: !3, line: 350, column: 20)
!757 = !DILocation(line: 351, column: 8, scope: !756)
!758 = !DILocation(line: 352, column: 27, scope: !756)
!759 = !DILocation(line: 352, column: 3, scope: !756)
!760 = !DILocation(line: 353, column: 2, scope: !756)
!761 = !DILocation(line: 355, column: 6, scope: !762)
!762 = distinct !DILexicalBlock(scope: !703, file: !3, line: 355, column: 6)
!763 = !DILocation(line: 355, column: 6, scope: !703)
!764 = !DILocation(line: 356, column: 15, scope: !765)
!765 = distinct !DILexicalBlock(scope: !762, file: !3, line: 355, column: 25)
!766 = !DILocation(line: 356, column: 21, scope: !765)
!767 = !DILocation(line: 356, column: 3, scope: !765)
!768 = !DILocation(line: 357, column: 3, scope: !765)
!769 = !DILocation(line: 357, column: 9, scope: !765)
!770 = !DILocation(line: 357, column: 19, scope: !765)
!771 = !DILocation(line: 358, column: 2, scope: !765)
!772 = !DILocation(line: 360, column: 15, scope: !773)
!773 = distinct !DILexicalBlock(scope: !762, file: !3, line: 359, column: 7)
!774 = !DILocation(line: 360, column: 21, scope: !773)
!775 = !DILocation(line: 360, column: 3, scope: !773)
!776 = !DILocation(line: 361, column: 3, scope: !773)
!777 = !DILocation(line: 361, column: 9, scope: !773)
!778 = !DILocation(line: 361, column: 19, scope: !773)
!779 = !DILocation(line: 364, column: 24, scope: !780)
!780 = distinct !DILexicalBlock(scope: !703, file: !3, line: 364, column: 2)
!781 = !DILocation(line: 364, column: 14, scope: !780)
!782 = !DILocation(line: 364, column: 12, scope: !780)
!783 = !DILocation(line: 364, column: 7, scope: !780)
!784 = !DILocation(line: 364, column: 31, scope: !785)
!785 = distinct !DILexicalBlock(scope: !780, file: !3, line: 364, column: 2)
!786 = !DILocation(line: 364, column: 2, scope: !780)
!787 = !DILocation(line: 366, column: 7, scope: !788)
!788 = distinct !DILexicalBlock(scope: !789, file: !3, line: 366, column: 7)
!789 = distinct !DILexicalBlock(scope: !785, file: !3, line: 364, column: 56)
!790 = !DILocation(line: 366, column: 13, scope: !788)
!791 = !DILocation(line: 366, column: 23, scope: !788)
!792 = !DILocation(line: 366, column: 7, scope: !789)
!793 = !DILocation(line: 391, column: 79, scope: !794)
!794 = distinct !DILexicalBlock(scope: !788, file: !3, line: 366, column: 42)
!795 = !DILocation(line: 391, column: 19, scope: !794)
!796 = !DILocation(line: 391, column: 4, scope: !794)
!797 = !DILocation(line: 391, column: 10, scope: !794)
!798 = !DILocation(line: 391, column: 17, scope: !794)
!799 = !DILocation(line: 393, column: 3, scope: !794)
!800 = !DILocation(line: 395, column: 28, scope: !801)
!801 = distinct !DILexicalBlock(scope: !788, file: !3, line: 394, column: 8)
!802 = !DILocation(line: 395, column: 34, scope: !801)
!803 = !DILocation(line: 395, column: 19, scope: !801)
!804 = !DILocation(line: 395, column: 4, scope: !801)
!805 = !DILocation(line: 395, column: 10, scope: !801)
!806 = !DILocation(line: 395, column: 17, scope: !801)
!807 = !DILocation(line: 396, column: 8, scope: !808)
!808 = distinct !DILexicalBlock(scope: !801, file: !3, line: 396, column: 8)
!809 = !DILocation(line: 396, column: 14, scope: !808)
!810 = !DILocation(line: 396, column: 21, scope: !808)
!811 = !DILocation(line: 396, column: 8, scope: !801)
!812 = !DILocation(line: 397, column: 80, scope: !813)
!813 = distinct !DILexicalBlock(scope: !808, file: !3, line: 396, column: 28)
!814 = !DILocation(line: 397, column: 20, scope: !813)
!815 = !DILocation(line: 397, column: 5, scope: !813)
!816 = !DILocation(line: 397, column: 11, scope: !813)
!817 = !DILocation(line: 397, column: 18, scope: !813)
!818 = !DILocation(line: 398, column: 4, scope: !813)
!819 = !DILocation(line: 400, column: 21, scope: !820)
!820 = distinct !DILexicalBlock(scope: !808, file: !3, line: 399, column: 9)
!821 = !DILocation(line: 400, column: 27, scope: !820)
!822 = !DILocation(line: 400, column: 5, scope: !820)
!823 = !DILocation(line: 404, column: 7, scope: !824)
!824 = distinct !DILexicalBlock(scope: !789, file: !3, line: 404, column: 7)
!825 = !DILocation(line: 404, column: 13, scope: !824)
!826 = !DILocation(line: 404, column: 20, scope: !824)
!827 = !DILocation(line: 404, column: 7, scope: !789)
!828 = !DILocation(line: 405, column: 10, scope: !829)
!829 = distinct !DILexicalBlock(scope: !830, file: !3, line: 405, column: 8)
!830 = distinct !DILexicalBlock(scope: !824, file: !3, line: 404, column: 27)
!831 = !DILocation(line: 405, column: 16, scope: !829)
!832 = !DILocation(line: 405, column: 8, scope: !830)
!833 = !DILocation(line: 406, column: 5, scope: !829)
!834 = !DILocation(line: 407, column: 3, scope: !830)
!835 = !DILocation(line: 413, column: 13, scope: !836)
!836 = distinct !DILexicalBlock(scope: !824, file: !3, line: 408, column: 8)
!837 = !DILocation(line: 413, column: 19, scope: !836)
!838 = !DILocation(line: 413, column: 34, scope: !836)
!839 = !DILocation(line: 413, column: 30, scope: !836)
!840 = !DILocation(line: 413, column: 27, scope: !836)
!841 = !DILocation(line: 413, column: 47, scope: !836)
!842 = !DILocation(line: 413, column: 4, scope: !836)
!843 = !DILocation(line: 414, column: 13, scope: !836)
!844 = !DILocation(line: 414, column: 19, scope: !836)
!845 = !DILocation(line: 414, column: 34, scope: !836)
!846 = !DILocation(line: 414, column: 30, scope: !836)
!847 = !DILocation(line: 414, column: 27, scope: !836)
!848 = !DILocation(line: 414, column: 47, scope: !836)
!849 = !DILocation(line: 414, column: 4, scope: !836)
!850 = !DILocation(line: 415, column: 13, scope: !836)
!851 = !DILocation(line: 415, column: 19, scope: !836)
!852 = !DILocation(line: 415, column: 34, scope: !836)
!853 = !DILocation(line: 415, column: 30, scope: !836)
!854 = !DILocation(line: 415, column: 27, scope: !836)
!855 = !DILocation(line: 415, column: 47, scope: !836)
!856 = !DILocation(line: 415, column: 4, scope: !836)
!857 = !DILocation(line: 417, column: 2, scope: !789)
!858 = !DILocation(line: 364, column: 44, scope: !785)
!859 = !DILocation(line: 364, column: 50, scope: !785)
!860 = !DILocation(line: 364, column: 42, scope: !785)
!861 = !DILocation(line: 364, column: 2, scope: !785)
!862 = distinct !{!862, !786, !863}
!863 = !DILocation(line: 417, column: 2, scope: !780)
!864 = !DILocation(line: 419, column: 6, scope: !865)
!865 = distinct !DILexicalBlock(scope: !703, file: !3, line: 419, column: 6)
!866 = !DILocation(line: 419, column: 12, scope: !865)
!867 = !DILocation(line: 419, column: 6, scope: !703)
!868 = !DILocation(line: 420, column: 3, scope: !869)
!869 = distinct !DILexicalBlock(scope: !865, file: !3, line: 419, column: 21)
!870 = !DILocation(line: 421, column: 2, scope: !869)
!871 = !DILocation(line: 442, column: 6, scope: !872)
!872 = distinct !DILexicalBlock(scope: !703, file: !3, line: 442, column: 6)
!873 = !DILocation(line: 442, column: 20, scope: !872)
!874 = !DILocation(line: 442, column: 6, scope: !703)
!875 = !DILocation(line: 443, column: 52, scope: !872)
!876 = !DILocation(line: 443, column: 66, scope: !872)
!877 = !DILocation(line: 443, column: 19, scope: !872)
!878 = !DILocation(line: 443, column: 17, scope: !872)
!879 = !DILocation(line: 443, column: 3, scope: !872)
!880 = !DILocation(line: 445, column: 11, scope: !703)
!881 = !DILocation(line: 445, column: 33, scope: !703)
!882 = !DILocation(line: 445, column: 29, scope: !703)
!883 = !DILocation(line: 445, column: 26, scope: !703)
!884 = !DILocation(line: 445, column: 2, scope: !703)
!885 = !DILocation(line: 448, column: 6, scope: !886)
!886 = distinct !DILexicalBlock(scope: !703, file: !3, line: 448, column: 6)
!887 = !DILocation(line: 448, column: 27, scope: !886)
!888 = !DILocation(line: 448, column: 6, scope: !703)
!889 = !DILocation(line: 449, column: 59, scope: !886)
!890 = !DILocation(line: 449, column: 73, scope: !886)
!891 = !DILocation(line: 449, column: 26, scope: !886)
!892 = !DILocation(line: 449, column: 24, scope: !886)
!893 = !DILocation(line: 449, column: 3, scope: !886)
!894 = !DILocation(line: 451, column: 11, scope: !703)
!895 = !DILocation(line: 451, column: 40, scope: !703)
!896 = !DILocation(line: 451, column: 36, scope: !703)
!897 = !DILocation(line: 451, column: 33, scope: !703)
!898 = !DILocation(line: 451, column: 2, scope: !703)
!899 = !DILocation(line: 452, column: 1, scope: !703)
!900 = distinct !DISubprogram(name: "ui_style_new", scope: !3, file: !3, line: 82, type: !901, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !54, retainedNodes: !84)
!901 = !DISubroutineType(types: !902)
!902 = !{!6, !903, !104, !24}
!903 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !904, size: 64)
!904 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !905, line: 71, baseType: !906)
!905 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!906 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !905, line: 69, size: 128, elements: !907)
!907 = !{!908, !909}
!908 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !906, file: !905, line: 70, baseType: !80, size: 64)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !906, file: !905, line: 70, baseType: !80, size: 64, offset: 64)
!910 = !DILocalVariable(name: "styles", arg: 1, scope: !900, file: !3, line: 82, type: !903)
!911 = !DILocation(line: 82, column: 40, scope: !900)
!912 = !DILocalVariable(name: "name", arg: 2, scope: !900, file: !3, line: 82, type: !104)
!913 = !DILocation(line: 82, column: 60, scope: !900)
!914 = !DILocalVariable(name: "uifont_id", arg: 3, scope: !900, file: !3, line: 82, type: !24)
!915 = !DILocation(line: 82, column: 72, scope: !900)
!916 = !DILocalVariable(name: "style", scope: !900, file: !3, line: 84, type: !6)
!917 = !DILocation(line: 84, column: 11, scope: !900)
!918 = !DILocation(line: 84, column: 19, scope: !900)
!919 = !DILocation(line: 86, column: 14, scope: !900)
!920 = !DILocation(line: 86, column: 22, scope: !900)
!921 = !DILocation(line: 86, column: 2, scope: !900)
!922 = !DILocation(line: 87, column: 14, scope: !900)
!923 = !DILocation(line: 87, column: 21, scope: !900)
!924 = !DILocation(line: 87, column: 27, scope: !900)
!925 = !DILocation(line: 87, column: 2, scope: !900)
!926 = !DILocation(line: 89, column: 2, scope: !900)
!927 = !DILocation(line: 89, column: 9, scope: !900)
!928 = !DILocation(line: 89, column: 19, scope: !900)
!929 = !DILocation(line: 91, column: 32, scope: !900)
!930 = !DILocation(line: 91, column: 2, scope: !900)
!931 = !DILocation(line: 91, column: 9, scope: !900)
!932 = !DILocation(line: 91, column: 20, scope: !900)
!933 = !DILocation(line: 91, column: 30, scope: !900)
!934 = !DILocation(line: 92, column: 2, scope: !900)
!935 = !DILocation(line: 92, column: 9, scope: !900)
!936 = !DILocation(line: 92, column: 20, scope: !900)
!937 = !DILocation(line: 92, column: 27, scope: !900)
!938 = !DILocation(line: 93, column: 2, scope: !900)
!939 = !DILocation(line: 93, column: 9, scope: !900)
!940 = !DILocation(line: 93, column: 20, scope: !900)
!941 = !DILocation(line: 93, column: 28, scope: !900)
!942 = !DILocation(line: 94, column: 2, scope: !900)
!943 = !DILocation(line: 94, column: 9, scope: !900)
!944 = !DILocation(line: 94, column: 20, scope: !900)
!945 = !DILocation(line: 94, column: 27, scope: !900)
!946 = !DILocation(line: 95, column: 2, scope: !900)
!947 = !DILocation(line: 95, column: 9, scope: !900)
!948 = !DILocation(line: 95, column: 20, scope: !900)
!949 = !DILocation(line: 95, column: 26, scope: !900)
!950 = !DILocation(line: 96, column: 2, scope: !900)
!951 = !DILocation(line: 96, column: 9, scope: !900)
!952 = !DILocation(line: 96, column: 20, scope: !900)
!953 = !DILocation(line: 96, column: 26, scope: !900)
!954 = !DILocation(line: 97, column: 2, scope: !900)
!955 = !DILocation(line: 97, column: 9, scope: !900)
!956 = !DILocation(line: 97, column: 20, scope: !900)
!957 = !DILocation(line: 97, column: 32, scope: !900)
!958 = !DILocation(line: 98, column: 2, scope: !900)
!959 = !DILocation(line: 98, column: 9, scope: !900)
!960 = !DILocation(line: 98, column: 20, scope: !900)
!961 = !DILocation(line: 98, column: 32, scope: !900)
!962 = !DILocation(line: 100, column: 32, scope: !900)
!963 = !DILocation(line: 100, column: 2, scope: !900)
!964 = !DILocation(line: 100, column: 9, scope: !900)
!965 = !DILocation(line: 100, column: 20, scope: !900)
!966 = !DILocation(line: 100, column: 30, scope: !900)
!967 = !DILocation(line: 101, column: 2, scope: !900)
!968 = !DILocation(line: 101, column: 9, scope: !900)
!969 = !DILocation(line: 101, column: 20, scope: !900)
!970 = !DILocation(line: 101, column: 27, scope: !900)
!971 = !DILocation(line: 102, column: 2, scope: !900)
!972 = !DILocation(line: 102, column: 9, scope: !900)
!973 = !DILocation(line: 102, column: 20, scope: !900)
!974 = !DILocation(line: 102, column: 28, scope: !900)
!975 = !DILocation(line: 103, column: 2, scope: !900)
!976 = !DILocation(line: 103, column: 9, scope: !900)
!977 = !DILocation(line: 103, column: 20, scope: !900)
!978 = !DILocation(line: 103, column: 27, scope: !900)
