; ModuleID = 'blender/source/blender/render/intern/source/imagetexture.c'
source_filename = "blender/source/blender/render/intern/source/imagetexture.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !23, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "blender/source/blender/render/intern/source/imagetexture.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!2 = !{!3, !17}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 133, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9, !10, !11, !12, !13, !14, !15, !16}
!7 = !DIEnumerator(name: "IMA_FIELDS", value: 1, isUnsigned: true)
!8 = !DIEnumerator(name: "IMA_STD_FIELD", value: 2, isUnsigned: true)
!9 = !DIEnumerator(name: "IMA_DO_PREMUL", value: 4, isUnsigned: true)
!10 = !DIEnumerator(name: "IMA_REFLECT", value: 16, isUnsigned: true)
!11 = !DIEnumerator(name: "IMA_NOCOLLECT", value: 32, isUnsigned: true)
!12 = !DIEnumerator(name: "IMA_OLD_PREMUL", value: 128, isUnsigned: true)
!13 = !DIEnumerator(name: "IMA_USED_FOR_RENDER", value: 512, isUnsigned: true)
!14 = !DIEnumerator(name: "IMA_USER_FRAME_IN_RANGE", value: 1024, isUnsigned: true)
!15 = !DIEnumerator(name: "IMA_VIEW_AS_RENDER", value: 2048, isUnsigned: true)
!16 = !DIEnumerator(name: "IMA_IGNORE_ALPHA", value: 4096, isUnsigned: true)
!17 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1, line: 672, baseType: !5, size: 32, elements: !18)
!18 = !{!19, !20, !21, !22}
!19 = !DIEnumerator(name: "TXC_XMIR", value: 1, isUnsigned: true)
!20 = !DIEnumerator(name: "TXC_YMIR", value: 2, isUnsigned: true)
!21 = !DIEnumerator(name: "TXC_REPT", value: 3, isUnsigned: true)
!22 = !DIEnumerator(name: "TXC_EXTD", value: 4, isUnsigned: true)
!23 = !{!24, !25, !26, !27, !29}
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!25 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!26 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!28 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "ReadEWAData", file: !1, line: 797, baseType: !31)
!31 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ReadEWAData", file: !1, line: 794, size: 128, elements: !32)
!32 = !{!33, !119}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "ibuf", scope: !31, file: !1, line: 795, baseType: !34, size: 64)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImBuf", file: !36, line: 141, baseType: !37)
!36 = !DIFile(filename: "blender/source/blender/imbuf/IMB_imbuf_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!37 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImBuf", file: !36, line: 70, size: 19840, elements: !38)
!38 = !{!39, !41, !42, !43, !44, !46, !47, !48, !49, !51, !53, !58, !59, !60, !61, !62, !64, !66, !67, !68, !72, !73, !74, !75, !76, !79, !80, !81, !85, !86, !89, !90, !92, !93, !94, !97, !98, !99, !102, !103, !112}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !37, file: !36, line: 71, baseType: !40, size: 64)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !37, file: !36, line: 71, baseType: !40, size: 64, offset: 64)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !37, file: !36, line: 74, baseType: !25, size: 32, offset: 128)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !37, file: !36, line: 74, baseType: !25, size: 32, offset: 160)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !37, file: !36, line: 79, baseType: !45, size: 8, offset: 192)
!45 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !37, file: !36, line: 80, baseType: !25, size: 32, offset: 224)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !37, file: !36, line: 83, baseType: !25, size: 32, offset: 256)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "mall", scope: !37, file: !36, line: 84, baseType: !25, size: 32, offset: 288)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !37, file: !36, line: 87, baseType: !50, size: 64, offset: 320)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "rect_float", scope: !37, file: !36, line: 88, baseType: !52, size: 64, offset: 384)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "ppm", scope: !37, file: !36, line: 93, baseType: !54, size: 128, offset: 448)
!54 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 128, elements: !56)
!55 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!56 = !{!57}
!57 = !DISubrange(count: 2)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "tilex", scope: !37, file: !36, line: 96, baseType: !25, size: 32, offset: 576)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "tiley", scope: !37, file: !36, line: 96, baseType: !25, size: 32, offset: 608)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "xtiles", scope: !37, file: !36, line: 97, baseType: !25, size: 32, offset: 640)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "ytiles", scope: !37, file: !36, line: 97, baseType: !25, size: 32, offset: 672)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "tiles", scope: !37, file: !36, line: 98, baseType: !63, size: 64, offset: 704)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "zbuf", scope: !37, file: !36, line: 101, baseType: !65, size: 64, offset: 768)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "zbuf_float", scope: !37, file: !36, line: 102, baseType: !52, size: 64, offset: 832)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !37, file: !36, line: 105, baseType: !26, size: 32, offset: 896)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "mipmap", scope: !37, file: !36, line: 108, baseType: !69, size: 1280, offset: 960)
!69 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 1280, elements: !70)
!70 = !{!71}
!71 = !DISubrange(count: 20)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "miptot", scope: !37, file: !36, line: 109, baseType: !25, size: 32, offset: 2240)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "miplevel", scope: !37, file: !36, line: 109, baseType: !25, size: 32, offset: 2272)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !37, file: !36, line: 112, baseType: !25, size: 32, offset: 2304)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "userflags", scope: !37, file: !36, line: 113, baseType: !25, size: 32, offset: 2336)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !37, file: !36, line: 114, baseType: !77, size: 64, offset: 2368)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = !DICompositeType(tag: DW_TAG_structure_type, name: "ImMetaData", file: !36, line: 50, flags: DIFlagFwdDecl)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "userdata", scope: !37, file: !36, line: 115, baseType: !24, size: 64, offset: 2432)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "ftype", scope: !37, file: !36, line: 118, baseType: !25, size: 32, offset: 2496)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !37, file: !36, line: 119, baseType: !82, size: 8192, offset: 2528)
!82 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 8192, elements: !83)
!83 = !{!84}
!84 = !DISubrange(count: 1024)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "cachename", scope: !37, file: !36, line: 120, baseType: !82, size: 8192, offset: 10720)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "c_handle", scope: !37, file: !36, line: 123, baseType: !87, size: 64, offset: 18944)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!88 = !DICompositeType(tag: DW_TAG_structure_type, name: "MEM_CacheLimiterHandle_s", file: !36, line: 123, flags: DIFlagFwdDecl)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "refcounter", scope: !37, file: !36, line: 124, baseType: !25, size: 32, offset: 19008)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "encodedbuffer", scope: !37, file: !36, line: 127, baseType: !91, size: 64, offset: 19072)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "encodedsize", scope: !37, file: !36, line: 128, baseType: !5, size: 32, offset: 19136)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "encodedbuffersize", scope: !37, file: !36, line: 129, baseType: !5, size: 32, offset: 19168)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "rect_colorspace", scope: !37, file: !36, line: 132, baseType: !95, size: 64, offset: 19200)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = !DICompositeType(tag: DW_TAG_structure_type, name: "ColorSpace", file: !36, line: 132, flags: DIFlagFwdDecl)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "float_colorspace", scope: !37, file: !36, line: 133, baseType: !95, size: 64, offset: 19264)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "display_buffer_flags", scope: !37, file: !36, line: 134, baseType: !50, size: 64, offset: 19328)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "colormanage_cache", scope: !37, file: !36, line: 135, baseType: !100, size: 64, offset: 19392)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = !DICompositeType(tag: DW_TAG_structure_type, name: "ColormanageCache", file: !36, line: 135, flags: DIFlagFwdDecl)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "colormanage_flag", scope: !37, file: !36, line: 136, baseType: !25, size: 32, offset: 19456)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "invalid_rect", scope: !37, file: !36, line: 137, baseType: !104, size: 128, offset: 19488)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "rcti", file: !105, line: 89, baseType: !106)
!105 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rcti", file: !105, line: 86, size: 128, elements: !107)
!107 = !{!108, !109, !110, !111}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !106, file: !105, line: 87, baseType: !25, size: 32)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !106, file: !105, line: 87, baseType: !25, size: 32, offset: 32)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !106, file: !105, line: 88, baseType: !25, size: 32, offset: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !106, file: !105, line: 88, baseType: !25, size: 32, offset: 96)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "dds_data", scope: !37, file: !36, line: 140, baseType: !113, size: 192, offset: 19648)
!113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DDSData", file: !36, line: 55, size: 192, elements: !114)
!114 = !{!115, !116, !117, !118}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "fourcc", scope: !113, file: !36, line: 56, baseType: !5, size: 32)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "nummipmaps", scope: !113, file: !36, line: 57, baseType: !5, size: 32, offset: 32)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !113, file: !36, line: 58, baseType: !91, size: 64, offset: 64)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !113, file: !36, line: 59, baseType: !5, size: 32, offset: 128)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "AFD", scope: !31, file: !1, line: 796, baseType: !120, size: 64, offset: 64)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "afdata_t", file: !1, line: 669, baseType: !122)
!122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "afdata_t", file: !1, line: 662, size: 384, elements: !123)
!123 = !{!124, !126, !127, !128, !129, !130, !131, !132, !133, !134}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "dxt", scope: !122, file: !1, line: 663, baseType: !125, size: 64)
!125 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 64, elements: !56)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "dyt", scope: !122, file: !1, line: 663, baseType: !125, size: 64, offset: 64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "intpol", scope: !122, file: !1, line: 664, baseType: !25, size: 32, offset: 128)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "extflag", scope: !122, file: !1, line: 664, baseType: !25, size: 32, offset: 160)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "majrad", scope: !122, file: !1, line: 666, baseType: !26, size: 32, offset: 192)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "minrad", scope: !122, file: !1, line: 666, baseType: !26, size: 32, offset: 224)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "theta", scope: !122, file: !1, line: 666, baseType: !26, size: 32, offset: 256)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "iProbes", scope: !122, file: !1, line: 667, baseType: !25, size: 32, offset: 288)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "dusc", scope: !122, file: !1, line: 668, baseType: !26, size: 32, offset: 320)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "dvsc", scope: !122, file: !1, line: 668, baseType: !26, size: 32, offset: 352)
!135 = !{i32 7, !"Dwarf Version", i32 4}
!136 = !{i32 2, !"Debug Info Version", i32 3}
!137 = !{i32 1, !"wchar_size", i32 4}
!138 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!139 = distinct !DISubprogram(name: "imagewrap", scope: !1, file: !1, line: 108, type: !140, scopeLine: 109, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !1638)
!140 = !DISubroutineType(types: !141)
!141 = !{!25, !142, !1619, !34, !1621, !1623, !1635}
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "Tex", file: !144, line: 261, baseType: !145)
!144 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Tex", file: !144, line: 202, size: 3328, elements: !146)
!146 = !{!147, !213, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !1511, !1512, !1513, !1514, !1535, !1559, !1560, !1589, !1609, !1617, !1618}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !145, file: !144, line: 203, baseType: !148, size: 960)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !149, line: 130, baseType: !150)
!149 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!150 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !149, line: 117, size: 960, elements: !151)
!151 = !{!152, !153, !154, !156, !172, !176, !178, !179, !180, !181}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !150, file: !149, line: 118, baseType: !24, size: 64)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !150, file: !149, line: 118, baseType: !24, size: 64, offset: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !150, file: !149, line: 119, baseType: !155, size: 64, offset: 128)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !150, file: !149, line: 120, baseType: !157, size: 64, offset: 192)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !149, line: 136, size: 17600, elements: !159)
!159 = !{!160, !161, !163, !166, !167, !168, !169}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !158, file: !149, line: 137, baseType: !148, size: 960)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !158, file: !149, line: 138, baseType: !162, size: 64, offset: 960)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !158, file: !149, line: 139, baseType: !164, size: 64, offset: 1024)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!165 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !149, line: 43, flags: DIFlagFwdDecl)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !158, file: !149, line: 140, baseType: !82, size: 8192, offset: 1088)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !158, file: !149, line: 141, baseType: !82, size: 8192, offset: 9280)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !158, file: !149, line: 148, baseType: !157, size: 64, offset: 17472)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !158, file: !149, line: 150, baseType: !170, size: 64, offset: 17536)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !149, line: 45, flags: DIFlagFwdDecl)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !150, file: !149, line: 121, baseType: !173, size: 528, offset: 256)
!173 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 528, elements: !174)
!174 = !{!175}
!175 = !DISubrange(count: 66)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !150, file: !149, line: 126, baseType: !177, size: 16, offset: 784)
!177 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !150, file: !149, line: 127, baseType: !25, size: 32, offset: 800)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !150, file: !149, line: 128, baseType: !25, size: 32, offset: 832)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !150, file: !149, line: 128, baseType: !25, size: 32, offset: 864)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !150, file: !149, line: 129, baseType: !182, size: 64, offset: 896)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !149, line: 75, baseType: !184)
!184 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !149, line: 62, size: 1024, elements: !185)
!185 = !{!186, !188, !189, !190, !191, !192, !196, !197, !211, !212}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !184, file: !149, line: 63, baseType: !187, size: 64)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !184, file: !149, line: 63, baseType: !187, size: 64, offset: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !184, file: !149, line: 64, baseType: !28, size: 8, offset: 128)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !184, file: !149, line: 64, baseType: !28, size: 8, offset: 136)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !184, file: !149, line: 65, baseType: !177, size: 16, offset: 144)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !184, file: !149, line: 66, baseType: !193, size: 512, offset: 160)
!193 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 512, elements: !194)
!194 = !{!195}
!195 = !DISubrange(count: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !184, file: !149, line: 67, baseType: !25, size: 32, offset: 672)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !184, file: !149, line: 69, baseType: !198, size: 256, offset: 704)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !149, line: 60, baseType: !199)
!199 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !149, line: 48, size: 256, elements: !200)
!200 = !{!201, !202, !209, !210}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !199, file: !149, line: 49, baseType: !24, size: 64)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !199, file: !149, line: 58, baseType: !203, size: 128, offset: 64)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !204, line: 71, baseType: !205)
!204 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !204, line: 69, size: 128, elements: !206)
!206 = !{!207, !208}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !205, file: !204, line: 70, baseType: !24, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !205, file: !204, line: 70, baseType: !24, size: 64, offset: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !199, file: !149, line: 59, baseType: !25, size: 32, offset: 192)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !199, file: !149, line: 59, baseType: !25, size: 32, offset: 224)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !184, file: !149, line: 70, baseType: !25, size: 32, offset: 960)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !184, file: !149, line: 74, baseType: !25, size: 32, offset: 992)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !145, file: !144, line: 204, baseType: !214, size: 64, offset: 960)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!215 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !216, line: 58, flags: DIFlagFwdDecl)
!216 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!217 = !DIDerivedType(tag: DW_TAG_member, name: "noisesize", scope: !145, file: !144, line: 206, baseType: !26, size: 32, offset: 1024)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "turbul", scope: !145, file: !144, line: 206, baseType: !26, size: 32, offset: 1056)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "bright", scope: !145, file: !144, line: 207, baseType: !26, size: 32, offset: 1088)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "contrast", scope: !145, file: !144, line: 207, baseType: !26, size: 32, offset: 1120)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "saturation", scope: !145, file: !144, line: 207, baseType: !26, size: 32, offset: 1152)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "rfac", scope: !145, file: !144, line: 207, baseType: !26, size: 32, offset: 1184)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "gfac", scope: !145, file: !144, line: 207, baseType: !26, size: 32, offset: 1216)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "bfac", scope: !145, file: !144, line: 207, baseType: !26, size: 32, offset: 1248)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "filtersize", scope: !145, file: !144, line: 208, baseType: !26, size: 32, offset: 1280)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !145, file: !144, line: 208, baseType: !26, size: 32, offset: 1312)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "mg_H", scope: !145, file: !144, line: 211, baseType: !26, size: 32, offset: 1344)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "mg_lacunarity", scope: !145, file: !144, line: 211, baseType: !26, size: 32, offset: 1376)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "mg_octaves", scope: !145, file: !144, line: 211, baseType: !26, size: 32, offset: 1408)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "mg_offset", scope: !145, file: !144, line: 211, baseType: !26, size: 32, offset: 1440)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "mg_gain", scope: !145, file: !144, line: 211, baseType: !26, size: 32, offset: 1472)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "dist_amount", scope: !145, file: !144, line: 214, baseType: !26, size: 32, offset: 1504)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "ns_outscale", scope: !145, file: !144, line: 214, baseType: !26, size: 32, offset: 1536)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w1", scope: !145, file: !144, line: 217, baseType: !26, size: 32, offset: 1568)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w2", scope: !145, file: !144, line: 218, baseType: !26, size: 32, offset: 1600)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w3", scope: !145, file: !144, line: 219, baseType: !26, size: 32, offset: 1632)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "vn_w4", scope: !145, file: !144, line: 220, baseType: !26, size: 32, offset: 1664)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "vn_mexp", scope: !145, file: !144, line: 221, baseType: !26, size: 32, offset: 1696)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "vn_distm", scope: !145, file: !144, line: 222, baseType: !177, size: 16, offset: 1728)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "vn_coltype", scope: !145, file: !144, line: 222, baseType: !177, size: 16, offset: 1744)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "noisedepth", scope: !145, file: !144, line: 224, baseType: !177, size: 16, offset: 1760)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "noisetype", scope: !145, file: !144, line: 224, baseType: !177, size: 16, offset: 1776)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis", scope: !145, file: !144, line: 227, baseType: !177, size: 16, offset: 1792)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "noisebasis2", scope: !145, file: !144, line: 227, baseType: !177, size: 16, offset: 1808)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "imaflag", scope: !145, file: !144, line: 229, baseType: !177, size: 16, offset: 1824)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !145, file: !144, line: 229, baseType: !177, size: 16, offset: 1840)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !145, file: !144, line: 230, baseType: !177, size: 16, offset: 1856)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "stype", scope: !145, file: !144, line: 230, baseType: !177, size: 16, offset: 1872)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmin", scope: !145, file: !144, line: 232, baseType: !26, size: 32, offset: 1888)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "cropymin", scope: !145, file: !144, line: 232, baseType: !26, size: 32, offset: 1920)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "cropxmax", scope: !145, file: !144, line: 232, baseType: !26, size: 32, offset: 1952)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "cropymax", scope: !145, file: !144, line: 232, baseType: !26, size: 32, offset: 1984)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "texfilter", scope: !145, file: !144, line: 233, baseType: !25, size: 32, offset: 2016)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "afmax", scope: !145, file: !144, line: 234, baseType: !25, size: 32, offset: 2048)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "xrepeat", scope: !145, file: !144, line: 235, baseType: !177, size: 16, offset: 2080)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "yrepeat", scope: !145, file: !144, line: 235, baseType: !177, size: 16, offset: 2096)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "extend", scope: !145, file: !144, line: 236, baseType: !177, size: 16, offset: 2112)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !145, file: !144, line: 239, baseType: !177, size: 16, offset: 2128)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !145, file: !144, line: 240, baseType: !25, size: 32, offset: 2144)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !145, file: !144, line: 241, baseType: !25, size: 32, offset: 2176)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !145, file: !144, line: 241, baseType: !25, size: 32, offset: 2208)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !145, file: !144, line: 241, baseType: !25, size: 32, offset: 2240)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "checkerdist", scope: !145, file: !144, line: 243, baseType: !26, size: 32, offset: 2272)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "nabla", scope: !145, file: !144, line: 243, baseType: !26, size: 32, offset: 2304)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !145, file: !144, line: 244, baseType: !26, size: 32, offset: 2336)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !145, file: !144, line: 246, baseType: !267, size: 320, offset: 2368)
!267 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !4, line: 50, size: 320, elements: !268)
!268 = !{!269, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !267, file: !4, line: 51, baseType: !270, size: 64)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !216, line: 1216, size: 39680, elements: !272)
!272 = !{!273, !274, !275, !547, !720, !721, !722, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !748, !749, !752, !1077, !1080, !1371, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1393, !1394, !1395, !1396, !1397, !1405, !1472, !1479, !1480, !1487, !1490, !1491, !1492, !1493, !1494, !1495}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !271, file: !216, line: 1217, baseType: !148, size: 960)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !271, file: !216, line: 1218, baseType: !214, size: 64, offset: 960)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !271, file: !216, line: 1220, baseType: !276, size: 64, offset: 1024)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!277 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !278, line: 115, size: 11392, elements: !279)
!278 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!279 = !{!280, !281, !282, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !299, !310, !324, !325, !368, !369, !372, !373, !389, !390, !391, !392, !393, !394, !395, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !414, !415, !416, !417, !418, !419, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !479, !480, !481, !482, !483, !484, !485, !486, !487, !490, !493, !497, !498, !499, !500, !501, !504, !507, !511, !512, !518, !519, !520, !521, !522, !523, !525, !528, !531, !532, !535, !536}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !277, file: !278, line: 116, baseType: !148, size: 960)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !277, file: !278, line: 117, baseType: !214, size: 64, offset: 960)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !277, file: !278, line: 119, baseType: !283, size: 64, offset: 1024)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64)
!284 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !278, line: 57, flags: DIFlagFwdDecl)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !277, file: !278, line: 121, baseType: !177, size: 16, offset: 1088)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !277, file: !278, line: 121, baseType: !177, size: 16, offset: 1104)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !277, file: !278, line: 122, baseType: !25, size: 32, offset: 1120)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !277, file: !278, line: 122, baseType: !25, size: 32, offset: 1152)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !277, file: !278, line: 122, baseType: !25, size: 32, offset: 1184)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !277, file: !278, line: 123, baseType: !193, size: 512, offset: 1216)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !277, file: !278, line: 124, baseType: !276, size: 64, offset: 1728)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !277, file: !278, line: 124, baseType: !276, size: 64, offset: 1792)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !277, file: !278, line: 127, baseType: !276, size: 64, offset: 1856)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !277, file: !278, line: 127, baseType: !276, size: 64, offset: 1920)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !277, file: !278, line: 127, baseType: !276, size: 64, offset: 1984)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !277, file: !278, line: 128, baseType: !297, size: 64, offset: 2048)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64)
!298 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !144, line: 46, flags: DIFlagFwdDecl)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !277, file: !278, line: 130, baseType: !300, size: 64, offset: 2112)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64)
!301 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !278, line: 97, size: 832, elements: !302)
!302 = !{!303, !308, !309}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !301, file: !278, line: 98, baseType: !304, size: 768)
!304 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 768, elements: !305)
!305 = !{!306, !307}
!306 = !DISubrange(count: 8)
!307 = !DISubrange(count: 3)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !301, file: !278, line: 99, baseType: !25, size: 32, offset: 768)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !301, file: !278, line: 99, baseType: !25, size: 32, offset: 800)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !277, file: !278, line: 131, baseType: !311, size: 64, offset: 2176)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!312 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !313, line: 486, size: 1600, elements: !314)
!313 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!314 = !{!315, !316, !317, !318, !319, !320, !321, !322, !323}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !312, file: !313, line: 487, baseType: !148, size: 960)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !312, file: !313, line: 489, baseType: !203, size: 128, offset: 960)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !312, file: !313, line: 490, baseType: !203, size: 128, offset: 1088)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !312, file: !313, line: 491, baseType: !203, size: 128, offset: 1216)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !312, file: !313, line: 492, baseType: !203, size: 128, offset: 1344)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !312, file: !313, line: 494, baseType: !25, size: 32, offset: 1472)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !312, file: !313, line: 495, baseType: !25, size: 32, offset: 1504)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !312, file: !313, line: 497, baseType: !25, size: 32, offset: 1536)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !312, file: !313, line: 498, baseType: !25, size: 32, offset: 1568)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !277, file: !278, line: 132, baseType: !311, size: 64, offset: 2240)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !277, file: !278, line: 133, baseType: !326, size: 64, offset: 2304)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!327 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !313, line: 334, size: 1728, elements: !328)
!328 = !{!329, !330, !333, !334, !335, !336, !337, !338, !341, !342, !343, !344, !345, !346, !347, !367}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !327, file: !313, line: 335, baseType: !203, size: 128)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !327, file: !313, line: 336, baseType: !331, size: 64, offset: 128)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!332 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !313, line: 47, flags: DIFlagFwdDecl)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !327, file: !313, line: 338, baseType: !177, size: 16, offset: 192)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !327, file: !313, line: 338, baseType: !177, size: 16, offset: 208)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !327, file: !313, line: 339, baseType: !5, size: 32, offset: 224)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !327, file: !313, line: 340, baseType: !25, size: 32, offset: 256)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !327, file: !313, line: 342, baseType: !26, size: 32, offset: 288)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !327, file: !313, line: 343, baseType: !339, size: 96, offset: 320)
!339 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 96, elements: !340)
!340 = !{!307}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !327, file: !313, line: 344, baseType: !339, size: 96, offset: 416)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !327, file: !313, line: 347, baseType: !203, size: 128, offset: 512)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !327, file: !313, line: 349, baseType: !25, size: 32, offset: 640)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !327, file: !313, line: 350, baseType: !25, size: 32, offset: 672)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !327, file: !313, line: 351, baseType: !24, size: 64, offset: 704)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !327, file: !313, line: 352, baseType: !24, size: 64, offset: 768)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !327, file: !313, line: 354, baseType: !348, size: 384, offset: 832)
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !313, line: 116, baseType: !349)
!349 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !313, line: 94, size: 384, elements: !350)
!350 = !{!351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !349, file: !313, line: 96, baseType: !25, size: 32)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !349, file: !313, line: 96, baseType: !25, size: 32, offset: 32)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !349, file: !313, line: 97, baseType: !25, size: 32, offset: 64)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !349, file: !313, line: 97, baseType: !25, size: 32, offset: 96)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !349, file: !313, line: 99, baseType: !177, size: 16, offset: 128)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !349, file: !313, line: 100, baseType: !177, size: 16, offset: 144)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !349, file: !313, line: 102, baseType: !177, size: 16, offset: 160)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !349, file: !313, line: 105, baseType: !177, size: 16, offset: 176)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !349, file: !313, line: 108, baseType: !177, size: 16, offset: 192)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !349, file: !313, line: 109, baseType: !177, size: 16, offset: 208)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !349, file: !313, line: 111, baseType: !177, size: 16, offset: 224)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !349, file: !313, line: 112, baseType: !177, size: 16, offset: 240)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !349, file: !313, line: 114, baseType: !25, size: 32, offset: 256)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !349, file: !313, line: 114, baseType: !25, size: 32, offset: 288)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !349, file: !313, line: 115, baseType: !25, size: 32, offset: 320)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !349, file: !313, line: 115, baseType: !25, size: 32, offset: 352)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !327, file: !313, line: 355, baseType: !193, size: 512, offset: 1216)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !277, file: !278, line: 134, baseType: !24, size: 64, offset: 2368)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !277, file: !278, line: 136, baseType: !370, size: 64, offset: 2432)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!371 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !216, line: 61, flags: DIFlagFwdDecl)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !277, file: !278, line: 138, baseType: !348, size: 384, offset: 2496)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !277, file: !278, line: 139, baseType: !374, size: 64, offset: 2880)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !313, line: 80, baseType: !376)
!376 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !313, line: 72, size: 192, elements: !377)
!377 = !{!378, !385, !386, !387, !388}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !376, file: !313, line: 73, baseType: !379, size: 64)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !313, line: 59, baseType: !381)
!381 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !313, line: 56, size: 128, elements: !382)
!382 = !{!383, !384}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !381, file: !313, line: 57, baseType: !339, size: 96)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !381, file: !313, line: 58, baseType: !25, size: 32, offset: 96)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !376, file: !313, line: 74, baseType: !25, size: 32, offset: 64)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !376, file: !313, line: 76, baseType: !25, size: 32, offset: 96)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !376, file: !313, line: 77, baseType: !25, size: 32, offset: 128)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !376, file: !313, line: 79, baseType: !25, size: 32, offset: 160)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !277, file: !278, line: 141, baseType: !203, size: 128, offset: 2944)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !277, file: !278, line: 142, baseType: !203, size: 128, offset: 3072)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !277, file: !278, line: 143, baseType: !203, size: 128, offset: 3200)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !277, file: !278, line: 144, baseType: !203, size: 128, offset: 3328)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !277, file: !278, line: 146, baseType: !25, size: 32, offset: 3456)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !277, file: !278, line: 147, baseType: !25, size: 32, offset: 3488)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !277, file: !278, line: 150, baseType: !396, size: 64, offset: 3520)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !216, line: 179, flags: DIFlagFwdDecl)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !277, file: !278, line: 151, baseType: !27, size: 64, offset: 3584)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !277, file: !278, line: 152, baseType: !25, size: 32, offset: 3648)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !277, file: !278, line: 153, baseType: !25, size: 32, offset: 3680)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !277, file: !278, line: 156, baseType: !339, size: 96, offset: 3712)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !277, file: !278, line: 156, baseType: !339, size: 96, offset: 3808)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !277, file: !278, line: 156, baseType: !339, size: 96, offset: 3904)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !277, file: !278, line: 157, baseType: !339, size: 96, offset: 4000)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !277, file: !278, line: 158, baseType: !339, size: 96, offset: 4096)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !277, file: !278, line: 159, baseType: !339, size: 96, offset: 4192)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !277, file: !278, line: 160, baseType: !339, size: 96, offset: 4288)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !277, file: !278, line: 160, baseType: !339, size: 96, offset: 4384)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !277, file: !278, line: 161, baseType: !411, size: 128, offset: 4480)
!411 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 128, elements: !412)
!412 = !{!413}
!413 = !DISubrange(count: 4)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !277, file: !278, line: 161, baseType: !411, size: 128, offset: 4608)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !277, file: !278, line: 162, baseType: !339, size: 96, offset: 4736)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !277, file: !278, line: 162, baseType: !339, size: 96, offset: 4832)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !277, file: !278, line: 163, baseType: !26, size: 32, offset: 4928)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !277, file: !278, line: 163, baseType: !26, size: 32, offset: 4960)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !277, file: !278, line: 164, baseType: !420, size: 512, offset: 4992)
!420 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 512, elements: !421)
!421 = !{!413, !413}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !277, file: !278, line: 165, baseType: !420, size: 512, offset: 5504)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !277, file: !278, line: 166, baseType: !420, size: 512, offset: 6016)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !277, file: !278, line: 167, baseType: !420, size: 512, offset: 6528)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !277, file: !278, line: 176, baseType: !420, size: 512, offset: 7040)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !277, file: !278, line: 178, baseType: !5, size: 32, offset: 7552)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !277, file: !278, line: 180, baseType: !177, size: 16, offset: 7584)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !277, file: !278, line: 181, baseType: !177, size: 16, offset: 7600)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !277, file: !278, line: 183, baseType: !177, size: 16, offset: 7616)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !277, file: !278, line: 183, baseType: !177, size: 16, offset: 7632)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !277, file: !278, line: 184, baseType: !177, size: 16, offset: 7648)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !277, file: !278, line: 184, baseType: !177, size: 16, offset: 7664)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !277, file: !278, line: 185, baseType: !177, size: 16, offset: 7680)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !277, file: !278, line: 186, baseType: !177, size: 16, offset: 7696)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !277, file: !278, line: 187, baseType: !177, size: 16, offset: 7712)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !277, file: !278, line: 188, baseType: !28, size: 8, offset: 7728)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !277, file: !278, line: 189, baseType: !28, size: 8, offset: 7736)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !277, file: !278, line: 192, baseType: !25, size: 32, offset: 7744)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !277, file: !278, line: 192, baseType: !25, size: 32, offset: 7776)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !277, file: !278, line: 192, baseType: !25, size: 32, offset: 7808)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !277, file: !278, line: 192, baseType: !25, size: 32, offset: 7840)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !277, file: !278, line: 194, baseType: !25, size: 32, offset: 7872)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !277, file: !278, line: 202, baseType: !26, size: 32, offset: 7904)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !277, file: !278, line: 202, baseType: !26, size: 32, offset: 7936)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !277, file: !278, line: 202, baseType: !26, size: 32, offset: 7968)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !277, file: !278, line: 211, baseType: !26, size: 32, offset: 8000)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !277, file: !278, line: 212, baseType: !26, size: 32, offset: 8032)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !277, file: !278, line: 213, baseType: !26, size: 32, offset: 8064)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !277, file: !278, line: 214, baseType: !26, size: 32, offset: 8096)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !277, file: !278, line: 215, baseType: !26, size: 32, offset: 8128)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !277, file: !278, line: 216, baseType: !26, size: 32, offset: 8160)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !277, file: !278, line: 219, baseType: !26, size: 32, offset: 8192)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !277, file: !278, line: 220, baseType: !26, size: 32, offset: 8224)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !277, file: !278, line: 221, baseType: !26, size: 32, offset: 8256)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !277, file: !278, line: 224, baseType: !456, size: 16, offset: 8288)
!456 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !277, file: !278, line: 224, baseType: !456, size: 16, offset: 8304)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !277, file: !278, line: 226, baseType: !177, size: 16, offset: 8320)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !277, file: !278, line: 228, baseType: !28, size: 8, offset: 8336)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !277, file: !278, line: 229, baseType: !28, size: 8, offset: 8344)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !277, file: !278, line: 231, baseType: !177, size: 16, offset: 8352)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !277, file: !278, line: 232, baseType: !28, size: 8, offset: 8368)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !277, file: !278, line: 233, baseType: !28, size: 8, offset: 8376)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !277, file: !278, line: 234, baseType: !26, size: 32, offset: 8384)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !277, file: !278, line: 235, baseType: !26, size: 32, offset: 8416)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !277, file: !278, line: 237, baseType: !203, size: 128, offset: 8448)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !277, file: !278, line: 238, baseType: !203, size: 128, offset: 8576)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !277, file: !278, line: 239, baseType: !203, size: 128, offset: 8704)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !277, file: !278, line: 240, baseType: !203, size: 128, offset: 8832)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !277, file: !278, line: 242, baseType: !26, size: 32, offset: 8960)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !277, file: !278, line: 244, baseType: !177, size: 16, offset: 8992)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !277, file: !278, line: 245, baseType: !456, size: 16, offset: 9008)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !277, file: !278, line: 246, baseType: !411, size: 128, offset: 9024)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !277, file: !278, line: 248, baseType: !25, size: 32, offset: 9152)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !277, file: !278, line: 249, baseType: !25, size: 32, offset: 9184)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !277, file: !278, line: 251, baseType: !477, size: 64, offset: 9216)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64)
!478 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !278, line: 251, flags: DIFlagFwdDecl)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !277, file: !278, line: 253, baseType: !28, size: 8, offset: 9280)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !277, file: !278, line: 254, baseType: !28, size: 8, offset: 9288)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !277, file: !278, line: 255, baseType: !177, size: 16, offset: 9296)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !277, file: !278, line: 256, baseType: !339, size: 96, offset: 9312)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !277, file: !278, line: 258, baseType: !203, size: 128, offset: 9408)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !277, file: !278, line: 259, baseType: !203, size: 128, offset: 9536)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !277, file: !278, line: 260, baseType: !203, size: 128, offset: 9664)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !277, file: !278, line: 261, baseType: !203, size: 128, offset: 9792)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !277, file: !278, line: 263, baseType: !488, size: 64, offset: 9920)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64)
!489 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !278, line: 52, flags: DIFlagFwdDecl)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !277, file: !278, line: 264, baseType: !491, size: 64, offset: 9984)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64)
!492 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !278, line: 53, flags: DIFlagFwdDecl)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !277, file: !278, line: 265, baseType: !494, size: 64, offset: 10048)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64)
!495 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !496, line: 43, flags: DIFlagFwdDecl)
!496 = !DIFile(filename: "blender/source/blender/makesdna/DNA_freestyle_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!497 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !277, file: !278, line: 267, baseType: !28, size: 8, offset: 10112)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !277, file: !278, line: 268, baseType: !28, size: 8, offset: 10120)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !277, file: !278, line: 269, baseType: !177, size: 16, offset: 10128)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !277, file: !278, line: 270, baseType: !26, size: 32, offset: 10144)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !277, file: !278, line: 272, baseType: !502, size: 64, offset: 10176)
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64)
!503 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !278, line: 54, flags: DIFlagFwdDecl)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !277, file: !278, line: 275, baseType: !505, size: 64, offset: 10240)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64)
!506 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !278, line: 275, flags: DIFlagFwdDecl)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !277, file: !278, line: 277, baseType: !508, size: 64, offset: 10304)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64)
!509 = !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !510, line: 40, flags: DIFlagFwdDecl)
!510 = !DIFile(filename: "blender/source/blender/render/extern/include/RE_render_ext.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!511 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !277, file: !278, line: 277, baseType: !508, size: 64, offset: 10368)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !277, file: !278, line: 278, baseType: !513, size: 64, offset: 10432)
!513 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !514, line: 27, baseType: !515)
!514 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!515 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !516, line: 45, baseType: !517)
!516 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!517 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_mask", scope: !277, file: !278, line: 279, baseType: !513, size: 64, offset: 10496)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !277, file: !278, line: 280, baseType: !5, size: 32, offset: 10560)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !277, file: !278, line: 281, baseType: !5, size: 32, offset: 10592)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "gpulamp", scope: !277, file: !278, line: 283, baseType: !203, size: 128, offset: 10624)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "pc_ids", scope: !277, file: !278, line: 284, baseType: !203, size: 128, offset: 10752)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "duplilist", scope: !277, file: !278, line: 285, baseType: !524, size: 64, offset: 10880)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_object", scope: !277, file: !278, line: 287, baseType: !526, size: 64, offset: 10944)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64)
!527 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyOb", file: !278, line: 59, flags: DIFlagFwdDecl)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_constraint", scope: !277, file: !278, line: 288, baseType: !529, size: 64, offset: 11008)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64)
!530 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyCon", file: !278, line: 288, flags: DIFlagFwdDecl)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "ima_ofs", scope: !277, file: !278, line: 290, baseType: !125, size: 64, offset: 11072)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !277, file: !278, line: 291, baseType: !533, size: 64, offset: 11136)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64)
!534 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageUser", file: !4, line: 65, baseType: !267)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "lodlevels", scope: !277, file: !278, line: 293, baseType: !203, size: 128, offset: 11200)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "currentlod", scope: !277, file: !278, line: 294, baseType: !537, size: 64, offset: 11328)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64)
!538 = !DIDerivedType(tag: DW_TAG_typedef, name: "LodLevel", file: !278, line: 113, baseType: !539)
!539 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LodLevel", file: !278, line: 108, size: 256, elements: !540)
!540 = !{!541, !543, !544, !545, !546}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !539, file: !278, line: 109, baseType: !542, size: 64)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !539, file: !278, line: 109, baseType: !542, size: 64, offset: 64)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !539, file: !278, line: 110, baseType: !276, size: 64, offset: 128)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !539, file: !278, line: 111, baseType: !25, size: 32, offset: 192)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "distance", scope: !539, file: !278, line: 112, baseType: !26, size: 32, offset: 224)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !271, file: !216, line: 1221, baseType: !548, size: 64, offset: 1088)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64)
!549 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !550, line: 52, size: 4224, elements: !551)
!550 = !DIFile(filename: "blender/source/blender/makesdna/DNA_world_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!551 = !{!552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !698, !699, !700, !702, !717}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !549, file: !550, line: 53, baseType: !148, size: 960)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !549, file: !550, line: 54, baseType: !214, size: 64, offset: 960)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "colormodel", scope: !549, file: !550, line: 56, baseType: !177, size: 16, offset: 1024)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "totex", scope: !549, file: !550, line: 56, baseType: !177, size: 16, offset: 1040)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "texact", scope: !549, file: !550, line: 57, baseType: !177, size: 16, offset: 1056)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "mistype", scope: !549, file: !550, line: 57, baseType: !177, size: 16, offset: 1072)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "horr", scope: !549, file: !550, line: 59, baseType: !26, size: 32, offset: 1088)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "horg", scope: !549, file: !550, line: 59, baseType: !26, size: 32, offset: 1120)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "horb", scope: !549, file: !550, line: 59, baseType: !26, size: 32, offset: 1152)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "zenr", scope: !549, file: !550, line: 60, baseType: !26, size: 32, offset: 1184)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "zeng", scope: !549, file: !550, line: 60, baseType: !26, size: 32, offset: 1216)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "zenb", scope: !549, file: !550, line: 60, baseType: !26, size: 32, offset: 1248)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "ambr", scope: !549, file: !550, line: 61, baseType: !26, size: 32, offset: 1280)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "ambg", scope: !549, file: !550, line: 61, baseType: !26, size: 32, offset: 1312)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "ambb", scope: !549, file: !550, line: 61, baseType: !26, size: 32, offset: 1344)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "exposure", scope: !549, file: !550, line: 68, baseType: !26, size: 32, offset: 1376)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !549, file: !550, line: 68, baseType: !26, size: 32, offset: 1408)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !549, file: !550, line: 68, baseType: !26, size: 32, offset: 1440)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "linfac", scope: !549, file: !550, line: 69, baseType: !26, size: 32, offset: 1472)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "logfac", scope: !549, file: !550, line: 69, baseType: !26, size: 32, offset: 1504)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !549, file: !550, line: 74, baseType: !26, size: 32, offset: 1536)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "activityBoxRadius", scope: !549, file: !550, line: 79, baseType: !26, size: 32, offset: 1568)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "skytype", scope: !549, file: !550, line: 81, baseType: !177, size: 16, offset: 1600)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !549, file: !550, line: 91, baseType: !177, size: 16, offset: 1616)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "occlusionRes", scope: !549, file: !550, line: 92, baseType: !177, size: 16, offset: 1632)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "physicsEngine", scope: !549, file: !550, line: 93, baseType: !177, size: 16, offset: 1648)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "ticrate", scope: !549, file: !550, line: 94, baseType: !177, size: 16, offset: 1664)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "maxlogicstep", scope: !549, file: !550, line: 94, baseType: !177, size: 16, offset: 1680)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "physubstep", scope: !549, file: !550, line: 94, baseType: !177, size: 16, offset: 1696)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "maxphystep", scope: !549, file: !550, line: 94, baseType: !177, size: 16, offset: 1712)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "misi", scope: !549, file: !550, line: 96, baseType: !26, size: 32, offset: 1728)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "miststa", scope: !549, file: !550, line: 96, baseType: !26, size: 32, offset: 1760)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "mistdist", scope: !549, file: !550, line: 96, baseType: !26, size: 32, offset: 1792)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "misthi", scope: !549, file: !550, line: 96, baseType: !26, size: 32, offset: 1824)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "starr", scope: !549, file: !550, line: 98, baseType: !26, size: 32, offset: 1856)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "starg", scope: !549, file: !550, line: 98, baseType: !26, size: 32, offset: 1888)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "starb", scope: !549, file: !550, line: 98, baseType: !26, size: 32, offset: 1920)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "stark", scope: !549, file: !550, line: 98, baseType: !26, size: 32, offset: 1952)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "starsize", scope: !549, file: !550, line: 99, baseType: !26, size: 32, offset: 1984)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "starmindist", scope: !549, file: !550, line: 99, baseType: !26, size: 32, offset: 2016)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "stardist", scope: !549, file: !550, line: 100, baseType: !26, size: 32, offset: 2048)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "starcolnoise", scope: !549, file: !550, line: 100, baseType: !26, size: 32, offset: 2080)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "dofsta", scope: !549, file: !550, line: 103, baseType: !177, size: 16, offset: 2112)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "dofend", scope: !549, file: !550, line: 103, baseType: !177, size: 16, offset: 2128)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "dofmin", scope: !549, file: !550, line: 103, baseType: !177, size: 16, offset: 2144)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "dofmax", scope: !549, file: !550, line: 103, baseType: !177, size: 16, offset: 2160)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "aodist", scope: !549, file: !550, line: 106, baseType: !26, size: 32, offset: 2176)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "aodistfac", scope: !549, file: !550, line: 106, baseType: !26, size: 32, offset: 2208)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "aoenergy", scope: !549, file: !550, line: 106, baseType: !26, size: 32, offset: 2240)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "aobias", scope: !549, file: !550, line: 106, baseType: !26, size: 32, offset: 2272)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "aomode", scope: !549, file: !550, line: 107, baseType: !177, size: 16, offset: 2304)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "aosamp", scope: !549, file: !550, line: 107, baseType: !177, size: 16, offset: 2320)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "aomix", scope: !549, file: !550, line: 107, baseType: !177, size: 16, offset: 2336)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "aocolor", scope: !549, file: !550, line: 107, baseType: !177, size: 16, offset: 2352)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "ao_adapt_thresh", scope: !549, file: !550, line: 108, baseType: !26, size: 32, offset: 2368)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "ao_adapt_speed_fac", scope: !549, file: !550, line: 108, baseType: !26, size: 32, offset: 2400)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_error", scope: !549, file: !550, line: 109, baseType: !26, size: 32, offset: 2432)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_correction", scope: !549, file: !550, line: 109, baseType: !26, size: 32, offset: 2464)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "ao_indirect_energy", scope: !549, file: !550, line: 110, baseType: !26, size: 32, offset: 2496)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "ao_env_energy", scope: !549, file: !550, line: 110, baseType: !26, size: 32, offset: 2528)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "ao_pad2", scope: !549, file: !550, line: 110, baseType: !26, size: 32, offset: 2560)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "ao_indirect_bounces", scope: !549, file: !550, line: 111, baseType: !177, size: 16, offset: 2592)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "ao_pad", scope: !549, file: !550, line: 111, baseType: !177, size: 16, offset: 2608)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "ao_samp_method", scope: !549, file: !550, line: 112, baseType: !177, size: 16, offset: 2624)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "ao_gather_method", scope: !549, file: !550, line: 112, baseType: !177, size: 16, offset: 2640)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "ao_approx_passes", scope: !549, file: !550, line: 112, baseType: !177, size: 16, offset: 2656)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !549, file: !550, line: 115, baseType: !177, size: 16, offset: 2672)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "aosphere", scope: !549, file: !550, line: 118, baseType: !52, size: 64, offset: 2688)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "aotables", scope: !549, file: !550, line: 118, baseType: !52, size: 64, offset: 2752)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !549, file: !550, line: 121, baseType: !297, size: 64, offset: 2816)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "mtex", scope: !549, file: !550, line: 122, baseType: !623, size: 1152, offset: 2880)
!623 = !DICompositeType(tag: DW_TAG_array_type, baseType: !624, size: 1152, elements: !696)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 64)
!625 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTex", file: !144, line: 57, size: 2496, elements: !626)
!626 = !{!627, !628, !629, !630, !631, !632, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "texco", scope: !625, file: !144, line: 59, baseType: !177, size: 16)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "mapto", scope: !625, file: !144, line: 59, baseType: !177, size: 16, offset: 16)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "maptoneg", scope: !625, file: !144, line: 59, baseType: !177, size: 16, offset: 32)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "blendtype", scope: !625, file: !144, line: 59, baseType: !177, size: 16, offset: 48)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !625, file: !144, line: 60, baseType: !276, size: 64, offset: 64)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "tex", scope: !625, file: !144, line: 61, baseType: !633, size: 64, offset: 128)
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "uvname", scope: !625, file: !144, line: 62, baseType: !193, size: 512, offset: 192)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "projx", scope: !625, file: !144, line: 64, baseType: !28, size: 8, offset: 704)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "projy", scope: !625, file: !144, line: 64, baseType: !28, size: 8, offset: 712)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "projz", scope: !625, file: !144, line: 64, baseType: !28, size: 8, offset: 720)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !625, file: !144, line: 64, baseType: !28, size: 8, offset: 728)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "ofs", scope: !625, file: !144, line: 65, baseType: !339, size: 96, offset: 736)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !625, file: !144, line: 65, baseType: !339, size: 96, offset: 832)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !625, file: !144, line: 65, baseType: !26, size: 32, offset: 928)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "texflag", scope: !625, file: !144, line: 67, baseType: !177, size: 16, offset: 960)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "colormodel", scope: !625, file: !144, line: 67, baseType: !177, size: 16, offset: 976)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "pmapto", scope: !625, file: !144, line: 67, baseType: !177, size: 16, offset: 992)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "pmaptoneg", scope: !625, file: !144, line: 67, baseType: !177, size: 16, offset: 1008)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "normapspace", scope: !625, file: !144, line: 68, baseType: !177, size: 16, offset: 1024)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "which_output", scope: !625, file: !144, line: 68, baseType: !177, size: 16, offset: 1040)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "brush_map_mode", scope: !625, file: !144, line: 69, baseType: !28, size: 8, offset: 1056)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !625, file: !144, line: 69, baseType: !650, size: 56, offset: 1064)
!650 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 56, elements: !651)
!651 = !{!652}
!652 = !DISubrange(count: 7)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !625, file: !144, line: 70, baseType: !26, size: 32, offset: 1120)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !625, file: !144, line: 70, baseType: !26, size: 32, offset: 1152)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !625, file: !144, line: 70, baseType: !26, size: 32, offset: 1184)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !625, file: !144, line: 70, baseType: !26, size: 32, offset: 1216)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "def_var", scope: !625, file: !144, line: 71, baseType: !26, size: 32, offset: 1248)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "rt", scope: !625, file: !144, line: 71, baseType: !26, size: 32, offset: 1280)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "colfac", scope: !625, file: !144, line: 74, baseType: !26, size: 32, offset: 1312)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "varfac", scope: !625, file: !144, line: 74, baseType: !26, size: 32, offset: 1344)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "norfac", scope: !625, file: !144, line: 77, baseType: !26, size: 32, offset: 1376)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "dispfac", scope: !625, file: !144, line: 77, baseType: !26, size: 32, offset: 1408)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "warpfac", scope: !625, file: !144, line: 77, baseType: !26, size: 32, offset: 1440)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "colspecfac", scope: !625, file: !144, line: 78, baseType: !26, size: 32, offset: 1472)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "mirrfac", scope: !625, file: !144, line: 78, baseType: !26, size: 32, offset: 1504)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "alphafac", scope: !625, file: !144, line: 78, baseType: !26, size: 32, offset: 1536)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "difffac", scope: !625, file: !144, line: 79, baseType: !26, size: 32, offset: 1568)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "specfac", scope: !625, file: !144, line: 79, baseType: !26, size: 32, offset: 1600)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "emitfac", scope: !625, file: !144, line: 79, baseType: !26, size: 32, offset: 1632)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "hardfac", scope: !625, file: !144, line: 79, baseType: !26, size: 32, offset: 1664)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "raymirrfac", scope: !625, file: !144, line: 80, baseType: !26, size: 32, offset: 1696)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "translfac", scope: !625, file: !144, line: 80, baseType: !26, size: 32, offset: 1728)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "ambfac", scope: !625, file: !144, line: 80, baseType: !26, size: 32, offset: 1760)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "colemitfac", scope: !625, file: !144, line: 81, baseType: !26, size: 32, offset: 1792)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "colreflfac", scope: !625, file: !144, line: 81, baseType: !26, size: 32, offset: 1824)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "coltransfac", scope: !625, file: !144, line: 81, baseType: !26, size: 32, offset: 1856)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "densfac", scope: !625, file: !144, line: 82, baseType: !26, size: 32, offset: 1888)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "scatterfac", scope: !625, file: !144, line: 82, baseType: !26, size: 32, offset: 1920)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "reflfac", scope: !625, file: !144, line: 82, baseType: !26, size: 32, offset: 1952)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "timefac", scope: !625, file: !144, line: 85, baseType: !26, size: 32, offset: 1984)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "lengthfac", scope: !625, file: !144, line: 85, baseType: !26, size: 32, offset: 2016)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "clumpfac", scope: !625, file: !144, line: 85, baseType: !26, size: 32, offset: 2048)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "dampfac", scope: !625, file: !144, line: 85, baseType: !26, size: 32, offset: 2080)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "kinkfac", scope: !625, file: !144, line: 86, baseType: !26, size: 32, offset: 2112)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "roughfac", scope: !625, file: !144, line: 86, baseType: !26, size: 32, offset: 2144)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "padensfac", scope: !625, file: !144, line: 86, baseType: !26, size: 32, offset: 2176)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "gravityfac", scope: !625, file: !144, line: 86, baseType: !26, size: 32, offset: 2208)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "lifefac", scope: !625, file: !144, line: 87, baseType: !26, size: 32, offset: 2240)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "sizefac", scope: !625, file: !144, line: 87, baseType: !26, size: 32, offset: 2272)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "ivelfac", scope: !625, file: !144, line: 87, baseType: !26, size: 32, offset: 2304)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "fieldfac", scope: !625, file: !144, line: 87, baseType: !26, size: 32, offset: 2336)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "shadowfac", scope: !625, file: !144, line: 90, baseType: !26, size: 32, offset: 2368)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "zenupfac", scope: !625, file: !144, line: 93, baseType: !26, size: 32, offset: 2400)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "zendownfac", scope: !625, file: !144, line: 93, baseType: !26, size: 32, offset: 2432)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "blendfac", scope: !625, file: !144, line: 93, baseType: !26, size: 32, offset: 2464)
!696 = !{!697}
!697 = !DISubrange(count: 18)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "pr_texture", scope: !549, file: !550, line: 123, baseType: !177, size: 16, offset: 4032)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !549, file: !550, line: 123, baseType: !177, size: 16, offset: 4048)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !549, file: !550, line: 123, baseType: !701, size: 32, offset: 4064)
!701 = !DICompositeType(tag: DW_TAG_array_type, baseType: !177, size: 32, elements: !56)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !549, file: !550, line: 126, baseType: !703, size: 64, offset: 4096)
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 64)
!704 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !149, line: 159, size: 448, elements: !705)
!705 = !{!706, !708, !709, !710, !711, !713}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !704, file: !149, line: 161, baseType: !707, size: 64)
!707 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 64, elements: !56)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !704, file: !149, line: 162, baseType: !707, size: 64, offset: 64)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !704, file: !149, line: 163, baseType: !701, size: 32, offset: 128)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !704, file: !149, line: 164, baseType: !701, size: 32, offset: 160)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !704, file: !149, line: 165, baseType: !712, size: 128, offset: 192)
!712 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 128, elements: !56)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !704, file: !149, line: 166, baseType: !714, size: 128, offset: 320)
!714 = !DICompositeType(tag: DW_TAG_array_type, baseType: !715, size: 128, elements: !56)
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 64)
!716 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !149, line: 46, flags: DIFlagFwdDecl)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !549, file: !550, line: 129, baseType: !718, size: 64, offset: 4160)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 64)
!719 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !216, line: 57, flags: DIFlagFwdDecl)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !271, file: !216, line: 1223, baseType: !270, size: 64, offset: 1152)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !271, file: !216, line: 1225, baseType: !203, size: 128, offset: 1216)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !271, file: !216, line: 1226, baseType: !723, size: 64, offset: 1344)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 64)
!724 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !216, line: 69, size: 320, elements: !725)
!725 = !{!726, !727, !728, !729, !730, !731, !732, !733}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !724, file: !216, line: 70, baseType: !723, size: 64)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !724, file: !216, line: 70, baseType: !723, size: 64, offset: 64)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !724, file: !216, line: 71, baseType: !5, size: 32, offset: 128)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !724, file: !216, line: 71, baseType: !5, size: 32, offset: 160)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !724, file: !216, line: 72, baseType: !25, size: 32, offset: 192)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !724, file: !216, line: 73, baseType: !177, size: 16, offset: 224)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !724, file: !216, line: 73, baseType: !177, size: 16, offset: 240)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !724, file: !216, line: 74, baseType: !276, size: 64, offset: 256)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !271, file: !216, line: 1227, baseType: !276, size: 64, offset: 1408)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !271, file: !216, line: 1229, baseType: !339, size: 96, offset: 1472)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !271, file: !216, line: 1230, baseType: !339, size: 96, offset: 1568)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !271, file: !216, line: 1231, baseType: !339, size: 96, offset: 1664)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !271, file: !216, line: 1231, baseType: !339, size: 96, offset: 1760)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !271, file: !216, line: 1233, baseType: !5, size: 32, offset: 1856)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !271, file: !216, line: 1234, baseType: !25, size: 32, offset: 1888)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !271, file: !216, line: 1235, baseType: !5, size: 32, offset: 1920)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !271, file: !216, line: 1237, baseType: !177, size: 16, offset: 1952)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !271, file: !216, line: 1239, baseType: !28, size: 8, offset: 1968)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !271, file: !216, line: 1240, baseType: !745, size: 8, offset: 1976)
!745 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 8, elements: !746)
!746 = !{!747}
!747 = !DISubrange(count: 1)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !271, file: !216, line: 1242, baseType: !718, size: 64, offset: 1984)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !271, file: !216, line: 1244, baseType: !750, size: 64, offset: 2048)
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !751, size: 64)
!751 = !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !216, line: 59, flags: DIFlagFwdDecl)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "toolsettings", scope: !271, file: !216, line: 1246, baseType: !753, size: 64, offset: 2112)
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 64)
!754 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolSettings", file: !216, line: 1067, size: 5184, elements: !755)
!755 = !{!756, !785, !786, !801, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !823, !951, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1060}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint", scope: !754, file: !216, line: 1068, baseType: !757, size: 64)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 64)
!758 = !DIDerivedType(tag: DW_TAG_typedef, name: "VPaint", file: !216, line: 934, baseType: !759)
!759 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VPaint", file: !216, line: 925, size: 576, elements: !760)
!760 = !{!761, !777, !778, !779, !780, !781, !784}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !759, file: !216, line: 926, baseType: !762, size: 320)
!762 = !DIDerivedType(tag: DW_TAG_typedef, name: "Paint", file: !216, line: 830, baseType: !763)
!763 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Paint", file: !216, line: 813, size: 320, elements: !764)
!764 = !{!765, !768, !771, !772, !774, !775, !776}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !763, file: !216, line: 814, baseType: !766, size: 64)
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64)
!767 = !DICompositeType(tag: DW_TAG_structure_type, name: "Brush", file: !216, line: 51, flags: DIFlagFwdDecl)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "palette", scope: !763, file: !216, line: 815, baseType: !769, size: 64, offset: 64)
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 64)
!770 = !DICompositeType(tag: DW_TAG_structure_type, name: "Palette", file: !216, line: 815, flags: DIFlagFwdDecl)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor", scope: !763, file: !216, line: 818, baseType: !24, size: 64, offset: 128)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor_col", scope: !763, file: !216, line: 819, baseType: !773, size: 32, offset: 192)
!773 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 32, elements: !412)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !763, file: !216, line: 822, baseType: !25, size: 32, offset: 224)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "num_input_samples", scope: !763, file: !216, line: 826, baseType: !25, size: 32, offset: 256)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "symmetry_flags", scope: !763, file: !216, line: 829, baseType: !25, size: 32, offset: 288)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !759, file: !216, line: 928, baseType: !177, size: 16, offset: 320)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !759, file: !216, line: 928, baseType: !177, size: 16, offset: 336)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !759, file: !216, line: 929, baseType: !25, size: 32, offset: 352)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint_prev", scope: !759, file: !216, line: 930, baseType: !50, size: 64, offset: 384)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint_prev", scope: !759, file: !216, line: 931, baseType: !782, size: 64, offset: 448)
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !783, size: 64)
!783 = !DICompositeType(tag: DW_TAG_structure_type, name: "MDeformVert", file: !216, line: 931, flags: DIFlagFwdDecl)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !759, file: !216, line: 933, baseType: !24, size: 64, offset: 512)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint", scope: !754, file: !216, line: 1069, baseType: !757, size: 64, offset: 64)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !754, file: !216, line: 1070, baseType: !787, size: 64, offset: 128)
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 64)
!788 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sculpt", file: !216, line: 916, baseType: !789)
!789 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sculpt", file: !216, line: 891, size: 704, elements: !790)
!790 = !{!791, !792, !793, !795, !796, !797, !798, !799, !800}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !789, file: !216, line: 892, baseType: !762, size: 320)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !789, file: !216, line: 896, baseType: !25, size: 32, offset: 320)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "radial_symm", scope: !789, file: !216, line: 900, baseType: !794, size: 96, offset: 352)
!794 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 96, elements: !340)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "detail_size", scope: !789, file: !216, line: 903, baseType: !26, size: 32, offset: 448)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "symmetrize_direction", scope: !789, file: !216, line: 906, baseType: !25, size: 32, offset: 480)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "gravity_factor", scope: !789, file: !216, line: 909, baseType: !26, size: 32, offset: 512)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "constant_detail", scope: !789, file: !216, line: 912, baseType: !26, size: 32, offset: 544)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "gravity_object", scope: !789, file: !216, line: 914, baseType: !276, size: 64, offset: 576)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !789, file: !216, line: 915, baseType: !24, size: 64, offset: 640)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "uvsculpt", scope: !754, file: !216, line: 1071, baseType: !802, size: 64, offset: 192)
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !803, size: 64)
!803 = !DIDerivedType(tag: DW_TAG_typedef, name: "UvSculpt", file: !216, line: 920, baseType: !804)
!804 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UvSculpt", file: !216, line: 918, size: 320, elements: !805)
!805 = !{!806}
!806 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !804, file: !216, line: 919, baseType: !762, size: 320)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "vgroup_weight", scope: !754, file: !216, line: 1075, baseType: !26, size: 32, offset: 256)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "doublimit", scope: !754, file: !216, line: 1077, baseType: !26, size: 32, offset: 288)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "normalsize", scope: !754, file: !216, line: 1078, baseType: !26, size: 32, offset: 320)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "automerge", scope: !754, file: !216, line: 1079, baseType: !177, size: 16, offset: 352)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !754, file: !216, line: 1082, baseType: !177, size: 16, offset: 368)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "unwrapper", scope: !754, file: !216, line: 1085, baseType: !28, size: 8, offset: 384)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "uvcalc_flag", scope: !754, file: !216, line: 1086, baseType: !28, size: 8, offset: 392)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "uv_flag", scope: !754, file: !216, line: 1087, baseType: !28, size: 8, offset: 400)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "uv_selectmode", scope: !754, file: !216, line: 1088, baseType: !28, size: 8, offset: 408)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "uvcalc_margin", scope: !754, file: !216, line: 1090, baseType: !26, size: 32, offset: 416)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "autoik_chainlen", scope: !754, file: !216, line: 1093, baseType: !177, size: 16, offset: 448)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "gpencil_flags", scope: !754, file: !216, line: 1096, baseType: !28, size: 8, offset: 464)
