; ModuleID = 'blender/source/blender/imbuf/intern/rotate.c'
source_filename = "blender/source/blender/imbuf/intern/rotate.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.ImBuf = type { %struct.ImBuf*, %struct.ImBuf*, i32, i32, i8, i32, i32, i32, i32*, float*, [2 x double], i32, i32, i32, i32, i32**, i32*, float*, float, [20 x %struct.ImBuf*], i32, i32, i32, i32, %struct.ImMetaData*, i8*, i32, [1024 x i8], [1024 x i8], %struct.MEM_CacheLimiterHandle_s*, i32, i8*, i32, i32, %struct.ColorSpace*, %struct.ColorSpace*, i32*, %struct.ColormanageCache*, i32, %struct.rcti, %struct.DDSData }
%struct.ImMetaData = type opaque
%struct.MEM_CacheLimiterHandle_s = type opaque
%struct.ColorSpace = type opaque
%struct.ColormanageCache = type opaque
%struct.rcti = type { i32, i32, i32, i32 }
%struct.DDSData = type { i32, i32, i8*, i32 }

@MEM_mallocN = external dso_local global i8* (i64, i8*)*, align 8
@.str = private unnamed_addr constant [8 x i8] c"linebuf\00", align 1
@MEM_freeN = external dso_local global void (i8*)*, align 8
@.str.1 = private unnamed_addr constant [9 x i8] c"linebuff\00", align 1

; Function Attrs: noinline nounwind uwtable
define dso_local void @IMB_flipy(%struct.ImBuf* %ibuf) #0 !dbg !9 {
entry:
  %ibuf.addr = alloca %struct.ImBuf*, align 8
  %x = alloca i32, align 4
  %y = alloca i32, align 4
  %top = alloca i32*, align 8
  %bottom = alloca i32*, align 8

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "blender/source/blender/imbuf/intern/rotate.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!5 = !{i32 7, !"Dwarf Version", i32 4}
!6 = !{i32 2, !"Debug Info Version", i32 3}
!7 = !{i32 1, !"wchar_size", i32 4}
!8 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!9 = distinct !DISubprogram(name: "IMB_flipy", scope: !1, file: !1, line: 44, type: !10, scopeLine: 45, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!10 = !DISubroutineType(types: !11)
!11 = !{null, !12}
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!13 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImBuf", file: !14, line: 70, size: 19840, elements: !15)
!14 = !DIFile(filename: "blender/source/blender/imbuf/IMB_imbuf_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!15 = !{!16, !17, !18, !20, !21, !23, !24, !25, !26, !29, !32, !37, !38, !39, !40, !41, !43, !45, !46, !47, !51, !52, !53, !54, !55, !58, !59, !60, !65, !66, !69, !70, !72, !73, !74, !77, !78, !79, !82, !83, !92}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !13, file: !14, line: 71, baseType: !12, size: 64)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !13, file: !14, line: 71, baseType: !12, size: 64, offset: 64)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !13, file: !14, line: 74, baseType: !19, size: 32, offset: 128)
!19 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !13, file: !14, line: 74, baseType: !19, size: 32, offset: 160)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !13, file: !14, line: 79, baseType: !22, size: 8, offset: 192)
!22 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !13, file: !14, line: 80, baseType: !19, size: 32, offset: 224)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !13, file: !14, line: 83, baseType: !19, size: 32, offset: 256)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "mall", scope: !13, file: !14, line: 84, baseType: !19, size: 32, offset: 288)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !13, file: !14, line: 87, baseType: !27, size: 64, offset: 320)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!28 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "rect_float", scope: !13, file: !14, line: 88, baseType: !30, size: 64, offset: 384)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!31 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "ppm", scope: !13, file: !14, line: 93, baseType: !33, size: 128, offset: 448)
!33 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 128, elements: !35)
!34 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!35 = !{!36}
!36 = !DISubrange(count: 2)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "tilex", scope: !13, file: !14, line: 96, baseType: !19, size: 32, offset: 576)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "tiley", scope: !13, file: !14, line: 96, baseType: !19, size: 32, offset: 608)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "xtiles", scope: !13, file: !14, line: 97, baseType: !19, size: 32, offset: 640)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "ytiles", scope: !13, file: !14, line: 97, baseType: !19, size: 32, offset: 672)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "tiles", scope: !13, file: !14, line: 98, baseType: !42, size: 64, offset: 704)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "zbuf", scope: !13, file: !14, line: 101, baseType: !44, size: 64, offset: 768)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "zbuf_float", scope: !13, file: !14, line: 102, baseType: !30, size: 64, offset: 832)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !13, file: !14, line: 105, baseType: !31, size: 32, offset: 896)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "mipmap", scope: !13, file: !14, line: 108, baseType: !48, size: 1280, offset: 960)
!48 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 1280, elements: !49)
!49 = !{!50}
!50 = !DISubrange(count: 20)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "miptot", scope: !13, file: !14, line: 109, baseType: !19, size: 32, offset: 2240)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "miplevel", scope: !13, file: !14, line: 109, baseType: !19, size: 32, offset: 2272)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !13, file: !14, line: 112, baseType: !19, size: 32, offset: 2304)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "userflags", scope: !13, file: !14, line: 113, baseType: !19, size: 32, offset: 2336)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !13, file: !14, line: 114, baseType: !56, size: 64, offset: 2368)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!57 = !DICompositeType(tag: DW_TAG_structure_type, name: "ImMetaData", file: !14, line: 50, flags: DIFlagFwdDecl)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "userdata", scope: !13, file: !14, line: 115, baseType: !4, size: 64, offset: 2432)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "ftype", scope: !13, file: !14, line: 118, baseType: !19, size: 32, offset: 2496)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !13, file: !14, line: 119, baseType: !61, size: 8192, offset: 2528)
!61 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 8192, elements: !63)
!62 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!63 = !{!64}
!64 = !DISubrange(count: 1024)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "cachename", scope: !13, file: !14, line: 120, baseType: !61, size: 8192, offset: 10720)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "c_handle", scope: !13, file: !14, line: 123, baseType: !67, size: 64, offset: 18944)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = !DICompositeType(tag: DW_TAG_structure_type, name: "MEM_CacheLimiterHandle_s", file: !14, line: 123, flags: DIFlagFwdDecl)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "refcounter", scope: !13, file: !14, line: 124, baseType: !19, size: 32, offset: 19008)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "encodedbuffer", scope: !13, file: !14, line: 127, baseType: !71, size: 64, offset: 19072)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "encodedsize", scope: !13, file: !14, line: 128, baseType: !28, size: 32, offset: 19136)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "encodedbuffersize", scope: !13, file: !14, line: 129, baseType: !28, size: 32, offset: 19168)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "rect_colorspace", scope: !13, file: !14, line: 132, baseType: !75, size: 64, offset: 19200)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = !DICompositeType(tag: DW_TAG_structure_type, name: "ColorSpace", file: !14, line: 132, flags: DIFlagFwdDecl)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "float_colorspace", scope: !13, file: !14, line: 133, baseType: !75, size: 64, offset: 19264)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "display_buffer_flags", scope: !13, file: !14, line: 134, baseType: !27, size: 64, offset: 19328)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "colormanage_cache", scope: !13, file: !14, line: 135, baseType: !80, size: 64, offset: 19392)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = !DICompositeType(tag: DW_TAG_structure_type, name: "ColormanageCache", file: !14, line: 135, flags: DIFlagFwdDecl)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "colormanage_flag", scope: !13, file: !14, line: 136, baseType: !19, size: 32, offset: 19456)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "invalid_rect", scope: !13, file: !14, line: 137, baseType: !84, size: 128, offset: 19488)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "rcti", file: !85, line: 89, baseType: !86)
!85 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!86 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rcti", file: !85, line: 86, size: 128, elements: !87)
!87 = !{!88, !89, !90, !91}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !86, file: !85, line: 87, baseType: !19, size: 32)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !86, file: !85, line: 87, baseType: !19, size: 32, offset: 32)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !86, file: !85, line: 88, baseType: !19, size: 32, offset: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !86, file: !85, line: 88, baseType: !19, size: 32, offset: 96)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "dds_data", scope: !13, file: !14, line: 140, baseType: !93, size: 192, offset: 19648)
!93 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DDSData", file: !14, line: 55, size: 192, elements: !94)
!94 = !{!95, !96, !97, !98}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "fourcc", scope: !93, file: !14, line: 56, baseType: !28, size: 32)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "nummipmaps", scope: !93, file: !14, line: 57, baseType: !28, size: 32, offset: 32)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !93, file: !14, line: 58, baseType: !71, size: 64, offset: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !93, file: !14, line: 59, baseType: !28, size: 32, offset: 128)
!99 = !DILocalVariable(name: "ibuf", arg: 1, scope: !9, file: !1, line: 44, type: !12)
!100 = !DILocation(line: 44, column: 30, scope: !9)
!101 = !DILocalVariable(name: "x", scope: !9, file: !1, line: 46, type: !19)
!102 = !DILocation(line: 46, column: 6, scope: !9)
!103 = !DILocalVariable(name: "y", scope: !9, file: !1, line: 46, type: !19)
!104 = !DILocation(line: 46, column: 9, scope: !9)
!105 = !DILocation(line: 48, column: 6, scope: !106)
!106 = distinct !DILexicalBlock(scope: !9, file: !1, line: 48, column: 6)
!107 = !DILocation(line: 48, column: 11, scope: !106)
!108 = !DILocation(line: 48, column: 6, scope: !9)
!109 = !DILocation(line: 48, column: 20, scope: !106)
!110 = !DILocation(line: 50, column: 6, scope: !111)
!111 = distinct !DILexicalBlock(scope: !9, file: !1, line: 50, column: 6)
!112 = !DILocation(line: 50, column: 12, scope: !111)
!113 = !DILocation(line: 50, column: 6, scope: !9)
!114 = !DILocalVariable(name: "top", scope: !115, file: !1, line: 51, type: !27)
!115 = distinct !DILexicalBlock(scope: !111, file: !1, line: 50, column: 18)
!116 = !DILocation(line: 51, column: 17, scope: !115)
!117 = !DILocalVariable(name: "bottom", scope: !115, file: !1, line: 51, type: !27)
!118 = !DILocation(line: 51, column: 23, scope: !115)
!119 = !DILocalVariable(name: "line", scope: !115, file: !1, line: 51, type: !27)
!120 = !DILocation(line: 51, column: 32, scope: !115)
!121 = !DILocation(line: 53, column: 7, scope: !115)
!122 = !DILocation(line: 53, column: 13, scope: !115)
!123 = !DILocation(line: 53, column: 5, scope: !115)
!124 = !DILocation(line: 54, column: 7, scope: !115)
!125 = !DILocation(line: 54, column: 13, scope: !115)
!126 = !DILocation(line: 54, column: 5, scope: !115)
!127 = !DILocation(line: 56, column: 9, scope: !115)
!128 = !DILocation(line: 56, column: 15, scope: !115)
!129 = !DILocation(line: 56, column: 7, scope: !115)
!130 = !DILocation(line: 57, column: 12, scope: !115)
!131 = !DILocation(line: 57, column: 20, scope: !115)
!132 = !DILocation(line: 57, column: 22, scope: !115)
!133 = !DILocation(line: 57, column: 29, scope: !115)
!134 = !DILocation(line: 57, column: 27, scope: !115)
!135 = !DILocation(line: 57, column: 16, scope: !115)
!136 = !DILocation(line: 57, column: 10, scope: !115)
!137 = !DILocation(line: 58, column: 10, scope: !115)
!138 = !DILocation(line: 58, column: 22, scope: !115)
!139 = !DILocation(line: 58, column: 24, scope: !115)
!140 = !DILocation(line: 58, column: 8, scope: !115)
!141 = !DILocation(line: 60, column: 5, scope: !115)
!142 = !DILocation(line: 62, column: 3, scope: !115)
!143 = !DILocation(line: 62, column: 10, scope: !144)
!144 = distinct !DILexicalBlock(scope: !145, file: !1, line: 62, column: 3)
!145 = distinct !DILexicalBlock(scope: !115, file: !1, line: 62, column: 3)
!146 = !DILocation(line: 62, column: 12, scope: !144)
!147 = !DILocation(line: 62, column: 3, scope: !145)
!148 = !DILocation(line: 63, column: 11, scope: !149)
!149 = distinct !DILexicalBlock(scope: !144, file: !1, line: 62, column: 22)
!150 = !DILocation(line: 63, column: 4, scope: !149)
!151 = !DILocation(line: 63, column: 17, scope: !149)
!152 = !DILocation(line: 63, column: 22, scope: !149)
!153 = !DILocation(line: 63, column: 24, scope: !149)
!154 = !DILocation(line: 64, column: 11, scope: !149)
!155 = !DILocation(line: 64, column: 4, scope: !149)
!156 = !DILocation(line: 64, column: 16, scope: !149)
!157 = !DILocation(line: 64, column: 24, scope: !149)
!158 = !DILocation(line: 64, column: 26, scope: !149)
!159 = !DILocation(line: 65, column: 11, scope: !149)
!160 = !DILocation(line: 65, column: 4, scope: !149)
!161 = !DILocation(line: 65, column: 19, scope: !149)
!162 = !DILocation(line: 65, column: 25, scope: !149)
!163 = !DILocation(line: 65, column: 27, scope: !149)
!164 = !DILocation(line: 66, column: 14, scope: !149)
!165 = !DILocation(line: 66, column: 11, scope: !149)
