; ModuleID = 'blender/source/blender/modifiers/intern/MOD_mirror.c'
source_filename = "blender/source/blender/modifiers/intern/MOD_mirror.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!59 = !DIEnumerator(name: "MOD_APPLY_IGNORE_SIMPLIFY", value: 8, isUnsigned: true)
!60 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !61, line: 278, baseType: !7, size: 32, elements: !62)
!61 = !DIFile(filename: "blender/source/blender/makesdna/DNA_modifier_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!62 = !{!63, !64, !65, !66, !67, !68, !69, !70}
!63 = !DIEnumerator(name: "MOD_MIR_CLIPPING", value: 1, isUnsigned: true)
!64 = !DIEnumerator(name: "MOD_MIR_MIRROR_U", value: 2, isUnsigned: true)
!65 = !DIEnumerator(name: "MOD_MIR_MIRROR_V", value: 4, isUnsigned: true)
!66 = !DIEnumerator(name: "MOD_MIR_AXIS_X", value: 8, isUnsigned: true)
!67 = !DIEnumerator(name: "MOD_MIR_AXIS_Y", value: 16, isUnsigned: true)
!68 = !DIEnumerator(name: "MOD_MIR_AXIS_Z", value: 32, isUnsigned: true)
!69 = !DIEnumerator(name: "MOD_MIR_VGROUP", value: 64, isUnsigned: true)
!70 = !DIEnumerator(name: "MOD_MIR_NO_MERGE", value: 128, isUnsigned: true)
!71 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !72, line: 76, baseType: !7, size: 32, elements: !73)
!72 = !DIFile(filename: "blender/source/blender/makesdna/DNA_customdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!73 = !{!74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114}
!74 = !DIEnumerator(name: "CD_MVERT", value: 0, isUnsigned: true)
!75 = !DIEnumerator(name: "CD_MSTICKY", value: 1, isUnsigned: true)
!76 = !DIEnumerator(name: "CD_MDEFORMVERT", value: 2, isUnsigned: true)
!77 = !DIEnumerator(name: "CD_MEDGE", value: 3, isUnsigned: true)
!78 = !DIEnumerator(name: "CD_MFACE", value: 4, isUnsigned: true)
!79 = !DIEnumerator(name: "CD_MTFACE", value: 5, isUnsigned: true)
!80 = !DIEnumerator(name: "CD_MCOL", value: 6, isUnsigned: true)
!81 = !DIEnumerator(name: "CD_ORIGINDEX", value: 7, isUnsigned: true)
!82 = !DIEnumerator(name: "CD_NORMAL", value: 8, isUnsigned: true)
!83 = !DIEnumerator(name: "CD_PROP_FLT", value: 10, isUnsigned: true)
!84 = !DIEnumerator(name: "CD_PROP_INT", value: 11, isUnsigned: true)
!85 = !DIEnumerator(name: "CD_PROP_STR", value: 12, isUnsigned: true)
!86 = !DIEnumerator(name: "CD_ORIGSPACE", value: 13, isUnsigned: true)
!87 = !DIEnumerator(name: "CD_ORCO", value: 14, isUnsigned: true)
!88 = !DIEnumerator(name: "CD_MTEXPOLY", value: 15, isUnsigned: true)
!89 = !DIEnumerator(name: "CD_MLOOPUV", value: 16, isUnsigned: true)
!90 = !DIEnumerator(name: "CD_MLOOPCOL", value: 17, isUnsigned: true)
!91 = !DIEnumerator(name: "CD_TANGENT", value: 18, isUnsigned: true)
!92 = !DIEnumerator(name: "CD_MDISPS", value: 19, isUnsigned: true)
!93 = !DIEnumerator(name: "CD_PREVIEW_MCOL", value: 20, isUnsigned: true)
!94 = !DIEnumerator(name: "CD_ID_MCOL", value: 21, isUnsigned: true)
!95 = !DIEnumerator(name: "CD_TEXTURE_MCOL", value: 22, isUnsigned: true)
!96 = !DIEnumerator(name: "CD_CLOTH_ORCO", value: 23, isUnsigned: true)
!97 = !DIEnumerator(name: "CD_RECAST", value: 24, isUnsigned: true)
!98 = !DIEnumerator(name: "CD_MPOLY", value: 25, isUnsigned: true)
!99 = !DIEnumerator(name: "CD_MLOOP", value: 26, isUnsigned: true)
!100 = !DIEnumerator(name: "CD_SHAPE_KEYINDEX", value: 27, isUnsigned: true)
!101 = !DIEnumerator(name: "CD_SHAPEKEY", value: 28, isUnsigned: true)
!102 = !DIEnumerator(name: "CD_BWEIGHT", value: 29, isUnsigned: true)
!103 = !DIEnumerator(name: "CD_CREASE", value: 30, isUnsigned: true)
!104 = !DIEnumerator(name: "CD_ORIGSPACE_MLOOP", value: 31, isUnsigned: true)
!105 = !DIEnumerator(name: "CD_PREVIEW_MLOOPCOL", value: 32, isUnsigned: true)
!106 = !DIEnumerator(name: "CD_BM_ELEM_PYPTR", value: 33, isUnsigned: true)
!107 = !DIEnumerator(name: "CD_PAINT_MASK", value: 34, isUnsigned: true)
!108 = !DIEnumerator(name: "CD_GRID_PAINT_MASK", value: 35, isUnsigned: true)
!109 = !DIEnumerator(name: "CD_MVERT_SKIN", value: 36, isUnsigned: true)
!110 = !DIEnumerator(name: "CD_FREESTYLE_EDGE", value: 37, isUnsigned: true)
!111 = !DIEnumerator(name: "CD_FREESTYLE_FACE", value: 38, isUnsigned: true)
!112 = !DIEnumerator(name: "CD_MLOOPTANGENT", value: 39, isUnsigned: true)
!113 = !DIEnumerator(name: "CD_TESSLOOPNORMAL", value: 40, isUnsigned: true)
!114 = !DIEnumerator(name: "CD_NUMTYPES", value: 41, isUnsigned: true)
!115 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !116, line: 63, baseType: !7, size: 32, elements: !117)
!116 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_cdderivedmesh.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!117 = !{!118, !119}
!118 = !DIEnumerator(name: "CDDM_MERGE_VERTS_DUMP_IF_MAPPED", value: 0, isUnsigned: true)
!119 = !DIEnumerator(name: "CDDM_MERGE_VERTS_DUMP_IF_EQUAL", value: 1, isUnsigned: true)
!120 = !{!121, !991}
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "MirrorModifierData", file: !61, line: 275, baseType: !123)
!123 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MirrorModifierData", file: !61, line: 268, size: 1024, elements: !124)
!124 = !{!125, !148, !150, !151, !153}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "modifier", scope: !123, file: !61, line: 269, baseType: !126, size: 896)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "ModifierData", file: !61, line: 110, baseType: !127)
!127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ModifierData", file: !61, line: 99, size: 896, elements: !128)
!128 = !{!129, !131, !132, !134, !135, !136, !137, !142, !146}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !127, file: !61, line: 100, baseType: !130, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !127, file: !61, line: 100, baseType: !130, size: 64, offset: 64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !127, file: !61, line: 102, baseType: !133, size: 32, offset: 128)
!133 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !127, file: !61, line: 102, baseType: !133, size: 32, offset: 160)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "stackindex", scope: !127, file: !61, line: 103, baseType: !133, size: 32, offset: 192)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !127, file: !61, line: 103, baseType: !133, size: 32, offset: 224)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !127, file: !61, line: 104, baseType: !138, size: 512, offset: 256)
!138 = !DICompositeType(tag: DW_TAG_array_type, baseType: !139, size: 512, elements: !140)
!139 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!140 = !{!141}
!141 = !DISubrange(count: 64)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !127, file: !61, line: 107, baseType: !143, size: 64, offset: 768)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!144 = !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !145, line: 40, flags: DIFlagFwdDecl)
!145 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!146 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !127, file: !61, line: 109, baseType: !147, size: 64, offset: 832)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "axis", scope: !123, file: !61, line: 271, baseType: !149, size: 16, offset: 896)
!149 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !123, file: !61, line: 272, baseType: !149, size: 16, offset: 912)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "tolerance", scope: !123, file: !61, line: 273, baseType: !152, size: 32, offset: 928)
!152 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "mirror_ob", scope: !123, file: !61, line: 274, baseType: !154, size: 64, offset: 960)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !156, line: 115, size: 11392, elements: !157)
!156 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!157 = !{!158, !224, !228, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !245, !256, !270, !271, !314, !315, !318, !319, !335, !336, !337, !338, !339, !340, !341, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !360, !361, !362, !363, !364, !365, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !425, !426, !427, !428, !429, !430, !431, !432, !433, !436, !439, !442, !443, !444, !445, !446, !449, !452, !938, !939, !945, !946, !947, !948, !949, !950, !952, !955, !958, !960, !979, !980}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !155, file: !156, line: 116, baseType: !159, size: 960)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !160, line: 130, baseType: !161)
!160 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !160, line: 117, size: 960, elements: !162)
!162 = !{!163, !165, !166, !168, !187, !191, !192, !193, !194, !195}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !161, file: !160, line: 118, baseType: !164, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !161, file: !160, line: 118, baseType: !164, size: 64, offset: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !161, file: !160, line: 119, baseType: !167, size: 64, offset: 128)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !161, file: !160, line: 120, baseType: !169, size: 64, offset: 192)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !160, line: 136, size: 17600, elements: !171)
!171 = !{!172, !173, !175, !178, !182, !183, !184}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !170, file: !160, line: 137, baseType: !159, size: 960)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !170, file: !160, line: 138, baseType: !174, size: 64, offset: 960)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !170, file: !160, line: 139, baseType: !176, size: 64, offset: 1024)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !160, line: 43, flags: DIFlagFwdDecl)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !170, file: !160, line: 140, baseType: !179, size: 8192, offset: 1088)
!179 = !DICompositeType(tag: DW_TAG_array_type, baseType: !139, size: 8192, elements: !180)
!180 = !{!181}
!181 = !DISubrange(count: 1024)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !170, file: !160, line: 141, baseType: !179, size: 8192, offset: 9280)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !170, file: !160, line: 148, baseType: !169, size: 64, offset: 17472)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !170, file: !160, line: 150, baseType: !185, size: 64, offset: 17536)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!186 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !160, line: 45, flags: DIFlagFwdDecl)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !161, file: !160, line: 121, baseType: !188, size: 528, offset: 256)
!188 = !DICompositeType(tag: DW_TAG_array_type, baseType: !139, size: 528, elements: !189)
!189 = !{!190}
!190 = !DISubrange(count: 66)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !161, file: !160, line: 126, baseType: !149, size: 16, offset: 784)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !161, file: !160, line: 127, baseType: !133, size: 32, offset: 800)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !161, file: !160, line: 128, baseType: !133, size: 32, offset: 832)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !161, file: !160, line: 128, baseType: !133, size: 32, offset: 864)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !161, file: !160, line: 129, baseType: !196, size: 64, offset: 896)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !160, line: 75, baseType: !198)
!198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !160, line: 62, size: 1024, elements: !199)
!199 = !{!200, !202, !203, !204, !205, !206, !207, !208, !222, !223}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !198, file: !160, line: 63, baseType: !201, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !198, file: !160, line: 63, baseType: !201, size: 64, offset: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !198, file: !160, line: 64, baseType: !139, size: 8, offset: 128)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !198, file: !160, line: 64, baseType: !139, size: 8, offset: 136)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !198, file: !160, line: 65, baseType: !149, size: 16, offset: 144)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !198, file: !160, line: 66, baseType: !138, size: 512, offset: 160)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !198, file: !160, line: 67, baseType: !133, size: 32, offset: 672)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !198, file: !160, line: 69, baseType: !209, size: 256, offset: 704)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !160, line: 60, baseType: !210)
!210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !160, line: 48, size: 256, elements: !211)
!211 = !{!212, !213, !220, !221}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !210, file: !160, line: 49, baseType: !164, size: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !210, file: !160, line: 58, baseType: !214, size: 128, offset: 64)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !215, line: 71, baseType: !216)
!215 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!216 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !215, line: 69, size: 128, elements: !217)
!217 = !{!218, !219}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !216, file: !215, line: 70, baseType: !164, size: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !216, file: !215, line: 70, baseType: !164, size: 64, offset: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !210, file: !160, line: 59, baseType: !133, size: 32, offset: 192)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !210, file: !160, line: 59, baseType: !133, size: 32, offset: 224)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !198, file: !160, line: 70, baseType: !133, size: 32, offset: 960)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !198, file: !160, line: 74, baseType: !133, size: 32, offset: 992)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !155, file: !156, line: 117, baseType: !225, size: 64, offset: 960)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!226 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !227, line: 45, flags: DIFlagFwdDecl)
!227 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!228 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !155, file: !156, line: 119, baseType: !229, size: 64, offset: 1024)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!230 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !156, line: 57, flags: DIFlagFwdDecl)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !155, file: !156, line: 121, baseType: !149, size: 16, offset: 1088)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !155, file: !156, line: 121, baseType: !149, size: 16, offset: 1104)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !155, file: !156, line: 122, baseType: !133, size: 32, offset: 1120)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !155, file: !156, line: 122, baseType: !133, size: 32, offset: 1152)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !155, file: !156, line: 122, baseType: !133, size: 32, offset: 1184)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !155, file: !156, line: 123, baseType: !138, size: 512, offset: 1216)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !155, file: !156, line: 124, baseType: !154, size: 64, offset: 1728)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !155, file: !156, line: 124, baseType: !154, size: 64, offset: 1792)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !155, file: !156, line: 127, baseType: !154, size: 64, offset: 1856)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !155, file: !156, line: 127, baseType: !154, size: 64, offset: 1920)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !155, file: !156, line: 127, baseType: !154, size: 64, offset: 1984)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !155, file: !156, line: 128, baseType: !243, size: 64, offset: 2048)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!244 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !227, line: 46, flags: DIFlagFwdDecl)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !155, file: !156, line: 130, baseType: !246, size: 64, offset: 2112)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !156, line: 97, size: 832, elements: !248)
!248 = !{!249, !254, !255}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !247, file: !156, line: 98, baseType: !250, size: 768)
!250 = !DICompositeType(tag: DW_TAG_array_type, baseType: !152, size: 768, elements: !251)
!251 = !{!252, !253}
!252 = !DISubrange(count: 8)
!253 = !DISubrange(count: 3)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !247, file: !156, line: 99, baseType: !133, size: 32, offset: 768)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !247, file: !156, line: 99, baseType: !133, size: 32, offset: 800)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !155, file: !156, line: 131, baseType: !257, size: 64, offset: 2176)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64)
!258 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !259, line: 486, size: 1600, elements: !260)
!259 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!260 = !{!261, !262, !263, !264, !265, !266, !267, !268, !269}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !258, file: !259, line: 487, baseType: !159, size: 960)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !258, file: !259, line: 489, baseType: !214, size: 128, offset: 960)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !258, file: !259, line: 490, baseType: !214, size: 128, offset: 1088)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !258, file: !259, line: 491, baseType: !214, size: 128, offset: 1216)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !258, file: !259, line: 492, baseType: !214, size: 128, offset: 1344)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !258, file: !259, line: 494, baseType: !133, size: 32, offset: 1472)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !258, file: !259, line: 495, baseType: !133, size: 32, offset: 1504)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !258, file: !259, line: 497, baseType: !133, size: 32, offset: 1536)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !258, file: !259, line: 498, baseType: !133, size: 32, offset: 1568)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !155, file: !156, line: 132, baseType: !257, size: 64, offset: 2240)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !155, file: !156, line: 133, baseType: !272, size: 64, offset: 2304)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64)
!273 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !259, line: 334, size: 1728, elements: !274)
!274 = !{!275, !276, !279, !280, !281, !282, !283, !284, !287, !288, !289, !290, !291, !292, !293, !313}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !273, file: !259, line: 335, baseType: !214, size: 128)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !273, file: !259, line: 336, baseType: !277, size: 64, offset: 128)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!278 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !259, line: 47, flags: DIFlagFwdDecl)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !273, file: !259, line: 338, baseType: !149, size: 16, offset: 192)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !273, file: !259, line: 338, baseType: !149, size: 16, offset: 208)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !273, file: !259, line: 339, baseType: !7, size: 32, offset: 224)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !273, file: !259, line: 340, baseType: !133, size: 32, offset: 256)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !273, file: !259, line: 342, baseType: !152, size: 32, offset: 288)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !273, file: !259, line: 343, baseType: !285, size: 96, offset: 320)
!285 = !DICompositeType(tag: DW_TAG_array_type, baseType: !152, size: 96, elements: !286)
!286 = !{!253}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !273, file: !259, line: 344, baseType: !285, size: 96, offset: 416)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !273, file: !259, line: 347, baseType: !214, size: 128, offset: 512)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !273, file: !259, line: 349, baseType: !133, size: 32, offset: 640)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !273, file: !259, line: 350, baseType: !133, size: 32, offset: 672)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !273, file: !259, line: 351, baseType: !164, size: 64, offset: 704)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !273, file: !259, line: 352, baseType: !164, size: 64, offset: 768)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !273, file: !259, line: 354, baseType: !294, size: 384, offset: 832)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !259, line: 116, baseType: !295)
!295 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !259, line: 94, size: 384, elements: !296)
!296 = !{!297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !295, file: !259, line: 96, baseType: !133, size: 32)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !295, file: !259, line: 96, baseType: !133, size: 32, offset: 32)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !295, file: !259, line: 97, baseType: !133, size: 32, offset: 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !295, file: !259, line: 97, baseType: !133, size: 32, offset: 96)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !295, file: !259, line: 99, baseType: !149, size: 16, offset: 128)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !295, file: !259, line: 100, baseType: !149, size: 16, offset: 144)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !295, file: !259, line: 102, baseType: !149, size: 16, offset: 160)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !295, file: !259, line: 105, baseType: !149, size: 16, offset: 176)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !295, file: !259, line: 108, baseType: !149, size: 16, offset: 192)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !295, file: !259, line: 109, baseType: !149, size: 16, offset: 208)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !295, file: !259, line: 111, baseType: !149, size: 16, offset: 224)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !295, file: !259, line: 112, baseType: !149, size: 16, offset: 240)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !295, file: !259, line: 114, baseType: !133, size: 32, offset: 256)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !295, file: !259, line: 114, baseType: !133, size: 32, offset: 288)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !295, file: !259, line: 115, baseType: !133, size: 32, offset: 320)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !295, file: !259, line: 115, baseType: !133, size: 32, offset: 352)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !273, file: !259, line: 355, baseType: !138, size: 512, offset: 1216)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !155, file: !156, line: 134, baseType: !164, size: 64, offset: 2368)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !155, file: !156, line: 136, baseType: !316, size: 64, offset: 2432)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!317 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !156, line: 58, flags: DIFlagFwdDecl)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !155, file: !156, line: 138, baseType: !294, size: 384, offset: 2496)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !155, file: !156, line: 139, baseType: !320, size: 64, offset: 2880)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !259, line: 80, baseType: !322)
!322 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !259, line: 72, size: 192, elements: !323)
!323 = !{!324, !331, !332, !333, !334}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !322, file: !259, line: 73, baseType: !325, size: 64)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !259, line: 59, baseType: !327)
!327 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !259, line: 56, size: 128, elements: !328)
!328 = !{!329, !330}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !327, file: !259, line: 57, baseType: !285, size: 96)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !327, file: !259, line: 58, baseType: !133, size: 32, offset: 96)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !322, file: !259, line: 74, baseType: !133, size: 32, offset: 64)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !322, file: !259, line: 76, baseType: !133, size: 32, offset: 96)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !322, file: !259, line: 77, baseType: !133, size: 32, offset: 128)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !322, file: !259, line: 79, baseType: !133, size: 32, offset: 160)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !155, file: !156, line: 141, baseType: !214, size: 128, offset: 2944)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !155, file: !156, line: 142, baseType: !214, size: 128, offset: 3072)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !155, file: !156, line: 143, baseType: !214, size: 128, offset: 3200)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !155, file: !156, line: 144, baseType: !214, size: 128, offset: 3328)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !155, file: !156, line: 146, baseType: !133, size: 32, offset: 3456)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !155, file: !156, line: 147, baseType: !133, size: 32, offset: 3488)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !155, file: !156, line: 150, baseType: !342, size: 64, offset: 3520)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!344 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !156, line: 50, flags: DIFlagFwdDecl)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !155, file: !156, line: 151, baseType: !147, size: 64, offset: 3584)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !155, file: !156, line: 152, baseType: !133, size: 32, offset: 3648)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !155, file: !156, line: 153, baseType: !133, size: 32, offset: 3680)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !155, file: !156, line: 156, baseType: !285, size: 96, offset: 3712)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !155, file: !156, line: 156, baseType: !285, size: 96, offset: 3808)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !155, file: !156, line: 156, baseType: !285, size: 96, offset: 3904)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !155, file: !156, line: 157, baseType: !285, size: 96, offset: 4000)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !155, file: !156, line: 158, baseType: !285, size: 96, offset: 4096)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !155, file: !156, line: 159, baseType: !285, size: 96, offset: 4192)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !155, file: !156, line: 160, baseType: !285, size: 96, offset: 4288)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !155, file: !156, line: 160, baseType: !285, size: 96, offset: 4384)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !155, file: !156, line: 161, baseType: !357, size: 128, offset: 4480)
!357 = !DICompositeType(tag: DW_TAG_array_type, baseType: !152, size: 128, elements: !358)
!358 = !{!359}
!359 = !DISubrange(count: 4)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !155, file: !156, line: 161, baseType: !357, size: 128, offset: 4608)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !155, file: !156, line: 162, baseType: !285, size: 96, offset: 4736)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !155, file: !156, line: 162, baseType: !285, size: 96, offset: 4832)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !155, file: !156, line: 163, baseType: !152, size: 32, offset: 4928)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !155, file: !156, line: 163, baseType: !152, size: 32, offset: 4960)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !155, file: !156, line: 164, baseType: !366, size: 512, offset: 4992)
!366 = !DICompositeType(tag: DW_TAG_array_type, baseType: !152, size: 512, elements: !367)
!367 = !{!359, !359}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !155, file: !156, line: 165, baseType: !366, size: 512, offset: 5504)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !155, file: !156, line: 166, baseType: !366, size: 512, offset: 6016)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !155, file: !156, line: 167, baseType: !366, size: 512, offset: 6528)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !155, file: !156, line: 176, baseType: !366, size: 512, offset: 7040)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !155, file: !156, line: 178, baseType: !7, size: 32, offset: 7552)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !155, file: !156, line: 180, baseType: !149, size: 16, offset: 7584)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !155, file: !156, line: 181, baseType: !149, size: 16, offset: 7600)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !155, file: !156, line: 183, baseType: !149, size: 16, offset: 7616)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !155, file: !156, line: 183, baseType: !149, size: 16, offset: 7632)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !155, file: !156, line: 184, baseType: !149, size: 16, offset: 7648)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !155, file: !156, line: 184, baseType: !149, size: 16, offset: 7664)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !155, file: !156, line: 185, baseType: !149, size: 16, offset: 7680)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !155, file: !156, line: 186, baseType: !149, size: 16, offset: 7696)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !155, file: !156, line: 187, baseType: !149, size: 16, offset: 7712)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !155, file: !156, line: 188, baseType: !139, size: 8, offset: 7728)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !155, file: !156, line: 189, baseType: !139, size: 8, offset: 7736)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !155, file: !156, line: 192, baseType: !133, size: 32, offset: 7744)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !155, file: !156, line: 192, baseType: !133, size: 32, offset: 7776)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !155, file: !156, line: 192, baseType: !133, size: 32, offset: 7808)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !155, file: !156, line: 192, baseType: !133, size: 32, offset: 7840)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !155, file: !156, line: 194, baseType: !133, size: 32, offset: 7872)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !155, file: !156, line: 202, baseType: !152, size: 32, offset: 7904)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !155, file: !156, line: 202, baseType: !152, size: 32, offset: 7936)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !155, file: !156, line: 202, baseType: !152, size: 32, offset: 7968)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !155, file: !156, line: 211, baseType: !152, size: 32, offset: 8000)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !155, file: !156, line: 212, baseType: !152, size: 32, offset: 8032)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !155, file: !156, line: 213, baseType: !152, size: 32, offset: 8064)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !155, file: !156, line: 214, baseType: !152, size: 32, offset: 8096)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !155, file: !156, line: 215, baseType: !152, size: 32, offset: 8128)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !155, file: !156, line: 216, baseType: !152, size: 32, offset: 8160)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !155, file: !156, line: 219, baseType: !152, size: 32, offset: 8192)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !155, file: !156, line: 220, baseType: !152, size: 32, offset: 8224)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !155, file: !156, line: 221, baseType: !152, size: 32, offset: 8256)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !155, file: !156, line: 224, baseType: !402, size: 16, offset: 8288)
!402 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !155, file: !156, line: 224, baseType: !402, size: 16, offset: 8304)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !155, file: !156, line: 226, baseType: !149, size: 16, offset: 8320)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !155, file: !156, line: 228, baseType: !139, size: 8, offset: 8336)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !155, file: !156, line: 229, baseType: !139, size: 8, offset: 8344)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !155, file: !156, line: 231, baseType: !149, size: 16, offset: 8352)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !155, file: !156, line: 232, baseType: !139, size: 8, offset: 8368)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !155, file: !156, line: 233, baseType: !139, size: 8, offset: 8376)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !155, file: !156, line: 234, baseType: !152, size: 32, offset: 8384)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !155, file: !156, line: 235, baseType: !152, size: 32, offset: 8416)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !155, file: !156, line: 237, baseType: !214, size: 128, offset: 8448)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !155, file: !156, line: 238, baseType: !214, size: 128, offset: 8576)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !155, file: !156, line: 239, baseType: !214, size: 128, offset: 8704)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !155, file: !156, line: 240, baseType: !214, size: 128, offset: 8832)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !155, file: !156, line: 242, baseType: !152, size: 32, offset: 8960)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !155, file: !156, line: 244, baseType: !149, size: 16, offset: 8992)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !155, file: !156, line: 245, baseType: !402, size: 16, offset: 9008)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !155, file: !156, line: 246, baseType: !357, size: 128, offset: 9024)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !155, file: !156, line: 248, baseType: !133, size: 32, offset: 9152)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !155, file: !156, line: 249, baseType: !133, size: 32, offset: 9184)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !155, file: !156, line: 251, baseType: !423, size: 64, offset: 9216)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!424 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !156, line: 251, flags: DIFlagFwdDecl)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !155, file: !156, line: 253, baseType: !139, size: 8, offset: 9280)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !155, file: !156, line: 254, baseType: !139, size: 8, offset: 9288)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !155, file: !156, line: 255, baseType: !149, size: 16, offset: 9296)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !155, file: !156, line: 256, baseType: !285, size: 96, offset: 9312)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !155, file: !156, line: 258, baseType: !214, size: 128, offset: 9408)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !155, file: !156, line: 259, baseType: !214, size: 128, offset: 9536)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !155, file: !156, line: 260, baseType: !214, size: 128, offset: 9664)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !155, file: !156, line: 261, baseType: !214, size: 128, offset: 9792)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !155, file: !156, line: 263, baseType: !434, size: 64, offset: 9920)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!435 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !156, line: 52, flags: DIFlagFwdDecl)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !155, file: !156, line: 264, baseType: !437, size: 64, offset: 9984)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !156, line: 53, flags: DIFlagFwdDecl)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !155, file: !156, line: 265, baseType: !440, size: 64, offset: 10048)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!441 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !259, line: 46, flags: DIFlagFwdDecl)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !155, file: !156, line: 267, baseType: !139, size: 8, offset: 10112)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !155, file: !156, line: 268, baseType: !139, size: 8, offset: 10120)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !155, file: !156, line: 269, baseType: !149, size: 16, offset: 10128)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !155, file: !156, line: 270, baseType: !152, size: 32, offset: 10144)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !155, file: !156, line: 272, baseType: !447, size: 64, offset: 10176)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64)
!448 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !156, line: 54, flags: DIFlagFwdDecl)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !155, file: !156, line: 275, baseType: !450, size: 64, offset: 10240)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64)
!451 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !156, line: 275, flags: DIFlagFwdDecl)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !155, file: !156, line: 277, baseType: !453, size: 64, offset: 10304)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!454 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !28, line: 178, size: 13504, elements: !455)
!455 = !{!456, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !507, !510, !512, !513, !515, !516, !517, !518, !524, !529, !530, !534, !535, !536, !537, !538, !551, !563, !577, !581, !585, !589, !598, !610, !614, !618, !622, !626, !630, !631, !632, !633, !634, !635, !639, !640, !641, !642, !646, !647, !648, !649, !650, !655, !656, !657, !658, !659, !663, !664, !665, !666, !667, !674, !685, !690, !696, !706, !712, !723, !730, !737, !741, !746, !750, !755, !756, !757, !764, !770, !771, !772, !777, !778, !787, !895, !899, !907, !911, !915, !919, !927, !937}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "vertData", scope: !454, file: !28, line: 180, baseType: !457, size: 1600)
!457 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomData", file: !72, line: 73, baseType: !458)
!458 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomData", file: !72, line: 64, size: 1600, elements: !459)
!459 = !{!460, !475, !479, !480, !481, !482, !485}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !458, file: !72, line: 65, baseType: !461, size: 64)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataLayer", file: !72, line: 53, baseType: !463)
!463 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataLayer", file: !72, line: 42, size: 832, elements: !464)
!464 = !{!465, !466, !467, !468, !469, !470, !471, !472, !473, !474}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !463, file: !72, line: 43, baseType: !133, size: 32)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !463, file: !72, line: 44, baseType: !133, size: 32, offset: 32)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !463, file: !72, line: 45, baseType: !133, size: 32, offset: 64)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !463, file: !72, line: 46, baseType: !133, size: 32, offset: 96)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "active_rnd", scope: !463, file: !72, line: 47, baseType: !133, size: 32, offset: 128)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "active_clone", scope: !463, file: !72, line: 48, baseType: !133, size: 32, offset: 160)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "active_mask", scope: !463, file: !72, line: 49, baseType: !133, size: 32, offset: 192)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !463, file: !72, line: 50, baseType: !133, size: 32, offset: 224)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !463, file: !72, line: 51, baseType: !138, size: 512, offset: 256)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !463, file: !72, line: 52, baseType: !164, size: 64, offset: 768)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "typemap", scope: !458, file: !72, line: 66, baseType: !476, size: 1312, offset: 64)
!476 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 1312, elements: !477)
!477 = !{!478}
!478 = !DISubrange(count: 41)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "totlayer", scope: !458, file: !72, line: 69, baseType: !133, size: 32, offset: 1376)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "maxlayer", scope: !458, file: !72, line: 69, baseType: !133, size: 32, offset: 1408)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "totsize", scope: !458, file: !72, line: 70, baseType: !133, size: 32, offset: 1440)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !458, file: !72, line: 71, baseType: !483, size: 64, offset: 1472)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64)
!484 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool", file: !72, line: 71, flags: DIFlagFwdDecl)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !458, file: !72, line: 72, baseType: !486, size: 64, offset: 1536)
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64)
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataExternal", file: !72, line: 59, baseType: !488)
!488 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataExternal", file: !72, line: 57, size: 8192, elements: !489)
!489 = !{!490}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !488, file: !72, line: 58, baseType: !179, size: 8192)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "edgeData", scope: !454, file: !28, line: 180, baseType: !457, size: 1600, offset: 1600)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "faceData", scope: !454, file: !28, line: 180, baseType: !457, size: 1600, offset: 3200)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "loopData", scope: !454, file: !28, line: 180, baseType: !457, size: 1600, offset: 4800)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "polyData", scope: !454, file: !28, line: 180, baseType: !457, size: 1600, offset: 6400)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "numVertData", scope: !454, file: !28, line: 181, baseType: !133, size: 32, offset: 8000)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "numEdgeData", scope: !454, file: !28, line: 181, baseType: !133, size: 32, offset: 8032)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "numTessFaceData", scope: !454, file: !28, line: 181, baseType: !133, size: 32, offset: 8064)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "numLoopData", scope: !454, file: !28, line: 181, baseType: !133, size: 32, offset: 8096)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "numPolyData", scope: !454, file: !28, line: 181, baseType: !133, size: 32, offset: 8128)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "needsFree", scope: !454, file: !28, line: 182, baseType: !133, size: 32, offset: 8160)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "deformedOnly", scope: !454, file: !28, line: 183, baseType: !133, size: 32, offset: 8192)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "bvhCache", scope: !454, file: !28, line: 184, baseType: !503, size: 64, offset: 8256)
!503 = !DIDerivedType(tag: DW_TAG_typedef, name: "BVHCache", file: !504, line: 124, baseType: !505)
!504 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_bvhutils.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64)
!506 = !DICompositeType(tag: DW_TAG_structure_type, name: "LinkNode", file: !504, line: 124, flags: DIFlagFwdDecl)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "drawObject", scope: !454, file: !28, line: 185, baseType: !508, size: 64, offset: 8320)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64)
!509 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUDrawObject", file: !28, line: 97, flags: DIFlagFwdDecl)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !454, file: !28, line: 186, baseType: !511, size: 32, offset: 8384)
!511 = !DIDerivedType(tag: DW_TAG_typedef, name: "DerivedMeshType", file: !28, line: 132, baseType: !27)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "auto_bump_scale", scope: !454, file: !28, line: 187, baseType: !152, size: 32, offset: 8416)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "dirty", scope: !454, file: !28, line: 188, baseType: !514, size: 32, offset: 8448)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMDirtyFlag", file: !28, line: 175, baseType: !33)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "totmat", scope: !454, file: !28, line: 189, baseType: !133, size: 32, offset: 8480)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !454, file: !28, line: 190, baseType: !342, size: 64, offset: 8512)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "cd_flag", scope: !454, file: !28, line: 193, baseType: !139, size: 8, offset: 8576)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "calcNormals", scope: !454, file: !28, line: 196, baseType: !519, size: 64, offset: 8640)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!520 = !DISubroutineType(types: !521)
!521 = !{null, !522}
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64)
!523 = !DIDerivedType(tag: DW_TAG_typedef, name: "DerivedMesh", file: !28, line: 177, baseType: !454)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "calcLoopNormals", scope: !454, file: !28, line: 199, baseType: !525, size: 64, offset: 8704)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64)
!526 = !DISubroutineType(types: !527)
!527 = !{null, !522, !528}
!528 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !152)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "recalcTessellation", scope: !454, file: !28, line: 202, baseType: !519, size: 64, offset: 8768)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "getNumVerts", scope: !454, file: !28, line: 207, baseType: !531, size: 64, offset: 8832)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64)
!532 = !DISubroutineType(types: !533)
!533 = !{!133, !522}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "getNumEdges", scope: !454, file: !28, line: 208, baseType: !531, size: 64, offset: 8896)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "getNumTessFaces", scope: !454, file: !28, line: 209, baseType: !531, size: 64, offset: 8960)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "getNumLoops", scope: !454, file: !28, line: 210, baseType: !531, size: 64, offset: 9024)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "getNumPolys", scope: !454, file: !28, line: 211, baseType: !531, size: 64, offset: 9088)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "getVert", scope: !454, file: !28, line: 218, baseType: !539, size: 64, offset: 9152)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64)
!540 = !DISubroutineType(types: !541)
!541 = !{null, !522, !133, !542}
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64)
!543 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MVert", file: !544, line: 65, size: 160, elements: !545)
!544 = !DIFile(filename: "blender/source/blender/makesdna/DNA_meshdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!545 = !{!546, !547, !549, !550}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !543, file: !544, line: 66, baseType: !285, size: 96)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !543, file: !544, line: 67, baseType: !548, size: 48, offset: 96)
!548 = !DICompositeType(tag: DW_TAG_array_type, baseType: !149, size: 48, elements: !286)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !543, file: !544, line: 68, baseType: !139, size: 8, offset: 144)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "bweight", scope: !543, file: !544, line: 68, baseType: !139, size: 8, offset: 152)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "getEdge", scope: !454, file: !28, line: 219, baseType: !552, size: 64, offset: 9216)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64)
!553 = !DISubroutineType(types: !554)
!554 = !{null, !522, !133, !555}
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64)
!556 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MEdge", file: !544, line: 48, size: 96, elements: !557)
!557 = !{!558, !559, !560, !561, !562}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !556, file: !544, line: 49, baseType: !7, size: 32)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !556, file: !544, line: 49, baseType: !7, size: 32, offset: 32)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "crease", scope: !556, file: !544, line: 50, baseType: !139, size: 8, offset: 64)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "bweight", scope: !556, file: !544, line: 50, baseType: !139, size: 8, offset: 72)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !556, file: !544, line: 51, baseType: !149, size: 16, offset: 80)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFace", scope: !454, file: !28, line: 220, baseType: !564, size: 64, offset: 9280)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64)
!565 = !DISubroutineType(types: !566)
!566 = !{null, !522, !133, !567}
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!568 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MFace", file: !544, line: 42, size: 160, elements: !569)
!569 = !{!570, !571, !572, !573, !574, !575, !576}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !568, file: !544, line: 43, baseType: !7, size: 32)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !568, file: !544, line: 43, baseType: !7, size: 32, offset: 32)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !568, file: !544, line: 43, baseType: !7, size: 32, offset: 64)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !568, file: !544, line: 43, baseType: !7, size: 32, offset: 96)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !568, file: !544, line: 44, baseType: !149, size: 16, offset: 128)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "edcode", scope: !568, file: !544, line: 45, baseType: !139, size: 8, offset: 144)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !568, file: !544, line: 45, baseType: !139, size: 8, offset: 152)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "getVertArray", scope: !454, file: !28, line: 227, baseType: !578, size: 64, offset: 9344)
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64)
!579 = !DISubroutineType(types: !580)
!580 = !{!542, !522}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeArray", scope: !454, file: !28, line: 228, baseType: !582, size: 64, offset: 9408)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!583 = !DISubroutineType(types: !584)
!584 = !{!555, !522}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceArray", scope: !454, file: !28, line: 229, baseType: !586, size: 64, offset: 9472)
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64)
!587 = !DISubroutineType(types: !588)
!588 = !{!567, !522}
!589 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopArray", scope: !454, file: !28, line: 230, baseType: !590, size: 64, offset: 9536)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64)
!591 = !DISubroutineType(types: !592)
!592 = !{!593, !522}
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64)
!594 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MLoop", file: !544, line: 88, size: 64, elements: !595)
!595 = !{!596, !597}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !594, file: !544, line: 89, baseType: !7, size: 32)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !594, file: !544, line: 90, baseType: !7, size: 32, offset: 32)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyArray", scope: !454, file: !28, line: 231, baseType: !599, size: 64, offset: 9600)
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64)
!600 = !DISubroutineType(types: !601)
!601 = !{!602, !522}
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64)
!603 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MPoly", file: !544, line: 79, size: 96, elements: !604)
!604 = !{!605, !606, !607, !608, !609}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "loopstart", scope: !603, file: !544, line: 81, baseType: !133, size: 32)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !603, file: !544, line: 82, baseType: !133, size: 32, offset: 32)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !603, file: !544, line: 83, baseType: !149, size: 16, offset: 64)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !603, file: !544, line: 84, baseType: !139, size: 8, offset: 80)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !603, file: !544, line: 84, baseType: !139, size: 8, offset: 88)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "copyVertArray", scope: !454, file: !28, line: 236, baseType: !611, size: 64, offset: 9664)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64)
!612 = !DISubroutineType(types: !613)
!613 = !{null, !522, !542}
!614 = !DIDerivedType(tag: DW_TAG_member, name: "copyEdgeArray", scope: !454, file: !28, line: 237, baseType: !615, size: 64, offset: 9728)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 64)
!616 = !DISubroutineType(types: !617)
!617 = !{null, !522, !555}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "copyTessFaceArray", scope: !454, file: !28, line: 238, baseType: !619, size: 64, offset: 9792)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64)
!620 = !DISubroutineType(types: !621)
!621 = !{null, !522, !567}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "copyLoopArray", scope: !454, file: !28, line: 239, baseType: !623, size: 64, offset: 9856)
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 64)
!624 = !DISubroutineType(types: !625)
!625 = !{null, !522, !593}
!626 = !DIDerivedType(tag: DW_TAG_member, name: "copyPolyArray", scope: !454, file: !28, line: 240, baseType: !627, size: 64, offset: 9920)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 64)
!628 = !DISubroutineType(types: !629)
!629 = !{null, !522, !602}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "dupVertArray", scope: !454, file: !28, line: 245, baseType: !578, size: 64, offset: 9984)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "dupEdgeArray", scope: !454, file: !28, line: 246, baseType: !582, size: 64, offset: 10048)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "dupTessFaceArray", scope: !454, file: !28, line: 247, baseType: !586, size: 64, offset: 10112)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "dupLoopArray", scope: !454, file: !28, line: 248, baseType: !590, size: 64, offset: 10176)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "dupPolyArray", scope: !454, file: !28, line: 249, baseType: !599, size: 64, offset: 10240)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "getVertData", scope: !454, file: !28, line: 255, baseType: !636, size: 64, offset: 10304)
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 64)
!637 = !DISubroutineType(types: !638)
!638 = !{!164, !522, !133, !133}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeData", scope: !454, file: !28, line: 256, baseType: !636, size: 64, offset: 10368)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceData", scope: !454, file: !28, line: 257, baseType: !636, size: 64, offset: 10432)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyData", scope: !454, file: !28, line: 258, baseType: !636, size: 64, offset: 10496)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "getVertDataArray", scope: !454, file: !28, line: 264, baseType: !643, size: 64, offset: 10560)
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 64)
!644 = !DISubroutineType(types: !645)
!645 = !{!164, !522, !133}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeDataArray", scope: !454, file: !28, line: 265, baseType: !643, size: 64, offset: 10624)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceDataArray", scope: !454, file: !28, line: 266, baseType: !643, size: 64, offset: 10688)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopDataArray", scope: !454, file: !28, line: 267, baseType: !643, size: 64, offset: 10752)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyDataArray", scope: !454, file: !28, line: 268, baseType: !643, size: 64, offset: 10816)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "getVertDataLayout", scope: !454, file: !28, line: 272, baseType: !651, size: 64, offset: 10880)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64)
!652 = !DISubroutineType(types: !653)
!653 = !{!654, !522}
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "getEdgeDataLayout", scope: !454, file: !28, line: 273, baseType: !651, size: 64, offset: 10944)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "getTessFaceDataLayout", scope: !454, file: !28, line: 274, baseType: !651, size: 64, offset: 11008)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "getLoopDataLayout", scope: !454, file: !28, line: 275, baseType: !651, size: 64, offset: 11072)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyDataLayout", scope: !454, file: !28, line: 276, baseType: !651, size: 64, offset: 11136)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromVertCData", scope: !454, file: !28, line: 279, baseType: !660, size: 64, offset: 11200)
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 64)
!661 = !DISubroutineType(types: !662)
!662 = !{null, !522, !133, !654, !133}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromEdgeCData", scope: !454, file: !28, line: 280, baseType: !660, size: 64, offset: 11264)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "copyFromFaceCData", scope: !454, file: !28, line: 281, baseType: !660, size: 64, offset: 11328)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "getNumGrids", scope: !454, file: !28, line: 284, baseType: !531, size: 64, offset: 11392)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "getGridSize", scope: !454, file: !28, line: 285, baseType: !531, size: 64, offset: 11456)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "getGridData", scope: !454, file: !28, line: 286, baseType: !668, size: 64, offset: 11520)
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 64)
!669 = !DISubroutineType(types: !670)
!670 = !{!671, !522}
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 64)
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 64)
!673 = !DICompositeType(tag: DW_TAG_structure_type, name: "CCGElem", file: !28, line: 82, flags: DIFlagFwdDecl)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "getGridAdjacency", scope: !454, file: !28, line: 287, baseType: !675, size: 64, offset: 11584)
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !676, size: 64)
!676 = !DISubroutineType(types: !677)
!677 = !{!678, !522}
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 64)
!679 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMGridAdjacency", file: !28, line: 120, baseType: !680)
!680 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DMGridAdjacency", file: !28, line: 117, size: 256, elements: !681)
!681 = !{!682, !684}
!682 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !680, file: !28, line: 118, baseType: !683, size: 128)
!683 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 128, elements: !358)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "rotation", scope: !680, file: !28, line: 119, baseType: !683, size: 128, offset: 128)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "getGridOffset", scope: !454, file: !28, line: 288, baseType: !686, size: 64, offset: 11648)
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !687, size: 64)
!687 = !DISubroutineType(types: !688)
!688 = !{!689, !522}
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "getGridKey", scope: !454, file: !28, line: 289, baseType: !691, size: 64, offset: 11712)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 64)
!692 = !DISubroutineType(types: !693)
!693 = !{null, !522, !694}
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 64)
!695 = !DICompositeType(tag: DW_TAG_structure_type, name: "CCGKey", file: !28, line: 83, flags: DIFlagFwdDecl)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "getGridFlagMats", scope: !454, file: !28, line: 290, baseType: !697, size: 64, offset: 11776)
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 64)
!698 = !DISubroutineType(types: !699)
!699 = !{!700, !522}
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !701, size: 64)
!701 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMFlagMat", file: !28, line: 126, baseType: !702)
!702 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DMFlagMat", file: !28, line: 123, size: 32, elements: !703)
!703 = !{!704, !705}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !702, file: !28, line: 124, baseType: !149, size: 16)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !702, file: !28, line: 125, baseType: !139, size: 8, offset: 16)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "getGridHidden", scope: !454, file: !28, line: 291, baseType: !707, size: 64, offset: 11840)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 64)
!708 = !DISubroutineType(types: !709)
!709 = !{!710, !522}
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 64)
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedVert", scope: !454, file: !28, line: 299, baseType: !713, size: 64, offset: 11904)
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !714, size: 64)
!714 = !DISubroutineType(types: !715)
!715 = !{null, !522, !716, !164, !722}
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 64)
!717 = !DISubroutineType(types: !718)
!718 = !{null, !164, !133, !719, !719, !720}
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64)
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !721, size: 64)
!721 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !149)
!722 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMForeachFlag", file: !28, line: 162, baseType: !38)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedEdge", scope: !454, file: !28, line: 309, baseType: !724, size: 64, offset: 11968)
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 64)
!725 = !DISubroutineType(types: !726)
!726 = !{null, !522, !727, !164}
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !728, size: 64)
!728 = !DISubroutineType(types: !729)
!729 = !{null, !164, !133, !719, !719}
!730 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedLoop", scope: !454, file: !28, line: 317, baseType: !731, size: 64, offset: 12032)
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !732, size: 64)
!732 = !DISubroutineType(types: !733)
!733 = !{null, !522, !734, !164, !722}
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64)
!735 = !DISubroutineType(types: !736)
!736 = !{null, !164, !133, !133, !719, !719}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "foreachMappedFaceCenter", scope: !454, file: !28, line: 327, baseType: !738, size: 64, offset: 12096)
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 64)
!739 = !DISubroutineType(types: !740)
!740 = !{null, !522, !727, !164, !722}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "getMinMax", scope: !454, file: !28, line: 337, baseType: !742, size: 64, offset: 12160)
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !743, size: 64)
!743 = !DISubroutineType(types: !744)
!744 = !{null, !522, !745, !745}
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "getVertCo", scope: !454, file: !28, line: 344, baseType: !747, size: 64, offset: 12224)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64)
!748 = !DISubroutineType(types: !749)
!749 = !{null, !522, !133, !745}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "getVertCos", scope: !454, file: !28, line: 347, baseType: !751, size: 64, offset: 12288)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64)
!752 = !DISubroutineType(types: !753)
!753 = !{null, !522, !754}
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "getVertNo", scope: !454, file: !28, line: 350, baseType: !747, size: 64, offset: 12352)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyNo", scope: !454, file: !28, line: 351, baseType: !747, size: 64, offset: 12416)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "getPolyMap", scope: !454, file: !28, line: 355, baseType: !758, size: 64, offset: 12480)
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !759, size: 64)
!759 = !DISubroutineType(types: !760)
!760 = !{!761, !154, !522}
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 64)
!762 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !763)
!763 = !DICompositeType(tag: DW_TAG_structure_type, name: "MeshElemMap", file: !28, line: 355, flags: DIFlagFwdDecl)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "getPBVH", scope: !454, file: !28, line: 359, baseType: !765, size: 64, offset: 12544)
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 64)
!766 = !DISubroutineType(types: !767)
!767 = !{!768, !154, !522}
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 64)
!769 = !DICompositeType(tag: DW_TAG_structure_type, name: "PBVH", file: !28, line: 100, flags: DIFlagFwdDecl)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "drawVerts", scope: !454, file: !28, line: 364, baseType: !519, size: 64, offset: 12608)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "drawUVEdges", scope: !454, file: !28, line: 367, baseType: !519, size: 64, offset: 12672)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "drawEdges", scope: !454, file: !28, line: 373, baseType: !773, size: 64, offset: 12736)
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 64)
!774 = !DISubroutineType(types: !775)
!775 = !{null, !522, !776, !776}
!776 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "drawLooseEdges", scope: !454, file: !28, line: 376, baseType: !519, size: 64, offset: 12800)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "drawFacesSolid", scope: !454, file: !28, line: 385, baseType: !779, size: 64, offset: 12864)
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !780, size: 64)
!780 = !DISubroutineType(types: !781)
!781 = !{null, !522, !782, !776, !783}
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64)
!783 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSetMaterial", file: !28, line: 146, baseType: !784)
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !785, size: 64)
!785 = !DISubroutineType(types: !786)
!786 = !{!133, !133, !164}
!787 = !DIDerivedType(tag: DW_TAG_member, name: "drawFacesTex", scope: !454, file: !28, line: 391, baseType: !788, size: 64, offset: 12928)
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !789, size: 64)
!789 = !DISubroutineType(types: !790)
!790 = !{null, !522, !791, !890, !164, !894}
!791 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSetDrawOptionsTex", file: !28, line: 150, baseType: !792)
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !793, size: 64)
!793 = !DISubroutineType(types: !794)
!794 = !{!795, !796, !889, !133}
!795 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMDrawOption", file: !28, line: 143, baseType: !42)
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !797, size: 64)
!797 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MTFace", file: !544, line: 160, size: 384, elements: !798)
!798 = !{!799, !803, !884, !885, !886, !887, !888}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !797, file: !544, line: 161, baseType: !800, size: 256)
!800 = !DICompositeType(tag: DW_TAG_array_type, baseType: !152, size: 256, elements: !801)
!801 = !{!359, !802}
!802 = !DISubrange(count: 2)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "tpage", scope: !797, file: !544, line: 162, baseType: !804, size: 64, offset: 256)
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 64)
!805 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !145, line: 77, size: 15424, elements: !806)
!806 = !{!807, !808, !809, !812, !815, !818, !821, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !873, !874, !878}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !805, file: !145, line: 78, baseType: !159, size: 960)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !805, file: !145, line: 80, baseType: !179, size: 8192, offset: 960)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !805, file: !145, line: 82, baseType: !810, size: 64, offset: 9152)
!810 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !811, size: 64)
!811 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !145, line: 43, flags: DIFlagFwdDecl)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !805, file: !145, line: 83, baseType: !813, size: 64, offset: 9216)
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 64)
!814 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !160, line: 46, flags: DIFlagFwdDecl)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !805, file: !145, line: 86, baseType: !816, size: 64, offset: 9280)
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 64)
!817 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !145, line: 41, flags: DIFlagFwdDecl)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !805, file: !145, line: 87, baseType: !819, size: 64, offset: 9344)
!819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !820, size: 64)
!820 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !145, line: 44, flags: DIFlagFwdDecl)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !805, file: !145, line: 89, baseType: !822, size: 512, offset: 9408)
!822 = !DICompositeType(tag: DW_TAG_array_type, baseType: !819, size: 512, elements: !823)
!823 = !{!252}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !805, file: !145, line: 90, baseType: !149, size: 16, offset: 9920)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !805, file: !145, line: 90, baseType: !149, size: 16, offset: 9936)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !805, file: !145, line: 92, baseType: !149, size: 16, offset: 9952)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !805, file: !145, line: 92, baseType: !149, size: 16, offset: 9968)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !805, file: !145, line: 93, baseType: !149, size: 16, offset: 9984)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !805, file: !145, line: 93, baseType: !149, size: 16, offset: 10000)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !805, file: !145, line: 94, baseType: !133, size: 32, offset: 10016)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !805, file: !145, line: 97, baseType: !149, size: 16, offset: 10048)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !805, file: !145, line: 97, baseType: !149, size: 16, offset: 10064)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !805, file: !145, line: 98, baseType: !149, size: 16, offset: 10080)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !805, file: !145, line: 98, baseType: !149, size: 16, offset: 10096)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !805, file: !145, line: 99, baseType: !149, size: 16, offset: 10112)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !805, file: !145, line: 99, baseType: !149, size: 16, offset: 10128)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !805, file: !145, line: 100, baseType: !7, size: 32, offset: 10144)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !805, file: !145, line: 101, baseType: !711, size: 64, offset: 10176)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !805, file: !145, line: 103, baseType: !185, size: 64, offset: 10240)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !805, file: !145, line: 104, baseType: !841, size: 64, offset: 10304)
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !842, size: 64)
!842 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !160, line: 159, size: 448, elements: !843)
!843 = !{!844, !847, !848, !850, !851, !853}
!844 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !842, file: !160, line: 161, baseType: !845, size: 64)
!845 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !846)
!846 = !{!802}
!847 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !842, file: !160, line: 162, baseType: !845, size: 64, offset: 64)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !842, file: !160, line: 163, baseType: !849, size: 32, offset: 128)
!849 = !DICompositeType(tag: DW_TAG_array_type, baseType: !149, size: 32, elements: !846)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !842, file: !160, line: 164, baseType: !849, size: 32, offset: 160)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !842, file: !160, line: 165, baseType: !852, size: 128, offset: 192)
!852 = !DICompositeType(tag: DW_TAG_array_type, baseType: !711, size: 128, elements: !846)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !842, file: !160, line: 166, baseType: !854, size: 128, offset: 320)
!854 = !DICompositeType(tag: DW_TAG_array_type, baseType: !813, size: 128, elements: !846)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !805, file: !145, line: 107, baseType: !152, size: 32, offset: 10368)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !805, file: !145, line: 108, baseType: !133, size: 32, offset: 10400)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !805, file: !145, line: 109, baseType: !149, size: 16, offset: 10432)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !805, file: !145, line: 110, baseType: !149, size: 16, offset: 10448)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !805, file: !145, line: 113, baseType: !133, size: 32, offset: 10464)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !805, file: !145, line: 113, baseType: !133, size: 32, offset: 10496)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !805, file: !145, line: 114, baseType: !139, size: 8, offset: 10528)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !805, file: !145, line: 114, baseType: !139, size: 8, offset: 10536)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !805, file: !145, line: 115, baseType: !149, size: 16, offset: 10544)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !805, file: !145, line: 116, baseType: !357, size: 128, offset: 10560)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !805, file: !145, line: 119, baseType: !152, size: 32, offset: 10688)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !805, file: !145, line: 119, baseType: !152, size: 32, offset: 10720)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !805, file: !145, line: 122, baseType: !868, size: 512, offset: 10752)
!868 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !869, line: 182, baseType: !870)
!869 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!870 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !869, line: 180, size: 512, elements: !871)
!871 = !{!872}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !870, file: !869, line: 181, baseType: !138, size: 512)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !805, file: !145, line: 123, baseType: !139, size: 8, offset: 11264)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !805, file: !145, line: 125, baseType: !875, size: 56, offset: 11272)
!875 = !DICompositeType(tag: DW_TAG_array_type, baseType: !139, size: 56, elements: !876)
!876 = !{!877}
!877 = !DISubrange(count: 7)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !805, file: !145, line: 126, baseType: !879, size: 4096, offset: 11328)
!879 = !DICompositeType(tag: DW_TAG_array_type, baseType: !880, size: 4096, elements: !823)
!880 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !145, line: 69, baseType: !881)
!881 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !145, line: 67, size: 512, elements: !882)
!882 = !{!883}
!883 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !881, file: !145, line: 68, baseType: !138, size: 512)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !797, file: !544, line: 163, baseType: !139, size: 8, offset: 320)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "transp", scope: !797, file: !544, line: 163, baseType: !139, size: 8, offset: 328)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !797, file: !544, line: 164, baseType: !149, size: 16, offset: 336)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "tile", scope: !797, file: !544, line: 164, baseType: !149, size: 16, offset: 352)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "unwrap", scope: !797, file: !544, line: 164, baseType: !149, size: 16, offset: 368)
!889 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !776)
!890 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMCompareDrawOptions", file: !28, line: 147, baseType: !891)
!891 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !892, size: 64)
!892 = !DISubroutineType(types: !893)
!893 = !{!133, !164, !133, !133}
!894 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMDrawFlag", file: !28, line: 157, baseType: !48)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "drawFacesGLSL", scope: !454, file: !28, line: 400, baseType: !896, size: 64, offset: 12992)
!896 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !897, size: 64)
!897 = !DISubroutineType(types: !898)
!898 = !{null, !522, !783}
!899 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedFaces", scope: !454, file: !28, line: 415, baseType: !900, size: 64, offset: 13056)
!900 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !901, size: 64)
!901 = !DISubroutineType(types: !902)
!902 = !{null, !522, !903, !783, !890, !164, !894}
!903 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSetDrawOptions", file: !28, line: 149, baseType: !904)
!904 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !905, size: 64)
!905 = !DISubroutineType(types: !906)
!906 = !{!795, !164, !133}
!907 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedFacesTex", scope: !454, file: !28, line: 425, baseType: !908, size: 64, offset: 13120)
!908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !909, size: 64)
!909 = !DISubroutineType(types: !910)
!910 = !{null, !522, !903, !890, !164, !894}
!911 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedFacesGLSL", scope: !454, file: !28, line: 435, baseType: !912, size: 64, offset: 13184)
!912 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !913, size: 64)
!913 = !DISubroutineType(types: !914)
!914 = !{null, !522, !783, !903, !164}
!915 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedEdges", scope: !454, file: !28, line: 444, baseType: !916, size: 64, offset: 13248)
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 64)
!917 = !DISubroutineType(types: !918)
!918 = !{null, !522, !903, !164}
!919 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedEdgesInterp", scope: !454, file: !28, line: 455, baseType: !920, size: 64, offset: 13312)
!920 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !921, size: 64)
!921 = !DISubroutineType(types: !922)
!922 = !{null, !522, !903, !923, !164}
!923 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMSetDrawInterpOptions", file: !28, line: 148, baseType: !924)
!924 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !925, size: 64)
!925 = !DISubroutineType(types: !926)
!926 = !{null, !164, !133, !152}
!927 = !DIDerivedType(tag: DW_TAG_member, name: "drawMappedFacesMat", scope: !454, file: !28, line: 464, baseType: !928, size: 64, offset: 13376)
!928 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 64)
!929 = !DISubroutineType(types: !930)
!930 = !{null, !522, !931, !934, !164}
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 64)
!932 = !DISubroutineType(types: !933)
!933 = !{null, !164, !133, !164}
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 64)
!935 = !DISubroutineType(types: !936)
!936 = !{!776, !164, !133}
!937 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !454, file: !28, line: 470, baseType: !519, size: 64, offset: 13440)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !155, file: !156, line: 277, baseType: !453, size: 64, offset: 10368)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !155, file: !156, line: 278, baseType: !940, size: 64, offset: 10432)
!940 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !941, line: 27, baseType: !942)
!941 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!942 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !943, line: 45, baseType: !944)
!943 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!944 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_mask", scope: !155, file: !156, line: 279, baseType: !940, size: 64, offset: 10496)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !155, file: !156, line: 280, baseType: !7, size: 32, offset: 10560)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !155, file: !156, line: 281, baseType: !7, size: 32, offset: 10592)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "gpulamp", scope: !155, file: !156, line: 283, baseType: !214, size: 128, offset: 10624)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "pc_ids", scope: !155, file: !156, line: 284, baseType: !214, size: 128, offset: 10752)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "duplilist", scope: !155, file: !156, line: 285, baseType: !951, size: 64, offset: 10880)
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_object", scope: !155, file: !156, line: 287, baseType: !953, size: 64, offset: 10944)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64)
!954 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyOb", file: !156, line: 59, flags: DIFlagFwdDecl)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_constraint", scope: !155, file: !156, line: 288, baseType: !956, size: 64, offset: 11008)
!956 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 64)
!957 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyCon", file: !156, line: 288, flags: DIFlagFwdDecl)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "ima_ofs", scope: !155, file: !156, line: 290, baseType: !959, size: 64, offset: 11072)
!959 = !DICompositeType(tag: DW_TAG_array_type, baseType: !152, size: 64, elements: !846)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !155, file: !156, line: 291, baseType: !961, size: 64, offset: 11136)
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 64)
!962 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageUser", file: !145, line: 65, baseType: !963)
!963 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !145, line: 50, size: 320, elements: !964)
!964 = !{!965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978}
!965 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !963, file: !145, line: 51, baseType: !143, size: 64)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !963, file: !145, line: 53, baseType: !133, size: 32, offset: 64)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !963, file: !145, line: 54, baseType: !133, size: 32, offset: 96)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !963, file: !145, line: 55, baseType: !133, size: 32, offset: 128)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !963, file: !145, line: 55, baseType: !133, size: 32, offset: 160)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !963, file: !145, line: 56, baseType: !139, size: 8, offset: 192)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "cycl", scope: !963, file: !145, line: 56, baseType: !139, size: 8, offset: 200)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !963, file: !145, line: 57, baseType: !139, size: 8, offset: 208)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !963, file: !145, line: 57, baseType: !139, size: 8, offset: 216)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "multi_index", scope: !963, file: !145, line: 59, baseType: !149, size: 16, offset: 224)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !963, file: !145, line: 59, baseType: !149, size: 16, offset: 240)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !963, file: !145, line: 59, baseType: !149, size: 16, offset: 256)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !963, file: !145, line: 61, baseType: !149, size: 16, offset: 272)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !963, file: !145, line: 63, baseType: !133, size: 32, offset: 288)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "lodlevels", scope: !155, file: !156, line: 293, baseType: !214, size: 128, offset: 11200)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "currentlod", scope: !155, file: !156, line: 294, baseType: !981, size: 64, offset: 11328)
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 64)
!982 = !DIDerivedType(tag: DW_TAG_typedef, name: "LodLevel", file: !156, line: 113, baseType: !983)
!983 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LodLevel", file: !156, line: 108, size: 256, elements: !984)
!984 = !{!985, !987, !988, !989, !990}
!985 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !983, file: !156, line: 109, baseType: !986, size: 64)
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !983, file: !156, line: 109, baseType: !986, size: 64, offset: 64)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !983, file: !156, line: 110, baseType: !154, size: 64, offset: 128)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !983, file: !156, line: 111, baseType: !133, size: 32, offset: 192)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "distance", scope: !983, file: !156, line: 112, baseType: !152, size: 32, offset: 224)
!991 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !992, size: 64)
!992 = !DIDerivedType(tag: DW_TAG_typedef, name: "MDeformVert", file: !544, line: 63, baseType: !993)
!993 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MDeformVert", file: !544, line: 59, size: 128, elements: !994)
!994 = !{!995, !1001, !1002}
!995 = !DIDerivedType(tag: DW_TAG_member, name: "dw", scope: !993, file: !544, line: 60, baseType: !996, size: 64)
!996 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !997, size: 64)
!997 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MDeformWeight", file: !544, line: 54, size: 64, elements: !998)
!998 = !{!999, !1000}
!999 = !DIDerivedType(tag: DW_TAG_member, name: "def_nr", scope: !997, file: !544, line: 55, baseType: !133, size: 32)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !997, file: !544, line: 56, baseType: !152, size: 32, offset: 32)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "totweight", scope: !993, file: !544, line: 61, baseType: !133, size: 32, offset: 64)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !993, file: !544, line: 62, baseType: !133, size: 32, offset: 96)
!1003 = !{!0}
!1004 = !DIDerivedType(tag: DW_TAG_typedef, name: "ModifierTypeInfo", file: !6, line: 309, baseType: !1005)
!1005 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ModifierTypeInfo", file: !6, line: 121, size: 1728, elements: !1006)
!1006 = !{!1007, !1011, !1012, !1013, !1015, !1017, !1021, !1026, !1033, !1039, !1043, !1047, !1051, !1055, !1061, !1062, !1066, !1118, !1122, !1123, !1132, !1141}
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1005, file: !6, line: 123, baseType: !1008, size: 256)
!1008 = !DICompositeType(tag: DW_TAG_array_type, baseType: !139, size: 256, elements: !1009)
!1009 = !{!1010}
!1010 = !DISubrange(count: 32)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "structName", scope: !1005, file: !6, line: 128, baseType: !1008, size: 256, offset: 256)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "structSize", scope: !1005, file: !6, line: 131, baseType: !133, size: 32, offset: 512)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1005, file: !6, line: 133, baseType: !1014, size: 32, offset: 544)
!1014 = !DIDerivedType(tag: DW_TAG_typedef, name: "ModifierTypeType", file: !6, line: 71, baseType: !5)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1005, file: !6, line: 134, baseType: !1016, size: 32, offset: 576)
!1016 = !DIDerivedType(tag: DW_TAG_typedef, name: "ModifierTypeFlag", file: !6, line: 104, baseType: !15)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "copyData", scope: !1005, file: !6, line: 142, baseType: !1018, size: 64, offset: 640)
