; ModuleID = 'blender/source/blender/editors/space_view3d/view3d_view.c'
source_filename = "blender/source/blender/editors/space_view3d/view3d_view.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.Global = type { %struct.Main*, [1024 x i8], [1024 x i8], i8, i8, i8, %struct.ListBase, i8, i8, i8, i16, i16, i16, i8, i16, i32, i32, i8, i32, i32, [200 x i8] }
%struct.Main = type { %struct.Main*, %struct.Main*, [1024 x i8], i16, i16, i16, i16, i64, [16 x i8], i16, %struct.Library*, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, [256 x i8], %struct.EvaluationContext*, %struct.MainLock* }
%struct.Library = type { %struct.ID, %struct.ID*, %struct.FileData*, [1024 x i8], [1024 x i8], %struct.Library*, %struct.PackedFile* }

!312 = !DIEnumerator(name: "OB_LOCK_LOCZ", value: 4, isUnsigned: true)
!313 = !DIEnumerator(name: "OB_LOCK_LOC", value: 7, isUnsigned: true)
!314 = !DIEnumerator(name: "OB_LOCK_ROTX", value: 8, isUnsigned: true)
!315 = !DIEnumerator(name: "OB_LOCK_ROTY", value: 16, isUnsigned: true)
!316 = !DIEnumerator(name: "OB_LOCK_ROTZ", value: 32, isUnsigned: true)
!317 = !DIEnumerator(name: "OB_LOCK_ROT", value: 56, isUnsigned: true)
!318 = !DIEnumerator(name: "OB_LOCK_SCALEX", value: 64, isUnsigned: true)
!319 = !DIEnumerator(name: "OB_LOCK_SCALEY", value: 128, isUnsigned: true)
!320 = !DIEnumerator(name: "OB_LOCK_SCALEZ", value: 256, isUnsigned: true)
!321 = !DIEnumerator(name: "OB_LOCK_SCALE", value: 448, isUnsigned: true)
!322 = !DIEnumerator(name: "OB_LOCK_ROTW", value: 512, isUnsigned: true)
!323 = !DIEnumerator(name: "OB_LOCK_ROT4D", value: 1024, isUnsigned: true)
!324 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !325, line: 56, baseType: !7, size: 32, elements: !326)
!325 = !DIFile(filename: "blender/source/blender/editors/space_view3d/view3d_intern.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!326 = !{!327, !328, !329}
!327 = !DIEnumerator(name: "DRAW_PICKING", value: 1, isUnsigned: true)
!328 = !DIEnumerator(name: "DRAW_CONSTCOLOR", value: 2, isUnsigned: true)
!329 = !DIEnumerator(name: "DRAW_SCENESET", value: 4, isUnsigned: true)
!330 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !18, line: 619, baseType: !7, size: 32, elements: !331)
!331 = !{!332, !333, !334}
!332 = !DIEnumerator(name: "OB_RESTRICT_VIEW", value: 1, isUnsigned: true)
!333 = !DIEnumerator(name: "OB_RESTRICT_SELECT", value: 2, isUnsigned: true)
!334 = !DIEnumerator(name: "OB_RESTRICT_RENDER", value: 4, isUnsigned: true)
!335 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !18, line: 394, baseType: !7, size: 32, elements: !336)
!336 = !{!337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349}
!337 = !DIEnumerator(name: "OB_NEG_SCALE", value: 4, isUnsigned: true)
!338 = !DIEnumerator(name: "OB_DUPLIFRAMES", value: 8, isUnsigned: true)
!339 = !DIEnumerator(name: "OB_DUPLIVERTS", value: 16, isUnsigned: true)
!340 = !DIEnumerator(name: "OB_DUPLIROT", value: 32, isUnsigned: true)
!341 = !DIEnumerator(name: "OB_DUPLINOSPEED", value: 64, isUnsigned: true)
!342 = !DIEnumerator(name: "OB_DUPLIGROUP", value: 256, isUnsigned: true)
!343 = !DIEnumerator(name: "OB_DUPLIFACES", value: 512, isUnsigned: true)
!344 = !DIEnumerator(name: "OB_DUPLIFACES_SCALE", value: 1024, isUnsigned: true)
!345 = !DIEnumerator(name: "OB_DUPLIPARTS", value: 2048, isUnsigned: true)
!346 = !DIEnumerator(name: "OB_RENDER_DUPLI", value: 4096, isUnsigned: true)
!347 = !DIEnumerator(name: "OB_NO_CONSTRAINTS", value: 8192, isUnsigned: true)
!348 = !DIEnumerator(name: "OB_NO_PSYS_UPDATE", value: 16384, isUnsigned: true)
!349 = !DIEnumerator(name: "OB_DUPLI", value: 2840, isUnsigned: true)
!350 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !351, line: 93, baseType: !7, size: 32, elements: !352)
!351 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_context.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!352 = !{!353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366}
!353 = !DIEnumerator(name: "CTX_MODE_EDIT_MESH", value: 0, isUnsigned: true)
!354 = !DIEnumerator(name: "CTX_MODE_EDIT_CURVE", value: 1, isUnsigned: true)
!355 = !DIEnumerator(name: "CTX_MODE_EDIT_SURFACE", value: 2, isUnsigned: true)
!356 = !DIEnumerator(name: "CTX_MODE_EDIT_TEXT", value: 3, isUnsigned: true)
!357 = !DIEnumerator(name: "CTX_MODE_EDIT_ARMATURE", value: 4, isUnsigned: true)
!358 = !DIEnumerator(name: "CTX_MODE_EDIT_METABALL", value: 5, isUnsigned: true)
!359 = !DIEnumerator(name: "CTX_MODE_EDIT_LATTICE", value: 6, isUnsigned: true)
!360 = !DIEnumerator(name: "CTX_MODE_POSE", value: 7, isUnsigned: true)
!361 = !DIEnumerator(name: "CTX_MODE_SCULPT", value: 8, isUnsigned: true)
!362 = !DIEnumerator(name: "CTX_MODE_PAINT_WEIGHT", value: 9, isUnsigned: true)
!363 = !DIEnumerator(name: "CTX_MODE_PAINT_VERTEX", value: 10, isUnsigned: true)
!364 = !DIEnumerator(name: "CTX_MODE_PAINT_TEXTURE", value: 11, isUnsigned: true)
!365 = !DIEnumerator(name: "CTX_MODE_PARTICLE", value: 12, isUnsigned: true)
!366 = !DIEnumerator(name: "CTX_MODE_OBJECT", value: 13, isUnsigned: true)
!367 = !{!368, !369, !371, !372, !370, !1928}
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!370 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!371 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "Camera", file: !41, line: 71, baseType: !374)
!374 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Camera", file: !41, line: 47, size: 1600, elements: !375)
!375 = !{!376, !447, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !467, !1926, !1927}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !374, file: !41, line: 48, baseType: !377, size: 960)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !378, line: 130, baseType: !379)
!378 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!379 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !378, line: 117, size: 960, elements: !380)
!380 = !{!381, !382, !383, !385, !405, !409, !411, !413, !414, !415}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !379, file: !378, line: 118, baseType: !368, size: 64)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !379, file: !378, line: 118, baseType: !368, size: 64, offset: 64)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !379, file: !378, line: 119, baseType: !384, size: 64, offset: 128)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !379, file: !378, line: 120, baseType: !386, size: 64, offset: 192)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!387 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !378, line: 136, size: 17600, elements: !388)
!388 = !{!389, !390, !392, !395, !400, !401, !402}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !387, file: !378, line: 137, baseType: !377, size: 960)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !387, file: !378, line: 138, baseType: !391, size: 64, offset: 960)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !387, file: !378, line: 139, baseType: !393, size: 64, offset: 1024)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64)
!394 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !378, line: 43, flags: DIFlagFwdDecl)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !387, file: !378, line: 140, baseType: !396, size: 8192, offset: 1088)
!396 = !DICompositeType(tag: DW_TAG_array_type, baseType: !397, size: 8192, elements: !398)
!397 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!398 = !{!399}
!399 = !DISubrange(count: 1024)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !387, file: !378, line: 141, baseType: !396, size: 8192, offset: 9280)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !387, file: !378, line: 148, baseType: !386, size: 64, offset: 17472)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !387, file: !378, line: 150, baseType: !403, size: 64, offset: 17536)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!404 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !378, line: 45, flags: DIFlagFwdDecl)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !379, file: !378, line: 121, baseType: !406, size: 528, offset: 256)
!406 = !DICompositeType(tag: DW_TAG_array_type, baseType: !397, size: 528, elements: !407)
!407 = !{!408}
!408 = !DISubrange(count: 66)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !379, file: !378, line: 126, baseType: !410, size: 16, offset: 784)
!410 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !379, file: !378, line: 127, baseType: !412, size: 32, offset: 800)
!412 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !379, file: !378, line: 128, baseType: !412, size: 32, offset: 832)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !379, file: !378, line: 128, baseType: !412, size: 32, offset: 864)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !379, file: !378, line: 129, baseType: !416, size: 64, offset: 896)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !378, line: 75, baseType: !418)
!418 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !378, line: 62, size: 1024, elements: !419)
!419 = !{!420, !422, !423, !424, !425, !426, !430, !431, !445, !446}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !418, file: !378, line: 63, baseType: !421, size: 64)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !418, file: !378, line: 63, baseType: !421, size: 64, offset: 64)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !418, file: !378, line: 64, baseType: !397, size: 8, offset: 128)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !418, file: !378, line: 64, baseType: !397, size: 8, offset: 136)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !418, file: !378, line: 65, baseType: !410, size: 16, offset: 144)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !418, file: !378, line: 66, baseType: !427, size: 512, offset: 160)
!427 = !DICompositeType(tag: DW_TAG_array_type, baseType: !397, size: 512, elements: !428)
!428 = !{!429}
!429 = !DISubrange(count: 64)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !418, file: !378, line: 67, baseType: !412, size: 32, offset: 672)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !418, file: !378, line: 69, baseType: !432, size: 256, offset: 704)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !378, line: 60, baseType: !433)
!433 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !378, line: 48, size: 256, elements: !434)
!434 = !{!435, !436, !443, !444}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !433, file: !378, line: 49, baseType: !368, size: 64)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !433, file: !378, line: 58, baseType: !437, size: 128, offset: 64)
!437 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !438, line: 71, baseType: !439)
!438 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!439 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !438, line: 69, size: 128, elements: !440)
!440 = !{!441, !442}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !439, file: !438, line: 70, baseType: !368, size: 64)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !439, file: !438, line: 70, baseType: !368, size: 64, offset: 64)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !433, file: !378, line: 59, baseType: !412, size: 32, offset: 192)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !433, file: !378, line: 59, baseType: !412, size: 32, offset: 224)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !418, file: !378, line: 70, baseType: !412, size: 32, offset: 960)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !418, file: !378, line: 74, baseType: !412, size: 32, offset: 992)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !374, file: !41, line: 49, baseType: !448, size: 64, offset: 960)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64)
!449 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !41, line: 44, flags: DIFlagFwdDecl)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !374, file: !41, line: 51, baseType: !397, size: 8, offset: 1024)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !374, file: !41, line: 52, baseType: !397, size: 8, offset: 1032)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !374, file: !41, line: 53, baseType: !410, size: 16, offset: 1040)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "passepartalpha", scope: !374, file: !41, line: 54, baseType: !370, size: 32, offset: 1056)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "clipsta", scope: !374, file: !41, line: 55, baseType: !370, size: 32, offset: 1088)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "clipend", scope: !374, file: !41, line: 55, baseType: !370, size: 32, offset: 1120)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "lens", scope: !374, file: !41, line: 56, baseType: !370, size: 32, offset: 1152)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "ortho_scale", scope: !374, file: !41, line: 56, baseType: !370, size: 32, offset: 1184)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "drawsize", scope: !374, file: !41, line: 56, baseType: !370, size: 32, offset: 1216)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "sensor_x", scope: !374, file: !41, line: 57, baseType: !370, size: 32, offset: 1248)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "sensor_y", scope: !374, file: !41, line: 57, baseType: !370, size: 32, offset: 1280)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "shiftx", scope: !374, file: !41, line: 58, baseType: !370, size: 32, offset: 1312)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "shifty", scope: !374, file: !41, line: 58, baseType: !370, size: 32, offset: 1344)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "YF_dofdist", scope: !374, file: !41, line: 63, baseType: !370, size: 32, offset: 1376)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !374, file: !41, line: 65, baseType: !465, size: 64, offset: 1408)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64)
!466 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !41, line: 45, flags: DIFlagFwdDecl)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "dof_ob", scope: !374, file: !41, line: 67, baseType: !468, size: 64, offset: 1472)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64)
!469 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !18, line: 115, size: 11392, elements: !470)
!470 = !{!471, !472, !473, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !499, !513, !514, !557, !558, !562, !563, !579, !580, !581, !582, !583, !584, !585, !589, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !605, !606, !607, !608, !609, !610, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !670, !671, !672, !673, !674, !675, !676, !677, !678, !681, !684, !688, !689, !690, !691, !692, !695, !698, !701, !702, !708, !709, !710, !711, !712, !713, !715, !718, !721, !725, !1914, !1915}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !469, file: !18, line: 116, baseType: !377, size: 960)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !469, file: !18, line: 117, baseType: !448, size: 64, offset: 960)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !469, file: !18, line: 119, baseType: !474, size: 64, offset: 1024)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64)
!475 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !18, line: 57, flags: DIFlagFwdDecl)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !469, file: !18, line: 121, baseType: !410, size: 16, offset: 1088)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !469, file: !18, line: 121, baseType: !410, size: 16, offset: 1104)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !469, file: !18, line: 122, baseType: !412, size: 32, offset: 1120)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !469, file: !18, line: 122, baseType: !412, size: 32, offset: 1152)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !469, file: !18, line: 122, baseType: !412, size: 32, offset: 1184)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !469, file: !18, line: 123, baseType: !427, size: 512, offset: 1216)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !469, file: !18, line: 124, baseType: !468, size: 64, offset: 1728)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !469, file: !18, line: 124, baseType: !468, size: 64, offset: 1792)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !469, file: !18, line: 127, baseType: !468, size: 64, offset: 1856)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !469, file: !18, line: 127, baseType: !468, size: 64, offset: 1920)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !469, file: !18, line: 127, baseType: !468, size: 64, offset: 1984)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !469, file: !18, line: 128, baseType: !465, size: 64, offset: 2048)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !469, file: !18, line: 130, baseType: !489, size: 64, offset: 2112)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64)
!490 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !18, line: 97, size: 832, elements: !491)
!491 = !{!492, !497, !498}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !490, file: !18, line: 98, baseType: !493, size: 768)
!493 = !DICompositeType(tag: DW_TAG_array_type, baseType: !370, size: 768, elements: !494)
!494 = !{!495, !496}
!495 = !DISubrange(count: 8)
!496 = !DISubrange(count: 3)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !490, file: !18, line: 99, baseType: !412, size: 32, offset: 768)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !490, file: !18, line: 99, baseType: !412, size: 32, offset: 800)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !469, file: !18, line: 131, baseType: !500, size: 64, offset: 2176)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!501 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !502, line: 486, size: 1600, elements: !503)
!502 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!503 = !{!504, !505, !506, !507, !508, !509, !510, !511, !512}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !501, file: !502, line: 487, baseType: !377, size: 960)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !501, file: !502, line: 489, baseType: !437, size: 128, offset: 960)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !501, file: !502, line: 490, baseType: !437, size: 128, offset: 1088)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !501, file: !502, line: 491, baseType: !437, size: 128, offset: 1216)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !501, file: !502, line: 492, baseType: !437, size: 128, offset: 1344)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !501, file: !502, line: 494, baseType: !412, size: 32, offset: 1472)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !501, file: !502, line: 495, baseType: !412, size: 32, offset: 1504)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !501, file: !502, line: 497, baseType: !412, size: 32, offset: 1536)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !501, file: !502, line: 498, baseType: !412, size: 32, offset: 1568)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !469, file: !18, line: 132, baseType: !500, size: 64, offset: 2240)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !469, file: !18, line: 133, baseType: !515, size: 64, offset: 2304)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 64)
!516 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !502, line: 334, size: 1728, elements: !517)
!517 = !{!518, !519, !522, !523, !524, !525, !526, !527, !530, !531, !532, !533, !534, !535, !536, !556}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !516, file: !502, line: 335, baseType: !437, size: 128)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !516, file: !502, line: 336, baseType: !520, size: 64, offset: 128)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 64)
!521 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !502, line: 47, flags: DIFlagFwdDecl)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !516, file: !502, line: 338, baseType: !410, size: 16, offset: 192)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !516, file: !502, line: 338, baseType: !410, size: 16, offset: 208)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !516, file: !502, line: 339, baseType: !7, size: 32, offset: 224)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !516, file: !502, line: 340, baseType: !412, size: 32, offset: 256)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !516, file: !502, line: 342, baseType: !370, size: 32, offset: 288)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !516, file: !502, line: 343, baseType: !528, size: 96, offset: 320)
!528 = !DICompositeType(tag: DW_TAG_array_type, baseType: !370, size: 96, elements: !529)
!529 = !{!496}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !516, file: !502, line: 344, baseType: !528, size: 96, offset: 416)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !516, file: !502, line: 347, baseType: !437, size: 128, offset: 512)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !516, file: !502, line: 349, baseType: !412, size: 32, offset: 640)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !516, file: !502, line: 350, baseType: !412, size: 32, offset: 672)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !516, file: !502, line: 351, baseType: !368, size: 64, offset: 704)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !516, file: !502, line: 352, baseType: !368, size: 64, offset: 768)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !516, file: !502, line: 354, baseType: !537, size: 384, offset: 832)
!537 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !502, line: 116, baseType: !538)
!538 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !502, line: 94, size: 384, elements: !539)
!539 = !{!540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !538, file: !502, line: 96, baseType: !412, size: 32)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !538, file: !502, line: 96, baseType: !412, size: 32, offset: 32)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !538, file: !502, line: 97, baseType: !412, size: 32, offset: 64)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !538, file: !502, line: 97, baseType: !412, size: 32, offset: 96)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !538, file: !502, line: 99, baseType: !410, size: 16, offset: 128)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !538, file: !502, line: 100, baseType: !410, size: 16, offset: 144)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !538, file: !502, line: 102, baseType: !410, size: 16, offset: 160)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !538, file: !502, line: 105, baseType: !410, size: 16, offset: 176)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !538, file: !502, line: 108, baseType: !410, size: 16, offset: 192)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !538, file: !502, line: 109, baseType: !410, size: 16, offset: 208)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !538, file: !502, line: 111, baseType: !410, size: 16, offset: 224)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !538, file: !502, line: 112, baseType: !410, size: 16, offset: 240)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !538, file: !502, line: 114, baseType: !412, size: 32, offset: 256)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !538, file: !502, line: 114, baseType: !412, size: 32, offset: 288)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !538, file: !502, line: 115, baseType: !412, size: 32, offset: 320)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !538, file: !502, line: 115, baseType: !412, size: 32, offset: 352)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !516, file: !502, line: 355, baseType: !427, size: 512, offset: 1216)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !469, file: !18, line: 134, baseType: !368, size: 64, offset: 2368)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !469, file: !18, line: 136, baseType: !559, size: 64, offset: 2432)
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 64)
!560 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !561, line: 61, flags: DIFlagFwdDecl)
!561 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!562 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !469, file: !18, line: 138, baseType: !537, size: 384, offset: 2496)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !469, file: !18, line: 139, baseType: !564, size: 64, offset: 2880)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64)
!565 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !502, line: 80, baseType: !566)
!566 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !502, line: 72, size: 192, elements: !567)
!567 = !{!568, !575, !576, !577, !578}
!568 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !566, file: !502, line: 73, baseType: !569, size: 64)
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 64)
!570 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !502, line: 59, baseType: !571)
!571 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !502, line: 56, size: 128, elements: !572)
!572 = !{!573, !574}
!573 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !571, file: !502, line: 57, baseType: !528, size: 96)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !571, file: !502, line: 58, baseType: !412, size: 32, offset: 96)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !566, file: !502, line: 74, baseType: !412, size: 32, offset: 64)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !566, file: !502, line: 76, baseType: !412, size: 32, offset: 96)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !566, file: !502, line: 77, baseType: !412, size: 32, offset: 128)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !566, file: !502, line: 79, baseType: !412, size: 32, offset: 160)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !469, file: !18, line: 141, baseType: !437, size: 128, offset: 2944)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !469, file: !18, line: 142, baseType: !437, size: 128, offset: 3072)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !469, file: !18, line: 143, baseType: !437, size: 128, offset: 3200)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !469, file: !18, line: 144, baseType: !437, size: 128, offset: 3328)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !469, file: !18, line: 146, baseType: !412, size: 32, offset: 3456)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !469, file: !18, line: 147, baseType: !412, size: 32, offset: 3488)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !469, file: !18, line: 150, baseType: !586, size: 64, offset: 3520)
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64)
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 64)
!588 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !561, line: 179, flags: DIFlagFwdDecl)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !469, file: !18, line: 151, baseType: !590, size: 64, offset: 3584)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !469, file: !18, line: 152, baseType: !412, size: 32, offset: 3648)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !469, file: !18, line: 153, baseType: !412, size: 32, offset: 3680)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !469, file: !18, line: 156, baseType: !528, size: 96, offset: 3712)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !469, file: !18, line: 156, baseType: !528, size: 96, offset: 3808)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !469, file: !18, line: 156, baseType: !528, size: 96, offset: 3904)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !469, file: !18, line: 157, baseType: !528, size: 96, offset: 4000)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !469, file: !18, line: 158, baseType: !528, size: 96, offset: 4096)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !469, file: !18, line: 159, baseType: !528, size: 96, offset: 4192)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !469, file: !18, line: 160, baseType: !528, size: 96, offset: 4288)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !469, file: !18, line: 160, baseType: !528, size: 96, offset: 4384)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !469, file: !18, line: 161, baseType: !602, size: 128, offset: 4480)
!602 = !DICompositeType(tag: DW_TAG_array_type, baseType: !370, size: 128, elements: !603)
!603 = !{!604}
!604 = !DISubrange(count: 4)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !469, file: !18, line: 161, baseType: !602, size: 128, offset: 4608)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !469, file: !18, line: 162, baseType: !528, size: 96, offset: 4736)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !469, file: !18, line: 162, baseType: !528, size: 96, offset: 4832)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !469, file: !18, line: 163, baseType: !370, size: 32, offset: 4928)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !469, file: !18, line: 163, baseType: !370, size: 32, offset: 4960)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !469, file: !18, line: 164, baseType: !611, size: 512, offset: 4992)
!611 = !DICompositeType(tag: DW_TAG_array_type, baseType: !370, size: 512, elements: !612)
!612 = !{!604, !604}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !469, file: !18, line: 165, baseType: !611, size: 512, offset: 5504)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !469, file: !18, line: 166, baseType: !611, size: 512, offset: 6016)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !469, file: !18, line: 167, baseType: !611, size: 512, offset: 6528)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !469, file: !18, line: 176, baseType: !611, size: 512, offset: 7040)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !469, file: !18, line: 178, baseType: !7, size: 32, offset: 7552)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !469, file: !18, line: 180, baseType: !410, size: 16, offset: 7584)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !469, file: !18, line: 181, baseType: !410, size: 16, offset: 7600)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !469, file: !18, line: 183, baseType: !410, size: 16, offset: 7616)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !469, file: !18, line: 183, baseType: !410, size: 16, offset: 7632)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !469, file: !18, line: 184, baseType: !410, size: 16, offset: 7648)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !469, file: !18, line: 184, baseType: !410, size: 16, offset: 7664)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !469, file: !18, line: 185, baseType: !410, size: 16, offset: 7680)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !469, file: !18, line: 186, baseType: !410, size: 16, offset: 7696)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !469, file: !18, line: 187, baseType: !410, size: 16, offset: 7712)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !469, file: !18, line: 188, baseType: !397, size: 8, offset: 7728)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !469, file: !18, line: 189, baseType: !397, size: 8, offset: 7736)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !469, file: !18, line: 192, baseType: !412, size: 32, offset: 7744)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !469, file: !18, line: 192, baseType: !412, size: 32, offset: 7776)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !469, file: !18, line: 192, baseType: !412, size: 32, offset: 7808)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !469, file: !18, line: 192, baseType: !412, size: 32, offset: 7840)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !469, file: !18, line: 194, baseType: !412, size: 32, offset: 7872)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !469, file: !18, line: 202, baseType: !370, size: 32, offset: 7904)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !469, file: !18, line: 202, baseType: !370, size: 32, offset: 7936)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !469, file: !18, line: 202, baseType: !370, size: 32, offset: 7968)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !469, file: !18, line: 211, baseType: !370, size: 32, offset: 8000)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !469, file: !18, line: 212, baseType: !370, size: 32, offset: 8032)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !469, file: !18, line: 213, baseType: !370, size: 32, offset: 8064)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !469, file: !18, line: 214, baseType: !370, size: 32, offset: 8096)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !469, file: !18, line: 215, baseType: !370, size: 32, offset: 8128)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !469, file: !18, line: 216, baseType: !370, size: 32, offset: 8160)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !469, file: !18, line: 219, baseType: !370, size: 32, offset: 8192)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !469, file: !18, line: 220, baseType: !370, size: 32, offset: 8224)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !469, file: !18, line: 221, baseType: !370, size: 32, offset: 8256)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !469, file: !18, line: 224, baseType: !647, size: 16, offset: 8288)
!647 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !469, file: !18, line: 224, baseType: !647, size: 16, offset: 8304)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !469, file: !18, line: 226, baseType: !410, size: 16, offset: 8320)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !469, file: !18, line: 228, baseType: !397, size: 8, offset: 8336)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !469, file: !18, line: 229, baseType: !397, size: 8, offset: 8344)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !469, file: !18, line: 231, baseType: !410, size: 16, offset: 8352)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !469, file: !18, line: 232, baseType: !397, size: 8, offset: 8368)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !469, file: !18, line: 233, baseType: !397, size: 8, offset: 8376)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !469, file: !18, line: 234, baseType: !370, size: 32, offset: 8384)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !469, file: !18, line: 235, baseType: !370, size: 32, offset: 8416)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !469, file: !18, line: 237, baseType: !437, size: 128, offset: 8448)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !469, file: !18, line: 238, baseType: !437, size: 128, offset: 8576)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !469, file: !18, line: 239, baseType: !437, size: 128, offset: 8704)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !469, file: !18, line: 240, baseType: !437, size: 128, offset: 8832)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !469, file: !18, line: 242, baseType: !370, size: 32, offset: 8960)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !469, file: !18, line: 244, baseType: !410, size: 16, offset: 8992)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !469, file: !18, line: 245, baseType: !647, size: 16, offset: 9008)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !469, file: !18, line: 246, baseType: !602, size: 128, offset: 9024)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !469, file: !18, line: 248, baseType: !412, size: 32, offset: 9152)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !469, file: !18, line: 249, baseType: !412, size: 32, offset: 9184)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !469, file: !18, line: 251, baseType: !668, size: 64, offset: 9216)
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 64)
!669 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !18, line: 251, flags: DIFlagFwdDecl)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !469, file: !18, line: 253, baseType: !397, size: 8, offset: 9280)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !469, file: !18, line: 254, baseType: !397, size: 8, offset: 9288)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !469, file: !18, line: 255, baseType: !410, size: 16, offset: 9296)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !469, file: !18, line: 256, baseType: !528, size: 96, offset: 9312)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !469, file: !18, line: 258, baseType: !437, size: 128, offset: 9408)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !469, file: !18, line: 259, baseType: !437, size: 128, offset: 9536)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !469, file: !18, line: 260, baseType: !437, size: 128, offset: 9664)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !469, file: !18, line: 261, baseType: !437, size: 128, offset: 9792)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !469, file: !18, line: 263, baseType: !679, size: 64, offset: 9920)
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 64)
!680 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !18, line: 52, flags: DIFlagFwdDecl)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !469, file: !18, line: 264, baseType: !682, size: 64, offset: 9984)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 64)
!683 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !18, line: 53, flags: DIFlagFwdDecl)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !469, file: !18, line: 265, baseType: !685, size: 64, offset: 10048)
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !686, size: 64)
!686 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !687, line: 43, flags: DIFlagFwdDecl)
!687 = !DIFile(filename: "blender/source/blender/makesdna/DNA_freestyle_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!688 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !469, file: !18, line: 267, baseType: !397, size: 8, offset: 10112)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !469, file: !18, line: 268, baseType: !397, size: 8, offset: 10120)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !469, file: !18, line: 269, baseType: !410, size: 16, offset: 10128)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !469, file: !18, line: 270, baseType: !370, size: 32, offset: 10144)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !469, file: !18, line: 272, baseType: !693, size: 64, offset: 10176)
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 64)
!694 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !18, line: 54, flags: DIFlagFwdDecl)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !469, file: !18, line: 275, baseType: !696, size: 64, offset: 10240)
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 64)
!697 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !18, line: 275, flags: DIFlagFwdDecl)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !469, file: !18, line: 277, baseType: !699, size: 64, offset: 10304)
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !700, size: 64)
!700 = !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !18, line: 56, flags: DIFlagFwdDecl)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !469, file: !18, line: 277, baseType: !699, size: 64, offset: 10368)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !469, file: !18, line: 278, baseType: !703, size: 64, offset: 10432)
!703 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !704, line: 27, baseType: !705)
!704 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!705 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !706, line: 45, baseType: !707)
!706 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!707 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_mask", scope: !469, file: !18, line: 279, baseType: !703, size: 64, offset: 10496)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !469, file: !18, line: 280, baseType: !7, size: 32, offset: 10560)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !469, file: !18, line: 281, baseType: !7, size: 32, offset: 10592)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "gpulamp", scope: !469, file: !18, line: 283, baseType: !437, size: 128, offset: 10624)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "pc_ids", scope: !469, file: !18, line: 284, baseType: !437, size: 128, offset: 10752)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "duplilist", scope: !469, file: !18, line: 285, baseType: !714, size: 64, offset: 10880)
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_object", scope: !469, file: !18, line: 287, baseType: !716, size: 64, offset: 10944)
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 64)
!717 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyOb", file: !18, line: 59, flags: DIFlagFwdDecl)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_constraint", scope: !469, file: !18, line: 288, baseType: !719, size: 64, offset: 11008)
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 64)
!720 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyCon", file: !18, line: 288, flags: DIFlagFwdDecl)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "ima_ofs", scope: !469, file: !18, line: 290, baseType: !722, size: 64, offset: 11072)
!722 = !DICompositeType(tag: DW_TAG_array_type, baseType: !370, size: 64, elements: !723)
!723 = !{!724}
!724 = !DISubrange(count: 2)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !469, file: !18, line: 291, baseType: !726, size: 64, offset: 11136)
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 64)
!727 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageUser", file: !728, line: 65, baseType: !729)
!728 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!729 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !728, line: 50, size: 320, elements: !730)
!730 = !{!731, !1901, !1902, !1903, !1904, !1905, !1906, !1907, !1908, !1909, !1910, !1911, !1912, !1913}
!731 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !729, file: !728, line: 51, baseType: !732, size: 64)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 64)
!733 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !561, line: 1216, size: 39680, elements: !734)
!734 = !{!735, !736, !737, !738, !741, !742, !743, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !769, !843, !1270, !1485, !1488, !1776, !1788, !1789, !1790, !1791, !1792, !1793, !1794, !1795, !1798, !1799, !1800, !1801, !1802, !1810, !1877, !1884, !1885, !1892, !1893, !1894, !1895, !1896, !1897, !1898}
!735 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !733, file: !561, line: 1217, baseType: !377, size: 960)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !733, file: !561, line: 1218, baseType: !448, size: 64, offset: 960)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !733, file: !561, line: 1220, baseType: !468, size: 64, offset: 1024)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !733, file: !561, line: 1221, baseType: !739, size: 64, offset: 1088)
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 64)
!740 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !561, line: 52, flags: DIFlagFwdDecl)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !733, file: !561, line: 1223, baseType: !732, size: 64, offset: 1152)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !733, file: !561, line: 1225, baseType: !437, size: 128, offset: 1216)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !733, file: !561, line: 1226, baseType: !744, size: 64, offset: 1344)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 64)
!745 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !561, line: 69, size: 320, elements: !746)
!746 = !{!747, !748, !749, !750, !751, !752, !753, !754}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !745, file: !561, line: 70, baseType: !744, size: 64)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !745, file: !561, line: 70, baseType: !744, size: 64, offset: 64)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !745, file: !561, line: 71, baseType: !7, size: 32, offset: 128)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !745, file: !561, line: 71, baseType: !7, size: 32, offset: 160)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !745, file: !561, line: 72, baseType: !412, size: 32, offset: 192)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !745, file: !561, line: 73, baseType: !410, size: 16, offset: 224)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !745, file: !561, line: 73, baseType: !410, size: 16, offset: 240)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !745, file: !561, line: 74, baseType: !468, size: 64, offset: 256)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !733, file: !561, line: 1227, baseType: !468, size: 64, offset: 1408)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !733, file: !561, line: 1229, baseType: !528, size: 96, offset: 1472)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !733, file: !561, line: 1230, baseType: !528, size: 96, offset: 1568)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !733, file: !561, line: 1231, baseType: !528, size: 96, offset: 1664)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !733, file: !561, line: 1231, baseType: !528, size: 96, offset: 1760)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !733, file: !561, line: 1233, baseType: !7, size: 32, offset: 1856)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !733, file: !561, line: 1234, baseType: !412, size: 32, offset: 1888)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !733, file: !561, line: 1235, baseType: !7, size: 32, offset: 1920)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !733, file: !561, line: 1237, baseType: !410, size: 16, offset: 1952)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !733, file: !561, line: 1239, baseType: !397, size: 8, offset: 1968)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !733, file: !561, line: 1240, baseType: !766, size: 8, offset: 1976)
!766 = !DICompositeType(tag: DW_TAG_array_type, baseType: !397, size: 8, elements: !767)
!767 = !{!768}
!768 = !DISubrange(count: 1)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !733, file: !561, line: 1242, baseType: !770, size: 64, offset: 1984)
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !771, size: 64)
!771 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !772, line: 328, size: 3456, elements: !773)
!772 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!773 = !{!774, !775, !776, !779, !780, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !809, !810, !811, !814, !819, !820, !823, !827, !831, !835, !839, !840, !841, !842}
!774 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !771, file: !772, line: 329, baseType: !377, size: 960)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !771, file: !772, line: 330, baseType: !448, size: 64, offset: 960)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !771, file: !772, line: 332, baseType: !777, size: 64, offset: 1024)
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 64)
!778 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !772, line: 332, flags: DIFlagFwdDecl)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !771, file: !772, line: 333, baseType: !427, size: 512, offset: 1088)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "interface_type", scope: !771, file: !772, line: 335, baseType: !781, size: 64, offset: 1600)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !782, size: 64)
!782 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !783, line: 41, flags: DIFlagFwdDecl)
!783 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!784 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !771, file: !772, line: 337, baseType: !559, size: 64, offset: 1664)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "view_center", scope: !771, file: !772, line: 338, baseType: !722, size: 64, offset: 1728)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !771, file: !772, line: 340, baseType: !437, size: 128, offset: 1792)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !771, file: !772, line: 340, baseType: !437, size: 128, offset: 1920)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !771, file: !772, line: 342, baseType: !412, size: 32, offset: 2048)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !771, file: !772, line: 342, baseType: !412, size: 32, offset: 2080)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "cur_index", scope: !771, file: !772, line: 343, baseType: !412, size: 32, offset: 2112)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !771, file: !772, line: 345, baseType: !412, size: 32, offset: 2144)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !771, file: !772, line: 346, baseType: !412, size: 32, offset: 2176)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "is_updating", scope: !771, file: !772, line: 347, baseType: !410, size: 16, offset: 2208)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !771, file: !772, line: 348, baseType: !410, size: 16, offset: 2224)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !771, file: !772, line: 349, baseType: !412, size: 32, offset: 2240)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "nodetype", scope: !771, file: !772, line: 351, baseType: !412, size: 32, offset: 2272)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "edit_quality", scope: !771, file: !772, line: 353, baseType: !410, size: 16, offset: 2304)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "render_quality", scope: !771, file: !772, line: 354, baseType: !410, size: 16, offset: 2320)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "chunksize", scope: !771, file: !772, line: 355, baseType: !412, size: 32, offset: 2336)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "viewer_border", scope: !771, file: !772, line: 357, baseType: !801, size: 128, offset: 2368)
!801 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !802, line: 95, baseType: !803)
!802 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!803 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !802, line: 92, size: 128, elements: !804)
!804 = !{!805, !806, !807, !808}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !803, file: !802, line: 93, baseType: !370, size: 32)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !803, file: !802, line: 93, baseType: !370, size: 32, offset: 32)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !803, file: !802, line: 94, baseType: !370, size: 32, offset: 64)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !803, file: !802, line: 94, baseType: !370, size: 32, offset: 96)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !771, file: !772, line: 363, baseType: !437, size: 128, offset: 2496)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !771, file: !772, line: 363, baseType: !437, size: 128, offset: 2624)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "previews", scope: !771, file: !772, line: 368, baseType: !812, size: 64, offset: 2752)
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !813, size: 64)
!813 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHash", file: !772, line: 48, flags: DIFlagFwdDecl)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "active_viewer_key", scope: !771, file: !772, line: 372, baseType: !815, size: 32, offset: 2816)
!815 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !772, line: 274, baseType: !816)
!816 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !772, line: 271, size: 32, elements: !817)
!817 = !{!818}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !816, file: !772, line: 273, baseType: !7, size: 32)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !771, file: !772, line: 373, baseType: !412, size: 32, offset: 2848)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "execdata", scope: !771, file: !772, line: 382, baseType: !821, size: 64, offset: 2880)
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !822, size: 64)
!822 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeExec", file: !772, line: 46, flags: DIFlagFwdDecl)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !771, file: !772, line: 385, baseType: !824, size: 64, offset: 2944)
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !825, size: 64)
!825 = !DISubroutineType(types: !826)
!826 = !{null, !368, !370}
!827 = !DIDerivedType(tag: DW_TAG_member, name: "stats_draw", scope: !771, file: !772, line: 386, baseType: !828, size: 64, offset: 3008)
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !829, size: 64)
!829 = !DISubroutineType(types: !830)
!830 = !{null, !368, !590}
!831 = !DIDerivedType(tag: DW_TAG_member, name: "test_break", scope: !771, file: !772, line: 387, baseType: !832, size: 64, offset: 3072)
!832 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !833, size: 64)
!833 = !DISubroutineType(types: !834)
!834 = !{!412, !368}
!835 = !DIDerivedType(tag: DW_TAG_member, name: "update_draw", scope: !771, file: !772, line: 388, baseType: !836, size: 64, offset: 3136)
!836 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !837, size: 64)
!837 = !DISubroutineType(types: !838)
!838 = !{null, !368}
!839 = !DIDerivedType(tag: DW_TAG_member, name: "tbh", scope: !771, file: !772, line: 389, baseType: !368, size: 64, offset: 3200)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "prh", scope: !771, file: !772, line: 389, baseType: !368, size: 64, offset: 3264)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "sdh", scope: !771, file: !772, line: 389, baseType: !368, size: 64, offset: 3328)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "udh", scope: !771, file: !772, line: 389, baseType: !368, size: 64, offset: 3392)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !733, file: !561, line: 1244, baseType: !844, size: 64, offset: 2048)
!844 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !845, size: 64)
!845 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !846, line: 200, size: 17024, elements: !847)
!846 = !DIFile(filename: "blender/source/blender/makesdna/DNA_sequence_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!847 = !{!848, !849, !850, !851, !1263, !1264, !1265, !1266, !1267, !1268, !1269}
!848 = !DIDerivedType(tag: DW_TAG_member, name: "seqbasep", scope: !845, file: !846, line: 201, baseType: !714, size: 64)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !845, file: !846, line: 202, baseType: !437, size: 128, offset: 64)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "metastack", scope: !845, file: !846, line: 203, baseType: !437, size: 128, offset: 192)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "act_seq", scope: !845, file: !846, line: 206, baseType: !852, size: 64, offset: 320)
!852 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !853, size: 64)
!853 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sequence", file: !846, line: 190, baseType: !854)
!854 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sequence", file: !846, line: 126, size: 2816, elements: !855)
!855 = !{!856, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !954, !955, !956, !957, !1235, !1238, !1239, !1240, !1241, !1242, !1243, !1244, !1245, !1248, !1249, !1250, !1251, !1252, !1253, !1254, !1255, !1256, !1257, !1258, !1259, !1260, !1262}
!856 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !854, file: !846, line: 127, baseType: !857, size: 64)
!857 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !854, size: 64)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !854, file: !846, line: 127, baseType: !857, size: 64, offset: 64)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !854, file: !846, line: 128, baseType: !368, size: 64, offset: 128)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !854, file: !846, line: 129, baseType: !368, size: 64, offset: 192)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !854, file: !846, line: 130, baseType: !427, size: 512, offset: 256)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !854, file: !846, line: 132, baseType: !412, size: 32, offset: 768)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !854, file: !846, line: 132, baseType: !412, size: 32, offset: 800)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !854, file: !846, line: 133, baseType: !412, size: 32, offset: 832)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !854, file: !846, line: 134, baseType: !412, size: 32, offset: 864)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "startofs", scope: !854, file: !846, line: 134, baseType: !412, size: 32, offset: 896)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "endofs", scope: !854, file: !846, line: 134, baseType: !412, size: 32, offset: 928)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !854, file: !846, line: 135, baseType: !412, size: 32, offset: 960)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !854, file: !846, line: 135, baseType: !412, size: 32, offset: 992)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !854, file: !846, line: 136, baseType: !412, size: 32, offset: 1024)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !854, file: !846, line: 136, baseType: !412, size: 32, offset: 1056)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "startdisp", scope: !854, file: !846, line: 137, baseType: !412, size: 32, offset: 1088)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "enddisp", scope: !854, file: !846, line: 137, baseType: !412, size: 32, offset: 1120)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "sat", scope: !854, file: !846, line: 138, baseType: !370, size: 32, offset: 1152)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "mul", scope: !854, file: !846, line: 139, baseType: !370, size: 32, offset: 1184)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "handsize", scope: !854, file: !846, line: 139, baseType: !370, size: 32, offset: 1216)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "anim_preseek", scope: !854, file: !846, line: 141, baseType: !410, size: 16, offset: 1248)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "streamindex", scope: !854, file: !846, line: 142, baseType: !410, size: 16, offset: 1264)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "multicam_source", scope: !854, file: !846, line: 143, baseType: !412, size: 32, offset: 1280)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "clip_flag", scope: !854, file: !846, line: 144, baseType: !412, size: 32, offset: 1312)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "strip", scope: !854, file: !846, line: 146, baseType: !882, size: 64, offset: 1344)
!882 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !883, size: 64)
!883 = !DIDerivedType(tag: DW_TAG_typedef, name: "Strip", file: !846, line: 114, baseType: !884)
!884 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Strip", file: !846, line: 99, size: 7232, elements: !885)
!885 = !{!886, !888, !889, !890, !891, !892, !893, !904, !908, !922, !931, !938, !948}
!886 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !884, file: !846, line: 100, baseType: !887, size: 64)
!887 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !884, size: 64)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !884, file: !846, line: 100, baseType: !887, size: 64, offset: 64)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !884, file: !846, line: 101, baseType: !412, size: 32, offset: 128)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !884, file: !846, line: 101, baseType: !412, size: 32, offset: 160)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !884, file: !846, line: 102, baseType: !412, size: 32, offset: 192)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !884, file: !846, line: 102, baseType: !412, size: 32, offset: 224)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "stripdata", scope: !884, file: !846, line: 103, baseType: !894, size: 64, offset: 256)
!894 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !895, size: 64)
!895 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripElem", file: !846, line: 59, baseType: !896)
!896 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripElem", file: !846, line: 56, size: 2112, elements: !897)
!897 = !{!898, !902, !903}
!898 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !896, file: !846, line: 57, baseType: !899, size: 2048)
!899 = !DICompositeType(tag: DW_TAG_array_type, baseType: !397, size: 2048, elements: !900)
!900 = !{!901}
!901 = !DISubrange(count: 256)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "orig_width", scope: !896, file: !846, line: 58, baseType: !412, size: 32, offset: 2048)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "orig_height", scope: !896, file: !846, line: 58, baseType: !412, size: 32, offset: 2080)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !884, file: !846, line: 106, baseType: !905, size: 6144, offset: 320)
!905 = !DICompositeType(tag: DW_TAG_array_type, baseType: !397, size: 6144, elements: !906)
!906 = !{!907}
!907 = !DISubrange(count: 768)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !884, file: !846, line: 107, baseType: !909, size: 64, offset: 6464)
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 64)
!910 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripProxy", file: !846, line: 97, baseType: !911)
!911 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripProxy", file: !846, line: 83, size: 8320, elements: !912)
!912 = !{!913, !914, !915, !918, !919, !920, !921}
!913 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !911, file: !846, line: 84, baseType: !905, size: 6144)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !911, file: !846, line: 87, baseType: !899, size: 2048, offset: 6144)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !911, file: !846, line: 88, baseType: !916, size: 64, offset: 8192)
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 64)
!917 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !728, line: 41, flags: DIFlagFwdDecl)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !911, file: !846, line: 90, baseType: !410, size: 16, offset: 8256)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !911, file: !846, line: 92, baseType: !410, size: 16, offset: 8272)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flags", scope: !911, file: !846, line: 93, baseType: !410, size: 16, offset: 8288)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flags", scope: !911, file: !846, line: 95, baseType: !410, size: 16, offset: 8304)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !884, file: !846, line: 108, baseType: !923, size: 64, offset: 6528)
!923 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !924, size: 64)
!924 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripCrop", file: !846, line: 66, baseType: !925)
!925 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripCrop", file: !846, line: 61, size: 128, elements: !926)
!926 = !{!927, !928, !929, !930}
!927 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !925, file: !846, line: 62, baseType: !412, size: 32)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !925, file: !846, line: 63, baseType: !412, size: 32, offset: 32)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !925, file: !846, line: 64, baseType: !412, size: 32, offset: 64)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !925, file: !846, line: 65, baseType: !412, size: 32, offset: 96)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !884, file: !846, line: 109, baseType: !932, size: 64, offset: 6592)
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 64)
!933 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripTransform", file: !846, line: 71, baseType: !934)
!934 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripTransform", file: !846, line: 68, size: 64, elements: !935)
!935 = !{!936, !937}
!936 = !DIDerivedType(tag: DW_TAG_member, name: "xofs", scope: !934, file: !846, line: 69, baseType: !412, size: 32)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "yofs", scope: !934, file: !846, line: 70, baseType: !412, size: 32, offset: 32)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "color_balance", scope: !884, file: !846, line: 110, baseType: !939, size: 64, offset: 6656)
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 64)
!940 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripColorBalance", file: !846, line: 81, baseType: !941)
!941 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripColorBalance", file: !846, line: 73, size: 352, elements: !942)
!942 = !{!943, !944, !945, !946, !947}
!943 = !DIDerivedType(tag: DW_TAG_member, name: "lift", scope: !941, file: !846, line: 74, baseType: !528, size: 96)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !941, file: !846, line: 75, baseType: !528, size: 96, offset: 96)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "gain", scope: !941, file: !846, line: 76, baseType: !528, size: 96, offset: 192)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !941, file: !846, line: 77, baseType: !412, size: 32, offset: 288)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !941, file: !846, line: 78, baseType: !412, size: 32, offset: 320)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !884, file: !846, line: 113, baseType: !949, size: 512, offset: 6720)
!949 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !950, line: 182, baseType: !951)
!950 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!951 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !950, line: 180, size: 512, elements: !952)
!952 = !{!953}
!953 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !951, file: !950, line: 181, baseType: !427, size: 512)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !854, file: !846, line: 148, baseType: !465, size: 64, offset: 1408)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !854, file: !846, line: 151, baseType: !732, size: 64, offset: 1472)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "scene_camera", scope: !854, file: !846, line: 152, baseType: !468, size: 64, offset: 1536)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "clip", scope: !854, file: !846, line: 153, baseType: !958, size: 64, offset: 1600)
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64)
!959 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClip", file: !960, line: 64, size: 19136, elements: !961)
!960 = !DIFile(filename: "blender/source/blender/makesdna/DNA_movieclip_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!961 = !{!962, !963, !964, !965, !966, !967, !969, !970, !971, !972, !975, !976, !1221, !1222, !1230, !1231, !1232, !1233, !1234}
!962 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !959, file: !960, line: 65, baseType: !377, size: 960)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !959, file: !960, line: 66, baseType: !448, size: 64, offset: 960)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !959, file: !960, line: 68, baseType: !396, size: 8192, offset: 1024)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !959, file: !960, line: 70, baseType: !412, size: 32, offset: 9216)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !959, file: !960, line: 71, baseType: !412, size: 32, offset: 9248)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "lastsize", scope: !959, file: !960, line: 72, baseType: !968, size: 64, offset: 9280)
!968 = !DICompositeType(tag: DW_TAG_array_type, baseType: !412, size: 64, elements: !723)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !959, file: !960, line: 74, baseType: !370, size: 32, offset: 9344)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !959, file: !960, line: 74, baseType: !370, size: 32, offset: 9376)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !959, file: !960, line: 76, baseType: !916, size: 64, offset: 9408)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !959, file: !960, line: 77, baseType: !973, size: 64, offset: 9472)
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64)
!974 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipCache", file: !960, line: 77, flags: DIFlagFwdDecl)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !959, file: !960, line: 78, baseType: !559, size: 64, offset: 9536)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "tracking", scope: !959, file: !960, line: 80, baseType: !977, size: 2624, offset: 9600)
!977 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTracking", file: !978, line: 340, size: 2624, elements: !979)
!978 = !DIFile(filename: "blender/source/blender/makesdna/DNA_tracking_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!979 = !{!980, !1008, !1026, !1027, !1028, !1043, !1101, !1102, !1201, !1202, !1203, !1204, !1210}
!980 = !DIDerivedType(tag: DW_TAG_member, name: "settings", scope: !977, file: !978, line: 341, baseType: !981, size: 576)
!981 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingSettings", file: !978, line: 251, baseType: !982)
!982 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingSettings", file: !978, line: 207, size: 576, elements: !983)
!983 = !{!984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007}
!984 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !982, file: !978, line: 208, baseType: !412, size: 32)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "default_motion_model", scope: !982, file: !978, line: 211, baseType: !410, size: 16, offset: 32)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "default_algorithm_flag", scope: !982, file: !978, line: 212, baseType: !410, size: 16, offset: 48)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "default_minimum_correlation", scope: !982, file: !978, line: 213, baseType: !370, size: 32, offset: 64)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_size", scope: !982, file: !978, line: 214, baseType: !410, size: 16, offset: 96)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "default_search_size", scope: !982, file: !978, line: 215, baseType: !410, size: 16, offset: 112)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "default_frames_limit", scope: !982, file: !978, line: 216, baseType: !410, size: 16, offset: 128)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "default_margin", scope: !982, file: !978, line: 217, baseType: !410, size: 16, offset: 144)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_match", scope: !982, file: !978, line: 218, baseType: !410, size: 16, offset: 160)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "default_flag", scope: !982, file: !978, line: 219, baseType: !410, size: 16, offset: 176)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "default_weight", scope: !982, file: !978, line: 220, baseType: !370, size: 32, offset: 192)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "motion_flag", scope: !982, file: !978, line: 222, baseType: !410, size: 16, offset: 224)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "speed", scope: !982, file: !978, line: 225, baseType: !410, size: 16, offset: 240)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe1", scope: !982, file: !978, line: 228, baseType: !412, size: 32, offset: 256)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe2", scope: !982, file: !978, line: 229, baseType: !412, size: 32, offset: 288)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction_flag", scope: !982, file: !978, line: 233, baseType: !412, size: 32, offset: 320)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "refine_camera_intrinsics", scope: !982, file: !978, line: 236, baseType: !410, size: 16, offset: 352)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !982, file: !978, line: 236, baseType: !410, size: 16, offset: 368)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !982, file: !978, line: 241, baseType: !370, size: 32, offset: 384)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "clean_frames", scope: !982, file: !978, line: 244, baseType: !412, size: 32, offset: 416)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "clean_action", scope: !982, file: !978, line: 244, baseType: !412, size: 32, offset: 448)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "clean_error", scope: !982, file: !978, line: 245, baseType: !370, size: 32, offset: 480)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "object_distance", scope: !982, file: !978, line: 248, baseType: !370, size: 32, offset: 512)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !982, file: !978, line: 250, baseType: !412, size: 32, offset: 544)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !977, file: !978, line: 342, baseType: !1009, size: 448, offset: 576)
!1009 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingCamera", file: !978, line: 79, baseType: !1010)
!1010 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingCamera", file: !978, line: 61, size: 448, elements: !1011)
!1011 = !{!1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025}
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "intrinsics", scope: !1010, file: !978, line: 62, baseType: !368, size: 64)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_model", scope: !1010, file: !978, line: 64, baseType: !410, size: 16, offset: 64)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1010, file: !978, line: 65, baseType: !410, size: 16, offset: 80)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "sensor_width", scope: !1010, file: !978, line: 67, baseType: !370, size: 32, offset: 96)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_aspect", scope: !1010, file: !978, line: 68, baseType: !370, size: 32, offset: 128)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "focal", scope: !1010, file: !978, line: 69, baseType: !370, size: 32, offset: 160)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !1010, file: !978, line: 70, baseType: !410, size: 16, offset: 192)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !1010, file: !978, line: 71, baseType: !410, size: 16, offset: 208)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "principal", scope: !1010, file: !978, line: 72, baseType: !722, size: 64, offset: 224)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "k1", scope: !1010, file: !978, line: 75, baseType: !370, size: 32, offset: 288)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "k2", scope: !1010, file: !978, line: 75, baseType: !370, size: 32, offset: 320)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "k3", scope: !1010, file: !978, line: 75, baseType: !370, size: 32, offset: 352)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "division_k1", scope: !1010, file: !978, line: 78, baseType: !370, size: 32, offset: 384)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "division_k2", scope: !1010, file: !978, line: 78, baseType: !370, size: 32, offset: 416)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "tracks", scope: !977, file: !978, line: 343, baseType: !437, size: 128, offset: 1024)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "plane_tracks", scope: !977, file: !978, line: 344, baseType: !437, size: 128, offset: 1152)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction", scope: !977, file: !978, line: 345, baseType: !1029, size: 192, offset: 1280)
!1029 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingReconstruction", file: !978, line: 278, baseType: !1030)
!1030 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingReconstruction", file: !978, line: 270, size: 192, elements: !1031)
!1031 = !{!1032, !1033, !1034, !1035, !1036}
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1030, file: !978, line: 271, baseType: !412, size: 32)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1030, file: !978, line: 273, baseType: !370, size: 32, offset: 32)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "last_camera", scope: !1030, file: !978, line: 275, baseType: !412, size: 32, offset: 64)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "camnr", scope: !1030, file: !978, line: 276, baseType: !412, size: 32, offset: 96)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "cameras", scope: !1030, file: !978, line: 277, baseType: !1037, size: 64, offset: 128)
!1037 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1038, size: 64)
!1038 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieReconstructedCamera", file: !978, line: 55, size: 576, elements: !1039)
!1039 = !{!1040, !1041, !1042}
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !1038, file: !978, line: 56, baseType: !412, size: 32)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1038, file: !978, line: 57, baseType: !370, size: 32, offset: 32)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !1038, file: !978, line: 58, baseType: !611, size: 512, offset: 64)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "stabilization", scope: !977, file: !978, line: 346, baseType: !1044, size: 384, offset: 1472)
!1044 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStabilization", file: !978, line: 268, baseType: !1045)
!1045 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStabilization", file: !978, line: 253, size: 384, elements: !1046)
!1046 = !{!1047, !1048, !1049, !1050, !1051, !1095, !1096, !1097, !1098, !1099, !1100}
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1045, file: !978, line: 254, baseType: !412, size: 32)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "tot_track", scope: !1045, file: !978, line: 255, baseType: !412, size: 32, offset: 32)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !1045, file: !978, line: 255, baseType: !412, size: 32, offset: 64)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "maxscale", scope: !1045, file: !978, line: 258, baseType: !370, size: 32, offset: 96)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "rot_track", scope: !1045, file: !978, line: 259, baseType: !1052, size: 64, offset: 128)
!1052 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1053, size: 64)
!1053 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingTrack", file: !978, line: 164, baseType: !1054)
!1054 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingTrack", file: !978, line: 108, size: 1664, elements: !1055)
!1055 = !{!1056, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094}
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1054, file: !978, line: 109, baseType: !1057, size: 64)
!1057 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1054, size: 64)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1054, file: !978, line: 109, baseType: !1057, size: 64, offset: 64)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1054, file: !978, line: 111, baseType: !427, size: 512, offset: 128)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "pat_min", scope: !1054, file: !978, line: 119, baseType: !722, size: 64, offset: 640)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "pat_max", scope: !1054, file: !978, line: 119, baseType: !722, size: 64, offset: 704)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !1054, file: !978, line: 125, baseType: !722, size: 64, offset: 768)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !1054, file: !978, line: 125, baseType: !722, size: 64, offset: 832)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1054, file: !978, line: 127, baseType: !722, size: 64, offset: 896)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !1054, file: !978, line: 130, baseType: !412, size: 32, offset: 960)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !1054, file: !978, line: 131, baseType: !412, size: 32, offset: 992)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !1054, file: !978, line: 132, baseType: !1068, size: 64, offset: 1024)
!1068 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1069, size: 64)
!1069 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingMarker", file: !978, line: 106, baseType: !1070)
!1070 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingMarker", file: !978, line: 81, size: 512, elements: !1071)
!1071 = !{!1072, !1073, !1076, !1077, !1078, !1079}
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1070, file: !978, line: 82, baseType: !722, size: 64)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_corners", scope: !1070, file: !978, line: 97, baseType: !1074, size: 256, offset: 64)
!1074 = !DICompositeType(tag: DW_TAG_array_type, baseType: !370, size: 256, elements: !1075)
!1075 = !{!604, !724}
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !1070, file: !978, line: 102, baseType: !722, size: 64, offset: 320)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !1070, file: !978, line: 102, baseType: !722, size: 64, offset: 384)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !1070, file: !978, line: 104, baseType: !412, size: 32, offset: 448)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1070, file: !978, line: 105, baseType: !412, size: 32, offset: 480)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "bundle_pos", scope: !1054, file: !978, line: 135, baseType: !528, size: 96, offset: 1088)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1054, file: !978, line: 136, baseType: !370, size: 32, offset: 1184)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1054, file: !978, line: 139, baseType: !412, size: 32, offset: 1216)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "pat_flag", scope: !1054, file: !978, line: 139, baseType: !412, size: 32, offset: 1248)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "search_flag", scope: !1054, file: !978, line: 139, baseType: !412, size: 32, offset: 1280)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !1054, file: !978, line: 140, baseType: !528, size: 96, offset: 1312)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "frames_limit", scope: !1054, file: !978, line: 143, baseType: !410, size: 16, offset: 1408)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !1054, file: !978, line: 144, baseType: !410, size: 16, offset: 1424)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_match", scope: !1054, file: !978, line: 145, baseType: !410, size: 16, offset: 1440)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "motion_model", scope: !1054, file: !978, line: 148, baseType: !410, size: 16, offset: 1456)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm_flag", scope: !1054, file: !978, line: 149, baseType: !412, size: 32, offset: 1472)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "minimum_correlation", scope: !1054, file: !978, line: 150, baseType: !370, size: 32, offset: 1504)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !1054, file: !978, line: 152, baseType: !559, size: 64, offset: 1536)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !1054, file: !978, line: 163, baseType: !370, size: 32, offset: 1600)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1054, file: !978, line: 163, baseType: !370, size: 32, offset: 1632)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "locinf", scope: !1045, file: !978, line: 261, baseType: !370, size: 32, offset: 192)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "scaleinf", scope: !1045, file: !978, line: 261, baseType: !370, size: 32, offset: 224)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "rotinf", scope: !1045, file: !978, line: 261, baseType: !370, size: 32, offset: 256)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1045, file: !978, line: 263, baseType: !412, size: 32, offset: 288)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !1045, file: !978, line: 266, baseType: !412, size: 32, offset: 320)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !1045, file: !978, line: 267, baseType: !370, size: 32, offset: 352)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !977, file: !978, line: 347, baseType: !1052, size: 64, offset: 1856)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "act_plane_track", scope: !977, file: !978, line: 348, baseType: !1103, size: 64, offset: 1920)
!1103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1104, size: 64)
!1104 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingPlaneTrack", file: !978, line: 205, baseType: !1105)
!1105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingPlaneTrack", file: !978, line: 186, size: 1024, elements: !1106)
!1106 = !{!1107, !1109, !1110, !1111, !1113, !1114, !1115, !1123, !1124, !1125, !1199, !1200}
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1105, file: !978, line: 187, baseType: !1108, size: 64)
!1108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1105, size: 64)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1105, file: !978, line: 187, baseType: !1108, size: 64, offset: 64)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1105, file: !978, line: 189, baseType: !427, size: 512, offset: 128)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "point_tracks", scope: !1105, file: !978, line: 191, baseType: !1112, size: 64, offset: 640)
!1112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1052, size: 64)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "point_tracksnr", scope: !1105, file: !978, line: 193, baseType: !412, size: 32, offset: 704)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1105, file: !978, line: 193, baseType: !412, size: 32, offset: 736)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !1105, file: !978, line: 195, baseType: !1116, size: 64, offset: 768)
!1116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1117, size: 64)
!1117 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingPlaneMarker", file: !978, line: 184, baseType: !1118)
!1118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingPlaneMarker", file: !978, line: 166, size: 320, elements: !1119)
!1119 = !{!1120, !1121, !1122}
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "corners", scope: !1118, file: !978, line: 180, baseType: !1074, size: 256)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !1118, file: !978, line: 182, baseType: !412, size: 32, offset: 256)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1118, file: !978, line: 183, baseType: !412, size: 32, offset: 288)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !1105, file: !978, line: 196, baseType: !412, size: 32, offset: 832)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1105, file: !978, line: 198, baseType: !412, size: 32, offset: 864)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "image", scope: !1105, file: !978, line: 200, baseType: !1126, size: 64, offset: 896)
!1126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1127, size: 64)
!1127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !728, line: 77, size: 15424, elements: !1128)
!1128 = !{!1129, !1130, !1131, !1134, !1137, !1138, !1141, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1160, !1161, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1193}
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1127, file: !728, line: 78, baseType: !377, size: 960)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1127, file: !728, line: 80, baseType: !396, size: 8192, offset: 960)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !1127, file: !728, line: 82, baseType: !1132, size: 64, offset: 9152)
!1132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1133, size: 64)
!1133 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !728, line: 43, flags: DIFlagFwdDecl)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !1127, file: !728, line: 83, baseType: !1135, size: 64, offset: 9216)
!1135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1136, size: 64)
!1136 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !378, line: 46, flags: DIFlagFwdDecl)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !1127, file: !728, line: 86, baseType: !916, size: 64, offset: 9280)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !1127, file: !728, line: 87, baseType: !1139, size: 64, offset: 9344)
!1139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1140, size: 64)
!1140 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !728, line: 44, flags: DIFlagFwdDecl)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !1127, file: !728, line: 89, baseType: !1142, size: 512, offset: 9408)
!1142 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1139, size: 512, elements: !1143)
!1143 = !{!495}
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !1127, file: !728, line: 90, baseType: !410, size: 16, offset: 9920)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !1127, file: !728, line: 90, baseType: !410, size: 16, offset: 9936)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !1127, file: !728, line: 92, baseType: !410, size: 16, offset: 9952)
