; ModuleID = 'blender/source/blender/editors/sculpt_paint/sculpt_uv.c'
source_filename = "blender/source/blender/editors/sculpt_paint/sculpt_uv.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.EnumPropertyItem = type { i32, i8*, i32, i8*, i8* }
%struct.wmWindowManager = type { %struct.ID, %struct.wmWindow*, %struct.wmWindow*, %struct.ListBase, i32, i16, i16, %struct.ListBase, %struct.ListBase, %struct.ReportList, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.wmKeyConfig*, %struct.wmKeyConfig*, %struct.wmKeyConfig*, %struct.ListBase, %struct.wmTimer*, i8, [7 x i8] }
%struct.ID = type { i8*, i8*, %struct.ID*, %struct.Library*, [66 x i8], i16, i32, i32, i32, %struct.IDProperty* }
%struct.Library = type { %struct.ID, %struct.ID*, %struct.FileData*, [1024 x i8], [1024 x i8], %struct.Library*, %struct.PackedFile* }
%struct.FileData = type opaque
%struct.PackedFile = type opaque
%struct.IDProperty = type { %struct.IDProperty*, %struct.IDProperty*, i8, i8, i16, [64 x i8], i32, %struct.IDPropertyData, i32, i32 }
%struct.IDPropertyData = type { i8*, %struct.ListBase, i32, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "stroke_mode_items", scope: !2, file: !3, line: 903, type: !2866, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "SCULPT_OT_uv_sculpt_stroke", scope: !3, file: !3, line: 901, type: !4, scopeLine: 902, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2465, retainedNodes: !2865)
!3 = !DIFile(filename: "blender/source/blender/editors/sculpt_paint/sculpt_uv.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !DISubroutineType(types: !5)
!5 = !{null, !6}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "wmOperatorType", file: !8, line: 568, baseType: !9)
!8 = !DIFile(filename: "blender/source/blender/windowmanager/WM_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmOperatorType", file: !8, line: 508, size: 1536, elements: !10)
!10 = !{!11, !15, !16, !17, !18, !2391, !2395, !2401, !2405, !2406, !2410, !2411, !2412, !2413, !2417, !2418, !2433, !2434, !2438, !2464}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !9, file: !8, line: 509, baseType: !12, size: 64)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!13 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !14)
!14 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !9, file: !8, line: 510, baseType: !12, size: 64, offset: 64)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "translation_context", scope: !9, file: !8, line: 511, baseType: !12, size: 64, offset: 128)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !9, file: !8, line: 512, baseType: !12, size: 64, offset: 192)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !9, file: !8, line: 518, baseType: !19, size: 64, offset: 256)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!20 = !DISubroutineType(types: !21)
!21 = !{!22, !23, !26}
!22 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!24 = !DICompositeType(tag: DW_TAG_structure_type, name: "bContext", file: !25, line: 38, flags: DIFlagFwdDecl)
!25 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_paint.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!27 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmOperator", file: !28, line: 328, size: 1344, elements: !29)
!28 = !DIFile(filename: "blender/source/blender/makesdna/DNA_windowmanager_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!29 = !{!30, !31, !32, !36, !68, !70, !71, !72, !85, !2384, !2385, !2386, !2389, !2390}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !27, file: !28, line: 329, baseType: !26, size: 64)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !27, file: !28, line: 329, baseType: !26, size: 64, offset: 64)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !27, file: !28, line: 332, baseType: !33, size: 512, offset: 128)
!33 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 512, elements: !34)
!34 = !{!35}
!35 = !DISubrange(count: 64)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !27, file: !28, line: 333, baseType: !37, size: 64, offset: 640)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !39, line: 75, baseType: !40)
!39 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!40 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !39, line: 62, size: 1024, elements: !41)
!41 = !{!42, !44, !45, !46, !47, !49, !50, !51, !66, !67}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !40, file: !39, line: 63, baseType: !43, size: 64)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !40, file: !39, line: 63, baseType: !43, size: 64, offset: 64)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !40, file: !39, line: 64, baseType: !14, size: 8, offset: 128)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !40, file: !39, line: 64, baseType: !14, size: 8, offset: 136)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !40, file: !39, line: 65, baseType: !48, size: 16, offset: 144)
!48 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !40, file: !39, line: 66, baseType: !33, size: 512, offset: 160)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !40, file: !39, line: 67, baseType: !22, size: 32, offset: 672)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !40, file: !39, line: 69, baseType: !52, size: 256, offset: 704)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !39, line: 60, baseType: !53)
!53 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !39, line: 48, size: 256, elements: !54)
!54 = !{!55, !57, !64, !65}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !53, file: !39, line: 49, baseType: !56, size: 64)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !53, file: !39, line: 58, baseType: !58, size: 128, offset: 64)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !59, line: 71, baseType: !60)
!59 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!60 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !59, line: 69, size: 128, elements: !61)
!61 = !{!62, !63}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !60, file: !59, line: 70, baseType: !56, size: 64)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !60, file: !59, line: 70, baseType: !56, size: 64, offset: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !53, file: !39, line: 59, baseType: !22, size: 32, offset: 192)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !53, file: !39, line: 59, baseType: !22, size: 32, offset: 224)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !40, file: !39, line: 70, baseType: !22, size: 32, offset: 960)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !40, file: !39, line: 74, baseType: !22, size: 32, offset: 992)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !27, file: !28, line: 336, baseType: !69, size: 64, offset: 704)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "customdata", scope: !27, file: !28, line: 337, baseType: !56, size: 64, offset: 768)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "py_instance", scope: !27, file: !28, line: 338, baseType: !56, size: 64, offset: 832)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !27, file: !28, line: 340, baseType: !73, size: 64, offset: 896)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PointerRNA", file: !75, line: 55, size: 192, elements: !76)
!75 = !DIFile(filename: "blender/source/blender/makesrna/RNA_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!76 = !{!77, !81, !84}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !74, file: !75, line: 58, baseType: !78, size: 64)
!78 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !74, file: !75, line: 56, size: 64, elements: !79)
!79 = !{!80}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !78, file: !75, line: 57, baseType: !56, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !74, file: !75, line: 60, baseType: !82, size: 64, offset: 64)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!83 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !75, line: 41, flags: DIFlagFwdDecl)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !74, file: !75, line: 61, baseType: !56, size: 64, offset: 128)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "reports", scope: !27, file: !28, line: 341, baseType: !86, size: 64, offset: 960)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ReportList", file: !28, line: 106, size: 320, elements: !88)
!88 = !{!89, !90, !91, !92, !93, !94}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !87, file: !28, line: 107, baseType: !58, size: 128)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "printlevel", scope: !87, file: !28, line: 108, baseType: !22, size: 32, offset: 128)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "storelevel", scope: !87, file: !28, line: 109, baseType: !22, size: 32, offset: 160)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !87, file: !28, line: 110, baseType: !22, size: 32, offset: 192)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !87, file: !28, line: 110, baseType: !22, size: 32, offset: 224)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "reporttimer", scope: !87, file: !28, line: 111, baseType: !95, size: 64, offset: 256)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTimer", file: !8, line: 490, size: 768, elements: !97)
!97 = !{!98, !99, !100, !2375, !2376, !2377, !2378, !2379, !2380, !2381, !2382, !2383}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !96, file: !8, line: 491, baseType: !95, size: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !96, file: !8, line: 491, baseType: !95, size: 64, offset: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "win", scope: !96, file: !8, line: 493, baseType: !101, size: 64, offset: 128)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindow", file: !28, line: 169, size: 2048, elements: !103)
!103 = !{!104, !105, !106, !107, !2292, !2293, !2294, !2295, !2296, !2297, !2298, !2299, !2300, !2301, !2302, !2303, !2304, !2305, !2306, !2307, !2308, !2309, !2350, !2353, !2367, !2368, !2369, !2370, !2371, !2372, !2373, !2374}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !102, file: !28, line: 170, baseType: !101, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !102, file: !28, line: 170, baseType: !101, size: 64, offset: 64)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "ghostwin", scope: !102, file: !28, line: 172, baseType: !56, size: 64, offset: 128)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !102, file: !28, line: 174, baseType: !108, size: 64, offset: 192)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !110, line: 49, size: 1984, elements: !111)
!110 = !DIFile(filename: "blender/source/blender/makesdna/DNA_screen_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!111 = !{!112, !148, !149, !150, !151, !152, !2275, !2276, !2277, !2278, !2279, !2280, !2281, !2282, !2283, !2284, !2285, !2286, !2287, !2288, !2289, !2290, !2291}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !109, file: !110, line: 50, baseType: !113, size: 960)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !39, line: 130, baseType: !114)
!114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !39, line: 117, size: 960, elements: !115)
!115 = !{!116, !117, !118, !120, !139, !143, !144, !145, !146, !147}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !114, file: !39, line: 118, baseType: !56, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !114, file: !39, line: 118, baseType: !56, size: 64, offset: 64)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !114, file: !39, line: 119, baseType: !119, size: 64, offset: 128)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !114, file: !39, line: 120, baseType: !121, size: 64, offset: 192)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !39, line: 136, size: 17600, elements: !123)
!123 = !{!124, !125, !127, !130, !134, !135, !136}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !122, file: !39, line: 137, baseType: !113, size: 960)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !122, file: !39, line: 138, baseType: !126, size: 64, offset: 960)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !122, file: !39, line: 139, baseType: !128, size: 64, offset: 1024)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !39, line: 43, flags: DIFlagFwdDecl)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !122, file: !39, line: 140, baseType: !131, size: 8192, offset: 1088)
!131 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 8192, elements: !132)
!132 = !{!133}
!133 = !DISubrange(count: 1024)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !122, file: !39, line: 141, baseType: !131, size: 8192, offset: 9280)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !122, file: !39, line: 148, baseType: !121, size: 64, offset: 17472)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !122, file: !39, line: 150, baseType: !137, size: 64, offset: 17536)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !39, line: 45, flags: DIFlagFwdDecl)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !114, file: !39, line: 121, baseType: !140, size: 528, offset: 256)
!140 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 528, elements: !141)
!141 = !{!142}
!142 = !DISubrange(count: 66)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !114, file: !39, line: 126, baseType: !48, size: 16, offset: 784)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !114, file: !39, line: 127, baseType: !22, size: 32, offset: 800)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !114, file: !39, line: 128, baseType: !22, size: 32, offset: 832)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !114, file: !39, line: 128, baseType: !22, size: 32, offset: 864)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !114, file: !39, line: 129, baseType: !37, size: 64, offset: 896)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "vertbase", scope: !109, file: !110, line: 52, baseType: !58, size: 128, offset: 960)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "edgebase", scope: !109, file: !110, line: 53, baseType: !58, size: 128, offset: 1088)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "areabase", scope: !109, file: !110, line: 54, baseType: !58, size: 128, offset: 1216)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !109, file: !110, line: 55, baseType: !58, size: 128, offset: 1344)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !109, file: !110, line: 57, baseType: !153, size: 64, offset: 1472)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !155, line: 1216, size: 39680, elements: !156)
!155 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!156 = !{!157, !158, !162, !770, !773, !774, !775, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !801, !872, !1299, !1901, !1904, !2151, !2163, !2164, !2165, !2166, !2167, !2168, !2169, !2170, !2173, !2174, !2175, !2176, !2177, !2185, !2251, !2258, !2259, !2266, !2267, !2268, !2269, !2270, !2271, !2272}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !154, file: !155, line: 1217, baseType: !113, size: 960)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !154, file: !155, line: 1218, baseType: !159, size: 64, offset: 960)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!160 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !161, line: 45, flags: DIFlagFwdDecl)
!161 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!162 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !154, file: !155, line: 1220, baseType: !163, size: 64, offset: 1024)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !165, line: 115, size: 11392, elements: !166)
!165 = !DIFile(filename: "blender/source/blender/makesdna/DNA_object_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!166 = !{!167, !168, !169, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !507, !517, !531, !532, !572, !573, !576, !577, !593, !594, !595, !596, !597, !598, !599, !603, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !619, !620, !621, !622, !623, !624, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !684, !685, !686, !687, !688, !689, !690, !691, !692, !695, !698, !701, !702, !703, !704, !705, !708, !711, !714, !715, !721, !722, !723, !724, !725, !726, !728, !731, !734, !738, !758, !759}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !164, file: !165, line: 116, baseType: !113, size: 960)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !164, file: !165, line: 117, baseType: !159, size: 64, offset: 960)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !164, file: !165, line: 119, baseType: !170, size: 64, offset: 1024)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SculptSession", file: !25, line: 155, size: 1856, elements: !172)
!172 = !{!173, !176, !190, !199, !206, !207, !208, !210, !213, !215, !224, !455, !456, !457, !459, !462, !465, !466, !467, !468, !469, !473, !474, !475, !477, !478, !482, !483, !486, !489, !490, !491, !492}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "multires", scope: !171, file: !25, line: 157, baseType: !174, size: 64)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!175 = !DICompositeType(tag: DW_TAG_structure_type, name: "MultiresModifierData", file: !25, line: 157, flags: DIFlagFwdDecl)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "mvert", scope: !171, file: !25, line: 158, baseType: !177, size: 64, offset: 64)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!178 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MVert", file: !179, line: 65, size: 160, elements: !180)
!179 = !DIFile(filename: "blender/source/blender/makesdna/DNA_meshdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!180 = !{!181, !186, !188, !189}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !178, file: !179, line: 66, baseType: !182, size: 96)
!182 = !DICompositeType(tag: DW_TAG_array_type, baseType: !183, size: 96, elements: !184)
!183 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!184 = !{!185}
!185 = !DISubrange(count: 3)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !178, file: !179, line: 67, baseType: !187, size: 48, offset: 96)
!187 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 48, elements: !184)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !178, file: !179, line: 68, baseType: !14, size: 8, offset: 144)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "bweight", scope: !178, file: !179, line: 68, baseType: !14, size: 8, offset: 152)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "mpoly", scope: !171, file: !25, line: 159, baseType: !191, size: 64, offset: 128)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MPoly", file: !179, line: 79, size: 96, elements: !193)
!193 = !{!194, !195, !196, !197, !198}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "loopstart", scope: !192, file: !179, line: 81, baseType: !22, size: 32)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !192, file: !179, line: 82, baseType: !22, size: 32, offset: 32)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !192, file: !179, line: 83, baseType: !48, size: 16, offset: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !192, file: !179, line: 84, baseType: !14, size: 8, offset: 80)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !192, file: !179, line: 84, baseType: !14, size: 8, offset: 88)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "mloop", scope: !171, file: !25, line: 160, baseType: !200, size: 64, offset: 192)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!201 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MLoop", file: !179, line: 88, size: 64, elements: !202)
!202 = !{!203, !205}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !201, file: !179, line: 89, baseType: !204, size: 32)
!204 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !201, file: !179, line: 90, baseType: !204, size: 32, offset: 32)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "totvert", scope: !171, file: !25, line: 161, baseType: !22, size: 32, offset: 256)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "totpoly", scope: !171, file: !25, line: 161, baseType: !22, size: 32, offset: 288)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "face_normals", scope: !171, file: !25, line: 162, baseType: !209, size: 64, offset: 320)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "kb", scope: !171, file: !25, line: 163, baseType: !211, size: 64, offset: 384)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!212 = !DICompositeType(tag: DW_TAG_structure_type, name: "KeyBlock", file: !25, line: 163, flags: DIFlagFwdDecl)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "vmask", scope: !171, file: !25, line: 164, baseType: !214, size: 64, offset: 448)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "pmap", scope: !171, file: !25, line: 167, baseType: !216, size: 64, offset: 512)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
!217 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !218)
!218 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MeshElemMap", file: !219, line: 96, size: 128, elements: !220)
!219 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_mesh_mapping.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!220 = !{!221, !223}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "indices", scope: !218, file: !219, line: 97, baseType: !222, size: 64)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !218, file: !219, line: 98, baseType: !22, size: 32, offset: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "bm", scope: !171, file: !25, line: 170, baseType: !225, size: 64, offset: 576)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!226 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMesh", file: !227, line: 186, size: 8064, elements: !228)
!227 = !DIFile(filename: "blender/source/blender/bmesh/bmesh_class.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!228 = !{!229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !242, !243, !244, !245, !306, !310, !314, !315, !316, !317, !318, !319, !320, !321, !411, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "totvert", scope: !226, file: !227, line: 187, baseType: !22, size: 32)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "totedge", scope: !226, file: !227, line: 187, baseType: !22, size: 32, offset: 32)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "totloop", scope: !226, file: !227, line: 187, baseType: !22, size: 32, offset: 64)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "totface", scope: !226, file: !227, line: 187, baseType: !22, size: 32, offset: 96)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "totvertsel", scope: !226, file: !227, line: 188, baseType: !22, size: 32, offset: 128)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "totedgesel", scope: !226, file: !227, line: 188, baseType: !22, size: 32, offset: 160)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "totfacesel", scope: !226, file: !227, line: 188, baseType: !22, size: 32, offset: 192)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "elem_index_dirty", scope: !226, file: !227, line: 193, baseType: !14, size: 8, offset: 224)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "elem_table_dirty", scope: !226, file: !227, line: 197, baseType: !14, size: 8, offset: 232)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "vpool", scope: !226, file: !227, line: 201, baseType: !239, size: 64, offset: 256)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!240 = !DICompositeType(tag: DW_TAG_structure_type, name: "BLI_mempool", file: !241, line: 71, flags: DIFlagFwdDecl)
!241 = !DIFile(filename: "blender/source/blender/makesdna/DNA_customdata_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!242 = !DIDerivedType(tag: DW_TAG_member, name: "epool", scope: !226, file: !227, line: 201, baseType: !239, size: 64, offset: 320)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "lpool", scope: !226, file: !227, line: 201, baseType: !239, size: 64, offset: 384)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "fpool", scope: !226, file: !227, line: 201, baseType: !239, size: 64, offset: 448)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !226, file: !227, line: 208, baseType: !246, size: 64, offset: 512)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMVert", file: !227, line: 103, baseType: !249)
!249 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMVert", file: !227, line: 90, size: 448, elements: !250)
!250 = !{!251, !260, !265, !266, !267}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !249, file: !227, line: 91, baseType: !252, size: 128)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMHeader", file: !227, line: 82, baseType: !253)
!253 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMHeader", file: !227, line: 64, size: 128, elements: !254)
!254 = !{!255, !256, !257, !258, !259}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !253, file: !227, line: 65, baseType: !56, size: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !253, file: !227, line: 66, baseType: !22, size: 32, offset: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "htype", scope: !253, file: !227, line: 73, baseType: !14, size: 8, offset: 96)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "hflag", scope: !253, file: !227, line: 74, baseType: !14, size: 8, offset: 104)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "api_flag", scope: !253, file: !227, line: 80, baseType: !14, size: 8, offset: 112)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !249, file: !227, line: 92, baseType: !261, size: 64, offset: 128)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!262 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFlagLayer", file: !227, line: 180, size: 16, elements: !263)
!263 = !{!264}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !262, file: !227, line: 181, baseType: !48, size: 16)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !249, file: !227, line: 94, baseType: !182, size: 96, offset: 192)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !249, file: !227, line: 95, baseType: !182, size: 96, offset: 288)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !249, file: !227, line: 102, baseType: !268, size: 64, offset: 384)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!269 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMEdge", file: !227, line: 110, size: 640, elements: !270)
!270 = !{!271, !272, !273, !275, !276, !299, !305}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !269, file: !227, line: 111, baseType: !252, size: 128)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !269, file: !227, line: 112, baseType: !261, size: 64, offset: 128)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !269, file: !227, line: 114, baseType: !274, size: 64, offset: 192)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !269, file: !227, line: 114, baseType: !274, size: 64, offset: 256)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !269, file: !227, line: 118, baseType: !277, size: 64, offset: 320)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!278 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMLoop", file: !227, line: 125, size: 576, elements: !279)
!279 = !{!280, !281, !282, !283, !295, !296, !297, !298}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !278, file: !227, line: 126, baseType: !252, size: 128)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !278, file: !227, line: 129, baseType: !274, size: 64, offset: 128)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !278, file: !227, line: 130, baseType: !268, size: 64, offset: 192)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !278, file: !227, line: 131, baseType: !284, size: 64, offset: 256)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64)
!285 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMFace", file: !227, line: 164, size: 448, elements: !286)
!286 = !{!287, !288, !289, !292, !293, !294}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !285, file: !227, line: 165, baseType: !252, size: 128)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "oflags", scope: !285, file: !227, line: 166, baseType: !261, size: 64, offset: 128)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "l_first", scope: !285, file: !227, line: 172, baseType: !290, size: 64, offset: 192)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMLoop", file: !227, line: 140, baseType: !278)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !285, file: !227, line: 174, baseType: !22, size: 32, offset: 256)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !285, file: !227, line: 175, baseType: !182, size: 96, offset: 288)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "mat_nr", scope: !285, file: !227, line: 176, baseType: !48, size: 16, offset: 384)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "radial_next", scope: !278, file: !227, line: 135, baseType: !277, size: 64, offset: 320)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "radial_prev", scope: !278, file: !227, line: 135, baseType: !277, size: 64, offset: 384)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !278, file: !227, line: 139, baseType: !277, size: 64, offset: 448)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !278, file: !227, line: 139, baseType: !277, size: 64, offset: 512)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "v1_disk_link", scope: !269, file: !227, line: 122, baseType: !300, size: 128, offset: 384)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMDiskLink", file: !227, line: 108, baseType: !301)
!301 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMDiskLink", file: !227, line: 106, size: 128, elements: !302)
!302 = !{!303, !304}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !301, file: !227, line: 107, baseType: !268, size: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !301, file: !227, line: 107, baseType: !268, size: 64, offset: 64)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "v2_disk_link", scope: !269, file: !227, line: 122, baseType: !300, size: 128, offset: 512)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "etable", scope: !226, file: !227, line: 209, baseType: !307, size: 64, offset: 576)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMEdge", file: !227, line: 123, baseType: !269)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "ftable", scope: !226, file: !227, line: 210, baseType: !311, size: 64, offset: 640)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMFace", file: !227, line: 178, baseType: !285)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "vtable_tot", scope: !226, file: !227, line: 213, baseType: !22, size: 32, offset: 704)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "etable_tot", scope: !226, file: !227, line: 214, baseType: !22, size: 32, offset: 736)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "ftable_tot", scope: !226, file: !227, line: 215, baseType: !22, size: 32, offset: 768)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "vtoolflagpool", scope: !226, file: !227, line: 218, baseType: !239, size: 64, offset: 832)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "etoolflagpool", scope: !226, file: !227, line: 218, baseType: !239, size: 64, offset: 896)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "ftoolflagpool", scope: !226, file: !227, line: 218, baseType: !239, size: 64, offset: 960)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "stackdepth", scope: !226, file: !227, line: 220, baseType: !22, size: 32, offset: 1024)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "currentop", scope: !226, file: !227, line: 221, baseType: !322, size: 64, offset: 1088)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!323 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOperator", file: !324, line: 190, size: 10496, elements: !325)
!324 = !DIFile(filename: "blender/source/blender/bmesh/intern/bmesh_operator_api.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!325 = !{!326, !390, !391, !397, !400, !401, !410}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "slots_in", scope: !323, file: !324, line: 191, baseType: !327, size: 5120)
!327 = !DICompositeType(tag: DW_TAG_array_type, baseType: !328, size: 5120, elements: !388)
!328 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BMOpSlot", file: !324, line: 147, size: 320, elements: !329)
!329 = !{!330, !331, !343, !373, !374}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "slot_name", scope: !328, file: !324, line: 148, baseType: !12, size: 64)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "slot_type", scope: !328, file: !324, line: 149, baseType: !332, size: 32, offset: 64)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotType", file: !324, line: 112, baseType: !333)
!333 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eBMOpSlotType", file: !324, line: 94, baseType: !204, size: 32, elements: !334)
!334 = !{!335, !336, !337, !338, !339, !340, !341, !342}
!335 = !DIEnumerator(name: "BMO_OP_SLOT_BOOL", value: 1, isUnsigned: true)
!336 = !DIEnumerator(name: "BMO_OP_SLOT_INT", value: 2, isUnsigned: true)
!337 = !DIEnumerator(name: "BMO_OP_SLOT_FLT", value: 3, isUnsigned: true)
!338 = !DIEnumerator(name: "BMO_OP_SLOT_PTR", value: 4, isUnsigned: true)
!339 = !DIEnumerator(name: "BMO_OP_SLOT_MAT", value: 5, isUnsigned: true)
!340 = !DIEnumerator(name: "BMO_OP_SLOT_VEC", value: 8, isUnsigned: true)
!341 = !DIEnumerator(name: "BMO_OP_SLOT_ELEMENT_BUF", value: 9, isUnsigned: true)
!342 = !DIEnumerator(name: "BMO_OP_SLOT_MAPPING", value: 10, isUnsigned: true)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "slot_subtype", scope: !328, file: !324, line: 150, baseType: !344, size: 32, offset: 96)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Union", file: !324, line: 142, baseType: !345)
!345 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eBMOpSlotSubType_Union", file: !324, line: 138, size: 32, elements: !346)
!346 = !{!347, !355, !363}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !345, file: !324, line: 139, baseType: !348, size: 32)
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Elem", file: !324, line: 122, baseType: !349)
!349 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eBMOpSlotSubType_Elem", file: !324, line: 116, baseType: !204, size: 32, elements: !350)
!350 = !{!351, !352, !353, !354}
!351 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_ELEM_VERT", value: 1, isUnsigned: true)
!352 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_ELEM_EDGE", value: 2, isUnsigned: true)
!353 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_ELEM_FACE", value: 8, isUnsigned: true)
!354 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_ELEM_IS_SINGLE", value: 16, isUnsigned: true)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !345, file: !324, line: 140, baseType: !356, size: 32)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Ptr", file: !324, line: 136, baseType: !357)
!357 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eBMOpSlotSubType_Ptr", file: !324, line: 131, baseType: !204, size: 32, elements: !358)
!358 = !{!359, !360, !361, !362}
!359 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_PTR_BMESH", value: 100, isUnsigned: true)
!360 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_PTR_SCENE", value: 101, isUnsigned: true)
!361 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_PTR_OBJECT", value: 102, isUnsigned: true)
!362 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_PTR_MESH", value: 103, isUnsigned: true)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !345, file: !324, line: 141, baseType: !364, size: 32)
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "eBMOpSlotSubType_Map", file: !324, line: 130, baseType: !365)
!365 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eBMOpSlotSubType_Map", file: !324, line: 123, baseType: !204, size: 32, elements: !366)
!366 = !{!367, !368, !369, !370, !371, !372}
!367 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_EMPTY", value: 64, isUnsigned: true)
!368 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_ELEM", value: 65, isUnsigned: true)
!369 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_FLT", value: 66, isUnsigned: true)
!370 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_INT", value: 67, isUnsigned: true)
!371 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_BOOL", value: 68, isUnsigned: true)
!372 = !DIEnumerator(name: "BMO_OP_SLOT_SUBTYPE_MAP_INTERNAL", value: 69, isUnsigned: true)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !328, file: !324, line: 152, baseType: !22, size: 32, offset: 128)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !328, file: !324, line: 162, baseType: !375, size: 128, offset: 192)
!375 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !328, file: !324, line: 155, size: 128, elements: !376)
!376 = !{!377, !378, !379, !380, !381, !383}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !375, file: !324, line: 156, baseType: !22, size: 32)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !375, file: !324, line: 157, baseType: !183, size: 32)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !375, file: !324, line: 158, baseType: !56, size: 64)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !375, file: !324, line: 159, baseType: !182, size: 96)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !375, file: !324, line: 160, baseType: !382, size: 64)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "ghash", scope: !375, file: !324, line: 161, baseType: !384, size: 64)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64)
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "GHash", file: !386, line: 48, baseType: !387)
!386 = !DIFile(filename: "blender/source/blender/blenlib/BLI_ghash.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!387 = !DICompositeType(tag: DW_TAG_structure_type, name: "GHash", file: !386, line: 48, flags: DIFlagFwdDecl)
!388 = !{!389}
!389 = !DISubrange(count: 16)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "slots_out", scope: !323, file: !324, line: 192, baseType: !327, size: 5120, offset: 5120)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "exec", scope: !323, file: !324, line: 193, baseType: !392, size: 64, offset: 10240)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = !DISubroutineType(types: !394)
!394 = !{null, !395, !322}
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMesh", file: !227, line: 246, baseType: !226)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "arena", scope: !323, file: !324, line: 194, baseType: !398, size: 64, offset: 10304)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!399 = !DICompositeType(tag: DW_TAG_structure_type, name: "MemArena", file: !324, line: 194, flags: DIFlagFwdDecl)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !323, file: !324, line: 195, baseType: !22, size: 32, offset: 10368)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "type_flag", scope: !323, file: !324, line: 196, baseType: !402, size: 32, offset: 10400)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "BMOpTypeFlag", file: !324, line: 188, baseType: !403)
!403 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !324, line: 182, baseType: !204, size: 32, elements: !404)
!404 = !{!405, !406, !407, !408, !409}
!405 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_NOP", value: 0, isUnsigned: true)
!406 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_UNTAN_MULTIRES", value: 1, isUnsigned: true)
!407 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_NORMALS_CALC", value: 2, isUnsigned: true)
!408 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_SELECT_FLUSH", value: 4, isUnsigned: true)
!409 = !DIEnumerator(name: "BMO_OPTYPE_FLAG_SELECT_VALIDATE", value: 8, isUnsigned: true)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !323, file: !324, line: 197, baseType: !22, size: 32, offset: 10432)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "vdata", scope: !226, file: !227, line: 223, baseType: !412, size: 1600, offset: 1152)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomData", file: !241, line: 73, baseType: !413)
!413 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomData", file: !241, line: 64, size: 1600, elements: !414)
!414 = !{!415, !430, !434, !435, !436, !437, !438}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "layers", scope: !413, file: !241, line: 65, baseType: !416, size: 64)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataLayer", file: !241, line: 53, baseType: !418)
!418 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataLayer", file: !241, line: 42, size: 832, elements: !419)
!419 = !{!420, !421, !422, !423, !424, !425, !426, !427, !428, !429}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !418, file: !241, line: 43, baseType: !22, size: 32)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !418, file: !241, line: 44, baseType: !22, size: 32, offset: 32)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !418, file: !241, line: 45, baseType: !22, size: 32, offset: 64)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !418, file: !241, line: 46, baseType: !22, size: 32, offset: 96)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "active_rnd", scope: !418, file: !241, line: 47, baseType: !22, size: 32, offset: 128)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "active_clone", scope: !418, file: !241, line: 48, baseType: !22, size: 32, offset: 160)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "active_mask", scope: !418, file: !241, line: 49, baseType: !22, size: 32, offset: 192)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !418, file: !241, line: 50, baseType: !22, size: 32, offset: 224)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !418, file: !241, line: 51, baseType: !33, size: 512, offset: 256)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !418, file: !241, line: 52, baseType: !56, size: 64, offset: 768)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "typemap", scope: !413, file: !241, line: 66, baseType: !431, size: 1312, offset: 64)
!431 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 1312, elements: !432)
!432 = !{!433}
!433 = !DISubrange(count: 41)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "totlayer", scope: !413, file: !241, line: 69, baseType: !22, size: 32, offset: 1376)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "maxlayer", scope: !413, file: !241, line: 69, baseType: !22, size: 32, offset: 1408)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "totsize", scope: !413, file: !241, line: 70, baseType: !22, size: 32, offset: 1440)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !413, file: !241, line: 71, baseType: !239, size: 64, offset: 1472)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "external", scope: !413, file: !241, line: 72, baseType: !439, size: 64, offset: 1536)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "CustomDataExternal", file: !241, line: 59, baseType: !441)
!441 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomDataExternal", file: !241, line: 57, size: 8192, elements: !442)
!442 = !{!443}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !441, file: !241, line: 58, baseType: !131, size: 8192)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "edata", scope: !226, file: !227, line: 223, baseType: !412, size: 1600, offset: 2752)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "ldata", scope: !226, file: !227, line: 223, baseType: !412, size: 1600, offset: 4352)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "pdata", scope: !226, file: !227, line: 223, baseType: !412, size: 1600, offset: 5952)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !226, file: !227, line: 233, baseType: !48, size: 16, offset: 7552)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !226, file: !227, line: 236, baseType: !22, size: 32, offset: 7584)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "walkers", scope: !226, file: !227, line: 238, baseType: !22, size: 32, offset: 7616)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "totflags", scope: !226, file: !227, line: 238, baseType: !22, size: 32, offset: 7648)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "selected", scope: !226, file: !227, line: 239, baseType: !58, size: 128, offset: 7680)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "act_face", scope: !226, file: !227, line: 241, baseType: !312, size: 64, offset: 7808)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "errorstack", scope: !226, file: !227, line: 243, baseType: !58, size: 128, offset: 7872)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "py_handle", scope: !226, file: !227, line: 245, baseType: !56, size: 64, offset: 8000)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "cd_vert_node_offset", scope: !171, file: !25, line: 171, baseType: !22, size: 32, offset: 640)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "cd_face_node_offset", scope: !171, file: !25, line: 172, baseType: !22, size: 32, offset: 672)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "bm_smooth_shading", scope: !171, file: !25, line: 173, baseType: !458, size: 8, offset: 704)
!458 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "bm_log", scope: !171, file: !25, line: 175, baseType: !460, size: 64, offset: 768)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!461 = !DICompositeType(tag: DW_TAG_structure_type, name: "BMLog", file: !25, line: 175, flags: DIFlagFwdDecl)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "pbvh", scope: !171, file: !25, line: 178, baseType: !463, size: 64, offset: 832)
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64)
!464 = !DICompositeType(tag: DW_TAG_structure_type, name: "PBVH", file: !25, line: 55, flags: DIFlagFwdDecl)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "show_diffuse_color", scope: !171, file: !25, line: 179, baseType: !458, size: 8, offset: 896)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers_active", scope: !171, file: !25, line: 182, baseType: !458, size: 8, offset: 904)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "orig_cos", scope: !171, file: !25, line: 183, baseType: !209, size: 64, offset: 960)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "deform_cos", scope: !171, file: !25, line: 184, baseType: !209, size: 64, offset: 1024)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "deform_imats", scope: !171, file: !25, line: 185, baseType: !470, size: 64, offset: 1088)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!471 = !DICompositeType(tag: DW_TAG_array_type, baseType: !183, size: 288, elements: !472)
!472 = !{!185, !185}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "partial_redraw", scope: !171, file: !25, line: 188, baseType: !458, size: 8, offset: 1152)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "texcache_side", scope: !171, file: !25, line: 191, baseType: !204, size: 32, offset: 1184)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "texcache", scope: !171, file: !25, line: 191, baseType: !476, size: 64, offset: 1216)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "texcache_actual", scope: !171, file: !25, line: 191, baseType: !204, size: 32, offset: 1280)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "tex_pool", scope: !171, file: !25, line: 192, baseType: !479, size: 64, offset: 1344)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64)
!480 = !DICompositeType(tag: DW_TAG_structure_type, name: "ImagePool", file: !481, line: 33, flags: DIFlagFwdDecl)
!481 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_brush.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!482 = !DIDerivedType(tag: DW_TAG_member, name: "layer_co", scope: !171, file: !25, line: 195, baseType: !209, size: 64, offset: 1408)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "stroke", scope: !171, file: !25, line: 197, baseType: !484, size: 64, offset: 1472)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!485 = !DICompositeType(tag: DW_TAG_structure_type, name: "SculptStroke", file: !25, line: 197, flags: DIFlagFwdDecl)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !171, file: !25, line: 198, baseType: !487, size: 64, offset: 1536)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!488 = !DICompositeType(tag: DW_TAG_structure_type, name: "StrokeCache", file: !25, line: 59, flags: DIFlagFwdDecl)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "last_stroke_valid", scope: !171, file: !25, line: 201, baseType: !458, size: 8, offset: 1600)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "last_stroke", scope: !171, file: !25, line: 202, baseType: !182, size: 96, offset: 1632)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "average_stroke_accum", scope: !171, file: !25, line: 204, baseType: !182, size: 96, offset: 1728)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "average_stroke_counter", scope: !171, file: !25, line: 205, baseType: !22, size: 32, offset: 1824)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !164, file: !165, line: 121, baseType: !48, size: 16, offset: 1088)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "partype", scope: !164, file: !165, line: 121, baseType: !48, size: 16, offset: 1104)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "par1", scope: !164, file: !165, line: 122, baseType: !22, size: 32, offset: 1120)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "par2", scope: !164, file: !165, line: 122, baseType: !22, size: 32, offset: 1152)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "par3", scope: !164, file: !165, line: 122, baseType: !22, size: 32, offset: 1184)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "parsubstr", scope: !164, file: !165, line: 123, baseType: !33, size: 512, offset: 1216)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !164, file: !165, line: 124, baseType: !163, size: 64, offset: 1728)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "track", scope: !164, file: !165, line: 124, baseType: !163, size: 64, offset: 1792)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !164, file: !165, line: 127, baseType: !163, size: 64, offset: 1856)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_group", scope: !164, file: !165, line: 127, baseType: !163, size: 64, offset: 1920)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_from", scope: !164, file: !165, line: 127, baseType: !163, size: 64, offset: 1984)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !164, file: !165, line: 128, baseType: !505, size: 64, offset: 2048)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64)
!506 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !161, line: 46, flags: DIFlagFwdDecl)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !164, file: !165, line: 130, baseType: !508, size: 64, offset: 2112)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64)
!509 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BoundBox", file: !165, line: 97, size: 832, elements: !510)
!510 = !{!511, !515, !516}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !509, file: !165, line: 98, baseType: !512, size: 768)
!512 = !DICompositeType(tag: DW_TAG_array_type, baseType: !183, size: 768, elements: !513)
!513 = !{!514, !185}
!514 = !DISubrange(count: 8)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !509, file: !165, line: 99, baseType: !22, size: 32, offset: 768)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !509, file: !165, line: 99, baseType: !22, size: 32, offset: 800)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !164, file: !165, line: 131, baseType: !518, size: 64, offset: 2176)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64)
!519 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAction", file: !520, line: 486, size: 1600, elements: !521)
!520 = !DIFile(filename: "blender/source/blender/makesdna/DNA_action_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!521 = !{!522, !523, !524, !525, !526, !527, !528, !529, !530}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !519, file: !520, line: 487, baseType: !113, size: 960)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "curves", scope: !519, file: !520, line: 489, baseType: !58, size: 128, offset: 960)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !519, file: !520, line: 490, baseType: !58, size: 128, offset: 1088)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "groups", scope: !519, file: !520, line: 491, baseType: !58, size: 128, offset: 1216)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !519, file: !520, line: 492, baseType: !58, size: 128, offset: 1344)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !519, file: !520, line: 494, baseType: !22, size: 32, offset: 1472)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "active_marker", scope: !519, file: !520, line: 495, baseType: !22, size: 32, offset: 1504)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "idroot", scope: !519, file: !520, line: 497, baseType: !22, size: 32, offset: 1536)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !519, file: !520, line: 498, baseType: !22, size: 32, offset: 1568)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "poselib", scope: !164, file: !165, line: 132, baseType: !518, size: 64, offset: 2240)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "pose", scope: !164, file: !165, line: 133, baseType: !533, size: 64, offset: 2304)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64)
!534 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bPose", file: !520, line: 334, size: 1728, elements: !535)
!535 = !{!536, !537, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !571}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "chanbase", scope: !534, file: !520, line: 335, baseType: !58, size: 128)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "chanhash", scope: !534, file: !520, line: 336, baseType: !538, size: 64, offset: 128)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !534, file: !520, line: 338, baseType: !48, size: 16, offset: 192)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !534, file: !520, line: 338, baseType: !48, size: 16, offset: 208)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_layer", scope: !534, file: !520, line: 339, baseType: !204, size: 32, offset: 224)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !534, file: !520, line: 340, baseType: !22, size: 32, offset: 256)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !534, file: !520, line: 342, baseType: !183, size: 32, offset: 288)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "stride_offset", scope: !534, file: !520, line: 343, baseType: !182, size: 96, offset: 320)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_offset", scope: !534, file: !520, line: 344, baseType: !182, size: 96, offset: 416)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "agroups", scope: !534, file: !520, line: 347, baseType: !58, size: 128, offset: 512)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "active_group", scope: !534, file: !520, line: 349, baseType: !22, size: 32, offset: 640)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "iksolver", scope: !534, file: !520, line: 350, baseType: !22, size: 32, offset: 672)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "ikdata", scope: !534, file: !520, line: 351, baseType: !56, size: 64, offset: 704)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "ikparam", scope: !534, file: !520, line: 352, baseType: !56, size: 64, offset: 768)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !534, file: !520, line: 354, baseType: !552, size: 384, offset: 832)
!552 = !DIDerivedType(tag: DW_TAG_typedef, name: "bAnimVizSettings", file: !520, line: 116, baseType: !553)
!553 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bAnimVizSettings", file: !520, line: 94, size: 384, elements: !554)
!554 = !{!555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_sf", scope: !553, file: !520, line: 96, baseType: !22, size: 32)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ef", scope: !553, file: !520, line: 96, baseType: !22, size: 32, offset: 32)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_bc", scope: !553, file: !520, line: 97, baseType: !22, size: 32, offset: 64)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_ac", scope: !553, file: !520, line: 97, baseType: !22, size: 32, offset: 96)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_type", scope: !553, file: !520, line: 99, baseType: !48, size: 16, offset: 128)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_step", scope: !553, file: !520, line: 100, baseType: !48, size: 16, offset: 144)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "ghost_flag", scope: !553, file: !520, line: 102, baseType: !48, size: 16, offset: 160)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !553, file: !520, line: 105, baseType: !48, size: 16, offset: 176)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "path_type", scope: !553, file: !520, line: 108, baseType: !48, size: 16, offset: 192)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "path_step", scope: !553, file: !520, line: 109, baseType: !48, size: 16, offset: 208)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "path_viewflag", scope: !553, file: !520, line: 111, baseType: !48, size: 16, offset: 224)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "path_bakeflag", scope: !553, file: !520, line: 112, baseType: !48, size: 16, offset: 240)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "path_sf", scope: !553, file: !520, line: 114, baseType: !22, size: 32, offset: 256)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "path_ef", scope: !553, file: !520, line: 114, baseType: !22, size: 32, offset: 288)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "path_bc", scope: !553, file: !520, line: 115, baseType: !22, size: 32, offset: 320)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "path_ac", scope: !553, file: !520, line: 115, baseType: !22, size: 32, offset: 352)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "proxy_act_bone", scope: !534, file: !520, line: 355, baseType: !33, size: 512, offset: 1216)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !164, file: !165, line: 134, baseType: !56, size: 64, offset: 2368)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !164, file: !165, line: 136, baseType: !574, size: 64, offset: 2432)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64)
!575 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !165, line: 58, flags: DIFlagFwdDecl)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "avs", scope: !164, file: !165, line: 138, baseType: !552, size: 384, offset: 2496)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "mpath", scope: !164, file: !165, line: 139, baseType: !578, size: 64, offset: 2880)
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64)
!579 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPath", file: !520, line: 80, baseType: !580)
!580 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPath", file: !520, line: 72, size: 192, elements: !581)
!581 = !{!582, !589, !590, !591, !592}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "points", scope: !580, file: !520, line: 73, baseType: !583, size: 64)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64)
!584 = !DIDerivedType(tag: DW_TAG_typedef, name: "bMotionPathVert", file: !520, line: 59, baseType: !585)
!585 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bMotionPathVert", file: !520, line: 56, size: 128, elements: !586)
!586 = !{!587, !588}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "co", scope: !585, file: !520, line: 57, baseType: !182, size: 96)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !585, file: !520, line: 58, baseType: !22, size: 32, offset: 96)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !580, file: !520, line: 74, baseType: !22, size: 32, offset: 64)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !580, file: !520, line: 76, baseType: !22, size: 32, offset: 96)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !580, file: !520, line: 77, baseType: !22, size: 32, offset: 128)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !580, file: !520, line: 79, baseType: !22, size: 32, offset: 160)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "constraintChannels", scope: !164, file: !165, line: 141, baseType: !58, size: 128, offset: 2944)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "effect", scope: !164, file: !165, line: 142, baseType: !58, size: 128, offset: 3072)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "defbase", scope: !164, file: !165, line: 143, baseType: !58, size: 128, offset: 3200)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !164, file: !165, line: 144, baseType: !58, size: 128, offset: 3328)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !164, file: !165, line: 146, baseType: !22, size: 32, offset: 3456)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "restore_mode", scope: !164, file: !165, line: 147, baseType: !22, size: 32, offset: 3488)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !164, file: !165, line: 150, baseType: !600, size: 64, offset: 3520)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64)
!602 = !DICompositeType(tag: DW_TAG_structure_type, name: "Material", file: !165, line: 50, flags: DIFlagFwdDecl)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "matbits", scope: !164, file: !165, line: 151, baseType: !604, size: 64, offset: 3584)
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "totcol", scope: !164, file: !165, line: 152, baseType: !22, size: 32, offset: 3648)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "actcol", scope: !164, file: !165, line: 153, baseType: !22, size: 32, offset: 3680)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !164, file: !165, line: 156, baseType: !182, size: 96, offset: 3712)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "dloc", scope: !164, file: !165, line: 156, baseType: !182, size: 96, offset: 3808)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !164, file: !165, line: 156, baseType: !182, size: 96, offset: 3904)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !164, file: !165, line: 157, baseType: !182, size: 96, offset: 4000)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "dsize", scope: !164, file: !165, line: 158, baseType: !182, size: 96, offset: 4096)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "dscale", scope: !164, file: !165, line: 159, baseType: !182, size: 96, offset: 4192)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "rot", scope: !164, file: !165, line: 160, baseType: !182, size: 96, offset: 4288)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "drot", scope: !164, file: !165, line: 160, baseType: !182, size: 96, offset: 4384)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "quat", scope: !164, file: !165, line: 161, baseType: !616, size: 128, offset: 4480)
!616 = !DICompositeType(tag: DW_TAG_array_type, baseType: !183, size: 128, elements: !617)
!617 = !{!618}
!618 = !DISubrange(count: 4)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "dquat", scope: !164, file: !165, line: 161, baseType: !616, size: 128, offset: 4608)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "rotAxis", scope: !164, file: !165, line: 162, baseType: !182, size: 96, offset: 4736)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "drotAxis", scope: !164, file: !165, line: 162, baseType: !182, size: 96, offset: 4832)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "rotAngle", scope: !164, file: !165, line: 163, baseType: !183, size: 32, offset: 4928)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "drotAngle", scope: !164, file: !165, line: 163, baseType: !183, size: 32, offset: 4960)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "obmat", scope: !164, file: !165, line: 164, baseType: !625, size: 512, offset: 4992)
!625 = !DICompositeType(tag: DW_TAG_array_type, baseType: !183, size: 512, elements: !626)
!626 = !{!618, !618}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "parentinv", scope: !164, file: !165, line: 165, baseType: !625, size: 512, offset: 5504)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "constinv", scope: !164, file: !165, line: 166, baseType: !625, size: 512, offset: 6016)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "imat", scope: !164, file: !165, line: 167, baseType: !625, size: 512, offset: 6528)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "imat_ren", scope: !164, file: !165, line: 176, baseType: !625, size: 512, offset: 7040)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !164, file: !165, line: 178, baseType: !204, size: 32, offset: 7552)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !164, file: !165, line: 180, baseType: !48, size: 16, offset: 7584)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "colbits", scope: !164, file: !165, line: 181, baseType: !48, size: 16, offset: 7600)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "transflag", scope: !164, file: !165, line: 183, baseType: !48, size: 16, offset: 7616)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "protectflag", scope: !164, file: !165, line: 183, baseType: !48, size: 16, offset: 7632)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "trackflag", scope: !164, file: !165, line: 184, baseType: !48, size: 16, offset: 7648)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "upflag", scope: !164, file: !165, line: 184, baseType: !48, size: 16, offset: 7664)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "nlaflag", scope: !164, file: !165, line: 185, baseType: !48, size: 16, offset: 7680)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "ipoflag", scope: !164, file: !165, line: 186, baseType: !48, size: 16, offset: 7696)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "scaflag", scope: !164, file: !165, line: 187, baseType: !48, size: 16, offset: 7712)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "scavisflag", scope: !164, file: !165, line: 188, baseType: !14, size: 8, offset: 7728)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "depsflag", scope: !164, file: !165, line: 189, baseType: !14, size: 8, offset: 7736)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "dupon", scope: !164, file: !165, line: 192, baseType: !22, size: 32, offset: 7744)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "dupoff", scope: !164, file: !165, line: 192, baseType: !22, size: 32, offset: 7776)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "dupsta", scope: !164, file: !165, line: 192, baseType: !22, size: 32, offset: 7808)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "dupend", scope: !164, file: !165, line: 192, baseType: !22, size: 32, offset: 7840)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !164, file: !165, line: 194, baseType: !22, size: 32, offset: 7872)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "mass", scope: !164, file: !165, line: 202, baseType: !183, size: 32, offset: 7904)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "damping", scope: !164, file: !165, line: 202, baseType: !183, size: 32, offset: 7936)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "inertia", scope: !164, file: !165, line: 202, baseType: !183, size: 32, offset: 7968)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "formfactor", scope: !164, file: !165, line: 211, baseType: !183, size: 32, offset: 8000)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "rdamping", scope: !164, file: !165, line: 212, baseType: !183, size: 32, offset: 8032)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !164, file: !165, line: 213, baseType: !183, size: 32, offset: 8064)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "max_vel", scope: !164, file: !165, line: 214, baseType: !183, size: 32, offset: 8096)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "min_vel", scope: !164, file: !165, line: 215, baseType: !183, size: 32, offset: 8128)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "obstacleRad", scope: !164, file: !165, line: 216, baseType: !183, size: 32, offset: 8160)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "step_height", scope: !164, file: !165, line: 219, baseType: !183, size: 32, offset: 8192)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "jump_speed", scope: !164, file: !165, line: 220, baseType: !183, size: 32, offset: 8224)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "fall_speed", scope: !164, file: !165, line: 221, baseType: !183, size: 32, offset: 8256)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "col_group", scope: !164, file: !165, line: 224, baseType: !661, size: 16, offset: 8288)
!661 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "col_mask", scope: !164, file: !165, line: 224, baseType: !661, size: 16, offset: 8304)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "rotmode", scope: !164, file: !165, line: 226, baseType: !48, size: 16, offset: 8320)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "boundtype", scope: !164, file: !165, line: 228, baseType: !14, size: 8, offset: 8336)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "collision_boundtype", scope: !164, file: !165, line: 229, baseType: !14, size: 8, offset: 8344)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "dtx", scope: !164, file: !165, line: 231, baseType: !48, size: 16, offset: 8352)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "dt", scope: !164, file: !165, line: 232, baseType: !14, size: 8, offset: 8368)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawtype", scope: !164, file: !165, line: 233, baseType: !14, size: 8, offset: 8376)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "empty_drawsize", scope: !164, file: !165, line: 234, baseType: !183, size: 32, offset: 8384)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "dupfacesca", scope: !164, file: !165, line: 235, baseType: !183, size: 32, offset: 8416)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "prop", scope: !164, file: !165, line: 237, baseType: !58, size: 128, offset: 8448)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "sensors", scope: !164, file: !165, line: 238, baseType: !58, size: 128, offset: 8576)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "controllers", scope: !164, file: !165, line: 239, baseType: !58, size: 128, offset: 8704)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "actuators", scope: !164, file: !165, line: 240, baseType: !58, size: 128, offset: 8832)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "sf", scope: !164, file: !165, line: 242, baseType: !183, size: 32, offset: 8960)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !164, file: !165, line: 244, baseType: !48, size: 16, offset: 8992)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "actdef", scope: !164, file: !165, line: 245, baseType: !661, size: 16, offset: 9008)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !164, file: !165, line: 246, baseType: !616, size: 128, offset: 9024)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag", scope: !164, file: !165, line: 248, baseType: !22, size: 32, offset: 9152)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "gameflag2", scope: !164, file: !165, line: 249, baseType: !22, size: 32, offset: 9184)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "bsoft", scope: !164, file: !165, line: 251, baseType: !682, size: 64, offset: 9216)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 64)
!683 = !DICompositeType(tag: DW_TAG_structure_type, name: "BulletSoftBody", file: !165, line: 251, flags: DIFlagFwdDecl)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "restrictflag", scope: !164, file: !165, line: 253, baseType: !14, size: 8, offset: 9280)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "recalc", scope: !164, file: !165, line: 254, baseType: !14, size: 8, offset: 9288)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "softflag", scope: !164, file: !165, line: 255, baseType: !48, size: 16, offset: 9296)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "anisotropicFriction", scope: !164, file: !165, line: 256, baseType: !182, size: 96, offset: 9312)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "constraints", scope: !164, file: !165, line: 258, baseType: !58, size: 128, offset: 9408)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "nlastrips", scope: !164, file: !165, line: 259, baseType: !58, size: 128, offset: 9536)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !164, file: !165, line: 260, baseType: !58, size: 128, offset: 9664)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "particlesystem", scope: !164, file: !165, line: 261, baseType: !58, size: 128, offset: 9792)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "pd", scope: !164, file: !165, line: 263, baseType: !693, size: 64, offset: 9920)
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 64)
!694 = !DICompositeType(tag: DW_TAG_structure_type, name: "PartDeflect", file: !165, line: 52, flags: DIFlagFwdDecl)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "soft", scope: !164, file: !165, line: 264, baseType: !696, size: 64, offset: 9984)
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 64)
!697 = !DICompositeType(tag: DW_TAG_structure_type, name: "SoftBody", file: !165, line: 53, flags: DIFlagFwdDecl)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "dup_group", scope: !164, file: !165, line: 265, baseType: !699, size: 64, offset: 10048)
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !700, size: 64)
!700 = !DICompositeType(tag: DW_TAG_structure_type, name: "Group", file: !520, line: 46, flags: DIFlagFwdDecl)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "body_type", scope: !164, file: !165, line: 267, baseType: !14, size: 8, offset: 10112)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "shapeflag", scope: !164, file: !165, line: 268, baseType: !14, size: 8, offset: 10120)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "shapenr", scope: !164, file: !165, line: 269, baseType: !48, size: 16, offset: 10128)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "smoothresh", scope: !164, file: !165, line: 270, baseType: !183, size: 32, offset: 10144)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "fluidsimSettings", scope: !164, file: !165, line: 272, baseType: !706, size: 64, offset: 10176)
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 64)
!707 = !DICompositeType(tag: DW_TAG_structure_type, name: "FluidsimSettings", file: !165, line: 54, flags: DIFlagFwdDecl)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "curve_cache", scope: !164, file: !165, line: 275, baseType: !709, size: 64, offset: 10240)
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 64)
!710 = !DICompositeType(tag: DW_TAG_structure_type, name: "CurveCache", file: !165, line: 275, flags: DIFlagFwdDecl)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "derivedDeform", scope: !164, file: !165, line: 277, baseType: !712, size: 64, offset: 10304)
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 64)
!713 = !DICompositeType(tag: DW_TAG_structure_type, name: "DerivedMesh", file: !165, line: 56, flags: DIFlagFwdDecl)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "derivedFinal", scope: !164, file: !165, line: 277, baseType: !712, size: 64, offset: 10368)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "lastDataMask", scope: !164, file: !165, line: 278, baseType: !716, size: 64, offset: 10432)
!716 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !717, line: 27, baseType: !718)
!717 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!718 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !719, line: 45, baseType: !720)
!719 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!720 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "customdata_mask", scope: !164, file: !165, line: 279, baseType: !716, size: 64, offset: 10496)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !164, file: !165, line: 280, baseType: !204, size: 32, offset: 10560)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !164, file: !165, line: 281, baseType: !204, size: 32, offset: 10592)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "gpulamp", scope: !164, file: !165, line: 283, baseType: !58, size: 128, offset: 10624)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "pc_ids", scope: !164, file: !165, line: 284, baseType: !58, size: 128, offset: 10752)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "duplilist", scope: !164, file: !165, line: 285, baseType: !727, size: 64, offset: 10880)
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_object", scope: !164, file: !165, line: 287, baseType: !729, size: 64, offset: 10944)
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64)
!730 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyOb", file: !165, line: 59, flags: DIFlagFwdDecl)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "rigidbody_constraint", scope: !164, file: !165, line: 288, baseType: !732, size: 64, offset: 11008)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 64)
!733 = !DICompositeType(tag: DW_TAG_structure_type, name: "RigidBodyCon", file: !165, line: 288, flags: DIFlagFwdDecl)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "ima_ofs", scope: !164, file: !165, line: 290, baseType: !735, size: 64, offset: 11072)
!735 = !DICompositeType(tag: DW_TAG_array_type, baseType: !183, size: 64, elements: !736)
!736 = !{!737}
!737 = !DISubrange(count: 2)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "iuser", scope: !164, file: !165, line: 291, baseType: !739, size: 64, offset: 11136)
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 64)
!740 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageUser", file: !741, line: 65, baseType: !742)
!741 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!742 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImageUser", file: !741, line: 50, size: 320, elements: !743)
!743 = !{!744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757}
!744 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !742, file: !741, line: 51, baseType: !153, size: 64)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !742, file: !741, line: 53, baseType: !22, size: 32, offset: 64)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !742, file: !741, line: 54, baseType: !22, size: 32, offset: 96)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !742, file: !741, line: 55, baseType: !22, size: 32, offset: 128)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !742, file: !741, line: 55, baseType: !22, size: 32, offset: 160)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "fie_ima", scope: !742, file: !741, line: 56, baseType: !14, size: 8, offset: 192)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "cycl", scope: !742, file: !741, line: 56, baseType: !14, size: 8, offset: 200)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !742, file: !741, line: 57, baseType: !14, size: 8, offset: 208)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !742, file: !741, line: 57, baseType: !14, size: 8, offset: 216)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "multi_index", scope: !742, file: !741, line: 59, baseType: !48, size: 16, offset: 224)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "layer", scope: !742, file: !741, line: 59, baseType: !48, size: 16, offset: 240)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !742, file: !741, line: 59, baseType: !48, size: 16, offset: 256)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !742, file: !741, line: 61, baseType: !48, size: 16, offset: 272)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !742, file: !741, line: 63, baseType: !22, size: 32, offset: 288)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "lodlevels", scope: !164, file: !165, line: 293, baseType: !58, size: 128, offset: 11200)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "currentlod", scope: !164, file: !165, line: 294, baseType: !760, size: 64, offset: 11328)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64)
!761 = !DIDerivedType(tag: DW_TAG_typedef, name: "LodLevel", file: !165, line: 113, baseType: !762)
!762 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LodLevel", file: !165, line: 108, size: 256, elements: !763)
!763 = !{!764, !766, !767, !768, !769}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !762, file: !165, line: 109, baseType: !765, size: 64)
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 64)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !762, file: !165, line: 109, baseType: !765, size: 64, offset: 64)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !762, file: !165, line: 110, baseType: !163, size: 64, offset: 128)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !762, file: !165, line: 111, baseType: !22, size: 32, offset: 192)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "distance", scope: !762, file: !165, line: 112, baseType: !183, size: 32, offset: 224)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !154, file: !155, line: 1221, baseType: !771, size: 64, offset: 1088)
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 64)
!772 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !155, line: 52, flags: DIFlagFwdDecl)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !154, file: !155, line: 1223, baseType: !153, size: 64, offset: 1152)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !154, file: !155, line: 1225, baseType: !58, size: 128, offset: 1216)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !154, file: !155, line: 1226, baseType: !776, size: 64, offset: 1344)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 64)
!777 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !155, line: 69, size: 320, elements: !778)
!778 = !{!779, !780, !781, !782, !783, !784, !785, !786}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !777, file: !155, line: 70, baseType: !776, size: 64)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !777, file: !155, line: 70, baseType: !776, size: 64, offset: 64)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !777, file: !155, line: 71, baseType: !204, size: 32, offset: 128)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !777, file: !155, line: 71, baseType: !204, size: 32, offset: 160)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !777, file: !155, line: 72, baseType: !22, size: 32, offset: 192)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !777, file: !155, line: 73, baseType: !48, size: 16, offset: 224)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !777, file: !155, line: 73, baseType: !48, size: 16, offset: 240)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !777, file: !155, line: 74, baseType: !163, size: 64, offset: 256)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !154, file: !155, line: 1227, baseType: !163, size: 64, offset: 1408)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !154, file: !155, line: 1229, baseType: !182, size: 96, offset: 1472)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !154, file: !155, line: 1230, baseType: !182, size: 96, offset: 1568)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !154, file: !155, line: 1231, baseType: !182, size: 96, offset: 1664)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !154, file: !155, line: 1231, baseType: !182, size: 96, offset: 1760)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !154, file: !155, line: 1233, baseType: !204, size: 32, offset: 1856)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !154, file: !155, line: 1234, baseType: !22, size: 32, offset: 1888)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !154, file: !155, line: 1235, baseType: !204, size: 32, offset: 1920)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !154, file: !155, line: 1237, baseType: !48, size: 16, offset: 1952)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !154, file: !155, line: 1239, baseType: !14, size: 8, offset: 1968)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !154, file: !155, line: 1240, baseType: !798, size: 8, offset: 1976)
!798 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 8, elements: !799)
!799 = !{!800}
!800 = !DISubrange(count: 1)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !154, file: !155, line: 1242, baseType: !802, size: 64, offset: 1984)
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !803, size: 64)
!803 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !804, line: 328, size: 3456, elements: !805)
!804 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!805 = !{!806, !807, !808, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !838, !839, !840, !843, !848, !849, !852, !856, !860, !864, !868, !869, !870, !871}
!806 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !803, file: !804, line: 329, baseType: !113, size: 960)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !803, file: !804, line: 330, baseType: !159, size: 64, offset: 960)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !803, file: !804, line: 332, baseType: !809, size: 64, offset: 1024)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64)
!810 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !804, line: 332, flags: DIFlagFwdDecl)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !803, file: !804, line: 333, baseType: !33, size: 512, offset: 1088)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "interface_type", scope: !803, file: !804, line: 335, baseType: !82, size: 64, offset: 1600)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !803, file: !804, line: 337, baseType: !574, size: 64, offset: 1664)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "view_center", scope: !803, file: !804, line: 338, baseType: !735, size: 64, offset: 1728)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !803, file: !804, line: 340, baseType: !58, size: 128, offset: 1792)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !803, file: !804, line: 340, baseType: !58, size: 128, offset: 1920)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !803, file: !804, line: 342, baseType: !22, size: 32, offset: 2048)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !803, file: !804, line: 342, baseType: !22, size: 32, offset: 2080)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "cur_index", scope: !803, file: !804, line: 343, baseType: !22, size: 32, offset: 2112)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !803, file: !804, line: 345, baseType: !22, size: 32, offset: 2144)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !803, file: !804, line: 346, baseType: !22, size: 32, offset: 2176)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "is_updating", scope: !803, file: !804, line: 347, baseType: !48, size: 16, offset: 2208)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !803, file: !804, line: 348, baseType: !48, size: 16, offset: 2224)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !803, file: !804, line: 349, baseType: !22, size: 32, offset: 2240)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "nodetype", scope: !803, file: !804, line: 351, baseType: !22, size: 32, offset: 2272)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "edit_quality", scope: !803, file: !804, line: 353, baseType: !48, size: 16, offset: 2304)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "render_quality", scope: !803, file: !804, line: 354, baseType: !48, size: 16, offset: 2320)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "chunksize", scope: !803, file: !804, line: 355, baseType: !22, size: 32, offset: 2336)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "viewer_border", scope: !803, file: !804, line: 357, baseType: !830, size: 128, offset: 2368)
!830 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !831, line: 95, baseType: !832)
!831 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!832 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !831, line: 92, size: 128, elements: !833)
!833 = !{!834, !835, !836, !837}
!834 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !832, file: !831, line: 93, baseType: !183, size: 32)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !832, file: !831, line: 93, baseType: !183, size: 32, offset: 32)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !832, file: !831, line: 94, baseType: !183, size: 32, offset: 64)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !832, file: !831, line: 94, baseType: !183, size: 32, offset: 96)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !803, file: !804, line: 363, baseType: !58, size: 128, offset: 2496)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !803, file: !804, line: 363, baseType: !58, size: 128, offset: 2624)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "previews", scope: !803, file: !804, line: 368, baseType: !841, size: 64, offset: 2752)
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !842, size: 64)
!842 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHash", file: !804, line: 48, flags: DIFlagFwdDecl)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "active_viewer_key", scope: !803, file: !804, line: 372, baseType: !844, size: 32, offset: 2816)
!844 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !804, line: 274, baseType: !845)
!845 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !804, line: 271, size: 32, elements: !846)
!846 = !{!847}
!847 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !845, file: !804, line: 273, baseType: !204, size: 32)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !803, file: !804, line: 373, baseType: !22, size: 32, offset: 2848)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "execdata", scope: !803, file: !804, line: 382, baseType: !850, size: 64, offset: 2880)
