; ModuleID = 'blender/source/blender/editors/interface/view2d_ops.c'
source_filename = "blender/source/blender/editors/interface/view2d_ops.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.UserDef = type { i32, i32, i32, i32, i32, [768 x i8], [768 x i8], [1024 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [768 x i8], [1024 x i8], [1024 x i8], i32, i16, i16, i16, i16, i16, i16, i32, i32, i32, i16, i16, i32, i32, i32, i32, i32, i32, i32, i16, i16, i16, i16, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, %struct.ListBase, [64 x i8], i16, i16, i16, i16, i16, i16, i16, i16, [3 x %struct.SolidLight], i16, i16, i16, i16, i16, i16, i16, i16, i32, i32, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i8, i8, i8, i8, i16, i16, i16, i16, i16, i16, float, float, i32, i16, i16, float, i16, i16, i16, i16, %struct.ColorBand, [3 x float], [4 x float], i16, i8, i8, [80 x i8], [1024 x i8], i32, i32, float, float, i32, i16, i16, i16, i16, i16, i16, %struct.WalkNavigation }
%struct.ListBase = type { i8*, i8* }
%struct.SolidLight = type { i32, i32, [4 x float], [4 x float], [4 x float] }
%struct.ColorBand = type { i16, i16, i8, i8, i8, [1 x i8], [32 x %struct.CBData] }
%struct.CBData = type { float, float, float, float, float, i32 }
%struct.WalkNavigation = type { float, float, float, float, float, float, i16, [3 x i16] }

!344 = !DIEnumerator(name: "USER_ZOOM_SCALE", value: 1, isUnsigned: true)
!345 = !DIEnumerator(name: "USER_ZOOM_DOLLY", value: 2, isUnsigned: true)
!346 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 394, baseType: !5, size: 32, elements: !347)
!347 = !{!348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358}
!348 = !DIEnumerator(name: "GESTURE_MODAL_CANCEL", value: 1, isUnsigned: true)
!349 = !DIEnumerator(name: "GESTURE_MODAL_CONFIRM", value: 2, isUnsigned: true)
!350 = !DIEnumerator(name: "GESTURE_MODAL_SELECT", value: 3, isUnsigned: true)
!351 = !DIEnumerator(name: "GESTURE_MODAL_DESELECT", value: 4, isUnsigned: true)
!352 = !DIEnumerator(name: "GESTURE_MODAL_NOP", value: 5, isUnsigned: true)
!353 = !DIEnumerator(name: "GESTURE_MODAL_CIRCLE_ADD", value: 6, isUnsigned: true)
!354 = !DIEnumerator(name: "GESTURE_MODAL_CIRCLE_SUB", value: 7, isUnsigned: true)
!355 = !DIEnumerator(name: "GESTURE_MODAL_BEGIN", value: 8, isUnsigned: true)
!356 = !DIEnumerator(name: "GESTURE_MODAL_IN", value: 9, isUnsigned: true)
!357 = !DIEnumerator(name: "GESTURE_MODAL_OUT", value: 10, isUnsigned: true)
!358 = !DIEnumerator(name: "GESTURE_MODAL_CIRCLE_SIZE", value: 11, isUnsigned: true)
!359 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !360, line: 470, baseType: !5, size: 32, elements: !361)
!360 = !DIFile(filename: "blender/source/blender/windowmanager/WM_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!361 = !{!362, !363, !364, !365, !366}
!362 = !DIEnumerator(name: "P_NOT_STARTED", value: 0, isUnsigned: true)
!363 = !DIEnumerator(name: "P_STARTING", value: 1, isUnsigned: true)
!364 = !DIEnumerator(name: "P_IN_PROGRESS", value: 2, isUnsigned: true)
!365 = !DIEnumerator(name: "P_FINISHING", value: 3, isUnsigned: true)
!366 = !DIEnumerator(name: "P_FINISHED", value: 4, isUnsigned: true)
!367 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eNdof_Flag", file: !299, line: 805, baseType: !5, size: 32, elements: !368)
!368 = !{!369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384}
!369 = !DIEnumerator(name: "NDOF_SHOW_GUIDE", value: 1, isUnsigned: true)
!370 = !DIEnumerator(name: "NDOF_FLY_HELICOPTER", value: 2, isUnsigned: true)
!371 = !DIEnumerator(name: "NDOF_LOCK_HORIZON", value: 4, isUnsigned: true)
!372 = !DIEnumerator(name: "NDOF_SHOULD_PAN", value: 8, isUnsigned: true)
!373 = !DIEnumerator(name: "NDOF_SHOULD_ZOOM", value: 16, isUnsigned: true)
!374 = !DIEnumerator(name: "NDOF_SHOULD_ROTATE", value: 32, isUnsigned: true)
!375 = !DIEnumerator(name: "NDOF_MODE_ORBIT", value: 64, isUnsigned: true)
!376 = !DIEnumerator(name: "NDOF_PAN_YZ_SWAP_AXIS", value: 128, isUnsigned: true)
!377 = !DIEnumerator(name: "NDOF_ZOOM_INVERT", value: 256, isUnsigned: true)
!378 = !DIEnumerator(name: "NDOF_ROTX_INVERT_AXIS", value: 512, isUnsigned: true)
!379 = !DIEnumerator(name: "NDOF_ROTY_INVERT_AXIS", value: 1024, isUnsigned: true)
!380 = !DIEnumerator(name: "NDOF_ROTZ_INVERT_AXIS", value: 2048, isUnsigned: true)
!381 = !DIEnumerator(name: "NDOF_PANX_INVERT_AXIS", value: 4096, isUnsigned: true)
!382 = !DIEnumerator(name: "NDOF_PANY_INVERT_AXIS", value: 8192, isUnsigned: true)
!383 = !DIEnumerator(name: "NDOF_PANZ_INVERT_AXIS", value: 16384, isUnsigned: true)
!384 = !DIEnumerator(name: "NDOF_TURNTABLE", value: 32768, isUnsigned: true)
!385 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1, line: 1558, baseType: !300, size: 32, elements: !386)
!386 = !{!387, !388, !389, !390, !391}
!387 = !DIEnumerator(name: "SCROLLHANDLE_MIN", value: -1)
!388 = !DIEnumerator(name: "SCROLLHANDLE_BAR", value: 0)
!389 = !DIEnumerator(name: "SCROLLHANDLE_MAX", value: 1)
!390 = !DIEnumerator(name: "SCROLLHANDLE_MIN_OUTSIDE", value: 2)
!391 = !DIEnumerator(name: "SCROLLHANDLE_MAX_OUTSIDE", value: 3)
!392 = !{!393, !394, !395, !396}
!393 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!395 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "v2dScrollerMove", file: !1, line: 1543, baseType: !398)
!398 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "v2dScrollerMove", file: !1, line: 1528, size: 384, elements: !399)
!399 = !{!400, !1839, !1878, !1879, !1880, !1881, !1882, !1883, !1884, !1885, !1886}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "v2d", scope: !398, file: !1, line: 1529, baseType: !401, size: 64)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "View2D", file: !403, line: 71, baseType: !404)
!403 = !DIFile(filename: "blender/source/blender/makesdna/DNA_view2d_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!404 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "View2D", file: !403, line: 40, size: 1280, elements: !405)
!405 = !{!406, !415, !416, !424, !425, !426, !430, !431, !432, !433, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !448, !449, !450, !457}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !404, file: !403, line: 41, baseType: !407, size: 128)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "rctf", file: !408, line: 95, baseType: !409)
!408 = !DIFile(filename: "blender/source/blender/makesdna/DNA_vec_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!409 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rctf", file: !408, line: 92, size: 128, elements: !410)
!410 = !{!411, !412, !413, !414}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !409, file: !408, line: 93, baseType: !395, size: 32)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !409, file: !408, line: 93, baseType: !395, size: 32, offset: 32)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !409, file: !408, line: 94, baseType: !395, size: 32, offset: 64)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !409, file: !408, line: 94, baseType: !395, size: 32, offset: 96)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "cur", scope: !404, file: !403, line: 41, baseType: !407, size: 128, offset: 128)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "vert", scope: !404, file: !403, line: 42, baseType: !417, size: 128, offset: 256)
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "rcti", file: !408, line: 89, baseType: !418)
!418 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rcti", file: !408, line: 86, size: 128, elements: !419)
!419 = !{!420, !421, !422, !423}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "xmin", scope: !418, file: !408, line: 87, baseType: !300, size: 32)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "xmax", scope: !418, file: !408, line: 87, baseType: !300, size: 32, offset: 32)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "ymin", scope: !418, file: !408, line: 88, baseType: !300, size: 32, offset: 64)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "ymax", scope: !418, file: !408, line: 88, baseType: !300, size: 32, offset: 96)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "hor", scope: !404, file: !403, line: 42, baseType: !417, size: 128, offset: 384)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !404, file: !403, line: 43, baseType: !417, size: 128, offset: 512)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !404, file: !403, line: 45, baseType: !427, size: 64, offset: 640)
!427 = !DICompositeType(tag: DW_TAG_array_type, baseType: !395, size: 64, elements: !428)
!428 = !{!429}
!429 = !DISubrange(count: 2)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !404, file: !403, line: 45, baseType: !427, size: 64, offset: 704)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "minzoom", scope: !404, file: !403, line: 46, baseType: !395, size: 32, offset: 768)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "maxzoom", scope: !404, file: !403, line: 46, baseType: !395, size: 32, offset: 800)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "scroll", scope: !404, file: !403, line: 48, baseType: !434, size: 16, offset: 832)
!434 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "scroll_ui", scope: !404, file: !403, line: 49, baseType: !434, size: 16, offset: 848)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "keeptot", scope: !404, file: !403, line: 51, baseType: !434, size: 16, offset: 864)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "keepzoom", scope: !404, file: !403, line: 52, baseType: !434, size: 16, offset: 880)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "keepofs", scope: !404, file: !403, line: 53, baseType: !434, size: 16, offset: 896)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !404, file: !403, line: 55, baseType: !434, size: 16, offset: 912)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !404, file: !403, line: 56, baseType: !434, size: 16, offset: 928)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "winx", scope: !404, file: !403, line: 58, baseType: !434, size: 16, offset: 944)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "winy", scope: !404, file: !403, line: 58, baseType: !434, size: 16, offset: 960)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "oldwinx", scope: !404, file: !403, line: 59, baseType: !434, size: 16, offset: 976)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "oldwiny", scope: !404, file: !403, line: 59, baseType: !434, size: 16, offset: 992)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "around", scope: !404, file: !403, line: 61, baseType: !434, size: 16, offset: 1008)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "tab_offset", scope: !404, file: !403, line: 63, baseType: !447, size: 64, offset: 1024)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "tab_num", scope: !404, file: !403, line: 64, baseType: !300, size: 32, offset: 1088)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "tab_cur", scope: !404, file: !403, line: 65, baseType: !300, size: 32, offset: 1120)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "sms", scope: !404, file: !403, line: 68, baseType: !451, size: 64, offset: 1152)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!452 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SmoothView2DStore", file: !1, line: 1346, size: 320, elements: !453)
!453 = !{!454, !455, !456}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "orig_cur", scope: !452, file: !1, line: 1347, baseType: !407, size: 128)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "new_cur", scope: !452, file: !1, line: 1347, baseType: !407, size: 128, offset: 128)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "time_allowed", scope: !452, file: !1, line: 1349, baseType: !393, size: 64, offset: 256)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "smooth_timer", scope: !404, file: !403, line: 69, baseType: !458, size: 64, offset: 1216)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64)
!459 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmTimer", file: !360, line: 490, size: 768, elements: !460)
!460 = !{!461, !462, !463, !1830, !1831, !1832, !1833, !1834, !1835, !1836, !1837, !1838}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !459, file: !360, line: 491, baseType: !458, size: 64)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !459, file: !360, line: 491, baseType: !458, size: 64, offset: 64)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "win", scope: !459, file: !360, line: 493, baseType: !464, size: 64, offset: 128)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!465 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wmWindow", file: !206, line: 169, size: 2048, elements: !466)
!466 = !{!467, !468, !469, !470, !1746, !1747, !1748, !1749, !1750, !1751, !1752, !1753, !1754, !1755, !1756, !1757, !1758, !1759, !1760, !1761, !1762, !1763, !1805, !1808, !1822, !1823, !1824, !1825, !1826, !1827, !1828, !1829}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !465, file: !206, line: 170, baseType: !464, size: 64)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !465, file: !206, line: 170, baseType: !464, size: 64, offset: 64)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "ghostwin", scope: !465, file: !206, line: 172, baseType: !394, size: 64, offset: 128)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !465, file: !206, line: 174, baseType: !471, size: 64, offset: 192)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64)
!472 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bScreen", file: !331, line: 49, size: 1984, elements: !473)
!473 = !{!474, !543, !544, !545, !546, !547, !1729, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1739, !1740, !1741, !1742, !1743, !1744, !1745}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !472, file: !331, line: 50, baseType: !475, size: 960)
!475 = !DIDerivedType(tag: DW_TAG_typedef, name: "ID", file: !476, line: 130, baseType: !477)
!476 = !DIFile(filename: "blender/source/blender/makesdna/DNA_ID.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!477 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ID", file: !476, line: 117, size: 960, elements: !478)
!478 = !{!479, !480, !481, !483, !503, !507, !508, !509, !510, !511}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !477, file: !476, line: 118, baseType: !394, size: 64)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !477, file: !476, line: 118, baseType: !394, size: 64, offset: 64)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "newid", scope: !477, file: !476, line: 119, baseType: !482, size: 64, offset: 128)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !477, file: !476, line: 120, baseType: !484, size: 64, offset: 192)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!485 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Library", file: !476, line: 136, size: 17600, elements: !486)
!486 = !{!487, !488, !490, !493, !498, !499, !500}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !485, file: !476, line: 137, baseType: !475, size: 960)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "idblock", scope: !485, file: !476, line: 138, baseType: !489, size: 64, offset: 960)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "filedata", scope: !485, file: !476, line: 139, baseType: !491, size: 64, offset: 1024)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64)
!492 = !DICompositeType(tag: DW_TAG_structure_type, name: "FileData", file: !476, line: 43, flags: DIFlagFwdDecl)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !485, file: !476, line: 140, baseType: !494, size: 8192, offset: 1088)
!494 = !DICompositeType(tag: DW_TAG_array_type, baseType: !495, size: 8192, elements: !496)
!495 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!496 = !{!497}
!497 = !DISubrange(count: 1024)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "filepath", scope: !485, file: !476, line: 141, baseType: !494, size: 8192, offset: 9280)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !485, file: !476, line: 148, baseType: !484, size: 64, offset: 17472)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !485, file: !476, line: 150, baseType: !501, size: 64, offset: 17536)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64)
!502 = !DICompositeType(tag: DW_TAG_structure_type, name: "PackedFile", file: !476, line: 45, flags: DIFlagFwdDecl)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !477, file: !476, line: 121, baseType: !504, size: 528, offset: 256)
!504 = !DICompositeType(tag: DW_TAG_array_type, baseType: !495, size: 528, elements: !505)
!505 = !{!506}
!506 = !DISubrange(count: 66)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !477, file: !476, line: 126, baseType: !434, size: 16, offset: 784)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !477, file: !476, line: 127, baseType: !300, size: 32, offset: 800)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "icon_id", scope: !477, file: !476, line: 128, baseType: !300, size: 32, offset: 832)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !477, file: !476, line: 128, baseType: !300, size: 32, offset: 864)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !477, file: !476, line: 129, baseType: !512, size: 64, offset: 896)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64)
!513 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDProperty", file: !476, line: 75, baseType: !514)
!514 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDProperty", file: !476, line: 62, size: 1024, elements: !515)
!515 = !{!516, !518, !519, !520, !521, !522, !526, !527, !541, !542}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !514, file: !476, line: 63, baseType: !517, size: 64)
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !514, file: !476, line: 63, baseType: !517, size: 64, offset: 64)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !514, file: !476, line: 64, baseType: !495, size: 8, offset: 128)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "subtype", scope: !514, file: !476, line: 64, baseType: !495, size: 8, offset: 136)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !514, file: !476, line: 65, baseType: !434, size: 16, offset: 144)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !514, file: !476, line: 66, baseType: !523, size: 512, offset: 160)
!523 = !DICompositeType(tag: DW_TAG_array_type, baseType: !495, size: 512, elements: !524)
!524 = !{!525}
!525 = !DISubrange(count: 64)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "saved", scope: !514, file: !476, line: 67, baseType: !300, size: 32, offset: 672)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !514, file: !476, line: 69, baseType: !528, size: 256, offset: 704)
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDPropertyData", file: !476, line: 60, baseType: !529)
!529 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDPropertyData", file: !476, line: 48, size: 256, elements: !530)
!530 = !{!531, !532, !539, !540}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !529, file: !476, line: 49, baseType: !394, size: 64)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !529, file: !476, line: 58, baseType: !533, size: 128, offset: 64)
!533 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListBase", file: !534, line: 71, baseType: !535)
!534 = !DIFile(filename: "blender/source/blender/makesdna/DNA_listBase.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!535 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ListBase", file: !534, line: 69, size: 128, elements: !536)
!536 = !{!537, !538}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !535, file: !534, line: 70, baseType: !394, size: 64)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !535, file: !534, line: 70, baseType: !394, size: 64, offset: 64)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !529, file: !476, line: 59, baseType: !300, size: 32, offset: 192)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !529, file: !476, line: 59, baseType: !300, size: 32, offset: 224)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !514, file: !476, line: 70, baseType: !300, size: 32, offset: 960)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "totallen", scope: !514, file: !476, line: 74, baseType: !300, size: 32, offset: 992)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "vertbase", scope: !472, file: !331, line: 52, baseType: !533, size: 128, offset: 960)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "edgebase", scope: !472, file: !331, line: 53, baseType: !533, size: 128, offset: 1088)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "areabase", scope: !472, file: !331, line: 54, baseType: !533, size: 128, offset: 1216)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "regionbase", scope: !472, file: !331, line: 55, baseType: !533, size: 128, offset: 1344)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !472, file: !331, line: 57, baseType: !548, size: 64, offset: 1472)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64)
!549 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Scene", file: !550, line: 1216, size: 39680, elements: !551)
!550 = !DIFile(filename: "blender/source/blender/makesdna/DNA_scene_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!551 = !{!552, !553, !557, !560, !563, !564, !565, !577, !578, !582, !583, !584, !585, !586, !587, !588, !589, !590, !594, !663, !1100, !1315, !1318, !1599, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1618, !1621, !1622, !1623, !1624, !1625, !1633, !1700, !1707, !1708, !1715, !1716, !1722, !1723, !1724, !1725, !1726}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !549, file: !550, line: 1217, baseType: !475, size: 960)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !549, file: !550, line: 1218, baseType: !554, size: 64, offset: 960)
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 64)
!555 = !DICompositeType(tag: DW_TAG_structure_type, name: "AnimData", file: !556, line: 45, flags: DIFlagFwdDecl)
!556 = !DIFile(filename: "blender/source/blender/makesdna/DNA_texture_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!557 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !549, file: !550, line: 1220, baseType: !558, size: 64, offset: 1024)
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 64)
!559 = !DICompositeType(tag: DW_TAG_structure_type, name: "Object", file: !556, line: 49, flags: DIFlagFwdDecl)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "world", scope: !549, file: !550, line: 1221, baseType: !561, size: 64, offset: 1088)
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64)
!562 = !DICompositeType(tag: DW_TAG_structure_type, name: "World", file: !550, line: 52, flags: DIFlagFwdDecl)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !549, file: !550, line: 1223, baseType: !548, size: 64, offset: 1152)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !549, file: !550, line: 1225, baseType: !533, size: 128, offset: 1216)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "basact", scope: !549, file: !550, line: 1226, baseType: !566, size: 64, offset: 1344)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64)
!567 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Base", file: !550, line: 69, size: 320, elements: !568)
!568 = !{!569, !570, !571, !572, !573, !574, !575, !576}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !567, file: !550, line: 70, baseType: !566, size: 64)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !567, file: !550, line: 70, baseType: !566, size: 64, offset: 64)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !567, file: !550, line: 71, baseType: !5, size: 32, offset: 128)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "selcol", scope: !567, file: !550, line: 71, baseType: !5, size: 32, offset: 160)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !567, file: !550, line: 72, baseType: !300, size: 32, offset: 192)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !567, file: !550, line: 73, baseType: !434, size: 16, offset: 224)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !567, file: !550, line: 73, baseType: !434, size: 16, offset: 240)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "object", scope: !567, file: !550, line: 74, baseType: !558, size: 64, offset: 256)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "obedit", scope: !549, file: !550, line: 1227, baseType: !558, size: 64, offset: 1408)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "cursor", scope: !549, file: !550, line: 1229, baseType: !579, size: 96, offset: 1472)
!579 = !DICompositeType(tag: DW_TAG_array_type, baseType: !395, size: 96, elements: !580)
!580 = !{!581}
!581 = !DISubrange(count: 3)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "twcent", scope: !549, file: !550, line: 1230, baseType: !579, size: 96, offset: 1568)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "twmin", scope: !549, file: !550, line: 1231, baseType: !579, size: 96, offset: 1664)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "twmax", scope: !549, file: !550, line: 1231, baseType: !579, size: 96, offset: 1760)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "lay", scope: !549, file: !550, line: 1233, baseType: !5, size: 32, offset: 1856)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "layact", scope: !549, file: !550, line: 1234, baseType: !300, size: 32, offset: 1888)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "lay_updated", scope: !549, file: !550, line: 1235, baseType: !5, size: 32, offset: 1920)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !549, file: !550, line: 1237, baseType: !434, size: 16, offset: 1952)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "use_nodes", scope: !549, file: !550, line: 1239, baseType: !495, size: 8, offset: 1968)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !549, file: !550, line: 1240, baseType: !591, size: 8, offset: 1976)
!591 = !DICompositeType(tag: DW_TAG_array_type, baseType: !495, size: 8, elements: !592)
!592 = !{!593}
!593 = !DISubrange(count: 1)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "nodetree", scope: !549, file: !550, line: 1242, baseType: !595, size: 64, offset: 1984)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64)
!596 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTree", file: !597, line: 328, size: 3456, elements: !598)
!597 = !DIFile(filename: "blender/source/blender/makesdna/DNA_node_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!598 = !{!599, !600, !601, !604, !605, !608, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !633, !638, !639, !642, !646, !651, !655, !659, !660, !661, !662}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !596, file: !597, line: 329, baseType: !475, size: 960)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !596, file: !597, line: 330, baseType: !554, size: 64, offset: 960)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "typeinfo", scope: !596, file: !597, line: 332, baseType: !602, size: 64, offset: 1024)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64)
!603 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeType", file: !597, line: 332, flags: DIFlagFwdDecl)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "idname", scope: !596, file: !597, line: 333, baseType: !523, size: 512, offset: 1088)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "interface_type", scope: !596, file: !597, line: 335, baseType: !606, size: 64, offset: 1600)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!607 = !DICompositeType(tag: DW_TAG_structure_type, name: "StructRNA", file: !265, line: 41, flags: DIFlagFwdDecl)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !596, file: !597, line: 337, baseType: !609, size: 64, offset: 1664)
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 64)
!610 = !DICompositeType(tag: DW_TAG_structure_type, name: "bGPdata", file: !611, line: 45, flags: DIFlagFwdDecl)
!611 = !DIFile(filename: "blender/source/blender/makesdna/DNA_tracking_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!612 = !DIDerivedType(tag: DW_TAG_member, name: "view_center", scope: !596, file: !597, line: 338, baseType: !427, size: 64, offset: 1728)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !596, file: !597, line: 340, baseType: !533, size: 128, offset: 1792)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "links", scope: !596, file: !597, line: 340, baseType: !533, size: 128, offset: 1920)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !596, file: !597, line: 342, baseType: !300, size: 32, offset: 2048)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !596, file: !597, line: 342, baseType: !300, size: 32, offset: 2080)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "cur_index", scope: !596, file: !597, line: 343, baseType: !300, size: 32, offset: 2112)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !596, file: !597, line: 345, baseType: !300, size: 32, offset: 2144)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !596, file: !597, line: 346, baseType: !300, size: 32, offset: 2176)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "is_updating", scope: !596, file: !597, line: 347, baseType: !434, size: 16, offset: 2208)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !596, file: !597, line: 348, baseType: !434, size: 16, offset: 2224)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !596, file: !597, line: 349, baseType: !300, size: 32, offset: 2240)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "nodetype", scope: !596, file: !597, line: 351, baseType: !300, size: 32, offset: 2272)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "edit_quality", scope: !596, file: !597, line: 353, baseType: !434, size: 16, offset: 2304)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "render_quality", scope: !596, file: !597, line: 354, baseType: !434, size: 16, offset: 2320)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "chunksize", scope: !596, file: !597, line: 355, baseType: !300, size: 32, offset: 2336)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "viewer_border", scope: !596, file: !597, line: 357, baseType: !407, size: 128, offset: 2368)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !596, file: !597, line: 363, baseType: !533, size: 128, offset: 2496)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !596, file: !597, line: 363, baseType: !533, size: 128, offset: 2624)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "previews", scope: !596, file: !597, line: 368, baseType: !631, size: 64, offset: 2752)
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64)
!632 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceHash", file: !597, line: 48, flags: DIFlagFwdDecl)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "active_viewer_key", scope: !596, file: !597, line: 372, baseType: !634, size: 32, offset: 2816)
!634 = !DIDerivedType(tag: DW_TAG_typedef, name: "bNodeInstanceKey", file: !597, line: 274, baseType: !635)
!635 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeInstanceKey", file: !597, line: 271, size: 32, elements: !636)
!636 = !{!637}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !635, file: !597, line: 273, baseType: !5, size: 32)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !596, file: !597, line: 373, baseType: !300, size: 32, offset: 2848)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "execdata", scope: !596, file: !597, line: 382, baseType: !640, size: 64, offset: 2880)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64)
!641 = !DICompositeType(tag: DW_TAG_structure_type, name: "bNodeTreeExec", file: !597, line: 46, flags: DIFlagFwdDecl)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !596, file: !597, line: 385, baseType: !643, size: 64, offset: 2944)
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 64)
!644 = !DISubroutineType(types: !645)
!645 = !{null, !394, !395}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "stats_draw", scope: !596, file: !597, line: 386, baseType: !647, size: 64, offset: 3008)
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !648, size: 64)
!648 = !DISubroutineType(types: !649)
!649 = !{null, !394, !650}
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "test_break", scope: !596, file: !597, line: 387, baseType: !652, size: 64, offset: 3072)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 64)
!653 = !DISubroutineType(types: !654)
!654 = !{!300, !394}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "update_draw", scope: !596, file: !597, line: 388, baseType: !656, size: 64, offset: 3136)
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 64)
!657 = !DISubroutineType(types: !658)
!658 = !{null, !394}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "tbh", scope: !596, file: !597, line: 389, baseType: !394, size: 64, offset: 3200)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "prh", scope: !596, file: !597, line: 389, baseType: !394, size: 64, offset: 3264)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "sdh", scope: !596, file: !597, line: 389, baseType: !394, size: 64, offset: 3328)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "udh", scope: !596, file: !597, line: 389, baseType: !394, size: 64, offset: 3392)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !549, file: !550, line: 1244, baseType: !664, size: 64, offset: 2048)
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !665, size: 64)
!665 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Editing", file: !666, line: 200, size: 17024, elements: !667)
!666 = !DIFile(filename: "blender/source/blender/makesdna/DNA_sequence_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!667 = !{!668, !670, !671, !672, !1093, !1094, !1095, !1096, !1097, !1098, !1099}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "seqbasep", scope: !665, file: !666, line: 201, baseType: !669, size: 64)
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !665, file: !666, line: 202, baseType: !533, size: 128, offset: 64)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "metastack", scope: !665, file: !666, line: 203, baseType: !533, size: 128, offset: 192)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "act_seq", scope: !665, file: !666, line: 206, baseType: !673, size: 64, offset: 320)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64)
!674 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sequence", file: !666, line: 190, baseType: !675)
!675 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sequence", file: !666, line: 126, size: 2816, elements: !676)
!676 = !{!677, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !776, !779, !780, !781, !1064, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1092}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !675, file: !666, line: 127, baseType: !678, size: 64)
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 64)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !675, file: !666, line: 127, baseType: !678, size: 64, offset: 64)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !675, file: !666, line: 128, baseType: !394, size: 64, offset: 128)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "lib", scope: !675, file: !666, line: 129, baseType: !394, size: 64, offset: 192)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !675, file: !666, line: 130, baseType: !523, size: 512, offset: 256)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !675, file: !666, line: 132, baseType: !300, size: 32, offset: 768)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !675, file: !666, line: 132, baseType: !300, size: 32, offset: 800)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !675, file: !666, line: 133, baseType: !300, size: 32, offset: 832)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !675, file: !666, line: 134, baseType: !300, size: 32, offset: 864)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "startofs", scope: !675, file: !666, line: 134, baseType: !300, size: 32, offset: 896)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "endofs", scope: !675, file: !666, line: 134, baseType: !300, size: 32, offset: 928)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !675, file: !666, line: 135, baseType: !300, size: 32, offset: 960)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !675, file: !666, line: 135, baseType: !300, size: 32, offset: 992)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !675, file: !666, line: 136, baseType: !300, size: 32, offset: 1024)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !675, file: !666, line: 136, baseType: !300, size: 32, offset: 1056)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "startdisp", scope: !675, file: !666, line: 137, baseType: !300, size: 32, offset: 1088)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "enddisp", scope: !675, file: !666, line: 137, baseType: !300, size: 32, offset: 1120)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "sat", scope: !675, file: !666, line: 138, baseType: !395, size: 32, offset: 1152)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "mul", scope: !675, file: !666, line: 139, baseType: !395, size: 32, offset: 1184)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "handsize", scope: !675, file: !666, line: 139, baseType: !395, size: 32, offset: 1216)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "anim_preseek", scope: !675, file: !666, line: 141, baseType: !434, size: 16, offset: 1248)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "streamindex", scope: !675, file: !666, line: 142, baseType: !434, size: 16, offset: 1264)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "multicam_source", scope: !675, file: !666, line: 143, baseType: !300, size: 32, offset: 1280)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "clip_flag", scope: !675, file: !666, line: 144, baseType: !300, size: 32, offset: 1312)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "strip", scope: !675, file: !666, line: 146, baseType: !703, size: 64, offset: 1344)
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 64)
!704 = !DIDerivedType(tag: DW_TAG_typedef, name: "Strip", file: !666, line: 114, baseType: !705)
!705 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Strip", file: !666, line: 99, size: 7232, elements: !706)
!706 = !{!707, !709, !710, !711, !712, !713, !714, !725, !729, !744, !753, !760, !770}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !705, file: !666, line: 100, baseType: !708, size: 64)
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !705, size: 64)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !705, file: !666, line: 100, baseType: !708, size: 64, offset: 64)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "us", scope: !705, file: !666, line: 101, baseType: !300, size: 32, offset: 128)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !705, file: !666, line: 101, baseType: !300, size: 32, offset: 160)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "startstill", scope: !705, file: !666, line: 102, baseType: !300, size: 32, offset: 192)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "endstill", scope: !705, file: !666, line: 102, baseType: !300, size: 32, offset: 224)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "stripdata", scope: !705, file: !666, line: 103, baseType: !715, size: 64, offset: 256)
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 64)
!716 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripElem", file: !666, line: 59, baseType: !717)
!717 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripElem", file: !666, line: 56, size: 2112, elements: !718)
!718 = !{!719, !723, !724}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !717, file: !666, line: 57, baseType: !720, size: 2048)
!720 = !DICompositeType(tag: DW_TAG_array_type, baseType: !495, size: 2048, elements: !721)
!721 = !{!722}
!722 = !DISubrange(count: 256)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "orig_width", scope: !717, file: !666, line: 58, baseType: !300, size: 32, offset: 2048)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "orig_height", scope: !717, file: !666, line: 58, baseType: !300, size: 32, offset: 2080)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !705, file: !666, line: 106, baseType: !726, size: 6144, offset: 320)
!726 = !DICompositeType(tag: DW_TAG_array_type, baseType: !495, size: 6144, elements: !727)
!727 = !{!728}
!728 = !DISubrange(count: 768)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !705, file: !666, line: 107, baseType: !730, size: 64, offset: 6464)
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 64)
!731 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripProxy", file: !666, line: 97, baseType: !732)
!732 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripProxy", file: !666, line: 83, size: 8320, elements: !733)
!733 = !{!734, !735, !736, !740, !741, !742, !743}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !732, file: !666, line: 84, baseType: !726, size: 6144)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !732, file: !666, line: 87, baseType: !720, size: 2048, offset: 6144)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !732, file: !666, line: 88, baseType: !737, size: 64, offset: 8192)
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !738, size: 64)
!738 = !DICompositeType(tag: DW_TAG_structure_type, name: "anim", file: !739, line: 41, flags: DIFlagFwdDecl)
!739 = !DIFile(filename: "blender/source/blender/makesdna/DNA_image_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!740 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !732, file: !666, line: 90, baseType: !434, size: 16, offset: 8256)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !732, file: !666, line: 92, baseType: !434, size: 16, offset: 8272)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flags", scope: !732, file: !666, line: 93, baseType: !434, size: 16, offset: 8288)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flags", scope: !732, file: !666, line: 95, baseType: !434, size: 16, offset: 8304)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !705, file: !666, line: 108, baseType: !745, size: 64, offset: 6528)
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 64)
!746 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripCrop", file: !666, line: 66, baseType: !747)
!747 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripCrop", file: !666, line: 61, size: 128, elements: !748)
!748 = !{!749, !750, !751, !752}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !747, file: !666, line: 62, baseType: !300, size: 32)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "bottom", scope: !747, file: !666, line: 63, baseType: !300, size: 32, offset: 32)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !747, file: !666, line: 64, baseType: !300, size: 32, offset: 64)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !747, file: !666, line: 65, baseType: !300, size: 32, offset: 96)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "transform", scope: !705, file: !666, line: 109, baseType: !754, size: 64, offset: 6592)
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 64)
!755 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripTransform", file: !666, line: 71, baseType: !756)
!756 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripTransform", file: !666, line: 68, size: 64, elements: !757)
!757 = !{!758, !759}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "xofs", scope: !756, file: !666, line: 69, baseType: !300, size: 32)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "yofs", scope: !756, file: !666, line: 70, baseType: !300, size: 32, offset: 32)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "color_balance", scope: !705, file: !666, line: 110, baseType: !761, size: 64, offset: 6656)
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 64)
!762 = !DIDerivedType(tag: DW_TAG_typedef, name: "StripColorBalance", file: !666, line: 81, baseType: !763)
!763 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StripColorBalance", file: !666, line: 73, size: 352, elements: !764)
!764 = !{!765, !766, !767, !768, !769}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "lift", scope: !763, file: !666, line: 74, baseType: !579, size: 96)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !763, file: !666, line: 75, baseType: !579, size: 96, offset: 96)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "gain", scope: !763, file: !666, line: 76, baseType: !579, size: 96, offset: 192)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !763, file: !666, line: 77, baseType: !300, size: 32, offset: 288)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !763, file: !666, line: 78, baseType: !300, size: 32, offset: 320)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !705, file: !666, line: 113, baseType: !771, size: 512, offset: 6720)
!771 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorManagedColorspaceSettings", file: !772, line: 182, baseType: !773)
!772 = !DIFile(filename: "blender/source/blender/makesdna/DNA_color_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!773 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorManagedColorspaceSettings", file: !772, line: 180, size: 512, elements: !774)
!774 = !{!775}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !773, file: !772, line: 181, baseType: !523, size: 512)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "ipo", scope: !675, file: !666, line: 148, baseType: !777, size: 64, offset: 1408)
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 64)
!778 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipo", file: !556, line: 46, flags: DIFlagFwdDecl)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !675, file: !666, line: 151, baseType: !548, size: 64, offset: 1472)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "scene_camera", scope: !675, file: !666, line: 152, baseType: !558, size: 64, offset: 1536)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "clip", scope: !675, file: !666, line: 153, baseType: !782, size: 64, offset: 1600)
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !783, size: 64)
!783 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClip", file: !784, line: 64, size: 19136, elements: !785)
!784 = !DIFile(filename: "blender/source/blender/makesdna/DNA_movieclip_types.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!785 = !{!786, !787, !788, !789, !790, !791, !793, !794, !795, !796, !799, !800, !1050, !1051, !1059, !1060, !1061, !1062, !1063}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !783, file: !784, line: 65, baseType: !475, size: 960)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "adt", scope: !783, file: !784, line: 66, baseType: !554, size: 64, offset: 960)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !783, file: !784, line: 68, baseType: !494, size: 8192, offset: 1024)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !783, file: !784, line: 70, baseType: !300, size: 32, offset: 9216)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !783, file: !784, line: 71, baseType: !300, size: 32, offset: 9248)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "lastsize", scope: !783, file: !784, line: 72, baseType: !792, size: 64, offset: 9280)
!792 = !DICompositeType(tag: DW_TAG_array_type, baseType: !300, size: 64, elements: !428)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !783, file: !784, line: 74, baseType: !395, size: 32, offset: 9344)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !783, file: !784, line: 74, baseType: !395, size: 32, offset: 9376)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !783, file: !784, line: 76, baseType: !737, size: 64, offset: 9408)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !783, file: !784, line: 77, baseType: !797, size: 64, offset: 9472)
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !798, size: 64)
!798 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipCache", file: !784, line: 77, flags: DIFlagFwdDecl)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !783, file: !784, line: 78, baseType: !609, size: 64, offset: 9536)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "tracking", scope: !783, file: !784, line: 80, baseType: !801, size: 2624, offset: 9600)
!801 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTracking", file: !611, line: 340, size: 2624, elements: !802)
!802 = !{!803, !831, !849, !850, !851, !869, !927, !928, !1030, !1031, !1032, !1033, !1039}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "settings", scope: !801, file: !611, line: 341, baseType: !804, size: 576)
!804 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingSettings", file: !611, line: 251, baseType: !805)
!805 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingSettings", file: !611, line: 207, size: 576, elements: !806)
!806 = !{!807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !805, file: !611, line: 208, baseType: !300, size: 32)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "default_motion_model", scope: !805, file: !611, line: 211, baseType: !434, size: 16, offset: 32)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "default_algorithm_flag", scope: !805, file: !611, line: 212, baseType: !434, size: 16, offset: 48)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "default_minimum_correlation", scope: !805, file: !611, line: 213, baseType: !395, size: 32, offset: 64)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_size", scope: !805, file: !611, line: 214, baseType: !434, size: 16, offset: 96)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "default_search_size", scope: !805, file: !611, line: 215, baseType: !434, size: 16, offset: 112)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "default_frames_limit", scope: !805, file: !611, line: 216, baseType: !434, size: 16, offset: 128)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "default_margin", scope: !805, file: !611, line: 217, baseType: !434, size: 16, offset: 144)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "default_pattern_match", scope: !805, file: !611, line: 218, baseType: !434, size: 16, offset: 160)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "default_flag", scope: !805, file: !611, line: 219, baseType: !434, size: 16, offset: 176)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "default_weight", scope: !805, file: !611, line: 220, baseType: !395, size: 32, offset: 192)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "motion_flag", scope: !805, file: !611, line: 222, baseType: !434, size: 16, offset: 224)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "speed", scope: !805, file: !611, line: 225, baseType: !434, size: 16, offset: 240)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe1", scope: !805, file: !611, line: 228, baseType: !300, size: 32, offset: 256)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe2", scope: !805, file: !611, line: 229, baseType: !300, size: 32, offset: 288)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction_flag", scope: !805, file: !611, line: 233, baseType: !300, size: 32, offset: 320)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "refine_camera_intrinsics", scope: !805, file: !611, line: 236, baseType: !434, size: 16, offset: 352)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !805, file: !611, line: 236, baseType: !434, size: 16, offset: 368)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !805, file: !611, line: 241, baseType: !395, size: 32, offset: 384)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "clean_frames", scope: !805, file: !611, line: 244, baseType: !300, size: 32, offset: 416)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "clean_action", scope: !805, file: !611, line: 244, baseType: !300, size: 32, offset: 448)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "clean_error", scope: !805, file: !611, line: 245, baseType: !395, size: 32, offset: 480)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "object_distance", scope: !805, file: !611, line: 248, baseType: !395, size: 32, offset: 512)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "pad3", scope: !805, file: !611, line: 250, baseType: !300, size: 32, offset: 544)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "camera", scope: !801, file: !611, line: 342, baseType: !832, size: 448, offset: 576)
!832 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingCamera", file: !611, line: 79, baseType: !833)
!833 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingCamera", file: !611, line: 61, size: 448, elements: !834)
!834 = !{!835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848}
!835 = !DIDerivedType(tag: DW_TAG_member, name: "intrinsics", scope: !833, file: !611, line: 62, baseType: !394, size: 64)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "distortion_model", scope: !833, file: !611, line: 64, baseType: !434, size: 16, offset: 64)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !833, file: !611, line: 65, baseType: !434, size: 16, offset: 80)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "sensor_width", scope: !833, file: !611, line: 67, baseType: !395, size: 32, offset: 96)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_aspect", scope: !833, file: !611, line: 68, baseType: !395, size: 32, offset: 128)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "focal", scope: !833, file: !611, line: 69, baseType: !395, size: 32, offset: 160)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !833, file: !611, line: 70, baseType: !434, size: 16, offset: 192)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "pad1", scope: !833, file: !611, line: 71, baseType: !434, size: 16, offset: 208)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "principal", scope: !833, file: !611, line: 72, baseType: !427, size: 64, offset: 224)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "k1", scope: !833, file: !611, line: 75, baseType: !395, size: 32, offset: 288)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "k2", scope: !833, file: !611, line: 75, baseType: !395, size: 32, offset: 320)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "k3", scope: !833, file: !611, line: 75, baseType: !395, size: 32, offset: 352)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "division_k1", scope: !833, file: !611, line: 78, baseType: !395, size: 32, offset: 384)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "division_k2", scope: !833, file: !611, line: 78, baseType: !395, size: 32, offset: 416)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "tracks", scope: !801, file: !611, line: 343, baseType: !533, size: 128, offset: 1024)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "plane_tracks", scope: !801, file: !611, line: 344, baseType: !533, size: 128, offset: 1152)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "reconstruction", scope: !801, file: !611, line: 345, baseType: !852, size: 192, offset: 1280)
!852 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingReconstruction", file: !611, line: 278, baseType: !853)
!853 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingReconstruction", file: !611, line: 270, size: 192, elements: !854)
!854 = !{!855, !856, !857, !858, !859}
!855 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !853, file: !611, line: 271, baseType: !300, size: 32)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !853, file: !611, line: 273, baseType: !395, size: 32, offset: 32)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "last_camera", scope: !853, file: !611, line: 275, baseType: !300, size: 32, offset: 64)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "camnr", scope: !853, file: !611, line: 276, baseType: !300, size: 32, offset: 96)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "cameras", scope: !853, file: !611, line: 277, baseType: !860, size: 64, offset: 128)
!860 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !861, size: 64)
!861 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieReconstructedCamera", file: !611, line: 55, size: 576, elements: !862)
!862 = !{!863, !864, !865}
!863 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !861, file: !611, line: 56, baseType: !300, size: 32)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !861, file: !611, line: 57, baseType: !395, size: 32, offset: 32)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !861, file: !611, line: 58, baseType: !866, size: 512, offset: 64)
!866 = !DICompositeType(tag: DW_TAG_array_type, baseType: !395, size: 512, elements: !867)
!867 = !{!868, !868}
!868 = !DISubrange(count: 4)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "stabilization", scope: !801, file: !611, line: 346, baseType: !870, size: 384, offset: 1472)
!870 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStabilization", file: !611, line: 268, baseType: !871)
!871 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStabilization", file: !611, line: 253, size: 384, elements: !872)
!872 = !{!873, !874, !875, !876, !877, !921, !922, !923, !924, !925, !926}
!873 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !871, file: !611, line: 254, baseType: !300, size: 32)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "tot_track", scope: !871, file: !611, line: 255, baseType: !300, size: 32, offset: 32)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !871, file: !611, line: 255, baseType: !300, size: 32, offset: 64)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "maxscale", scope: !871, file: !611, line: 258, baseType: !395, size: 32, offset: 96)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "rot_track", scope: !871, file: !611, line: 259, baseType: !878, size: 64, offset: 128)
!878 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !879, size: 64)
!879 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingTrack", file: !611, line: 164, baseType: !880)
!880 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingTrack", file: !611, line: 108, size: 1664, elements: !881)
!881 = !{!882, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920}
!882 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !880, file: !611, line: 109, baseType: !883, size: 64)
!883 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !880, size: 64)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !880, file: !611, line: 109, baseType: !883, size: 64, offset: 64)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !880, file: !611, line: 111, baseType: !523, size: 512, offset: 128)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "pat_min", scope: !880, file: !611, line: 119, baseType: !427, size: 64, offset: 640)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "pat_max", scope: !880, file: !611, line: 119, baseType: !427, size: 64, offset: 704)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !880, file: !611, line: 125, baseType: !427, size: 64, offset: 768)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !880, file: !611, line: 125, baseType: !427, size: 64, offset: 832)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !880, file: !611, line: 127, baseType: !427, size: 64, offset: 896)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !880, file: !611, line: 130, baseType: !300, size: 32, offset: 960)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !880, file: !611, line: 131, baseType: !300, size: 32, offset: 992)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !880, file: !611, line: 132, baseType: !894, size: 64, offset: 1024)
!894 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !895, size: 64)
!895 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingMarker", file: !611, line: 106, baseType: !896)
!896 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingMarker", file: !611, line: 81, size: 512, elements: !897)
!897 = !{!898, !899, !902, !903, !904, !905}
!898 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !896, file: !611, line: 82, baseType: !427, size: 64)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_corners", scope: !896, file: !611, line: 97, baseType: !900, size: 256, offset: 64)
!900 = !DICompositeType(tag: DW_TAG_array_type, baseType: !395, size: 256, elements: !901)
!901 = !{!868, !429}
!902 = !DIDerivedType(tag: DW_TAG_member, name: "search_min", scope: !896, file: !611, line: 102, baseType: !427, size: 64, offset: 320)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "search_max", scope: !896, file: !611, line: 102, baseType: !427, size: 64, offset: 384)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !896, file: !611, line: 104, baseType: !300, size: 32, offset: 448)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !896, file: !611, line: 105, baseType: !300, size: 32, offset: 480)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "bundle_pos", scope: !880, file: !611, line: 135, baseType: !579, size: 96, offset: 1088)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !880, file: !611, line: 136, baseType: !395, size: 32, offset: 1184)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !880, file: !611, line: 139, baseType: !300, size: 32, offset: 1216)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "pat_flag", scope: !880, file: !611, line: 139, baseType: !300, size: 32, offset: 1248)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "search_flag", scope: !880, file: !611, line: 139, baseType: !300, size: 32, offset: 1280)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !880, file: !611, line: 140, baseType: !579, size: 96, offset: 1312)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "frames_limit", scope: !880, file: !611, line: 143, baseType: !434, size: 16, offset: 1408)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "margin", scope: !880, file: !611, line: 144, baseType: !434, size: 16, offset: 1424)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "pattern_match", scope: !880, file: !611, line: 145, baseType: !434, size: 16, offset: 1440)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "motion_model", scope: !880, file: !611, line: 148, baseType: !434, size: 16, offset: 1456)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "algorithm_flag", scope: !880, file: !611, line: 149, baseType: !300, size: 32, offset: 1472)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "minimum_correlation", scope: !880, file: !611, line: 150, baseType: !395, size: 32, offset: 1504)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "gpd", scope: !880, file: !611, line: 152, baseType: !609, size: 64, offset: 1536)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !880, file: !611, line: 163, baseType: !395, size: 32, offset: 1600)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !880, file: !611, line: 163, baseType: !395, size: 32, offset: 1632)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "locinf", scope: !871, file: !611, line: 261, baseType: !395, size: 32, offset: 192)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "scaleinf", scope: !871, file: !611, line: 261, baseType: !395, size: 32, offset: 224)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "rotinf", scope: !871, file: !611, line: 261, baseType: !395, size: 32, offset: 256)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !871, file: !611, line: 263, baseType: !300, size: 32, offset: 288)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !871, file: !611, line: 266, baseType: !300, size: 32, offset: 320)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !871, file: !611, line: 267, baseType: !395, size: 32, offset: 352)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "act_track", scope: !801, file: !611, line: 347, baseType: !878, size: 64, offset: 1856)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "act_plane_track", scope: !801, file: !611, line: 348, baseType: !929, size: 64, offset: 1920)
!929 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !930, size: 64)
!930 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingPlaneTrack", file: !611, line: 205, baseType: !931)
!931 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingPlaneTrack", file: !611, line: 186, size: 1024, elements: !932)
!932 = !{!933, !935, !936, !937, !939, !940, !941, !949, !950, !951, !1028, !1029}
!933 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !931, file: !611, line: 187, baseType: !934, size: 64)
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 64)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !931, file: !611, line: 187, baseType: !934, size: 64, offset: 64)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !931, file: !611, line: 189, baseType: !523, size: 512, offset: 128)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "point_tracks", scope: !931, file: !611, line: 191, baseType: !938, size: 64, offset: 640)
!938 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !878, size: 64)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "point_tracksnr", scope: !931, file: !611, line: 193, baseType: !300, size: 32, offset: 704)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !931, file: !611, line: 193, baseType: !300, size: 32, offset: 736)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "markers", scope: !931, file: !611, line: 195, baseType: !942, size: 64, offset: 768)
!942 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 64)
!943 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingPlaneMarker", file: !611, line: 184, baseType: !944)
!944 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingPlaneMarker", file: !611, line: 166, size: 320, elements: !945)
!945 = !{!946, !947, !948}
!946 = !DIDerivedType(tag: DW_TAG_member, name: "corners", scope: !944, file: !611, line: 180, baseType: !900, size: 256)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "framenr", scope: !944, file: !611, line: 182, baseType: !300, size: 32, offset: 256)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !944, file: !611, line: 183, baseType: !300, size: 32, offset: 288)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "markersnr", scope: !931, file: !611, line: 196, baseType: !300, size: 32, offset: 832)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !931, file: !611, line: 198, baseType: !300, size: 32, offset: 864)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "image", scope: !931, file: !611, line: 200, baseType: !952, size: 64, offset: 896)
!952 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !953, size: 64)
!953 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Image", file: !739, line: 77, size: 15424, elements: !954)
!954 = !{!955, !956, !957, !960, !963, !964, !967, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !987, !988, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1014, !1015, !1016, !1017, !1018, !1022}
!955 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !953, file: !739, line: 78, baseType: !475, size: 960)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !953, file: !739, line: 80, baseType: !494, size: 8192, offset: 960)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !953, file: !739, line: 82, baseType: !958, size: 64, offset: 9152)
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64)
!959 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovieCache", file: !739, line: 43, flags: DIFlagFwdDecl)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !953, file: !739, line: 83, baseType: !961, size: 64, offset: 9216)
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 64)
!962 = !DICompositeType(tag: DW_TAG_structure_type, name: "GPUTexture", file: !476, line: 46, flags: DIFlagFwdDecl)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !953, file: !739, line: 86, baseType: !737, size: 64, offset: 9280)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "rr", scope: !953, file: !739, line: 87, baseType: !965, size: 64, offset: 9344)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64)
!966 = !DICompositeType(tag: DW_TAG_structure_type, name: "RenderResult", file: !739, line: 44, flags: DIFlagFwdDecl)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "renders", scope: !953, file: !739, line: 89, baseType: !968, size: 512, offset: 9408)
!968 = !DICompositeType(tag: DW_TAG_array_type, baseType: !965, size: 512, elements: !969)
!969 = !{!970}
!970 = !DISubrange(count: 8)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "render_slot", scope: !953, file: !739, line: 90, baseType: !434, size: 16, offset: 9920)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "last_render_slot", scope: !953, file: !739, line: 90, baseType: !434, size: 16, offset: 9936)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !953, file: !739, line: 92, baseType: !434, size: 16, offset: 9952)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !953, file: !739, line: 92, baseType: !434, size: 16, offset: 9968)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !953, file: !739, line: 93, baseType: !434, size: 16, offset: 9984)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !953, file: !739, line: 93, baseType: !434, size: 16, offset: 10000)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "lastframe", scope: !953, file: !739, line: 94, baseType: !300, size: 32, offset: 10016)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "tpageflag", scope: !953, file: !739, line: 97, baseType: !434, size: 16, offset: 10048)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "totbind", scope: !953, file: !739, line: 97, baseType: !434, size: 16, offset: 10064)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "xrep", scope: !953, file: !739, line: 98, baseType: !434, size: 16, offset: 10080)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "yrep", scope: !953, file: !739, line: 98, baseType: !434, size: 16, offset: 10096)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "twsta", scope: !953, file: !739, line: 99, baseType: !434, size: 16, offset: 10112)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "twend", scope: !953, file: !739, line: 99, baseType: !434, size: 16, offset: 10128)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "bindcode", scope: !953, file: !739, line: 100, baseType: !5, size: 32, offset: 10144)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "repbind", scope: !953, file: !739, line: 101, baseType: !986, size: 64, offset: 10176)
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "packedfile", scope: !953, file: !739, line: 103, baseType: !501, size: 64, offset: 10240)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "preview", scope: !953, file: !739, line: 104, baseType: !989, size: 64, offset: 10304)
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 64)
!990 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PreviewImage", file: !476, line: 159, size: 448, elements: !991)
!991 = !{!992, !994, !995, !997, !998, !1000}
!992 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !990, file: !476, line: 161, baseType: !993, size: 64)
!993 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 64, elements: !428)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !990, file: !476, line: 162, baseType: !993, size: 64, offset: 64)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "changed", scope: !990, file: !476, line: 163, baseType: !996, size: 32, offset: 128)
!996 = !DICompositeType(tag: DW_TAG_array_type, baseType: !434, size: 32, elements: !428)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "changed_timestamp", scope: !990, file: !476, line: 164, baseType: !996, size: 32, offset: 160)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "rect", scope: !990, file: !476, line: 165, baseType: !999, size: 128, offset: 192)
!999 = !DICompositeType(tag: DW_TAG_array_type, baseType: !986, size: 128, elements: !428)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "gputexture", scope: !990, file: !476, line: 166, baseType: !1001, size: 128, offset: 320)
!1001 = !DICompositeType(tag: DW_TAG_array_type, baseType: !961, size: 128, elements: !428)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "lastupdate", scope: !953, file: !739, line: 107, baseType: !395, size: 32, offset: 10368)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "lastused", scope: !953, file: !739, line: 108, baseType: !300, size: 32, offset: 10400)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "animspeed", scope: !953, file: !739, line: 109, baseType: !434, size: 16, offset: 10432)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !953, file: !739, line: 110, baseType: !434, size: 16, offset: 10448)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "gen_x", scope: !953, file: !739, line: 113, baseType: !300, size: 32, offset: 10464)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "gen_y", scope: !953, file: !739, line: 113, baseType: !300, size: 32, offset: 10496)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "gen_type", scope: !953, file: !739, line: 114, baseType: !495, size: 8, offset: 10528)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "gen_flag", scope: !953, file: !739, line: 114, baseType: !495, size: 8, offset: 10536)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "gen_depth", scope: !953, file: !739, line: 115, baseType: !434, size: 16, offset: 10544)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "gen_color", scope: !953, file: !739, line: 116, baseType: !1012, size: 128, offset: 10560)
!1012 = !DICompositeType(tag: DW_TAG_array_type, baseType: !395, size: 128, elements: !1013)
!1013 = !{!868}
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "aspx", scope: !953, file: !739, line: 119, baseType: !395, size: 32, offset: 10688)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "aspy", scope: !953, file: !739, line: 119, baseType: !395, size: 32, offset: 10720)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !953, file: !739, line: 122, baseType: !771, size: 512, offset: 10752)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !953, file: !739, line: 123, baseType: !495, size: 8, offset: 11264)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !953, file: !739, line: 125, baseType: !1019, size: 56, offset: 11272)
!1019 = !DICompositeType(tag: DW_TAG_array_type, baseType: !495, size: 56, elements: !1020)
!1020 = !{!1021}
!1021 = !DISubrange(count: 7)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "render_slots", scope: !953, file: !739, line: 126, baseType: !1023, size: 4096, offset: 11328)
!1023 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1024, size: 4096, elements: !969)
!1024 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderSlot", file: !739, line: 69, baseType: !1025)
!1025 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RenderSlot", file: !739, line: 67, size: 512, elements: !1026)
!1026 = !{!1027}
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1025, file: !739, line: 68, baseType: !523, size: 512)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "image_opacity", scope: !931, file: !611, line: 201, baseType: !395, size: 32, offset: 960)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "last_marker", scope: !931, file: !611, line: 204, baseType: !300, size: 32, offset: 992)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !801, file: !611, line: 350, baseType: !533, size: 128, offset: 1984)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "objectnr", scope: !801, file: !611, line: 351, baseType: !300, size: 32, offset: 2112)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "tot_object", scope: !801, file: !611, line: 351, baseType: !300, size: 32, offset: 2144)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !801, file: !611, line: 353, baseType: !1034, size: 64, offset: 2176)
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 64)
!1035 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingStats", file: !611, line: 297, baseType: !1036)
!1036 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingStats", file: !611, line: 295, size: 2048, elements: !1037)
!1037 = !{!1038}
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !1036, file: !611, line: 296, baseType: !720, size: 2048)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "dopesheet", scope: !801, file: !611, line: 355, baseType: !1040, size: 384, offset: 2240)
!1040 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovieTrackingDopesheet", file: !611, line: 338, baseType: !1041)
!1041 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieTrackingDopesheet", file: !611, line: 322, size: 384, elements: !1042)
!1042 = !{!1043, !1044, !1045, !1046, !1047, !1048, !1049}
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !1041, file: !611, line: 323, baseType: !300, size: 32)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "sort_method", scope: !1041, file: !611, line: 325, baseType: !434, size: 16, offset: 32)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1041, file: !611, line: 326, baseType: !434, size: 16, offset: 48)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "coverage_segments", scope: !1041, file: !611, line: 331, baseType: !533, size: 128, offset: 64)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1041, file: !611, line: 334, baseType: !533, size: 128, offset: 192)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "tot_channel", scope: !1041, file: !611, line: 335, baseType: !300, size: 32, offset: 320)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1041, file: !611, line: 337, baseType: !300, size: 32, offset: 352)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "tracking_context", scope: !783, file: !784, line: 81, baseType: !394, size: 64, offset: 12224)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "proxy", scope: !783, file: !784, line: 85, baseType: !1052, size: 6208, offset: 12288)
!1052 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovieClipProxy", file: !784, line: 55, size: 6208, elements: !1053)
!1053 = !{!1054, !1055, !1056, !1057, !1058}
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !1052, file: !784, line: 56, baseType: !726, size: 6144)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !1052, file: !784, line: 58, baseType: !434, size: 16, offset: 6144)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1052, file: !784, line: 59, baseType: !434, size: 16, offset: 6160)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "build_size_flag", scope: !1052, file: !784, line: 60, baseType: !434, size: 16, offset: 6176)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "build_tc_flag", scope: !1052, file: !784, line: 61, baseType: !434, size: 16, offset: 6192)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !783, file: !784, line: 86, baseType: !300, size: 32, offset: 18496)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !783, file: !784, line: 88, baseType: !300, size: 32, offset: 18528)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !783, file: !784, line: 90, baseType: !300, size: 32, offset: 18560)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "frame_offset", scope: !783, file: !784, line: 94, baseType: !300, size: 32, offset: 18592)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace_settings", scope: !783, file: !784, line: 100, baseType: !771, size: 512, offset: 18624)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !675, file: !666, line: 154, baseType: !1065, size: 64, offset: 1664)
!1065 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1066, size: 64)
!1066 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mask", file: !1067, line: 264, flags: DIFlagFwdDecl)
!1067 = !DIFile(filename: "blender/source/blender/blenkernel/BKE_context.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/526.blender_r/build/build_base_ld-loop-ext-m64.0000")
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "anim", scope: !675, file: !666, line: 156, baseType: !737, size: 64, offset: 1728)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "effect_fader", scope: !675, file: !666, line: 158, baseType: !395, size: 32, offset: 1792)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "speed_fader", scope: !675, file: !666, line: 159, baseType: !395, size: 32, offset: 1824)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "seq1", scope: !675, file: !666, line: 162, baseType: !678, size: 64, offset: 1856)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "seq2", scope: !675, file: !666, line: 162, baseType: !678, size: 64, offset: 1920)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "seq3", scope: !675, file: !666, line: 162, baseType: !678, size: 64, offset: 1984)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "seqbase", scope: !675, file: !666, line: 164, baseType: !533, size: 128, offset: 2048)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "sound", scope: !675, file: !666, line: 166, baseType: !1076, size: 64, offset: 2176)
!1076 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1077, size: 64)
!1077 = !DICompositeType(tag: DW_TAG_structure_type, name: "bSound", file: !666, line: 51, flags: DIFlagFwdDecl)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "scene_sound", scope: !675, file: !666, line: 167, baseType: !394, size: 64, offset: 2240)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "volume", scope: !675, file: !666, line: 168, baseType: !395, size: 32, offset: 2304)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "pitch", scope: !675, file: !666, line: 170, baseType: !395, size: 32, offset: 2336)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "pan", scope: !675, file: !666, line: 170, baseType: !395, size: 32, offset: 2368)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "strobe", scope: !675, file: !666, line: 171, baseType: !395, size: 32, offset: 2400)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "effectdata", scope: !675, file: !666, line: 173, baseType: !394, size: 64, offset: 2432)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "anim_startofs", scope: !675, file: !666, line: 175, baseType: !300, size: 32, offset: 2496)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "anim_endofs", scope: !675, file: !666, line: 176, baseType: !300, size: 32, offset: 2528)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "blend_mode", scope: !675, file: !666, line: 179, baseType: !300, size: 32, offset: 2560)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "blend_opacity", scope: !675, file: !666, line: 180, baseType: !395, size: 32, offset: 2592)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "sfra", scope: !675, file: !666, line: 183, baseType: !300, size: 32, offset: 2624)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_mode", scope: !675, file: !666, line: 185, baseType: !495, size: 8, offset: 2656)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !675, file: !666, line: 186, baseType: !1091, size: 24, offset: 2664)
!1091 = !DICompositeType(tag: DW_TAG_array_type, baseType: !495, size: 24, elements: !580)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "modifiers", scope: !675, file: !666, line: 189, baseType: !533, size: 128, offset: 2688)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "act_imagedir", scope: !665, file: !666, line: 207, baseType: !494, size: 8192, offset: 384)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "act_sounddir", scope: !665, file: !666, line: 208, baseType: !494, size: 8192, offset: 8576)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "over_ofs", scope: !665, file: !666, line: 210, baseType: !300, size: 32, offset: 16768)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "over_cfra", scope: !665, file: !666, line: 210, baseType: !300, size: 32, offset: 16800)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "over_flag", scope: !665, file: !666, line: 211, baseType: !300, size: 32, offset: 16832)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !665, file: !666, line: 211, baseType: !300, size: 32, offset: 16864)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "over_border", scope: !665, file: !666, line: 212, baseType: !407, size: 128, offset: 16896)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "toolsettings", scope: !549, file: !550, line: 1246, baseType: !1101, size: 64, offset: 2112)
!1101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1102, size: 64)
!1102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ToolSettings", file: !550, line: 1067, size: 5184, elements: !1103)
!1103 = !{!1104, !1134, !1135, !1150, !1156, !1157, !1158, !1159, !1160, !1161, !1162, !1163, !1164, !1165, !1166, !1167, !1168, !1172, !1188, !1215, !1216, !1217, !1218, !1219, !1220, !1221, !1222, !1223, !1224, !1225, !1226, !1227, !1228, !1229, !1230, !1231, !1232, !1233, !1234, !1235, !1236, !1237, !1238, !1239, !1240, !1241, !1242, !1243, !1245, !1246, !1247, !1248, !1249, !1250, !1251, !1252, !1253, !1254, !1255, !1256, !1257, !1258, !1259, !1260, !1261, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1270, !1298}
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint", scope: !1102, file: !550, line: 1068, baseType: !1105, size: 64)
!1105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1106, size: 64)
!1106 = !DIDerivedType(tag: DW_TAG_typedef, name: "VPaint", file: !550, line: 934, baseType: !1107)
!1107 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VPaint", file: !550, line: 925, size: 576, elements: !1108)
!1108 = !{!1109, !1126, !1127, !1128, !1129, !1130, !1133}
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !1107, file: !550, line: 926, baseType: !1110, size: 320)
!1110 = !DIDerivedType(tag: DW_TAG_typedef, name: "Paint", file: !550, line: 830, baseType: !1111)
!1111 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Paint", file: !550, line: 813, size: 320, elements: !1112)
!1112 = !{!1113, !1116, !1119, !1120, !1123, !1124, !1125}
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "brush", scope: !1111, file: !550, line: 814, baseType: !1114, size: 64)
!1114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1115, size: 64)
!1115 = !DICompositeType(tag: DW_TAG_structure_type, name: "Brush", file: !550, line: 51, flags: DIFlagFwdDecl)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "palette", scope: !1111, file: !550, line: 815, baseType: !1117, size: 64, offset: 64)
!1117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1118, size: 64)
!1118 = !DICompositeType(tag: DW_TAG_structure_type, name: "Palette", file: !550, line: 815, flags: DIFlagFwdDecl)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor", scope: !1111, file: !550, line: 818, baseType: !394, size: 64, offset: 128)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "paint_cursor_col", scope: !1111, file: !550, line: 819, baseType: !1121, size: 32, offset: 192)
!1121 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1122, size: 32, elements: !1013)
!1122 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1111, file: !550, line: 822, baseType: !300, size: 32, offset: 224)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "num_input_samples", scope: !1111, file: !550, line: 826, baseType: !300, size: 32, offset: 256)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "symmetry_flags", scope: !1111, file: !550, line: 829, baseType: !300, size: 32, offset: 288)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1107, file: !550, line: 928, baseType: !434, size: 16, offset: 320)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1107, file: !550, line: 928, baseType: !434, size: 16, offset: 336)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "tot", scope: !1107, file: !550, line: 929, baseType: !300, size: 32, offset: 352)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "vpaint_prev", scope: !1107, file: !550, line: 930, baseType: !986, size: 64, offset: 384)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint_prev", scope: !1107, file: !550, line: 931, baseType: !1131, size: 64, offset: 448)
!1131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1132, size: 64)
!1132 = !DICompositeType(tag: DW_TAG_structure_type, name: "MDeformVert", file: !550, line: 931, flags: DIFlagFwdDecl)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !1107, file: !550, line: 933, baseType: !394, size: 64, offset: 512)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "wpaint", scope: !1102, file: !550, line: 1069, baseType: !1105, size: 64, offset: 64)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "sculpt", scope: !1102, file: !550, line: 1070, baseType: !1136, size: 64, offset: 128)
!1136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1137, size: 64)
!1137 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sculpt", file: !550, line: 916, baseType: !1138)
!1138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Sculpt", file: !550, line: 891, size: 704, elements: !1139)
!1139 = !{!1140, !1141, !1142, !1144, !1145, !1146, !1147, !1148, !1149}
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !1138, file: !550, line: 892, baseType: !1110, size: 320)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1138, file: !550, line: 896, baseType: !300, size: 32, offset: 320)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "radial_symm", scope: !1138, file: !550, line: 900, baseType: !1143, size: 96, offset: 352)
!1143 = !DICompositeType(tag: DW_TAG_array_type, baseType: !300, size: 96, elements: !580)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "detail_size", scope: !1138, file: !550, line: 903, baseType: !395, size: 32, offset: 448)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "symmetrize_direction", scope: !1138, file: !550, line: 906, baseType: !300, size: 32, offset: 480)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "gravity_factor", scope: !1138, file: !550, line: 909, baseType: !395, size: 32, offset: 512)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "constant_detail", scope: !1138, file: !550, line: 912, baseType: !395, size: 32, offset: 544)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "gravity_object", scope: !1138, file: !550, line: 914, baseType: !558, size: 64, offset: 576)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "pad2", scope: !1138, file: !550, line: 915, baseType: !394, size: 64, offset: 640)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "uvsculpt", scope: !1102, file: !550, line: 1071, baseType: !1151, size: 64, offset: 192)
!1151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1152, size: 64)
!1152 = !DIDerivedType(tag: DW_TAG_typedef, name: "UvSculpt", file: !550, line: 920, baseType: !1153)
!1153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UvSculpt", file: !550, line: 918, size: 320, elements: !1154)
!1154 = !{!1155}
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !1153, file: !550, line: 919, baseType: !1110, size: 320)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "vgroup_weight", scope: !1102, file: !550, line: 1075, baseType: !395, size: 32, offset: 256)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "doublimit", scope: !1102, file: !550, line: 1077, baseType: !395, size: 32, offset: 288)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "normalsize", scope: !1102, file: !550, line: 1078, baseType: !395, size: 32, offset: 320)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "automerge", scope: !1102, file: !550, line: 1079, baseType: !434, size: 16, offset: 352)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "selectmode", scope: !1102, file: !550, line: 1082, baseType: !434, size: 16, offset: 368)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "unwrapper", scope: !1102, file: !550, line: 1085, baseType: !495, size: 8, offset: 384)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "uvcalc_flag", scope: !1102, file: !550, line: 1086, baseType: !495, size: 8, offset: 392)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "uv_flag", scope: !1102, file: !550, line: 1087, baseType: !495, size: 8, offset: 400)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "uv_selectmode", scope: !1102, file: !550, line: 1088, baseType: !495, size: 8, offset: 408)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "uvcalc_margin", scope: !1102, file: !550, line: 1090, baseType: !395, size: 32, offset: 416)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "autoik_chainlen", scope: !1102, file: !550, line: 1093, baseType: !434, size: 16, offset: 448)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "gpencil_flags", scope: !1102, file: !550, line: 1096, baseType: !495, size: 8, offset: 464)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1102, file: !550, line: 1098, baseType: !1169, size: 40, offset: 472)
!1169 = !DICompositeType(tag: DW_TAG_array_type, baseType: !495, size: 40, elements: !1170)
!1170 = !{!1171}
!1171 = !DISubrange(count: 5)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "imapaint", scope: !1102, file: !550, line: 1101, baseType: !1173, size: 832, offset: 512)
!1173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ImagePaintSettings", file: !550, line: 836, size: 832, elements: !1174)
!1174 = !{!1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187}
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "paint", scope: !1173, file: !550, line: 837, baseType: !1110, size: 320)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !1173, file: !550, line: 839, baseType: !434, size: 16, offset: 320)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "missing_data", scope: !1173, file: !550, line: 839, baseType: !434, size: 16, offset: 336)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "seam_bleed", scope: !1173, file: !550, line: 842, baseType: !434, size: 16, offset: 352)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "normal_angle", scope: !1173, file: !550, line: 842, baseType: !434, size: 16, offset: 368)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "screen_grab_size", scope: !1173, file: !550, line: 843, baseType: !996, size: 32, offset: 384)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1173, file: !550, line: 845, baseType: !300, size: 32, offset: 416)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "paintcursor", scope: !1173, file: !550, line: 847, baseType: !394, size: 64, offset: 448)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "stencil", scope: !1173, file: !550, line: 848, baseType: !952, size: 64, offset: 512)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "clone", scope: !1173, file: !550, line: 849, baseType: !952, size: 64, offset: 576)
