; ModuleID = 'neval.cpp'
source_filename = "neval.cpp"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.state_t = type { i32, [64 x i32], i64, i64, i64, [13 x i64], i32, i32, [13 x i32], i32, i32, i32, i32, i32, i32, i32, i64, i64, [64 x %struct.move_x], [64 x i32], [64 x i32], [64 x %struct.anon], i64, i64, i32, [64 x i32], i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [1000 x i64] }
%struct.move_x = type { i32, i32, i32, i32, i64, i64 }
%struct.anon = type { i32, i32, i32, i32 }
%struct.t_eval_comps = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.pawntt_t = type { i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i32, i32 }
%struct.attackinfo_t = type { i64, i64, i64, i64, i64, i64, i64, i64, i64, i64 }

$_ZSt3minIiERKT_S2_S2_ = comdat any

@material = dso_local constant [14 x i32] [i32 0, i32 85, i32 -85, i32 305, i32 -305, i32 40000, i32 -40000, i32 490, i32 -490, i32 935, i32 -935, i32 330, i32 -330, i32 0], align 16, !dbg !0
@FileMask = external dso_local global [8 x i64], align 16
@KnightMoves = external dso_local global [64 x i64], align 16
@KingFilesMask = external dso_local global [8 x i64], align 16
@RankMask = external dso_local global [8 x i64], align 16
@KingPressureMask = external dso_local global [64 x i64], align 16
@KingPressureMask1 = external dso_local global [64 x i64], align 16

!329 = !DISubprogram(name: "rintl", scope: !33, file: !33, line: 256, type: !104, flags: DIFlagPrototyped, spFlags: 0)
!330 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !25, entity: !331, file: !37, line: 1191)
!331 = !DISubprogram(name: "round", scope: !33, file: !33, line: 298, type: !34, flags: DIFlagPrototyped, spFlags: 0)
!332 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !25, entity: !333, file: !37, line: 1192)
!333 = !DISubprogram(name: "roundf", scope: !33, file: !33, line: 298, type: !100, flags: DIFlagPrototyped, spFlags: 0)
!334 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !25, entity: !335, file: !37, line: 1193)
!335 = !DISubprogram(name: "roundl", scope: !33, file: !33, line: 298, type: !104, flags: DIFlagPrototyped, spFlags: 0)
!336 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !25, entity: !337, file: !37, line: 1195)
!337 = !DISubprogram(name: "scalbln", scope: !33, file: !33, line: 290, type: !338, flags: DIFlagPrototyped, spFlags: 0)
!338 = !DISubroutineType(types: !339)
!339 = !{!36, !36, !254}
!340 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !25, entity: !341, file: !37, line: 1196)
!341 = !DISubprogram(name: "scalblnf", scope: !33, file: !33, line: 290, type: !342, flags: DIFlagPrototyped, spFlags: 0)
!342 = !DISubroutineType(types: !343)
!343 = !{!95, !95, !254}
!344 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !25, entity: !345, file: !37, line: 1197)
!345 = !DISubprogram(name: "scalblnl", scope: !33, file: !33, line: 290, type: !346, flags: DIFlagPrototyped, spFlags: 0)
!346 = !DISubroutineType(types: !347)
!347 = !{!106, !106, !254}
!348 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !25, entity: !349, file: !37, line: 1199)
!349 = !DISubprogram(name: "scalbn", scope: !33, file: !33, line: 276, type: !67, flags: DIFlagPrototyped, spFlags: 0)
!350 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !25, entity: !351, file: !37, line: 1200)
!351 = !DISubprogram(name: "scalbnf", scope: !33, file: !33, line: 276, type: !352, flags: DIFlagPrototyped, spFlags: 0)
!352 = !DISubroutineType(types: !353)
!353 = !{!95, !95, !10}
!354 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !25, entity: !355, file: !37, line: 1201)
!355 = !DISubprogram(name: "scalbnl", scope: !33, file: !33, line: 276, type: !356, flags: DIFlagPrototyped, spFlags: 0)
!356 = !DISubroutineType(types: !357)
!357 = !{!106, !106, !10}
!358 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !25, entity: !359, file: !37, line: 1203)
!359 = !DISubprogram(name: "tgamma", scope: !33, file: !33, line: 235, type: !34, flags: DIFlagPrototyped, spFlags: 0)
!360 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !25, entity: !361, file: !37, line: 1204)
!361 = !DISubprogram(name: "tgammaf", scope: !33, file: !33, line: 235, type: !100, flags: DIFlagPrototyped, spFlags: 0)
!362 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !25, entity: !363, file: !37, line: 1205)
!363 = !DISubprogram(name: "tgammal", scope: !33, file: !33, line: 235, type: !104, flags: DIFlagPrototyped, spFlags: 0)
!364 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !25, entity: !365, file: !37, line: 1207)
!365 = !DISubprogram(name: "trunc", scope: !33, file: !33, line: 302, type: !34, flags: DIFlagPrototyped, spFlags: 0)
!366 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !25, entity: !367, file: !37, line: 1208)
!367 = !DISubprogram(name: "truncf", scope: !33, file: !33, line: 302, type: !100, flags: DIFlagPrototyped, spFlags: 0)
!368 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !25, entity: !369, file: !37, line: 1209)
!369 = !DISubprogram(name: "truncl", scope: !33, file: !33, line: 302, type: !104, flags: DIFlagPrototyped, spFlags: 0)
!370 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !371, file: !375, line: 38)
!371 = !DISubprogram(name: "abs", linkageName: "_ZSt3absg", scope: !25, file: !30, line: 103, type: !372, flags: DIFlagPrototyped, spFlags: 0)
!372 = !DISubroutineType(types: !373)
!373 = !{!374, !374}
!374 = !DIBasicType(name: "__float128", size: 128, encoding: DW_ATE_float)
!375 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/math.h", directory: "")
!376 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !377, file: !375, line: 54)
!377 = !DISubprogram(name: "modf", linkageName: "_ZSt4modfePe", scope: !25, file: !37, line: 380, type: !378, flags: DIFlagPrototyped, spFlags: 0)
!378 = !DISubroutineType(types: !379)
!379 = !{!106, !106, !380}
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!381 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !382, entity: !383, file: !384, line: 58)
!382 = !DINamespace(name: "__gnu_debug", scope: null)
!383 = !DINamespace(name: "__debug", scope: !25)
!384 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/debug/debug.h", directory: "")
!385 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !25, entity: !386, file: !388, line: 127)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "div_t", file: !27, line: 62, baseType: !387)
!387 = !DICompositeType(tag: DW_TAG_structure_type, file: !27, line: 58, flags: DIFlagFwdDecl, identifier: "_ZTS5div_t")
!388 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/cstdlib", directory: "")
!389 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !25, entity: !390, file: !388, line: 128)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "ldiv_t", file: !27, line: 70, baseType: !391)
!391 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !27, line: 66, size: 128, flags: DIFlagTypePassByValue, elements: !392, identifier: "_ZTS6ldiv_t")
!392 = !{!393, !394}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !391, file: !27, line: 68, baseType: !254, size: 64)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !391, file: !27, line: 69, baseType: !254, size: 64, offset: 64)
!395 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !25, entity: !396, file: !388, line: 130)
!396 = !DISubprogram(name: "abort", scope: !27, file: !27, line: 591, type: !397, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!397 = !DISubroutineType(types: !398)
!398 = !{null}
!399 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !25, entity: !400, file: !388, line: 134)
!400 = !DISubprogram(name: "atexit", scope: !27, file: !27, line: 595, type: !401, flags: DIFlagPrototyped, spFlags: 0)
!401 = !DISubroutineType(types: !402)
!402 = !{!10, !403}
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!404 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !25, entity: !405, file: !388, line: 137)
!405 = !DISubprogram(name: "at_quick_exit", scope: !27, file: !27, line: 600, type: !401, flags: DIFlagPrototyped, spFlags: 0)
!406 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !25, entity: !407, file: !388, line: 140)
!407 = !DISubprogram(name: "atof", scope: !27, file: !27, line: 101, type: !271, flags: DIFlagPrototyped, spFlags: 0)
!408 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !25, entity: !409, file: !388, line: 141)
!409 = !DISubprogram(name: "atoi", scope: !27, file: !27, line: 104, type: !410, flags: DIFlagPrototyped, spFlags: 0)
!410 = !DISubroutineType(types: !411)
!411 = !{!10, !273}
!412 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !25, entity: !413, file: !388, line: 142)
!413 = !DISubprogram(name: "atol", scope: !27, file: !27, line: 107, type: !414, flags: DIFlagPrototyped, spFlags: 0)
!414 = !DISubroutineType(types: !415)
!415 = !{!254, !273}
!416 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !25, entity: !417, file: !388, line: 143)
!417 = !DISubprogram(name: "bsearch", scope: !27, file: !27, line: 820, type: !418, flags: DIFlagPrototyped, spFlags: 0)
!418 = !DISubroutineType(types: !419)
!419 = !{!420, !421, !421, !423, !423, !426}
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!422 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !424, line: 46, baseType: !425)
!424 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!425 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "__compar_fn_t", file: !27, line: 808, baseType: !427)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!428 = !DISubroutineType(types: !429)
!429 = !{!10, !421, !421}
!430 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !25, entity: !431, file: !388, line: 144)
!431 = !DISubprogram(name: "calloc", scope: !27, file: !27, line: 542, type: !432, flags: DIFlagPrototyped, spFlags: 0)
!432 = !DISubroutineType(types: !433)
!433 = !{!420, !423, !423}
!434 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !25, entity: !435, file: !388, line: 145)
!435 = !DISubprogram(name: "div", scope: !27, file: !27, line: 852, type: !436, flags: DIFlagPrototyped, spFlags: 0)
!436 = !DISubroutineType(types: !437)
!437 = !{!386, !10, !10}
!438 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !25, entity: !439, file: !388, line: 146)
!439 = !DISubprogram(name: "exit", scope: !27, file: !27, line: 617, type: !440, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!440 = !DISubroutineType(types: !441)
!441 = !{null, !10}
!442 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !25, entity: !443, file: !388, line: 147)
!443 = !DISubprogram(name: "free", scope: !27, file: !27, line: 565, type: !444, flags: DIFlagPrototyped, spFlags: 0)
!444 = !DISubroutineType(types: !445)
!445 = !{null, !420}
!446 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !25, entity: !447, file: !388, line: 148)
!447 = !DISubprogram(name: "getenv", scope: !27, file: !27, line: 634, type: !448, flags: DIFlagPrototyped, spFlags: 0)
!448 = !DISubroutineType(types: !449)
!449 = !{!450, !273}
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!451 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !25, entity: !452, file: !388, line: 149)
!452 = !DISubprogram(name: "labs", scope: !27, file: !27, line: 841, type: !453, flags: DIFlagPrototyped, spFlags: 0)
!453 = !DISubroutineType(types: !454)
!454 = !{!254, !254}
!455 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !25, entity: !456, file: !388, line: 150)
!456 = !DISubprogram(name: "ldiv", scope: !27, file: !27, line: 854, type: !457, flags: DIFlagPrototyped, spFlags: 0)
!457 = !DISubroutineType(types: !458)
!458 = !{!390, !254, !254}
!459 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !25, entity: !460, file: !388, line: 151)
!460 = !DISubprogram(name: "malloc", scope: !27, file: !27, line: 539, type: !461, flags: DIFlagPrototyped, spFlags: 0)
!461 = !DISubroutineType(types: !462)
!462 = !{!420, !423}
!463 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !25, entity: !464, file: !388, line: 153)
!464 = !DISubprogram(name: "mblen", scope: !27, file: !27, line: 922, type: !465, flags: DIFlagPrototyped, spFlags: 0)
!465 = !DISubroutineType(types: !466)
!466 = !{!10, !273, !423}
!467 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !25, entity: !468, file: !388, line: 154)
!468 = !DISubprogram(name: "mbstowcs", scope: !27, file: !27, line: 933, type: !469, flags: DIFlagPrototyped, spFlags: 0)
!469 = !DISubroutineType(types: !470)
!470 = !{!423, !471, !474, !423}
!471 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !472)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = !DIBasicType(name: "wchar_t", size: 32, encoding: DW_ATE_signed)
!474 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !273)
!475 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !25, entity: !476, file: !388, line: 155)
!476 = !DISubprogram(name: "mbtowc", scope: !27, file: !27, line: 925, type: !477, flags: DIFlagPrototyped, spFlags: 0)
!477 = !DISubroutineType(types: !478)
!478 = !{!10, !471, !474, !423}
!479 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !25, entity: !480, file: !388, line: 157)
!480 = !DISubprogram(name: "qsort", scope: !27, file: !27, line: 830, type: !481, flags: DIFlagPrototyped, spFlags: 0)
!481 = !DISubroutineType(types: !482)
!482 = !{null, !420, !423, !423, !426}
!483 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !25, entity: !484, file: !388, line: 160)
!484 = !DISubprogram(name: "quick_exit", scope: !27, file: !27, line: 623, type: !440, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!485 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !25, entity: !486, file: !388, line: 163)
!486 = !DISubprogram(name: "rand", scope: !27, file: !27, line: 453, type: !487, flags: DIFlagPrototyped, spFlags: 0)
!487 = !DISubroutineType(types: !488)
!488 = !{!10}
!489 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !25, entity: !490, file: !388, line: 164)
!490 = !DISubprogram(name: "realloc", scope: !27, file: !27, line: 550, type: !491, flags: DIFlagPrototyped, spFlags: 0)
!491 = !DISubroutineType(types: !492)
!492 = !{!420, !420, !423}
!493 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !25, entity: !494, file: !388, line: 165)
!494 = !DISubprogram(name: "srand", scope: !27, file: !27, line: 455, type: !495, flags: DIFlagPrototyped, spFlags: 0)
!495 = !DISubroutineType(types: !496)
!496 = !{null, !497}
!497 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!498 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !25, entity: !499, file: !388, line: 166)
!499 = !DISubprogram(name: "strtod", scope: !27, file: !27, line: 117, type: !500, flags: DIFlagPrototyped, spFlags: 0)
!500 = !DISubroutineType(types: !501)
!501 = !{!36, !474, !502}
!502 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !503)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!504 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !25, entity: !505, file: !388, line: 167)
!505 = !DISubprogram(name: "strtol", scope: !27, file: !27, line: 176, type: !506, flags: DIFlagPrototyped, spFlags: 0)
!506 = !DISubroutineType(types: !507)
!507 = !{!254, !474, !502, !10}
!508 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !25, entity: !509, file: !388, line: 168)
!509 = !DISubprogram(name: "strtoul", scope: !27, file: !27, line: 180, type: !510, flags: DIFlagPrototyped, spFlags: 0)
!510 = !DISubroutineType(types: !511)
!511 = !{!425, !474, !502, !10}
!512 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !25, entity: !513, file: !388, line: 169)
!513 = !DISubprogram(name: "system", scope: !27, file: !27, line: 784, type: !410, flags: DIFlagPrototyped, spFlags: 0)
!514 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !25, entity: !515, file: !388, line: 171)
!515 = !DISubprogram(name: "wcstombs", scope: !27, file: !27, line: 936, type: !516, flags: DIFlagPrototyped, spFlags: 0)
!516 = !DISubroutineType(types: !517)
!517 = !{!423, !518, !519, !423}
!518 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !450)
!519 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !520)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 64)
!521 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !473)
!522 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !25, entity: !523, file: !388, line: 172)
!523 = !DISubprogram(name: "wctomb", scope: !27, file: !27, line: 929, type: !524, flags: DIFlagPrototyped, spFlags: 0)
!524 = !DISubroutineType(types: !525)
!525 = !{!10, !450, !473}
!526 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !527, entity: !528, file: !388, line: 200)
!527 = !DINamespace(name: "__gnu_cxx", scope: null)
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "lldiv_t", file: !27, line: 80, baseType: !529)
!529 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !27, line: 76, size: 128, flags: DIFlagTypePassByValue, elements: !530, identifier: "_ZTS7lldiv_t")
!530 = !{!531, !532}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !529, file: !27, line: 78, baseType: !217, size: 64)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !529, file: !27, line: 79, baseType: !217, size: 64, offset: 64)
!533 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !527, entity: !534, file: !388, line: 206)
!534 = !DISubprogram(name: "_Exit", scope: !27, file: !27, line: 629, type: !440, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!535 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !527, entity: !536, file: !388, line: 210)
!536 = !DISubprogram(name: "llabs", scope: !27, file: !27, line: 844, type: !537, flags: DIFlagPrototyped, spFlags: 0)
!537 = !DISubroutineType(types: !538)
!538 = !{!217, !217}
!539 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !527, entity: !540, file: !388, line: 216)
!540 = !DISubprogram(name: "lldiv", scope: !27, file: !27, line: 858, type: !541, flags: DIFlagPrototyped, spFlags: 0)
!541 = !DISubroutineType(types: !542)
!542 = !{!528, !217, !217}
!543 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !527, entity: !544, file: !388, line: 227)
!544 = !DISubprogram(name: "atoll", scope: !27, file: !27, line: 112, type: !545, flags: DIFlagPrototyped, spFlags: 0)
!545 = !DISubroutineType(types: !546)
!546 = !{!217, !273}
!547 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !527, entity: !548, file: !388, line: 228)
!548 = !DISubprogram(name: "strtoll", scope: !27, file: !27, line: 200, type: !549, flags: DIFlagPrototyped, spFlags: 0)
!549 = !DISubroutineType(types: !550)
!550 = !{!217, !474, !502, !10}
!551 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !527, entity: !552, file: !388, line: 229)
!552 = !DISubprogram(name: "strtoull", scope: !27, file: !27, line: 205, type: !553, flags: DIFlagPrototyped, spFlags: 0)
!553 = !DISubroutineType(types: !554)
!554 = !{!555, !474, !502, !10}
!555 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!556 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !527, entity: !557, file: !388, line: 231)
!557 = !DISubprogram(name: "strtof", scope: !27, file: !27, line: 123, type: !558, flags: DIFlagPrototyped, spFlags: 0)
!558 = !DISubroutineType(types: !559)
!559 = !{!95, !474, !502}
!560 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !527, entity: !561, file: !388, line: 232)
!561 = !DISubprogram(name: "strtold", scope: !27, file: !27, line: 126, type: !562, flags: DIFlagPrototyped, spFlags: 0)
!562 = !DISubroutineType(types: !563)
!563 = !{!106, !474, !502}
!564 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !25, entity: !528, file: !388, line: 240)
!565 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !25, entity: !534, file: !388, line: 242)
!566 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !25, entity: !536, file: !388, line: 244)
!567 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !25, entity: !568, file: !388, line: 245)
!568 = !DISubprogram(name: "div", linkageName: "_ZN9__gnu_cxx3divExx", scope: !527, file: !388, line: 213, type: !541, flags: DIFlagPrototyped, spFlags: 0)
!569 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !25, entity: !540, file: !388, line: 246)
!570 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !25, entity: !544, file: !388, line: 248)
!571 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !25, entity: !557, file: !388, line: 249)
!572 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !25, entity: !548, file: !388, line: 250)
!573 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !25, entity: !552, file: !388, line: 251)
!574 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !25, entity: !561, file: !388, line: 252)
!575 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !25, entity: !576, file: !577, line: 58)
!576 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "exception_ptr", scope: !578, file: !577, line: 80, size: 64, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !579, identifier: "_ZTSNSt15__exception_ptr13exception_ptrE")
!577 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/bits/exception_ptr.h", directory: "")
!578 = !DINamespace(name: "__exception_ptr", scope: !25)
!579 = !{!580, !581, !585, !588, !589, !594, !595, !599, !605, !609, !613, !616, !617, !620, !624}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "_M_exception_object", scope: !576, file: !577, line: 82, baseType: !420, size: 64)
!581 = !DISubprogram(name: "exception_ptr", scope: !576, file: !577, line: 84, type: !582, scopeLine: 84, flags: DIFlagExplicit | DIFlagPrototyped, spFlags: 0)
!582 = !DISubroutineType(types: !583)
!583 = !{null, !584, !420}
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!585 = !DISubprogram(name: "_M_addref", linkageName: "_ZNSt15__exception_ptr13exception_ptr9_M_addrefEv", scope: !576, file: !577, line: 86, type: !586, scopeLine: 86, flags: DIFlagPrototyped, spFlags: 0)
!586 = !DISubroutineType(types: !587)
!587 = !{null, !584}
!588 = !DISubprogram(name: "_M_release", linkageName: "_ZNSt15__exception_ptr13exception_ptr10_M_releaseEv", scope: !576, file: !577, line: 87, type: !586, scopeLine: 87, flags: DIFlagPrototyped, spFlags: 0)
!589 = !DISubprogram(name: "_M_get", linkageName: "_ZNKSt15__exception_ptr13exception_ptr6_M_getEv", scope: !576, file: !577, line: 89, type: !590, scopeLine: 89, flags: DIFlagPrototyped, spFlags: 0)
!590 = !DISubroutineType(types: !591)
!591 = !{!420, !592}
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!593 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !576)
!594 = !DISubprogram(name: "exception_ptr", scope: !576, file: !577, line: 97, type: !586, scopeLine: 97, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!595 = !DISubprogram(name: "exception_ptr", scope: !576, file: !577, line: 99, type: !596, scopeLine: 99, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!596 = !DISubroutineType(types: !597)
!597 = !{null, !584, !598}
!598 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !593, size: 64)
!599 = !DISubprogram(name: "exception_ptr", scope: !576, file: !577, line: 102, type: !600, scopeLine: 102, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!600 = !DISubroutineType(types: !601)
!601 = !{null, !584, !602}
!602 = !DIDerivedType(tag: DW_TAG_typedef, name: "nullptr_t", scope: !25, file: !603, line: 264, baseType: !604)
!603 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/x86_64-linux-gnu/c++/10/bits/c++config.h", directory: "")
!604 = !DIBasicType(tag: DW_TAG_unspecified_type, name: "decltype(nullptr)")
!605 = !DISubprogram(name: "exception_ptr", scope: !576, file: !577, line: 106, type: !606, scopeLine: 106, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!606 = !DISubroutineType(types: !607)
!607 = !{null, !584, !608}
!608 = !DIDerivedType(tag: DW_TAG_rvalue_reference_type, baseType: !576, size: 64)
!609 = !DISubprogram(name: "operator=", linkageName: "_ZNSt15__exception_ptr13exception_ptraSERKS0_", scope: !576, file: !577, line: 119, type: !610, scopeLine: 119, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!610 = !DISubroutineType(types: !611)
!611 = !{!612, !584, !598}
!612 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !576, size: 64)
!613 = !DISubprogram(name: "operator=", linkageName: "_ZNSt15__exception_ptr13exception_ptraSEOS0_", scope: !576, file: !577, line: 123, type: !614, scopeLine: 123, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!614 = !DISubroutineType(types: !615)
!615 = !{!612, !584, !608}
!616 = !DISubprogram(name: "~exception_ptr", scope: !576, file: !577, line: 130, type: !586, scopeLine: 130, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!617 = !DISubprogram(name: "swap", linkageName: "_ZNSt15__exception_ptr13exception_ptr4swapERS0_", scope: !576, file: !577, line: 133, type: !618, scopeLine: 133, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!618 = !DISubroutineType(types: !619)
!619 = !{null, !584, !612}
!620 = !DISubprogram(name: "operator bool", linkageName: "_ZNKSt15__exception_ptr13exception_ptrcvbEv", scope: !576, file: !577, line: 145, type: !621, scopeLine: 145, flags: DIFlagPublic | DIFlagExplicit | DIFlagPrototyped, spFlags: 0)
!621 = !DISubroutineType(types: !622)
!622 = !{!623, !592}
!623 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!624 = !DISubprogram(name: "__cxa_exception_type", linkageName: "_ZNKSt15__exception_ptr13exception_ptr20__cxa_exception_typeEv", scope: !576, file: !577, line: 154, type: !625, scopeLine: 154, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!625 = !DISubroutineType(types: !626)
!626 = !{!627, !592}
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 64)
!628 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !629)
!629 = !DICompositeType(tag: DW_TAG_class_type, name: "type_info", scope: !25, file: !630, line: 88, flags: DIFlagFwdDecl)
!630 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/typeinfo", directory: "")
!631 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !578, entity: !632, file: !577, line: 74)
!632 = !DISubprogram(name: "rethrow_exception", linkageName: "_ZSt17rethrow_exceptionNSt15__exception_ptr13exception_ptrE", scope: !25, file: !577, line: 70, type: !633, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!633 = !DISubroutineType(types: !634)
!634 = !{null, !576}
!635 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !396, file: !636, line: 38)
!636 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/stdlib.h", directory: "")
!637 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !400, file: !636, line: 39)
!638 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !439, file: !636, line: 40)
!639 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !405, file: !636, line: 43)
!640 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !484, file: !636, line: 46)
!641 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !386, file: !636, line: 51)
!642 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !390, file: !636, line: 52)
!643 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !371, file: !636, line: 54)
!644 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !407, file: !636, line: 55)
!645 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !409, file: !636, line: 56)
!646 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !413, file: !636, line: 57)
!647 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !417, file: !636, line: 58)
!648 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !431, file: !636, line: 59)
!649 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !568, file: !636, line: 60)
!650 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !443, file: !636, line: 61)
!651 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !447, file: !636, line: 62)
!652 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !452, file: !636, line: 63)
!653 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !456, file: !636, line: 64)
!654 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !460, file: !636, line: 65)
!655 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !464, file: !636, line: 67)
!656 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !468, file: !636, line: 68)
!657 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !476, file: !636, line: 69)
!658 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !480, file: !636, line: 71)
!659 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !486, file: !636, line: 72)
!660 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !490, file: !636, line: 73)
!661 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !494, file: !636, line: 74)
!662 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !499, file: !636, line: 75)
!663 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !505, file: !636, line: 76)
!664 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !509, file: !636, line: 77)
!665 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !513, file: !636, line: 78)
!666 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !515, file: !636, line: 80)
!667 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !523, file: !636, line: 81)
!668 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 448, elements: !669)
!669 = !{!670}
!670 = !DISubrange(count: 14)
!671 = !{i32 7, !"Dwarf Version", i32 4}
!672 = !{i32 2, !"Debug Info Version", i32 3}
!673 = !{i32 1, !"wchar_size", i32 4}
!674 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!675 = distinct !DISubprogram(name: "feval", linkageName: "_Z5fevalP7state_tiP12t_eval_comps", scope: !3, file: !3, line: 1043, type: !676, scopeLine: 1043, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!676 = !DISubroutineType(types: !677)
!677 = !{null, !678, !10, !749}
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 64)
!679 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "state_t", file: !680, line: 11, size: 99200, flags: DIFlagTypePassByValue, elements: !681, identifier: "_ZTS7state_t")
!680 = !DIFile(filename: "./state.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/531.deepsjeng_r/build/build_base_ld-loop-ext-m64.0000")
!681 = !{!682, !683, !687, !690, !691, !692, !696, !697, !698, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !719, !722, !723, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745}
!682 = !DIDerivedType(tag: DW_TAG_member, name: "threadid", scope: !679, file: !680, line: 13, baseType: !10, size: 32)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "sboard", scope: !679, file: !680, line: 15, baseType: !684, size: 2048, offset: 32)
!684 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 2048, elements: !685)
!685 = !{!686}
!686 = !DISubrange(count: 64)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "All", scope: !679, file: !680, line: 16, baseType: !688, size: 64, offset: 2112)
!688 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITBOARD", file: !689, line: 33, baseType: !555)
!689 = !DIFile(filename: "./sjeng.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/531.deepsjeng_r/build/build_base_ld-loop-ext-m64.0000")
!690 = !DIDerivedType(tag: DW_TAG_member, name: "BlackPieces", scope: !679, file: !680, line: 17, baseType: !688, size: 64, offset: 2176)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "WhitePieces", scope: !679, file: !680, line: 17, baseType: !688, size: 64, offset: 2240)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "BitBoard", scope: !679, file: !680, line: 18, baseType: !693, size: 832, offset: 2304)
!693 = !DICompositeType(tag: DW_TAG_array_type, baseType: !688, size: 832, elements: !694)
!694 = !{!695}
!695 = !DISubrange(count: 13)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "Material", scope: !679, file: !680, line: 20, baseType: !10, size: 32, offset: 3136)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "psq_score", scope: !679, file: !680, line: 21, baseType: !10, size: 32, offset: 3168)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "npieces", scope: !679, file: !680, line: 22, baseType: !699, size: 416, offset: 3200)
!699 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 416, elements: !694)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "castleflag", scope: !679, file: !680, line: 23, baseType: !10, size: 32, offset: 3616)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "ep_square", scope: !679, file: !680, line: 25, baseType: !10, size: 32, offset: 3648)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "white_to_move", scope: !679, file: !680, line: 25, baseType: !10, size: 32, offset: 3680)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "wking_loc", scope: !679, file: !680, line: 25, baseType: !10, size: 32, offset: 3712)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "bking_loc", scope: !679, file: !680, line: 25, baseType: !10, size: 32, offset: 3744)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "ply", scope: !679, file: !680, line: 26, baseType: !10, size: 32, offset: 3776)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "fifty", scope: !679, file: !680, line: 26, baseType: !10, size: 32, offset: 3808)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !679, file: !680, line: 28, baseType: !688, size: 64, offset: 3840)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "pawnhash", scope: !679, file: !680, line: 29, baseType: !688, size: 64, offset: 3904)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "path_x", scope: !679, file: !680, line: 31, baseType: !710, size: 16384, offset: 3968)
!710 = !DICompositeType(tag: DW_TAG_array_type, baseType: !711, size: 16384, elements: !685)
!711 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "move_x", file: !689, line: 130, size: 256, flags: DIFlagTypePassByValue, elements: !712, identifier: "_ZTS6move_x")
!712 = !{!713, !714, !715, !716, !717, !718}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "epsq", scope: !711, file: !689, line: 131, baseType: !10, size: 32)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "fifty", scope: !711, file: !689, line: 132, baseType: !10, size: 32, offset: 32)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "castleflag", scope: !711, file: !689, line: 133, baseType: !10, size: 32, offset: 64)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "psq_score", scope: !711, file: !689, line: 134, baseType: !10, size: 32, offset: 96)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !711, file: !689, line: 135, baseType: !688, size: 64, offset: 128)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "pawnhash", scope: !711, file: !689, line: 136, baseType: !688, size: 64, offset: 192)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !679, file: !680, line: 32, baseType: !720, size: 2048, offset: 20352)
!720 = !DICompositeType(tag: DW_TAG_array_type, baseType: !721, size: 2048, elements: !685)
!721 = !DIDerivedType(tag: DW_TAG_typedef, name: "move_s", file: !689, line: 121, baseType: !10)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "plyeval", scope: !679, file: !680, line: 33, baseType: !684, size: 2048, offset: 22400)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "killerstack", scope: !679, file: !680, line: 41, baseType: !724, size: 8192, offset: 24448)
!724 = !DICompositeType(tag: DW_TAG_array_type, baseType: !725, size: 8192, elements: !685)
!725 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !679, file: !680, line: 36, size: 128, flags: DIFlagTypePassByValue, elements: !726, identifier: "_ZTSN7state_tUt_E")
!726 = !{!727, !728, !729, !730}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "killer1", scope: !725, file: !680, line: 37, baseType: !721, size: 32)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "killer2", scope: !725, file: !680, line: 38, baseType: !721, size: 32, offset: 32)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "killer3", scope: !725, file: !680, line: 39, baseType: !721, size: 32, offset: 64)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "killer4", scope: !725, file: !680, line: 40, baseType: !721, size: 32, offset: 96)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !679, file: !680, line: 43, baseType: !688, size: 64, offset: 32640)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "qnodes", scope: !679, file: !680, line: 43, baseType: !688, size: 64, offset: 32704)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "maxply", scope: !679, file: !680, line: 44, baseType: !10, size: 32, offset: 32768)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "checks", scope: !679, file: !680, line: 45, baseType: !684, size: 2048, offset: 32800)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "TTProbes", scope: !679, file: !680, line: 51, baseType: !497, size: 32, offset: 34848)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "TTHits", scope: !679, file: !680, line: 52, baseType: !497, size: 32, offset: 34880)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "TTStores", scope: !679, file: !680, line: 53, baseType: !497, size: 32, offset: 34912)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "TTColls", scope: !679, file: !680, line: 54, baseType: !497, size: 32, offset: 34944)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "wking_start", scope: !679, file: !680, line: 60, baseType: !10, size: 32, offset: 34976)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "bking_start", scope: !679, file: !680, line: 61, baseType: !10, size: 32, offset: 35008)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "wlrook_start", scope: !679, file: !680, line: 62, baseType: !10, size: 32, offset: 35040)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "wrrook_start", scope: !679, file: !680, line: 63, baseType: !10, size: 32, offset: 35072)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "blrook_start", scope: !679, file: !680, line: 64, baseType: !10, size: 32, offset: 35104)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "brrook_start", scope: !679, file: !680, line: 65, baseType: !10, size: 32, offset: 35136)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "hash_history", scope: !679, file: !680, line: 69, baseType: !746, size: 64000, offset: 35200)
!746 = !DICompositeType(tag: DW_TAG_array_type, baseType: !688, size: 64000, elements: !747)
!747 = !{!748}
!748 = !DISubrange(count: 1000)
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 64)
!750 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "t_eval_comps", file: !751, line: 16, size: 352, flags: DIFlagTypePassByValue, elements: !752, identifier: "_ZTS12t_eval_comps")
!751 = !DIFile(filename: "./neval.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/531.deepsjeng_r/build/build_base_ld-loop-ext-m64.0000")
!752 = !{!753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763}
!753 = !DIDerivedType(tag: DW_TAG_member, name: "w_positional", scope: !750, file: !751, line: 17, baseType: !10, size: 32)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "b_positional", scope: !750, file: !751, line: 18, baseType: !10, size: 32, offset: 32)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "w_pawnstruct", scope: !750, file: !751, line: 20, baseType: !10, size: 32, offset: 64)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "b_pawnstruct", scope: !750, file: !751, line: 21, baseType: !10, size: 32, offset: 96)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "w_passers", scope: !750, file: !751, line: 23, baseType: !10, size: 32, offset: 128)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "b_passers", scope: !750, file: !751, line: 24, baseType: !10, size: 32, offset: 160)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "w_psq_king", scope: !750, file: !751, line: 26, baseType: !10, size: 32, offset: 192)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "b_psq_king", scope: !750, file: !751, line: 27, baseType: !10, size: 32, offset: 224)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "w_ks_score", scope: !750, file: !751, line: 29, baseType: !10, size: 32, offset: 256)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "b_ks_score", scope: !750, file: !751, line: 30, baseType: !10, size: 32, offset: 288)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "accum_score", scope: !750, file: !751, line: 32, baseType: !10, size: 32, offset: 320)
!764 = !DILocalVariable(name: "s", arg: 1, scope: !675, file: !3, line: 1043, type: !678)
!765 = !DILocation(line: 1043, column: 21, scope: !675)
!766 = !DILocalVariable(name: "phase_scale", arg: 2, scope: !675, file: !3, line: 1043, type: !10)
!767 = !DILocation(line: 1043, column: 28, scope: !675)
!768 = !DILocalVariable(name: "ec", arg: 3, scope: !675, file: !3, line: 1043, type: !749)
!769 = !DILocation(line: 1043, column: 55, scope: !675)
!770 = !DILocalVariable(name: "pawntt", scope: !675, file: !3, line: 1044, type: !771)
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 64)
!772 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pawntt_t", file: !773, line: 7, size: 704, flags: DIFlagTypePassByValue, elements: !774, identifier: "_ZTS8pawntt_t")
!773 = !DIFile(filename: "./pawn.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/531.deepsjeng_r/build/build_base_ld-loop-ext-m64.0000")
!774 = !{!775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "pawnhash", scope: !772, file: !773, line: 8, baseType: !688, size: 64)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "open_files", scope: !772, file: !773, line: 9, baseType: !688, size: 64, offset: 64)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "w_half_open_files", scope: !772, file: !773, line: 10, baseType: !688, size: 64, offset: 128)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "b_half_open_files", scope: !772, file: !773, line: 11, baseType: !688, size: 64, offset: 192)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "w_passed", scope: !772, file: !773, line: 12, baseType: !688, size: 64, offset: 256)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "b_passed", scope: !772, file: !773, line: 13, baseType: !688, size: 64, offset: 320)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "w_strong_square", scope: !772, file: !773, line: 14, baseType: !688, size: 64, offset: 384)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "b_strong_square", scope: !772, file: !773, line: 15, baseType: !688, size: 64, offset: 448)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "w_super_strong_square", scope: !772, file: !773, line: 16, baseType: !688, size: 64, offset: 512)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "b_super_strong_square", scope: !772, file: !773, line: 17, baseType: !688, size: 64, offset: 576)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "w_score", scope: !772, file: !773, line: 19, baseType: !10, size: 32, offset: 640)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "b_score", scope: !772, file: !773, line: 20, baseType: !10, size: 32, offset: 672)
!787 = !DILocation(line: 1044, column: 15, scope: !675)
!788 = !DILocalVariable(name: "attack_info", scope: !675, file: !3, line: 1045, type: !789)
!789 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "attackinfo_t", file: !3, line: 66, size: 640, flags: DIFlagTypePassByValue, elements: !790, identifier: "_ZTS12attackinfo_t")
!790 = !{!791, !792, !793, !794, !795, !796, !797, !798, !799, !800}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "w_pawn_attacks", scope: !789, file: !3, line: 67, baseType: !688, size: 64)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "b_pawn_attacks", scope: !789, file: !3, line: 68, baseType: !688, size: 64, offset: 64)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "w_bishop_attacks", scope: !789, file: !3, line: 69, baseType: !688, size: 64, offset: 128)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "b_bishop_attacks", scope: !789, file: !3, line: 70, baseType: !688, size: 64, offset: 192)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "w_knight_attacks", scope: !789, file: !3, line: 71, baseType: !688, size: 64, offset: 256)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "b_knight_attacks", scope: !789, file: !3, line: 72, baseType: !688, size: 64, offset: 320)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "w_rook_attacks", scope: !789, file: !3, line: 73, baseType: !688, size: 64, offset: 384)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "b_rook_attacks", scope: !789, file: !3, line: 74, baseType: !688, size: 64, offset: 448)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "w_queen_attacks", scope: !789, file: !3, line: 75, baseType: !688, size: 64, offset: 512)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "b_queen_attacks", scope: !789, file: !3, line: 76, baseType: !688, size: 64, offset: 576)
!801 = !DILocation(line: 1045, column: 18, scope: !675)
!802 = !DILocalVariable(name: "score", scope: !675, file: !3, line: 1046, type: !10)
!803 = !DILocation(line: 1046, column: 9, scope: !675)
!804 = !DILocation(line: 1048, column: 5, scope: !675)
!805 = !DILocation(line: 1053, column: 28, scope: !675)
!806 = !DILocation(line: 1053, column: 31, scope: !675)
!807 = !DILocation(line: 1053, column: 14, scope: !675)
!808 = !DILocation(line: 1053, column: 11, scope: !675)
!809 = !DILocation(line: 1058, column: 31, scope: !675)
!810 = !DILocation(line: 1058, column: 14, scope: !675)
!811 = !DILocation(line: 1058, column: 12, scope: !675)
!812 = !DILocation(line: 1060, column: 28, scope: !675)
!813 = !DILocation(line: 1060, column: 36, scope: !675)
!814 = !DILocation(line: 1060, column: 5, scope: !675)
!815 = !DILocation(line: 1060, column: 9, scope: !675)
!816 = !DILocation(line: 1060, column: 26, scope: !675)
!817 = !DILocation(line: 1061, column: 28, scope: !675)
!818 = !DILocation(line: 1061, column: 36, scope: !675)
!819 = !DILocation(line: 1061, column: 5, scope: !675)
!820 = !DILocation(line: 1061, column: 9, scope: !675)
!821 = !DILocation(line: 1061, column: 26, scope: !675)
!822 = !DILocation(line: 1066, column: 23, scope: !675)
!823 = !DILocation(line: 1066, column: 26, scope: !675)
!824 = !DILocation(line: 1066, column: 40, scope: !675)
!825 = !DILocation(line: 1066, column: 5, scope: !675)
!826 = !DILocation(line: 1067, column: 23, scope: !675)
!827 = !DILocation(line: 1067, column: 40, scope: !675)
!828 = !DILocation(line: 1067, column: 5, scope: !675)
!829 = !DILocation(line: 1071, column: 17, scope: !675)
!830 = !DILocation(line: 1071, column: 20, scope: !675)
!831 = !DILocation(line: 1071, column: 28, scope: !675)
!832 = !DILocation(line: 1071, column: 41, scope: !675)
!833 = !DILocation(line: 1071, column: 5, scope: !675)
!834 = !DILocation(line: 1076, column: 14, scope: !675)
!835 = !DILocation(line: 1076, column: 17, scope: !675)
!836 = !DILocation(line: 1076, column: 5, scope: !675)
!837 = !DILocation(line: 1081, column: 21, scope: !675)
!838 = !DILocation(line: 1081, column: 24, scope: !675)
!839 = !DILocation(line: 1081, column: 32, scope: !675)
!840 = !DILocation(line: 1081, column: 5, scope: !675)
!841 = !DILocation(line: 1086, column: 27, scope: !675)
!842 = !DILocation(line: 1086, column: 30, scope: !675)
!843 = !DILocation(line: 1086, column: 14, scope: !675)
!844 = !DILocation(line: 1086, column: 11, scope: !675)
!845 = !DILocation(line: 1088, column: 23, scope: !675)
!846 = !DILocation(line: 1088, column: 5, scope: !675)
!847 = !DILocation(line: 1088, column: 9, scope: !675)
!848 = !DILocation(line: 1088, column: 21, scope: !675)
!849 = !DILocation(line: 1089, column: 1, scope: !675)
!850 = distinct !DISubprogram(name: "mobility_eval", linkageName: "_ZL13mobility_evalP7state_tP12t_eval_compsP12attackinfo_t", scope: !3, file: !3, line: 498, type: !851, scopeLine: 498, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!851 = !DISubroutineType(types: !852)
!852 = !{!10, !678, !749, !853}
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !789, size: 64)
!854 = !DILocalVariable(name: "s", arg: 1, scope: !850, file: !3, line: 498, type: !678)
!855 = !DILocation(line: 498, column: 35, scope: !850)
!856 = !DILocalVariable(name: "ec", arg: 2, scope: !850, file: !3, line: 498, type: !749)
!857 = !DILocation(line: 498, column: 52, scope: !850)
!858 = !DILocalVariable(name: "att", arg: 3, scope: !850, file: !3, line: 498, type: !853)
!859 = !DILocation(line: 498, column: 70, scope: !850)
!860 = !DILocalVariable(name: "i", scope: !850, file: !3, line: 499, type: !10)
!861 = !DILocation(line: 499, column: 9, scope: !850)
!862 = !DILocalVariable(name: "temp", scope: !850, file: !3, line: 500, type: !688)
