; ModuleID = 'bitboard.cpp'
source_filename = "bitboard.cpp"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.state_t = type { i32, [64 x i32], i64, i64, i64, [13 x i64], i32, i32, [13 x i32], i32, i32, i32, i32, i32, i32, i32, i64, i64, [64 x %struct.move_x], [64 x i32], [64 x i32], [64 x %struct.anon], i64, i64, i32, [64 x i32], i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [1000 x i64] }
%struct.move_x = type { i32, i32, i32, i32, i64, i64 }
%struct.anon = type { i32, i32, i32, i32 }

$_ZSt3minIiERKT_S2_S2_ = comdat any

@KnightMoves = dso_local global [64 x i64] zeroinitializer, align 16, !dbg !0
@KingMoves = dso_local global [64 x i64] zeroinitializer, align 16, !dbg !12
@PawnAttacksBlack = dso_local global [64 x i64] zeroinitializer, align 16, !dbg !17
@PawnAttacksWhite = dso_local global [64 x i64] zeroinitializer, align 16, !dbg !19
@PawnMovesBlack = dso_local global [64 x i64] zeroinitializer, align 16, !dbg !21
@PawnMovesWhite = dso_local global [64 x i64] zeroinitializer, align 16, !dbg !23
@fillUpAttacks = dso_local global [64 x [8 x i64]] zeroinitializer, align 16, !dbg !25
@aFileAttacks = dso_local global [64 x [8 x i64]] zeroinitializer, align 16, !dbg !30
@firstRankAttacks = dso_local global [64 x [8 x i8]] zeroinitializer, align 16, !dbg !32
@Mask = dso_local global [64 x i64] zeroinitializer, align 16, !dbg !35

!75 = distinct !DIGlobalVariable(name: "WhiteQueenSide", scope: !2, file: !3, line: 87, type: !6, isLocal: false, isDefinition: true)
!76 = !DIGlobalVariableExpression(var: !77, expr: !DIExpression())
!77 = distinct !DIGlobalVariable(name: "BlackKingSide", scope: !2, file: !3, line: 88, type: !6, isLocal: false, isDefinition: true)
!78 = !DIGlobalVariableExpression(var: !79, expr: !DIExpression())
!79 = distinct !DIGlobalVariable(name: "BlackQueenSide", scope: !2, file: !3, line: 89, type: !6, isLocal: false, isDefinition: true)
!80 = !DIGlobalVariableExpression(var: !81, expr: !DIExpression())
!81 = distinct !DIGlobalVariable(name: "KingSafetyMask", scope: !2, file: !3, line: 90, type: !14, isLocal: false, isDefinition: true)
!82 = !DIGlobalVariableExpression(var: !83, expr: !DIExpression())
!83 = distinct !DIGlobalVariable(name: "KingSafetyMask1", scope: !2, file: !3, line: 91, type: !14, isLocal: false, isDefinition: true)
!84 = !DIGlobalVariableExpression(var: !85, expr: !DIExpression())
!85 = distinct !DIGlobalVariable(name: "WhiteStrongSquareMask", scope: !2, file: !3, line: 93, type: !6, isLocal: false, isDefinition: true)
!86 = !DIGlobalVariableExpression(var: !87, expr: !DIExpression())
!87 = distinct !DIGlobalVariable(name: "BlackStrongSquareMask", scope: !2, file: !3, line: 94, type: !6, isLocal: false, isDefinition: true)
!88 = !DIGlobalVariableExpression(var: !89, expr: !DIExpression())
!89 = distinct !DIGlobalVariable(name: "WhiteSqMask", scope: !2, file: !3, line: 96, type: !6, isLocal: false, isDefinition: true)
!90 = !DIGlobalVariableExpression(var: !91, expr: !DIExpression())
!91 = distinct !DIGlobalVariable(name: "BlackSqMask", scope: !2, file: !3, line: 97, type: !6, isLocal: false, isDefinition: true)
!92 = !DIGlobalVariableExpression(var: !93, expr: !DIExpression())
!93 = distinct !DIGlobalVariable(name: "KSMask", scope: !2, file: !3, line: 99, type: !6, isLocal: false, isDefinition: true)
!94 = !DIGlobalVariableExpression(var: !95, expr: !DIExpression())
!95 = distinct !DIGlobalVariable(name: "QSMask", scope: !2, file: !3, line: 100, type: !6, isLocal: false, isDefinition: true)
!96 = !DIGlobalVariableExpression(var: !97, expr: !DIExpression())
!97 = distinct !DIGlobalVariable(name: "KingFilesMask", scope: !2, file: !3, line: 102, type: !45, isLocal: false, isDefinition: true)
!98 = !DIGlobalVariableExpression(var: !99, expr: !DIExpression())
!99 = distinct !DIGlobalVariable(name: "KingPressureMask", scope: !2, file: !3, line: 103, type: !14, isLocal: false, isDefinition: true)
!100 = !DIGlobalVariableExpression(var: !101, expr: !DIExpression())
!101 = distinct !DIGlobalVariable(name: "KingPressureMask1", scope: !2, file: !3, line: 104, type: !14, isLocal: false, isDefinition: true)
!102 = !DIGlobalVariableExpression(var: !103, expr: !DIExpression())
!103 = distinct !DIGlobalVariable(name: "CenterMask", scope: !2, file: !3, line: 105, type: !6, isLocal: false, isDefinition: true)
!104 = !DIGlobalVariableExpression(var: !105, expr: !DIExpression())
!105 = distinct !DIGlobalVariable(name: "SpaceMask", scope: !2, file: !3, line: 106, type: !106, isLocal: false, isDefinition: true)
!106 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 128, elements: !107)
!107 = !{!108}
!108 = !DISubrange(count: 2)
!109 = !DIGlobalVariableExpression(var: !110, expr: !DIExpression())
!110 = distinct !DIGlobalVariable(name: "DiagonalLength_a1h8", linkageName: "_ZL19DiagonalLength_a1h8", scope: !2, file: !3, line: 27, type: !111, isLocal: true, isDefinition: true)
!111 = !DICompositeType(tag: DW_TAG_array_type, baseType: !112, size: 2048, elements: !15)
!112 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !113)
!113 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!114 = !DIGlobalVariableExpression(var: !115, expr: !DIExpression())
!115 = distinct !DIGlobalVariable(name: "DiagonalLength_a8h1", linkageName: "_ZL19DiagonalLength_a8h1", scope: !2, file: !3, line: 38, type: !111, isLocal: true, isDefinition: true)
!116 = !{!117, !124, !128, !135, !139, !144, !146, !154, !158, !162, !176, !180, !184, !188, !192, !197, !201, !205, !209, !213, !221, !225, !229, !231, !235, !239, !243, !249, !253, !257, !259, !267, !271, !279, !281, !285, !289, !293, !297, !301, !306, !311, !312, !313, !314, !316, !317, !318, !319, !320, !321, !322, !324, !325, !326, !327, !328, !329, !330, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !363, !419}
!117 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !119, file: !123, line: 52)
!118 = !DINamespace(name: "std", scope: null)
!119 = !DISubprogram(name: "abs", scope: !120, file: !120, line: 840, type: !121, flags: DIFlagPrototyped, spFlags: 0)
!120 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!121 = !DISubroutineType(types: !122)
!122 = !{!113, !113}
!123 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/bits/std_abs.h", directory: "")
!124 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !125, file: !127, line: 127)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "div_t", file: !120, line: 62, baseType: !126)
!126 = !DICompositeType(tag: DW_TAG_structure_type, file: !120, line: 58, flags: DIFlagFwdDecl, identifier: "_ZTS5div_t")
!127 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/cstdlib", directory: "")
!128 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !129, file: !127, line: 128)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "ldiv_t", file: !120, line: 70, baseType: !130)
!130 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !120, line: 66, size: 128, flags: DIFlagTypePassByValue, elements: !131, identifier: "_ZTS6ldiv_t")
!131 = !{!132, !134}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !130, file: !120, line: 68, baseType: !133, size: 64)
!133 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !130, file: !120, line: 69, baseType: !133, size: 64, offset: 64)
!135 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !136, file: !127, line: 130)
!136 = !DISubprogram(name: "abort", scope: !120, file: !120, line: 591, type: !137, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!137 = !DISubroutineType(types: !138)
!138 = !{null}
!139 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !140, file: !127, line: 134)
!140 = !DISubprogram(name: "atexit", scope: !120, file: !120, line: 595, type: !141, flags: DIFlagPrototyped, spFlags: 0)
!141 = !DISubroutineType(types: !142)
!142 = !{!113, !143}
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!144 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !145, file: !127, line: 137)
!145 = !DISubprogram(name: "at_quick_exit", scope: !120, file: !120, line: 600, type: !141, flags: DIFlagPrototyped, spFlags: 0)
!146 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !147, file: !127, line: 140)
!147 = !DISubprogram(name: "atof", scope: !120, file: !120, line: 101, type: !148, flags: DIFlagPrototyped, spFlags: 0)
!148 = !DISubroutineType(types: !149)
!149 = !{!150, !151}
!150 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !153)
!153 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!154 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !155, file: !127, line: 141)
!155 = !DISubprogram(name: "atoi", scope: !120, file: !120, line: 104, type: !156, flags: DIFlagPrototyped, spFlags: 0)
!156 = !DISubroutineType(types: !157)
!157 = !{!113, !151}
!158 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !159, file: !127, line: 142)
!159 = !DISubprogram(name: "atol", scope: !120, file: !120, line: 107, type: !160, flags: DIFlagPrototyped, spFlags: 0)
!160 = !DISubroutineType(types: !161)
!161 = !{!133, !151}
!162 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !163, file: !127, line: 143)
!163 = !DISubprogram(name: "bsearch", scope: !120, file: !120, line: 820, type: !164, flags: DIFlagPrototyped, spFlags: 0)
!164 = !DISubroutineType(types: !165)
!165 = !{!166, !167, !167, !169, !169, !172}
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !170, line: 46, baseType: !171)
!170 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!171 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "__compar_fn_t", file: !120, line: 808, baseType: !173)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = !DISubroutineType(types: !175)
!175 = !{!113, !167, !167}
!176 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !177, file: !127, line: 144)
!177 = !DISubprogram(name: "calloc", scope: !120, file: !120, line: 542, type: !178, flags: DIFlagPrototyped, spFlags: 0)
!178 = !DISubroutineType(types: !179)
!179 = !{!166, !169, !169}
!180 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !181, file: !127, line: 145)
!181 = !DISubprogram(name: "div", scope: !120, file: !120, line: 852, type: !182, flags: DIFlagPrototyped, spFlags: 0)
!182 = !DISubroutineType(types: !183)
!183 = !{!125, !113, !113}
!184 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !185, file: !127, line: 146)
!185 = !DISubprogram(name: "exit", scope: !120, file: !120, line: 617, type: !186, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!186 = !DISubroutineType(types: !187)
!187 = !{null, !113}
!188 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !189, file: !127, line: 147)
!189 = !DISubprogram(name: "free", scope: !120, file: !120, line: 565, type: !190, flags: DIFlagPrototyped, spFlags: 0)
!190 = !DISubroutineType(types: !191)
!191 = !{null, !166}
!192 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !193, file: !127, line: 148)
!193 = !DISubprogram(name: "getenv", scope: !120, file: !120, line: 634, type: !194, flags: DIFlagPrototyped, spFlags: 0)
!194 = !DISubroutineType(types: !195)
!195 = !{!196, !151}
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!197 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !198, file: !127, line: 149)
!198 = !DISubprogram(name: "labs", scope: !120, file: !120, line: 841, type: !199, flags: DIFlagPrototyped, spFlags: 0)
!199 = !DISubroutineType(types: !200)
!200 = !{!133, !133}
!201 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !202, file: !127, line: 150)
!202 = !DISubprogram(name: "ldiv", scope: !120, file: !120, line: 854, type: !203, flags: DIFlagPrototyped, spFlags: 0)
!203 = !DISubroutineType(types: !204)
!204 = !{!129, !133, !133}
!205 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !206, file: !127, line: 151)
!206 = !DISubprogram(name: "malloc", scope: !120, file: !120, line: 539, type: !207, flags: DIFlagPrototyped, spFlags: 0)
!207 = !DISubroutineType(types: !208)
!208 = !{!166, !169}
!209 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !210, file: !127, line: 153)
!210 = !DISubprogram(name: "mblen", scope: !120, file: !120, line: 922, type: !211, flags: DIFlagPrototyped, spFlags: 0)
!211 = !DISubroutineType(types: !212)
!212 = !{!113, !151, !169}
!213 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !214, file: !127, line: 154)
!214 = !DISubprogram(name: "mbstowcs", scope: !120, file: !120, line: 933, type: !215, flags: DIFlagPrototyped, spFlags: 0)
!215 = !DISubroutineType(types: !216)
!216 = !{!169, !217, !220, !169}
!217 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !218)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!219 = !DIBasicType(name: "wchar_t", size: 32, encoding: DW_ATE_signed)
!220 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !151)
!221 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !222, file: !127, line: 155)
!222 = !DISubprogram(name: "mbtowc", scope: !120, file: !120, line: 925, type: !223, flags: DIFlagPrototyped, spFlags: 0)
!223 = !DISubroutineType(types: !224)
!224 = !{!113, !217, !220, !169}
!225 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !226, file: !127, line: 157)
!226 = !DISubprogram(name: "qsort", scope: !120, file: !120, line: 830, type: !227, flags: DIFlagPrototyped, spFlags: 0)
!227 = !DISubroutineType(types: !228)
!228 = !{null, !166, !169, !169, !172}
!229 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !230, file: !127, line: 160)
!230 = !DISubprogram(name: "quick_exit", scope: !120, file: !120, line: 623, type: !186, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!231 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !232, file: !127, line: 163)
!232 = !DISubprogram(name: "rand", scope: !120, file: !120, line: 453, type: !233, flags: DIFlagPrototyped, spFlags: 0)
!233 = !DISubroutineType(types: !234)
!234 = !{!113}
!235 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !236, file: !127, line: 164)
!236 = !DISubprogram(name: "realloc", scope: !120, file: !120, line: 550, type: !237, flags: DIFlagPrototyped, spFlags: 0)
!237 = !DISubroutineType(types: !238)
!238 = !{!166, !166, !169}
!239 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !240, file: !127, line: 165)
!240 = !DISubprogram(name: "srand", scope: !120, file: !120, line: 455, type: !241, flags: DIFlagPrototyped, spFlags: 0)
!241 = !DISubroutineType(types: !242)
!242 = !{null, !10}
!243 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !244, file: !127, line: 166)
!244 = !DISubprogram(name: "strtod", scope: !120, file: !120, line: 117, type: !245, flags: DIFlagPrototyped, spFlags: 0)
!245 = !DISubroutineType(types: !246)
!246 = !{!150, !220, !247}
!247 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !248)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!249 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !250, file: !127, line: 167)
!250 = !DISubprogram(name: "strtol", scope: !120, file: !120, line: 176, type: !251, flags: DIFlagPrototyped, spFlags: 0)
!251 = !DISubroutineType(types: !252)
!252 = !{!133, !220, !247, !113}
!253 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !254, file: !127, line: 168)
!254 = !DISubprogram(name: "strtoul", scope: !120, file: !120, line: 180, type: !255, flags: DIFlagPrototyped, spFlags: 0)
!255 = !DISubroutineType(types: !256)
!256 = !{!171, !220, !247, !113}
!257 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !258, file: !127, line: 169)
!258 = !DISubprogram(name: "system", scope: !120, file: !120, line: 784, type: !156, flags: DIFlagPrototyped, spFlags: 0)
!259 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !260, file: !127, line: 171)
!260 = !DISubprogram(name: "wcstombs", scope: !120, file: !120, line: 936, type: !261, flags: DIFlagPrototyped, spFlags: 0)
!261 = !DISubroutineType(types: !262)
!262 = !{!169, !263, !264, !169}
!263 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !196)
!264 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !265)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!266 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !219)
!267 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !268, file: !127, line: 172)
!268 = !DISubprogram(name: "wctomb", scope: !120, file: !120, line: 929, type: !269, flags: DIFlagPrototyped, spFlags: 0)
!269 = !DISubroutineType(types: !270)
!270 = !{!113, !196, !219}
!271 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !272, entity: !273, file: !127, line: 200)
!272 = !DINamespace(name: "__gnu_cxx", scope: null)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "lldiv_t", file: !120, line: 80, baseType: !274)
!274 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !120, line: 76, size: 128, flags: DIFlagTypePassByValue, elements: !275, identifier: "_ZTS7lldiv_t")
!275 = !{!276, !278}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !274, file: !120, line: 78, baseType: !277, size: 64)
!277 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !274, file: !120, line: 79, baseType: !277, size: 64, offset: 64)
!279 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !272, entity: !280, file: !127, line: 206)
!280 = !DISubprogram(name: "_Exit", scope: !120, file: !120, line: 629, type: !186, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!281 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !272, entity: !282, file: !127, line: 210)
!282 = !DISubprogram(name: "llabs", scope: !120, file: !120, line: 844, type: !283, flags: DIFlagPrototyped, spFlags: 0)
!283 = !DISubroutineType(types: !284)
!284 = !{!277, !277}
!285 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !272, entity: !286, file: !127, line: 216)
!286 = !DISubprogram(name: "lldiv", scope: !120, file: !120, line: 858, type: !287, flags: DIFlagPrototyped, spFlags: 0)
!287 = !DISubroutineType(types: !288)
!288 = !{!273, !277, !277}
!289 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !272, entity: !290, file: !127, line: 227)
!290 = !DISubprogram(name: "atoll", scope: !120, file: !120, line: 112, type: !291, flags: DIFlagPrototyped, spFlags: 0)
!291 = !DISubroutineType(types: !292)
!292 = !{!277, !151}
!293 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !272, entity: !294, file: !127, line: 228)
!294 = !DISubprogram(name: "strtoll", scope: !120, file: !120, line: 200, type: !295, flags: DIFlagPrototyped, spFlags: 0)
!295 = !DISubroutineType(types: !296)
!296 = !{!277, !220, !247, !113}
!297 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !272, entity: !298, file: !127, line: 229)
!298 = !DISubprogram(name: "strtoull", scope: !120, file: !120, line: 205, type: !299, flags: DIFlagPrototyped, spFlags: 0)
!299 = !DISubroutineType(types: !300)
!300 = !{!8, !220, !247, !113}
!301 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !272, entity: !302, file: !127, line: 231)
!302 = !DISubprogram(name: "strtof", scope: !120, file: !120, line: 123, type: !303, flags: DIFlagPrototyped, spFlags: 0)
!303 = !DISubroutineType(types: !304)
!304 = !{!305, !220, !247}
!305 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!306 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !272, entity: !307, file: !127, line: 232)
!307 = !DISubprogram(name: "strtold", scope: !120, file: !120, line: 126, type: !308, flags: DIFlagPrototyped, spFlags: 0)
!308 = !DISubroutineType(types: !309)
!309 = !{!310, !220, !247}
!310 = !DIBasicType(name: "long double", size: 128, encoding: DW_ATE_float)
!311 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !273, file: !127, line: 240)
!312 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !280, file: !127, line: 242)
!313 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !282, file: !127, line: 244)
!314 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !315, file: !127, line: 245)
!315 = !DISubprogram(name: "div", linkageName: "_ZN9__gnu_cxx3divExx", scope: !272, file: !127, line: 213, type: !287, flags: DIFlagPrototyped, spFlags: 0)
!316 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !286, file: !127, line: 246)
!317 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !290, file: !127, line: 248)
!318 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !302, file: !127, line: 249)
!319 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !294, file: !127, line: 250)
!320 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !298, file: !127, line: 251)
!321 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !307, file: !127, line: 252)
!322 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !136, file: !323, line: 38)
!323 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/stdlib.h", directory: "")
!324 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !140, file: !323, line: 39)
!325 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !185, file: !323, line: 40)
!326 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !145, file: !323, line: 43)
!327 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !230, file: !323, line: 46)
!328 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !125, file: !323, line: 51)
!329 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !129, file: !323, line: 52)
!330 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !331, file: !323, line: 54)
!331 = !DISubprogram(name: "abs", linkageName: "_ZSt3absg", scope: !118, file: !123, line: 103, type: !332, flags: DIFlagPrototyped, spFlags: 0)
!332 = !DISubroutineType(types: !333)
!333 = !{!334, !334}
!334 = !DIBasicType(name: "__float128", size: 128, encoding: DW_ATE_float)
!335 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !147, file: !323, line: 55)
!336 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !155, file: !323, line: 56)
!337 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !159, file: !323, line: 57)
!338 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !163, file: !323, line: 58)
!339 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !177, file: !323, line: 59)
!340 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !315, file: !323, line: 60)
!341 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !189, file: !323, line: 61)
!342 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !193, file: !323, line: 62)
!343 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !198, file: !323, line: 63)
!344 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !202, file: !323, line: 64)
!345 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !206, file: !323, line: 65)
!346 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !210, file: !323, line: 67)
!347 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !214, file: !323, line: 68)
!348 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !222, file: !323, line: 69)
!349 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !226, file: !323, line: 71)
!350 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !232, file: !323, line: 72)
!351 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !236, file: !323, line: 73)
!352 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !240, file: !323, line: 74)
!353 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !244, file: !323, line: 75)
!354 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !250, file: !323, line: 76)
!355 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !254, file: !323, line: 77)
!356 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !258, file: !323, line: 78)
!357 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !260, file: !323, line: 80)
!358 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !268, file: !323, line: 81)
!359 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !360, entity: !361, file: !362, line: 58)
!360 = !DINamespace(name: "__gnu_debug", scope: null)
!361 = !DINamespace(name: "__debug", scope: !118)
!362 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/debug/debug.h", directory: "")
!363 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !118, entity: !364, file: !365, line: 58)
!364 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "exception_ptr", scope: !366, file: !365, line: 80, size: 64, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !367, identifier: "_ZTSNSt15__exception_ptr13exception_ptrE")
!365 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/bits/exception_ptr.h", directory: "")
!366 = !DINamespace(name: "__exception_ptr", scope: !118)
!367 = !{!368, !369, !373, !376, !377, !382, !383, !387, !393, !397, !401, !404, !405, !408, !412}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "_M_exception_object", scope: !364, file: !365, line: 82, baseType: !166, size: 64)
!369 = !DISubprogram(name: "exception_ptr", scope: !364, file: !365, line: 84, type: !370, scopeLine: 84, flags: DIFlagExplicit | DIFlagPrototyped, spFlags: 0)
!370 = !DISubroutineType(types: !371)
!371 = !{null, !372, !166}
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!373 = !DISubprogram(name: "_M_addref", linkageName: "_ZNSt15__exception_ptr13exception_ptr9_M_addrefEv", scope: !364, file: !365, line: 86, type: !374, scopeLine: 86, flags: DIFlagPrototyped, spFlags: 0)
!374 = !DISubroutineType(types: !375)
!375 = !{null, !372}
!376 = !DISubprogram(name: "_M_release", linkageName: "_ZNSt15__exception_ptr13exception_ptr10_M_releaseEv", scope: !364, file: !365, line: 87, type: !374, scopeLine: 87, flags: DIFlagPrototyped, spFlags: 0)
!377 = !DISubprogram(name: "_M_get", linkageName: "_ZNKSt15__exception_ptr13exception_ptr6_M_getEv", scope: !364, file: !365, line: 89, type: !378, scopeLine: 89, flags: DIFlagPrototyped, spFlags: 0)
!378 = !DISubroutineType(types: !379)
!379 = !{!166, !380}
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!381 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !364)
!382 = !DISubprogram(name: "exception_ptr", scope: !364, file: !365, line: 97, type: !374, scopeLine: 97, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!383 = !DISubprogram(name: "exception_ptr", scope: !364, file: !365, line: 99, type: !384, scopeLine: 99, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!384 = !DISubroutineType(types: !385)
!385 = !{null, !372, !386}
!386 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !381, size: 64)
!387 = !DISubprogram(name: "exception_ptr", scope: !364, file: !365, line: 102, type: !388, scopeLine: 102, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!388 = !DISubroutineType(types: !389)
!389 = !{null, !372, !390}
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "nullptr_t", scope: !118, file: !391, line: 264, baseType: !392)
!391 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/x86_64-linux-gnu/c++/10/bits/c++config.h", directory: "")
!392 = !DIBasicType(tag: DW_TAG_unspecified_type, name: "decltype(nullptr)")
!393 = !DISubprogram(name: "exception_ptr", scope: !364, file: !365, line: 106, type: !394, scopeLine: 106, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!394 = !DISubroutineType(types: !395)
!395 = !{null, !372, !396}
!396 = !DIDerivedType(tag: DW_TAG_rvalue_reference_type, baseType: !364, size: 64)
!397 = !DISubprogram(name: "operator=", linkageName: "_ZNSt15__exception_ptr13exception_ptraSERKS0_", scope: !364, file: !365, line: 119, type: !398, scopeLine: 119, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!398 = !DISubroutineType(types: !399)
!399 = !{!400, !372, !386}
!400 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !364, size: 64)
!401 = !DISubprogram(name: "operator=", linkageName: "_ZNSt15__exception_ptr13exception_ptraSEOS0_", scope: !364, file: !365, line: 123, type: !402, scopeLine: 123, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!402 = !DISubroutineType(types: !403)
!403 = !{!400, !372, !396}
!404 = !DISubprogram(name: "~exception_ptr", scope: !364, file: !365, line: 130, type: !374, scopeLine: 130, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!405 = !DISubprogram(name: "swap", linkageName: "_ZNSt15__exception_ptr13exception_ptr4swapERS0_", scope: !364, file: !365, line: 133, type: !406, scopeLine: 133, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!406 = !DISubroutineType(types: !407)
!407 = !{null, !372, !400}
!408 = !DISubprogram(name: "operator bool", linkageName: "_ZNKSt15__exception_ptr13exception_ptrcvbEv", scope: !364, file: !365, line: 145, type: !409, scopeLine: 145, flags: DIFlagPublic | DIFlagExplicit | DIFlagPrototyped, spFlags: 0)
!409 = !DISubroutineType(types: !410)
!410 = !{!411, !380}
!411 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!412 = !DISubprogram(name: "__cxa_exception_type", linkageName: "_ZNKSt15__exception_ptr13exception_ptr20__cxa_exception_typeEv", scope: !364, file: !365, line: 154, type: !413, scopeLine: 154, flags: DIFlagPublic | DIFlagPrototyped, spFlags: 0)
!413 = !DISubroutineType(types: !414)
!414 = !{!415, !380}
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!416 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !417)
!417 = !DICompositeType(tag: DW_TAG_class_type, name: "type_info", scope: !118, file: !418, line: 88, flags: DIFlagFwdDecl)
!418 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/typeinfo", directory: "")
!419 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !366, entity: !420, file: !365, line: 74)
!420 = !DISubprogram(name: "rethrow_exception", linkageName: "_ZSt17rethrow_exceptionNSt15__exception_ptr13exception_ptrE", scope: !118, file: !365, line: 70, type: !421, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!421 = !DISubroutineType(types: !422)
!422 = !{null, !364}
!423 = !{i32 7, !"Dwarf Version", i32 4}
!424 = !{i32 2, !"Debug Info Version", i32 3}
!425 = !{i32 1, !"wchar_size", i32 4}
!426 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!427 = distinct !DISubprogram(name: "PrintBitboard", linkageName: "_Z13PrintBitboardy", scope: !3, file: !3, line: 111, type: !428, scopeLine: 111, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!428 = !DISubroutineType(types: !429)
!429 = !{null, !430}
!430 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !6)
!431 = !DILocalVariable(name: "B", arg: 1, scope: !427, file: !3, line: 111, type: !430)
!432 = !DILocation(line: 111, column: 35, scope: !427)
!433 = !DILocalVariable(name: "b", scope: !427, file: !3, line: 112, type: !6)
!434 = !DILocation(line: 112, column: 14, scope: !427)
!435 = !DILocalVariable(name: "sq", scope: !427, file: !3, line: 113, type: !113)
!436 = !DILocation(line: 113, column: 9, scope: !427)
!437 = !DILocation(line: 115, column: 13, scope: !438)
!438 = distinct !DILexicalBlock(scope: !427, file: !3, line: 115, column: 5)
!439 = !DILocation(line: 115, column: 10, scope: !438)
!440 = !DILocation(line: 115, column: 18, scope: !441)
!441 = distinct !DILexicalBlock(scope: !438, file: !3, line: 115, column: 5)
!442 = !DILocation(line: 115, column: 21, scope: !441)
!443 = !DILocation(line: 115, column: 5, scope: !438)
!444 = !DILocation(line: 116, column: 13, scope: !445)
!445 = distinct !DILexicalBlock(scope: !446, file: !3, line: 116, column: 13)
!446 = distinct !DILexicalBlock(scope: !441, file: !3, line: 115, column: 33)
!447 = !DILocation(line: 116, column: 18, scope: !445)
!448 = !DILocation(line: 116, column: 23, scope: !445)
!449 = !DILocation(line: 116, column: 20, scope: !445)
!450 = !DILocation(line: 116, column: 15, scope: !445)
!451 = !DILocation(line: 116, column: 13, scope: !446)
!452 = !DILocation(line: 117, column: 13, scope: !445)
!453 = !DILocation(line: 119, column: 13, scope: !445)
!454 = !DILocation(line: 121, column: 13, scope: !455)
!455 = distinct !DILexicalBlock(scope: !446, file: !3, line: 121, column: 13)
!456 = !DILocation(line: 121, column: 16, scope: !455)
!457 = !DILocation(line: 121, column: 20, scope: !455)
!458 = !DILocation(line: 121, column: 13, scope: !446)
!459 = !DILocation(line: 122, column: 13, scope: !455)
!460 = !DILocation(line: 123, column: 5, scope: !446)
!461 = !DILocation(line: 115, column: 29, scope: !441)
!462 = !DILocation(line: 115, column: 5, scope: !441)
!463 = distinct !{!463, !443, !464}
!464 = !DILocation(line: 123, column: 5, scope: !438)
!465 = !DILocation(line: 125, column: 5, scope: !427)
!466 = !DILocation(line: 126, column: 1, scope: !427)
!467 = distinct !DISubprogram(name: "PrintRotBitboards", linkageName: "_Z17PrintRotBitboardsP7state_t", scope: !3, file: !3, line: 128, type: !468, scopeLine: 128, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!468 = !DISubroutineType(types: !469)
!469 = !{null, !470}
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!471 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "state_t", file: !472, line: 11, size: 99200, flags: DIFlagTypePassByValue, elements: !473, identifier: "_ZTS7state_t")
!472 = !DIFile(filename: "./state.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/531.deepsjeng_r/build/build_base_ld-loop-ext-m64.0000")
!473 = !{!474, !475, !477, !478, !479, !480, !484, !485, !486, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !507, !510, !511, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "threadid", scope: !471, file: !472, line: 13, baseType: !113, size: 32)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "sboard", scope: !471, file: !472, line: 15, baseType: !476, size: 2048, offset: 32)
!476 = !DICompositeType(tag: DW_TAG_array_type, baseType: !113, size: 2048, elements: !15)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "All", scope: !471, file: !472, line: 16, baseType: !6, size: 64, offset: 2112)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "BlackPieces", scope: !471, file: !472, line: 17, baseType: !6, size: 64, offset: 2176)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "WhitePieces", scope: !471, file: !472, line: 17, baseType: !6, size: 64, offset: 2240)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "BitBoard", scope: !471, file: !472, line: 18, baseType: !481, size: 832, offset: 2304)
!481 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 832, elements: !482)
!482 = !{!483}
!483 = !DISubrange(count: 13)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "Material", scope: !471, file: !472, line: 20, baseType: !113, size: 32, offset: 3136)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "psq_score", scope: !471, file: !472, line: 21, baseType: !113, size: 32, offset: 3168)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "npieces", scope: !471, file: !472, line: 22, baseType: !487, size: 416, offset: 3200)
!487 = !DICompositeType(tag: DW_TAG_array_type, baseType: !113, size: 416, elements: !482)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "castleflag", scope: !471, file: !472, line: 23, baseType: !113, size: 32, offset: 3616)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "ep_square", scope: !471, file: !472, line: 25, baseType: !113, size: 32, offset: 3648)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "white_to_move", scope: !471, file: !472, line: 25, baseType: !113, size: 32, offset: 3680)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "wking_loc", scope: !471, file: !472, line: 25, baseType: !113, size: 32, offset: 3712)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "bking_loc", scope: !471, file: !472, line: 25, baseType: !113, size: 32, offset: 3744)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "ply", scope: !471, file: !472, line: 26, baseType: !113, size: 32, offset: 3776)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "fifty", scope: !471, file: !472, line: 26, baseType: !113, size: 32, offset: 3808)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !471, file: !472, line: 28, baseType: !6, size: 64, offset: 3840)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "pawnhash", scope: !471, file: !472, line: 29, baseType: !6, size: 64, offset: 3904)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "path_x", scope: !471, file: !472, line: 31, baseType: !498, size: 16384, offset: 3968)
!498 = !DICompositeType(tag: DW_TAG_array_type, baseType: !499, size: 16384, elements: !15)
!499 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "move_x", file: !7, line: 130, size: 256, flags: DIFlagTypePassByValue, elements: !500, identifier: "_ZTS6move_x")
!500 = !{!501, !502, !503, !504, !505, !506}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "epsq", scope: !499, file: !7, line: 131, baseType: !113, size: 32)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "fifty", scope: !499, file: !7, line: 132, baseType: !113, size: 32, offset: 32)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "castleflag", scope: !499, file: !7, line: 133, baseType: !113, size: 32, offset: 64)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "psq_score", scope: !499, file: !7, line: 134, baseType: !113, size: 32, offset: 96)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !499, file: !7, line: 135, baseType: !6, size: 64, offset: 128)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "pawnhash", scope: !499, file: !7, line: 136, baseType: !6, size: 64, offset: 192)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !471, file: !472, line: 32, baseType: !508, size: 2048, offset: 20352)
!508 = !DICompositeType(tag: DW_TAG_array_type, baseType: !509, size: 2048, elements: !15)
!509 = !DIDerivedType(tag: DW_TAG_typedef, name: "move_s", file: !7, line: 121, baseType: !113)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "plyeval", scope: !471, file: !472, line: 33, baseType: !476, size: 2048, offset: 22400)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "killerstack", scope: !471, file: !472, line: 41, baseType: !512, size: 8192, offset: 24448)
!512 = !DICompositeType(tag: DW_TAG_array_type, baseType: !513, size: 8192, elements: !15)
!513 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !471, file: !472, line: 36, size: 128, flags: DIFlagTypePassByValue, elements: !514, identifier: "_ZTSN7state_tUt_E")
!514 = !{!515, !516, !517, !518}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "killer1", scope: !513, file: !472, line: 37, baseType: !509, size: 32)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "killer2", scope: !513, file: !472, line: 38, baseType: !509, size: 32, offset: 32)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "killer3", scope: !513, file: !472, line: 39, baseType: !509, size: 32, offset: 64)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "killer4", scope: !513, file: !472, line: 40, baseType: !509, size: 32, offset: 96)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !471, file: !472, line: 43, baseType: !6, size: 64, offset: 32640)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "qnodes", scope: !471, file: !472, line: 43, baseType: !6, size: 64, offset: 32704)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "maxply", scope: !471, file: !472, line: 44, baseType: !113, size: 32, offset: 32768)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "checks", scope: !471, file: !472, line: 45, baseType: !476, size: 2048, offset: 32800)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "TTProbes", scope: !471, file: !472, line: 51, baseType: !10, size: 32, offset: 34848)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "TTHits", scope: !471, file: !472, line: 52, baseType: !10, size: 32, offset: 34880)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "TTStores", scope: !471, file: !472, line: 53, baseType: !10, size: 32, offset: 34912)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "TTColls", scope: !471, file: !472, line: 54, baseType: !10, size: 32, offset: 34944)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "wking_start", scope: !471, file: !472, line: 60, baseType: !113, size: 32, offset: 34976)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "bking_start", scope: !471, file: !472, line: 61, baseType: !113, size: 32, offset: 35008)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "wlrook_start", scope: !471, file: !472, line: 62, baseType: !113, size: 32, offset: 35040)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "wrrook_start", scope: !471, file: !472, line: 63, baseType: !113, size: 32, offset: 35072)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "blrook_start", scope: !471, file: !472, line: 64, baseType: !113, size: 32, offset: 35104)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "brrook_start", scope: !471, file: !472, line: 65, baseType: !113, size: 32, offset: 35136)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "hash_history", scope: !471, file: !472, line: 69, baseType: !534, size: 64000, offset: 35200)
!534 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 64000, elements: !535)
!535 = !{!536}
!536 = !DISubrange(count: 1000)
!537 = !DILocalVariable(name: "s", arg: 1, scope: !467, file: !3, line: 128, type: !470)
!538 = !DILocation(line: 128, column: 33, scope: !467)
!539 = !DILocation(line: 129, column: 5, scope: !467)
!540 = !DILocation(line: 130, column: 19, scope: !467)
!541 = !DILocation(line: 130, column: 22, scope: !467)
!542 = !DILocation(line: 130, column: 5, scope: !467)
!543 = !DILocation(line: 131, column: 1, scope: !467)
!544 = distinct !DISubprogram(name: "PrintAllBitboards", linkageName: "_Z17PrintAllBitboardsP7state_t", scope: !3, file: !3, line: 133, type: !468, scopeLine: 133, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!545 = !DILocalVariable(name: "s", arg: 1, scope: !544, file: !3, line: 133, type: !470)
!546 = !DILocation(line: 133, column: 33, scope: !544)
!547 = !DILocation(line: 134, column: 5, scope: !544)
!548 = !DILocation(line: 135, column: 19, scope: !544)
!549 = !DILocation(line: 135, column: 22, scope: !544)
!550 = !DILocation(line: 135, column: 5, scope: !544)
!551 = !DILocation(line: 136, column: 5, scope: !544)
!552 = !DILocation(line: 137, column: 19, scope: !544)
!553 = !DILocation(line: 137, column: 22, scope: !544)
!554 = !DILocation(line: 137, column: 5, scope: !544)
!555 = !DILocation(line: 138, column: 5, scope: !544)
!556 = !DILocation(line: 139, column: 19, scope: !544)
!557 = !DILocation(line: 139, column: 22, scope: !544)
!558 = !DILocation(line: 139, column: 5, scope: !544)
!559 = !DILocalVariable(name: "BitBoard", scope: !544, file: !3, line: 141, type: !560)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!561 = !DILocation(line: 141, column: 15, scope: !544)
!562 = !DILocation(line: 141, column: 26, scope: !544)
!563 = !DILocation(line: 141, column: 29, scope: !544)
!564 = !DILocation(line: 143, column: 5, scope: !544)
!565 = !DILocation(line: 144, column: 19, scope: !544)
!566 = !DILocation(line: 144, column: 5, scope: !544)
!567 = !DILocation(line: 145, column: 5, scope: !544)
!568 = !DILocation(line: 146, column: 19, scope: !544)
!569 = !DILocation(line: 146, column: 5, scope: !544)
!570 = !DILocation(line: 147, column: 5, scope: !544)
!571 = !DILocation(line: 148, column: 19, scope: !544)
!572 = !DILocation(line: 148, column: 5, scope: !544)
!573 = !DILocation(line: 149, column: 5, scope: !544)
!574 = !DILocation(line: 150, column: 19, scope: !544)
!575 = !DILocation(line: 150, column: 5, scope: !544)
!576 = !DILocation(line: 151, column: 5, scope: !544)
!577 = !DILocation(line: 152, column: 19, scope: !544)
!578 = !DILocation(line: 152, column: 5, scope: !544)
!579 = !DILocation(line: 153, column: 5, scope: !544)
!580 = !DILocation(line: 154, column: 19, scope: !544)
!581 = !DILocation(line: 154, column: 5, scope: !544)
!582 = !DILocation(line: 155, column: 5, scope: !544)
!583 = !DILocation(line: 156, column: 19, scope: !544)
!584 = !DILocation(line: 156, column: 5, scope: !544)
!585 = !DILocation(line: 157, column: 5, scope: !544)
!586 = !DILocation(line: 158, column: 19, scope: !544)
!587 = !DILocation(line: 158, column: 5, scope: !544)
!588 = !DILocation(line: 159, column: 5, scope: !544)
!589 = !DILocation(line: 160, column: 19, scope: !544)
!590 = !DILocation(line: 160, column: 5, scope: !544)
!591 = !DILocation(line: 161, column: 5, scope: !544)
!592 = !DILocation(line: 162, column: 19, scope: !544)
!593 = !DILocation(line: 162, column: 5, scope: !544)
!594 = !DILocation(line: 163, column: 1, scope: !544)
!595 = distinct !DISubprogram(name: "SetupPrecalculatedData", linkageName: "_Z22SetupPrecalculatedDatav", scope: !3, file: !3, line: 168, type: !137, scopeLine: 168, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
