; ModuleID = 'search.cpp'
source_filename = "search.cpp"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.gamestate_t = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [1000 x i32], [1000 x %struct.move_x], i64, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.move_x = type { i32, i32, i32, i32, i64, i64 }
%struct.scoreboard_t = type { i32, i32, [8 x %struct.anon.0], [8 x i32], [8 x %struct.state_t] }
%struct.anon.0 = type { i32, i32, i32 }
%struct.state_t = type { i32, [64 x i32], i64, i64, i64, [13 x i64], i32, i32, [13 x i32], i32, i32, i32, i32, i32, i32, i32, i64, i64, [64 x %struct.move_x], [64 x i32], [64 x i32], [64 x %struct.anon], i64, i64, i32, [64 x i32], i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [1000 x i64] }
%struct.anon = type { i32, i32, i32, i32 }

$_ZSt3minIiERKT_S2_S2_ = comdat any

$_ZSt3maxIiERKT_S2_S2_ = comdat any

@history_h = dso_local global [8 x [12 x [64 x i32]]] zeroinitializer, align 16, !dbg !0
@history_hit = dso_local global [8 x [12 x [64 x i32]]] zeroinitializer, align 16, !dbg !12
@history_tot = dso_local global [8 x [12 x [64 x i32]]] zeroinitializer, align 16, !dbg !19
@gamestate = external dso_local global %struct.gamestate_t, align 8
@contempt = external dso_local global i32, align 4
@material = external dso_local constant [14 x i32], align 16

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "history_h", scope: !2, file: !3, line: 40, type: !14, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus_14, file: !3, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !11, imports: !140, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "search.cpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/531.deepsjeng_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !{}
!5 = !{!6, !9, !10}
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITBOARD", file: !7, line: 33, baseType: !8)
!7 = !DIFile(filename: "./sjeng.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/531.deepsjeng_r/build/build_base_ld-loop-ext-m64.0000")
!8 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!9 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!10 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!11 = !{!0, !12, !19, !21, !95, !97, !134}
!12 = !DIGlobalVariableExpression(var: !13, expr: !DIExpression())
!13 = distinct !DIGlobalVariable(name: "history_hit", scope: !2, file: !3, line: 41, type: !14, isLocal: false, isDefinition: true)
!14 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 196608, elements: !15)
!15 = !{!16, !17, !18}
!16 = !DISubrange(count: 8)
!17 = !DISubrange(count: 12)
!18 = !DISubrange(count: 64)
!19 = !DIGlobalVariableExpression(var: !20, expr: !DIExpression())
!20 = distinct !DIGlobalVariable(name: "history_tot", scope: !2, file: !3, line: 42, type: !14, isLocal: false, isDefinition: true)
!21 = !DIGlobalVariableExpression(var: !22, expr: !DIExpression())
!22 = distinct !DIGlobalVariable(name: "changes", scope: !23, file: !3, line: 1328, type: !9, isLocal: true, isDefinition: true)
!23 = distinct !DISubprogram(name: "search_root", linkageName: "_Z11search_rootP7state_tiii", scope: !3, file: !3, line: 1316, type: !24, scopeLine: 1316, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!24 = !DISubroutineType(types: !25)
!25 = !{!26, !27, !9, !9, !9}
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "move_s", file: !7, line: 121, baseType: !9)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!28 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "state_t", file: !29, line: 11, size: 99200, flags: DIFlagTypePassByValue, elements: !30, identifier: "_ZTS7state_t")
!29 = !DIFile(filename: "./state.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/531.deepsjeng_r/build/build_base_ld-loop-ext-m64.0000")
!30 = !{!31, !32, !35, !36, !37, !38, !42, !43, !44, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !65, !67, !68, !76, !77, !78, !79, !80, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "threadid", scope: !28, file: !29, line: 13, baseType: !9, size: 32)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "sboard", scope: !28, file: !29, line: 15, baseType: !33, size: 2048, offset: 32)
!33 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 2048, elements: !34)
!34 = !{!18}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "All", scope: !28, file: !29, line: 16, baseType: !6, size: 64, offset: 2112)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "BlackPieces", scope: !28, file: !29, line: 17, baseType: !6, size: 64, offset: 2176)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "WhitePieces", scope: !28, file: !29, line: 17, baseType: !6, size: 64, offset: 2240)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "BitBoard", scope: !28, file: !29, line: 18, baseType: !39, size: 832, offset: 2304)
!39 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 832, elements: !40)
!40 = !{!41}
!41 = !DISubrange(count: 13)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "Material", scope: !28, file: !29, line: 20, baseType: !9, size: 32, offset: 3136)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "psq_score", scope: !28, file: !29, line: 21, baseType: !9, size: 32, offset: 3168)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "npieces", scope: !28, file: !29, line: 22, baseType: !45, size: 416, offset: 3200)
!45 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 416, elements: !40)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "castleflag", scope: !28, file: !29, line: 23, baseType: !9, size: 32, offset: 3616)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "ep_square", scope: !28, file: !29, line: 25, baseType: !9, size: 32, offset: 3648)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "white_to_move", scope: !28, file: !29, line: 25, baseType: !9, size: 32, offset: 3680)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "wking_loc", scope: !28, file: !29, line: 25, baseType: !9, size: 32, offset: 3712)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "bking_loc", scope: !28, file: !29, line: 25, baseType: !9, size: 32, offset: 3744)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "ply", scope: !28, file: !29, line: 26, baseType: !9, size: 32, offset: 3776)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "fifty", scope: !28, file: !29, line: 26, baseType: !9, size: 32, offset: 3808)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !28, file: !29, line: 28, baseType: !6, size: 64, offset: 3840)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "pawnhash", scope: !28, file: !29, line: 29, baseType: !6, size: 64, offset: 3904)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "path_x", scope: !28, file: !29, line: 31, baseType: !56, size: 16384, offset: 3968)
!56 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 16384, elements: !34)
!57 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "move_x", file: !7, line: 130, size: 256, flags: DIFlagTypePassByValue, elements: !58, identifier: "_ZTS6move_x")
!58 = !{!59, !60, !61, !62, !63, !64}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "epsq", scope: !57, file: !7, line: 131, baseType: !9, size: 32)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "fifty", scope: !57, file: !7, line: 132, baseType: !9, size: 32, offset: 32)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "castleflag", scope: !57, file: !7, line: 133, baseType: !9, size: 32, offset: 64)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "psq_score", scope: !57, file: !7, line: 134, baseType: !9, size: 32, offset: 96)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !57, file: !7, line: 135, baseType: !6, size: 64, offset: 128)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "pawnhash", scope: !57, file: !7, line: 136, baseType: !6, size: 64, offset: 192)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !28, file: !29, line: 32, baseType: !66, size: 2048, offset: 20352)
!66 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 2048, elements: !34)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "plyeval", scope: !28, file: !29, line: 33, baseType: !33, size: 2048, offset: 22400)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "killerstack", scope: !28, file: !29, line: 41, baseType: !69, size: 8192, offset: 24448)
!69 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 8192, elements: !34)
!70 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !28, file: !29, line: 36, size: 128, flags: DIFlagTypePassByValue, elements: !71, identifier: "_ZTSN7state_tUt_E")
!71 = !{!72, !73, !74, !75}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "killer1", scope: !70, file: !29, line: 37, baseType: !26, size: 32)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "killer2", scope: !70, file: !29, line: 38, baseType: !26, size: 32, offset: 32)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "killer3", scope: !70, file: !29, line: 39, baseType: !26, size: 32, offset: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "killer4", scope: !70, file: !29, line: 40, baseType: !26, size: 32, offset: 96)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !28, file: !29, line: 43, baseType: !6, size: 64, offset: 32640)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "qnodes", scope: !28, file: !29, line: 43, baseType: !6, size: 64, offset: 32704)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "maxply", scope: !28, file: !29, line: 44, baseType: !9, size: 32, offset: 32768)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "checks", scope: !28, file: !29, line: 45, baseType: !33, size: 2048, offset: 32800)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "TTProbes", scope: !28, file: !29, line: 51, baseType: !81, size: 32, offset: 34848)
!81 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "TTHits", scope: !28, file: !29, line: 52, baseType: !81, size: 32, offset: 34880)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "TTStores", scope: !28, file: !29, line: 53, baseType: !81, size: 32, offset: 34912)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "TTColls", scope: !28, file: !29, line: 54, baseType: !81, size: 32, offset: 34944)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "wking_start", scope: !28, file: !29, line: 60, baseType: !9, size: 32, offset: 34976)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "bking_start", scope: !28, file: !29, line: 61, baseType: !9, size: 32, offset: 35008)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "wlrook_start", scope: !28, file: !29, line: 62, baseType: !9, size: 32, offset: 35040)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "wrrook_start", scope: !28, file: !29, line: 63, baseType: !9, size: 32, offset: 35072)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "blrook_start", scope: !28, file: !29, line: 64, baseType: !9, size: 32, offset: 35104)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "brrook_start", scope: !28, file: !29, line: 65, baseType: !9, size: 32, offset: 35136)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "hash_history", scope: !28, file: !29, line: 69, baseType: !92, size: 64000, offset: 35200)
!92 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 64000, elements: !93)
!93 = !{!94}
!94 = !DISubrange(count: 1000)
!95 = !DIGlobalVariableExpression(var: !96, expr: !DIExpression())
!96 = distinct !DIGlobalVariable(name: "bmove", scope: !23, file: !3, line: 1329, type: !26, isLocal: true, isDefinition: true)
!97 = !DIGlobalVariableExpression(var: !98, expr: !DIExpression())
!98 = distinct !DIGlobalVariable(name: "lastsearchscore", scope: !99, file: !3, line: 1638, type: !9, isLocal: true, isDefinition: true)
!99 = distinct !DISubprogram(name: "think", linkageName: "_Z5thinkP11gamestate_tP7state_t", scope: !3, file: !3, line: 1629, type: !100, scopeLine: 1629, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!100 = !DISubroutineType(types: !101)
!101 = !{!26, !102, !27}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gamestate_t", file: !29, line: 72, size: 288832, flags: DIFlagTypePassByValue, elements: !104, identifier: "_ZTS11gamestate_t")
!104 = !{!105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !123, !125, !126, !127, !128, !129, !130, !131, !132, !133}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "cur_score", scope: !103, file: !29, line: 73, baseType: !9, size: 32)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "phase", scope: !103, file: !29, line: 74, baseType: !9, size: 32, offset: 32)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "root_to_move", scope: !103, file: !29, line: 75, baseType: !9, size: 32, offset: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "comp_color", scope: !103, file: !29, line: 76, baseType: !9, size: 32, offset: 96)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !103, file: !29, line: 76, baseType: !9, size: 32, offset: 128)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "i_depth", scope: !103, file: !29, line: 76, baseType: !9, size: 32, offset: 160)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "moves_to_tc", scope: !103, file: !29, line: 77, baseType: !9, size: 32, offset: 192)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "min_per_game", scope: !103, file: !29, line: 77, baseType: !9, size: 32, offset: 224)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "sec_per_game", scope: !103, file: !29, line: 77, baseType: !9, size: 32, offset: 256)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "inc", scope: !103, file: !29, line: 77, baseType: !9, size: 32, offset: 288)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "time_left", scope: !103, file: !29, line: 78, baseType: !9, size: 32, offset: 320)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "opp_time", scope: !103, file: !29, line: 78, baseType: !9, size: 32, offset: 352)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "time_for_move", scope: !103, file: !29, line: 78, baseType: !9, size: 32, offset: 384)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_time", scope: !103, file: !29, line: 79, baseType: !9, size: 32, offset: 416)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "maxdepth", scope: !103, file: !29, line: 80, baseType: !9, size: 32, offset: 448)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "move_number", scope: !103, file: !29, line: 82, baseType: !9, size: 32, offset: 480)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "game_history", scope: !103, file: !29, line: 83, baseType: !122, size: 32000, offset: 512)
!122 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 32000, elements: !93)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "game_history_x", scope: !103, file: !29, line: 84, baseType: !124, size: 256000, offset: 32512)
!124 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 256000, elements: !93)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "pvnodecount", scope: !103, file: !29, line: 85, baseType: !6, size: 64, offset: 288512)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "start_time", scope: !103, file: !29, line: 86, baseType: !9, size: 32, offset: 288576)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "pv_best", scope: !103, file: !29, line: 88, baseType: !81, size: 32, offset: 288608)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "legals", scope: !103, file: !29, line: 89, baseType: !9, size: 32, offset: 288640)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "failed", scope: !103, file: !29, line: 90, baseType: !9, size: 32, offset: 288672)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "failedhigh", scope: !103, file: !29, line: 91, baseType: !9, size: 32, offset: 288704)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "extendedtime", scope: !103, file: !29, line: 92, baseType: !9, size: 32, offset: 288736)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "time_exit", scope: !103, file: !29, line: 93, baseType: !9, size: 32, offset: 288768)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "time_failure", scope: !103, file: !29, line: 93, baseType: !9, size: 32, offset: 288800)
!134 = !DIGlobalVariableExpression(var: !135, expr: !DIExpression())
!135 = distinct !DIGlobalVariable(name: "rc_index", linkageName: "_ZL8rc_index", scope: !2, file: !3, line: 36, type: !136, isLocal: true, isDefinition: true)
!136 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 448, elements: !138)
!137 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !9)
!138 = !{!139}
!139 = !DISubrange(count: 14)
!140 = !{!141, !148, !152, !159, !163, !168, !170, !178, !182, !186, !200, !204, !208, !212, !216, !221, !225, !229, !233, !237, !245, !249, !253, !255, !259, !263, !267, !273, !277, !281, !283, !291, !295, !303, !305, !309, !313, !317, !321, !325, !329, !334, !335, !336, !337, !339, !340, !341, !342, !343, !344, !345, !347, !348, !349, !350, !351, !352, !353, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !388, !390, !392, !396, !398, !400, !402, !404, !406, !408, !410, !415, !419, !421, !423, !428, !430, !432, !434, !436, !438, !440, !443, !445, !447, !451, !455, !457, !459, !461, !463, !465, !467, !469, !471, !473, !475, !479, !483, !485, !487, !489, !491, !493, !495, !497, !499, !501, !503, !505, !507, !509, !511, !513, !517, !521, !525, !527, !529, !531, !533, !535, !537, !539, !541, !543, !547, !551, !555, !557, !559, !561, !565, !569, !573, !575, !577, !579, !581, !583, !585, !587, !589, !591, !593, !595, !597, !601, !605, !609, !611, !613, !615, !617, !621, !625, !627, !629, !631, !633, !635, !637, !641, !645, !647, !649, !651, !653, !657, !661, !665, !667, !669, !671, !673, !675, !677, !681, !685, !689, !691, !695, !699, !701, !703, !705, !707, !709, !711, !713, !718, !722, !778}
!141 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !142, entity: !143, file: !147, line: 52)
!142 = !DINamespace(name: "std", scope: null)
!143 = !DISubprogram(name: "abs", scope: !144, file: !144, line: 840, type: !145, flags: DIFlagPrototyped, spFlags: 0)
!144 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!145 = !DISubroutineType(types: !146)
!146 = !{!9, !9}
!147 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/bits/std_abs.h", directory: "")
!148 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !142, entity: !149, file: !151, line: 127)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "div_t", file: !144, line: 62, baseType: !150)
!150 = !DICompositeType(tag: DW_TAG_structure_type, file: !144, line: 58, flags: DIFlagFwdDecl, identifier: "_ZTS5div_t")
!151 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/cstdlib", directory: "")
!152 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !142, entity: !153, file: !151, line: 128)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "ldiv_t", file: !144, line: 70, baseType: !154)
!154 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !144, line: 66, size: 128, flags: DIFlagTypePassByValue, elements: !155, identifier: "_ZTS6ldiv_t")
!155 = !{!156, !158}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !154, file: !144, line: 68, baseType: !157, size: 64)
!157 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !154, file: !144, line: 69, baseType: !157, size: 64, offset: 64)
!159 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !142, entity: !160, file: !151, line: 130)
!160 = !DISubprogram(name: "abort", scope: !144, file: !144, line: 591, type: !161, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!161 = !DISubroutineType(types: !162)
!162 = !{null}
!163 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !142, entity: !164, file: !151, line: 134)
!164 = !DISubprogram(name: "atexit", scope: !144, file: !144, line: 595, type: !165, flags: DIFlagPrototyped, spFlags: 0)
!165 = !DISubroutineType(types: !166)
!166 = !{!9, !167}
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!168 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !142, entity: !169, file: !151, line: 137)
!169 = !DISubprogram(name: "at_quick_exit", scope: !144, file: !144, line: 600, type: !165, flags: DIFlagPrototyped, spFlags: 0)
!170 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !142, entity: !171, file: !151, line: 140)
!171 = !DISubprogram(name: "atof", scope: !144, file: !144, line: 101, type: !172, flags: DIFlagPrototyped, spFlags: 0)
!172 = !DISubroutineType(types: !173)
!173 = !{!174, !175}
!174 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!176 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !177)
!177 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!178 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !142, entity: !179, file: !151, line: 141)
!179 = !DISubprogram(name: "atoi", scope: !144, file: !144, line: 104, type: !180, flags: DIFlagPrototyped, spFlags: 0)
!180 = !DISubroutineType(types: !181)
!181 = !{!9, !175}
!182 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !142, entity: !183, file: !151, line: 142)
!183 = !DISubprogram(name: "atol", scope: !144, file: !144, line: 107, type: !184, flags: DIFlagPrototyped, spFlags: 0)
!184 = !DISubroutineType(types: !185)
!185 = !{!157, !175}
!186 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !142, entity: !187, file: !151, line: 143)
!187 = !DISubprogram(name: "bsearch", scope: !144, file: !144, line: 820, type: !188, flags: DIFlagPrototyped, spFlags: 0)
!188 = !DISubroutineType(types: !189)
!189 = !{!190, !191, !191, !193, !193, !196}
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !194, line: 46, baseType: !195)
!194 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!195 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "__compar_fn_t", file: !144, line: 808, baseType: !197)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!198 = !DISubroutineType(types: !199)
!199 = !{!9, !191, !191}
!200 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !142, entity: !201, file: !151, line: 144)
!201 = !DISubprogram(name: "calloc", scope: !144, file: !144, line: 542, type: !202, flags: DIFlagPrototyped, spFlags: 0)
!202 = !DISubroutineType(types: !203)
!203 = !{!190, !193, !193}
!204 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !142, entity: !205, file: !151, line: 145)
!205 = !DISubprogram(name: "div", scope: !144, file: !144, line: 852, type: !206, flags: DIFlagPrototyped, spFlags: 0)
!206 = !DISubroutineType(types: !207)
!207 = !{!149, !9, !9}
!208 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !142, entity: !209, file: !151, line: 146)
!209 = !DISubprogram(name: "exit", scope: !144, file: !144, line: 617, type: !210, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!210 = !DISubroutineType(types: !211)
!211 = !{null, !9}
!212 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !142, entity: !213, file: !151, line: 147)
!213 = !DISubprogram(name: "free", scope: !144, file: !144, line: 565, type: !214, flags: DIFlagPrototyped, spFlags: 0)
!214 = !DISubroutineType(types: !215)
!215 = !{null, !190}
!216 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !142, entity: !217, file: !151, line: 148)
!217 = !DISubprogram(name: "getenv", scope: !144, file: !144, line: 634, type: !218, flags: DIFlagPrototyped, spFlags: 0)
!218 = !DISubroutineType(types: !219)
!219 = !{!220, !175}
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!221 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !142, entity: !222, file: !151, line: 149)
!222 = !DISubprogram(name: "labs", scope: !144, file: !144, line: 841, type: !223, flags: DIFlagPrototyped, spFlags: 0)
!223 = !DISubroutineType(types: !224)
!224 = !{!157, !157}
!225 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !142, entity: !226, file: !151, line: 150)
!226 = !DISubprogram(name: "ldiv", scope: !144, file: !144, line: 854, type: !227, flags: DIFlagPrototyped, spFlags: 0)
!227 = !DISubroutineType(types: !228)
!228 = !{!153, !157, !157}
!229 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !142, entity: !230, file: !151, line: 151)
!230 = !DISubprogram(name: "malloc", scope: !144, file: !144, line: 539, type: !231, flags: DIFlagPrototyped, spFlags: 0)
!231 = !DISubroutineType(types: !232)
!232 = !{!190, !193}
!233 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !142, entity: !234, file: !151, line: 153)
!234 = !DISubprogram(name: "mblen", scope: !144, file: !144, line: 922, type: !235, flags: DIFlagPrototyped, spFlags: 0)
!235 = !DISubroutineType(types: !236)
!236 = !{!9, !175, !193}
!237 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !142, entity: !238, file: !151, line: 154)
!238 = !DISubprogram(name: "mbstowcs", scope: !144, file: !144, line: 933, type: !239, flags: DIFlagPrototyped, spFlags: 0)
!239 = !DISubroutineType(types: !240)
!240 = !{!193, !241, !244, !193}
!241 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !242)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!243 = !DIBasicType(name: "wchar_t", size: 32, encoding: DW_ATE_signed)
!244 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !175)
!245 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !142, entity: !246, file: !151, line: 155)
!246 = !DISubprogram(name: "mbtowc", scope: !144, file: !144, line: 925, type: !247, flags: DIFlagPrototyped, spFlags: 0)
!247 = !DISubroutineType(types: !248)
!248 = !{!9, !241, !244, !193}
!249 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !142, entity: !250, file: !151, line: 157)
!250 = !DISubprogram(name: "qsort", scope: !144, file: !144, line: 830, type: !251, flags: DIFlagPrototyped, spFlags: 0)
!251 = !DISubroutineType(types: !252)
!252 = !{null, !190, !193, !193, !196}
!253 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !142, entity: !254, file: !151, line: 160)
!254 = !DISubprogram(name: "quick_exit", scope: !144, file: !144, line: 623, type: !210, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!255 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !142, entity: !256, file: !151, line: 163)
!256 = !DISubprogram(name: "rand", scope: !144, file: !144, line: 453, type: !257, flags: DIFlagPrototyped, spFlags: 0)
!257 = !DISubroutineType(types: !258)
!258 = !{!9}
!259 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !142, entity: !260, file: !151, line: 164)
!260 = !DISubprogram(name: "realloc", scope: !144, file: !144, line: 550, type: !261, flags: DIFlagPrototyped, spFlags: 0)
!261 = !DISubroutineType(types: !262)
!262 = !{!190, !190, !193}
!263 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !142, entity: !264, file: !151, line: 165)
!264 = !DISubprogram(name: "srand", scope: !144, file: !144, line: 455, type: !265, flags: DIFlagPrototyped, spFlags: 0)
!265 = !DISubroutineType(types: !266)
!266 = !{null, !81}
!267 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !142, entity: !268, file: !151, line: 166)
!268 = !DISubprogram(name: "strtod", scope: !144, file: !144, line: 117, type: !269, flags: DIFlagPrototyped, spFlags: 0)
!269 = !DISubroutineType(types: !270)
!270 = !{!174, !244, !271}
!271 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !272)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!273 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !142, entity: !274, file: !151, line: 167)
!274 = !DISubprogram(name: "strtol", scope: !144, file: !144, line: 176, type: !275, flags: DIFlagPrototyped, spFlags: 0)
!275 = !DISubroutineType(types: !276)
!276 = !{!157, !244, !271, !9}
!277 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !142, entity: !278, file: !151, line: 168)
!278 = !DISubprogram(name: "strtoul", scope: !144, file: !144, line: 180, type: !279, flags: DIFlagPrototyped, spFlags: 0)
!279 = !DISubroutineType(types: !280)
!280 = !{!195, !244, !271, !9}
!281 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !142, entity: !282, file: !151, line: 169)
!282 = !DISubprogram(name: "system", scope: !144, file: !144, line: 784, type: !180, flags: DIFlagPrototyped, spFlags: 0)
!283 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !142, entity: !284, file: !151, line: 171)
!284 = !DISubprogram(name: "wcstombs", scope: !144, file: !144, line: 936, type: !285, flags: DIFlagPrototyped, spFlags: 0)
!285 = !DISubroutineType(types: !286)
!286 = !{!193, !287, !288, !193}
!287 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !220)
!288 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !289)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64)
!290 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !243)
!291 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !142, entity: !292, file: !151, line: 172)
!292 = !DISubprogram(name: "wctomb", scope: !144, file: !144, line: 929, type: !293, flags: DIFlagPrototyped, spFlags: 0)
!293 = !DISubroutineType(types: !294)
!294 = !{!9, !220, !243}
!295 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !296, entity: !297, file: !151, line: 200)
!296 = !DINamespace(name: "__gnu_cxx", scope: null)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "lldiv_t", file: !144, line: 80, baseType: !298)
!298 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !144, line: 76, size: 128, flags: DIFlagTypePassByValue, elements: !299, identifier: "_ZTS7lldiv_t")
!299 = !{!300, !302}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !298, file: !144, line: 78, baseType: !301, size: 64)
!301 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !298, file: !144, line: 79, baseType: !301, size: 64, offset: 64)
!303 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !296, entity: !304, file: !151, line: 206)
!304 = !DISubprogram(name: "_Exit", scope: !144, file: !144, line: 629, type: !210, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!305 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !296, entity: !306, file: !151, line: 210)
!306 = !DISubprogram(name: "llabs", scope: !144, file: !144, line: 844, type: !307, flags: DIFlagPrototyped, spFlags: 0)
!307 = !DISubroutineType(types: !308)
!308 = !{!301, !301}
!309 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !296, entity: !310, file: !151, line: 216)
!310 = !DISubprogram(name: "lldiv", scope: !144, file: !144, line: 858, type: !311, flags: DIFlagPrototyped, spFlags: 0)
!311 = !DISubroutineType(types: !312)
!312 = !{!297, !301, !301}
!313 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !296, entity: !314, file: !151, line: 227)
!314 = !DISubprogram(name: "atoll", scope: !144, file: !144, line: 112, type: !315, flags: DIFlagPrototyped, spFlags: 0)
!315 = !DISubroutineType(types: !316)
!316 = !{!301, !175}
!317 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !296, entity: !318, file: !151, line: 228)
!318 = !DISubprogram(name: "strtoll", scope: !144, file: !144, line: 200, type: !319, flags: DIFlagPrototyped, spFlags: 0)
!319 = !DISubroutineType(types: !320)
!320 = !{!301, !244, !271, !9}
!321 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !296, entity: !322, file: !151, line: 229)
!322 = !DISubprogram(name: "strtoull", scope: !144, file: !144, line: 205, type: !323, flags: DIFlagPrototyped, spFlags: 0)
!323 = !DISubroutineType(types: !324)
!324 = !{!8, !244, !271, !9}
!325 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !296, entity: !326, file: !151, line: 231)
!326 = !DISubprogram(name: "strtof", scope: !144, file: !144, line: 123, type: !327, flags: DIFlagPrototyped, spFlags: 0)
!327 = !DISubroutineType(types: !328)
!328 = !{!10, !244, !271}
!329 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !296, entity: !330, file: !151, line: 232)
!330 = !DISubprogram(name: "strtold", scope: !144, file: !144, line: 126, type: !331, flags: DIFlagPrototyped, spFlags: 0)
!331 = !DISubroutineType(types: !332)
!332 = !{!333, !244, !271}
!333 = !DIBasicType(name: "long double", size: 128, encoding: DW_ATE_float)
!334 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !142, entity: !297, file: !151, line: 240)
!335 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !142, entity: !304, file: !151, line: 242)
!336 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !142, entity: !306, file: !151, line: 244)
!337 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !142, entity: !338, file: !151, line: 245)
!338 = !DISubprogram(name: "div", linkageName: "_ZN9__gnu_cxx3divExx", scope: !296, file: !151, line: 213, type: !311, flags: DIFlagPrototyped, spFlags: 0)
!339 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !142, entity: !310, file: !151, line: 246)
!340 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !142, entity: !314, file: !151, line: 248)
!341 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !142, entity: !326, file: !151, line: 249)
!342 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !142, entity: !318, file: !151, line: 250)
!343 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !142, entity: !322, file: !151, line: 251)
!344 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !142, entity: !330, file: !151, line: 252)
!345 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !160, file: !346, line: 38)
!346 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/stdlib.h", directory: "")
