; ModuleID = 'endgame.cpp'
source_filename = "endgame.cpp"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.state_t = type { i32, [64 x i32], i64, i64, i64, [13 x i64], i32, i32, [13 x i32], i32, i32, i32, i32, i32, i32, i32, i64, i64, [64 x %struct.move_x], [64 x i32], [64 x i32], [64 x %struct.anon], i64, i64, i32, [64 x i32], i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [1000 x i64] }
%struct.move_x = type { i32, i32, i32, i32, i64, i64 }
%struct.anon = type { i32, i32, i32, i32 }

@BlackSqMask = external dso_local global i64, align 8
@KingSafetyMask = external dso_local global [64 x i64], align 16
@FileMask = external dso_local global [8 x i64], align 16
@WhiteSqMask = external dso_local global i64, align 8
@Mask = external dso_local global [64 x i64], align 16

; Function Attrs: noinline uwtable
define dso_local i32 @_Z14drawn_endgamesP7state_tiii(%struct.state_t* %s, i32 %score, i32 %wmat, i32 %bmat) #0 !dbg !253 {
entry:
  %s.addr = alloca %struct.state_t*, align 8
  %score.addr = alloca i32, align 4
  %wmat.addr = alloca i32, align 4
  %bmat.addr = alloca i32, align 4
  %npieces = alloca i32*, align 8
  %BitBoard = alloca i64*, align 8
  %wking_loc = alloca i32, align 4
  %bking_loc = alloca i32, align 4
  %white_to_move = alloca i32, align 4
  %square1 = alloca i32, align 4
  %square1601 = alloca i32, align 4
  %bkrun = alloca i32, align 4

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus_14, file: !1, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, imports: !3, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "endgame.cpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/531.deepsjeng_r/build/build_base_ld-loop-ext-m64.0000")
!2 = !{}
!3 = !{!4, !12, !16, !23, !27, !32, !34, !42, !46, !50, !64, !68, !72, !76, !80, !85, !89, !93, !97, !101, !109, !113, !117, !119, !123, !127, !132, !138, !142, !146, !148, !156, !160, !168, !170, !174, !178, !182, !186, !191, !196, !201, !202, !203, !204, !206, !207, !208, !209, !210, !211, !212, !214, !215, !216, !217, !218, !219, !220, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248}
!4 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !6, file: !11, line: 52)
!5 = !DINamespace(name: "std", scope: null)
!6 = !DISubprogram(name: "abs", scope: !7, file: !7, line: 840, type: !8, flags: DIFlagPrototyped, spFlags: 0)
!7 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!8 = !DISubroutineType(types: !9)
!9 = !{!10, !10}
!10 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!11 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/bits/std_abs.h", directory: "")
!12 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !13, file: !15, line: 127)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "div_t", file: !7, line: 62, baseType: !14)
!14 = !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 58, flags: DIFlagFwdDecl, identifier: "_ZTS5div_t")
!15 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/cstdlib", directory: "")
!16 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !17, file: !15, line: 128)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "ldiv_t", file: !7, line: 70, baseType: !18)
!18 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 66, size: 128, flags: DIFlagTypePassByValue, elements: !19, identifier: "_ZTS6ldiv_t")
!19 = !{!20, !22}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !18, file: !7, line: 68, baseType: !21, size: 64)
!21 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !18, file: !7, line: 69, baseType: !21, size: 64, offset: 64)
!23 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !24, file: !15, line: 130)
!24 = !DISubprogram(name: "abort", scope: !7, file: !7, line: 591, type: !25, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!25 = !DISubroutineType(types: !26)
!26 = !{null}
!27 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !28, file: !15, line: 134)
!28 = !DISubprogram(name: "atexit", scope: !7, file: !7, line: 595, type: !29, flags: DIFlagPrototyped, spFlags: 0)
!29 = !DISubroutineType(types: !30)
!30 = !{!10, !31}
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!32 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !33, file: !15, line: 137)
!33 = !DISubprogram(name: "at_quick_exit", scope: !7, file: !7, line: 600, type: !29, flags: DIFlagPrototyped, spFlags: 0)
!34 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !35, file: !15, line: 140)
!35 = !DISubprogram(name: "atof", scope: !7, file: !7, line: 101, type: !36, flags: DIFlagPrototyped, spFlags: 0)
!36 = !DISubroutineType(types: !37)
!37 = !{!38, !39}
!38 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!40 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !41)
!41 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!42 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !43, file: !15, line: 141)
!43 = !DISubprogram(name: "atoi", scope: !7, file: !7, line: 104, type: !44, flags: DIFlagPrototyped, spFlags: 0)
!44 = !DISubroutineType(types: !45)
!45 = !{!10, !39}
!46 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !47, file: !15, line: 142)
!47 = !DISubprogram(name: "atol", scope: !7, file: !7, line: 107, type: !48, flags: DIFlagPrototyped, spFlags: 0)
!48 = !DISubroutineType(types: !49)
!49 = !{!21, !39}
!50 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !51, file: !15, line: 143)
!51 = !DISubprogram(name: "bsearch", scope: !7, file: !7, line: 820, type: !52, flags: DIFlagPrototyped, spFlags: 0)
!52 = !DISubroutineType(types: !53)
!53 = !{!54, !55, !55, !57, !57, !60}
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!56 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !58, line: 46, baseType: !59)
!58 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!59 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "__compar_fn_t", file: !7, line: 808, baseType: !61)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!62 = !DISubroutineType(types: !63)
!63 = !{!10, !55, !55}
!64 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !65, file: !15, line: 144)
!65 = !DISubprogram(name: "calloc", scope: !7, file: !7, line: 542, type: !66, flags: DIFlagPrototyped, spFlags: 0)
!66 = !DISubroutineType(types: !67)
!67 = !{!54, !57, !57}
!68 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !69, file: !15, line: 145)
!69 = !DISubprogram(name: "div", scope: !7, file: !7, line: 852, type: !70, flags: DIFlagPrototyped, spFlags: 0)
!70 = !DISubroutineType(types: !71)
!71 = !{!13, !10, !10}
!72 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !73, file: !15, line: 146)
!73 = !DISubprogram(name: "exit", scope: !7, file: !7, line: 617, type: !74, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!74 = !DISubroutineType(types: !75)
!75 = !{null, !10}
!76 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !77, file: !15, line: 147)
!77 = !DISubprogram(name: "free", scope: !7, file: !7, line: 565, type: !78, flags: DIFlagPrototyped, spFlags: 0)
!78 = !DISubroutineType(types: !79)
!79 = !{null, !54}
!80 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !81, file: !15, line: 148)
!81 = !DISubprogram(name: "getenv", scope: !7, file: !7, line: 634, type: !82, flags: DIFlagPrototyped, spFlags: 0)
!82 = !DISubroutineType(types: !83)
!83 = !{!84, !39}
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!85 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !86, file: !15, line: 149)
!86 = !DISubprogram(name: "labs", scope: !7, file: !7, line: 841, type: !87, flags: DIFlagPrototyped, spFlags: 0)
!87 = !DISubroutineType(types: !88)
!88 = !{!21, !21}
!89 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !90, file: !15, line: 150)
!90 = !DISubprogram(name: "ldiv", scope: !7, file: !7, line: 854, type: !91, flags: DIFlagPrototyped, spFlags: 0)
!91 = !DISubroutineType(types: !92)
!92 = !{!17, !21, !21}
!93 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !94, file: !15, line: 151)
!94 = !DISubprogram(name: "malloc", scope: !7, file: !7, line: 539, type: !95, flags: DIFlagPrototyped, spFlags: 0)
!95 = !DISubroutineType(types: !96)
!96 = !{!54, !57}
!97 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !98, file: !15, line: 153)
!98 = !DISubprogram(name: "mblen", scope: !7, file: !7, line: 922, type: !99, flags: DIFlagPrototyped, spFlags: 0)
!99 = !DISubroutineType(types: !100)
!100 = !{!10, !39, !57}
!101 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !102, file: !15, line: 154)
!102 = !DISubprogram(name: "mbstowcs", scope: !7, file: !7, line: 933, type: !103, flags: DIFlagPrototyped, spFlags: 0)
!103 = !DISubroutineType(types: !104)
!104 = !{!57, !105, !108, !57}
!105 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !106)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = !DIBasicType(name: "wchar_t", size: 32, encoding: DW_ATE_signed)
!108 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !39)
!109 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !110, file: !15, line: 155)
!110 = !DISubprogram(name: "mbtowc", scope: !7, file: !7, line: 925, type: !111, flags: DIFlagPrototyped, spFlags: 0)
!111 = !DISubroutineType(types: !112)
!112 = !{!10, !105, !108, !57}
!113 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !114, file: !15, line: 157)
!114 = !DISubprogram(name: "qsort", scope: !7, file: !7, line: 830, type: !115, flags: DIFlagPrototyped, spFlags: 0)
!115 = !DISubroutineType(types: !116)
!116 = !{null, !54, !57, !57, !60}
!117 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !118, file: !15, line: 160)
!118 = !DISubprogram(name: "quick_exit", scope: !7, file: !7, line: 623, type: !74, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!119 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !120, file: !15, line: 163)
!120 = !DISubprogram(name: "rand", scope: !7, file: !7, line: 453, type: !121, flags: DIFlagPrototyped, spFlags: 0)
!121 = !DISubroutineType(types: !122)
!122 = !{!10}
!123 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !124, file: !15, line: 164)
!124 = !DISubprogram(name: "realloc", scope: !7, file: !7, line: 550, type: !125, flags: DIFlagPrototyped, spFlags: 0)
!125 = !DISubroutineType(types: !126)
!126 = !{!54, !54, !57}
!127 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !128, file: !15, line: 165)
!128 = !DISubprogram(name: "srand", scope: !7, file: !7, line: 455, type: !129, flags: DIFlagPrototyped, spFlags: 0)
!129 = !DISubroutineType(types: !130)
!130 = !{null, !131}
!131 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!132 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !133, file: !15, line: 166)
!133 = !DISubprogram(name: "strtod", scope: !7, file: !7, line: 117, type: !134, flags: DIFlagPrototyped, spFlags: 0)
!134 = !DISubroutineType(types: !135)
!135 = !{!38, !108, !136}
!136 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !137)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!138 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !139, file: !15, line: 167)
!139 = !DISubprogram(name: "strtol", scope: !7, file: !7, line: 176, type: !140, flags: DIFlagPrototyped, spFlags: 0)
!140 = !DISubroutineType(types: !141)
!141 = !{!21, !108, !136, !10}
!142 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !143, file: !15, line: 168)
!143 = !DISubprogram(name: "strtoul", scope: !7, file: !7, line: 180, type: !144, flags: DIFlagPrototyped, spFlags: 0)
!144 = !DISubroutineType(types: !145)
!145 = !{!59, !108, !136, !10}
!146 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !147, file: !15, line: 169)
!147 = !DISubprogram(name: "system", scope: !7, file: !7, line: 784, type: !44, flags: DIFlagPrototyped, spFlags: 0)
!148 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !149, file: !15, line: 171)
!149 = !DISubprogram(name: "wcstombs", scope: !7, file: !7, line: 936, type: !150, flags: DIFlagPrototyped, spFlags: 0)
!150 = !DISubroutineType(types: !151)
!151 = !{!57, !152, !153, !57}
!152 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !84)
!153 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !154)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!155 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !107)
!156 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !157, file: !15, line: 172)
!157 = !DISubprogram(name: "wctomb", scope: !7, file: !7, line: 929, type: !158, flags: DIFlagPrototyped, spFlags: 0)
!158 = !DISubroutineType(types: !159)
!159 = !{!10, !84, !107}
!160 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !161, entity: !162, file: !15, line: 200)
!161 = !DINamespace(name: "__gnu_cxx", scope: null)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "lldiv_t", file: !7, line: 80, baseType: !163)
!163 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !7, line: 76, size: 128, flags: DIFlagTypePassByValue, elements: !164, identifier: "_ZTS7lldiv_t")
!164 = !{!165, !167}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !163, file: !7, line: 78, baseType: !166, size: 64)
!166 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !163, file: !7, line: 79, baseType: !166, size: 64, offset: 64)
!168 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !161, entity: !169, file: !15, line: 206)
!169 = !DISubprogram(name: "_Exit", scope: !7, file: !7, line: 629, type: !74, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!170 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !161, entity: !171, file: !15, line: 210)
!171 = !DISubprogram(name: "llabs", scope: !7, file: !7, line: 844, type: !172, flags: DIFlagPrototyped, spFlags: 0)
!172 = !DISubroutineType(types: !173)
!173 = !{!166, !166}
!174 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !161, entity: !175, file: !15, line: 216)
!175 = !DISubprogram(name: "lldiv", scope: !7, file: !7, line: 858, type: !176, flags: DIFlagPrototyped, spFlags: 0)
!176 = !DISubroutineType(types: !177)
!177 = !{!162, !166, !166}
!178 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !161, entity: !179, file: !15, line: 227)
!179 = !DISubprogram(name: "atoll", scope: !7, file: !7, line: 112, type: !180, flags: DIFlagPrototyped, spFlags: 0)
!180 = !DISubroutineType(types: !181)
!181 = !{!166, !39}
!182 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !161, entity: !183, file: !15, line: 228)
!183 = !DISubprogram(name: "strtoll", scope: !7, file: !7, line: 200, type: !184, flags: DIFlagPrototyped, spFlags: 0)
!184 = !DISubroutineType(types: !185)
!185 = !{!166, !108, !136, !10}
!186 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !161, entity: !187, file: !15, line: 229)
!187 = !DISubprogram(name: "strtoull", scope: !7, file: !7, line: 205, type: !188, flags: DIFlagPrototyped, spFlags: 0)
!188 = !DISubroutineType(types: !189)
!189 = !{!190, !108, !136, !10}
!190 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!191 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !161, entity: !192, file: !15, line: 231)
!192 = !DISubprogram(name: "strtof", scope: !7, file: !7, line: 123, type: !193, flags: DIFlagPrototyped, spFlags: 0)
!193 = !DISubroutineType(types: !194)
!194 = !{!195, !108, !136}
!195 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!196 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !161, entity: !197, file: !15, line: 232)
!197 = !DISubprogram(name: "strtold", scope: !7, file: !7, line: 126, type: !198, flags: DIFlagPrototyped, spFlags: 0)
!198 = !DISubroutineType(types: !199)
!199 = !{!200, !108, !136}
!200 = !DIBasicType(name: "long double", size: 128, encoding: DW_ATE_float)
!201 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !162, file: !15, line: 240)
!202 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !169, file: !15, line: 242)
!203 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !171, file: !15, line: 244)
!204 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !205, file: !15, line: 245)
!205 = !DISubprogram(name: "div", linkageName: "_ZN9__gnu_cxx3divExx", scope: !161, file: !15, line: 213, type: !176, flags: DIFlagPrototyped, spFlags: 0)
!206 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !175, file: !15, line: 246)
!207 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !179, file: !15, line: 248)
!208 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !192, file: !15, line: 249)
!209 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !183, file: !15, line: 250)
!210 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !187, file: !15, line: 251)
!211 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !197, file: !15, line: 252)
!212 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !24, file: !213, line: 38)
!213 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/stdlib.h", directory: "")
!214 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !28, file: !213, line: 39)
!215 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !73, file: !213, line: 40)
!216 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !33, file: !213, line: 43)
!217 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !118, file: !213, line: 46)
!218 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !13, file: !213, line: 51)
!219 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !17, file: !213, line: 52)
!220 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !221, file: !213, line: 54)
!221 = !DISubprogram(name: "abs", linkageName: "_ZSt3absg", scope: !5, file: !11, line: 103, type: !222, flags: DIFlagPrototyped, spFlags: 0)
!222 = !DISubroutineType(types: !223)
!223 = !{!224, !224}
!224 = !DIBasicType(name: "__float128", size: 128, encoding: DW_ATE_float)
!225 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !35, file: !213, line: 55)
!226 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !43, file: !213, line: 56)
!227 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !47, file: !213, line: 57)
!228 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !51, file: !213, line: 58)
!229 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !65, file: !213, line: 59)
!230 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !205, file: !213, line: 60)
!231 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !77, file: !213, line: 61)
!232 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !81, file: !213, line: 62)
!233 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !86, file: !213, line: 63)
!234 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !90, file: !213, line: 64)
!235 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !94, file: !213, line: 65)
!236 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !98, file: !213, line: 67)
!237 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !102, file: !213, line: 68)
!238 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !110, file: !213, line: 69)
!239 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !114, file: !213, line: 71)
!240 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !120, file: !213, line: 72)
!241 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !124, file: !213, line: 73)
!242 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !128, file: !213, line: 74)
!243 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !133, file: !213, line: 75)
!244 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !139, file: !213, line: 76)
!245 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !143, file: !213, line: 77)
!246 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !147, file: !213, line: 78)
!247 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !149, file: !213, line: 80)
!248 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !157, file: !213, line: 81)
!249 = !{i32 7, !"Dwarf Version", i32 4}
!250 = !{i32 2, !"Debug Info Version", i32 3}
!251 = !{i32 1, !"wchar_size", i32 4}
!252 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!253 = distinct !DISubprogram(name: "drawn_endgames", linkageName: "_Z14drawn_endgamesP7state_tiii", scope: !1, file: !1, line: 17, type: !254, scopeLine: 17, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!254 = !DISubroutineType(types: !255)
!255 = !{!10, !256, !10, !327, !327}
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!257 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "state_t", file: !258, line: 11, size: 99200, flags: DIFlagTypePassByValue, elements: !259, identifier: "_ZTS7state_t")
!258 = !DIFile(filename: "./state.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/531.deepsjeng_r/build/build_base_ld-loop-ext-m64.0000")
!259 = !{!260, !261, !265, !268, !269, !270, !274, !275, !276, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !297, !300, !301, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "threadid", scope: !257, file: !258, line: 13, baseType: !10, size: 32)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "sboard", scope: !257, file: !258, line: 15, baseType: !262, size: 2048, offset: 32)
!262 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 2048, elements: !263)
!263 = !{!264}
!264 = !DISubrange(count: 64)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "All", scope: !257, file: !258, line: 16, baseType: !266, size: 64, offset: 2112)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITBOARD", file: !267, line: 33, baseType: !190)
!267 = !DIFile(filename: "./sjeng.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/531.deepsjeng_r/build/build_base_ld-loop-ext-m64.0000")
!268 = !DIDerivedType(tag: DW_TAG_member, name: "BlackPieces", scope: !257, file: !258, line: 17, baseType: !266, size: 64, offset: 2176)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "WhitePieces", scope: !257, file: !258, line: 17, baseType: !266, size: 64, offset: 2240)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "BitBoard", scope: !257, file: !258, line: 18, baseType: !271, size: 832, offset: 2304)
!271 = !DICompositeType(tag: DW_TAG_array_type, baseType: !266, size: 832, elements: !272)
!272 = !{!273}
!273 = !DISubrange(count: 13)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "Material", scope: !257, file: !258, line: 20, baseType: !10, size: 32, offset: 3136)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "psq_score", scope: !257, file: !258, line: 21, baseType: !10, size: 32, offset: 3168)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "npieces", scope: !257, file: !258, line: 22, baseType: !277, size: 416, offset: 3200)
!277 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 416, elements: !272)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "castleflag", scope: !257, file: !258, line: 23, baseType: !10, size: 32, offset: 3616)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "ep_square", scope: !257, file: !258, line: 25, baseType: !10, size: 32, offset: 3648)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "white_to_move", scope: !257, file: !258, line: 25, baseType: !10, size: 32, offset: 3680)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "wking_loc", scope: !257, file: !258, line: 25, baseType: !10, size: 32, offset: 3712)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "bking_loc", scope: !257, file: !258, line: 25, baseType: !10, size: 32, offset: 3744)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "ply", scope: !257, file: !258, line: 26, baseType: !10, size: 32, offset: 3776)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "fifty", scope: !257, file: !258, line: 26, baseType: !10, size: 32, offset: 3808)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !257, file: !258, line: 28, baseType: !266, size: 64, offset: 3840)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "pawnhash", scope: !257, file: !258, line: 29, baseType: !266, size: 64, offset: 3904)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "path_x", scope: !257, file: !258, line: 31, baseType: !288, size: 16384, offset: 3968)
!288 = !DICompositeType(tag: DW_TAG_array_type, baseType: !289, size: 16384, elements: !263)
!289 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "move_x", file: !267, line: 130, size: 256, flags: DIFlagTypePassByValue, elements: !290, identifier: "_ZTS6move_x")
!290 = !{!291, !292, !293, !294, !295, !296}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "epsq", scope: !289, file: !267, line: 131, baseType: !10, size: 32)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "fifty", scope: !289, file: !267, line: 132, baseType: !10, size: 32, offset: 32)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "castleflag", scope: !289, file: !267, line: 133, baseType: !10, size: 32, offset: 64)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "psq_score", scope: !289, file: !267, line: 134, baseType: !10, size: 32, offset: 96)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !289, file: !267, line: 135, baseType: !266, size: 64, offset: 128)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "pawnhash", scope: !289, file: !267, line: 136, baseType: !266, size: 64, offset: 192)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !257, file: !258, line: 32, baseType: !298, size: 2048, offset: 20352)
!298 = !DICompositeType(tag: DW_TAG_array_type, baseType: !299, size: 2048, elements: !263)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "move_s", file: !267, line: 121, baseType: !10)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "plyeval", scope: !257, file: !258, line: 33, baseType: !262, size: 2048, offset: 22400)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "killerstack", scope: !257, file: !258, line: 41, baseType: !302, size: 8192, offset: 24448)
!302 = !DICompositeType(tag: DW_TAG_array_type, baseType: !303, size: 8192, elements: !263)
!303 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !257, file: !258, line: 36, size: 128, flags: DIFlagTypePassByValue, elements: !304, identifier: "_ZTSN7state_tUt_E")
!304 = !{!305, !306, !307, !308}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "killer1", scope: !303, file: !258, line: 37, baseType: !299, size: 32)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "killer2", scope: !303, file: !258, line: 38, baseType: !299, size: 32, offset: 32)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "killer3", scope: !303, file: !258, line: 39, baseType: !299, size: 32, offset: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "killer4", scope: !303, file: !258, line: 40, baseType: !299, size: 32, offset: 96)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !257, file: !258, line: 43, baseType: !266, size: 64, offset: 32640)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "qnodes", scope: !257, file: !258, line: 43, baseType: !266, size: 64, offset: 32704)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "maxply", scope: !257, file: !258, line: 44, baseType: !10, size: 32, offset: 32768)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "checks", scope: !257, file: !258, line: 45, baseType: !262, size: 2048, offset: 32800)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "TTProbes", scope: !257, file: !258, line: 51, baseType: !131, size: 32, offset: 34848)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "TTHits", scope: !257, file: !258, line: 52, baseType: !131, size: 32, offset: 34880)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "TTStores", scope: !257, file: !258, line: 53, baseType: !131, size: 32, offset: 34912)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "TTColls", scope: !257, file: !258, line: 54, baseType: !131, size: 32, offset: 34944)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "wking_start", scope: !257, file: !258, line: 60, baseType: !10, size: 32, offset: 34976)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "bking_start", scope: !257, file: !258, line: 61, baseType: !10, size: 32, offset: 35008)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "wlrook_start", scope: !257, file: !258, line: 62, baseType: !10, size: 32, offset: 35040)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "wrrook_start", scope: !257, file: !258, line: 63, baseType: !10, size: 32, offset: 35072)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "blrook_start", scope: !257, file: !258, line: 64, baseType: !10, size: 32, offset: 35104)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "brrook_start", scope: !257, file: !258, line: 65, baseType: !10, size: 32, offset: 35136)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "hash_history", scope: !257, file: !258, line: 69, baseType: !324, size: 64000, offset: 35200)
!324 = !DICompositeType(tag: DW_TAG_array_type, baseType: !266, size: 64000, elements: !325)
!325 = !{!326}
!326 = !DISubrange(count: 1000)
!327 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !10)
!328 = !DILocalVariable(name: "s", arg: 1, scope: !253, file: !1, line: 17, type: !256)
!329 = !DILocation(line: 17, column: 29, scope: !253)
!330 = !DILocalVariable(name: "score", arg: 2, scope: !253, file: !1, line: 17, type: !10)
!331 = !DILocation(line: 17, column: 36, scope: !253)
!332 = !DILocalVariable(name: "wmat", arg: 3, scope: !253, file: !1, line: 17, type: !327)
!333 = !DILocation(line: 17, column: 53, scope: !253)
!334 = !DILocalVariable(name: "bmat", arg: 4, scope: !253, file: !1, line: 17, type: !327)
!335 = !DILocation(line: 17, column: 69, scope: !253)
!336 = !DILocalVariable(name: "npieces", scope: !253, file: !1, line: 18, type: !337)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!338 = !DILocation(line: 18, column: 10, scope: !253)
!339 = !DILocation(line: 18, column: 26, scope: !253)
!340 = !DILocation(line: 18, column: 29, scope: !253)
!341 = !DILocalVariable(name: "BitBoard", scope: !253, file: !1, line: 19, type: !342)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!343 = !DILocation(line: 19, column: 15, scope: !253)
!344 = !DILocation(line: 19, column: 26, scope: !253)
!345 = !DILocation(line: 19, column: 29, scope: !253)
!346 = !DILocalVariable(name: "wking_loc", scope: !253, file: !1, line: 20, type: !10)
!347 = !DILocation(line: 20, column: 9, scope: !253)
!348 = !DILocation(line: 20, column: 26, scope: !253)
!349 = !DILocation(line: 20, column: 29, scope: !253)
!350 = !DILocalVariable(name: "bking_loc", scope: !253, file: !1, line: 21, type: !10)
!351 = !DILocation(line: 21, column: 9, scope: !253)
!352 = !DILocation(line: 21, column: 26, scope: !253)
!353 = !DILocation(line: 21, column: 29, scope: !253)
!354 = !DILocalVariable(name: "white_to_move", scope: !253, file: !1, line: 22, type: !10)
!355 = !DILocation(line: 22, column: 9, scope: !253)
!356 = !DILocation(line: 22, column: 26, scope: !253)
!357 = !DILocation(line: 22, column: 29, scope: !253)
!358 = !DILocation(line: 25, column: 10, scope: !359)
!359 = distinct !DILexicalBlock(scope: !253, file: !1, line: 25, column: 9)
!360 = !DILocation(line: 25, column: 25, scope: !359)
!361 = !DILocation(line: 25, column: 29, scope: !359)
!362 = !DILocation(line: 25, column: 9, scope: !253)
!363 = !DILocation(line: 27, column: 13, scope: !364)
!364 = distinct !DILexicalBlock(scope: !365, file: !1, line: 27, column: 13)
!365 = distinct !DILexicalBlock(scope: !359, file: !1, line: 25, column: 45)
!366 = !DILocation(line: 27, column: 20, scope: !364)
!367 = !DILocation(line: 27, column: 18, scope: !364)
!368 = !DILocation(line: 27, column: 13, scope: !365)
!369 = !DILocation(line: 28, column: 46, scope: !370)
!370 = distinct !DILexicalBlock(scope: !364, file: !1, line: 27, column: 26)
!371 = !DILocation(line: 28, column: 57, scope: !370)
!372 = !DILocation(line: 28, column: 33, scope: !370)
!373 = !DILocation(line: 28, column: 31, scope: !370)
!374 = !DILocation(line: 28, column: 26, scope: !370)
!375 = !DILocation(line: 28, column: 19, scope: !370)
!376 = !DILocation(line: 29, column: 9, scope: !370)
!377 = !DILocation(line: 29, column: 20, scope: !378)
!378 = distinct !DILexicalBlock(scope: !364, file: !1, line: 29, column: 20)
!379 = !DILocation(line: 29, column: 27, scope: !378)
!380 = !DILocation(line: 29, column: 25, scope: !378)
!381 = !DILocation(line: 29, column: 20, scope: !364)
!382 = !DILocation(line: 30, column: 46, scope: !383)
!383 = distinct !DILexicalBlock(scope: !378, file: !1, line: 29, column: 33)
!384 = !DILocation(line: 30, column: 57, scope: !383)
!385 = !DILocation(line: 30, column: 33, scope: !383)
!386 = !DILocation(line: 30, column: 31, scope: !383)
