; ModuleID = 'ttable.cpp'
source_filename = "ttable.cpp"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.ttentry_t = type { [4 x %struct.ttbucket_t] }
%struct.ttbucket_t = type { i32, i16, i16, i8, i8 }
%struct.state_t = type { i32, [64 x i32], i64, i64, i64, [13 x i64], i32, i32, [13 x i32], i32, i32, i32, i32, i32, i32, i32, i64, i64, [64 x %struct.move_x], [64 x i32], [64 x i32], [64 x %struct.anon], i64, i64, i32, [64 x i32], i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [1000 x i64] }
%struct.move_x = type { i32, i32, i32, i32, i64, i64 }
%struct.anon = type { i32, i32, i32, i32 }

@zobrist = dso_local global [14 x [64 x i64]] zeroinitializer, align 16, !dbg !0
@TTable = dso_local global %struct.ttentry_t* null, align 8, !dbg !37
@TTAge = dso_local global i32 0, align 4, !dbg !39
@TTSize = external dso_local global i32, align 4
@.str = private unnamed_addr constant [38 x i8] c"Out of memory allocating hashtables.\0A\00", align 1
@.str.1 = private unnamed_addr constant [50 x i8] c"Allocated %d hash entries, totalling %llu bytes.\0A\00", align 1

; Function Attrs: noinline nounwind uwtable
define dso_local void @_Z8clear_ttv() #0 !dbg !289 {
entry:
  %0 = load %struct.ttentry_t*, %struct.ttentry_t** @TTable, align 8, !dbg !290
  %1 = bitcast %struct.ttentry_t* %0 to i8*, !dbg !291
  %2 = load i32, i32* @TTSize, align 4, !dbg !292
  %conv = zext i32 %2 to i64, !dbg !292

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "zobrist", scope: !2, file: !3, line: 17, type: !281, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus_14, file: !3, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !36, imports: !41, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "ttable.cpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/531.deepsjeng_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !{}
!5 = !{!6, !9, !10, !11, !33}
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITBOARD", file: !7, line: 33, baseType: !8)
!7 = !DIFile(filename: "./sjeng.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/531.deepsjeng_r/build/build_base_ld-loop-ext-m64.0000")
!8 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!9 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!10 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!12 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ttentry_t", file: !13, line: 22, size: 384, flags: DIFlagTypePassByValue, elements: !14, identifier: "_ZTS9ttentry_t")
!13 = !DIFile(filename: "./ttable.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/531.deepsjeng_r/build/build_base_ld-loop-ext-m64.0000")
!14 = !{!15}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "buckets", scope: !12, file: !13, line: 23, baseType: !16, size: 384)
!16 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 384, elements: !31)
!17 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ttbucket_t", file: !13, line: 10, size: 96, flags: DIFlagTypePassByValue, elements: !18, identifier: "_ZTS10ttbucket_t")
!18 = !{!19, !20, !22, !24, !26, !27, !28, !29, !30}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !17, file: !13, line: 11, baseType: !9, size: 32)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !17, file: !13, line: 12, baseType: !21, size: 16, offset: 32)
!21 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "bestmove", scope: !17, file: !13, line: 13, baseType: !23, size: 16, offset: 48)
!23 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !17, file: !13, line: 14, baseType: !25, size: 8, offset: 64)
!25 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "threat", scope: !17, file: !13, line: 15, baseType: !25, size: 1, offset: 72, flags: DIFlagBitField, extraData: i64 72)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !17, file: !13, line: 16, baseType: !25, size: 2, offset: 73, flags: DIFlagBitField, extraData: i64 72)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "singular", scope: !17, file: !13, line: 17, baseType: !25, size: 1, offset: 75, flags: DIFlagBitField, extraData: i64 72)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "nosingular", scope: !17, file: !13, line: 18, baseType: !25, size: 1, offset: 76, flags: DIFlagBitField, extraData: i64 72)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "age", scope: !17, file: !13, line: 19, baseType: !25, size: 2, offset: 77, flags: DIFlagBitField, extraData: i64 72)
!31 = !{!32}
!32 = !DISubrange(count: 4)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !34, line: 46, baseType: !35)
!34 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!35 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!36 = !{!0, !37, !39}
!37 = !DIGlobalVariableExpression(var: !38, expr: !DIExpression())
!38 = distinct !DIGlobalVariable(name: "TTable", scope: !2, file: !3, line: 19, type: !11, isLocal: false, isDefinition: true)
!39 = !DIGlobalVariableExpression(var: !40, expr: !DIExpression())
!40 = distinct !DIGlobalVariable(name: "TTAge", scope: !2, file: !3, line: 20, type: !9, isLocal: false, isDefinition: true)
!41 = !{!42, !49, !53, !60, !64, !69, !71, !79, !83, !87, !98, !102, !106, !110, !114, !119, !123, !127, !131, !135, !143, !147, !151, !153, !157, !161, !165, !171, !175, !179, !181, !189, !193, !201, !203, !207, !211, !215, !219, !223, !228, !233, !234, !235, !236, !238, !239, !240, !241, !242, !243, !244, !246, !247, !248, !249, !250, !251, !252, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280}
!42 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !43, entity: !44, file: !48, line: 52)
!43 = !DINamespace(name: "std", scope: null)
!44 = !DISubprogram(name: "abs", scope: !45, file: !45, line: 840, type: !46, flags: DIFlagPrototyped, spFlags: 0)
!45 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!46 = !DISubroutineType(types: !47)
!47 = !{!10, !10}
!48 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/bits/std_abs.h", directory: "")
!49 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !43, entity: !50, file: !52, line: 127)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "div_t", file: !45, line: 62, baseType: !51)
!51 = !DICompositeType(tag: DW_TAG_structure_type, file: !45, line: 58, flags: DIFlagFwdDecl, identifier: "_ZTS5div_t")
!52 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/cstdlib", directory: "")
!53 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !43, entity: !54, file: !52, line: 128)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "ldiv_t", file: !45, line: 70, baseType: !55)
!55 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !45, line: 66, size: 128, flags: DIFlagTypePassByValue, elements: !56, identifier: "_ZTS6ldiv_t")
!56 = !{!57, !59}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !55, file: !45, line: 68, baseType: !58, size: 64)
!58 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !55, file: !45, line: 69, baseType: !58, size: 64, offset: 64)
!60 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !43, entity: !61, file: !52, line: 130)
!61 = !DISubprogram(name: "abort", scope: !45, file: !45, line: 591, type: !62, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!62 = !DISubroutineType(types: !63)
!63 = !{null}
!64 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !43, entity: !65, file: !52, line: 134)
!65 = !DISubprogram(name: "atexit", scope: !45, file: !45, line: 595, type: !66, flags: DIFlagPrototyped, spFlags: 0)
!66 = !DISubroutineType(types: !67)
!67 = !{!10, !68}
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!69 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !43, entity: !70, file: !52, line: 137)
!70 = !DISubprogram(name: "at_quick_exit", scope: !45, file: !45, line: 600, type: !66, flags: DIFlagPrototyped, spFlags: 0)
!71 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !43, entity: !72, file: !52, line: 140)
!72 = !DISubprogram(name: "atof", scope: !45, file: !45, line: 101, type: !73, flags: DIFlagPrototyped, spFlags: 0)
!73 = !DISubroutineType(types: !74)
!74 = !{!75, !76}
!75 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !78)
!78 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!79 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !43, entity: !80, file: !52, line: 141)
!80 = !DISubprogram(name: "atoi", scope: !45, file: !45, line: 104, type: !81, flags: DIFlagPrototyped, spFlags: 0)
!81 = !DISubroutineType(types: !82)
!82 = !{!10, !76}
!83 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !43, entity: !84, file: !52, line: 142)
!84 = !DISubprogram(name: "atol", scope: !45, file: !45, line: 107, type: !85, flags: DIFlagPrototyped, spFlags: 0)
!85 = !DISubroutineType(types: !86)
!86 = !{!58, !76}
!87 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !43, entity: !88, file: !52, line: 143)
!88 = !DISubprogram(name: "bsearch", scope: !45, file: !45, line: 820, type: !89, flags: DIFlagPrototyped, spFlags: 0)
!89 = !DISubroutineType(types: !90)
!90 = !{!91, !92, !92, !33, !33, !94}
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!93 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "__compar_fn_t", file: !45, line: 808, baseType: !95)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = !DISubroutineType(types: !97)
!97 = !{!10, !92, !92}
!98 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !43, entity: !99, file: !52, line: 144)
!99 = !DISubprogram(name: "calloc", scope: !45, file: !45, line: 542, type: !100, flags: DIFlagPrototyped, spFlags: 0)
!100 = !DISubroutineType(types: !101)
!101 = !{!91, !33, !33}
!102 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !43, entity: !103, file: !52, line: 145)
!103 = !DISubprogram(name: "div", scope: !45, file: !45, line: 852, type: !104, flags: DIFlagPrototyped, spFlags: 0)
!104 = !DISubroutineType(types: !105)
!105 = !{!50, !10, !10}
!106 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !43, entity: !107, file: !52, line: 146)
!107 = !DISubprogram(name: "exit", scope: !45, file: !45, line: 617, type: !108, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!108 = !DISubroutineType(types: !109)
!109 = !{null, !10}
!110 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !43, entity: !111, file: !52, line: 147)
!111 = !DISubprogram(name: "free", scope: !45, file: !45, line: 565, type: !112, flags: DIFlagPrototyped, spFlags: 0)
!112 = !DISubroutineType(types: !113)
!113 = !{null, !91}
!114 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !43, entity: !115, file: !52, line: 148)
!115 = !DISubprogram(name: "getenv", scope: !45, file: !45, line: 634, type: !116, flags: DIFlagPrototyped, spFlags: 0)
!116 = !DISubroutineType(types: !117)
!117 = !{!118, !76}
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!119 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !43, entity: !120, file: !52, line: 149)
!120 = !DISubprogram(name: "labs", scope: !45, file: !45, line: 841, type: !121, flags: DIFlagPrototyped, spFlags: 0)
!121 = !DISubroutineType(types: !122)
!122 = !{!58, !58}
!123 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !43, entity: !124, file: !52, line: 150)
!124 = !DISubprogram(name: "ldiv", scope: !45, file: !45, line: 854, type: !125, flags: DIFlagPrototyped, spFlags: 0)
!125 = !DISubroutineType(types: !126)
!126 = !{!54, !58, !58}
!127 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !43, entity: !128, file: !52, line: 151)
!128 = !DISubprogram(name: "malloc", scope: !45, file: !45, line: 539, type: !129, flags: DIFlagPrototyped, spFlags: 0)
!129 = !DISubroutineType(types: !130)
!130 = !{!91, !33}
!131 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !43, entity: !132, file: !52, line: 153)
!132 = !DISubprogram(name: "mblen", scope: !45, file: !45, line: 922, type: !133, flags: DIFlagPrototyped, spFlags: 0)
!133 = !DISubroutineType(types: !134)
!134 = !{!10, !76, !33}
!135 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !43, entity: !136, file: !52, line: 154)
!136 = !DISubprogram(name: "mbstowcs", scope: !45, file: !45, line: 933, type: !137, flags: DIFlagPrototyped, spFlags: 0)
!137 = !DISubroutineType(types: !138)
!138 = !{!33, !139, !142, !33}
!139 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !140)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = !DIBasicType(name: "wchar_t", size: 32, encoding: DW_ATE_signed)
!142 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !76)
!143 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !43, entity: !144, file: !52, line: 155)
!144 = !DISubprogram(name: "mbtowc", scope: !45, file: !45, line: 925, type: !145, flags: DIFlagPrototyped, spFlags: 0)
!145 = !DISubroutineType(types: !146)
!146 = !{!10, !139, !142, !33}
!147 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !43, entity: !148, file: !52, line: 157)
!148 = !DISubprogram(name: "qsort", scope: !45, file: !45, line: 830, type: !149, flags: DIFlagPrototyped, spFlags: 0)
!149 = !DISubroutineType(types: !150)
!150 = !{null, !91, !33, !33, !94}
!151 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !43, entity: !152, file: !52, line: 160)
!152 = !DISubprogram(name: "quick_exit", scope: !45, file: !45, line: 623, type: !108, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!153 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !43, entity: !154, file: !52, line: 163)
!154 = !DISubprogram(name: "rand", scope: !45, file: !45, line: 453, type: !155, flags: DIFlagPrototyped, spFlags: 0)
!155 = !DISubroutineType(types: !156)
!156 = !{!10}
!157 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !43, entity: !158, file: !52, line: 164)
!158 = !DISubprogram(name: "realloc", scope: !45, file: !45, line: 550, type: !159, flags: DIFlagPrototyped, spFlags: 0)
!159 = !DISubroutineType(types: !160)
!160 = !{!91, !91, !33}
!161 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !43, entity: !162, file: !52, line: 165)
!162 = !DISubprogram(name: "srand", scope: !45, file: !45, line: 455, type: !163, flags: DIFlagPrototyped, spFlags: 0)
!163 = !DISubroutineType(types: !164)
!164 = !{null, !9}
!165 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !43, entity: !166, file: !52, line: 166)
!166 = !DISubprogram(name: "strtod", scope: !45, file: !45, line: 117, type: !167, flags: DIFlagPrototyped, spFlags: 0)
!167 = !DISubroutineType(types: !168)
!168 = !{!75, !142, !169}
!169 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !170)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!171 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !43, entity: !172, file: !52, line: 167)
!172 = !DISubprogram(name: "strtol", scope: !45, file: !45, line: 176, type: !173, flags: DIFlagPrototyped, spFlags: 0)
!173 = !DISubroutineType(types: !174)
!174 = !{!58, !142, !169, !10}
!175 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !43, entity: !176, file: !52, line: 168)
!176 = !DISubprogram(name: "strtoul", scope: !45, file: !45, line: 180, type: !177, flags: DIFlagPrototyped, spFlags: 0)
!177 = !DISubroutineType(types: !178)
!178 = !{!35, !142, !169, !10}
!179 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !43, entity: !180, file: !52, line: 169)
!180 = !DISubprogram(name: "system", scope: !45, file: !45, line: 784, type: !81, flags: DIFlagPrototyped, spFlags: 0)
!181 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !43, entity: !182, file: !52, line: 171)
!182 = !DISubprogram(name: "wcstombs", scope: !45, file: !45, line: 936, type: !183, flags: DIFlagPrototyped, spFlags: 0)
!183 = !DISubroutineType(types: !184)
!184 = !{!33, !185, !186, !33}
!185 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !118)
!186 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !187)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!188 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !141)
!189 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !43, entity: !190, file: !52, line: 172)
!190 = !DISubprogram(name: "wctomb", scope: !45, file: !45, line: 929, type: !191, flags: DIFlagPrototyped, spFlags: 0)
!191 = !DISubroutineType(types: !192)
!192 = !{!10, !118, !141}
!193 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !194, entity: !195, file: !52, line: 200)
!194 = !DINamespace(name: "__gnu_cxx", scope: null)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "lldiv_t", file: !45, line: 80, baseType: !196)
!196 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !45, line: 76, size: 128, flags: DIFlagTypePassByValue, elements: !197, identifier: "_ZTS7lldiv_t")
!197 = !{!198, !200}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !196, file: !45, line: 78, baseType: !199, size: 64)
!199 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !196, file: !45, line: 79, baseType: !199, size: 64, offset: 64)
!201 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !194, entity: !202, file: !52, line: 206)
!202 = !DISubprogram(name: "_Exit", scope: !45, file: !45, line: 629, type: !108, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!203 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !194, entity: !204, file: !52, line: 210)
!204 = !DISubprogram(name: "llabs", scope: !45, file: !45, line: 844, type: !205, flags: DIFlagPrototyped, spFlags: 0)
!205 = !DISubroutineType(types: !206)
!206 = !{!199, !199}
!207 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !194, entity: !208, file: !52, line: 216)
!208 = !DISubprogram(name: "lldiv", scope: !45, file: !45, line: 858, type: !209, flags: DIFlagPrototyped, spFlags: 0)
!209 = !DISubroutineType(types: !210)
!210 = !{!195, !199, !199}
!211 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !194, entity: !212, file: !52, line: 227)
!212 = !DISubprogram(name: "atoll", scope: !45, file: !45, line: 112, type: !213, flags: DIFlagPrototyped, spFlags: 0)
!213 = !DISubroutineType(types: !214)
!214 = !{!199, !76}
!215 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !194, entity: !216, file: !52, line: 228)
!216 = !DISubprogram(name: "strtoll", scope: !45, file: !45, line: 200, type: !217, flags: DIFlagPrototyped, spFlags: 0)
!217 = !DISubroutineType(types: !218)
!218 = !{!199, !142, !169, !10}
!219 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !194, entity: !220, file: !52, line: 229)
!220 = !DISubprogram(name: "strtoull", scope: !45, file: !45, line: 205, type: !221, flags: DIFlagPrototyped, spFlags: 0)
!221 = !DISubroutineType(types: !222)
!222 = !{!8, !142, !169, !10}
!223 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !194, entity: !224, file: !52, line: 231)
!224 = !DISubprogram(name: "strtof", scope: !45, file: !45, line: 123, type: !225, flags: DIFlagPrototyped, spFlags: 0)
!225 = !DISubroutineType(types: !226)
!226 = !{!227, !142, !169}
!227 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!228 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !194, entity: !229, file: !52, line: 232)
!229 = !DISubprogram(name: "strtold", scope: !45, file: !45, line: 126, type: !230, flags: DIFlagPrototyped, spFlags: 0)
!230 = !DISubroutineType(types: !231)
!231 = !{!232, !142, !169}
!232 = !DIBasicType(name: "long double", size: 128, encoding: DW_ATE_float)
!233 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !43, entity: !195, file: !52, line: 240)
!234 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !43, entity: !202, file: !52, line: 242)
!235 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !43, entity: !204, file: !52, line: 244)
!236 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !43, entity: !237, file: !52, line: 245)
!237 = !DISubprogram(name: "div", linkageName: "_ZN9__gnu_cxx3divExx", scope: !194, file: !52, line: 213, type: !209, flags: DIFlagPrototyped, spFlags: 0)
!238 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !43, entity: !208, file: !52, line: 246)
!239 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !43, entity: !212, file: !52, line: 248)
!240 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !43, entity: !224, file: !52, line: 249)
!241 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !43, entity: !216, file: !52, line: 250)
!242 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !43, entity: !220, file: !52, line: 251)
!243 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !43, entity: !229, file: !52, line: 252)
!244 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !61, file: !245, line: 38)
!245 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/stdlib.h", directory: "")
!246 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !65, file: !245, line: 39)
!247 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !107, file: !245, line: 40)
!248 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !70, file: !245, line: 43)
!249 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !152, file: !245, line: 46)
!250 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !50, file: !245, line: 51)
!251 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !54, file: !245, line: 52)
!252 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !253, file: !245, line: 54)
!253 = !DISubprogram(name: "abs", linkageName: "_ZSt3absg", scope: !43, file: !48, line: 103, type: !254, flags: DIFlagPrototyped, spFlags: 0)
!254 = !DISubroutineType(types: !255)
!255 = !{!256, !256}
!256 = !DIBasicType(name: "__float128", size: 128, encoding: DW_ATE_float)
!257 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !72, file: !245, line: 55)
!258 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !80, file: !245, line: 56)
!259 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !84, file: !245, line: 57)
!260 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !88, file: !245, line: 58)
!261 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !99, file: !245, line: 59)
!262 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !237, file: !245, line: 60)
!263 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !111, file: !245, line: 61)
!264 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !115, file: !245, line: 62)
!265 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !120, file: !245, line: 63)
!266 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !124, file: !245, line: 64)
!267 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !128, file: !245, line: 65)
!268 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !132, file: !245, line: 67)
!269 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !136, file: !245, line: 68)
!270 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !144, file: !245, line: 69)
!271 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !148, file: !245, line: 71)
!272 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !154, file: !245, line: 72)
!273 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !158, file: !245, line: 73)
!274 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !162, file: !245, line: 74)
!275 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !166, file: !245, line: 75)
!276 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !172, file: !245, line: 76)
!277 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !176, file: !245, line: 77)
!278 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !180, file: !245, line: 78)
!279 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !182, file: !245, line: 80)
!280 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !190, file: !245, line: 81)
!281 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 57344, elements: !282)
!282 = !{!283, !284}
!283 = !DISubrange(count: 14)
!284 = !DISubrange(count: 64)
!285 = !{i32 7, !"Dwarf Version", i32 4}
!286 = !{i32 2, !"Debug Info Version", i32 3}
!287 = !{i32 1, !"wchar_size", i32 4}
!288 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!289 = distinct !DISubprogram(name: "clear_tt", linkageName: "_Z8clear_ttv", scope: !3, file: !3, line: 22, type: !62, scopeLine: 22, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!290 = !DILocation(line: 23, column: 12, scope: !289)
!291 = !DILocation(line: 23, column: 5, scope: !289)
!292 = !DILocation(line: 23, column: 43, scope: !289)
!293 = !DILocation(line: 23, column: 41, scope: !289)
!294 = !DILocation(line: 24, column: 1, scope: !289)
!295 = distinct !DISubprogram(name: "clear_dp_tt", linkageName: "_Z11clear_dp_ttv", scope: !3, file: !3, line: 26, type: !62, scopeLine: 26, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!296 = !DILocation(line: 27, column: 10, scope: !295)
!297 = !DILocation(line: 29, column: 9, scope: !298)
!298 = distinct !DILexicalBlock(scope: !295, file: !3, line: 29, column: 9)
!299 = !DILocation(line: 29, column: 15, scope: !298)
!300 = !DILocation(line: 29, column: 9, scope: !295)
!301 = !DILocation(line: 30, column: 15, scope: !302)
!302 = distinct !DILexicalBlock(scope: !298, file: !3, line: 29, column: 20)
!303 = !DILocation(line: 31, column: 5, scope: !302)
!304 = !DILocation(line: 33, column: 5, scope: !295)
!305 = distinct !DISubprogram(name: "initialize_zobrist", linkageName: "_Z18initialize_zobristP7state_t", scope: !3, file: !3, line: 36, type: !306, scopeLine: 36, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!306 = !DISubroutineType(types: !307)
!307 = !{null, !308}
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64)
!309 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "state_t", file: !310, line: 11, size: 99200, flags: DIFlagTypePassByValue, elements: !311, identifier: "_ZTS7state_t")
!310 = !DIFile(filename: "./state.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/531.deepsjeng_r/build/build_base_ld-loop-ext-m64.0000")
!311 = !{!312, !313, !316, !317, !318, !319, !323, !324, !325, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !346, !349, !350, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "threadid", scope: !309, file: !310, line: 13, baseType: !10, size: 32)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "sboard", scope: !309, file: !310, line: 15, baseType: !314, size: 2048, offset: 32)
!314 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 2048, elements: !315)
!315 = !{!284}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "All", scope: !309, file: !310, line: 16, baseType: !6, size: 64, offset: 2112)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "BlackPieces", scope: !309, file: !310, line: 17, baseType: !6, size: 64, offset: 2176)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "WhitePieces", scope: !309, file: !310, line: 17, baseType: !6, size: 64, offset: 2240)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "BitBoard", scope: !309, file: !310, line: 18, baseType: !320, size: 832, offset: 2304)
!320 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 832, elements: !321)
!321 = !{!322}
!322 = !DISubrange(count: 13)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "Material", scope: !309, file: !310, line: 20, baseType: !10, size: 32, offset: 3136)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "psq_score", scope: !309, file: !310, line: 21, baseType: !10, size: 32, offset: 3168)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "npieces", scope: !309, file: !310, line: 22, baseType: !326, size: 416, offset: 3200)
!326 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 416, elements: !321)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "castleflag", scope: !309, file: !310, line: 23, baseType: !10, size: 32, offset: 3616)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "ep_square", scope: !309, file: !310, line: 25, baseType: !10, size: 32, offset: 3648)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "white_to_move", scope: !309, file: !310, line: 25, baseType: !10, size: 32, offset: 3680)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "wking_loc", scope: !309, file: !310, line: 25, baseType: !10, size: 32, offset: 3712)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "bking_loc", scope: !309, file: !310, line: 25, baseType: !10, size: 32, offset: 3744)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "ply", scope: !309, file: !310, line: 26, baseType: !10, size: 32, offset: 3776)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "fifty", scope: !309, file: !310, line: 26, baseType: !10, size: 32, offset: 3808)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !309, file: !310, line: 28, baseType: !6, size: 64, offset: 3840)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "pawnhash", scope: !309, file: !310, line: 29, baseType: !6, size: 64, offset: 3904)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "path_x", scope: !309, file: !310, line: 31, baseType: !337, size: 16384, offset: 3968)
!337 = !DICompositeType(tag: DW_TAG_array_type, baseType: !338, size: 16384, elements: !315)
!338 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "move_x", file: !7, line: 130, size: 256, flags: DIFlagTypePassByValue, elements: !339, identifier: "_ZTS6move_x")
!339 = !{!340, !341, !342, !343, !344, !345}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "epsq", scope: !338, file: !7, line: 131, baseType: !10, size: 32)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "fifty", scope: !338, file: !7, line: 132, baseType: !10, size: 32, offset: 32)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "castleflag", scope: !338, file: !7, line: 133, baseType: !10, size: 32, offset: 64)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "psq_score", scope: !338, file: !7, line: 134, baseType: !10, size: 32, offset: 96)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !338, file: !7, line: 135, baseType: !6, size: 64, offset: 128)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "pawnhash", scope: !338, file: !7, line: 136, baseType: !6, size: 64, offset: 192)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !309, file: !310, line: 32, baseType: !347, size: 2048, offset: 20352)
!347 = !DICompositeType(tag: DW_TAG_array_type, baseType: !348, size: 2048, elements: !315)
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "move_s", file: !7, line: 121, baseType: !10)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "plyeval", scope: !309, file: !310, line: 33, baseType: !314, size: 2048, offset: 22400)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "killerstack", scope: !309, file: !310, line: 41, baseType: !351, size: 8192, offset: 24448)
!351 = !DICompositeType(tag: DW_TAG_array_type, baseType: !352, size: 8192, elements: !315)
!352 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !309, file: !310, line: 36, size: 128, flags: DIFlagTypePassByValue, elements: !353, identifier: "_ZTSN7state_tUt_E")
!353 = !{!354, !355, !356, !357}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "killer1", scope: !352, file: !310, line: 37, baseType: !348, size: 32)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "killer2", scope: !352, file: !310, line: 38, baseType: !348, size: 32, offset: 32)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "killer3", scope: !352, file: !310, line: 39, baseType: !348, size: 32, offset: 64)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "killer4", scope: !352, file: !310, line: 40, baseType: !348, size: 32, offset: 96)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !309, file: !310, line: 43, baseType: !6, size: 64, offset: 32640)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "qnodes", scope: !309, file: !310, line: 43, baseType: !6, size: 64, offset: 32704)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "maxply", scope: !309, file: !310, line: 44, baseType: !10, size: 32, offset: 32768)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "checks", scope: !309, file: !310, line: 45, baseType: !314, size: 2048, offset: 32800)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "TTProbes", scope: !309, file: !310, line: 51, baseType: !9, size: 32, offset: 34848)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "TTHits", scope: !309, file: !310, line: 52, baseType: !9, size: 32, offset: 34880)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "TTStores", scope: !309, file: !310, line: 53, baseType: !9, size: 32, offset: 34912)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "TTColls", scope: !309, file: !310, line: 54, baseType: !9, size: 32, offset: 34944)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "wking_start", scope: !309, file: !310, line: 60, baseType: !10, size: 32, offset: 34976)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "bking_start", scope: !309, file: !310, line: 61, baseType: !10, size: 32, offset: 35008)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "wlrook_start", scope: !309, file: !310, line: 62, baseType: !10, size: 32, offset: 35040)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "wrrook_start", scope: !309, file: !310, line: 63, baseType: !10, size: 32, offset: 35072)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "blrook_start", scope: !309, file: !310, line: 64, baseType: !10, size: 32, offset: 35104)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "brrook_start", scope: !309, file: !310, line: 65, baseType: !10, size: 32, offset: 35136)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "hash_history", scope: !309, file: !310, line: 69, baseType: !373, size: 64000, offset: 35200)
!373 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 64000, elements: !374)
!374 = !{!375}
!375 = !DISubrange(count: 1000)
!376 = !DILocalVariable(name: "s", arg: 1, scope: !305, file: !3, line: 36, type: !308)
!377 = !DILocation(line: 36, column: 34, scope: !305)
!378 = !DILocalVariable(name: "p", scope: !305, file: !3, line: 37, type: !10)
!379 = !DILocation(line: 37, column: 9, scope: !305)
!380 = !DILocalVariable(name: "q", scope: !305, file: !3, line: 37, type: !10)
!381 = !DILocation(line: 37, column: 12, scope: !305)
!382 = !DILocalVariable(name: "temp", scope: !305, file: !3, line: 40, type: !6)
!383 = !DILocation(line: 40, column: 14, scope: !305)
!384 = !DILocation(line: 42, column: 11, scope: !305)
!385 = !DILocation(line: 44, column: 5, scope: !305)
!386 = !DILocation(line: 46, column: 12, scope: !387)
!387 = distinct !DILexicalBlock(scope: !305, file: !3, line: 46, column: 5)
!388 = !DILocation(line: 46, column: 10, scope: !387)
!389 = !DILocation(line: 46, column: 17, scope: !390)
!390 = distinct !DILexicalBlock(scope: !387, file: !3, line: 46, column: 5)
!391 = !DILocation(line: 46, column: 19, scope: !390)
!392 = !DILocation(line: 46, column: 5, scope: !387)
!393 = !DILocation(line: 47, column: 16, scope: !394)
!394 = distinct !DILexicalBlock(scope: !395, file: !3, line: 47, column: 9)
!395 = distinct !DILexicalBlock(scope: !390, file: !3, line: 46, column: 30)
!396 = !DILocation(line: 47, column: 14, scope: !394)
!397 = !DILocation(line: 47, column: 21, scope: !398)
!398 = distinct !DILexicalBlock(scope: !394, file: !3, line: 47, column: 9)
!399 = !DILocation(line: 47, column: 23, scope: !398)
!400 = !DILocation(line: 47, column: 9, scope: !394)
!401 = !DILocation(line: 49, column: 31, scope: !402)
!402 = distinct !DILexicalBlock(scope: !398, file: !3, line: 47, column: 34)
!403 = !DILocation(line: 49, column: 43, scope: !402)
!404 = !DILocation(line: 49, column: 18, scope: !402)
!405 = !DILocation(line: 50, column: 31, scope: !402)
!406 = !DILocation(line: 50, column: 18, scope: !402)
!407 = !DILocation(line: 51, column: 29, scope: !402)
!408 = !DILocation(line: 51, column: 21, scope: !402)
!409 = !DILocation(line: 51, column: 13, scope: !402)
!410 = !DILocation(line: 51, column: 24, scope: !402)
!411 = !DILocation(line: 51, column: 27, scope: !402)
!412 = !DILocation(line: 55, column: 9, scope: !402)
!413 = !DILocation(line: 47, column: 30, scope: !398)
!414 = !DILocation(line: 47, column: 9, scope: !398)
!415 = distinct !{!415, !400, !416}
!416 = !DILocation(line: 55, column: 9, scope: !394)
!417 = !DILocation(line: 56, column: 5, scope: !395)
!418 = !DILocation(line: 46, column: 26, scope: !390)
!419 = !DILocation(line: 46, column: 5, scope: !390)
!420 = distinct !{!420, !392, !421}
!421 = !DILocation(line: 56, column: 5, scope: !387)
!422 = !DILocation(line: 59, column: 5, scope: !305)
!423 = !DILocation(line: 59, column: 8, scope: !305)
!424 = !DILocation(line: 59, column: 13, scope: !305)
!425 = !DILocation(line: 60, column: 5, scope: !305)
!426 = !DILocation(line: 60, column: 8, scope: !305)
!427 = !DILocation(line: 60, column: 17, scope: !305)
!428 = !DILocation(line: 61, column: 1, scope: !305)
!429 = distinct !DISubprogram(name: "initialize_hash", linkageName: "_Z15initialize_hashP7state_t", scope: !3, file: !3, line: 63, type: !306, scopeLine: 63, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!430 = !DILocalVariable(name: "s", arg: 1, scope: !429, file: !3, line: 63, type: !308)
!431 = !DILocation(line: 63, column: 31, scope: !429)
!432 = !DILocalVariable(name: "p", scope: !429, file: !3, line: 64, type: !10)
!433 = !DILocation(line: 64, column: 9, scope: !429)
!434 = !DILocation(line: 66, column: 5, scope: !429)
!435 = !DILocation(line: 66, column: 8, scope: !429)
!436 = !DILocation(line: 66, column: 13, scope: !429)
