; ModuleID = 'generate.cpp'
source_filename = "generate.cpp"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.state_t = type { i32, [64 x i32], i64, i64, i64, [13 x i64], i32, i32, [13 x i32], i32, i32, i32, i32, i32, i32, i32, i64, i64, [64 x %struct.move_x], [64 x i32], [64 x i32], [64 x %struct.anon], i64, i64, i32, [64 x i32], i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [1000 x i64] }
%struct.move_x = type { i32, i32, i32, i32, i64, i64 }
%struct.anon = type { i32, i32, i32, i32 }

@RankMask = external dso_local global [8 x i64], align 16
@Mask = external dso_local global [64 x i64], align 16
@KnightMoves = external dso_local global [64 x i64], align 16
@KingMoves = external dso_local global [64 x i64], align 16
@FileMask = external dso_local global [8 x i64], align 16
@BishopMask = external dso_local global [64 x i64], align 16
@RookMask = external dso_local global [64 x i64], align 16
@PawnAttacksBlack = external dso_local global [64 x i64], align 16
@PawnAttacksWhite = external dso_local global [64 x i64], align 16

; Function Attrs: noinline uwtable
define dso_local i32 @_Z9gen_quietP7state_tPi(%struct.state_t* %s, i32* %moves) #0 !dbg !256 {
entry:
  %s.addr = alloca %struct.state_t*, align 8
  %moves.addr = alloca i32*, align 8
  %tsq = alloca i64, align 8
  %temp = alloca i64, align 8
  %friendlymask = alloca i64, align 8
  %to = alloca i32, align 4

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus_14, file: !1, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, imports: !8, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "generate.cpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/531.deepsjeng_r/build/build_base_ld-loop-ext-m64.0000")
!2 = !{}
!3 = !{!4, !5}
!4 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITBOARD", file: !6, line: 33, baseType: !7)
!6 = !DIFile(filename: "./sjeng.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/531.deepsjeng_r/build/build_base_ld-loop-ext-m64.0000")
!7 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!8 = !{!9, !16, !20, !27, !31, !36, !38, !46, !50, !54, !68, !72, !76, !80, !84, !89, !93, !97, !101, !105, !113, !117, !121, !123, !127, !131, !136, !142, !146, !150, !152, !160, !164, !172, !174, !178, !182, !186, !190, !194, !199, !204, !205, !206, !207, !209, !210, !211, !212, !213, !214, !215, !217, !218, !219, !220, !221, !222, !223, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251}
!9 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !10, entity: !11, file: !15, line: 52)
!10 = !DINamespace(name: "std", scope: null)
!11 = !DISubprogram(name: "abs", scope: !12, file: !12, line: 840, type: !13, flags: DIFlagPrototyped, spFlags: 0)
!12 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!13 = !DISubroutineType(types: !14)
!14 = !{!4, !4}
!15 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/bits/std_abs.h", directory: "")
!16 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !10, entity: !17, file: !19, line: 127)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "div_t", file: !12, line: 62, baseType: !18)
!18 = !DICompositeType(tag: DW_TAG_structure_type, file: !12, line: 58, flags: DIFlagFwdDecl, identifier: "_ZTS5div_t")
!19 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/cstdlib", directory: "")
!20 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !10, entity: !21, file: !19, line: 128)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "ldiv_t", file: !12, line: 70, baseType: !22)
!22 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !12, line: 66, size: 128, flags: DIFlagTypePassByValue, elements: !23, identifier: "_ZTS6ldiv_t")
!23 = !{!24, !26}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !22, file: !12, line: 68, baseType: !25, size: 64)
!25 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !22, file: !12, line: 69, baseType: !25, size: 64, offset: 64)
!27 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !10, entity: !28, file: !19, line: 130)
!28 = !DISubprogram(name: "abort", scope: !12, file: !12, line: 591, type: !29, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!29 = !DISubroutineType(types: !30)
!30 = !{null}
!31 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !10, entity: !32, file: !19, line: 134)
!32 = !DISubprogram(name: "atexit", scope: !12, file: !12, line: 595, type: !33, flags: DIFlagPrototyped, spFlags: 0)
!33 = !DISubroutineType(types: !34)
!34 = !{!4, !35}
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!36 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !10, entity: !37, file: !19, line: 137)
!37 = !DISubprogram(name: "at_quick_exit", scope: !12, file: !12, line: 600, type: !33, flags: DIFlagPrototyped, spFlags: 0)
!38 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !10, entity: !39, file: !19, line: 140)
!39 = !DISubprogram(name: "atof", scope: !12, file: !12, line: 101, type: !40, flags: DIFlagPrototyped, spFlags: 0)
!40 = !DISubroutineType(types: !41)
!41 = !{!42, !43}
!42 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !45)
!45 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!46 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !10, entity: !47, file: !19, line: 141)
!47 = !DISubprogram(name: "atoi", scope: !12, file: !12, line: 104, type: !48, flags: DIFlagPrototyped, spFlags: 0)
!48 = !DISubroutineType(types: !49)
!49 = !{!4, !43}
!50 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !10, entity: !51, file: !19, line: 142)
!51 = !DISubprogram(name: "atol", scope: !12, file: !12, line: 107, type: !52, flags: DIFlagPrototyped, spFlags: 0)
!52 = !DISubroutineType(types: !53)
!53 = !{!25, !43}
!54 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !10, entity: !55, file: !19, line: 143)
!55 = !DISubprogram(name: "bsearch", scope: !12, file: !12, line: 820, type: !56, flags: DIFlagPrototyped, spFlags: 0)
!56 = !DISubroutineType(types: !57)
!57 = !{!58, !59, !59, !61, !61, !64}
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!60 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !62, line: 46, baseType: !63)
!62 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!63 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "__compar_fn_t", file: !12, line: 808, baseType: !65)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!66 = !DISubroutineType(types: !67)
!67 = !{!4, !59, !59}
!68 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !10, entity: !69, file: !19, line: 144)
!69 = !DISubprogram(name: "calloc", scope: !12, file: !12, line: 542, type: !70, flags: DIFlagPrototyped, spFlags: 0)
!70 = !DISubroutineType(types: !71)
!71 = !{!58, !61, !61}
!72 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !10, entity: !73, file: !19, line: 145)
!73 = !DISubprogram(name: "div", scope: !12, file: !12, line: 852, type: !74, flags: DIFlagPrototyped, spFlags: 0)
!74 = !DISubroutineType(types: !75)
!75 = !{!17, !4, !4}
!76 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !10, entity: !77, file: !19, line: 146)
!77 = !DISubprogram(name: "exit", scope: !12, file: !12, line: 617, type: !78, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!78 = !DISubroutineType(types: !79)
!79 = !{null, !4}
!80 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !10, entity: !81, file: !19, line: 147)
!81 = !DISubprogram(name: "free", scope: !12, file: !12, line: 565, type: !82, flags: DIFlagPrototyped, spFlags: 0)
!82 = !DISubroutineType(types: !83)
!83 = !{null, !58}
!84 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !10, entity: !85, file: !19, line: 148)
!85 = !DISubprogram(name: "getenv", scope: !12, file: !12, line: 634, type: !86, flags: DIFlagPrototyped, spFlags: 0)
!86 = !DISubroutineType(types: !87)
!87 = !{!88, !43}
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!89 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !10, entity: !90, file: !19, line: 149)
!90 = !DISubprogram(name: "labs", scope: !12, file: !12, line: 841, type: !91, flags: DIFlagPrototyped, spFlags: 0)
!91 = !DISubroutineType(types: !92)
!92 = !{!25, !25}
!93 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !10, entity: !94, file: !19, line: 150)
!94 = !DISubprogram(name: "ldiv", scope: !12, file: !12, line: 854, type: !95, flags: DIFlagPrototyped, spFlags: 0)
!95 = !DISubroutineType(types: !96)
!96 = !{!21, !25, !25}
!97 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !10, entity: !98, file: !19, line: 151)
!98 = !DISubprogram(name: "malloc", scope: !12, file: !12, line: 539, type: !99, flags: DIFlagPrototyped, spFlags: 0)
!99 = !DISubroutineType(types: !100)
!100 = !{!58, !61}
!101 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !10, entity: !102, file: !19, line: 153)
!102 = !DISubprogram(name: "mblen", scope: !12, file: !12, line: 922, type: !103, flags: DIFlagPrototyped, spFlags: 0)
!103 = !DISubroutineType(types: !104)
!104 = !{!4, !43, !61}
!105 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !10, entity: !106, file: !19, line: 154)
!106 = !DISubprogram(name: "mbstowcs", scope: !12, file: !12, line: 933, type: !107, flags: DIFlagPrototyped, spFlags: 0)
!107 = !DISubroutineType(types: !108)
!108 = !{!61, !109, !112, !61}
!109 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !110)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DIBasicType(name: "wchar_t", size: 32, encoding: DW_ATE_signed)
!112 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !43)
!113 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !10, entity: !114, file: !19, line: 155)
!114 = !DISubprogram(name: "mbtowc", scope: !12, file: !12, line: 925, type: !115, flags: DIFlagPrototyped, spFlags: 0)
!115 = !DISubroutineType(types: !116)
!116 = !{!4, !109, !112, !61}
!117 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !10, entity: !118, file: !19, line: 157)
!118 = !DISubprogram(name: "qsort", scope: !12, file: !12, line: 830, type: !119, flags: DIFlagPrototyped, spFlags: 0)
!119 = !DISubroutineType(types: !120)
!120 = !{null, !58, !61, !61, !64}
!121 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !10, entity: !122, file: !19, line: 160)
!122 = !DISubprogram(name: "quick_exit", scope: !12, file: !12, line: 623, type: !78, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!123 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !10, entity: !124, file: !19, line: 163)
!124 = !DISubprogram(name: "rand", scope: !12, file: !12, line: 453, type: !125, flags: DIFlagPrototyped, spFlags: 0)
!125 = !DISubroutineType(types: !126)
!126 = !{!4}
!127 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !10, entity: !128, file: !19, line: 164)
!128 = !DISubprogram(name: "realloc", scope: !12, file: !12, line: 550, type: !129, flags: DIFlagPrototyped, spFlags: 0)
!129 = !DISubroutineType(types: !130)
!130 = !{!58, !58, !61}
!131 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !10, entity: !132, file: !19, line: 165)
!132 = !DISubprogram(name: "srand", scope: !12, file: !12, line: 455, type: !133, flags: DIFlagPrototyped, spFlags: 0)
!133 = !DISubroutineType(types: !134)
!134 = !{null, !135}
!135 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!136 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !10, entity: !137, file: !19, line: 166)
!137 = !DISubprogram(name: "strtod", scope: !12, file: !12, line: 117, type: !138, flags: DIFlagPrototyped, spFlags: 0)
!138 = !DISubroutineType(types: !139)
!139 = !{!42, !112, !140}
!140 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !141)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!142 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !10, entity: !143, file: !19, line: 167)
!143 = !DISubprogram(name: "strtol", scope: !12, file: !12, line: 176, type: !144, flags: DIFlagPrototyped, spFlags: 0)
!144 = !DISubroutineType(types: !145)
!145 = !{!25, !112, !140, !4}
!146 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !10, entity: !147, file: !19, line: 168)
!147 = !DISubprogram(name: "strtoul", scope: !12, file: !12, line: 180, type: !148, flags: DIFlagPrototyped, spFlags: 0)
!148 = !DISubroutineType(types: !149)
!149 = !{!63, !112, !140, !4}
!150 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !10, entity: !151, file: !19, line: 169)
!151 = !DISubprogram(name: "system", scope: !12, file: !12, line: 784, type: !48, flags: DIFlagPrototyped, spFlags: 0)
!152 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !10, entity: !153, file: !19, line: 171)
!153 = !DISubprogram(name: "wcstombs", scope: !12, file: !12, line: 936, type: !154, flags: DIFlagPrototyped, spFlags: 0)
!154 = !DISubroutineType(types: !155)
!155 = !{!61, !156, !157, !61}
!156 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !88)
!157 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !158)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !111)
!160 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !10, entity: !161, file: !19, line: 172)
!161 = !DISubprogram(name: "wctomb", scope: !12, file: !12, line: 929, type: !162, flags: DIFlagPrototyped, spFlags: 0)
!162 = !DISubroutineType(types: !163)
!163 = !{!4, !88, !111}
!164 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !165, entity: !166, file: !19, line: 200)
!165 = !DINamespace(name: "__gnu_cxx", scope: null)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "lldiv_t", file: !12, line: 80, baseType: !167)
!167 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !12, line: 76, size: 128, flags: DIFlagTypePassByValue, elements: !168, identifier: "_ZTS7lldiv_t")
!168 = !{!169, !171}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !167, file: !12, line: 78, baseType: !170, size: 64)
!170 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !167, file: !12, line: 79, baseType: !170, size: 64, offset: 64)
!172 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !165, entity: !173, file: !19, line: 206)
!173 = !DISubprogram(name: "_Exit", scope: !12, file: !12, line: 629, type: !78, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!174 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !165, entity: !175, file: !19, line: 210)
!175 = !DISubprogram(name: "llabs", scope: !12, file: !12, line: 844, type: !176, flags: DIFlagPrototyped, spFlags: 0)
!176 = !DISubroutineType(types: !177)
!177 = !{!170, !170}
!178 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !165, entity: !179, file: !19, line: 216)
!179 = !DISubprogram(name: "lldiv", scope: !12, file: !12, line: 858, type: !180, flags: DIFlagPrototyped, spFlags: 0)
!180 = !DISubroutineType(types: !181)
!181 = !{!166, !170, !170}
!182 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !165, entity: !183, file: !19, line: 227)
!183 = !DISubprogram(name: "atoll", scope: !12, file: !12, line: 112, type: !184, flags: DIFlagPrototyped, spFlags: 0)
!184 = !DISubroutineType(types: !185)
!185 = !{!170, !43}
!186 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !165, entity: !187, file: !19, line: 228)
!187 = !DISubprogram(name: "strtoll", scope: !12, file: !12, line: 200, type: !188, flags: DIFlagPrototyped, spFlags: 0)
!188 = !DISubroutineType(types: !189)
!189 = !{!170, !112, !140, !4}
!190 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !165, entity: !191, file: !19, line: 229)
!191 = !DISubprogram(name: "strtoull", scope: !12, file: !12, line: 205, type: !192, flags: DIFlagPrototyped, spFlags: 0)
!192 = !DISubroutineType(types: !193)
!193 = !{!7, !112, !140, !4}
!194 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !165, entity: !195, file: !19, line: 231)
!195 = !DISubprogram(name: "strtof", scope: !12, file: !12, line: 123, type: !196, flags: DIFlagPrototyped, spFlags: 0)
!196 = !DISubroutineType(types: !197)
!197 = !{!198, !112, !140}
!198 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!199 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !165, entity: !200, file: !19, line: 232)
!200 = !DISubprogram(name: "strtold", scope: !12, file: !12, line: 126, type: !201, flags: DIFlagPrototyped, spFlags: 0)
!201 = !DISubroutineType(types: !202)
!202 = !{!203, !112, !140}
!203 = !DIBasicType(name: "long double", size: 128, encoding: DW_ATE_float)
!204 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !10, entity: !166, file: !19, line: 240)
!205 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !10, entity: !173, file: !19, line: 242)
!206 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !10, entity: !175, file: !19, line: 244)
!207 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !10, entity: !208, file: !19, line: 245)
!208 = !DISubprogram(name: "div", linkageName: "_ZN9__gnu_cxx3divExx", scope: !165, file: !19, line: 213, type: !180, flags: DIFlagPrototyped, spFlags: 0)
!209 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !10, entity: !179, file: !19, line: 246)
!210 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !10, entity: !183, file: !19, line: 248)
!211 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !10, entity: !195, file: !19, line: 249)
!212 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !10, entity: !187, file: !19, line: 250)
!213 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !10, entity: !191, file: !19, line: 251)
!214 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !10, entity: !200, file: !19, line: 252)
!215 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !28, file: !216, line: 38)
!216 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/stdlib.h", directory: "")
!217 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !32, file: !216, line: 39)
!218 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !77, file: !216, line: 40)
!219 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !37, file: !216, line: 43)
!220 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !122, file: !216, line: 46)
!221 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !17, file: !216, line: 51)
!222 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !21, file: !216, line: 52)
!223 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !224, file: !216, line: 54)
!224 = !DISubprogram(name: "abs", linkageName: "_ZSt3absg", scope: !10, file: !15, line: 103, type: !225, flags: DIFlagPrototyped, spFlags: 0)
!225 = !DISubroutineType(types: !226)
!226 = !{!227, !227}
!227 = !DIBasicType(name: "__float128", size: 128, encoding: DW_ATE_float)
!228 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !39, file: !216, line: 55)
!229 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !47, file: !216, line: 56)
!230 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !51, file: !216, line: 57)
!231 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !55, file: !216, line: 58)
!232 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !69, file: !216, line: 59)
!233 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !208, file: !216, line: 60)
!234 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !81, file: !216, line: 61)
!235 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !85, file: !216, line: 62)
!236 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !90, file: !216, line: 63)
!237 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !94, file: !216, line: 64)
!238 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !98, file: !216, line: 65)
!239 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !102, file: !216, line: 67)
!240 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !106, file: !216, line: 68)
!241 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !114, file: !216, line: 69)
!242 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !118, file: !216, line: 71)
!243 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !124, file: !216, line: 72)
!244 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !128, file: !216, line: 73)
!245 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !132, file: !216, line: 74)
!246 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !137, file: !216, line: 75)
!247 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !143, file: !216, line: 76)
!248 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !147, file: !216, line: 77)
!249 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !151, file: !216, line: 78)
!250 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !153, file: !216, line: 80)
!251 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !0, entity: !161, file: !216, line: 81)
!252 = !{i32 7, !"Dwarf Version", i32 4}
!253 = !{i32 2, !"Debug Info Version", i32 3}
!254 = !{i32 1, !"wchar_size", i32 4}
!255 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!256 = distinct !DISubprogram(name: "gen_quiet", linkageName: "_Z9gen_quietP7state_tPi", scope: !1, file: !1, line: 20, type: !257, scopeLine: 20, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!257 = !DISubroutineType(types: !258)
!258 = !{!4, !259, !328}
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "state_t", file: !261, line: 11, size: 99200, flags: DIFlagTypePassByValue, elements: !262, identifier: "_ZTS7state_t")
!261 = !DIFile(filename: "./state.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/531.deepsjeng_r/build/build_base_ld-loop-ext-m64.0000")
!262 = !{!263, !264, !268, !269, !270, !271, !275, !276, !277, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !298, !301, !302, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "threadid", scope: !260, file: !261, line: 13, baseType: !4, size: 32)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "sboard", scope: !260, file: !261, line: 15, baseType: !265, size: 2048, offset: 32)
!265 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2048, elements: !266)
!266 = !{!267}
!267 = !DISubrange(count: 64)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "All", scope: !260, file: !261, line: 16, baseType: !5, size: 64, offset: 2112)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "BlackPieces", scope: !260, file: !261, line: 17, baseType: !5, size: 64, offset: 2176)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "WhitePieces", scope: !260, file: !261, line: 17, baseType: !5, size: 64, offset: 2240)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "BitBoard", scope: !260, file: !261, line: 18, baseType: !272, size: 832, offset: 2304)
!272 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 832, elements: !273)
!273 = !{!274}
!274 = !DISubrange(count: 13)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "Material", scope: !260, file: !261, line: 20, baseType: !4, size: 32, offset: 3136)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "psq_score", scope: !260, file: !261, line: 21, baseType: !4, size: 32, offset: 3168)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "npieces", scope: !260, file: !261, line: 22, baseType: !278, size: 416, offset: 3200)
!278 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 416, elements: !273)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "castleflag", scope: !260, file: !261, line: 23, baseType: !4, size: 32, offset: 3616)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "ep_square", scope: !260, file: !261, line: 25, baseType: !4, size: 32, offset: 3648)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "white_to_move", scope: !260, file: !261, line: 25, baseType: !4, size: 32, offset: 3680)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "wking_loc", scope: !260, file: !261, line: 25, baseType: !4, size: 32, offset: 3712)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "bking_loc", scope: !260, file: !261, line: 25, baseType: !4, size: 32, offset: 3744)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "ply", scope: !260, file: !261, line: 26, baseType: !4, size: 32, offset: 3776)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "fifty", scope: !260, file: !261, line: 26, baseType: !4, size: 32, offset: 3808)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !260, file: !261, line: 28, baseType: !5, size: 64, offset: 3840)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "pawnhash", scope: !260, file: !261, line: 29, baseType: !5, size: 64, offset: 3904)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "path_x", scope: !260, file: !261, line: 31, baseType: !289, size: 16384, offset: 3968)
!289 = !DICompositeType(tag: DW_TAG_array_type, baseType: !290, size: 16384, elements: !266)
!290 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "move_x", file: !6, line: 130, size: 256, flags: DIFlagTypePassByValue, elements: !291, identifier: "_ZTS6move_x")
!291 = !{!292, !293, !294, !295, !296, !297}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "epsq", scope: !290, file: !6, line: 131, baseType: !4, size: 32)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "fifty", scope: !290, file: !6, line: 132, baseType: !4, size: 32, offset: 32)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "castleflag", scope: !290, file: !6, line: 133, baseType: !4, size: 32, offset: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "psq_score", scope: !290, file: !6, line: 134, baseType: !4, size: 32, offset: 96)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !290, file: !6, line: 135, baseType: !5, size: 64, offset: 128)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "pawnhash", scope: !290, file: !6, line: 136, baseType: !5, size: 64, offset: 192)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !260, file: !261, line: 32, baseType: !299, size: 2048, offset: 20352)
!299 = !DICompositeType(tag: DW_TAG_array_type, baseType: !300, size: 2048, elements: !266)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "move_s", file: !6, line: 121, baseType: !4)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "plyeval", scope: !260, file: !261, line: 33, baseType: !265, size: 2048, offset: 22400)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "killerstack", scope: !260, file: !261, line: 41, baseType: !303, size: 8192, offset: 24448)
!303 = !DICompositeType(tag: DW_TAG_array_type, baseType: !304, size: 8192, elements: !266)
!304 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !260, file: !261, line: 36, size: 128, flags: DIFlagTypePassByValue, elements: !305, identifier: "_ZTSN7state_tUt_E")
!305 = !{!306, !307, !308, !309}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "killer1", scope: !304, file: !261, line: 37, baseType: !300, size: 32)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "killer2", scope: !304, file: !261, line: 38, baseType: !300, size: 32, offset: 32)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "killer3", scope: !304, file: !261, line: 39, baseType: !300, size: 32, offset: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "killer4", scope: !304, file: !261, line: 40, baseType: !300, size: 32, offset: 96)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !260, file: !261, line: 43, baseType: !5, size: 64, offset: 32640)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "qnodes", scope: !260, file: !261, line: 43, baseType: !5, size: 64, offset: 32704)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "maxply", scope: !260, file: !261, line: 44, baseType: !4, size: 32, offset: 32768)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "checks", scope: !260, file: !261, line: 45, baseType: !265, size: 2048, offset: 32800)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "TTProbes", scope: !260, file: !261, line: 51, baseType: !135, size: 32, offset: 34848)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "TTHits", scope: !260, file: !261, line: 52, baseType: !135, size: 32, offset: 34880)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "TTStores", scope: !260, file: !261, line: 53, baseType: !135, size: 32, offset: 34912)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "TTColls", scope: !260, file: !261, line: 54, baseType: !135, size: 32, offset: 34944)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "wking_start", scope: !260, file: !261, line: 60, baseType: !4, size: 32, offset: 34976)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "bking_start", scope: !260, file: !261, line: 61, baseType: !4, size: 32, offset: 35008)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "wlrook_start", scope: !260, file: !261, line: 62, baseType: !4, size: 32, offset: 35040)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "wrrook_start", scope: !260, file: !261, line: 63, baseType: !4, size: 32, offset: 35072)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "blrook_start", scope: !260, file: !261, line: 64, baseType: !4, size: 32, offset: 35104)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "brrook_start", scope: !260, file: !261, line: 65, baseType: !4, size: 32, offset: 35136)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "hash_history", scope: !260, file: !261, line: 69, baseType: !325, size: 64000, offset: 35200)
!325 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 64000, elements: !326)
!326 = !{!327}
!327 = !DISubrange(count: 1000)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64)
!329 = !DILocalVariable(name: "s", arg: 1, scope: !256, file: !1, line: 20, type: !259)
!330 = !DILocation(line: 20, column: 24, scope: !256)
!331 = !DILocalVariable(name: "moves", arg: 2, scope: !256, file: !1, line: 20, type: !328)
!332 = !DILocation(line: 20, column: 35, scope: !256)
!333 = !DILocalVariable(name: "tsq", scope: !256, file: !1, line: 21, type: !5)
!334 = !DILocation(line: 21, column: 14, scope: !256)
!335 = !DILocalVariable(name: "temp", scope: !256, file: !1, line: 21, type: !5)
!336 = !DILocation(line: 21, column: 19, scope: !256)
!337 = !DILocalVariable(name: "friendlymask", scope: !256, file: !1, line: 21, type: !5)
!338 = !DILocation(line: 21, column: 25, scope: !256)
!339 = !DILocalVariable(name: "to", scope: !256, file: !1, line: 22, type: !4)
!340 = !DILocation(line: 22, column: 9, scope: !256)
!341 = !DILocalVariable(name: "from", scope: !256, file: !1, line: 22, type: !4)
!342 = !DILocation(line: 22, column: 13, scope: !256)
!343 = !DILocalVariable(name: "start", scope: !256, file: !1, line: 23, type: !328)
!344 = !DILocation(line: 23, column: 13, scope: !256)
!345 = !DILocation(line: 23, column: 21, scope: !256)
!346 = !DILocalVariable(name: "BitBoard", scope: !256, file: !1, line: 24, type: !347)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!348 = !DILocation(line: 24, column: 15, scope: !256)
!349 = !DILocation(line: 24, column: 26, scope: !256)
!350 = !DILocation(line: 24, column: 29, scope: !256)
!351 = !DILocalVariable(name: "sboard", scope: !256, file: !1, line: 25, type: !352)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!353 = !DILocation(line: 25, column: 10, scope: !256)
!354 = !DILocation(line: 25, column: 19, scope: !256)
!355 = !DILocation(line: 25, column: 22, scope: !256)
!356 = !DILocation(line: 27, column: 9, scope: !357)
!357 = distinct !DILexicalBlock(scope: !256, file: !1, line: 27, column: 9)
!358 = !DILocation(line: 27, column: 12, scope: !357)
!359 = !DILocation(line: 27, column: 9, scope: !256)
!360 = !DILocation(line: 28, column: 25, scope: !361)
!361 = distinct !DILexicalBlock(scope: !357, file: !1, line: 27, column: 27)
!362 = !DILocation(line: 28, column: 28, scope: !361)
!363 = !DILocation(line: 28, column: 24, scope: !361)
!364 = !DILocation(line: 28, column: 22, scope: !361)
!365 = !DILocation(line: 29, column: 5, scope: !361)
!366 = !DILocation(line: 30, column: 25, scope: !367)
!367 = distinct !DILexicalBlock(scope: !357, file: !1, line: 29, column: 12)
!368 = !DILocation(line: 30, column: 28, scope: !367)
!369 = !DILocation(line: 30, column: 24, scope: !367)
!370 = !DILocation(line: 30, column: 22, scope: !367)
!371 = !DILocation(line: 34, column: 9, scope: !372)
!372 = distinct !DILexicalBlock(scope: !256, file: !1, line: 34, column: 9)
!373 = !DILocation(line: 34, column: 12, scope: !372)
!374 = !DILocation(line: 34, column: 9, scope: !256)
!375 = !DILocation(line: 35, column: 16, scope: !376)
!376 = distinct !DILexicalBlock(scope: !372, file: !1, line: 34, column: 27)
!377 = !DILocation(line: 35, column: 27, scope: !376)
!378 = !DILocation(line: 35, column: 37, scope: !376)
!379 = !DILocation(line: 35, column: 40, scope: !376)
!380 = !DILocation(line: 35, column: 35, scope: !376)
!381 = !DILocation(line: 35, column: 33, scope: !376)
!382 = !DILocation(line: 35, column: 13, scope: !376)
!383 = !DILocation(line: 36, column: 19, scope: !376)
!384 = !DILocation(line: 36, column: 32, scope: !376)
!385 = !DILocation(line: 36, column: 30, scope: !376)
!386 = !DILocation(line: 36, column: 49, scope: !376)
!387 = !DILocation(line: 36, column: 60, scope: !376)
