; ModuleID = 'epd.cpp'
source_filename = "epd.cpp"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.gamestate_t = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [1000 x i32], [1000 x %struct.move_x], i64, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.move_x = type { i32, i32, i32, i32, i64, i64 }
%struct.state_t = type { i32, [64 x i32], i64, i64, i64, [13 x i64], i32, i32, [13 x i32], i32, i32, i32, i32, i32, i32, i32, i64, i64, [64 x %struct.move_x], [64 x i32], [64 x i32], [64 x %struct.anon], i64, i64, i32, [64 x i32], i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [1000 x i64] }
%struct.anon = type { i32, i32, i32, i32 }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque

@_ZZ14setup_epd_lineP11gamestate_tP7state_tPKcE11rankoffsets = internal constant [8 x i32] [i32 0, i32 8, i32 16, i32 24, i32 32, i32 40, i32 48, i32 56], align 16, !dbg !0
@uci_chess960_mode = external dso_local global i32, align 4
@uci_mode = external dso_local global i32, align 4
@.str = private unnamed_addr constant [4 x i8] c"bm \00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "rankoffsets", scope: !2, file: !3, line: 24, type: !136, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "setup_epd_line", linkageName: "_Z14setup_epd_lineP11gamestate_tP7state_tPKc", scope: !3, file: !3, line: 23, type: !4, scopeLine: 23, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !115, retainedNodes: !116)
!3 = !DIFile(filename: "epd.cpp", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/531.deepsjeng_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !DISubroutineType(types: !5)
!5 = !{null, !6, !55, !112}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gamestate_t", file: !8, line: 72, size: 288832, flags: DIFlagTypePassByValue, elements: !9, identifier: "_ZTS11gamestate_t")
!8 = !DIFile(filename: "./state.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/531.deepsjeng_r/build/build_base_ld-loop-ext-m64.0000")
!9 = !{!10, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !33, !45, !46, !47, !49, !50, !51, !52, !53, !54}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "cur_score", scope: !7, file: !8, line: 73, baseType: !11, size: 32)
!11 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "phase", scope: !7, file: !8, line: 74, baseType: !11, size: 32, offset: 32)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "root_to_move", scope: !7, file: !8, line: 75, baseType: !11, size: 32, offset: 64)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "comp_color", scope: !7, file: !8, line: 76, baseType: !11, size: 32, offset: 96)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !7, file: !8, line: 76, baseType: !11, size: 32, offset: 128)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "i_depth", scope: !7, file: !8, line: 76, baseType: !11, size: 32, offset: 160)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "moves_to_tc", scope: !7, file: !8, line: 77, baseType: !11, size: 32, offset: 192)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "min_per_game", scope: !7, file: !8, line: 77, baseType: !11, size: 32, offset: 224)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "sec_per_game", scope: !7, file: !8, line: 77, baseType: !11, size: 32, offset: 256)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "inc", scope: !7, file: !8, line: 77, baseType: !11, size: 32, offset: 288)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "time_left", scope: !7, file: !8, line: 78, baseType: !11, size: 32, offset: 320)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "opp_time", scope: !7, file: !8, line: 78, baseType: !11, size: 32, offset: 352)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "time_for_move", scope: !7, file: !8, line: 78, baseType: !11, size: 32, offset: 384)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_time", scope: !7, file: !8, line: 79, baseType: !11, size: 32, offset: 416)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "maxdepth", scope: !7, file: !8, line: 80, baseType: !11, size: 32, offset: 448)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "move_number", scope: !7, file: !8, line: 82, baseType: !11, size: 32, offset: 480)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "game_history", scope: !7, file: !8, line: 83, baseType: !28, size: 32000, offset: 512)
!28 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 32000, elements: !31)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "move_s", file: !30, line: 121, baseType: !11)
!30 = !DIFile(filename: "./sjeng.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/531.deepsjeng_r/build/build_base_ld-loop-ext-m64.0000")
!31 = !{!32}
!32 = !DISubrange(count: 1000)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "game_history_x", scope: !7, file: !8, line: 84, baseType: !34, size: 256000, offset: 32512)
!34 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 256000, elements: !31)
!35 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "move_x", file: !30, line: 130, size: 256, flags: DIFlagTypePassByValue, elements: !36, identifier: "_ZTS6move_x")
!36 = !{!37, !38, !39, !40, !41, !44}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "epsq", scope: !35, file: !30, line: 131, baseType: !11, size: 32)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "fifty", scope: !35, file: !30, line: 132, baseType: !11, size: 32, offset: 32)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "castleflag", scope: !35, file: !30, line: 133, baseType: !11, size: 32, offset: 64)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "psq_score", scope: !35, file: !30, line: 134, baseType: !11, size: 32, offset: 96)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !35, file: !30, line: 135, baseType: !42, size: 64, offset: 128)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITBOARD", file: !30, line: 33, baseType: !43)
!43 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "pawnhash", scope: !35, file: !30, line: 136, baseType: !42, size: 64, offset: 192)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "pvnodecount", scope: !7, file: !8, line: 85, baseType: !42, size: 64, offset: 288512)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "start_time", scope: !7, file: !8, line: 86, baseType: !11, size: 32, offset: 288576)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "pv_best", scope: !7, file: !8, line: 88, baseType: !48, size: 32, offset: 288608)
!48 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "legals", scope: !7, file: !8, line: 89, baseType: !11, size: 32, offset: 288640)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "failed", scope: !7, file: !8, line: 90, baseType: !11, size: 32, offset: 288672)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "failedhigh", scope: !7, file: !8, line: 91, baseType: !11, size: 32, offset: 288704)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "extendedtime", scope: !7, file: !8, line: 92, baseType: !11, size: 32, offset: 288736)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "time_exit", scope: !7, file: !8, line: 93, baseType: !11, size: 32, offset: 288768)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "time_failure", scope: !7, file: !8, line: 93, baseType: !11, size: 32, offset: 288800)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!56 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "state_t", file: !8, line: 11, size: 99200, flags: DIFlagTypePassByValue, elements: !57, identifier: "_ZTS7state_t")
!57 = !{!58, !59, !63, !64, !65, !66, !70, !71, !72, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !85, !87, !88, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "threadid", scope: !56, file: !8, line: 13, baseType: !11, size: 32)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "sboard", scope: !56, file: !8, line: 15, baseType: !60, size: 2048, offset: 32)
!60 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 2048, elements: !61)
!61 = !{!62}
!62 = !DISubrange(count: 64)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "All", scope: !56, file: !8, line: 16, baseType: !42, size: 64, offset: 2112)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "BlackPieces", scope: !56, file: !8, line: 17, baseType: !42, size: 64, offset: 2176)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "WhitePieces", scope: !56, file: !8, line: 17, baseType: !42, size: 64, offset: 2240)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "BitBoard", scope: !56, file: !8, line: 18, baseType: !67, size: 832, offset: 2304)
!67 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 832, elements: !68)
!68 = !{!69}
!69 = !DISubrange(count: 13)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "Material", scope: !56, file: !8, line: 20, baseType: !11, size: 32, offset: 3136)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "psq_score", scope: !56, file: !8, line: 21, baseType: !11, size: 32, offset: 3168)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "npieces", scope: !56, file: !8, line: 22, baseType: !73, size: 416, offset: 3200)
!73 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 416, elements: !68)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "castleflag", scope: !56, file: !8, line: 23, baseType: !11, size: 32, offset: 3616)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "ep_square", scope: !56, file: !8, line: 25, baseType: !11, size: 32, offset: 3648)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "white_to_move", scope: !56, file: !8, line: 25, baseType: !11, size: 32, offset: 3680)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "wking_loc", scope: !56, file: !8, line: 25, baseType: !11, size: 32, offset: 3712)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "bking_loc", scope: !56, file: !8, line: 25, baseType: !11, size: 32, offset: 3744)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "ply", scope: !56, file: !8, line: 26, baseType: !11, size: 32, offset: 3776)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "fifty", scope: !56, file: !8, line: 26, baseType: !11, size: 32, offset: 3808)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !56, file: !8, line: 28, baseType: !42, size: 64, offset: 3840)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "pawnhash", scope: !56, file: !8, line: 29, baseType: !42, size: 64, offset: 3904)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "path_x", scope: !56, file: !8, line: 31, baseType: !84, size: 16384, offset: 3968)
!84 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 16384, elements: !61)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !56, file: !8, line: 32, baseType: !86, size: 2048, offset: 20352)
!86 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 2048, elements: !61)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "plyeval", scope: !56, file: !8, line: 33, baseType: !60, size: 2048, offset: 22400)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "killerstack", scope: !56, file: !8, line: 41, baseType: !89, size: 8192, offset: 24448)
!89 = !DICompositeType(tag: DW_TAG_array_type, baseType: !90, size: 8192, elements: !61)
!90 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !56, file: !8, line: 36, size: 128, flags: DIFlagTypePassByValue, elements: !91, identifier: "_ZTSN7state_tUt_E")
!91 = !{!92, !93, !94, !95}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "killer1", scope: !90, file: !8, line: 37, baseType: !29, size: 32)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "killer2", scope: !90, file: !8, line: 38, baseType: !29, size: 32, offset: 32)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "killer3", scope: !90, file: !8, line: 39, baseType: !29, size: 32, offset: 64)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "killer4", scope: !90, file: !8, line: 40, baseType: !29, size: 32, offset: 96)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !56, file: !8, line: 43, baseType: !42, size: 64, offset: 32640)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "qnodes", scope: !56, file: !8, line: 43, baseType: !42, size: 64, offset: 32704)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "maxply", scope: !56, file: !8, line: 44, baseType: !11, size: 32, offset: 32768)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "checks", scope: !56, file: !8, line: 45, baseType: !60, size: 2048, offset: 32800)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "TTProbes", scope: !56, file: !8, line: 51, baseType: !48, size: 32, offset: 34848)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "TTHits", scope: !56, file: !8, line: 52, baseType: !48, size: 32, offset: 34880)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "TTStores", scope: !56, file: !8, line: 53, baseType: !48, size: 32, offset: 34912)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "TTColls", scope: !56, file: !8, line: 54, baseType: !48, size: 32, offset: 34944)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "wking_start", scope: !56, file: !8, line: 60, baseType: !11, size: 32, offset: 34976)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "bking_start", scope: !56, file: !8, line: 61, baseType: !11, size: 32, offset: 35008)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "wlrook_start", scope: !56, file: !8, line: 62, baseType: !11, size: 32, offset: 35040)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "wrrook_start", scope: !56, file: !8, line: 63, baseType: !11, size: 32, offset: 35072)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "blrook_start", scope: !56, file: !8, line: 64, baseType: !11, size: 32, offset: 35104)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "brrook_start", scope: !56, file: !8, line: 65, baseType: !11, size: 32, offset: 35136)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "hash_history", scope: !56, file: !8, line: 69, baseType: !111, size: 64000, offset: 35200)
!111 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 64000, elements: !31)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !114)
!114 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!115 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus_14, file: !3, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !116, retainedTypes: !117, globals: !119, imports: !140, splitDebugInlining: false, nameTableKind: None)
!116 = !{}
!117 = !{!11, !118}
!118 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!119 = !{!0, !120, !129, !134}
!120 = !DIGlobalVariableExpression(var: !121, expr: !DIExpression())
!121 = distinct !DIGlobalVariable(name: "xlate", scope: !122, file: !3, line: 384, type: !126, isLocal: true, isDefinition: true)
!122 = distinct !DISubprogram(name: "position_to_fen", linkageName: "_Z15position_to_fenP7state_tPc", scope: !3, file: !3, line: 383, type: !123, scopeLine: 383, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !115, retainedNodes: !116)
!123 = !DISubroutineType(types: !124)
!124 = !{null, !55, !125}
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!126 = !DICompositeType(tag: DW_TAG_array_type, baseType: !113, size: 112, elements: !127)
!127 = !{!128}
!128 = !DISubrange(count: 14)
!129 = !DIGlobalVariableExpression(var: !130, expr: !DIExpression())
!130 = distinct !DIGlobalVariable(name: "str_empty", scope: !122, file: !3, line: 385, type: !131, isLocal: true, isDefinition: true)
!131 = !DICompositeType(tag: DW_TAG_array_type, baseType: !113, size: 72, elements: !132)
!132 = !{!133}
!133 = !DISubrange(count: 9)
!134 = !DIGlobalVariableExpression(var: !135, expr: !DIExpression())
!135 = distinct !DIGlobalVariable(name: "rankoffsets", scope: !122, file: !3, line: 386, type: !136, isLocal: true, isDefinition: true)
!136 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 256, elements: !138)
!137 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !11)
!138 = !{!139}
!139 = !DISubrange(count: 8)
!140 = !{!141, !148, !152, !159, !163, !168, !170, !175, !179, !183, !197, !201, !205, !209, !213, !217, !221, !225, !229, !233, !241, !245, !249, !251, !255, !259, !263, !269, !273, !277, !279, !287, !291, !299, !301, !305, !309, !313, !317, !321, !325, !330, !331, !332, !333, !335, !336, !337, !338, !339, !340, !341, !343, !344, !345, !346, !347, !348, !349, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377}
!141 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !142, entity: !143, file: !147, line: 52)
!142 = !DINamespace(name: "std", scope: null)
!143 = !DISubprogram(name: "abs", scope: !144, file: !144, line: 840, type: !145, flags: DIFlagPrototyped, spFlags: 0)
!144 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!145 = !DISubroutineType(types: !146)
!146 = !{!11, !11}
!147 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/bits/std_abs.h", directory: "")
!148 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !142, entity: !149, file: !151, line: 127)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "div_t", file: !144, line: 62, baseType: !150)
!150 = !DICompositeType(tag: DW_TAG_structure_type, file: !144, line: 58, flags: DIFlagFwdDecl, identifier: "_ZTS5div_t")
!151 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/cstdlib", directory: "")
!152 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !142, entity: !153, file: !151, line: 128)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "ldiv_t", file: !144, line: 70, baseType: !154)
!154 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !144, line: 66, size: 128, flags: DIFlagTypePassByValue, elements: !155, identifier: "_ZTS6ldiv_t")
!155 = !{!156, !158}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !154, file: !144, line: 68, baseType: !157, size: 64)
!157 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !154, file: !144, line: 69, baseType: !157, size: 64, offset: 64)
!159 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !142, entity: !160, file: !151, line: 130)
!160 = !DISubprogram(name: "abort", scope: !144, file: !144, line: 591, type: !161, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!161 = !DISubroutineType(types: !162)
!162 = !{null}
!163 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !142, entity: !164, file: !151, line: 134)
!164 = !DISubprogram(name: "atexit", scope: !144, file: !144, line: 595, type: !165, flags: DIFlagPrototyped, spFlags: 0)
!165 = !DISubroutineType(types: !166)
!166 = !{!11, !167}
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!168 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !142, entity: !169, file: !151, line: 137)
!169 = !DISubprogram(name: "at_quick_exit", scope: !144, file: !144, line: 600, type: !165, flags: DIFlagPrototyped, spFlags: 0)
!170 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !142, entity: !171, file: !151, line: 140)
!171 = !DISubprogram(name: "atof", scope: !144, file: !144, line: 101, type: !172, flags: DIFlagPrototyped, spFlags: 0)
!172 = !DISubroutineType(types: !173)
!173 = !{!174, !112}
!174 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!175 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !142, entity: !176, file: !151, line: 141)
!176 = !DISubprogram(name: "atoi", scope: !144, file: !144, line: 104, type: !177, flags: DIFlagPrototyped, spFlags: 0)
!177 = !DISubroutineType(types: !178)
!178 = !{!11, !112}
!179 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !142, entity: !180, file: !151, line: 142)
!180 = !DISubprogram(name: "atol", scope: !144, file: !144, line: 107, type: !181, flags: DIFlagPrototyped, spFlags: 0)
!181 = !DISubroutineType(types: !182)
!182 = !{!157, !112}
!183 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !142, entity: !184, file: !151, line: 143)
!184 = !DISubprogram(name: "bsearch", scope: !144, file: !144, line: 820, type: !185, flags: DIFlagPrototyped, spFlags: 0)
!185 = !DISubroutineType(types: !186)
!186 = !{!187, !188, !188, !190, !190, !193}
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !191, line: 46, baseType: !192)
!191 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!192 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "__compar_fn_t", file: !144, line: 808, baseType: !194)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!195 = !DISubroutineType(types: !196)
!196 = !{!11, !188, !188}
!197 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !142, entity: !198, file: !151, line: 144)
!198 = !DISubprogram(name: "calloc", scope: !144, file: !144, line: 542, type: !199, flags: DIFlagPrototyped, spFlags: 0)
!199 = !DISubroutineType(types: !200)
!200 = !{!187, !190, !190}
!201 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !142, entity: !202, file: !151, line: 145)
!202 = !DISubprogram(name: "div", scope: !144, file: !144, line: 852, type: !203, flags: DIFlagPrototyped, spFlags: 0)
!203 = !DISubroutineType(types: !204)
!204 = !{!149, !11, !11}
!205 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !142, entity: !206, file: !151, line: 146)
!206 = !DISubprogram(name: "exit", scope: !144, file: !144, line: 617, type: !207, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!207 = !DISubroutineType(types: !208)
!208 = !{null, !11}
!209 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !142, entity: !210, file: !151, line: 147)
!210 = !DISubprogram(name: "free", scope: !144, file: !144, line: 565, type: !211, flags: DIFlagPrototyped, spFlags: 0)
!211 = !DISubroutineType(types: !212)
!212 = !{null, !187}
!213 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !142, entity: !214, file: !151, line: 148)
!214 = !DISubprogram(name: "getenv", scope: !144, file: !144, line: 634, type: !215, flags: DIFlagPrototyped, spFlags: 0)
!215 = !DISubroutineType(types: !216)
!216 = !{!125, !112}
!217 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !142, entity: !218, file: !151, line: 149)
!218 = !DISubprogram(name: "labs", scope: !144, file: !144, line: 841, type: !219, flags: DIFlagPrototyped, spFlags: 0)
!219 = !DISubroutineType(types: !220)
!220 = !{!157, !157}
!221 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !142, entity: !222, file: !151, line: 150)
!222 = !DISubprogram(name: "ldiv", scope: !144, file: !144, line: 854, type: !223, flags: DIFlagPrototyped, spFlags: 0)
!223 = !DISubroutineType(types: !224)
!224 = !{!153, !157, !157}
!225 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !142, entity: !226, file: !151, line: 151)
!226 = !DISubprogram(name: "malloc", scope: !144, file: !144, line: 539, type: !227, flags: DIFlagPrototyped, spFlags: 0)
!227 = !DISubroutineType(types: !228)
!228 = !{!187, !190}
!229 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !142, entity: !230, file: !151, line: 153)
!230 = !DISubprogram(name: "mblen", scope: !144, file: !144, line: 922, type: !231, flags: DIFlagPrototyped, spFlags: 0)
!231 = !DISubroutineType(types: !232)
!232 = !{!11, !112, !190}
!233 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !142, entity: !234, file: !151, line: 154)
!234 = !DISubprogram(name: "mbstowcs", scope: !144, file: !144, line: 933, type: !235, flags: DIFlagPrototyped, spFlags: 0)
!235 = !DISubroutineType(types: !236)
!236 = !{!190, !237, !240, !190}
!237 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !238)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!239 = !DIBasicType(name: "wchar_t", size: 32, encoding: DW_ATE_signed)
!240 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !112)
!241 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !142, entity: !242, file: !151, line: 155)
!242 = !DISubprogram(name: "mbtowc", scope: !144, file: !144, line: 925, type: !243, flags: DIFlagPrototyped, spFlags: 0)
!243 = !DISubroutineType(types: !244)
!244 = !{!11, !237, !240, !190}
!245 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !142, entity: !246, file: !151, line: 157)
!246 = !DISubprogram(name: "qsort", scope: !144, file: !144, line: 830, type: !247, flags: DIFlagPrototyped, spFlags: 0)
!247 = !DISubroutineType(types: !248)
!248 = !{null, !187, !190, !190, !193}
!249 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !142, entity: !250, file: !151, line: 160)
!250 = !DISubprogram(name: "quick_exit", scope: !144, file: !144, line: 623, type: !207, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!251 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !142, entity: !252, file: !151, line: 163)
!252 = !DISubprogram(name: "rand", scope: !144, file: !144, line: 453, type: !253, flags: DIFlagPrototyped, spFlags: 0)
!253 = !DISubroutineType(types: !254)
!254 = !{!11}
!255 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !142, entity: !256, file: !151, line: 164)
!256 = !DISubprogram(name: "realloc", scope: !144, file: !144, line: 550, type: !257, flags: DIFlagPrototyped, spFlags: 0)
!257 = !DISubroutineType(types: !258)
!258 = !{!187, !187, !190}
!259 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !142, entity: !260, file: !151, line: 165)
!260 = !DISubprogram(name: "srand", scope: !144, file: !144, line: 455, type: !261, flags: DIFlagPrototyped, spFlags: 0)
!261 = !DISubroutineType(types: !262)
!262 = !{null, !48}
!263 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !142, entity: !264, file: !151, line: 166)
!264 = !DISubprogram(name: "strtod", scope: !144, file: !144, line: 117, type: !265, flags: DIFlagPrototyped, spFlags: 0)
!265 = !DISubroutineType(types: !266)
!266 = !{!174, !240, !267}
!267 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !268)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!269 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !142, entity: !270, file: !151, line: 167)
!270 = !DISubprogram(name: "strtol", scope: !144, file: !144, line: 176, type: !271, flags: DIFlagPrototyped, spFlags: 0)
!271 = !DISubroutineType(types: !272)
!272 = !{!157, !240, !267, !11}
!273 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !142, entity: !274, file: !151, line: 168)
!274 = !DISubprogram(name: "strtoul", scope: !144, file: !144, line: 180, type: !275, flags: DIFlagPrototyped, spFlags: 0)
!275 = !DISubroutineType(types: !276)
!276 = !{!192, !240, !267, !11}
!277 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !142, entity: !278, file: !151, line: 169)
!278 = !DISubprogram(name: "system", scope: !144, file: !144, line: 784, type: !177, flags: DIFlagPrototyped, spFlags: 0)
!279 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !142, entity: !280, file: !151, line: 171)
!280 = !DISubprogram(name: "wcstombs", scope: !144, file: !144, line: 936, type: !281, flags: DIFlagPrototyped, spFlags: 0)
!281 = !DISubroutineType(types: !282)
!282 = !{!190, !283, !284, !190}
!283 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !125)
!284 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !285)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!286 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !239)
!287 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !142, entity: !288, file: !151, line: 172)
!288 = !DISubprogram(name: "wctomb", scope: !144, file: !144, line: 929, type: !289, flags: DIFlagPrototyped, spFlags: 0)
!289 = !DISubroutineType(types: !290)
!290 = !{!11, !125, !239}
!291 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !292, entity: !293, file: !151, line: 200)
!292 = !DINamespace(name: "__gnu_cxx", scope: null)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "lldiv_t", file: !144, line: 80, baseType: !294)
!294 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !144, line: 76, size: 128, flags: DIFlagTypePassByValue, elements: !295, identifier: "_ZTS7lldiv_t")
!295 = !{!296, !298}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !294, file: !144, line: 78, baseType: !297, size: 64)
!297 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !294, file: !144, line: 79, baseType: !297, size: 64, offset: 64)
!299 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !292, entity: !300, file: !151, line: 206)
!300 = !DISubprogram(name: "_Exit", scope: !144, file: !144, line: 629, type: !207, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!301 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !292, entity: !302, file: !151, line: 210)
!302 = !DISubprogram(name: "llabs", scope: !144, file: !144, line: 844, type: !303, flags: DIFlagPrototyped, spFlags: 0)
!303 = !DISubroutineType(types: !304)
!304 = !{!297, !297}
!305 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !292, entity: !306, file: !151, line: 216)
!306 = !DISubprogram(name: "lldiv", scope: !144, file: !144, line: 858, type: !307, flags: DIFlagPrototyped, spFlags: 0)
!307 = !DISubroutineType(types: !308)
!308 = !{!293, !297, !297}
!309 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !292, entity: !310, file: !151, line: 227)
!310 = !DISubprogram(name: "atoll", scope: !144, file: !144, line: 112, type: !311, flags: DIFlagPrototyped, spFlags: 0)
!311 = !DISubroutineType(types: !312)
!312 = !{!297, !112}
!313 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !292, entity: !314, file: !151, line: 228)
!314 = !DISubprogram(name: "strtoll", scope: !144, file: !144, line: 200, type: !315, flags: DIFlagPrototyped, spFlags: 0)
!315 = !DISubroutineType(types: !316)
!316 = !{!297, !240, !267, !11}
!317 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !292, entity: !318, file: !151, line: 229)
!318 = !DISubprogram(name: "strtoull", scope: !144, file: !144, line: 205, type: !319, flags: DIFlagPrototyped, spFlags: 0)
!319 = !DISubroutineType(types: !320)
!320 = !{!43, !240, !267, !11}
!321 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !292, entity: !322, file: !151, line: 231)
!322 = !DISubprogram(name: "strtof", scope: !144, file: !144, line: 123, type: !323, flags: DIFlagPrototyped, spFlags: 0)
!323 = !DISubroutineType(types: !324)
!324 = !{!118, !240, !267}
!325 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !292, entity: !326, file: !151, line: 232)
!326 = !DISubprogram(name: "strtold", scope: !144, file: !144, line: 126, type: !327, flags: DIFlagPrototyped, spFlags: 0)
!327 = !DISubroutineType(types: !328)
!328 = !{!329, !240, !267}
!329 = !DIBasicType(name: "long double", size: 128, encoding: DW_ATE_float)
!330 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !142, entity: !293, file: !151, line: 240)
!331 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !142, entity: !300, file: !151, line: 242)
!332 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !142, entity: !302, file: !151, line: 244)
!333 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !142, entity: !334, file: !151, line: 245)
!334 = !DISubprogram(name: "div", linkageName: "_ZN9__gnu_cxx3divExx", scope: !292, file: !151, line: 213, type: !307, flags: DIFlagPrototyped, spFlags: 0)
!335 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !142, entity: !306, file: !151, line: 246)
!336 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !142, entity: !310, file: !151, line: 248)
!337 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !142, entity: !322, file: !151, line: 249)
!338 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !142, entity: !314, file: !151, line: 250)
!339 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !142, entity: !318, file: !151, line: 251)
!340 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !142, entity: !326, file: !151, line: 252)
!341 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !115, entity: !160, file: !342, line: 38)
!342 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/10/../../../../include/c++/10/stdlib.h", directory: "")
