; ModuleID = 'magick/signature.c'
source_filename = "magick/signature.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._SignatureInfo = type { i32, i32, %struct._StringInfo*, %struct._StringInfo*, i32*, i32, i32, i64, i32, i64, i64 }
%struct._StringInfo = type { [4096 x i8], i8*, i64, i64 }
%struct._ExceptionInfo = type { i32, i32, i8*, i8*, i8*, i32, %struct.SemaphoreInfo*, i64 }
%struct.SemaphoreInfo = type opaque
%struct._Image = type { i32, i32, i32, i64, i32, i32, i32, i64, i64, i64, i64, %struct._PixelPacket*, %struct._PixelPacket, %struct._PixelPacket, %struct._PixelPacket, double, %struct._ChromaticityInfo, i32, i8*, i32, i8*, i8*, i8*, i64, double, double, %struct._RectangleInfo, %struct._RectangleInfo, %struct._RectangleInfo, double, double, double, i32, i32, i32, i32, i32, i32, %struct._Image*, i64, i64, i64, i64, i64, i64, %struct._ErrorInfo, %struct._TimerInfo, i32 (i8*, i64, i64, i8*)*, i8*, i8*, i8*, %struct._Ascii85Info*, %struct._BlobInfo*, [4096 x i8], [4096 x i8], [4096 x i8], i64, i64, %struct._ExceptionInfo, i32, i64, %struct.SemaphoreInfo*, %struct._ProfileInfo, %struct._ProfileInfo, %struct._ProfileInfo*, i64, i64, %struct._Image*, %struct._Image*, %struct._Image*, i32, i32, %struct._PixelPacket, %struct._Image*, %struct._RectangleInfo, i8*, i8*, i32, i32, i64, i32, i64, i64, i32, i64 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "K", scope: !2, file: !3, line: 627, type: !935, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "TransformSignature", scope: !3, file: !3, line: 610, type: !4, scopeLine: 611, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !53, retainedNodes: !934)
!3 = !DIFile(filename: "magick/signature.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !DISubroutineType(types: !5)
!5 = !{null, !6}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "SignatureInfo", file: !8, line: 30, baseType: !9)
!8 = !DIFile(filename: "./magick/signature-private.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SignatureInfo", file: !3, line: 65, size: 576, elements: !10)
!10 = !{!11, !13, !14, !33, !34, !36, !37, !38, !39, !46, !52}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "digestsize", scope: !9, file: !3, line: 68, baseType: !12, size: 32)
!12 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "blocksize", scope: !9, file: !3, line: 69, baseType: !12, size: 32, offset: 32)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "digest", scope: !9, file: !3, line: 72, baseType: !15, size: 64, offset: 64)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "StringInfo", file: !17, line: 40, baseType: !18)
!17 = !DIFile(filename: "./magick/string_.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!18 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_StringInfo", file: !17, line: 29, size: 32960, elements: !19)
!19 = !{!20, !25, !28, !32}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !18, file: !17, line: 32, baseType: !21, size: 32768)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 32768, elements: !23)
!22 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!23 = !{!24}
!24 = !DISubrange(count: 4096)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "datum", scope: !18, file: !17, line: 35, baseType: !26, size: 64, offset: 32768)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!27 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !18, file: !17, line: 38, baseType: !29, size: 64, offset: 32832)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !30, line: 46, baseType: !31)
!30 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!31 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !18, file: !17, line: 39, baseType: !29, size: 64, offset: 32896)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !9, file: !3, line: 73, baseType: !15, size: 64, offset: 128)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "accumulator", scope: !9, file: !3, line: 76, baseType: !35, size: 64, offset: 192)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "low_order", scope: !9, file: !3, line: 77, baseType: !12, size: 32, offset: 256)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "high_order", scope: !9, file: !3, line: 78, baseType: !12, size: 32, offset: 288)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !9, file: !3, line: 81, baseType: !29, size: 64, offset: 320)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "lsb_first", scope: !9, file: !3, line: 84, baseType: !40, size: 32, offset: 384)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickBooleanType", file: !41, line: 215, baseType: !42)
!41 = !DIFile(filename: "./magick/magick-type.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!42 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !41, line: 211, baseType: !12, size: 32, elements: !43)
!43 = !{!44, !45}
!44 = !DIEnumerator(name: "MagickFalse", value: 0, isUnsigned: true)
!45 = !DIEnumerator(name: "MagickTrue", value: 1, isUnsigned: true)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !9, file: !3, line: 87, baseType: !47, size: 64, offset: 448)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !48, line: 77, baseType: !49)
!48 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !50, line: 193, baseType: !51)
!50 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!51 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !9, file: !3, line: 90, baseType: !29, size: 64, offset: 512)
!53 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !54, retainedTypes: !556, globals: !933, splitDebugInlining: false, nameTableKind: None)
!54 = !{!42, !55, !128, !153, !158, !195, !220, !232, !240, !245, !280, !290, !296, !311, !382, !390, !396, !413, !427, !439, !445, !450, !480, !513, !535}
!55 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !56, line: 28, baseType: !12, size: 32, elements: !57)
!56 = !DIFile(filename: "./magick/exception.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!57 = !{!58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127}
!58 = !DIEnumerator(name: "UndefinedException", value: 0, isUnsigned: true)
!59 = !DIEnumerator(name: "WarningException", value: 300, isUnsigned: true)
!60 = !DIEnumerator(name: "ResourceLimitWarning", value: 300, isUnsigned: true)
!61 = !DIEnumerator(name: "TypeWarning", value: 305, isUnsigned: true)
!62 = !DIEnumerator(name: "OptionWarning", value: 310, isUnsigned: true)
!63 = !DIEnumerator(name: "DelegateWarning", value: 315, isUnsigned: true)
!64 = !DIEnumerator(name: "MissingDelegateWarning", value: 320, isUnsigned: true)
!65 = !DIEnumerator(name: "CorruptImageWarning", value: 325, isUnsigned: true)
!66 = !DIEnumerator(name: "FileOpenWarning", value: 330, isUnsigned: true)
!67 = !DIEnumerator(name: "BlobWarning", value: 335, isUnsigned: true)
!68 = !DIEnumerator(name: "StreamWarning", value: 340, isUnsigned: true)
!69 = !DIEnumerator(name: "CacheWarning", value: 345, isUnsigned: true)
!70 = !DIEnumerator(name: "CoderWarning", value: 350, isUnsigned: true)
!71 = !DIEnumerator(name: "FilterWarning", value: 352, isUnsigned: true)
!72 = !DIEnumerator(name: "ModuleWarning", value: 355, isUnsigned: true)
!73 = !DIEnumerator(name: "DrawWarning", value: 360, isUnsigned: true)
!74 = !DIEnumerator(name: "ImageWarning", value: 365, isUnsigned: true)
!75 = !DIEnumerator(name: "WandWarning", value: 370, isUnsigned: true)
!76 = !DIEnumerator(name: "RandomWarning", value: 375, isUnsigned: true)
!77 = !DIEnumerator(name: "XServerWarning", value: 380, isUnsigned: true)
!78 = !DIEnumerator(name: "MonitorWarning", value: 385, isUnsigned: true)
!79 = !DIEnumerator(name: "RegistryWarning", value: 390, isUnsigned: true)
!80 = !DIEnumerator(name: "ConfigureWarning", value: 395, isUnsigned: true)
!81 = !DIEnumerator(name: "PolicyWarning", value: 399, isUnsigned: true)
!82 = !DIEnumerator(name: "ErrorException", value: 400, isUnsigned: true)
!83 = !DIEnumerator(name: "ResourceLimitError", value: 400, isUnsigned: true)
!84 = !DIEnumerator(name: "TypeError", value: 405, isUnsigned: true)
!85 = !DIEnumerator(name: "OptionError", value: 410, isUnsigned: true)
!86 = !DIEnumerator(name: "DelegateError", value: 415, isUnsigned: true)
!87 = !DIEnumerator(name: "MissingDelegateError", value: 420, isUnsigned: true)
!88 = !DIEnumerator(name: "CorruptImageError", value: 425, isUnsigned: true)
!89 = !DIEnumerator(name: "FileOpenError", value: 430, isUnsigned: true)
!90 = !DIEnumerator(name: "BlobError", value: 435, isUnsigned: true)
!91 = !DIEnumerator(name: "StreamError", value: 440, isUnsigned: true)
!92 = !DIEnumerator(name: "CacheError", value: 445, isUnsigned: true)
!93 = !DIEnumerator(name: "CoderError", value: 450, isUnsigned: true)
!94 = !DIEnumerator(name: "FilterError", value: 452, isUnsigned: true)
!95 = !DIEnumerator(name: "ModuleError", value: 455, isUnsigned: true)
!96 = !DIEnumerator(name: "DrawError", value: 460, isUnsigned: true)
!97 = !DIEnumerator(name: "ImageError", value: 465, isUnsigned: true)
!98 = !DIEnumerator(name: "WandError", value: 470, isUnsigned: true)
!99 = !DIEnumerator(name: "RandomError", value: 475, isUnsigned: true)
!100 = !DIEnumerator(name: "XServerError", value: 480, isUnsigned: true)
!101 = !DIEnumerator(name: "MonitorError", value: 485, isUnsigned: true)
!102 = !DIEnumerator(name: "RegistryError", value: 490, isUnsigned: true)
!103 = !DIEnumerator(name: "ConfigureError", value: 495, isUnsigned: true)
!104 = !DIEnumerator(name: "PolicyError", value: 499, isUnsigned: true)
!105 = !DIEnumerator(name: "FatalErrorException", value: 700, isUnsigned: true)
!106 = !DIEnumerator(name: "ResourceLimitFatalError", value: 700, isUnsigned: true)
!107 = !DIEnumerator(name: "TypeFatalError", value: 705, isUnsigned: true)
!108 = !DIEnumerator(name: "OptionFatalError", value: 710, isUnsigned: true)
!109 = !DIEnumerator(name: "DelegateFatalError", value: 715, isUnsigned: true)
!110 = !DIEnumerator(name: "MissingDelegateFatalError", value: 720, isUnsigned: true)
!111 = !DIEnumerator(name: "CorruptImageFatalError", value: 725, isUnsigned: true)
!112 = !DIEnumerator(name: "FileOpenFatalError", value: 730, isUnsigned: true)
!113 = !DIEnumerator(name: "BlobFatalError", value: 735, isUnsigned: true)
!114 = !DIEnumerator(name: "StreamFatalError", value: 740, isUnsigned: true)
!115 = !DIEnumerator(name: "CacheFatalError", value: 745, isUnsigned: true)
!116 = !DIEnumerator(name: "CoderFatalError", value: 750, isUnsigned: true)
!117 = !DIEnumerator(name: "FilterFatalError", value: 752, isUnsigned: true)
!118 = !DIEnumerator(name: "ModuleFatalError", value: 755, isUnsigned: true)
!119 = !DIEnumerator(name: "DrawFatalError", value: 760, isUnsigned: true)
!120 = !DIEnumerator(name: "ImageFatalError", value: 765, isUnsigned: true)
!121 = !DIEnumerator(name: "WandFatalError", value: 770, isUnsigned: true)
!122 = !DIEnumerator(name: "RandomFatalError", value: 775, isUnsigned: true)
!123 = !DIEnumerator(name: "XServerFatalError", value: 780, isUnsigned: true)
!124 = !DIEnumerator(name: "MonitorFatalError", value: 785, isUnsigned: true)
!125 = !DIEnumerator(name: "RegistryFatalError", value: 790, isUnsigned: true)
!126 = !DIEnumerator(name: "ConfigureFatalError", value: 795, isUnsigned: true)
!127 = !DIEnumerator(name: "PolicyFatalError", value: 799, isUnsigned: true)
!128 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !129, line: 34, baseType: !12, size: 32, elements: !130)
!129 = !DIFile(filename: "./magick/log.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!130 = !{!131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152}
!131 = !DIEnumerator(name: "UndefinedEvents", value: 0, isUnsigned: true)
!132 = !DIEnumerator(name: "NoEvents", value: 0, isUnsigned: true)
!133 = !DIEnumerator(name: "TraceEvent", value: 1, isUnsigned: true)
!134 = !DIEnumerator(name: "AnnotateEvent", value: 2, isUnsigned: true)
!135 = !DIEnumerator(name: "BlobEvent", value: 4, isUnsigned: true)
!136 = !DIEnumerator(name: "CacheEvent", value: 8, isUnsigned: true)
!137 = !DIEnumerator(name: "CoderEvent", value: 16, isUnsigned: true)
!138 = !DIEnumerator(name: "ConfigureEvent", value: 32, isUnsigned: true)
!139 = !DIEnumerator(name: "DeprecateEvent", value: 64, isUnsigned: true)
!140 = !DIEnumerator(name: "DrawEvent", value: 128, isUnsigned: true)
!141 = !DIEnumerator(name: "ExceptionEvent", value: 256, isUnsigned: true)
!142 = !DIEnumerator(name: "ImageEvent", value: 512, isUnsigned: true)
!143 = !DIEnumerator(name: "LocaleEvent", value: 1024, isUnsigned: true)
!144 = !DIEnumerator(name: "ModuleEvent", value: 2048, isUnsigned: true)
!145 = !DIEnumerator(name: "PolicyEvent", value: 4096, isUnsigned: true)
!146 = !DIEnumerator(name: "ResourceEvent", value: 8192, isUnsigned: true)
!147 = !DIEnumerator(name: "TransformEvent", value: 16384, isUnsigned: true)
!148 = !DIEnumerator(name: "UserEvent", value: 36864, isUnsigned: true)
!149 = !DIEnumerator(name: "WandEvent", value: 65536, isUnsigned: true)
!150 = !DIEnumerator(name: "X11Event", value: 131072, isUnsigned: true)
!151 = !DIEnumerator(name: "AccelerateEvent", value: 262144, isUnsigned: true)
!152 = !DIEnumerator(name: "AllEvents", value: 2147483647, isUnsigned: true)
!153 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !41, line: 204, baseType: !12, size: 32, elements: !154)
!154 = !{!155, !156, !157}
!155 = !DIEnumerator(name: "UndefinedClass", value: 0, isUnsigned: true)
!156 = !DIEnumerator(name: "DirectClass", value: 1, isUnsigned: true)
!157 = !DIEnumerator(name: "PseudoClass", value: 2, isUnsigned: true)
!158 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !159, line: 25, baseType: !12, size: 32, elements: !160)
!159 = !DIFile(filename: "./magick/colorspace.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!160 = !{!161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194}
!161 = !DIEnumerator(name: "UndefinedColorspace", value: 0, isUnsigned: true)
!162 = !DIEnumerator(name: "RGBColorspace", value: 1, isUnsigned: true)
!163 = !DIEnumerator(name: "GRAYColorspace", value: 2, isUnsigned: true)
!164 = !DIEnumerator(name: "TransparentColorspace", value: 3, isUnsigned: true)
!165 = !DIEnumerator(name: "OHTAColorspace", value: 4, isUnsigned: true)
!166 = !DIEnumerator(name: "LabColorspace", value: 5, isUnsigned: true)
!167 = !DIEnumerator(name: "XYZColorspace", value: 6, isUnsigned: true)
!168 = !DIEnumerator(name: "YCbCrColorspace", value: 7, isUnsigned: true)
!169 = !DIEnumerator(name: "YCCColorspace", value: 8, isUnsigned: true)
!170 = !DIEnumerator(name: "YIQColorspace", value: 9, isUnsigned: true)
!171 = !DIEnumerator(name: "YPbPrColorspace", value: 10, isUnsigned: true)
!172 = !DIEnumerator(name: "YUVColorspace", value: 11, isUnsigned: true)
!173 = !DIEnumerator(name: "CMYKColorspace", value: 12, isUnsigned: true)
!174 = !DIEnumerator(name: "sRGBColorspace", value: 13, isUnsigned: true)
!175 = !DIEnumerator(name: "HSBColorspace", value: 14, isUnsigned: true)
!176 = !DIEnumerator(name: "HSLColorspace", value: 15, isUnsigned: true)
!177 = !DIEnumerator(name: "HWBColorspace", value: 16, isUnsigned: true)
!178 = !DIEnumerator(name: "Rec601LumaColorspace", value: 17, isUnsigned: true)
!179 = !DIEnumerator(name: "Rec601YCbCrColorspace", value: 18, isUnsigned: true)
!180 = !DIEnumerator(name: "Rec709LumaColorspace", value: 19, isUnsigned: true)
!181 = !DIEnumerator(name: "Rec709YCbCrColorspace", value: 20, isUnsigned: true)
!182 = !DIEnumerator(name: "LogColorspace", value: 21, isUnsigned: true)
!183 = !DIEnumerator(name: "CMYColorspace", value: 22, isUnsigned: true)
!184 = !DIEnumerator(name: "LuvColorspace", value: 23, isUnsigned: true)
!185 = !DIEnumerator(name: "HCLColorspace", value: 24, isUnsigned: true)
!186 = !DIEnumerator(name: "LCHColorspace", value: 25, isUnsigned: true)
!187 = !DIEnumerator(name: "LMSColorspace", value: 26, isUnsigned: true)
!188 = !DIEnumerator(name: "LCHabColorspace", value: 27, isUnsigned: true)
!189 = !DIEnumerator(name: "LCHuvColorspace", value: 28, isUnsigned: true)
!190 = !DIEnumerator(name: "scRGBColorspace", value: 29, isUnsigned: true)
!191 = !DIEnumerator(name: "HSIColorspace", value: 30, isUnsigned: true)
!192 = !DIEnumerator(name: "HSVColorspace", value: 31, isUnsigned: true)
!193 = !DIEnumerator(name: "HCLpColorspace", value: 32, isUnsigned: true)
!194 = !DIEnumerator(name: "YDbDrColorspace", value: 33, isUnsigned: true)
!195 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !196, line: 25, baseType: !12, size: 32, elements: !197)
!196 = !DIFile(filename: "./magick/compress.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!197 = !{!198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219}
!198 = !DIEnumerator(name: "UndefinedCompression", value: 0, isUnsigned: true)
!199 = !DIEnumerator(name: "NoCompression", value: 1, isUnsigned: true)
!200 = !DIEnumerator(name: "BZipCompression", value: 2, isUnsigned: true)
!201 = !DIEnumerator(name: "DXT1Compression", value: 3, isUnsigned: true)
!202 = !DIEnumerator(name: "DXT3Compression", value: 4, isUnsigned: true)
!203 = !DIEnumerator(name: "DXT5Compression", value: 5, isUnsigned: true)
!204 = !DIEnumerator(name: "FaxCompression", value: 6, isUnsigned: true)
!205 = !DIEnumerator(name: "Group4Compression", value: 7, isUnsigned: true)
!206 = !DIEnumerator(name: "JPEGCompression", value: 8, isUnsigned: true)
!207 = !DIEnumerator(name: "JPEG2000Compression", value: 9, isUnsigned: true)
!208 = !DIEnumerator(name: "LosslessJPEGCompression", value: 10, isUnsigned: true)
!209 = !DIEnumerator(name: "LZWCompression", value: 11, isUnsigned: true)
!210 = !DIEnumerator(name: "RLECompression", value: 12, isUnsigned: true)
!211 = !DIEnumerator(name: "ZipCompression", value: 13, isUnsigned: true)
!212 = !DIEnumerator(name: "ZipSCompression", value: 14, isUnsigned: true)
!213 = !DIEnumerator(name: "PizCompression", value: 15, isUnsigned: true)
!214 = !DIEnumerator(name: "Pxr24Compression", value: 16, isUnsigned: true)
!215 = !DIEnumerator(name: "B44Compression", value: 17, isUnsigned: true)
!216 = !DIEnumerator(name: "B44ACompression", value: 18, isUnsigned: true)
!217 = !DIEnumerator(name: "LZMACompression", value: 19, isUnsigned: true)
!218 = !DIEnumerator(name: "JBIG1Compression", value: 20, isUnsigned: true)
!219 = !DIEnumerator(name: "JBIG2Compression", value: 21, isUnsigned: true)
!220 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !221, line: 75, baseType: !12, size: 32, elements: !222)
!221 = !DIFile(filename: "./magick/image.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!222 = !{!223, !224, !225, !226, !227, !228, !229, !230, !231}
!223 = !DIEnumerator(name: "UndefinedOrientation", value: 0, isUnsigned: true)
!224 = !DIEnumerator(name: "TopLeftOrientation", value: 1, isUnsigned: true)
!225 = !DIEnumerator(name: "TopRightOrientation", value: 2, isUnsigned: true)
!226 = !DIEnumerator(name: "BottomRightOrientation", value: 3, isUnsigned: true)
!227 = !DIEnumerator(name: "BottomLeftOrientation", value: 4, isUnsigned: true)
!228 = !DIEnumerator(name: "LeftTopOrientation", value: 5, isUnsigned: true)
!229 = !DIEnumerator(name: "RightTopOrientation", value: 6, isUnsigned: true)
!230 = !DIEnumerator(name: "RightBottomOrientation", value: 7, isUnsigned: true)
!231 = !DIEnumerator(name: "LeftBottomOrientation", value: 8, isUnsigned: true)
!232 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !233, line: 42, baseType: !12, size: 32, elements: !234)
!233 = !DIFile(filename: "./magick/profile.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!234 = !{!235, !236, !237, !238, !239}
!235 = !DIEnumerator(name: "UndefinedIntent", value: 0, isUnsigned: true)
!236 = !DIEnumerator(name: "SaturationIntent", value: 1, isUnsigned: true)
!237 = !DIEnumerator(name: "PerceptualIntent", value: 2, isUnsigned: true)
!238 = !DIEnumerator(name: "AbsoluteIntent", value: 3, isUnsigned: true)
!239 = !DIEnumerator(name: "RelativeIntent", value: 4, isUnsigned: true)
!240 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !221, line: 88, baseType: !12, size: 32, elements: !241)
!241 = !{!242, !243, !244}
!242 = !DIEnumerator(name: "UndefinedResolution", value: 0, isUnsigned: true)
!243 = !DIEnumerator(name: "PixelsPerInchResolution", value: 1, isUnsigned: true)
!244 = !DIEnumerator(name: "PixelsPerCentimeterResolution", value: 2, isUnsigned: true)
!245 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !246, line: 32, baseType: !12, size: 32, elements: !247)
!246 = !DIFile(filename: "./magick/resample.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!247 = !{!248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279}
!248 = !DIEnumerator(name: "UndefinedFilter", value: 0, isUnsigned: true)
!249 = !DIEnumerator(name: "PointFilter", value: 1, isUnsigned: true)
!250 = !DIEnumerator(name: "BoxFilter", value: 2, isUnsigned: true)
!251 = !DIEnumerator(name: "TriangleFilter", value: 3, isUnsigned: true)
!252 = !DIEnumerator(name: "HermiteFilter", value: 4, isUnsigned: true)
!253 = !DIEnumerator(name: "HanningFilter", value: 5, isUnsigned: true)
!254 = !DIEnumerator(name: "HammingFilter", value: 6, isUnsigned: true)
!255 = !DIEnumerator(name: "BlackmanFilter", value: 7, isUnsigned: true)
!256 = !DIEnumerator(name: "GaussianFilter", value: 8, isUnsigned: true)
!257 = !DIEnumerator(name: "QuadraticFilter", value: 9, isUnsigned: true)
!258 = !DIEnumerator(name: "CubicFilter", value: 10, isUnsigned: true)
!259 = !DIEnumerator(name: "CatromFilter", value: 11, isUnsigned: true)
!260 = !DIEnumerator(name: "MitchellFilter", value: 12, isUnsigned: true)
!261 = !DIEnumerator(name: "JincFilter", value: 13, isUnsigned: true)
!262 = !DIEnumerator(name: "SincFilter", value: 14, isUnsigned: true)
!263 = !DIEnumerator(name: "SincFastFilter", value: 15, isUnsigned: true)
!264 = !DIEnumerator(name: "KaiserFilter", value: 16, isUnsigned: true)
!265 = !DIEnumerator(name: "WelshFilter", value: 17, isUnsigned: true)
!266 = !DIEnumerator(name: "ParzenFilter", value: 18, isUnsigned: true)
!267 = !DIEnumerator(name: "BohmanFilter", value: 19, isUnsigned: true)
!268 = !DIEnumerator(name: "BartlettFilter", value: 20, isUnsigned: true)
!269 = !DIEnumerator(name: "LagrangeFilter", value: 21, isUnsigned: true)
!270 = !DIEnumerator(name: "LanczosFilter", value: 22, isUnsigned: true)
!271 = !DIEnumerator(name: "LanczosSharpFilter", value: 23, isUnsigned: true)
!272 = !DIEnumerator(name: "Lanczos2Filter", value: 24, isUnsigned: true)
!273 = !DIEnumerator(name: "Lanczos2SharpFilter", value: 25, isUnsigned: true)
!274 = !DIEnumerator(name: "RobidouxFilter", value: 26, isUnsigned: true)
!275 = !DIEnumerator(name: "RobidouxSharpFilter", value: 27, isUnsigned: true)
!276 = !DIEnumerator(name: "CosineFilter", value: 28, isUnsigned: true)
!277 = !DIEnumerator(name: "SplineFilter", value: 29, isUnsigned: true)
!278 = !DIEnumerator(name: "LanczosRadiusFilter", value: 30, isUnsigned: true)
!279 = !DIEnumerator(name: "SentinelFilter", value: 31, isUnsigned: true)
!280 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !221, line: 63, baseType: !12, size: 32, elements: !281)
!281 = !{!282, !283, !284, !285, !286, !287, !288, !289}
!282 = !DIEnumerator(name: "UndefinedInterlace", value: 0, isUnsigned: true)
!283 = !DIEnumerator(name: "NoInterlace", value: 1, isUnsigned: true)
!284 = !DIEnumerator(name: "LineInterlace", value: 2, isUnsigned: true)
!285 = !DIEnumerator(name: "PlaneInterlace", value: 3, isUnsigned: true)
!286 = !DIEnumerator(name: "PartitionInterlace", value: 4, isUnsigned: true)
!287 = !DIEnumerator(name: "GIFInterlace", value: 5, isUnsigned: true)
!288 = !DIEnumerator(name: "JPEGInterlace", value: 6, isUnsigned: true)
!289 = !DIEnumerator(name: "PNGInterlace", value: 7, isUnsigned: true)
!290 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !291, line: 30, baseType: !12, size: 32, elements: !292)
!291 = !DIFile(filename: "./magick/quantum.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!292 = !{!293, !294, !295}
!293 = !DIEnumerator(name: "UndefinedEndian", value: 0, isUnsigned: true)
!294 = !DIEnumerator(name: "LSBEndian", value: 1, isUnsigned: true)
!295 = !DIEnumerator(name: "MSBEndian", value: 2, isUnsigned: true)
!296 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !297, line: 77, baseType: !12, size: 32, elements: !298)
!297 = !DIFile(filename: "./magick/geometry.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!298 = !{!299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310}
!299 = !DIEnumerator(name: "UndefinedGravity", value: 0, isUnsigned: true)
!300 = !DIEnumerator(name: "ForgetGravity", value: 0, isUnsigned: true)
!301 = !DIEnumerator(name: "NorthWestGravity", value: 1, isUnsigned: true)
!302 = !DIEnumerator(name: "NorthGravity", value: 2, isUnsigned: true)
!303 = !DIEnumerator(name: "NorthEastGravity", value: 3, isUnsigned: true)
!304 = !DIEnumerator(name: "WestGravity", value: 4, isUnsigned: true)
!305 = !DIEnumerator(name: "CenterGravity", value: 5, isUnsigned: true)
!306 = !DIEnumerator(name: "EastGravity", value: 6, isUnsigned: true)
!307 = !DIEnumerator(name: "SouthWestGravity", value: 7, isUnsigned: true)
!308 = !DIEnumerator(name: "SouthGravity", value: 8, isUnsigned: true)
!309 = !DIEnumerator(name: "SouthEastGravity", value: 9, isUnsigned: true)
!310 = !DIEnumerator(name: "StaticGravity", value: 10, isUnsigned: true)
!311 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !312, line: 25, baseType: !12, size: 32, elements: !313)
!312 = !DIFile(filename: "./magick/composite.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!313 = !{!314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381}
!314 = !DIEnumerator(name: "UndefinedCompositeOp", value: 0, isUnsigned: true)
!315 = !DIEnumerator(name: "NoCompositeOp", value: 1, isUnsigned: true)
!316 = !DIEnumerator(name: "ModulusAddCompositeOp", value: 2, isUnsigned: true)
!317 = !DIEnumerator(name: "AtopCompositeOp", value: 3, isUnsigned: true)
!318 = !DIEnumerator(name: "BlendCompositeOp", value: 4, isUnsigned: true)
!319 = !DIEnumerator(name: "BumpmapCompositeOp", value: 5, isUnsigned: true)
!320 = !DIEnumerator(name: "ChangeMaskCompositeOp", value: 6, isUnsigned: true)
!321 = !DIEnumerator(name: "ClearCompositeOp", value: 7, isUnsigned: true)
!322 = !DIEnumerator(name: "ColorBurnCompositeOp", value: 8, isUnsigned: true)
!323 = !DIEnumerator(name: "ColorDodgeCompositeOp", value: 9, isUnsigned: true)
!324 = !DIEnumerator(name: "ColorizeCompositeOp", value: 10, isUnsigned: true)
!325 = !DIEnumerator(name: "CopyBlackCompositeOp", value: 11, isUnsigned: true)
!326 = !DIEnumerator(name: "CopyBlueCompositeOp", value: 12, isUnsigned: true)
!327 = !DIEnumerator(name: "CopyCompositeOp", value: 13, isUnsigned: true)
!328 = !DIEnumerator(name: "CopyCyanCompositeOp", value: 14, isUnsigned: true)
!329 = !DIEnumerator(name: "CopyGreenCompositeOp", value: 15, isUnsigned: true)
!330 = !DIEnumerator(name: "CopyMagentaCompositeOp", value: 16, isUnsigned: true)
!331 = !DIEnumerator(name: "CopyOpacityCompositeOp", value: 17, isUnsigned: true)
!332 = !DIEnumerator(name: "CopyRedCompositeOp", value: 18, isUnsigned: true)
!333 = !DIEnumerator(name: "CopyYellowCompositeOp", value: 19, isUnsigned: true)
!334 = !DIEnumerator(name: "DarkenCompositeOp", value: 20, isUnsigned: true)
!335 = !DIEnumerator(name: "DstAtopCompositeOp", value: 21, isUnsigned: true)
!336 = !DIEnumerator(name: "DstCompositeOp", value: 22, isUnsigned: true)
!337 = !DIEnumerator(name: "DstInCompositeOp", value: 23, isUnsigned: true)
!338 = !DIEnumerator(name: "DstOutCompositeOp", value: 24, isUnsigned: true)
!339 = !DIEnumerator(name: "DstOverCompositeOp", value: 25, isUnsigned: true)
!340 = !DIEnumerator(name: "DifferenceCompositeOp", value: 26, isUnsigned: true)
!341 = !DIEnumerator(name: "DisplaceCompositeOp", value: 27, isUnsigned: true)
!342 = !DIEnumerator(name: "DissolveCompositeOp", value: 28, isUnsigned: true)
!343 = !DIEnumerator(name: "ExclusionCompositeOp", value: 29, isUnsigned: true)
!344 = !DIEnumerator(name: "HardLightCompositeOp", value: 30, isUnsigned: true)
!345 = !DIEnumerator(name: "HueCompositeOp", value: 31, isUnsigned: true)
!346 = !DIEnumerator(name: "InCompositeOp", value: 32, isUnsigned: true)
!347 = !DIEnumerator(name: "LightenCompositeOp", value: 33, isUnsigned: true)
!348 = !DIEnumerator(name: "LinearLightCompositeOp", value: 34, isUnsigned: true)
!349 = !DIEnumerator(name: "LuminizeCompositeOp", value: 35, isUnsigned: true)
!350 = !DIEnumerator(name: "MinusDstCompositeOp", value: 36, isUnsigned: true)
!351 = !DIEnumerator(name: "ModulateCompositeOp", value: 37, isUnsigned: true)
!352 = !DIEnumerator(name: "MultiplyCompositeOp", value: 38, isUnsigned: true)
!353 = !DIEnumerator(name: "OutCompositeOp", value: 39, isUnsigned: true)
!354 = !DIEnumerator(name: "OverCompositeOp", value: 40, isUnsigned: true)
!355 = !DIEnumerator(name: "OverlayCompositeOp", value: 41, isUnsigned: true)
!356 = !DIEnumerator(name: "PlusCompositeOp", value: 42, isUnsigned: true)
!357 = !DIEnumerator(name: "ReplaceCompositeOp", value: 43, isUnsigned: true)
!358 = !DIEnumerator(name: "SaturateCompositeOp", value: 44, isUnsigned: true)
!359 = !DIEnumerator(name: "ScreenCompositeOp", value: 45, isUnsigned: true)
!360 = !DIEnumerator(name: "SoftLightCompositeOp", value: 46, isUnsigned: true)
!361 = !DIEnumerator(name: "SrcAtopCompositeOp", value: 47, isUnsigned: true)
!362 = !DIEnumerator(name: "SrcCompositeOp", value: 48, isUnsigned: true)
!363 = !DIEnumerator(name: "SrcInCompositeOp", value: 49, isUnsigned: true)
!364 = !DIEnumerator(name: "SrcOutCompositeOp", value: 50, isUnsigned: true)
!365 = !DIEnumerator(name: "SrcOverCompositeOp", value: 51, isUnsigned: true)
!366 = !DIEnumerator(name: "ModulusSubtractCompositeOp", value: 52, isUnsigned: true)
!367 = !DIEnumerator(name: "ThresholdCompositeOp", value: 53, isUnsigned: true)
!368 = !DIEnumerator(name: "XorCompositeOp", value: 54, isUnsigned: true)
!369 = !DIEnumerator(name: "DivideDstCompositeOp", value: 55, isUnsigned: true)
!370 = !DIEnumerator(name: "DistortCompositeOp", value: 56, isUnsigned: true)
!371 = !DIEnumerator(name: "BlurCompositeOp", value: 57, isUnsigned: true)
!372 = !DIEnumerator(name: "PegtopLightCompositeOp", value: 58, isUnsigned: true)
!373 = !DIEnumerator(name: "VividLightCompositeOp", value: 59, isUnsigned: true)
!374 = !DIEnumerator(name: "PinLightCompositeOp", value: 60, isUnsigned: true)
!375 = !DIEnumerator(name: "LinearDodgeCompositeOp", value: 61, isUnsigned: true)
!376 = !DIEnumerator(name: "LinearBurnCompositeOp", value: 62, isUnsigned: true)
!377 = !DIEnumerator(name: "MathematicsCompositeOp", value: 63, isUnsigned: true)
!378 = !DIEnumerator(name: "DivideSrcCompositeOp", value: 64, isUnsigned: true)
!379 = !DIEnumerator(name: "MinusSrcCompositeOp", value: 65, isUnsigned: true)
!380 = !DIEnumerator(name: "DarkenIntensityCompositeOp", value: 66, isUnsigned: true)
!381 = !DIEnumerator(name: "LightenIntensityCompositeOp", value: 67, isUnsigned: true)
!382 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !383, line: 25, baseType: !12, size: 32, elements: !384)
!383 = !DIFile(filename: "./magick/layer.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!384 = !{!385, !386, !387, !388, !389}
!385 = !DIEnumerator(name: "UnrecognizedDispose", value: 0, isUnsigned: true)
!386 = !DIEnumerator(name: "UndefinedDispose", value: 0, isUnsigned: true)
!387 = !DIEnumerator(name: "NoneDispose", value: 1, isUnsigned: true)
!388 = !DIEnumerator(name: "BackgroundDispose", value: 2, isUnsigned: true)
!389 = !DIEnumerator(name: "PreviousDispose", value: 3, isUnsigned: true)
!390 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !391, line: 25, baseType: !12, size: 32, elements: !392)
!391 = !DIFile(filename: "./magick/timer.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!392 = !{!393, !394, !395}
!393 = !DIEnumerator(name: "UndefinedTimerState", value: 0, isUnsigned: true)
!394 = !DIEnumerator(name: "StoppedTimerState", value: 1, isUnsigned: true)
!395 = !DIEnumerator(name: "RunningTimerState", value: 2, isUnsigned: true)
!396 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !397, line: 31, baseType: !12, size: 32, elements: !398)
!397 = !DIFile(filename: "./magick/pixel.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!398 = !{!399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412}
!399 = !DIEnumerator(name: "UndefinedInterpolatePixel", value: 0, isUnsigned: true)
!400 = !DIEnumerator(name: "AverageInterpolatePixel", value: 1, isUnsigned: true)
!401 = !DIEnumerator(name: "BicubicInterpolatePixel", value: 2, isUnsigned: true)
!402 = !DIEnumerator(name: "BilinearInterpolatePixel", value: 3, isUnsigned: true)
!403 = !DIEnumerator(name: "FilterInterpolatePixel", value: 4, isUnsigned: true)
!404 = !DIEnumerator(name: "IntegerInterpolatePixel", value: 5, isUnsigned: true)
!405 = !DIEnumerator(name: "MeshInterpolatePixel", value: 6, isUnsigned: true)
!406 = !DIEnumerator(name: "NearestNeighborInterpolatePixel", value: 7, isUnsigned: true)
!407 = !DIEnumerator(name: "SplineInterpolatePixel", value: 8, isUnsigned: true)
!408 = !DIEnumerator(name: "Average9InterpolatePixel", value: 9, isUnsigned: true)
!409 = !DIEnumerator(name: "Average16InterpolatePixel", value: 10, isUnsigned: true)
!410 = !DIEnumerator(name: "BlendInterpolatePixel", value: 11, isUnsigned: true)
!411 = !DIEnumerator(name: "BackgroundInterpolatePixel", value: 12, isUnsigned: true)
!412 = !DIEnumerator(name: "CatromInterpolatePixel", value: 13, isUnsigned: true)
!413 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !221, line: 47, baseType: !12, size: 32, elements: !414)
!414 = !{!415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426}
!415 = !DIEnumerator(name: "UndefinedType", value: 0, isUnsigned: true)
!416 = !DIEnumerator(name: "BilevelType", value: 1, isUnsigned: true)
!417 = !DIEnumerator(name: "GrayscaleType", value: 2, isUnsigned: true)
!418 = !DIEnumerator(name: "GrayscaleMatteType", value: 3, isUnsigned: true)
!419 = !DIEnumerator(name: "PaletteType", value: 4, isUnsigned: true)
!420 = !DIEnumerator(name: "PaletteMatteType", value: 5, isUnsigned: true)
!421 = !DIEnumerator(name: "TrueColorType", value: 6, isUnsigned: true)
!422 = !DIEnumerator(name: "TrueColorMatteType", value: 7, isUnsigned: true)
!423 = !DIEnumerator(name: "ColorSeparationType", value: 8, isUnsigned: true)
!424 = !DIEnumerator(name: "ColorSeparationMatteType", value: 9, isUnsigned: true)
!425 = !DIEnumerator(name: "OptimizeType", value: 10, isUnsigned: true)
!426 = !DIEnumerator(name: "PaletteBilevelMatteType", value: 11, isUnsigned: true)
!427 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !397, line: 67, baseType: !12, size: 32, elements: !428)
!428 = !{!429, !430, !431, !432, !433, !434, !435, !436, !437, !438}
!429 = !DIEnumerator(name: "UndefinedPixelIntensityMethod", value: 0, isUnsigned: true)
!430 = !DIEnumerator(name: "AveragePixelIntensityMethod", value: 1, isUnsigned: true)
!431 = !DIEnumerator(name: "BrightnessPixelIntensityMethod", value: 2, isUnsigned: true)
!432 = !DIEnumerator(name: "LightnessPixelIntensityMethod", value: 3, isUnsigned: true)
!433 = !DIEnumerator(name: "Rec601LumaPixelIntensityMethod", value: 4, isUnsigned: true)
!434 = !DIEnumerator(name: "Rec601LuminancePixelIntensityMethod", value: 5, isUnsigned: true)
!435 = !DIEnumerator(name: "Rec709LumaPixelIntensityMethod", value: 6, isUnsigned: true)
!436 = !DIEnumerator(name: "Rec709LuminancePixelIntensityMethod", value: 7, isUnsigned: true)
!437 = !DIEnumerator(name: "RMSPixelIntensityMethod", value: 8, isUnsigned: true)
!438 = !DIEnumerator(name: "MSPixelIntensityMethod", value: 9, isUnsigned: true)
!439 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !291, line: 44, baseType: !12, size: 32, elements: !440)
!440 = !{!441, !442, !443, !444}
!441 = !DIEnumerator(name: "UndefinedQuantumFormat", value: 0, isUnsigned: true)
!442 = !DIEnumerator(name: "FloatingPointQuantumFormat", value: 1, isUnsigned: true)
!443 = !DIEnumerator(name: "SignedQuantumFormat", value: 2, isUnsigned: true)
!444 = !DIEnumerator(name: "UnsignedQuantumFormat", value: 3, isUnsigned: true)
!445 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !291, line: 37, baseType: !12, size: 32, elements: !446)
!446 = !{!447, !448, !449}
!447 = !DIEnumerator(name: "UndefinedQuantumAlpha", value: 0, isUnsigned: true)
!448 = !DIEnumerator(name: "AssociatedQuantumAlpha", value: 1, isUnsigned: true)
!449 = !DIEnumerator(name: "DisassociatedQuantumAlpha", value: 2, isUnsigned: true)
!450 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !291, line: 52, baseType: !12, size: 32, elements: !451)
!451 = !{!452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479}
!452 = !DIEnumerator(name: "UndefinedQuantum", value: 0, isUnsigned: true)
!453 = !DIEnumerator(name: "AlphaQuantum", value: 1, isUnsigned: true)
!454 = !DIEnumerator(name: "BlackQuantum", value: 2, isUnsigned: true)
!455 = !DIEnumerator(name: "BlueQuantum", value: 3, isUnsigned: true)
!456 = !DIEnumerator(name: "CMYKAQuantum", value: 4, isUnsigned: true)
!457 = !DIEnumerator(name: "CMYKQuantum", value: 5, isUnsigned: true)
!458 = !DIEnumerator(name: "CyanQuantum", value: 6, isUnsigned: true)
!459 = !DIEnumerator(name: "GrayAlphaQuantum", value: 7, isUnsigned: true)
!460 = !DIEnumerator(name: "GrayQuantum", value: 8, isUnsigned: true)
!461 = !DIEnumerator(name: "GreenQuantum", value: 9, isUnsigned: true)
!462 = !DIEnumerator(name: "IndexAlphaQuantum", value: 10, isUnsigned: true)
!463 = !DIEnumerator(name: "IndexQuantum", value: 11, isUnsigned: true)
!464 = !DIEnumerator(name: "MagentaQuantum", value: 12, isUnsigned: true)
!465 = !DIEnumerator(name: "OpacityQuantum", value: 13, isUnsigned: true)
!466 = !DIEnumerator(name: "RedQuantum", value: 14, isUnsigned: true)
!467 = !DIEnumerator(name: "RGBAQuantum", value: 15, isUnsigned: true)
!468 = !DIEnumerator(name: "BGRAQuantum", value: 16, isUnsigned: true)
!469 = !DIEnumerator(name: "RGBOQuantum", value: 17, isUnsigned: true)
!470 = !DIEnumerator(name: "RGBQuantum", value: 18, isUnsigned: true)
!471 = !DIEnumerator(name: "YellowQuantum", value: 19, isUnsigned: true)
!472 = !DIEnumerator(name: "GrayPadQuantum", value: 20, isUnsigned: true)
!473 = !DIEnumerator(name: "RGBPadQuantum", value: 21, isUnsigned: true)
!474 = !DIEnumerator(name: "CbYCrYQuantum", value: 22, isUnsigned: true)
!475 = !DIEnumerator(name: "CbYCrQuantum", value: 23, isUnsigned: true)
!476 = !DIEnumerator(name: "CbYCrAQuantum", value: 24, isUnsigned: true)
!477 = !DIEnumerator(name: "CMYKOQuantum", value: 25, isUnsigned: true)
!478 = !DIEnumerator(name: "BGRQuantum", value: 26, isUnsigned: true)
!479 = !DIEnumerator(name: "BGROQuantum", value: 27, isUnsigned: true)
!480 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !481, line: 27, baseType: !12, size: 32, elements: !482)
!481 = !DIFile(filename: "./magick/effect.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!482 = !{!483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512}
!483 = !DIEnumerator(name: "UndefinedPreview", value: 0, isUnsigned: true)
!484 = !DIEnumerator(name: "RotatePreview", value: 1, isUnsigned: true)
!485 = !DIEnumerator(name: "ShearPreview", value: 2, isUnsigned: true)
!486 = !DIEnumerator(name: "RollPreview", value: 3, isUnsigned: true)
!487 = !DIEnumerator(name: "HuePreview", value: 4, isUnsigned: true)
!488 = !DIEnumerator(name: "SaturationPreview", value: 5, isUnsigned: true)
!489 = !DIEnumerator(name: "BrightnessPreview", value: 6, isUnsigned: true)
!490 = !DIEnumerator(name: "GammaPreview", value: 7, isUnsigned: true)
!491 = !DIEnumerator(name: "SpiffPreview", value: 8, isUnsigned: true)
!492 = !DIEnumerator(name: "DullPreview", value: 9, isUnsigned: true)
!493 = !DIEnumerator(name: "GrayscalePreview", value: 10, isUnsigned: true)
!494 = !DIEnumerator(name: "QuantizePreview", value: 11, isUnsigned: true)
!495 = !DIEnumerator(name: "DespecklePreview", value: 12, isUnsigned: true)
!496 = !DIEnumerator(name: "ReduceNoisePreview", value: 13, isUnsigned: true)
!497 = !DIEnumerator(name: "AddNoisePreview", value: 14, isUnsigned: true)
!498 = !DIEnumerator(name: "SharpenPreview", value: 15, isUnsigned: true)
!499 = !DIEnumerator(name: "BlurPreview", value: 16, isUnsigned: true)
!500 = !DIEnumerator(name: "ThresholdPreview", value: 17, isUnsigned: true)
!501 = !DIEnumerator(name: "EdgeDetectPreview", value: 18, isUnsigned: true)
!502 = !DIEnumerator(name: "SpreadPreview", value: 19, isUnsigned: true)
!503 = !DIEnumerator(name: "SolarizePreview", value: 20, isUnsigned: true)
!504 = !DIEnumerator(name: "ShadePreview", value: 21, isUnsigned: true)
!505 = !DIEnumerator(name: "RaisePreview", value: 22, isUnsigned: true)
!506 = !DIEnumerator(name: "SegmentPreview", value: 23, isUnsigned: true)
!507 = !DIEnumerator(name: "SwirlPreview", value: 24, isUnsigned: true)
!508 = !DIEnumerator(name: "ImplodePreview", value: 25, isUnsigned: true)
!509 = !DIEnumerator(name: "WavePreview", value: 26, isUnsigned: true)
!510 = !DIEnumerator(name: "OilPaintPreview", value: 27, isUnsigned: true)
!511 = !DIEnumerator(name: "CharcoalDrawingPreview", value: 28, isUnsigned: true)
!512 = !DIEnumerator(name: "JPEGPreview", value: 29, isUnsigned: true)
!513 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !41, line: 177, baseType: !12, size: 32, elements: !514)
!514 = !{!515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534}
!515 = !DIEnumerator(name: "UndefinedChannel", value: 0, isUnsigned: true)
!516 = !DIEnumerator(name: "RedChannel", value: 1, isUnsigned: true)
!517 = !DIEnumerator(name: "GrayChannel", value: 1, isUnsigned: true)
!518 = !DIEnumerator(name: "CyanChannel", value: 1, isUnsigned: true)
!519 = !DIEnumerator(name: "GreenChannel", value: 2, isUnsigned: true)
!520 = !DIEnumerator(name: "MagentaChannel", value: 2, isUnsigned: true)
!521 = !DIEnumerator(name: "BlueChannel", value: 4, isUnsigned: true)
!522 = !DIEnumerator(name: "YellowChannel", value: 4, isUnsigned: true)
!523 = !DIEnumerator(name: "AlphaChannel", value: 8, isUnsigned: true)
!524 = !DIEnumerator(name: "OpacityChannel", value: 8, isUnsigned: true)
!525 = !DIEnumerator(name: "MatteChannel", value: 8, isUnsigned: true)
!526 = !DIEnumerator(name: "BlackChannel", value: 32, isUnsigned: true)
!527 = !DIEnumerator(name: "IndexChannel", value: 32, isUnsigned: true)
!528 = !DIEnumerator(name: "CompositeChannels", value: 47, isUnsigned: true)
!529 = !DIEnumerator(name: "AllChannels", value: 134217727, isUnsigned: true)
!530 = !DIEnumerator(name: "TrueAlphaChannel", value: 64, isUnsigned: true)
!531 = !DIEnumerator(name: "RGBChannels", value: 128, isUnsigned: true)
!532 = !DIEnumerator(name: "GrayChannels", value: 128, isUnsigned: true)
!533 = !DIEnumerator(name: "SyncChannels", value: 256, isUnsigned: true)
!534 = !DIEnumerator(name: "DefaultChannels", value: 134217719, isUnsigned: true)
!535 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !536, line: 27, baseType: !12, size: 32, elements: !537)
!536 = !DIFile(filename: "./magick/cache-view.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!537 = !{!538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555}
!538 = !DIEnumerator(name: "UndefinedVirtualPixelMethod", value: 0, isUnsigned: true)
!539 = !DIEnumerator(name: "BackgroundVirtualPixelMethod", value: 1, isUnsigned: true)
!540 = !DIEnumerator(name: "ConstantVirtualPixelMethod", value: 2, isUnsigned: true)
!541 = !DIEnumerator(name: "DitherVirtualPixelMethod", value: 3, isUnsigned: true)
!542 = !DIEnumerator(name: "EdgeVirtualPixelMethod", value: 4, isUnsigned: true)
!543 = !DIEnumerator(name: "MirrorVirtualPixelMethod", value: 5, isUnsigned: true)
!544 = !DIEnumerator(name: "RandomVirtualPixelMethod", value: 6, isUnsigned: true)
!545 = !DIEnumerator(name: "TileVirtualPixelMethod", value: 7, isUnsigned: true)
!546 = !DIEnumerator(name: "TransparentVirtualPixelMethod", value: 8, isUnsigned: true)
!547 = !DIEnumerator(name: "MaskVirtualPixelMethod", value: 9, isUnsigned: true)
!548 = !DIEnumerator(name: "BlackVirtualPixelMethod", value: 10, isUnsigned: true)
!549 = !DIEnumerator(name: "GrayVirtualPixelMethod", value: 11, isUnsigned: true)
!550 = !DIEnumerator(name: "WhiteVirtualPixelMethod", value: 12, isUnsigned: true)
!551 = !DIEnumerator(name: "HorizontalTileVirtualPixelMethod", value: 13, isUnsigned: true)
!552 = !DIEnumerator(name: "VerticalTileVirtualPixelMethod", value: 14, isUnsigned: true)
!553 = !DIEnumerator(name: "HorizontalTileEdgeVirtualPixelMethod", value: 15, isUnsigned: true)
!554 = !DIEnumerator(name: "VerticalTileEdgeVirtualPixelMethod", value: 16, isUnsigned: true)
!555 = !DIEnumerator(name: "CheckerTileVirtualPixelMethod", value: 17, isUnsigned: true)
!556 = !{!6, !557, !31, !558, !35, !559, !47, !15, !27, !12, !560, !897, !624, !931}
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!558 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64)
!561 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !562)
!562 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageInfo", file: !41, line: 223, baseType: !563)
!563 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ImageInfo", file: !221, line: 356, size: 134336, elements: !564)
!564 = !{!565, !567, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !582, !584, !586, !587, !588, !589, !590, !591, !592, !594, !595, !605, !606, !607, !608, !609, !610, !612, !614, !616, !617, !618, !619, !620, !621, !623, !811, !812, !813, !814, !815, !826, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !894, !895, !896}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !563, file: !221, line: 359, baseType: !566, size: 32)
!566 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompressionType", file: !196, line: 49, baseType: !195)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !563, file: !221, line: 362, baseType: !568, size: 32, offset: 32)
!568 = !DIDerivedType(tag: DW_TAG_typedef, name: "OrientationType", file: !221, line: 86, baseType: !220)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "temporary", scope: !563, file: !221, line: 365, baseType: !40, size: 32, offset: 64)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "adjoin", scope: !563, file: !221, line: 366, baseType: !40, size: 32, offset: 96)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "affirm", scope: !563, file: !221, line: 367, baseType: !40, size: 32, offset: 128)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "antialias", scope: !563, file: !221, line: 368, baseType: !40, size: 32, offset: 160)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !563, file: !221, line: 371, baseType: !559, size: 64, offset: 192)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "extract", scope: !563, file: !221, line: 372, baseType: !559, size: 64, offset: 256)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !563, file: !221, line: 373, baseType: !559, size: 64, offset: 320)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "scenes", scope: !563, file: !221, line: 374, baseType: !559, size: 64, offset: 384)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !563, file: !221, line: 377, baseType: !29, size: 64, offset: 448)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "number_scenes", scope: !563, file: !221, line: 378, baseType: !29, size: 64, offset: 512)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !563, file: !221, line: 379, baseType: !29, size: 64, offset: 576)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "interlace", scope: !563, file: !221, line: 382, baseType: !581, size: 32, offset: 640)
!581 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterlaceType", file: !221, line: 73, baseType: !280)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !563, file: !221, line: 385, baseType: !583, size: 32, offset: 672)
!583 = !DIDerivedType(tag: DW_TAG_typedef, name: "EndianType", file: !291, line: 35, baseType: !290)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !563, file: !221, line: 388, baseType: !585, size: 32, offset: 704)
!585 = !DIDerivedType(tag: DW_TAG_typedef, name: "ResolutionType", file: !221, line: 93, baseType: !240)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !563, file: !221, line: 391, baseType: !29, size: 64, offset: 768)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "sampling_factor", scope: !563, file: !221, line: 394, baseType: !559, size: 64, offset: 832)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "server_name", scope: !563, file: !221, line: 395, baseType: !559, size: 64, offset: 896)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "font", scope: !563, file: !221, line: 396, baseType: !559, size: 64, offset: 960)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "texture", scope: !563, file: !221, line: 397, baseType: !559, size: 64, offset: 1024)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "density", scope: !563, file: !221, line: 398, baseType: !559, size: 64, offset: 1088)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "pointsize", scope: !563, file: !221, line: 401, baseType: !593, size: 64, offset: 1152)
!593 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !563, file: !221, line: 402, baseType: !593, size: 64, offset: 1216)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "background_color", scope: !563, file: !221, line: 405, baseType: !596, size: 64, offset: 1280)
!596 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelPacket", file: !397, line: 148, baseType: !597)
!597 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PixelPacket", file: !397, line: 131, size: 64, elements: !598)
!598 = !{!599, !602, !603, !604}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !597, file: !397, line: 143, baseType: !600, size: 16)
!600 = !DIDerivedType(tag: DW_TAG_typedef, name: "Quantum", file: !41, line: 93, baseType: !601)
!601 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !597, file: !397, line: 144, baseType: !600, size: 16, offset: 16)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !597, file: !397, line: 145, baseType: !600, size: 16, offset: 32)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !597, file: !397, line: 146, baseType: !600, size: 16, offset: 48)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !563, file: !221, line: 406, baseType: !596, size: 64, offset: 1344)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "matte_color", scope: !563, file: !221, line: 407, baseType: !596, size: 64, offset: 1408)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !563, file: !221, line: 410, baseType: !40, size: 32, offset: 1472)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "monochrome", scope: !563, file: !221, line: 411, baseType: !40, size: 32, offset: 1504)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !563, file: !221, line: 414, baseType: !29, size: 64, offset: 1536)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !563, file: !221, line: 417, baseType: !611, size: 32, offset: 1600)
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorspaceType", file: !159, line: 61, baseType: !158)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !563, file: !221, line: 420, baseType: !613, size: 32, offset: 1632)
!613 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageType", file: !221, line: 61, baseType: !413)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "preview_type", scope: !563, file: !221, line: 423, baseType: !615, size: 32, offset: 1664)
!615 = !DIDerivedType(tag: DW_TAG_typedef, name: "PreviewType", file: !481, line: 59, baseType: !480)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !563, file: !221, line: 426, baseType: !47, size: 64, offset: 1728)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "ping", scope: !563, file: !221, line: 429, baseType: !40, size: 32, offset: 1792)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !563, file: !221, line: 430, baseType: !40, size: 32, offset: 1824)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !563, file: !221, line: 433, baseType: !559, size: 64, offset: 1856)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "authenticate", scope: !563, file: !221, line: 434, baseType: !559, size: 64, offset: 1920)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !563, file: !221, line: 437, baseType: !622, size: 32, offset: 1984)
!622 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChannelType", file: !41, line: 202, baseType: !513)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !563, file: !221, line: 440, baseType: !624, size: 64, offset: 2048)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 64)
!625 = !DIDerivedType(tag: DW_TAG_typedef, name: "Image", file: !41, line: 221, baseType: !626)
!626 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Image", file: !221, line: 150, size: 105920, elements: !627)
!627 = !{!628, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !642, !643, !644, !645, !646, !660, !662, !663, !664, !665, !666, !667, !668, !669, !670, !678, !679, !680, !681, !682, !683, !685, !686, !687, !689, !691, !693, !695, !696, !697, !698, !699, !700, !701, !709, !724, !738, !739, !740, !741, !745, !749, !750, !751, !752, !753, !754, !771, !772, !774, !775, !783, !784, !786, !787, !788, !789, !790, !791, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !808, !810}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "storage_class", scope: !626, file: !221, line: 153, baseType: !629, size: 32)
!629 = !DIDerivedType(tag: DW_TAG_typedef, name: "ClassType", file: !41, line: 209, baseType: !153)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !626, file: !221, line: 156, baseType: !611, size: 32, offset: 32)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !626, file: !221, line: 159, baseType: !566, size: 32, offset: 64)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !626, file: !221, line: 162, baseType: !29, size: 64, offset: 128)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !626, file: !221, line: 165, baseType: !568, size: 32, offset: 192)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "taint", scope: !626, file: !221, line: 168, baseType: !40, size: 32, offset: 224)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "matte", scope: !626, file: !221, line: 169, baseType: !40, size: 32, offset: 256)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !626, file: !221, line: 172, baseType: !29, size: 64, offset: 320)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !626, file: !221, line: 173, baseType: !29, size: 64, offset: 384)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !626, file: !221, line: 174, baseType: !29, size: 64, offset: 448)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !626, file: !221, line: 175, baseType: !29, size: 64, offset: 512)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "colormap", scope: !626, file: !221, line: 178, baseType: !641, size: 64, offset: 576)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "background_color", scope: !626, file: !221, line: 179, baseType: !596, size: 64, offset: 640)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !626, file: !221, line: 180, baseType: !596, size: 64, offset: 704)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "matte_color", scope: !626, file: !221, line: 181, baseType: !596, size: 64, offset: 768)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !626, file: !221, line: 184, baseType: !593, size: 64, offset: 832)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "chromaticity", scope: !626, file: !221, line: 187, baseType: !647, size: 768, offset: 896)
!647 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChromaticityInfo", file: !221, line: 128, baseType: !648)
!648 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ChromaticityInfo", file: !221, line: 121, size: 768, elements: !649)
!649 = !{!650, !657, !658, !659}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "red_primary", scope: !648, file: !221, line: 124, baseType: !651, size: 192)
!651 = !DIDerivedType(tag: DW_TAG_typedef, name: "PrimaryInfo", file: !221, line: 101, baseType: !652)
!652 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PrimaryInfo", file: !221, line: 95, size: 192, elements: !653)
!653 = !{!654, !655, !656}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !652, file: !221, line: 98, baseType: !593, size: 64)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !652, file: !221, line: 99, baseType: !593, size: 64, offset: 64)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !652, file: !221, line: 100, baseType: !593, size: 64, offset: 128)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "green_primary", scope: !648, file: !221, line: 125, baseType: !651, size: 192, offset: 192)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "blue_primary", scope: !648, file: !221, line: 126, baseType: !651, size: 192, offset: 384)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "white_point", scope: !648, file: !221, line: 127, baseType: !651, size: 192, offset: 576)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "rendering_intent", scope: !626, file: !221, line: 190, baseType: !661, size: 32, offset: 1664)
!661 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderingIntent", file: !233, line: 49, baseType: !232)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !626, file: !221, line: 193, baseType: !557, size: 64, offset: 1728)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !626, file: !221, line: 196, baseType: !585, size: 32, offset: 1792)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "montage", scope: !626, file: !221, line: 199, baseType: !559, size: 64, offset: 1856)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "directory", scope: !626, file: !221, line: 200, baseType: !559, size: 64, offset: 1920)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "geometry", scope: !626, file: !221, line: 201, baseType: !559, size: 64, offset: 1984)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !626, file: !221, line: 204, baseType: !47, size: 64, offset: 2048)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "x_resolution", scope: !626, file: !221, line: 207, baseType: !593, size: 64, offset: 2112)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "y_resolution", scope: !626, file: !221, line: 208, baseType: !593, size: 64, offset: 2176)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !626, file: !221, line: 211, baseType: !671, size: 256, offset: 2240)
!671 = !DIDerivedType(tag: DW_TAG_typedef, name: "RectangleInfo", file: !297, line: 130, baseType: !672)
!672 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_RectangleInfo", file: !297, line: 121, size: 256, elements: !673)
!673 = !{!674, !675, !676, !677}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !672, file: !297, line: 124, baseType: !29, size: 64)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !672, file: !297, line: 125, baseType: !29, size: 64, offset: 64)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !672, file: !297, line: 128, baseType: !47, size: 64, offset: 128)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !672, file: !297, line: 129, baseType: !47, size: 64, offset: 192)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "extract_info", scope: !626, file: !221, line: 212, baseType: !671, size: 256, offset: 2496)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "tile_info", scope: !626, file: !221, line: 213, baseType: !671, size: 256, offset: 2752)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "bias", scope: !626, file: !221, line: 216, baseType: !593, size: 64, offset: 3008)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "blur", scope: !626, file: !221, line: 217, baseType: !593, size: 64, offset: 3072)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !626, file: !221, line: 218, baseType: !593, size: 64, offset: 3136)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !626, file: !221, line: 221, baseType: !684, size: 32, offset: 3200)
!684 = !DIDerivedType(tag: DW_TAG_typedef, name: "FilterTypes", file: !246, line: 66, baseType: !245)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "interlace", scope: !626, file: !221, line: 224, baseType: !581, size: 32, offset: 3232)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !626, file: !221, line: 227, baseType: !583, size: 32, offset: 3264)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !626, file: !221, line: 230, baseType: !688, size: 32, offset: 3296)
!688 = !DIDerivedType(tag: DW_TAG_typedef, name: "GravityType", file: !297, line: 91, baseType: !296)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !626, file: !221, line: 233, baseType: !690, size: 32, offset: 3328)
!690 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompositeOperator", file: !312, line: 99, baseType: !311)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "dispose", scope: !626, file: !221, line: 236, baseType: !692, size: 32, offset: 3360)
!692 = !DIDerivedType(tag: DW_TAG_typedef, name: "DisposeType", file: !383, line: 32, baseType: !382)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "clip_mask", scope: !626, file: !221, line: 239, baseType: !694, size: 64, offset: 3392)
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 64)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !626, file: !221, line: 242, baseType: !29, size: 64, offset: 3456)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !626, file: !221, line: 243, baseType: !29, size: 64, offset: 3520)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_second", scope: !626, file: !221, line: 246, baseType: !47, size: 64, offset: 3584)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "iterations", scope: !626, file: !221, line: 249, baseType: !29, size: 64, offset: 3648)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "total_colors", scope: !626, file: !221, line: 250, baseType: !29, size: 64, offset: 3712)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "start_loop", scope: !626, file: !221, line: 253, baseType: !47, size: 64, offset: 3776)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !626, file: !221, line: 256, baseType: !702, size: 192, offset: 3840)
!702 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErrorInfo", file: !703, line: 68, baseType: !704)
!703 = !DIFile(filename: "./magick/color.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!704 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ErrorInfo", file: !703, line: 62, size: 192, elements: !705)
!705 = !{!706, !707, !708}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "mean_error_per_pixel", scope: !704, file: !703, line: 65, baseType: !593, size: 64)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_mean_error", scope: !704, file: !703, line: 66, baseType: !593, size: 64, offset: 64)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_maximum_error", scope: !704, file: !703, line: 67, baseType: !593, size: 64, offset: 128)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !626, file: !221, line: 259, baseType: !710, size: 512, offset: 4032)
!710 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerInfo", file: !391, line: 51, baseType: !711)
!711 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TimerInfo", file: !391, line: 40, size: 512, elements: !712)
!712 = !{!713, !720, !721, !723}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !711, file: !391, line: 43, baseType: !714, size: 192)
!714 = !DIDerivedType(tag: DW_TAG_typedef, name: "Timer", file: !391, line: 38, baseType: !715)
!715 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Timer", file: !391, line: 32, size: 192, elements: !716)
!716 = !{!717, !718, !719}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !715, file: !391, line: 35, baseType: !593, size: 64)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !715, file: !391, line: 36, baseType: !593, size: 64, offset: 64)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !715, file: !391, line: 37, baseType: !593, size: 64, offset: 128)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "elapsed", scope: !711, file: !391, line: 44, baseType: !714, size: 192, offset: 192)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !711, file: !391, line: 47, baseType: !722, size: 32, offset: 384)
!722 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerState", file: !391, line: 30, baseType: !390)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !711, file: !391, line: 50, baseType: !29, size: 64, offset: 448)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !626, file: !221, line: 262, baseType: !725, size: 64, offset: 4544)
!725 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickProgressMonitor", file: !726, line: 26, baseType: !727)
!726 = !DIFile(filename: "./magick/monitor.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !728, size: 64)
!728 = !DISubroutineType(types: !729)
!729 = !{!40, !730, !732, !735, !557}
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 64)
!731 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !22)
!732 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !733)
!733 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickOffsetType", file: !41, line: 150, baseType: !734)
!734 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!735 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !736)
!736 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickSizeType", file: !41, line: 151, baseType: !737)
!737 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !626, file: !221, line: 265, baseType: !557, size: 64, offset: 4608)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !626, file: !221, line: 266, baseType: !557, size: 64, offset: 4672)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !626, file: !221, line: 267, baseType: !557, size: 64, offset: 4736)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "ascii85", scope: !626, file: !221, line: 270, baseType: !742, size: 64, offset: 4800)
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !743, size: 64)
!743 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ascii85Info", file: !196, line: 52, baseType: !744)
!744 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Ascii85Info", file: !196, line: 51, flags: DIFlagFwdDecl)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !626, file: !221, line: 273, baseType: !746, size: 64, offset: 4864)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 64)
!747 = !DIDerivedType(tag: DW_TAG_typedef, name: "BlobInfo", file: !41, line: 217, baseType: !748)
!748 = !DICompositeType(tag: DW_TAG_structure_type, name: "_BlobInfo", file: !41, line: 217, flags: DIFlagFwdDecl)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !626, file: !221, line: 276, baseType: !21, size: 32768, offset: 4928)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "magick_filename", scope: !626, file: !221, line: 277, baseType: !21, size: 32768, offset: 37696)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !626, file: !221, line: 278, baseType: !21, size: 32768, offset: 70464)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "magick_columns", scope: !626, file: !221, line: 281, baseType: !29, size: 64, offset: 103232)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "magick_rows", scope: !626, file: !221, line: 282, baseType: !29, size: 64, offset: 103296)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "exception", scope: !626, file: !221, line: 285, baseType: !755, size: 448, offset: 103360)
!755 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionInfo", file: !41, line: 219, baseType: !756)
!756 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ExceptionInfo", file: !56, line: 102, size: 448, elements: !757)
!757 = !{!758, !760, !761, !762, !763, !764, !765, !770}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "severity", scope: !756, file: !56, line: 105, baseType: !759, size: 32)
!759 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionType", file: !56, line: 100, baseType: !55)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "error_number", scope: !756, file: !56, line: 108, baseType: !558, size: 32, offset: 32)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !756, file: !56, line: 111, baseType: !559, size: 64, offset: 64)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !756, file: !56, line: 112, baseType: !559, size: 64, offset: 128)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "exceptions", scope: !756, file: !56, line: 115, baseType: !557, size: 64, offset: 192)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "relinquish", scope: !756, file: !56, line: 118, baseType: !40, size: 32, offset: 256)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !756, file: !56, line: 121, baseType: !766, size: 64, offset: 320)
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64)
!767 = !DIDerivedType(tag: DW_TAG_typedef, name: "SemaphoreInfo", file: !768, line: 26, baseType: !769)
!768 = !DIFile(filename: "./magick/semaphore.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!769 = !DICompositeType(tag: DW_TAG_structure_type, name: "SemaphoreInfo", file: !768, line: 25, flags: DIFlagFwdDecl)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !756, file: !56, line: 124, baseType: !29, size: 64, offset: 384)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !626, file: !221, line: 288, baseType: !40, size: 32, offset: 103808)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !626, file: !221, line: 291, baseType: !773, size: 64, offset: 103872)
!773 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !47)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !626, file: !221, line: 294, baseType: !766, size: 64, offset: 103936)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "color_profile", scope: !626, file: !221, line: 297, baseType: !776, size: 256, offset: 104000)
!776 = !DIDerivedType(tag: DW_TAG_typedef, name: "ProfileInfo", file: !233, line: 40, baseType: !777)
!777 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ProfileInfo", file: !233, line: 27, size: 256, elements: !778)
!778 = !{!779, !780, !781, !782}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !777, file: !233, line: 30, baseType: !559, size: 64)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !777, file: !233, line: 33, baseType: !29, size: 64, offset: 64)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !777, file: !233, line: 36, baseType: !26, size: 64, offset: 128)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !777, file: !233, line: 39, baseType: !29, size: 64, offset: 192)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "iptc_profile", scope: !626, file: !221, line: 298, baseType: !776, size: 256, offset: 104256)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profile", scope: !626, file: !221, line: 299, baseType: !785, size: 64, offset: 104512)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profiles", scope: !626, file: !221, line: 302, baseType: !29, size: 64, offset: 104576)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !626, file: !221, line: 305, baseType: !29, size: 64, offset: 104640)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !626, file: !221, line: 308, baseType: !694, size: 64, offset: 104704)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !626, file: !221, line: 309, baseType: !694, size: 64, offset: 104768)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !626, file: !221, line: 310, baseType: !694, size: 64, offset: 104832)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "interpolate", scope: !626, file: !221, line: 313, baseType: !792, size: 32, offset: 104896)
!792 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterpolatePixelMethod", file: !397, line: 47, baseType: !396)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "black_point_compensation", scope: !626, file: !221, line: 316, baseType: !40, size: 32, offset: 104928)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_color", scope: !626, file: !221, line: 319, baseType: !596, size: 64, offset: 104960)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !626, file: !221, line: 322, baseType: !694, size: 64, offset: 105024)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "tile_offset", scope: !626, file: !221, line: 325, baseType: !671, size: 256, offset: 105088)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !626, file: !221, line: 328, baseType: !557, size: 64, offset: 105344)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "artifacts", scope: !626, file: !221, line: 329, baseType: !557, size: 64, offset: 105408)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !626, file: !221, line: 332, baseType: !613, size: 32, offset: 105472)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !626, file: !221, line: 335, baseType: !40, size: 32, offset: 105504)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !626, file: !221, line: 338, baseType: !736, size: 64, offset: 105536)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "ping", scope: !626, file: !221, line: 341, baseType: !40, size: 32, offset: 105600)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !626, file: !221, line: 344, baseType: !29, size: 64, offset: 105664)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !626, file: !221, line: 347, baseType: !805, size: 64, offset: 105728)
!805 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !806, line: 7, baseType: !807)
!806 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "")
!807 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !50, line: 160, baseType: !51)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "intensity", scope: !626, file: !221, line: 350, baseType: !809, size: 32, offset: 105792)
!809 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelIntensityMethod", file: !397, line: 79, baseType: !427)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !626, file: !221, line: 353, baseType: !29, size: 64, offset: 105856)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !563, file: !221, line: 443, baseType: !557, size: 64, offset: 2112)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !563, file: !221, line: 446, baseType: !725, size: 64, offset: 2176)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !563, file: !221, line: 449, baseType: !557, size: 64, offset: 2240)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !563, file: !221, line: 450, baseType: !557, size: 64, offset: 2304)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !563, file: !221, line: 453, baseType: !816, size: 64, offset: 2368)
!816 = !DIDerivedType(tag: DW_TAG_typedef, name: "StreamHandler", file: !817, line: 26, baseType: !818)
!817 = !DIFile(filename: "./magick/stream.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 64)
!819 = !DISubroutineType(types: !820)
!820 = !{!29, !821, !823, !825}
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !822, size: 64)
!822 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !625)
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 64)
!824 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!825 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !29)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !563, file: !221, line: 456, baseType: !827, size: 64, offset: 2432)
!827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !828, size: 64)
!828 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !829, line: 7, baseType: !830)
!829 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!830 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !831, line: 49, size: 1728, elements: !832)
!831 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!832 = !{!833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !848, !850, !851, !852, !854, !855, !857, !861, !864, !866, !869, !872, !873, !874, !875, !876}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !830, file: !831, line: 51, baseType: !558, size: 32)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !830, file: !831, line: 54, baseType: !559, size: 64, offset: 64)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !830, file: !831, line: 55, baseType: !559, size: 64, offset: 128)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !830, file: !831, line: 56, baseType: !559, size: 64, offset: 192)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !830, file: !831, line: 57, baseType: !559, size: 64, offset: 256)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !830, file: !831, line: 58, baseType: !559, size: 64, offset: 320)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !830, file: !831, line: 59, baseType: !559, size: 64, offset: 384)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !830, file: !831, line: 60, baseType: !559, size: 64, offset: 448)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !830, file: !831, line: 61, baseType: !559, size: 64, offset: 512)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !830, file: !831, line: 64, baseType: !559, size: 64, offset: 576)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !830, file: !831, line: 65, baseType: !559, size: 64, offset: 640)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !830, file: !831, line: 66, baseType: !559, size: 64, offset: 704)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !830, file: !831, line: 68, baseType: !846, size: 64, offset: 768)
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 64)
!847 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !831, line: 36, flags: DIFlagFwdDecl)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !830, file: !831, line: 70, baseType: !849, size: 64, offset: 832)
!849 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 64)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !830, file: !831, line: 72, baseType: !558, size: 32, offset: 896)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !830, file: !831, line: 73, baseType: !558, size: 32, offset: 928)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !830, file: !831, line: 74, baseType: !853, size: 64, offset: 960)
!853 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !50, line: 152, baseType: !51)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !830, file: !831, line: 77, baseType: !601, size: 16, offset: 1024)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !830, file: !831, line: 78, baseType: !856, size: 8, offset: 1040)
!856 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !830, file: !831, line: 79, baseType: !858, size: 8, offset: 1048)
!858 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 8, elements: !859)
!859 = !{!860}
!860 = !DISubrange(count: 1)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !830, file: !831, line: 81, baseType: !862, size: 64, offset: 1088)
!862 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !863, size: 64)
!863 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !831, line: 43, baseType: null)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !830, file: !831, line: 89, baseType: !865, size: 64, offset: 1152)
!865 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !50, line: 153, baseType: !51)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !830, file: !831, line: 91, baseType: !867, size: 64, offset: 1216)
!867 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !868, size: 64)
!868 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !831, line: 37, flags: DIFlagFwdDecl)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !830, file: !831, line: 92, baseType: !870, size: 64, offset: 1280)
!870 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !871, size: 64)
!871 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !831, line: 38, flags: DIFlagFwdDecl)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !830, file: !831, line: 93, baseType: !849, size: 64, offset: 1344)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !830, file: !831, line: 94, baseType: !557, size: 64, offset: 1408)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !830, file: !831, line: 95, baseType: !29, size: 64, offset: 1472)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !830, file: !831, line: 96, baseType: !558, size: 32, offset: 1536)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !830, file: !831, line: 98, baseType: !877, size: 160, offset: 1568)
!877 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 160, elements: !878)
!878 = !{!879}
!879 = !DISubrange(count: 20)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !563, file: !221, line: 459, baseType: !557, size: 64, offset: 2496)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !563, file: !221, line: 462, baseType: !29, size: 64, offset: 2560)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !563, file: !221, line: 465, baseType: !21, size: 32768, offset: 2624)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "unique", scope: !563, file: !221, line: 466, baseType: !21, size: 32768, offset: 35392)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "zero", scope: !563, file: !221, line: 467, baseType: !21, size: 32768, offset: 68160)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !563, file: !221, line: 468, baseType: !21, size: 32768, offset: 100928)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !563, file: !221, line: 471, baseType: !40, size: 32, offset: 133696)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "tile", scope: !563, file: !221, line: 474, baseType: !559, size: 64, offset: 133760)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "subimage", scope: !563, file: !221, line: 477, baseType: !29, size: 64, offset: 133824)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "subrange", scope: !563, file: !221, line: 478, baseType: !29, size: 64, offset: 133888)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "pen", scope: !563, file: !221, line: 481, baseType: !596, size: 64, offset: 133952)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !563, file: !221, line: 484, baseType: !29, size: 64, offset: 134016)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_pixel_method", scope: !563, file: !221, line: 487, baseType: !893, size: 32, offset: 134080)
!893 = !DIDerivedType(tag: DW_TAG_typedef, name: "VirtualPixelMethod", file: !536, line: 47, baseType: !535)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_color", scope: !563, file: !221, line: 490, baseType: !596, size: 64, offset: 134112)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !563, file: !221, line: 493, baseType: !557, size: 64, offset: 134208)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "synchronize", scope: !563, file: !221, line: 496, baseType: !40, size: 32, offset: 134272)
!897 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !898, size: 64)
!898 = !DIDerivedType(tag: DW_TAG_typedef, name: "QuantumInfo", file: !291, line: 85, baseType: !899)
!899 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QuantumInfo", file: !900, line: 42, size: 1216, elements: !901)
!900 = !DIFile(filename: "./magick/quantum-private.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!901 = !{!902, !903, !904, !906, !907, !908, !909, !910, !911, !912, !914, !915, !917, !918, !919, !929, !930}
!902 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !899, file: !900, line: 45, baseType: !29, size: 64)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "quantum", scope: !899, file: !900, line: 46, baseType: !29, size: 64, offset: 64)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !899, file: !900, line: 49, baseType: !905, size: 32, offset: 128)
!905 = !DIDerivedType(tag: DW_TAG_typedef, name: "QuantumFormatType", file: !291, line: 50, baseType: !439)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "minimum", scope: !899, file: !900, line: 52, baseType: !593, size: 64, offset: 192)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "maximum", scope: !899, file: !900, line: 53, baseType: !593, size: 64, offset: 256)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !899, file: !900, line: 54, baseType: !593, size: 64, offset: 320)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !899, file: !900, line: 57, baseType: !29, size: 64, offset: 384)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "min_is_white", scope: !899, file: !900, line: 60, baseType: !40, size: 32, offset: 448)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "pack", scope: !899, file: !900, line: 61, baseType: !40, size: 32, offset: 480)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_type", scope: !899, file: !900, line: 64, baseType: !913, size: 32, offset: 512)
!913 = !DIDerivedType(tag: DW_TAG_typedef, name: "QuantumAlphaType", file: !291, line: 42, baseType: !445)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "number_threads", scope: !899, file: !900, line: 67, baseType: !29, size: 64, offset: 576)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "pixels", scope: !899, file: !900, line: 70, baseType: !916, size: 64, offset: 640)
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !899, file: !900, line: 73, baseType: !29, size: 64, offset: 704)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !899, file: !900, line: 76, baseType: !583, size: 32, offset: 768)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !899, file: !900, line: 79, baseType: !920, size: 256, offset: 832)
!920 = !DIDerivedType(tag: DW_TAG_typedef, name: "QuantumState", file: !900, line: 40, baseType: !921)
!921 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QuantumState", file: !900, line: 27, size: 256, elements: !922)
!922 = !{!923, !924, !925, !926}
!923 = !DIDerivedType(tag: DW_TAG_member, name: "inverse_scale", scope: !921, file: !900, line: 30, baseType: !593, size: 64)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "pixel", scope: !921, file: !900, line: 33, baseType: !12, size: 32, offset: 64)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !921, file: !900, line: 36, baseType: !29, size: 64, offset: 128)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !921, file: !900, line: 39, baseType: !927, size: 64, offset: 192)
!927 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !928, size: 64)
!928 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !12)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !899, file: !900, line: 82, baseType: !766, size: 64, offset: 1088)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !899, file: !900, line: 85, baseType: !29, size: 64, offset: 1152)
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 64)
!932 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !596)
!933 = !{!0}
!934 = !{}
!935 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 2048, elements: !936)
!936 = !{!937}
!937 = !DISubrange(count: 64)
!938 = !{i32 7, !"Dwarf Version", i32 4}
!939 = !{i32 2, !"Debug Info Version", i32 3}
!940 = !{i32 1, !"wchar_size", i32 4}
!941 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!942 = distinct !DISubprogram(name: "AcquireSignatureInfo", scope: !3, file: !3, line: 119, type: !943, scopeLine: 120, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !53, retainedNodes: !934)
!943 = !DISubroutineType(types: !944)
!944 = !{!6}
!945 = !DILocalVariable(name: "signature_info", scope: !942, file: !3, line: 122, type: !6)
!946 = !DILocation(line: 122, column: 6, scope: !942)
!947 = !DILocalVariable(name: "lsb_first", scope: !942, file: !3, line: 125, type: !12)
!948 = !DILocation(line: 125, column: 5, scope: !942)
!949 = !DILocation(line: 127, column: 36, scope: !942)
!950 = !DILocation(line: 127, column: 18, scope: !942)
!951 = !DILocation(line: 127, column: 17, scope: !942)
!952 = !DILocation(line: 128, column: 7, scope: !953)
!953 = distinct !DILexicalBlock(scope: !942, file: !3, line: 128, column: 7)
!954 = !DILocation(line: 128, column: 22, scope: !953)
!955 = !DILocation(line: 128, column: 7, scope: !942)
!956 = !DILocalVariable(name: "message", scope: !957, file: !3, line: 129, type: !559)
!957 = distinct !DILexicalBlock(scope: !953, file: !3, line: 129, column: 5)
!958 = !DILocation(line: 129, column: 5, scope: !957)
!959 = !DILocalVariable(name: "exception", scope: !957, file: !3, line: 129, type: !755)
!960 = !DILocation(line: 130, column: 28, scope: !942)
!961 = !DILocation(line: 130, column: 10, scope: !942)
!962 = !DILocation(line: 131, column: 3, scope: !942)
!963 = !DILocation(line: 131, column: 19, scope: !942)
!964 = !DILocation(line: 131, column: 29, scope: !942)
!965 = !DILocation(line: 132, column: 3, scope: !942)
!966 = !DILocation(line: 132, column: 19, scope: !942)
!967 = !DILocation(line: 132, column: 28, scope: !942)
!968 = !DILocation(line: 133, column: 26, scope: !942)
!969 = !DILocation(line: 133, column: 3, scope: !942)
!970 = !DILocation(line: 133, column: 19, scope: !942)
!971 = !DILocation(line: 133, column: 25, scope: !942)
!972 = !DILocation(line: 134, column: 27, scope: !942)
!973 = !DILocation(line: 134, column: 3, scope: !942)
!974 = !DILocation(line: 134, column: 19, scope: !942)
!975 = !DILocation(line: 134, column: 26, scope: !942)
!976 = !DILocation(line: 135, column: 48, scope: !942)
!977 = !DILocation(line: 135, column: 31, scope: !942)
!978 = !DILocation(line: 135, column: 3, scope: !942)
!979 = !DILocation(line: 135, column: 19, scope: !942)
!980 = !DILocation(line: 135, column: 30, scope: !942)
!981 = !DILocation(line: 137, column: 7, scope: !982)
!982 = distinct !DILexicalBlock(scope: !942, file: !3, line: 137, column: 7)
!983 = !DILocation(line: 137, column: 23, scope: !982)
!984 = !DILocation(line: 137, column: 35, scope: !982)
!985 = !DILocation(line: 137, column: 7, scope: !942)
!986 = !DILocalVariable(name: "message", scope: !987, file: !3, line: 138, type: !559)
!987 = distinct !DILexicalBlock(scope: !982, file: !3, line: 138, column: 5)
!988 = !DILocation(line: 138, column: 5, scope: !987)
!989 = !DILocalVariable(name: "exception", scope: !987, file: !3, line: 138, type: !755)
!990 = !DILocation(line: 139, column: 12, scope: !942)
!991 = !DILocation(line: 140, column: 36, scope: !942)
!992 = !DILocation(line: 140, column: 29, scope: !942)
!993 = !DILocation(line: 140, column: 58, scope: !942)
!994 = !DILocation(line: 140, column: 3, scope: !942)
