; ModuleID = 'magick/shear.c'
source_filename = "magick/shear.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._Image = type { i32, i32, i32, i64, i32, i32, i32, i64, i64, i64, i64, %struct._PixelPacket*, %struct._PixelPacket, %struct._PixelPacket, %struct._PixelPacket, double, %struct._ChromaticityInfo, i32, i8*, i32, i8*, i8*, i8*, i64, double, double, %struct._RectangleInfo, %struct._RectangleInfo, %struct._RectangleInfo, double, double, double, i32, i32, i32, i32, i32, i32, %struct._Image*, i64, i64, i64, i64, i64, i64, %struct._ErrorInfo, %struct._TimerInfo, i32 (i8*, i64, i64, i8*)*, i8*, i8*, i8*, %struct._Ascii85Info*, %struct._BlobInfo*, [4096 x i8], [4096 x i8], [4096 x i8], i64, i64, %struct._ExceptionInfo, i32, i64, %struct.SemaphoreInfo*, %struct._ProfileInfo, %struct._ProfileInfo, %struct._ProfileInfo*, i64, i64, %struct._Image*, %struct._Image*, %struct._Image*, i32, i32, %struct._PixelPacket, %struct._Image*, %struct._RectangleInfo, i8*, i8*, i32, i32, i64, i32, i64, i64, i32, i64 }
%struct._ChromaticityInfo = type { %struct._PrimaryInfo, %struct._PrimaryInfo, %struct._PrimaryInfo, %struct._PrimaryInfo }
%struct._PrimaryInfo = type { double, double, double }
%struct._ErrorInfo = type { double, double, double }
%struct._TimerInfo = type { %struct._Timer, %struct._Timer, i32, i64 }
%struct._Timer = type { double, double, double }
%struct._Ascii85Info = type opaque

!390 = !DIEnumerator(name: "X11Event", value: 131072, isUnsigned: true)
!391 = !DIEnumerator(name: "AccelerateEvent", value: 262144, isUnsigned: true)
!392 = !DIEnumerator(name: "AllEvents", value: 2147483647, isUnsigned: true)
!393 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !394, line: 27, baseType: !5, size: 32, elements: !395)
!394 = !DIFile(filename: "./magick/cache-view.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!395 = !{!396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413}
!396 = !DIEnumerator(name: "UndefinedVirtualPixelMethod", value: 0, isUnsigned: true)
!397 = !DIEnumerator(name: "BackgroundVirtualPixelMethod", value: 1, isUnsigned: true)
!398 = !DIEnumerator(name: "ConstantVirtualPixelMethod", value: 2, isUnsigned: true)
!399 = !DIEnumerator(name: "DitherVirtualPixelMethod", value: 3, isUnsigned: true)
!400 = !DIEnumerator(name: "EdgeVirtualPixelMethod", value: 4, isUnsigned: true)
!401 = !DIEnumerator(name: "MirrorVirtualPixelMethod", value: 5, isUnsigned: true)
!402 = !DIEnumerator(name: "RandomVirtualPixelMethod", value: 6, isUnsigned: true)
!403 = !DIEnumerator(name: "TileVirtualPixelMethod", value: 7, isUnsigned: true)
!404 = !DIEnumerator(name: "TransparentVirtualPixelMethod", value: 8, isUnsigned: true)
!405 = !DIEnumerator(name: "MaskVirtualPixelMethod", value: 9, isUnsigned: true)
!406 = !DIEnumerator(name: "BlackVirtualPixelMethod", value: 10, isUnsigned: true)
!407 = !DIEnumerator(name: "GrayVirtualPixelMethod", value: 11, isUnsigned: true)
!408 = !DIEnumerator(name: "WhiteVirtualPixelMethod", value: 12, isUnsigned: true)
!409 = !DIEnumerator(name: "HorizontalTileVirtualPixelMethod", value: 13, isUnsigned: true)
!410 = !DIEnumerator(name: "VerticalTileVirtualPixelMethod", value: 14, isUnsigned: true)
!411 = !DIEnumerator(name: "HorizontalTileEdgeVirtualPixelMethod", value: 15, isUnsigned: true)
!412 = !DIEnumerator(name: "VerticalTileEdgeVirtualPixelMethod", value: 16, isUnsigned: true)
!413 = !DIEnumerator(name: "CheckerTileVirtualPixelMethod", value: 17, isUnsigned: true)
!414 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !415, line: 113, baseType: !5, size: 32, elements: !416)
!415 = !DIFile(filename: "./magick/statistic.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!416 = !{!417, !418, !419, !420, !421, !422, !423, !424, !425}
!417 = !DIEnumerator(name: "UndefinedStatistic", value: 0, isUnsigned: true)
!418 = !DIEnumerator(name: "GradientStatistic", value: 1, isUnsigned: true)
!419 = !DIEnumerator(name: "MaximumStatistic", value: 2, isUnsigned: true)
!420 = !DIEnumerator(name: "MeanStatistic", value: 3, isUnsigned: true)
!421 = !DIEnumerator(name: "MedianStatistic", value: 4, isUnsigned: true)
!422 = !DIEnumerator(name: "MinimumStatistic", value: 5, isUnsigned: true)
!423 = !DIEnumerator(name: "ModeStatistic", value: 6, isUnsigned: true)
!424 = !DIEnumerator(name: "NonpeakStatistic", value: 7, isUnsigned: true)
!425 = !DIEnumerator(name: "StandardDeviationStatistic", value: 8, isUnsigned: true)
!426 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !73, line: 30, baseType: !5, size: 32, elements: !427)
!427 = !{!428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440}
!428 = !DIEnumerator(name: "UndefinedAlphaChannel", value: 0, isUnsigned: true)
!429 = !DIEnumerator(name: "ActivateAlphaChannel", value: 1, isUnsigned: true)
!430 = !DIEnumerator(name: "BackgroundAlphaChannel", value: 2, isUnsigned: true)
!431 = !DIEnumerator(name: "CopyAlphaChannel", value: 3, isUnsigned: true)
!432 = !DIEnumerator(name: "DeactivateAlphaChannel", value: 4, isUnsigned: true)
!433 = !DIEnumerator(name: "ExtractAlphaChannel", value: 5, isUnsigned: true)
!434 = !DIEnumerator(name: "OpaqueAlphaChannel", value: 6, isUnsigned: true)
!435 = !DIEnumerator(name: "ResetAlphaChannel", value: 7, isUnsigned: true)
!436 = !DIEnumerator(name: "SetAlphaChannel", value: 8, isUnsigned: true)
!437 = !DIEnumerator(name: "ShapeAlphaChannel", value: 9, isUnsigned: true)
!438 = !DIEnumerator(name: "TransparentAlphaChannel", value: 10, isUnsigned: true)
!439 = !DIEnumerator(name: "FlattenAlphaChannel", value: 11, isUnsigned: true)
!440 = !DIEnumerator(name: "RemoveAlphaChannel", value: 12, isUnsigned: true)
!441 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !442, file: !1, line: 1140, baseType: !5, size: 32, elements: !674)
!442 = distinct !DISubprogram(name: "XShearImage", scope: !1, file: !1, line: 1134, type: !443, scopeLine: 1137, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !673)
!443 = !DISubroutineType(types: !444)
!444 = !{!445, !446, !667, !670, !670, !671, !671, !672}
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickBooleanType", file: !4, line: 215, baseType: !84)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!447 = !DIDerivedType(tag: DW_TAG_typedef, name: "Image", file: !4, line: 221, baseType: !448)
!448 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Image", file: !73, line: 150, size: 105920, elements: !449)
!449 = !{!450, !452, !454, !456, !460, !462, !463, !464, !465, !466, !467, !468, !479, !480, !481, !482, !484, !498, !500, !502, !504, !507, !508, !509, !515, !516, !517, !525, !526, !527, !528, !529, !530, !532, !534, !536, !538, !540, !542, !544, !545, !546, !547, !548, !549, !550, !558, !573, !587, !588, !589, !590, !594, !598, !602, !603, !604, !605, !606, !624, !625, !627, !628, !638, !639, !641, !642, !643, !644, !645, !646, !648, !649, !650, !651, !652, !653, !654, !656, !657, !658, !659, !660, !664, !666}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "storage_class", scope: !448, file: !73, line: 153, baseType: !451, size: 32)
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "ClassType", file: !4, line: 209, baseType: !3)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !448, file: !73, line: 156, baseType: !453, size: 32, offset: 32)
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorspaceType", file: !11, line: 61, baseType: !10)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !448, file: !73, line: 159, baseType: !455, size: 32, offset: 64)
!455 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompressionType", file: !48, line: 49, baseType: !47)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !448, file: !73, line: 162, baseType: !457, size: 64, offset: 128)
!457 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !458, line: 46, baseType: !459)
!458 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!459 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !448, file: !73, line: 165, baseType: !461, size: 32, offset: 192)
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "OrientationType", file: !73, line: 86, baseType: !72)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "taint", scope: !448, file: !73, line: 168, baseType: !445, size: 32, offset: 224)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "matte", scope: !448, file: !73, line: 169, baseType: !445, size: 32, offset: 256)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !448, file: !73, line: 172, baseType: !457, size: 64, offset: 320)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !448, file: !73, line: 173, baseType: !457, size: 64, offset: 384)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !448, file: !73, line: 174, baseType: !457, size: 64, offset: 448)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !448, file: !73, line: 175, baseType: !457, size: 64, offset: 512)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "colormap", scope: !448, file: !73, line: 178, baseType: !469, size: 64, offset: 576)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64)
!470 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelPacket", file: !326, line: 148, baseType: !471)
!471 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PixelPacket", file: !326, line: 131, size: 64, elements: !472)
!472 = !{!473, !476, !477, !478}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !471, file: !326, line: 143, baseType: !474, size: 16)
!474 = !DIDerivedType(tag: DW_TAG_typedef, name: "Quantum", file: !4, line: 93, baseType: !475)
!475 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !471, file: !326, line: 144, baseType: !474, size: 16, offset: 16)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !471, file: !326, line: 145, baseType: !474, size: 16, offset: 32)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !471, file: !326, line: 146, baseType: !474, size: 16, offset: 48)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "background_color", scope: !448, file: !73, line: 179, baseType: !470, size: 64, offset: 640)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !448, file: !73, line: 180, baseType: !470, size: 64, offset: 704)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "matte_color", scope: !448, file: !73, line: 181, baseType: !470, size: 64, offset: 768)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !448, file: !73, line: 184, baseType: !483, size: 64, offset: 832)
!483 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "chromaticity", scope: !448, file: !73, line: 187, baseType: !485, size: 768, offset: 896)
!485 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChromaticityInfo", file: !73, line: 128, baseType: !486)
!486 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ChromaticityInfo", file: !73, line: 121, size: 768, elements: !487)
!487 = !{!488, !495, !496, !497}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "red_primary", scope: !486, file: !73, line: 124, baseType: !489, size: 192)
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "PrimaryInfo", file: !73, line: 101, baseType: !490)
!490 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PrimaryInfo", file: !73, line: 95, size: 192, elements: !491)
!491 = !{!492, !493, !494}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !490, file: !73, line: 98, baseType: !483, size: 64)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !490, file: !73, line: 99, baseType: !483, size: 64, offset: 64)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !490, file: !73, line: 100, baseType: !483, size: 64, offset: 128)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "green_primary", scope: !486, file: !73, line: 125, baseType: !489, size: 192, offset: 192)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "blue_primary", scope: !486, file: !73, line: 126, baseType: !489, size: 192, offset: 384)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "white_point", scope: !486, file: !73, line: 127, baseType: !489, size: 192, offset: 576)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "rendering_intent", scope: !448, file: !73, line: 190, baseType: !499, size: 32, offset: 1664)
!499 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderingIntent", file: !89, line: 49, baseType: !88)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !448, file: !73, line: 193, baseType: !501, size: 64, offset: 1728)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !448, file: !73, line: 196, baseType: !503, size: 32, offset: 1792)
!503 = !DIDerivedType(tag: DW_TAG_typedef, name: "ResolutionType", file: !73, line: 93, baseType: !96)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "montage", scope: !448, file: !73, line: 199, baseType: !505, size: 64, offset: 1856)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64)
!506 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "directory", scope: !448, file: !73, line: 200, baseType: !505, size: 64, offset: 1920)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "geometry", scope: !448, file: !73, line: 201, baseType: !505, size: 64, offset: 1984)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !448, file: !73, line: 204, baseType: !510, size: 64, offset: 2048)
!510 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !511, line: 77, baseType: !512)
!511 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!512 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !513, line: 193, baseType: !514)
!513 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!514 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "x_resolution", scope: !448, file: !73, line: 207, baseType: !483, size: 64, offset: 2112)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "y_resolution", scope: !448, file: !73, line: 208, baseType: !483, size: 64, offset: 2176)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !448, file: !73, line: 211, baseType: !518, size: 256, offset: 2240)
!518 = !DIDerivedType(tag: DW_TAG_typedef, name: "RectangleInfo", file: !153, line: 130, baseType: !519)
!519 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_RectangleInfo", file: !153, line: 121, size: 256, elements: !520)
!520 = !{!521, !522, !523, !524}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !519, file: !153, line: 124, baseType: !457, size: 64)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !519, file: !153, line: 125, baseType: !457, size: 64, offset: 64)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !519, file: !153, line: 128, baseType: !510, size: 64, offset: 128)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !519, file: !153, line: 129, baseType: !510, size: 64, offset: 192)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "extract_info", scope: !448, file: !73, line: 212, baseType: !518, size: 256, offset: 2496)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "tile_info", scope: !448, file: !73, line: 213, baseType: !518, size: 256, offset: 2752)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "bias", scope: !448, file: !73, line: 216, baseType: !483, size: 64, offset: 3008)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "blur", scope: !448, file: !73, line: 217, baseType: !483, size: 64, offset: 3072)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !448, file: !73, line: 218, baseType: !483, size: 64, offset: 3136)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !448, file: !73, line: 221, baseType: !531, size: 32, offset: 3200)
!531 = !DIDerivedType(tag: DW_TAG_typedef, name: "FilterTypes", file: !102, line: 66, baseType: !101)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "interlace", scope: !448, file: !73, line: 224, baseType: !533, size: 32, offset: 3232)
!533 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterlaceType", file: !73, line: 73, baseType: !136)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !448, file: !73, line: 227, baseType: !535, size: 32, offset: 3264)
!535 = !DIDerivedType(tag: DW_TAG_typedef, name: "EndianType", file: !147, line: 35, baseType: !146)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !448, file: !73, line: 230, baseType: !537, size: 32, offset: 3296)
!537 = !DIDerivedType(tag: DW_TAG_typedef, name: "GravityType", file: !153, line: 91, baseType: !152)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !448, file: !73, line: 233, baseType: !539, size: 32, offset: 3328)
!539 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompositeOperator", file: !168, line: 99, baseType: !167)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "dispose", scope: !448, file: !73, line: 236, baseType: !541, size: 32, offset: 3360)
!541 = !DIDerivedType(tag: DW_TAG_typedef, name: "DisposeType", file: !239, line: 32, baseType: !238)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "clip_mask", scope: !448, file: !73, line: 239, baseType: !543, size: 64, offset: 3392)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !448, file: !73, line: 242, baseType: !457, size: 64, offset: 3456)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !448, file: !73, line: 243, baseType: !457, size: 64, offset: 3520)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_second", scope: !448, file: !73, line: 246, baseType: !510, size: 64, offset: 3584)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "iterations", scope: !448, file: !73, line: 249, baseType: !457, size: 64, offset: 3648)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "total_colors", scope: !448, file: !73, line: 250, baseType: !457, size: 64, offset: 3712)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "start_loop", scope: !448, file: !73, line: 253, baseType: !510, size: 64, offset: 3776)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !448, file: !73, line: 256, baseType: !551, size: 192, offset: 3840)
!551 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErrorInfo", file: !552, line: 68, baseType: !553)
!552 = !DIFile(filename: "./magick/color.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!553 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ErrorInfo", file: !552, line: 62, size: 192, elements: !554)
!554 = !{!555, !556, !557}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "mean_error_per_pixel", scope: !553, file: !552, line: 65, baseType: !483, size: 64)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_mean_error", scope: !553, file: !552, line: 66, baseType: !483, size: 64, offset: 64)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_maximum_error", scope: !553, file: !552, line: 67, baseType: !483, size: 64, offset: 128)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !448, file: !73, line: 259, baseType: !559, size: 512, offset: 4032)
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerInfo", file: !247, line: 51, baseType: !560)
!560 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TimerInfo", file: !247, line: 40, size: 512, elements: !561)
!561 = !{!562, !569, !570, !572}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !560, file: !247, line: 43, baseType: !563, size: 192)
!563 = !DIDerivedType(tag: DW_TAG_typedef, name: "Timer", file: !247, line: 38, baseType: !564)
!564 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Timer", file: !247, line: 32, size: 192, elements: !565)
!565 = !{!566, !567, !568}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !564, file: !247, line: 35, baseType: !483, size: 64)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !564, file: !247, line: 36, baseType: !483, size: 64, offset: 64)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !564, file: !247, line: 37, baseType: !483, size: 64, offset: 128)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "elapsed", scope: !560, file: !247, line: 44, baseType: !563, size: 192, offset: 192)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !560, file: !247, line: 47, baseType: !571, size: 32, offset: 384)
!571 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerState", file: !247, line: 30, baseType: !246)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !560, file: !247, line: 50, baseType: !457, size: 64, offset: 448)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !448, file: !73, line: 262, baseType: !574, size: 64, offset: 4544)
!574 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickProgressMonitor", file: !575, line: 26, baseType: !576)
!575 = !DIFile(filename: "./magick/monitor.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64)
!577 = !DISubroutineType(types: !578)
!578 = !{!445, !579, !581, !584, !501}
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64)
!580 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !506)
!581 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !582)
!582 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickOffsetType", file: !4, line: 150, baseType: !583)
!583 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!584 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !585)
!585 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickSizeType", file: !4, line: 151, baseType: !586)
!586 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !448, file: !73, line: 265, baseType: !501, size: 64, offset: 4608)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !448, file: !73, line: 266, baseType: !501, size: 64, offset: 4672)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !448, file: !73, line: 267, baseType: !501, size: 64, offset: 4736)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "ascii85", scope: !448, file: !73, line: 270, baseType: !591, size: 64, offset: 4800)
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64)
!592 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ascii85Info", file: !48, line: 52, baseType: !593)
!593 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Ascii85Info", file: !48, line: 51, flags: DIFlagFwdDecl)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !448, file: !73, line: 273, baseType: !595, size: 64, offset: 4864)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64)
!596 = !DIDerivedType(tag: DW_TAG_typedef, name: "BlobInfo", file: !4, line: 217, baseType: !597)
!597 = !DICompositeType(tag: DW_TAG_structure_type, name: "_BlobInfo", file: !4, line: 217, flags: DIFlagFwdDecl)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !448, file: !73, line: 276, baseType: !599, size: 32768, offset: 4928)
!599 = !DICompositeType(tag: DW_TAG_array_type, baseType: !506, size: 32768, elements: !600)
!600 = !{!601}
!601 = !DISubrange(count: 4096)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "magick_filename", scope: !448, file: !73, line: 277, baseType: !599, size: 32768, offset: 37696)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !448, file: !73, line: 278, baseType: !599, size: 32768, offset: 70464)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "magick_columns", scope: !448, file: !73, line: 281, baseType: !457, size: 64, offset: 103232)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "magick_rows", scope: !448, file: !73, line: 282, baseType: !457, size: 64, offset: 103296)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "exception", scope: !448, file: !73, line: 285, baseType: !607, size: 448, offset: 103360)
!607 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionInfo", file: !4, line: 219, baseType: !608)
!608 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ExceptionInfo", file: !253, line: 102, size: 448, elements: !609)
!609 = !{!610, !612, !614, !615, !616, !617, !618, !623}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "severity", scope: !608, file: !253, line: 105, baseType: !611, size: 32)
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionType", file: !253, line: 100, baseType: !252)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "error_number", scope: !608, file: !253, line: 108, baseType: !613, size: 32, offset: 32)
!613 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !608, file: !253, line: 111, baseType: !505, size: 64, offset: 64)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !608, file: !253, line: 112, baseType: !505, size: 64, offset: 128)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "exceptions", scope: !608, file: !253, line: 115, baseType: !501, size: 64, offset: 192)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "relinquish", scope: !608, file: !253, line: 118, baseType: !445, size: 32, offset: 256)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !608, file: !253, line: 121, baseType: !619, size: 64, offset: 320)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64)
!620 = !DIDerivedType(tag: DW_TAG_typedef, name: "SemaphoreInfo", file: !621, line: 26, baseType: !622)
!621 = !DIFile(filename: "./magick/semaphore.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!622 = !DICompositeType(tag: DW_TAG_structure_type, name: "SemaphoreInfo", file: !621, line: 25, flags: DIFlagFwdDecl)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !608, file: !253, line: 124, baseType: !457, size: 64, offset: 384)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !448, file: !73, line: 288, baseType: !445, size: 32, offset: 103808)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !448, file: !73, line: 291, baseType: !626, size: 64, offset: 103872)
!626 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !510)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !448, file: !73, line: 294, baseType: !619, size: 64, offset: 103936)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "color_profile", scope: !448, file: !73, line: 297, baseType: !629, size: 256, offset: 104000)
!629 = !DIDerivedType(tag: DW_TAG_typedef, name: "ProfileInfo", file: !89, line: 40, baseType: !630)
!630 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ProfileInfo", file: !89, line: 27, size: 256, elements: !631)
!631 = !{!632, !633, !634, !637}
!632 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !630, file: !89, line: 30, baseType: !505, size: 64)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !630, file: !89, line: 33, baseType: !457, size: 64, offset: 64)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !630, file: !89, line: 36, baseType: !635, size: 64, offset: 128)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 64)
!636 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !630, file: !89, line: 39, baseType: !457, size: 64, offset: 192)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "iptc_profile", scope: !448, file: !73, line: 298, baseType: !629, size: 256, offset: 104256)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profile", scope: !448, file: !73, line: 299, baseType: !640, size: 64, offset: 104512)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 64)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profiles", scope: !448, file: !73, line: 302, baseType: !457, size: 64, offset: 104576)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !448, file: !73, line: 305, baseType: !457, size: 64, offset: 104640)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !448, file: !73, line: 308, baseType: !543, size: 64, offset: 104704)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !448, file: !73, line: 309, baseType: !543, size: 64, offset: 104768)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !448, file: !73, line: 310, baseType: !543, size: 64, offset: 104832)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "interpolate", scope: !448, file: !73, line: 313, baseType: !647, size: 32, offset: 104896)
!647 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterpolatePixelMethod", file: !326, line: 47, baseType: !325)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "black_point_compensation", scope: !448, file: !73, line: 316, baseType: !445, size: 32, offset: 104928)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_color", scope: !448, file: !73, line: 319, baseType: !470, size: 64, offset: 104960)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !448, file: !73, line: 322, baseType: !543, size: 64, offset: 105024)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "tile_offset", scope: !448, file: !73, line: 325, baseType: !518, size: 256, offset: 105088)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !448, file: !73, line: 328, baseType: !501, size: 64, offset: 105344)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "artifacts", scope: !448, file: !73, line: 329, baseType: !501, size: 64, offset: 105408)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !448, file: !73, line: 332, baseType: !655, size: 32, offset: 105472)
!655 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageType", file: !73, line: 61, baseType: !342)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !448, file: !73, line: 335, baseType: !445, size: 32, offset: 105504)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !448, file: !73, line: 338, baseType: !585, size: 64, offset: 105536)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "ping", scope: !448, file: !73, line: 341, baseType: !445, size: 32, offset: 105600)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !448, file: !73, line: 344, baseType: !457, size: 64, offset: 105664)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !448, file: !73, line: 347, baseType: !661, size: 64, offset: 105728)
!661 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !662, line: 7, baseType: !663)
!662 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "")
!663 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !513, line: 160, baseType: !514)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "intensity", scope: !448, file: !73, line: 350, baseType: !665, size: 32, offset: 105792)
!665 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelIntensityMethod", file: !326, line: 79, baseType: !356)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !448, file: !73, line: 353, baseType: !457, size: 64, offset: 105856)
!667 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !668)
!668 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickRealType", file: !4, line: 78, baseType: !669)
!669 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!670 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !457)
!671 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !510)
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!673 = !{}
!674 = !{!675, !676}
!675 = !DIEnumerator(name: "LEFT", value: 0, isUnsigned: true)
!676 = !DIEnumerator(name: "RIGHT", value: 1, isUnsigned: true)
!677 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !678, file: !1, line: 1361, baseType: !5, size: 32, elements: !679)
!678 = distinct !DISubprogram(name: "YShearImage", scope: !1, file: !1, line: 1355, type: !443, scopeLine: 1358, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !673)
!679 = !{!680, !681}
!680 = !DIEnumerator(name: "UP", value: 0, isUnsigned: true)
!681 = !DIEnumerator(name: "DOWN", value: 1, isUnsigned: true)
!682 = !{!683, !457, !501, !459, !446, !510, !483, !579, !684, !469, !686, !574, !582, !687, !688, !668, !690, !636, !475, !474, !694}
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64)
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 64)
!685 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !470)
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !687, size: 64)
!687 = !DIDerivedType(tag: DW_TAG_typedef, name: "IndexPacket", file: !326, line: 129, baseType: !474)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 64)
!689 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !687)
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 64)
!691 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatrixInfo", file: !692, line: 26, baseType: !693)
!692 = !DIFile(filename: "./magick/matrix.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!693 = !DICompositeType(tag: DW_TAG_structure_type, name: "_MatrixInfo", file: !692, line: 25, flags: DIFlagFwdDecl)
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64)
!695 = !{i32 7, !"Dwarf Version", i32 4}
!696 = !{i32 2, !"Debug Info Version", i32 3}
!697 = !{i32 1, !"wchar_size", i32 4}
!698 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!699 = distinct !DISubprogram(name: "DeskewImage", scope: !1, file: !1, line: 565, type: !700, scopeLine: 567, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !673)
!700 = !DISubroutineType(types: !701)
!701 = !{!446, !702, !704, !672}
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !703, size: 64)
!703 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !447)
!704 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !483)
!705 = !DILocalVariable(name: "image", arg: 1, scope: !699, file: !1, line: 565, type: !702)
!706 = !DILocation(line: 565, column: 46, scope: !699)
!707 = !DILocalVariable(name: "threshold", arg: 2, scope: !699, file: !1, line: 565, type: !704)
!708 = !DILocation(line: 565, column: 65, scope: !699)
!709 = !DILocalVariable(name: "exception", arg: 3, scope: !699, file: !1, line: 566, type: !672)
!710 = !DILocation(line: 566, column: 18, scope: !699)
!711 = !DILocalVariable(name: "affine_matrix", scope: !699, file: !1, line: 569, type: !712)
!712 = !DIDerivedType(tag: DW_TAG_typedef, name: "AffineMatrix", file: !153, line: 102, baseType: !713)
!713 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_AffineMatrix", file: !153, line: 93, size: 384, elements: !714)
!714 = !{!715, !716, !717, !718, !719, !720}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !713, file: !153, line: 96, baseType: !483, size: 64)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "rx", scope: !713, file: !153, line: 97, baseType: !483, size: 64, offset: 64)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "ry", scope: !713, file: !153, line: 98, baseType: !483, size: 64, offset: 128)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !713, file: !153, line: 99, baseType: !483, size: 64, offset: 192)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "tx", scope: !713, file: !153, line: 100, baseType: !483, size: 64, offset: 256)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "ty", scope: !713, file: !153, line: 101, baseType: !483, size: 64, offset: 320)
!721 = !DILocation(line: 569, column: 5, scope: !699)
!722 = !DILocalVariable(name: "artifact", scope: !699, file: !1, line: 572, type: !579)
!723 = !DILocation(line: 572, column: 6, scope: !699)
!724 = !DILocalVariable(name: "degrees", scope: !699, file: !1, line: 575, type: !483)
!725 = !DILocation(line: 575, column: 5, scope: !699)
!726 = !DILocalVariable(name: "clone_image", scope: !699, file: !1, line: 578, type: !446)
!727 = !DILocation(line: 578, column: 6, scope: !699)
!728 = !DILocalVariable(name: "crop_image", scope: !699, file: !1, line: 579, type: !446)
!729 = !DILocation(line: 579, column: 6, scope: !699)
!730 = !DILocalVariable(name: "deskew_image", scope: !699, file: !1, line: 580, type: !446)
!731 = !DILocation(line: 580, column: 6, scope: !699)
!732 = !DILocalVariable(name: "median_image", scope: !699, file: !1, line: 581, type: !446)
!733 = !DILocation(line: 581, column: 6, scope: !699)
!734 = !DILocalVariable(name: "status", scope: !699, file: !1, line: 584, type: !445)
!735 = !DILocation(line: 584, column: 5, scope: !699)
!736 = !DILocalVariable(name: "geometry", scope: !699, file: !1, line: 587, type: !518)
!737 = !DILocation(line: 587, column: 5, scope: !699)
!738 = !DILocalVariable(name: "i", scope: !699, file: !1, line: 590, type: !510)
!739 = !DILocation(line: 590, column: 5, scope: !699)
!740 = !DILocalVariable(name: "max_projection", scope: !699, file: !1, line: 593, type: !457)
!741 = !DILocation(line: 593, column: 5, scope: !699)
!742 = !DILocalVariable(name: "projection", scope: !699, file: !1, line: 594, type: !683)
!743 = !DILocation(line: 594, column: 6, scope: !699)
!744 = !DILocalVariable(name: "width", scope: !699, file: !1, line: 595, type: !457)
!745 = !DILocation(line: 595, column: 5, scope: !699)
!746 = !DILocalVariable(name: "skew", scope: !699, file: !1, line: 598, type: !510)
!747 = !DILocation(line: 598, column: 5, scope: !699)
!748 = !DILocation(line: 603, column: 13, scope: !749)
!749 = distinct !DILexicalBlock(scope: !699, file: !1, line: 603, column: 3)
!750 = !DILocation(line: 603, column: 8, scope: !749)
!751 = !DILocation(line: 603, column: 17, scope: !752)
!752 = distinct !DILexicalBlock(scope: !749, file: !1, line: 603, column: 3)
!753 = !DILocation(line: 603, column: 27, scope: !752)
!754 = !DILocation(line: 603, column: 34, scope: !752)
!755 = !DILocation(line: 603, column: 41, scope: !752)
!756 = !DILocation(line: 603, column: 44, scope: !752)
!757 = !DILocation(line: 603, column: 23, scope: !752)
!758 = !DILocation(line: 603, column: 3, scope: !749)
!759 = !DILocation(line: 603, column: 54, scope: !752)
!760 = !DILocation(line: 603, column: 3, scope: !752)
!761 = distinct !{!761, !758, !762}
!762 = !DILocation(line: 603, column: 60, scope: !749)
!763 = !DILocation(line: 604, column: 58, scope: !699)
!764 = !DILocation(line: 604, column: 57, scope: !699)
!765 = !DILocation(line: 604, column: 63, scope: !699)
!766 = !DILocation(line: 604, column: 25, scope: !699)
!767 = !DILocation(line: 604, column: 14, scope: !699)
!768 = !DILocation(line: 604, column: 13, scope: !699)
!769 = !DILocation(line: 606, column: 7, scope: !770)
!770 = distinct !DILexicalBlock(scope: !699, file: !1, line: 606, column: 7)
!771 = !DILocation(line: 606, column: 18, scope: !770)
!772 = !DILocation(line: 606, column: 7, scope: !699)
!773 = !DILocation(line: 607, column: 5, scope: !774)
!774 = distinct !DILexicalBlock(scope: !770, file: !1, line: 607, column: 5)
!775 = !DILocation(line: 608, column: 25, scope: !699)
!776 = !DILocation(line: 608, column: 31, scope: !699)
!777 = !DILocation(line: 608, column: 41, scope: !699)
!778 = !DILocation(line: 608, column: 52, scope: !699)
!779 = !DILocation(line: 608, column: 10, scope: !699)
!780 = !DILocation(line: 608, column: 9, scope: !699)
!781 = !DILocation(line: 609, column: 7, scope: !782)
!782 = distinct !DILexicalBlock(scope: !699, file: !1, line: 609, column: 7)
!783 = !DILocation(line: 609, column: 14, scope: !782)
!784 = !DILocation(line: 609, column: 7, scope: !699)
!785 = !DILocation(line: 611, column: 52, scope: !786)
!786 = distinct !DILexicalBlock(scope: !782, file: !1, line: 610, column: 5)
!787 = !DILocation(line: 611, column: 29, scope: !786)
!788 = !DILocation(line: 611, column: 18, scope: !786)
!789 = !DILocation(line: 611, column: 17, scope: !786)
!790 = !DILocation(line: 612, column: 7, scope: !791)
!791 = distinct !DILexicalBlock(scope: !786, file: !1, line: 612, column: 7)
!792 = !DILocation(line: 614, column: 17, scope: !699)
!793 = !DILocation(line: 615, column: 7, scope: !699)
!794 = !DILocation(line: 616, column: 9, scope: !795)
!795 = distinct !DILexicalBlock(scope: !699, file: !1, line: 616, column: 3)
!796 = !DILocation(line: 616, column: 8, scope: !795)
!797 = !DILocation(line: 616, column: 13, scope: !798)
!798 = distinct !DILexicalBlock(scope: !795, file: !1, line: 616, column: 3)
!799 = !DILocation(line: 616, column: 30, scope: !798)
!800 = !DILocation(line: 616, column: 29, scope: !798)
!801 = !DILocation(line: 616, column: 35, scope: !798)
!802 = !DILocation(line: 616, column: 15, scope: !798)
!803 = !DILocation(line: 616, column: 3, scope: !795)
!804 = !DILocation(line: 618, column: 9, scope: !805)
!805 = distinct !DILexicalBlock(scope: !806, file: !1, line: 618, column: 9)
!806 = distinct !DILexicalBlock(scope: !798, file: !1, line: 617, column: 3)
!807 = !DILocation(line: 618, column: 20, scope: !805)
!808 = !DILocation(line: 618, column: 25, scope: !805)
!809 = !DILocation(line: 618, column: 23, scope: !805)
!810 = !DILocation(line: 618, column: 9, scope: !806)
!811 = !DILocation(line: 620, column: 14, scope: !812)
!812 = distinct !DILexicalBlock(scope: !805, file: !1, line: 619, column: 7)
!813 = !DILocation(line: 620, column: 26, scope: !812)
!814 = !DILocation(line: 620, column: 15, scope: !812)
!815 = !DILocation(line: 620, column: 31, scope: !812)
!816 = !DILocation(line: 620, column: 13, scope: !812)
!817 = !DILocation(line: 621, column: 24, scope: !812)
!818 = !DILocation(line: 621, column: 35, scope: !812)
!819 = !DILocation(line: 621, column: 23, scope: !812)
!820 = !DILocation(line: 622, column: 7, scope: !812)
!821 = !DILocation(line: 623, column: 3, scope: !806)
!822 = !DILocation(line: 616, column: 41, scope: !798)
!823 = !DILocation(line: 616, column: 3, scope: !798)
!824 = distinct !{!824, !803, !825}
!825 = !DILocation(line: 623, column: 3, scope: !795)
!826 = !DILocation(line: 624, column: 48, scope: !699)
!827 = !DILocation(line: 624, column: 25, scope: !699)
!828 = !DILocation(line: 624, column: 14, scope: !699)
!829 = !DILocation(line: 624, column: 13, scope: !699)
!830 = !DILocation(line: 625, column: 43, scope: !699)
!831 = !DILocation(line: 625, column: 34, scope: !699)
!832 = !DILocation(line: 625, column: 48, scope: !699)
!833 = !DILocation(line: 625, column: 47, scope: !699)
!834 = !DILocation(line: 625, column: 53, scope: !699)
!835 = !DILocation(line: 625, column: 29, scope: !699)
!836 = !DILocation(line: 625, column: 28, scope: !699)
!837 = !DILocation(line: 625, column: 11, scope: !699)
!838 = !DILocation(line: 625, column: 10, scope: !699)
!839 = !DILocation(line: 626, column: 7, scope: !840)
!840 = distinct !DILexicalBlock(scope: !699, file: !1, line: 626, column: 7)
!841 = !DILocation(line: 626, column: 14, scope: !840)
!842 = !DILocation(line: 626, column: 20, scope: !840)
!843 = !DILocation(line: 626, column: 7, scope: !699)
!844 = !DILocation(line: 628, column: 28, scope: !840)
!845 = !DILocation(line: 627, column: 12, scope: !840)
!846 = !DILocation(line: 627, column: 5, scope: !840)
!847 = !DILocation(line: 632, column: 26, scope: !699)
!848 = !DILocation(line: 632, column: 47, scope: !699)
!849 = !DILocation(line: 632, column: 15, scope: !699)
!850 = !DILocation(line: 632, column: 14, scope: !699)
!851 = !DILocation(line: 633, column: 7, scope: !852)
!852 = distinct !DILexicalBlock(scope: !699, file: !1, line: 633, column: 7)
!853 = !DILocation(line: 633, column: 19, scope: !852)
!854 = !DILocation(line: 633, column: 7, scope: !699)
!855 = !DILocation(line: 634, column: 5, scope: !852)
!856 = !DILocalVariable(name: "angle", scope: !857, file: !1, line: 637, type: !599)
!857 = distinct !DILexicalBlock(scope: !699, file: !1, line: 635, column: 3)
!858 = !DILocation(line: 637, column: 7, scope: !857)
!859 = !DILocation(line: 639, column: 31, scope: !857)
!860 = !DILocation(line: 639, column: 56, scope: !857)
!861 = !DILocation(line: 639, column: 12, scope: !857)
!862 = !DILocation(line: 640, column: 29, scope: !857)
!863 = !DILocation(line: 640, column: 56, scope: !857)
!864 = !DILocation(line: 640, column: 12, scope: !857)
!865 = !DILocation(line: 642, column: 37, scope: !699)
!866 = !DILocation(line: 642, column: 10, scope: !699)
!867 = !DILocation(line: 643, column: 55, scope: !699)
!868 = !DILocation(line: 643, column: 41, scope: !699)
!869 = !DILocation(line: 643, column: 24, scope: !699)
!870 = !DILocation(line: 643, column: 20, scope: !699)
!871 = !DILocation(line: 643, column: 17, scope: !699)
!872 = !DILocation(line: 643, column: 19, scope: !699)
!873 = !DILocation(line: 644, column: 55, scope: !699)
!874 = !DILocation(line: 644, column: 41, scope: !699)
!875 = !DILocation(line: 644, column: 24, scope: !699)
!876 = !DILocation(line: 644, column: 20, scope: !699)
!877 = !DILocation(line: 644, column: 17, scope: !699)
!878 = !DILocation(line: 644, column: 19, scope: !699)
!879 = !DILocation(line: 645, column: 57, scope: !699)
!880 = !DILocation(line: 645, column: 43, scope: !699)
!881 = !DILocation(line: 645, column: 26, scope: !699)
!882 = !DILocation(line: 645, column: 22, scope: !699)
!883 = !DILocation(line: 645, column: 21, scope: !699)
!884 = !DILocation(line: 645, column: 17, scope: !699)
!885 = !DILocation(line: 645, column: 19, scope: !699)
!886 = !DILocation(line: 646, column: 55, scope: !699)
!887 = !DILocation(line: 646, column: 41, scope: !699)
!888 = !DILocation(line: 646, column: 24, scope: !699)
!889 = !DILocation(line: 646, column: 20, scope: !699)
!890 = !DILocation(line: 646, column: 17, scope: !699)
!891 = !DILocation(line: 646, column: 19, scope: !699)
!892 = !DILocation(line: 647, column: 17, scope: !699)
!893 = !DILocation(line: 647, column: 19, scope: !699)
!894 = !DILocation(line: 648, column: 17, scope: !699)
!895 = !DILocation(line: 648, column: 19, scope: !699)
!896 = !DILocation(line: 649, column: 29, scope: !699)
!897 = !DILocation(line: 649, column: 12, scope: !699)
!898 = !DILocation(line: 649, column: 11, scope: !699)
!899 = !DILocation(line: 650, column: 7, scope: !900)
!900 = distinct !DILexicalBlock(scope: !699, file: !1, line: 650, column: 7)
!901 = !DILocation(line: 650, column: 16, scope: !900)
!902 = !DILocation(line: 650, column: 7, scope: !699)
!903 = !DILocation(line: 652, column: 41, scope: !904)
!904 = distinct !DILexicalBlock(scope: !900, file: !1, line: 651, column: 5)
!905 = !DILocation(line: 652, column: 68, scope: !904)
!906 = !DILocation(line: 652, column: 20, scope: !904)
!907 = !DILocation(line: 652, column: 19, scope: !904)
!908 = !DILocation(line: 653, column: 32, scope: !904)
!909 = !DILocation(line: 653, column: 19, scope: !904)
!910 = !DILocation(line: 653, column: 18, scope: !904)
!911 = !DILocation(line: 654, column: 14, scope: !904)
!912 = !DILocation(line: 654, column: 7, scope: !904)
!913 = !DILocation(line: 659, column: 27, scope: !699)
!914 = !DILocation(line: 659, column: 62, scope: !699)
!915 = !DILocation(line: 659, column: 49, scope: !699)
!916 = !DILocation(line: 660, column: 5, scope: !699)
!917 = !DILocation(line: 659, column: 3, scope: !699)
!918 = !DILocation(line: 661, column: 37, scope: !699)
!919 = !DILocation(line: 661, column: 64, scope: !699)
!920 = !DILocation(line: 661, column: 16, scope: !699)
!921 = !DILocation(line: 661, column: 15, scope: !699)
!922 = !DILocation(line: 662, column: 28, scope: !699)
!923 = !DILocation(line: 662, column: 15, scope: !699)
!924 = !DILocation(line: 662, column: 14, scope: !699)
!925 = !DILocation(line: 663, column: 7, scope: !926)
!926 = distinct !DILexicalBlock(scope: !699, file: !1, line: 663, column: 7)
!927 = !DILocation(line: 663, column: 20, scope: !926)
!928 = !DILocation(line: 663, column: 7, scope: !699)
!929 = !DILocation(line: 664, column: 5, scope: !926)
!930 = !DILocation(line: 665, column: 31, scope: !699)
!931 = !DILocation(line: 665, column: 64, scope: !699)
!932 = !DILocation(line: 665, column: 16, scope: !699)
!933 = !DILocation(line: 665, column: 15, scope: !699)
!934 = !DILocation(line: 666, column: 7, scope: !935)
!935 = distinct !DILexicalBlock(scope: !699, file: !1, line: 666, column: 7)
!936 = !DILocation(line: 666, column: 20, scope: !935)
!937 = !DILocation(line: 666, column: 7, scope: !699)
!938 = !DILocation(line: 668, column: 33, scope: !939)
!939 = distinct !DILexicalBlock(scope: !935, file: !1, line: 667, column: 5)
!940 = !DILocation(line: 668, column: 20, scope: !939)
!941 = !DILocation(line: 668, column: 19, scope: !939)
!942 = !DILocation(line: 669, column: 7, scope: !939)
!943 = !DILocation(line: 671, column: 32, scope: !699)
!944 = !DILocation(line: 671, column: 45, scope: !699)
!945 = !DILocation(line: 671, column: 12, scope: !699)
!946 = !DILocation(line: 672, column: 29, scope: !699)
!947 = !DILocation(line: 672, column: 16, scope: !699)
!948 = !DILocation(line: 672, column: 15, scope: !699)
!949 = !DILocation(line: 673, column: 7, scope: !950)
!950 = distinct !DILexicalBlock(scope: !699, file: !1, line: 673, column: 7)
!951 = !DILocation(line: 673, column: 14, scope: !950)
!952 = !DILocation(line: 673, column: 20, scope: !950)
!953 = !DILocation(line: 673, column: 7, scope: !699)
!954 = !DILocation(line: 675, column: 51, scope: !950)
!955 = !DILocation(line: 675, column: 33, scope: !950)
!956 = !DILocation(line: 676, column: 16, scope: !950)
!957 = !DILocation(line: 675, column: 57, scope: !950)
!958 = !DILocation(line: 676, column: 41, scope: !950)
!959 = !DILocation(line: 676, column: 23, scope: !950)
!960 = !DILocation(line: 676, column: 61, scope: !950)
!961 = !DILocation(line: 676, column: 43, scope: !950)
!962 = !DILocation(line: 674, column: 12, scope: !950)
!963 = !DILocation(line: 674, column: 5, scope: !950)
!964 = !DILocation(line: 677, column: 24, scope: !699)
!965 = !DILocation(line: 677, column: 47, scope: !699)
!966 = !DILocation(line: 677, column: 14, scope: !699)
!967 = !DILocation(line: 677, column: 13, scope: !699)
!968 = !DILocation(line: 678, column: 29, scope: !699)
!969 = !DILocation(line: 678, column: 16, scope: !699)
!970 = !DILocation(line: 678, column: 15, scope: !699)
!971 = !DILocation(line: 679, column: 10, scope: !699)
!972 = !DILocation(line: 679, column: 3, scope: !699)
!973 = !DILocation(line: 680, column: 1, scope: !699)
!974 = distinct !DISubprogram(name: "RadonTransform", scope: !1, file: !1, line: 329, type: !975, scopeLine: 331, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !673)
!975 = !DISubroutineType(types: !976)
!976 = !{!445, !702, !704, !683, !672}
!977 = !DILocalVariable(name: "image", arg: 1, scope: !974, file: !1, line: 329, type: !702)
!978 = !DILocation(line: 329, column: 54, scope: !974)
!979 = !DILocalVariable(name: "threshold", arg: 2, scope: !974, file: !1, line: 330, type: !704)
!980 = !DILocation(line: 330, column: 16, scope: !974)
!981 = !DILocalVariable(name: "projection", arg: 3, scope: !974, file: !1, line: 330, type: !683)
!982 = !DILocation(line: 330, column: 34, scope: !974)
!983 = !DILocalVariable(name: "exception", arg: 4, scope: !974, file: !1, line: 330, type: !672)
!984 = !DILocation(line: 330, column: 60, scope: !974)
!985 = !DILocalVariable(name: "image_view", scope: !974, file: !1, line: 333, type: !986)
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 64)
!987 = !DIDerivedType(tag: DW_TAG_typedef, name: "CacheView", file: !394, line: 50, baseType: !988)
!988 = !DICompositeType(tag: DW_TAG_structure_type, name: "_CacheView", file: !326, line: 160, flags: DIFlagFwdDecl)
!989 = !DILocation(line: 333, column: 6, scope: !974)
!990 = !DILocalVariable(name: "destination_matrix", scope: !974, file: !1, line: 336, type: !690)
!991 = !DILocation(line: 336, column: 6, scope: !974)
!992 = !DILocalVariable(name: "source_matrix", scope: !974, file: !1, line: 337, type: !690)
!993 = !DILocation(line: 337, column: 6, scope: !974)
!994 = !DILocalVariable(name: "status", scope: !974, file: !1, line: 340, type: !445)
!995 = !DILocation(line: 340, column: 5, scope: !974)
!996 = !DILocalVariable(name: "i", scope: !974, file: !1, line: 343, type: !510)
!997 = !DILocation(line: 343, column: 5, scope: !974)
!998 = !DILocalVariable(name: "count", scope: !974, file: !1, line: 346, type: !457)
!999 = !DILocation(line: 346, column: 5, scope: !974)
!1000 = !DILocalVariable(name: "width", scope: !974, file: !1, line: 347, type: !457)
!1001 = !DILocation(line: 347, column: 5, scope: !974)
!1002 = !DILocalVariable(name: "y", scope: !974, file: !1, line: 350, type: !510)
!1003 = !DILocation(line: 350, column: 5, scope: !974)
!1004 = !DILocalVariable(name: "byte", scope: !974, file: !1, line: 353, type: !636)
!1005 = !DILocation(line: 353, column: 5, scope: !974)
!1006 = !DILocalVariable(name: "bits", scope: !974, file: !1, line: 356, type: !1007)
!1007 = !DICompositeType(tag: DW_TAG_array_type, baseType: !475, size: 4096, elements: !1008)
!1008 = !{!1009}
!1009 = !DISubrange(count: 256)
!1010 = !DILocation(line: 356, column: 5, scope: !974)
!1011 = !DILocation(line: 358, column: 13, scope: !1012)
!1012 = distinct !DILexicalBlock(scope: !974, file: !1, line: 358, column: 3)
!1013 = !DILocation(line: 358, column: 8, scope: !1012)
!1014 = !DILocation(line: 358, column: 17, scope: !1015)
!1015 = distinct !DILexicalBlock(scope: !1012, file: !1, line: 358, column: 3)
!1016 = !DILocation(line: 358, column: 27, scope: !1015)
!1017 = !DILocation(line: 358, column: 34, scope: !1015)
!1018 = !DILocation(line: 358, column: 41, scope: !1015)
!1019 = !DILocation(line: 358, column: 44, scope: !1015)
!1020 = !DILocation(line: 358, column: 23, scope: !1015)
!1021 = !DILocation(line: 358, column: 3, scope: !1012)
!1022 = !DILocation(line: 358, column: 54, scope: !1015)
!1023 = !DILocation(line: 358, column: 3, scope: !1015)
!1024 = distinct !{!1024, !1021, !1025}
!1025 = !DILocation(line: 358, column: 60, scope: !1012)
!1026 = !DILocation(line: 359, column: 35, scope: !974)
!1027 = !DILocation(line: 359, column: 41, scope: !974)
!1028 = !DILocation(line: 359, column: 48, scope: !974)
!1029 = !DILocation(line: 360, column: 5, scope: !974)
!1030 = !DILocation(line: 359, column: 17, scope: !974)
!1031 = !DILocation(line: 359, column: 16, scope: !974)
!1032 = !DILocation(line: 361, column: 40, scope: !974)
!1033 = !DILocation(line: 361, column: 46, scope: !974)
!1034 = !DILocation(line: 361, column: 53, scope: !974)
!1035 = !DILocation(line: 362, column: 5, scope: !974)
!1036 = !DILocation(line: 361, column: 22, scope: !974)
!1037 = !DILocation(line: 361, column: 21, scope: !974)
!1038 = !DILocation(line: 363, column: 8, scope: !1039)
!1039 = distinct !DILexicalBlock(scope: !974, file: !1, line: 363, column: 7)
!1040 = !DILocation(line: 363, column: 22, scope: !1039)
!1041 = !DILocation(line: 363, column: 46, scope: !1039)
!1042 = !DILocation(line: 364, column: 8, scope: !1039)
!1043 = !DILocation(line: 364, column: 27, scope: !1039)
!1044 = !DILocation(line: 363, column: 7, scope: !974)
!1045 = !DILocation(line: 366, column: 11, scope: !1046)
!1046 = distinct !DILexicalBlock(scope: !1047, file: !1, line: 366, column: 11)
!1047 = distinct !DILexicalBlock(scope: !1039, file: !1, line: 365, column: 5)
!1048 = !DILocation(line: 366, column: 30, scope: !1046)
!1049 = !DILocation(line: 366, column: 11, scope: !1047)
!1050 = !DILocation(line: 367, column: 46, scope: !1046)
!1051 = !DILocation(line: 367, column: 28, scope: !1046)
!1052 = !DILocation(line: 367, column: 27, scope: !1046)
!1053 = !DILocation(line: 367, column: 9, scope: !1046)
!1054 = !DILocation(line: 368, column: 11, scope: !1055)
!1055 = distinct !DILexicalBlock(scope: !1047, file: !1, line: 368, column: 11)
!1056 = !DILocation(line: 368, column: 25, scope: !1055)
!1057 = !DILocation(line: 368, column: 11, scope: !1047)
!1058 = !DILocation(line: 369, column: 41, scope: !1055)
!1059 = !DILocation(line: 369, column: 23, scope: !1055)
!1060 = !DILocation(line: 369, column: 22, scope: !1055)
!1061 = !DILocation(line: 369, column: 9, scope: !1055)
!1062 = !DILocation(line: 370, column: 7, scope: !1047)
!1063 = !DILocation(line: 372, column: 18, scope: !1064)
!1064 = distinct !DILexicalBlock(scope: !974, file: !1, line: 372, column: 7)
!1065 = !DILocation(line: 372, column: 7, scope: !1064)
!1066 = !DILocation(line: 372, column: 33, scope: !1064)
!1067 = !DILocation(line: 372, column: 7, scope: !974)
!1068 = !DILocation(line: 374, column: 44, scope: !1069)
!1069 = distinct !DILexicalBlock(scope: !1064, file: !1, line: 373, column: 5)
!1070 = !DILocation(line: 374, column: 26, scope: !1069)
!1071 = !DILocation(line: 374, column: 25, scope: !1069)
!1072 = !DILocation(line: 375, column: 39, scope: !1069)
!1073 = !DILocation(line: 375, column: 21, scope: !1069)
!1074 = !DILocation(line: 375, column: 20, scope: !1069)
!1075 = !DILocation(line: 376, column: 7, scope: !1069)
!1076 = !DILocation(line: 378, column: 9, scope: !1077)
!1077 = distinct !DILexicalBlock(scope: !974, file: !1, line: 378, column: 3)
!1078 = !DILocation(line: 378, column: 8, scope: !1077)
!1079 = !DILocation(line: 378, column: 13, scope: !1080)
!1080 = distinct !DILexicalBlock(scope: !1077, file: !1, line: 378, column: 3)
!1081 = !DILocation(line: 378, column: 15, scope: !1080)
!1082 = !DILocation(line: 378, column: 3, scope: !1077)
!1083 = !DILocation(line: 380, column: 26, scope: !1084)
!1084 = distinct !DILexicalBlock(scope: !1080, file: !1, line: 379, column: 3)
!1085 = !DILocation(line: 380, column: 10, scope: !1084)
!1086 = !DILocation(line: 380, column: 9, scope: !1084)
!1087 = !DILocation(line: 381, column: 15, scope: !1088)
!1088 = distinct !DILexicalBlock(scope: !1084, file: !1, line: 381, column: 5)
!1089 = !DILocation(line: 381, column: 10, scope: !1088)
!1090 = !DILocation(line: 381, column: 19, scope: !1091)
!1091 = distinct !DILexicalBlock(scope: !1088, file: !1, line: 381, column: 5)
!1092 = !DILocation(line: 381, column: 24, scope: !1091)
!1093 = !DILocation(line: 381, column: 5, scope: !1088)
!1094 = !DILocation(line: 382, column: 14, scope: !1091)
!1095 = !DILocation(line: 382, column: 19, scope: !1091)
!1096 = !DILocation(line: 382, column: 12, scope: !1091)
!1097 = !DILocation(line: 382, column: 7, scope: !1091)
!1098 = !DILocation(line: 381, column: 34, scope: !1091)
!1099 = !DILocation(line: 381, column: 5, scope: !1091)
!1100 = distinct !{!1100, !1093, !1101}
!1101 = !DILocation(line: 382, column: 21, scope: !1088)
!1102 = !DILocation(line: 383, column: 30, scope: !1084)
!1103 = !DILocation(line: 383, column: 13, scope: !1084)
!1104 = !DILocation(line: 383, column: 10, scope: !1084)
!1105 = !DILocation(line: 383, column: 5, scope: !1084)
!1106 = !DILocation(line: 383, column: 12, scope: !1084)
!1107 = !DILocation(line: 384, column: 3, scope: !1084)
!1108 = !DILocation(line: 378, column: 23, scope: !1080)
!1109 = !DILocation(line: 378, column: 3, scope: !1080)
!1110 = distinct !{!1110, !1082, !1111}
!1111 = !DILocation(line: 384, column: 3, scope: !1077)
!1112 = !DILocation(line: 385, column: 9, scope: !974)
!1113 = !DILocation(line: 386, column: 38, scope: !974)
!1114 = !DILocation(line: 386, column: 44, scope: !974)
!1115 = !DILocation(line: 386, column: 14, scope: !974)
!1116 = !DILocation(line: 386, column: 13, scope: !974)
!1117 = !DILocation(line: 391, column: 9, scope: !1118)
!1118 = distinct !DILexicalBlock(scope: !974, file: !1, line: 391, column: 3)
!1119 = !DILocation(line: 391, column: 8, scope: !1118)
!1120 = !DILocation(line: 391, column: 13, scope: !1121)
!1121 = distinct !DILexicalBlock(scope: !1118, file: !1, line: 391, column: 3)
!1122 = !DILocation(line: 391, column: 27, scope: !1121)
!1123 = !DILocation(line: 391, column: 34, scope: !1121)
!1124 = !DILocation(line: 391, column: 15, scope: !1121)
!1125 = !DILocation(line: 391, column: 3, scope: !1118)
!1126 = !DILocalVariable(name: "p", scope: !1127, file: !1, line: 394, type: !1128)
!1127 = distinct !DILexicalBlock(scope: !1121, file: !1, line: 392, column: 3)
!1128 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !684)
!1129 = !DILocation(line: 394, column: 17, scope: !1127)
!1130 = !DILocalVariable(name: "i", scope: !1127, file: !1, line: 397, type: !510)
!1131 = !DILocation(line: 397, column: 7, scope: !1127)
!1132 = !DILocalVariable(name: "x", scope: !1127, file: !1, line: 398, type: !510)
!1133 = !DILocation(line: 398, column: 7, scope: !1127)
!1134 = !DILocalVariable(name: "bit", scope: !1127, file: !1, line: 401, type: !457)
!1135 = !DILocation(line: 401, column: 7, scope: !1127)
!1136 = !DILocalVariable(name: "byte", scope: !1127, file: !1, line: 402, type: !457)
!1137 = !DILocation(line: 402, column: 7, scope: !1127)
!1138 = !DILocalVariable(name: "value", scope: !1127, file: !1, line: 405, type: !475)
!1139 = !DILocation(line: 405, column: 7, scope: !1127)
!1140 = !DILocation(line: 407, column: 9, scope: !1141)
!1141 = distinct !DILexicalBlock(scope: !1127, file: !1, line: 407, column: 9)
!1142 = !DILocation(line: 407, column: 16, scope: !1141)
!1143 = !DILocation(line: 407, column: 9, scope: !1127)
!1144 = !DILocation(line: 408, column: 7, scope: !1141)
!1145 = !DILocation(line: 409, column: 33, scope: !1127)
!1146 = !DILocation(line: 409, column: 46, scope: !1127)
!1147 = !DILocation(line: 409, column: 48, scope: !1127)
!1148 = !DILocation(line: 409, column: 55, scope: !1127)
!1149 = !DILocation(line: 409, column: 65, scope: !1127)
!1150 = !DILocation(line: 409, column: 7, scope: !1127)
!1151 = !DILocation(line: 409, column: 6, scope: !1127)
!1152 = !DILocation(line: 410, column: 9, scope: !1153)
!1153 = distinct !DILexicalBlock(scope: !1127, file: !1, line: 410, column: 9)
!1154 = !DILocation(line: 410, column: 11, scope: !1153)
!1155 = !DILocation(line: 410, column: 9, scope: !1127)
!1156 = !DILocation(line: 412, column: 15, scope: !1157)
!1157 = distinct !DILexicalBlock(scope: !1153, file: !1, line: 411, column: 7)
!1158 = !DILocation(line: 413, column: 9, scope: !1157)
!1159 = !DILocation(line: 415, column: 8, scope: !1127)
!1160 = !DILocation(line: 416, column: 9, scope: !1127)
!1161 = !DILocation(line: 417, column: 18, scope: !1127)
!1162 = !DILocation(line: 417, column: 25, scope: !1127)
!1163 = !DILocation(line: 417, column: 32, scope: !1127)
!1164 = !DILocation(line: 417, column: 35, scope: !1127)
!1165 = !DILocation(line: 417, column: 6, scope: !1127)
!1166 = !DILocation(line: 418, column: 11, scope: !1167)
!1167 = distinct !DILexicalBlock(scope: !1127, file: !1, line: 418, column: 5)
!1168 = !DILocation(line: 418, column: 10, scope: !1167)
!1169 = !DILocation(line: 418, column: 15, scope: !1170)
!1170 = distinct !DILexicalBlock(scope: !1167, file: !1, line: 418, column: 5)
!1171 = !DILocation(line: 418, column: 29, scope: !1170)
!1172 = !DILocation(line: 418, column: 36, scope: !1170)
!1173 = !DILocation(line: 418, column: 17, scope: !1170)
!1174 = !DILocation(line: 418, column: 5, scope: !1167)
!1175 = !DILocation(line: 420, column: 11, scope: !1176)
!1176 = distinct !DILexicalBlock(scope: !1170, file: !1, line: 419, column: 5)
!1177 = !DILocation(line: 421, column: 29, scope: !1178)
!1178 = distinct !DILexicalBlock(scope: !1176, file: !1, line: 421, column: 11)
!1179 = !DILocation(line: 421, column: 12, scope: !1178)
!1180 = !DILocation(line: 421, column: 46, scope: !1178)
!1181 = !DILocation(line: 421, column: 44, scope: !1178)
!1182 = !DILocation(line: 421, column: 57, scope: !1178)
!1183 = !DILocation(line: 422, column: 29, scope: !1178)
!1184 = !DILocation(line: 422, column: 12, scope: !1178)
!1185 = !DILocation(line: 422, column: 48, scope: !1178)
!1186 = !DILocation(line: 422, column: 46, scope: !1178)
!1187 = !DILocation(line: 422, column: 59, scope: !1178)
!1188 = !DILocation(line: 423, column: 29, scope: !1178)
!1189 = !DILocation(line: 423, column: 12, scope: !1178)
!1190 = !DILocation(line: 423, column: 47, scope: !1178)
!1191 = !DILocation(line: 423, column: 45, scope: !1178)
!1192 = !DILocation(line: 421, column: 11, scope: !1176)
!1193 = !DILocation(line: 424, column: 13, scope: !1178)
!1194 = !DILocation(line: 424, column: 9, scope: !1178)
!1195 = !DILocation(line: 425, column: 10, scope: !1176)
!1196 = !DILocation(line: 426, column: 11, scope: !1197)
!1197 = distinct !DILexicalBlock(scope: !1176, file: !1, line: 426, column: 11)
!1198 = !DILocation(line: 426, column: 15, scope: !1197)
!1199 = !DILocation(line: 426, column: 11, scope: !1176)
!1200 = !DILocation(line: 428, column: 22, scope: !1201)
!1201 = distinct !DILexicalBlock(scope: !1197, file: !1, line: 427, column: 9)
!1202 = !DILocation(line: 428, column: 17, scope: !1201)
!1203 = !DILocation(line: 428, column: 16, scope: !1201)
!1204 = !DILocation(line: 429, column: 35, scope: !1201)
!1205 = !DILocation(line: 429, column: 49, scope: !1201)
!1206 = !DILocation(line: 429, column: 53, scope: !1201)
!1207 = !DILocation(line: 429, column: 55, scope: !1201)
!1208 = !DILocation(line: 429, column: 18, scope: !1201)
!1209 = !DILocation(line: 430, column: 14, scope: !1201)
!1210 = !DILocation(line: 431, column: 15, scope: !1201)
!1211 = !DILocation(line: 432, column: 9, scope: !1201)
!1212 = !DILocation(line: 433, column: 8, scope: !1176)
!1213 = !DILocation(line: 434, column: 5, scope: !1176)
!1214 = !DILocation(line: 418, column: 46, scope: !1170)
!1215 = !DILocation(line: 418, column: 5, scope: !1170)
!1216 = distinct !{!1216, !1174, !1217}
!1217 = !DILocation(line: 434, column: 5, scope: !1167)
!1218 = !DILocation(line: 435, column: 9, scope: !1219)
!1219 = distinct !DILexicalBlock(scope: !1127, file: !1, line: 435, column: 9)
!1220 = !DILocation(line: 435, column: 13, scope: !1219)
!1221 = !DILocation(line: 435, column: 9, scope: !1127)
!1222 = !DILocation(line: 437, column: 19, scope: !1223)
!1223 = distinct !DILexicalBlock(scope: !1219, file: !1, line: 436, column: 7)
!1224 = !DILocation(line: 437, column: 18, scope: !1223)
!1225 = !DILocation(line: 437, column: 13, scope: !1223)
!1226 = !DILocation(line: 438, column: 20, scope: !1223)
!1227 = !DILocation(line: 438, column: 15, scope: !1223)
!1228 = !DILocation(line: 438, column: 14, scope: !1223)
!1229 = !DILocation(line: 439, column: 33, scope: !1223)
!1230 = !DILocation(line: 439, column: 47, scope: !1223)
!1231 = !DILocation(line: 439, column: 51, scope: !1223)
!1232 = !DILocation(line: 439, column: 53, scope: !1223)
!1233 = !DILocation(line: 439, column: 16, scope: !1223)
!1234 = !DILocation(line: 440, column: 7, scope: !1223)
!1235 = !DILocation(line: 441, column: 3, scope: !1127)
!1236 = !DILocation(line: 391, column: 41, scope: !1121)
!1237 = !DILocation(line: 391, column: 3, scope: !1121)
!1238 = distinct !{!1238, !1125, !1239}
!1239 = !DILocation(line: 441, column: 3, scope: !1118)
!1240 = !DILocation(line: 442, column: 19, scope: !974)
!1241 = !DILocation(line: 442, column: 25, scope: !974)
!1242 = !DILocation(line: 442, column: 39, scope: !974)
!1243 = !DILocation(line: 442, column: 61, scope: !974)
!1244 = !DILocation(line: 442, column: 3, scope: !974)
!1245 = !DILocation(line: 443, column: 21, scope: !974)
!1246 = !DILocation(line: 443, column: 10, scope: !974)
!1247 = !DILocation(line: 448, column: 9, scope: !1248)
!1248 = distinct !DILexicalBlock(scope: !974, file: !1, line: 448, column: 3)
!1249 = !DILocation(line: 448, column: 8, scope: !1248)
!1250 = !DILocation(line: 448, column: 13, scope: !1251)
!1251 = distinct !DILexicalBlock(scope: !1248, file: !1, line: 448, column: 3)
!1252 = !DILocation(line: 448, column: 27, scope: !1251)
!1253 = !DILocation(line: 448, column: 34, scope: !1251)
!1254 = !DILocation(line: 448, column: 15, scope: !1251)
!1255 = !DILocation(line: 448, column: 3, scope: !1248)
!1256 = !DILocalVariable(name: "p", scope: !1257, file: !1, line: 451, type: !1128)
!1257 = distinct !DILexicalBlock(scope: !1251, file: !1, line: 449, column: 3)
!1258 = !DILocation(line: 451, column: 17, scope: !1257)
!1259 = !DILocalVariable(name: "i", scope: !1257, file: !1, line: 454, type: !510)
!1260 = !DILocation(line: 454, column: 7, scope: !1257)
!1261 = !DILocalVariable(name: "x", scope: !1257, file: !1, line: 455, type: !510)
!1262 = !DILocation(line: 455, column: 7, scope: !1257)
!1263 = !DILocalVariable(name: "bit", scope: !1257, file: !1, line: 458, type: !457)
!1264 = !DILocation(line: 458, column: 7, scope: !1257)
!1265 = !DILocalVariable(name: "byte", scope: !1257, file: !1, line: 459, type: !457)
!1266 = !DILocation(line: 459, column: 7, scope: !1257)
!1267 = !DILocalVariable(name: "value", scope: !1257, file: !1, line: 462, type: !475)
!1268 = !DILocation(line: 462, column: 6, scope: !1257)
!1269 = !DILocation(line: 464, column: 9, scope: !1270)
!1270 = distinct !DILexicalBlock(scope: !1257, file: !1, line: 464, column: 9)
!1271 = !DILocation(line: 464, column: 16, scope: !1270)
!1272 = !DILocation(line: 464, column: 9, scope: !1257)
!1273 = !DILocation(line: 465, column: 7, scope: !1270)
!1274 = !DILocation(line: 466, column: 33, scope: !1257)
!1275 = !DILocation(line: 466, column: 46, scope: !1257)
!1276 = !DILocation(line: 466, column: 48, scope: !1257)
!1277 = !DILocation(line: 466, column: 55, scope: !1257)
!1278 = !DILocation(line: 466, column: 65, scope: !1257)
!1279 = !DILocation(line: 466, column: 7, scope: !1257)
!1280 = !DILocation(line: 466, column: 6, scope: !1257)
!1281 = !DILocation(line: 467, column: 9, scope: !1282)
!1282 = distinct !DILexicalBlock(scope: !1257, file: !1, line: 467, column: 9)
!1283 = !DILocation(line: 467, column: 11, scope: !1282)
!1284 = !DILocation(line: 467, column: 9, scope: !1257)
!1285 = !DILocation(line: 469, column: 15, scope: !1286)
!1286 = distinct !DILexicalBlock(scope: !1282, file: !1, line: 468, column: 7)
!1287 = !DILocation(line: 470, column: 9, scope: !1286)
!1288 = !DILocation(line: 472, column: 8, scope: !1257)
!1289 = !DILocation(line: 473, column: 9, scope: !1257)
!1290 = !DILocation(line: 474, column: 6, scope: !1257)
!1291 = !DILocation(line: 475, column: 11, scope: !1292)
!1292 = distinct !DILexicalBlock(scope: !1257, file: !1, line: 475, column: 5)
!1293 = !DILocation(line: 475, column: 10, scope: !1292)
!1294 = !DILocation(line: 475, column: 15, scope: !1295)
!1295 = distinct !DILexicalBlock(scope: !1292, file: !1, line: 475, column: 5)
!1296 = !DILocation(line: 475, column: 29, scope: !1295)
!1297 = !DILocation(line: 475, column: 36, scope: !1295)
!1298 = !DILocation(line: 475, column: 17, scope: !1295)
!1299 = !DILocation(line: 475, column: 5, scope: !1292)
!1300 = !DILocation(line: 477, column: 11, scope: !1301)
!1301 = distinct !DILexicalBlock(scope: !1295, file: !1, line: 476, column: 5)
!1302 = !DILocation(line: 478, column: 29, scope: !1303)
!1303 = distinct !DILexicalBlock(scope: !1301, file: !1, line: 478, column: 11)
!1304 = !DILocation(line: 478, column: 12, scope: !1303)
!1305 = !DILocation(line: 478, column: 46, scope: !1303)
!1306 = !DILocation(line: 478, column: 44, scope: !1303)
!1307 = !DILocation(line: 478, column: 57, scope: !1303)
!1308 = !DILocation(line: 479, column: 29, scope: !1303)
!1309 = !DILocation(line: 479, column: 12, scope: !1303)
!1310 = !DILocation(line: 479, column: 48, scope: !1303)
!1311 = !DILocation(line: 479, column: 46, scope: !1303)
!1312 = !DILocation(line: 479, column: 59, scope: !1303)
!1313 = !DILocation(line: 480, column: 29, scope: !1303)
!1314 = !DILocation(line: 480, column: 12, scope: !1303)
!1315 = !DILocation(line: 480, column: 47, scope: !1303)
!1316 = !DILocation(line: 480, column: 45, scope: !1303)
!1317 = !DILocation(line: 478, column: 11, scope: !1301)
!1318 = !DILocation(line: 481, column: 13, scope: !1303)
!1319 = !DILocation(line: 481, column: 9, scope: !1303)
!1320 = !DILocation(line: 482, column: 10, scope: !1301)
!1321 = !DILocation(line: 483, column: 11, scope: !1322)
!1322 = distinct !DILexicalBlock(scope: !1301, file: !1, line: 483, column: 11)
!1323 = !DILocation(line: 483, column: 15, scope: !1322)
!1324 = !DILocation(line: 483, column: 11, scope: !1301)
!1325 = !DILocation(line: 485, column: 22, scope: !1326)
!1326 = distinct !DILexicalBlock(scope: !1322, file: !1, line: 484, column: 9)
!1327 = !DILocation(line: 485, column: 17, scope: !1326)
!1328 = !DILocation(line: 485, column: 16, scope: !1326)
!1329 = !DILocation(line: 486, column: 35, scope: !1326)
!1330 = !DILocation(line: 486, column: 50, scope: !1326)
!1331 = !DILocation(line: 486, column: 53, scope: !1326)
!1332 = !DILocation(line: 486, column: 55, scope: !1326)
!1333 = !DILocation(line: 486, column: 18, scope: !1326)
!1334 = !DILocation(line: 487, column: 14, scope: !1326)
!1335 = !DILocation(line: 488, column: 15, scope: !1326)
!1336 = !DILocation(line: 489, column: 9, scope: !1326)
!1337 = !DILocation(line: 490, column: 8, scope: !1301)
!1338 = !DILocation(line: 491, column: 5, scope: !1301)
!1339 = !DILocation(line: 475, column: 46, scope: !1295)
!1340 = !DILocation(line: 475, column: 5, scope: !1295)
!1341 = distinct !{!1341, !1299, !1342}
!1342 = !DILocation(line: 491, column: 5, scope: !1292)
!1343 = !DILocation(line: 492, column: 9, scope: !1344)
!1344 = distinct !DILexicalBlock(scope: !1257, file: !1, line: 492, column: 9)
!1345 = !DILocation(line: 492, column: 13, scope: !1344)
!1346 = !DILocation(line: 492, column: 9, scope: !1257)
!1347 = !DILocation(line: 494, column: 19, scope: !1348)
!1348 = distinct !DILexicalBlock(scope: !1344, file: !1, line: 493, column: 7)
!1349 = !DILocation(line: 494, column: 18, scope: !1348)
!1350 = !DILocation(line: 494, column: 13, scope: !1348)
!1351 = !DILocation(line: 495, column: 20, scope: !1348)
!1352 = !DILocation(line: 495, column: 15, scope: !1348)
!1353 = !DILocation(line: 495, column: 14, scope: !1348)
!1354 = !DILocation(line: 496, column: 33, scope: !1348)
!1355 = !DILocation(line: 496, column: 48, scope: !1348)
!1356 = !DILocation(line: 496, column: 51, scope: !1348)
!1357 = !DILocation(line: 496, column: 53, scope: !1348)
!1358 = !DILocation(line: 496, column: 16, scope: !1348)
!1359 = !DILocation(line: 497, column: 7, scope: !1348)
!1360 = !DILocation(line: 498, column: 3, scope: !1257)
!1361 = !DILocation(line: 448, column: 41, scope: !1251)
!1362 = !DILocation(line: 448, column: 3, scope: !1251)
!1363 = distinct !{!1363, !1255, !1364}
!1364 = !DILocation(line: 498, column: 3, scope: !1248)
!1365 = !DILocation(line: 499, column: 19, scope: !974)
!1366 = !DILocation(line: 499, column: 25, scope: !974)
!1367 = !DILocation(line: 499, column: 39, scope: !974)
!1368 = !DILocation(line: 499, column: 60, scope: !974)
!1369 = !DILocation(line: 499, column: 3, scope: !974)
!1370 = !DILocation(line: 500, column: 31, scope: !974)
!1371 = !DILocation(line: 500, column: 14, scope: !974)
!1372 = !DILocation(line: 500, column: 13, scope: !974)
!1373 = !DILocation(line: 501, column: 40, scope: !974)
!1374 = !DILocation(line: 501, column: 22, scope: !974)
!1375 = !DILocation(line: 501, column: 21, scope: !974)
!1376 = !DILocation(line: 502, column: 35, scope: !974)
!1377 = !DILocation(line: 502, column: 17, scope: !974)
!1378 = !DILocation(line: 502, column: 16, scope: !974)
!1379 = !DILocation(line: 503, column: 3, scope: !974)
!1380 = !DILocation(line: 504, column: 1, scope: !974)
!1381 = distinct !DISubprogram(name: "RadiansToDegrees", scope: !1382, file: !1382, line: 59, type: !1383, scopeLine: 60, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !673)
!1382 = !DIFile(filename: "./magick/image-private.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!1383 = !DISubroutineType(types: !1384)
!1384 = !{!668, !667}
!1385 = !DILocalVariable(name: "radians", arg: 1, scope: !1381, file: !1382, line: 59, type: !667)
!1386 = !DILocation(line: 59, column: 68, scope: !1381)
!1387 = !DILocation(line: 61, column: 34, scope: !1381)
!1388 = !DILocation(line: 61, column: 33, scope: !1381)
!1389 = !DILocation(line: 61, column: 41, scope: !1381)
!1390 = !DILocation(line: 61, column: 10, scope: !1381)
!1391 = !DILocation(line: 61, column: 3, scope: !1381)
!1392 = distinct !DISubprogram(name: "DegreesToRadians", scope: !1382, file: !1382, line: 54, type: !1393, scopeLine: 55, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !673)
!1393 = !DISubroutineType(types: !1394)
!1394 = !{!483, !704}
!1395 = !DILocalVariable(name: "degrees", arg: 1, scope: !1392, file: !1382, line: 54, type: !704)
!1396 = !DILocation(line: 54, column: 52, scope: !1392)
!1397 = !DILocation(line: 56, column: 29, scope: !1392)
!1398 = !DILocation(line: 56, column: 28, scope: !1392)
!1399 = !DILocation(line: 56, column: 36, scope: !1392)
!1400 = !DILocation(line: 56, column: 3, scope: !1392)
!1401 = distinct !DISubprogram(name: "GetImageBackgroundColor", scope: !1, file: !1, line: 506, type: !1402, scopeLine: 508, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !673)
!1402 = !DISubroutineType(types: !1403)
!1403 = !{null, !446, !671, !672}
!1404 = !DILocalVariable(name: "image", arg: 1, scope: !1401, file: !1, line: 506, type: !446)
!1405 = !DILocation(line: 506, column: 44, scope: !1401)
!1406 = !DILocalVariable(name: "offset", arg: 2, scope: !1401, file: !1, line: 506, type: !671)
!1407 = !DILocation(line: 506, column: 64, scope: !1401)
!1408 = !DILocalVariable(name: "exception", arg: 3, scope: !1401, file: !1, line: 507, type: !672)
!1409 = !DILocation(line: 507, column: 18, scope: !1401)
!1410 = !DILocalVariable(name: "image_view", scope: !1401, file: !1, line: 510, type: !986)
!1411 = !DILocation(line: 510, column: 6, scope: !1401)
!1412 = !DILocalVariable(name: "background", scope: !1401, file: !1, line: 513, type: !1413)
!1413 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickPixelPacket", file: !326, line: 127, baseType: !1414)
!1414 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MagickPixelPacket", file: !326, line: 104, size: 448, elements: !1415)
!1415 = !{!1416, !1417, !1418, !1419, !1420, !1421, !1422, !1423, !1424, !1425}
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "storage_class", scope: !1414, file: !326, line: 107, baseType: !451, size: 32)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1414, file: !326, line: 110, baseType: !453, size: 32, offset: 32)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "matte", scope: !1414, file: !326, line: 113, baseType: !445, size: 32, offset: 64)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !1414, file: !326, line: 116, baseType: !483, size: 64, offset: 128)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !1414, file: !326, line: 119, baseType: !457, size: 64, offset: 192)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !1414, file: !326, line: 122, baseType: !668, size: 32, offset: 256)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !1414, file: !326, line: 123, baseType: !668, size: 32, offset: 288)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !1414, file: !326, line: 124, baseType: !668, size: 32, offset: 320)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !1414, file: !326, line: 125, baseType: !668, size: 32, offset: 352)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1414, file: !326, line: 126, baseType: !668, size: 32, offset: 384)
!1426 = !DILocation(line: 513, column: 5, scope: !1401)
!1427 = !DILocalVariable(name: "count", scope: !1401, file: !1, line: 516, type: !668)
!1428 = !DILocation(line: 516, column: 5, scope: !1401)
!1429 = !DILocalVariable(name: "y", scope: !1401, file: !1, line: 519, type: !510)
!1430 = !DILocation(line: 519, column: 5, scope: !1401)
!1431 = !DILocation(line: 524, column: 7, scope: !1432)
!1432 = distinct !DILexicalBlock(scope: !1401, file: !1, line: 524, column: 7)
!1433 = !DILocation(line: 524, column: 14, scope: !1432)
!1434 = !DILocation(line: 524, column: 7, scope: !1401)
!1435 = !DILocation(line: 525, column: 5, scope: !1432)
!1436 = !DILocation(line: 526, column: 24, scope: !1401)
!1437 = !DILocation(line: 526, column: 3, scope: !1401)
!1438 = !DILocation(line: 527, column: 8, scope: !1401)
!1439 = !DILocation(line: 528, column: 38, scope: !1401)
!1440 = !DILocation(line: 528, column: 44, scope: !1401)
!1441 = !DILocation(line: 528, column: 14, scope: !1401)
!1442 = !DILocation(line: 528, column: 13, scope: !1401)
!1443 = !DILocation(line: 529, column: 9, scope: !1444)
!1444 = distinct !DILexicalBlock(scope: !1401, file: !1, line: 529, column: 3)
!1445 = !DILocation(line: 529, column: 8, scope: !1444)
!1446 = !DILocation(line: 529, column: 13, scope: !1447)
!1447 = distinct !DILexicalBlock(scope: !1444, file: !1, line: 529, column: 3)
!1448 = !DILocation(line: 529, column: 27, scope: !1447)
!1449 = !DILocation(line: 529, column: 34, scope: !1447)
!1450 = !DILocation(line: 529, column: 15, scope: !1447)
!1451 = !DILocation(line: 529, column: 3, scope: !1444)
!1452 = !DILocalVariable(name: "p", scope: !1453, file: !1, line: 532, type: !1128)
!1453 = distinct !DILexicalBlock(scope: !1447, file: !1, line: 530, column: 3)
!1454 = !DILocation(line: 532, column: 17, scope: !1453)
!1455 = !DILocalVariable(name: "x", scope: !1453, file: !1, line: 535, type: !510)
!1456 = !DILocation(line: 535, column: 7, scope: !1453)
!1457 = !DILocation(line: 537, column: 10, scope: !1458)
!1458 = distinct !DILexicalBlock(scope: !1453, file: !1, line: 537, column: 9)
!1459 = !DILocation(line: 537, column: 15, scope: !1458)
!1460 = !DILocation(line: 537, column: 12, scope: !1458)
!1461 = !DILocation(line: 537, column: 23, scope: !1458)
!1462 = !DILocation(line: 537, column: 27, scope: !1458)
!1463 = !DILocation(line: 537, column: 42, scope: !1458)
!1464 = !DILocation(line: 537, column: 49, scope: !1458)
!1465 = !DILocation(line: 537, column: 54, scope: !1458)
!1466 = !DILocation(line: 537, column: 53, scope: !1458)
!1467 = !DILocation(line: 537, column: 29, scope: !1458)
!1468 = !DILocation(line: 537, column: 9, scope: !1453)
!1469 = !DILocation(line: 538, column: 7, scope: !1458)
!1470 = !DILocation(line: 539, column: 33, scope: !1453)
!1471 = !DILocation(line: 539, column: 46, scope: !1453)
!1472 = !DILocation(line: 539, column: 48, scope: !1453)
!1473 = !DILocation(line: 539, column: 55, scope: !1453)
!1474 = !DILocation(line: 539, column: 65, scope: !1453)
!1475 = !DILocation(line: 539, column: 7, scope: !1453)
!1476 = !DILocation(line: 539, column: 6, scope: !1453)
!1477 = !DILocation(line: 540, column: 9, scope: !1478)
!1478 = distinct !DILexicalBlock(scope: !1453, file: !1, line: 540, column: 9)
!1479 = !DILocation(line: 540, column: 11, scope: !1478)
!1480 = !DILocation(line: 540, column: 9, scope: !1453)
!1481 = !DILocation(line: 541, column: 7, scope: !1478)
!1482 = !DILocation(line: 542, column: 11, scope: !1483)
!1483 = distinct !DILexicalBlock(scope: !1453, file: !1, line: 542, column: 5)
!1484 = !DILocation(line: 542, column: 10, scope: !1483)
!1485 = !DILocation(line: 542, column: 15, scope: !1486)
!1486 = distinct !DILexicalBlock(scope: !1483, file: !1, line: 542, column: 5)
!1487 = !DILocation(line: 542, column: 29, scope: !1486)
!1488 = !DILocation(line: 542, column: 36, scope: !1486)
!1489 = !DILocation(line: 542, column: 17, scope: !1486)
!1490 = !DILocation(line: 542, column: 5, scope: !1483)
!1491 = !DILocation(line: 544, column: 12, scope: !1492)
!1492 = distinct !DILexicalBlock(scope: !1493, file: !1, line: 544, column: 11)
!1493 = distinct !DILexicalBlock(scope: !1486, file: !1, line: 543, column: 5)
!1494 = !DILocation(line: 544, column: 17, scope: !1492)
!1495 = !DILocation(line: 544, column: 14, scope: !1492)
!1496 = !DILocation(line: 544, column: 25, scope: !1492)
!1497 = !DILocation(line: 544, column: 29, scope: !1492)
!1498 = !DILocation(line: 544, column: 44, scope: !1492)
!1499 = !DILocation(line: 544, column: 51, scope: !1492)
!1500 = !DILocation(line: 544, column: 59, scope: !1492)
!1501 = !DILocation(line: 544, column: 58, scope: !1492)
!1502 = !DILocation(line: 544, column: 31, scope: !1492)
!1503 = !DILocation(line: 544, column: 11, scope: !1493)
!1504 = !DILocation(line: 545, column: 9, scope: !1492)
!1505 = !DILocation(line: 546, column: 36, scope: !1493)
!1506 = !DILocation(line: 546, column: 35, scope: !1493)
!1507 = !DILocation(line: 546, column: 18, scope: !1493)
!1508 = !DILocation(line: 546, column: 21, scope: !1493)
!1509 = !DILocation(line: 547, column: 38, scope: !1493)
!1510 = !DILocation(line: 547, column: 37, scope: !1493)
!1511 = !DILocation(line: 547, column: 18, scope: !1493)
!1512 = !DILocation(line: 547, column: 23, scope: !1493)
!1513 = !DILocation(line: 548, column: 37, scope: !1493)
!1514 = !DILocation(line: 548, column: 36, scope: !1493)
!1515 = !DILocation(line: 548, column: 18, scope: !1493)
!1516 = !DILocation(line: 548, column: 22, scope: !1493)
!1517 = !DILocation(line: 549, column: 40, scope: !1493)
!1518 = !DILocation(line: 549, column: 39, scope: !1493)
!1519 = !DILocation(line: 549, column: 18, scope: !1493)
!1520 = !DILocation(line: 549, column: 25, scope: !1493)
!1521 = !DILocation(line: 550, column: 12, scope: !1493)
!1522 = !DILocation(line: 551, column: 8, scope: !1493)
!1523 = !DILocation(line: 552, column: 5, scope: !1493)
!1524 = !DILocation(line: 542, column: 46, scope: !1486)
!1525 = !DILocation(line: 542, column: 5, scope: !1486)
!1526 = distinct !{!1526, !1490, !1527}
!1527 = !DILocation(line: 552, column: 5, scope: !1483)
!1528 = !DILocation(line: 553, column: 3, scope: !1453)
!1529 = !DILocation(line: 529, column: 41, scope: !1447)
!1530 = !DILocation(line: 529, column: 3, scope: !1447)
!1531 = distinct !{!1531, !1451, !1532}
!1532 = !DILocation(line: 553, column: 3, scope: !1444)
!1533 = !DILocation(line: 554, column: 31, scope: !1401)
!1534 = !DILocation(line: 554, column: 14, scope: !1401)
!1535 = !DILocation(line: 554, column: 13, scope: !1401)
!1536 = !DILocation(line: 556, column: 16, scope: !1401)
!1537 = !DILocation(line: 555, column: 75, scope: !1401)
!1538 = !DILocation(line: 556, column: 20, scope: !1401)
!1539 = !DILocation(line: 556, column: 19, scope: !1401)
!1540 = !DILocation(line: 555, column: 31, scope: !1401)
!1541 = !DILocation(line: 555, column: 3, scope: !1401)
!1542 = !DILocation(line: 555, column: 10, scope: !1401)
!1543 = !DILocation(line: 555, column: 27, scope: !1401)
!1544 = !DILocation(line: 555, column: 30, scope: !1401)
!1545 = !DILocation(line: 558, column: 16, scope: !1401)
!1546 = !DILocation(line: 557, column: 77, scope: !1401)
!1547 = !DILocation(line: 558, column: 22, scope: !1401)
!1548 = !DILocation(line: 558, column: 21, scope: !1401)
!1549 = !DILocation(line: 557, column: 33, scope: !1401)
!1550 = !DILocation(line: 557, column: 3, scope: !1401)
!1551 = !DILocation(line: 557, column: 10, scope: !1401)
!1552 = !DILocation(line: 557, column: 27, scope: !1401)
!1553 = !DILocation(line: 557, column: 32, scope: !1401)
!1554 = !DILocation(line: 560, column: 16, scope: !1401)
!1555 = !DILocation(line: 559, column: 76, scope: !1401)
!1556 = !DILocation(line: 560, column: 21, scope: !1401)
!1557 = !DILocation(line: 560, column: 20, scope: !1401)
!1558 = !DILocation(line: 559, column: 32, scope: !1401)
!1559 = !DILocation(line: 559, column: 3, scope: !1401)
!1560 = !DILocation(line: 559, column: 10, scope: !1401)
!1561 = !DILocation(line: 559, column: 27, scope: !1401)
!1562 = !DILocation(line: 559, column: 31, scope: !1401)
!1563 = !DILocation(line: 562, column: 16, scope: !1401)
!1564 = !DILocation(line: 561, column: 79, scope: !1401)
!1565 = !DILocation(line: 562, column: 24, scope: !1401)
!1566 = !DILocation(line: 562, column: 23, scope: !1401)
!1567 = !DILocation(line: 561, column: 35, scope: !1401)
!1568 = !DILocation(line: 561, column: 3, scope: !1401)
!1569 = !DILocation(line: 561, column: 10, scope: !1401)
!1570 = !DILocation(line: 561, column: 27, scope: !1401)
!1571 = !DILocation(line: 561, column: 34, scope: !1401)
!1572 = !DILocation(line: 563, column: 1, scope: !1401)
!1573 = distinct !DISubprogram(name: "StringToLong", scope: !1574, file: !1574, line: 68, type: !1575, scopeLine: 69, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !673)
!1574 = !DIFile(filename: "./magick/string-private.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!1575 = !DISubroutineType(types: !1576)
!1576 = !{!514, !1577}
!1577 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !579)
!1578 = !DILocalVariable(name: "value", arg: 1, scope: !1573, file: !1574, line: 68, type: !1577)
!1579 = !DILocation(line: 68, column: 54, scope: !1573)
!1580 = !DILocation(line: 70, column: 17, scope: !1573)
!1581 = !DILocation(line: 70, column: 10, scope: !1573)
!1582 = !DILocation(line: 70, column: 3, scope: !1573)
!1583 = distinct !DISubprogram(name: "IntegralRotateImage", scope: !1, file: !1, line: 709, type: !1584, scopeLine: 711, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !673)
!1584 = !DISubroutineType(types: !1585)
!1585 = !{!446, !702, !457, !672}
!1586 = !DILocalVariable(name: "image", arg: 1, scope: !1583, file: !1, line: 709, type: !702)
!1587 = !DILocation(line: 709, column: 54, scope: !1583)
!1588 = !DILocalVariable(name: "rotations", arg: 2, scope: !1583, file: !1, line: 709, type: !457)
!1589 = !DILocation(line: 709, column: 67, scope: !1583)
!1590 = !DILocalVariable(name: "exception", arg: 3, scope: !1583, file: !1, line: 710, type: !672)
!1591 = !DILocation(line: 710, column: 18, scope: !1583)
!1592 = !DILocalVariable(name: "image_view", scope: !1583, file: !1, line: 715, type: !986)
!1593 = !DILocation(line: 715, column: 6, scope: !1583)
!1594 = !DILocalVariable(name: "rotate_view", scope: !1583, file: !1, line: 716, type: !986)
!1595 = !DILocation(line: 716, column: 6, scope: !1583)
!1596 = !DILocalVariable(name: "rotate_image", scope: !1583, file: !1, line: 719, type: !446)
!1597 = !DILocation(line: 719, column: 6, scope: !1583)
!1598 = !DILocalVariable(name: "status", scope: !1583, file: !1, line: 722, type: !445)
!1599 = !DILocation(line: 722, column: 5, scope: !1583)
!1600 = !DILocalVariable(name: "progress", scope: !1583, file: !1, line: 725, type: !582)
!1601 = !DILocation(line: 725, column: 5, scope: !1583)
!1602 = !DILocalVariable(name: "page", scope: !1583, file: !1, line: 728, type: !518)
!1603 = !DILocation(line: 728, column: 5, scope: !1583)
!1604 = !DILocalVariable(name: "y", scope: !1583, file: !1, line: 731, type: !510)
!1605 = !DILocation(line: 731, column: 5, scope: !1583)
!1606 = !DILocation(line: 737, column: 8, scope: !1583)
!1607 = !DILocation(line: 737, column: 15, scope: !1583)
!1608 = !DILocation(line: 738, column: 12, scope: !1583)
!1609 = !DILocation(line: 739, column: 7, scope: !1610)
!1610 = distinct !DILexicalBlock(scope: !1583, file: !1, line: 739, column: 7)
!1611 = !DILocation(line: 739, column: 17, scope: !1610)
!1612 = !DILocation(line: 739, column: 7, scope: !1583)
!1613 = !DILocation(line: 740, column: 23, scope: !1610)
!1614 = !DILocation(line: 740, column: 44, scope: !1610)
!1615 = !DILocation(line: 740, column: 12, scope: !1610)
!1616 = !DILocation(line: 740, column: 5, scope: !1610)
!1617 = !DILocation(line: 741, column: 8, scope: !1618)
!1618 = distinct !DILexicalBlock(scope: !1583, file: !1, line: 741, column: 7)
!1619 = !DILocation(line: 741, column: 18, scope: !1618)
!1620 = !DILocation(line: 741, column: 24, scope: !1618)
!1621 = !DILocation(line: 741, column: 28, scope: !1618)
!1622 = !DILocation(line: 741, column: 38, scope: !1618)
!1623 = !DILocation(line: 741, column: 7, scope: !1583)
!1624 = !DILocation(line: 742, column: 29, scope: !1618)
!1625 = !DILocation(line: 742, column: 35, scope: !1618)
!1626 = !DILocation(line: 742, column: 42, scope: !1618)
!1627 = !DILocation(line: 742, column: 47, scope: !1618)
!1628 = !DILocation(line: 742, column: 54, scope: !1618)
!1629 = !DILocation(line: 743, column: 7, scope: !1618)
!1630 = !DILocation(line: 742, column: 18, scope: !1618)
!1631 = !DILocation(line: 742, column: 17, scope: !1618)
!1632 = !DILocation(line: 742, column: 5, scope: !1618)
!1633 = !DILocation(line: 745, column: 29, scope: !1618)
!1634 = !DILocation(line: 745, column: 35, scope: !1618)
!1635 = !DILocation(line: 745, column: 42, scope: !1618)
!1636 = !DILocation(line: 745, column: 50, scope: !1618)
!1637 = !DILocation(line: 745, column: 57, scope: !1618)
!1638 = !DILocation(line: 746, column: 7, scope: !1618)
!1639 = !DILocation(line: 745, column: 18, scope: !1618)
!1640 = !DILocation(line: 745, column: 17, scope: !1618)
!1641 = !DILocation(line: 747, column: 7, scope: !1642)
!1642 = distinct !DILexicalBlock(scope: !1583, file: !1, line: 747, column: 7)
!1643 = !DILocation(line: 747, column: 20, scope: !1642)
!1644 = !DILocation(line: 747, column: 7, scope: !1583)
!1645 = !DILocation(line: 748, column: 5, scope: !1642)
!1646 = !DILocation(line: 752, column: 9, scope: !1583)
!1647 = !DILocation(line: 753, column: 11, scope: !1583)
!1648 = !DILocation(line: 754, column: 38, scope: !1583)
!1649 = !DILocation(line: 754, column: 44, scope: !1583)
!1650 = !DILocation(line: 754, column: 14, scope: !1583)
!1651 = !DILocation(line: 754, column: 13, scope: !1583)
!1652 = !DILocation(line: 755, column: 41, scope: !1583)
!1653 = !DILocation(line: 755, column: 54, scope: !1583)
!1654 = !DILocation(line: 755, column: 15, scope: !1583)
!1655 = !DILocation(line: 755, column: 14, scope: !1583)
!1656 = !DILocation(line: 756, column: 11, scope: !1583)
!1657 = !DILocation(line: 756, column: 3, scope: !1583)
!1658 = !DILocalVariable(name: "tile_height", scope: !1659, file: !1, line: 761, type: !457)
!1659 = distinct !DILexicalBlock(scope: !1660, file: !1, line: 759, column: 5)
!1660 = distinct !DILexicalBlock(scope: !1583, file: !1, line: 757, column: 3)
!1661 = !DILocation(line: 761, column: 9, scope: !1659)
!1662 = !DILocalVariable(name: "tile_width", scope: !1659, file: !1, line: 762, type: !457)
!1663 = !DILocation(line: 762, column: 9, scope: !1659)
!1664 = !DILocalVariable(name: "tile_y", scope: !1659, file: !1, line: 765, type: !510)
!1665 = !DILocation(line: 765, column: 9, scope: !1659)
!1666 = !DILocation(line: 770, column: 29, scope: !1659)
!1667 = !DILocation(line: 770, column: 7, scope: !1659)
!1668 = !DILocation(line: 771, column: 18, scope: !1659)
!1669 = !DILocation(line: 771, column: 25, scope: !1659)
!1670 = !DILocation(line: 771, column: 17, scope: !1659)
!1671 = !DILocation(line: 776, column: 18, scope: !1672)
!1672 = distinct !DILexicalBlock(scope: !1659, file: !1, line: 776, column: 7)
!1673 = !DILocation(line: 776, column: 12, scope: !1672)
!1674 = !DILocation(line: 776, column: 22, scope: !1675)
!1675 = distinct !DILexicalBlock(scope: !1672, file: !1, line: 776, column: 7)
!1676 = !DILocation(line: 776, column: 41, scope: !1675)
!1677 = !DILocation(line: 776, column: 48, scope: !1675)
!1678 = !DILocation(line: 776, column: 29, scope: !1675)
!1679 = !DILocation(line: 776, column: 7, scope: !1672)
!1680 = !DILocalVariable(name: "tile_x", scope: !1681, file: !1, line: 779, type: !510)
!1681 = distinct !DILexicalBlock(scope: !1675, file: !1, line: 777, column: 7)
!1682 = !DILocation(line: 779, column: 11, scope: !1681)
!1683 = !DILocation(line: 781, column: 13, scope: !1684)
!1684 = distinct !DILexicalBlock(scope: !1681, file: !1, line: 781, column: 13)
!1685 = !DILocation(line: 781, column: 20, scope: !1684)
!1686 = !DILocation(line: 781, column: 13, scope: !1681)
!1687 = !DILocation(line: 782, column: 11, scope: !1684)
!1688 = !DILocation(line: 783, column: 20, scope: !1689)
!1689 = distinct !DILexicalBlock(scope: !1681, file: !1, line: 783, column: 9)
!1690 = !DILocation(line: 783, column: 14, scope: !1689)
!1691 = !DILocation(line: 783, column: 24, scope: !1692)
!1692 = distinct !DILexicalBlock(scope: !1689, file: !1, line: 783, column: 9)
!1693 = !DILocation(line: 783, column: 43, scope: !1692)
!1694 = !DILocation(line: 783, column: 50, scope: !1692)
!1695 = !DILocation(line: 783, column: 31, scope: !1692)
!1696 = !DILocation(line: 783, column: 9, scope: !1689)
!1697 = !DILocalVariable(name: "sync", scope: !1698, file: !1, line: 786, type: !445)
!1698 = distinct !DILexicalBlock(scope: !1692, file: !1, line: 784, column: 9)
!1699 = !DILocation(line: 786, column: 13, scope: !1698)
!1700 = !DILocalVariable(name: "indexes", scope: !1698, file: !1, line: 789, type: !1701)
!1701 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !688)
!1702 = !DILocation(line: 789, column: 23, scope: !1698)
!1703 = !DILocalVariable(name: "p", scope: !1698, file: !1, line: 792, type: !1128)
!1704 = !DILocation(line: 792, column: 23, scope: !1698)
!1705 = !DILocalVariable(name: "rotate_indexes", scope: !1698, file: !1, line: 795, type: !1706)
!1706 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !686)
!1707 = !DILocation(line: 795, column: 23, scope: !1698)
!1708 = !DILocalVariable(name: "q", scope: !1698, file: !1, line: 798, type: !1709)
!1709 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !469)
!1710 = !DILocation(line: 798, column: 23, scope: !1698)
!1711 = !DILocalVariable(name: "y", scope: !1698, file: !1, line: 801, type: !510)
!1712 = !DILocation(line: 801, column: 13, scope: !1698)
!1713 = !DILocalVariable(name: "height", scope: !1698, file: !1, line: 804, type: !457)
!1714 = !DILocation(line: 804, column: 13, scope: !1698)
!1715 = !DILocalVariable(name: "width", scope: !1698, file: !1, line: 805, type: !457)
!1716 = !DILocation(line: 805, column: 13, scope: !1698)
!1717 = !DILocation(line: 807, column: 17, scope: !1698)
!1718 = !DILocation(line: 807, column: 16, scope: !1698)
!1719 = !DILocation(line: 808, column: 16, scope: !1720)
!1720 = distinct !DILexicalBlock(scope: !1698, file: !1, line: 808, column: 15)
!1721 = !DILocation(line: 808, column: 33, scope: !1720)
!1722 = !DILocation(line: 808, column: 22, scope: !1720)
!1723 = !DILocation(line: 808, column: 57, scope: !1720)
!1724 = !DILocation(line: 808, column: 64, scope: !1720)
!1725 = !DILocation(line: 808, column: 45, scope: !1720)
!1726 = !DILocation(line: 808, column: 15, scope: !1698)
!1727 = !DILocation(line: 809, column: 29, scope: !1720)
!1728 = !DILocation(line: 809, column: 41, scope: !1720)
!1729 = !DILocation(line: 809, column: 48, scope: !1720)
!1730 = !DILocation(line: 809, column: 47, scope: !1720)
!1731 = !DILocation(line: 809, column: 59, scope: !1720)
!1732 = !DILocation(line: 809, column: 66, scope: !1720)
