; ModuleID = 'magick/module.c'
source_filename = "magick/module.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct._ExceptionInfo = type { i32, i32, i8*, i8*, i8*, i32, %struct.SemaphoreInfo*, i64 }
%struct.SemaphoreInfo = type opaque

!361 = !DIEnumerator(name: "LightnessPixelIntensityMethod", value: 3, isUnsigned: true)
!362 = !DIEnumerator(name: "Rec601LumaPixelIntensityMethod", value: 4, isUnsigned: true)
!363 = !DIEnumerator(name: "Rec601LuminancePixelIntensityMethod", value: 5, isUnsigned: true)
!364 = !DIEnumerator(name: "Rec709LumaPixelIntensityMethod", value: 6, isUnsigned: true)
!365 = !DIEnumerator(name: "Rec709LuminancePixelIntensityMethod", value: 7, isUnsigned: true)
!366 = !DIEnumerator(name: "RMSPixelIntensityMethod", value: 8, isUnsigned: true)
!367 = !DIEnumerator(name: "MSPixelIntensityMethod", value: 9, isUnsigned: true)
!368 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !369, line: 39, baseType: !5, size: 32, elements: !370)
!369 = !DIFile(filename: "./magick/policy.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!370 = !{!371, !372, !373, !374, !375}
!371 = !DIEnumerator(name: "UndefinedPolicyRights", value: 0, isUnsigned: true)
!372 = !DIEnumerator(name: "NoPolicyRights", value: 0, isUnsigned: true)
!373 = !DIEnumerator(name: "ReadPolicyRights", value: 1, isUnsigned: true)
!374 = !DIEnumerator(name: "WritePolicyRights", value: 2, isUnsigned: true)
!375 = !DIEnumerator(name: "ExecutePolicyRights", value: 4, isUnsigned: true)
!376 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !377, line: 34, baseType: !5, size: 32, elements: !378)
!377 = !DIFile(filename: "./magick/log.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!378 = !{!379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400}
!379 = !DIEnumerator(name: "UndefinedEvents", value: 0, isUnsigned: true)
!380 = !DIEnumerator(name: "NoEvents", value: 0, isUnsigned: true)
!381 = !DIEnumerator(name: "TraceEvent", value: 1, isUnsigned: true)
!382 = !DIEnumerator(name: "AnnotateEvent", value: 2, isUnsigned: true)
!383 = !DIEnumerator(name: "BlobEvent", value: 4, isUnsigned: true)
!384 = !DIEnumerator(name: "CacheEvent", value: 8, isUnsigned: true)
!385 = !DIEnumerator(name: "CoderEvent", value: 16, isUnsigned: true)
!386 = !DIEnumerator(name: "ConfigureEvent", value: 32, isUnsigned: true)
!387 = !DIEnumerator(name: "DeprecateEvent", value: 64, isUnsigned: true)
!388 = !DIEnumerator(name: "DrawEvent", value: 128, isUnsigned: true)
!389 = !DIEnumerator(name: "ExceptionEvent", value: 256, isUnsigned: true)
!390 = !DIEnumerator(name: "ImageEvent", value: 512, isUnsigned: true)
!391 = !DIEnumerator(name: "LocaleEvent", value: 1024, isUnsigned: true)
!392 = !DIEnumerator(name: "ModuleEvent", value: 2048, isUnsigned: true)
!393 = !DIEnumerator(name: "PolicyEvent", value: 4096, isUnsigned: true)
!394 = !DIEnumerator(name: "ResourceEvent", value: 8192, isUnsigned: true)
!395 = !DIEnumerator(name: "TransformEvent", value: 16384, isUnsigned: true)
!396 = !DIEnumerator(name: "UserEvent", value: 36864, isUnsigned: true)
!397 = !DIEnumerator(name: "WandEvent", value: 65536, isUnsigned: true)
!398 = !DIEnumerator(name: "X11Event", value: 131072, isUnsigned: true)
!399 = !DIEnumerator(name: "AccelerateEvent", value: 262144, isUnsigned: true)
!400 = !DIEnumerator(name: "AllEvents", value: 2147483647, isUnsigned: true)
!401 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !369, line: 28, baseType: !5, size: 32, elements: !402)
!402 = !{!403, !404, !405, !406, !407, !408, !409}
!403 = !DIEnumerator(name: "UndefinedPolicyDomain", value: 0, isUnsigned: true)
!404 = !DIEnumerator(name: "CoderPolicyDomain", value: 1, isUnsigned: true)
!405 = !DIEnumerator(name: "DelegatePolicyDomain", value: 2, isUnsigned: true)
!406 = !DIEnumerator(name: "FilterPolicyDomain", value: 3, isUnsigned: true)
!407 = !DIEnumerator(name: "PathPolicyDomain", value: 4, isUnsigned: true)
!408 = !DIEnumerator(name: "ResourcePolicyDomain", value: 5, isUnsigned: true)
!409 = !DIEnumerator(name: "SystemPolicyDomain", value: 6, isUnsigned: true)
!410 = !{!411, !412, !473, !417}
!411 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64)
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageFilterHandler", file: !414, line: 67, baseType: !415)
!414 = !DIFile(filename: "./magick/module.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!415 = !DISubroutineType(types: !416)
!416 = !{!417, !419, !639, !640, !641}
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !418, line: 46, baseType: !411)
!418 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64)
!421 = !DIDerivedType(tag: DW_TAG_typedef, name: "Image", file: !4, line: 221, baseType: !422)
!422 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Image", file: !150, line: 150, size: 105920, elements: !423)
!423 = !{!424, !426, !428, !430, !431, !433, !435, !436, !437, !438, !439, !440, !451, !452, !453, !454, !456, !470, !472, !474, !476, !479, !480, !481, !487, !488, !489, !497, !498, !499, !500, !501, !502, !504, !506, !508, !510, !512, !514, !516, !517, !518, !519, !520, !521, !522, !530, !545, !559, !560, !561, !562, !566, !570, !574, !575, !576, !577, !578, !596, !597, !599, !600, !610, !611, !613, !614, !615, !616, !617, !618, !620, !621, !622, !623, !624, !625, !626, !628, !629, !630, !631, !632, !636, !638}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "storage_class", scope: !422, file: !150, line: 153, baseType: !425, size: 32)
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "ClassType", file: !4, line: 209, baseType: !82)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !422, file: !150, line: 156, baseType: !427, size: 32, offset: 32)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorspaceType", file: !88, line: 61, baseType: !87)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !422, file: !150, line: 159, baseType: !429, size: 32, offset: 64)
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompressionType", file: !125, line: 49, baseType: !124)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !422, file: !150, line: 162, baseType: !417, size: 64, offset: 128)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !422, file: !150, line: 165, baseType: !432, size: 32, offset: 192)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "OrientationType", file: !150, line: 86, baseType: !149)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "taint", scope: !422, file: !150, line: 168, baseType: !434, size: 32, offset: 224)
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickBooleanType", file: !4, line: 215, baseType: !3)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "matte", scope: !422, file: !150, line: 169, baseType: !434, size: 32, offset: 256)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !422, file: !150, line: 172, baseType: !417, size: 64, offset: 320)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !422, file: !150, line: 173, baseType: !417, size: 64, offset: 384)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !422, file: !150, line: 174, baseType: !417, size: 64, offset: 448)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !422, file: !150, line: 175, baseType: !417, size: 64, offset: 512)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "colormap", scope: !422, file: !150, line: 178, baseType: !441, size: 64, offset: 576)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64)
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelPacket", file: !326, line: 148, baseType: !443)
!443 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PixelPacket", file: !326, line: 131, size: 64, elements: !444)
!444 = !{!445, !448, !449, !450}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !443, file: !326, line: 143, baseType: !446, size: 16)
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "Quantum", file: !4, line: 93, baseType: !447)
!447 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !443, file: !326, line: 144, baseType: !446, size: 16, offset: 16)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !443, file: !326, line: 145, baseType: !446, size: 16, offset: 32)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !443, file: !326, line: 146, baseType: !446, size: 16, offset: 48)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "background_color", scope: !422, file: !150, line: 179, baseType: !442, size: 64, offset: 640)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !422, file: !150, line: 180, baseType: !442, size: 64, offset: 704)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "matte_color", scope: !422, file: !150, line: 181, baseType: !442, size: 64, offset: 768)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !422, file: !150, line: 184, baseType: !455, size: 64, offset: 832)
!455 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "chromaticity", scope: !422, file: !150, line: 187, baseType: !457, size: 768, offset: 896)
!457 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChromaticityInfo", file: !150, line: 128, baseType: !458)
!458 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ChromaticityInfo", file: !150, line: 121, size: 768, elements: !459)
!459 = !{!460, !467, !468, !469}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "red_primary", scope: !458, file: !150, line: 124, baseType: !461, size: 192)
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "PrimaryInfo", file: !150, line: 101, baseType: !462)
!462 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PrimaryInfo", file: !150, line: 95, size: 192, elements: !463)
!463 = !{!464, !465, !466}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !462, file: !150, line: 98, baseType: !455, size: 64)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !462, file: !150, line: 99, baseType: !455, size: 64, offset: 64)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !462, file: !150, line: 100, baseType: !455, size: 64, offset: 128)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "green_primary", scope: !458, file: !150, line: 125, baseType: !461, size: 192, offset: 192)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "blue_primary", scope: !458, file: !150, line: 126, baseType: !461, size: 192, offset: 384)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "white_point", scope: !458, file: !150, line: 127, baseType: !461, size: 192, offset: 576)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "rendering_intent", scope: !422, file: !150, line: 190, baseType: !471, size: 32, offset: 1664)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderingIntent", file: !162, line: 49, baseType: !161)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !422, file: !150, line: 193, baseType: !473, size: 64, offset: 1728)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !422, file: !150, line: 196, baseType: !475, size: 32, offset: 1792)
!475 = !DIDerivedType(tag: DW_TAG_typedef, name: "ResolutionType", file: !150, line: 93, baseType: !169)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "montage", scope: !422, file: !150, line: 199, baseType: !477, size: 64, offset: 1856)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64)
!478 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "directory", scope: !422, file: !150, line: 200, baseType: !477, size: 64, offset: 1920)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "geometry", scope: !422, file: !150, line: 201, baseType: !477, size: 64, offset: 1984)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !422, file: !150, line: 204, baseType: !482, size: 64, offset: 2048)
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !483, line: 77, baseType: !484)
!483 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !485, line: 193, baseType: !486)
!485 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!486 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "x_resolution", scope: !422, file: !150, line: 207, baseType: !455, size: 64, offset: 2112)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "y_resolution", scope: !422, file: !150, line: 208, baseType: !455, size: 64, offset: 2176)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !422, file: !150, line: 211, baseType: !490, size: 256, offset: 2240)
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "RectangleInfo", file: !226, line: 130, baseType: !491)
!491 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_RectangleInfo", file: !226, line: 121, size: 256, elements: !492)
!492 = !{!493, !494, !495, !496}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !491, file: !226, line: 124, baseType: !417, size: 64)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !491, file: !226, line: 125, baseType: !417, size: 64, offset: 64)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !491, file: !226, line: 128, baseType: !482, size: 64, offset: 128)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !491, file: !226, line: 129, baseType: !482, size: 64, offset: 192)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "extract_info", scope: !422, file: !150, line: 212, baseType: !490, size: 256, offset: 2496)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "tile_info", scope: !422, file: !150, line: 213, baseType: !490, size: 256, offset: 2752)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "bias", scope: !422, file: !150, line: 216, baseType: !455, size: 64, offset: 3008)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "blur", scope: !422, file: !150, line: 217, baseType: !455, size: 64, offset: 3072)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !422, file: !150, line: 218, baseType: !455, size: 64, offset: 3136)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !422, file: !150, line: 221, baseType: !503, size: 32, offset: 3200)
!503 = !DIDerivedType(tag: DW_TAG_typedef, name: "FilterTypes", file: !175, line: 66, baseType: !174)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "interlace", scope: !422, file: !150, line: 224, baseType: !505, size: 32, offset: 3232)
!505 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterlaceType", file: !150, line: 73, baseType: !209)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !422, file: !150, line: 227, baseType: !507, size: 32, offset: 3264)
!507 = !DIDerivedType(tag: DW_TAG_typedef, name: "EndianType", file: !220, line: 35, baseType: !219)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !422, file: !150, line: 230, baseType: !509, size: 32, offset: 3296)
!509 = !DIDerivedType(tag: DW_TAG_typedef, name: "GravityType", file: !226, line: 91, baseType: !225)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !422, file: !150, line: 233, baseType: !511, size: 32, offset: 3328)
!511 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompositeOperator", file: !241, line: 99, baseType: !240)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "dispose", scope: !422, file: !150, line: 236, baseType: !513, size: 32, offset: 3360)
!513 = !DIDerivedType(tag: DW_TAG_typedef, name: "DisposeType", file: !312, line: 32, baseType: !311)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "clip_mask", scope: !422, file: !150, line: 239, baseType: !515, size: 64, offset: 3392)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !422, file: !150, line: 242, baseType: !417, size: 64, offset: 3456)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !422, file: !150, line: 243, baseType: !417, size: 64, offset: 3520)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_second", scope: !422, file: !150, line: 246, baseType: !482, size: 64, offset: 3584)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "iterations", scope: !422, file: !150, line: 249, baseType: !417, size: 64, offset: 3648)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "total_colors", scope: !422, file: !150, line: 250, baseType: !417, size: 64, offset: 3712)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "start_loop", scope: !422, file: !150, line: 253, baseType: !482, size: 64, offset: 3776)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !422, file: !150, line: 256, baseType: !523, size: 192, offset: 3840)
!523 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErrorInfo", file: !524, line: 68, baseType: !525)
!524 = !DIFile(filename: "./magick/color.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!525 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ErrorInfo", file: !524, line: 62, size: 192, elements: !526)
!526 = !{!527, !528, !529}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "mean_error_per_pixel", scope: !525, file: !524, line: 65, baseType: !455, size: 64)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_mean_error", scope: !525, file: !524, line: 66, baseType: !455, size: 64, offset: 64)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_maximum_error", scope: !525, file: !524, line: 67, baseType: !455, size: 64, offset: 128)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !422, file: !150, line: 259, baseType: !531, size: 512, offset: 4032)
!531 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerInfo", file: !320, line: 51, baseType: !532)
!532 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TimerInfo", file: !320, line: 40, size: 512, elements: !533)
!533 = !{!534, !541, !542, !544}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !532, file: !320, line: 43, baseType: !535, size: 192)
!535 = !DIDerivedType(tag: DW_TAG_typedef, name: "Timer", file: !320, line: 38, baseType: !536)
!536 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Timer", file: !320, line: 32, size: 192, elements: !537)
!537 = !{!538, !539, !540}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !536, file: !320, line: 35, baseType: !455, size: 64)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !536, file: !320, line: 36, baseType: !455, size: 64, offset: 64)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !536, file: !320, line: 37, baseType: !455, size: 64, offset: 128)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "elapsed", scope: !532, file: !320, line: 44, baseType: !535, size: 192, offset: 192)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !532, file: !320, line: 47, baseType: !543, size: 32, offset: 384)
!543 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerState", file: !320, line: 30, baseType: !319)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !532, file: !320, line: 50, baseType: !417, size: 64, offset: 448)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !422, file: !150, line: 262, baseType: !546, size: 64, offset: 4544)
!546 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickProgressMonitor", file: !547, line: 26, baseType: !548)
!547 = !DIFile(filename: "./magick/monitor.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64)
!549 = !DISubroutineType(types: !550)
!550 = !{!434, !551, !553, !556, !473}
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64)
!552 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !478)
!553 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !554)
!554 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickOffsetType", file: !4, line: 150, baseType: !555)
!555 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!556 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !557)
!557 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickSizeType", file: !4, line: 151, baseType: !558)
!558 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !422, file: !150, line: 265, baseType: !473, size: 64, offset: 4608)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !422, file: !150, line: 266, baseType: !473, size: 64, offset: 4672)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !422, file: !150, line: 267, baseType: !473, size: 64, offset: 4736)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "ascii85", scope: !422, file: !150, line: 270, baseType: !563, size: 64, offset: 4800)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64)
!564 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ascii85Info", file: !125, line: 52, baseType: !565)
!565 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Ascii85Info", file: !125, line: 51, flags: DIFlagFwdDecl)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !422, file: !150, line: 273, baseType: !567, size: 64, offset: 4864)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!568 = !DIDerivedType(tag: DW_TAG_typedef, name: "BlobInfo", file: !4, line: 217, baseType: !569)
!569 = !DICompositeType(tag: DW_TAG_structure_type, name: "_BlobInfo", file: !4, line: 217, flags: DIFlagFwdDecl)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !422, file: !150, line: 276, baseType: !571, size: 32768, offset: 4928)
!571 = !DICompositeType(tag: DW_TAG_array_type, baseType: !478, size: 32768, elements: !572)
!572 = !{!573}
!573 = !DISubrange(count: 4096)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "magick_filename", scope: !422, file: !150, line: 277, baseType: !571, size: 32768, offset: 37696)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !422, file: !150, line: 278, baseType: !571, size: 32768, offset: 70464)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "magick_columns", scope: !422, file: !150, line: 281, baseType: !417, size: 64, offset: 103232)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "magick_rows", scope: !422, file: !150, line: 282, baseType: !417, size: 64, offset: 103296)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "exception", scope: !422, file: !150, line: 285, baseType: !579, size: 448, offset: 103360)
!579 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionInfo", file: !4, line: 219, baseType: !580)
!580 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ExceptionInfo", file: !10, line: 102, size: 448, elements: !581)
!581 = !{!582, !584, !586, !587, !588, !589, !590, !595}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "severity", scope: !580, file: !10, line: 105, baseType: !583, size: 32)
!583 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionType", file: !10, line: 100, baseType: !9)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "error_number", scope: !580, file: !10, line: 108, baseType: !585, size: 32, offset: 32)
!585 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !580, file: !10, line: 111, baseType: !477, size: 64, offset: 64)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !580, file: !10, line: 112, baseType: !477, size: 64, offset: 128)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "exceptions", scope: !580, file: !10, line: 115, baseType: !473, size: 64, offset: 192)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "relinquish", scope: !580, file: !10, line: 118, baseType: !434, size: 32, offset: 256)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !580, file: !10, line: 121, baseType: !591, size: 64, offset: 320)
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64)
!592 = !DIDerivedType(tag: DW_TAG_typedef, name: "SemaphoreInfo", file: !593, line: 26, baseType: !594)
!593 = !DIFile(filename: "./magick/semaphore.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!594 = !DICompositeType(tag: DW_TAG_structure_type, name: "SemaphoreInfo", file: !593, line: 25, flags: DIFlagFwdDecl)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !580, file: !10, line: 124, baseType: !417, size: 64, offset: 384)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !422, file: !150, line: 288, baseType: !434, size: 32, offset: 103808)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !422, file: !150, line: 291, baseType: !598, size: 64, offset: 103872)
!598 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !482)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !422, file: !150, line: 294, baseType: !591, size: 64, offset: 103936)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "color_profile", scope: !422, file: !150, line: 297, baseType: !601, size: 256, offset: 104000)
!601 = !DIDerivedType(tag: DW_TAG_typedef, name: "ProfileInfo", file: !162, line: 40, baseType: !602)
!602 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ProfileInfo", file: !162, line: 27, size: 256, elements: !603)
!603 = !{!604, !605, !606, !609}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !602, file: !162, line: 30, baseType: !477, size: 64)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !602, file: !162, line: 33, baseType: !417, size: 64, offset: 64)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !602, file: !162, line: 36, baseType: !607, size: 64, offset: 128)
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64)
!608 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !602, file: !162, line: 39, baseType: !417, size: 64, offset: 192)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "iptc_profile", scope: !422, file: !150, line: 298, baseType: !601, size: 256, offset: 104256)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profile", scope: !422, file: !150, line: 299, baseType: !612, size: 64, offset: 104512)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profiles", scope: !422, file: !150, line: 302, baseType: !417, size: 64, offset: 104576)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !422, file: !150, line: 305, baseType: !417, size: 64, offset: 104640)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !422, file: !150, line: 308, baseType: !515, size: 64, offset: 104704)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !422, file: !150, line: 309, baseType: !515, size: 64, offset: 104768)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !422, file: !150, line: 310, baseType: !515, size: 64, offset: 104832)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "interpolate", scope: !422, file: !150, line: 313, baseType: !619, size: 32, offset: 104896)
!619 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterpolatePixelMethod", file: !326, line: 47, baseType: !325)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "black_point_compensation", scope: !422, file: !150, line: 316, baseType: !434, size: 32, offset: 104928)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_color", scope: !422, file: !150, line: 319, baseType: !442, size: 64, offset: 104960)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !422, file: !150, line: 322, baseType: !515, size: 64, offset: 105024)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "tile_offset", scope: !422, file: !150, line: 325, baseType: !490, size: 256, offset: 105088)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !422, file: !150, line: 328, baseType: !473, size: 64, offset: 105344)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "artifacts", scope: !422, file: !150, line: 329, baseType: !473, size: 64, offset: 105408)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !422, file: !150, line: 332, baseType: !627, size: 32, offset: 105472)
!627 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageType", file: !150, line: 61, baseType: !342)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !422, file: !150, line: 335, baseType: !434, size: 32, offset: 105504)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !422, file: !150, line: 338, baseType: !557, size: 64, offset: 105536)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "ping", scope: !422, file: !150, line: 341, baseType: !434, size: 32, offset: 105600)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !422, file: !150, line: 344, baseType: !417, size: 64, offset: 105664)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !422, file: !150, line: 347, baseType: !633, size: 64, offset: 105728)
!633 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !634, line: 7, baseType: !635)
!634 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "")
!635 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !485, line: 160, baseType: !486)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "intensity", scope: !422, file: !150, line: 350, baseType: !637, size: 32, offset: 105792)
!637 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelIntensityMethod", file: !326, line: 79, baseType: !356)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !422, file: !150, line: 353, baseType: !417, size: 64, offset: 105856)
!639 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !585)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64)
!642 = !{i32 7, !"Dwarf Version", i32 4}
!643 = !{i32 2, !"Debug Info Version", i32 3}
!644 = !{i32 1, !"wchar_size", i32 4}
!645 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!646 = distinct !DISubprogram(name: "ListModuleInfo", scope: !1, file: !1, line: 1622, type: !647, scopeLine: 1624, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !702)
!647 = !DISubroutineType(types: !648)
!648 = !{!434, !649, !641}
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 64)
!650 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !651, line: 7, baseType: !652)
!651 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!652 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !653, line: 49, size: 1728, elements: !654)
!653 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!654 = !{!655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !670, !672, !673, !674, !676, !677, !679, !683, !686, !688, !691, !694, !695, !696, !697, !698}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !652, file: !653, line: 51, baseType: !585, size: 32)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !652, file: !653, line: 54, baseType: !477, size: 64, offset: 64)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !652, file: !653, line: 55, baseType: !477, size: 64, offset: 128)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !652, file: !653, line: 56, baseType: !477, size: 64, offset: 192)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !652, file: !653, line: 57, baseType: !477, size: 64, offset: 256)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !652, file: !653, line: 58, baseType: !477, size: 64, offset: 320)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !652, file: !653, line: 59, baseType: !477, size: 64, offset: 384)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !652, file: !653, line: 60, baseType: !477, size: 64, offset: 448)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !652, file: !653, line: 61, baseType: !477, size: 64, offset: 512)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !652, file: !653, line: 64, baseType: !477, size: 64, offset: 576)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !652, file: !653, line: 65, baseType: !477, size: 64, offset: 640)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !652, file: !653, line: 66, baseType: !477, size: 64, offset: 704)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !652, file: !653, line: 68, baseType: !668, size: 64, offset: 768)
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 64)
!669 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !653, line: 36, flags: DIFlagFwdDecl)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !652, file: !653, line: 70, baseType: !671, size: 64, offset: 832)
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !652, file: !653, line: 72, baseType: !585, size: 32, offset: 896)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !652, file: !653, line: 73, baseType: !585, size: 32, offset: 928)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !652, file: !653, line: 74, baseType: !675, size: 64, offset: 960)
!675 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !485, line: 152, baseType: !486)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !652, file: !653, line: 77, baseType: !447, size: 16, offset: 1024)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !652, file: !653, line: 78, baseType: !678, size: 8, offset: 1040)
!678 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !652, file: !653, line: 79, baseType: !680, size: 8, offset: 1048)
!680 = !DICompositeType(tag: DW_TAG_array_type, baseType: !478, size: 8, elements: !681)
!681 = !{!682}
!682 = !DISubrange(count: 1)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !652, file: !653, line: 81, baseType: !684, size: 64, offset: 1088)
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 64)
!685 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !653, line: 43, baseType: null)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !652, file: !653, line: 89, baseType: !687, size: 64, offset: 1152)
!687 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !485, line: 153, baseType: !486)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !652, file: !653, line: 91, baseType: !689, size: 64, offset: 1216)
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 64)
!690 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !653, line: 37, flags: DIFlagFwdDecl)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !652, file: !653, line: 92, baseType: !692, size: 64, offset: 1280)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64)
!693 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !653, line: 38, flags: DIFlagFwdDecl)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !652, file: !653, line: 93, baseType: !671, size: 64, offset: 1344)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !652, file: !653, line: 94, baseType: !473, size: 64, offset: 1408)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !652, file: !653, line: 95, baseType: !417, size: 64, offset: 1472)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !652, file: !653, line: 96, baseType: !585, size: 32, offset: 1536)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !652, file: !653, line: 98, baseType: !699, size: 160, offset: 1568)
!699 = !DICompositeType(tag: DW_TAG_array_type, baseType: !478, size: 160, elements: !700)
!700 = !{!701}
!701 = !DISubrange(count: 20)
!702 = !{}
!703 = !DILocalVariable(name: "file", arg: 1, scope: !646, file: !1, line: 1622, type: !649)
!704 = !DILocation(line: 1622, column: 53, scope: !646)
!705 = !DILocalVariable(name: "exception", arg: 2, scope: !646, file: !1, line: 1623, type: !641)
!706 = !DILocation(line: 1623, column: 18, scope: !646)
!707 = !DILocation(line: 1627, column: 3, scope: !646)
!708 = distinct !DISubprogram(name: "InvokeDynamicImageFilter", scope: !1, file: !1, line: 1630, type: !709, scopeLine: 1632, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !702)
!709 = !DISubroutineType(types: !710)
!710 = !{!434, !551, !419, !639, !640, !641}
!711 = !DILocalVariable(name: "tag", arg: 1, scope: !708, file: !1, line: 1630, type: !551)
!712 = !DILocation(line: 1630, column: 69, scope: !708)
!713 = !DILocalVariable(name: "image", arg: 2, scope: !708, file: !1, line: 1631, type: !419)
!714 = !DILocation(line: 1631, column: 11, scope: !708)
!715 = !DILocalVariable(name: "argc", arg: 3, scope: !708, file: !1, line: 1631, type: !639)
!716 = !DILocation(line: 1631, column: 27, scope: !708)
!717 = !DILocalVariable(name: "argv", arg: 4, scope: !708, file: !1, line: 1631, type: !640)
!718 = !DILocation(line: 1631, column: 45, scope: !708)
!719 = !DILocalVariable(name: "exception", arg: 5, scope: !708, file: !1, line: 1631, type: !641)
!720 = !DILocation(line: 1631, column: 65, scope: !708)
!721 = !DILocalVariable(name: "rights", scope: !708, file: !1, line: 1634, type: !722)
!722 = !DIDerivedType(tag: DW_TAG_typedef, name: "PolicyRights", file: !369, line: 46, baseType: !368)
!723 = !DILocation(line: 1634, column: 5, scope: !708)
!724 = !DILocation(line: 1638, column: 9, scope: !725)
!725 = distinct !DILexicalBlock(scope: !708, file: !1, line: 1638, column: 7)
!726 = !DILocation(line: 1638, column: 8, scope: !725)
!727 = !DILocation(line: 1638, column: 17, scope: !725)
!728 = !DILocation(line: 1638, column: 23, scope: !725)
!729 = !DILocation(line: 1638, column: 7, scope: !708)
!730 = !DILocation(line: 1639, column: 63, scope: !725)
!731 = !DILocation(line: 1639, column: 62, scope: !725)
!732 = !DILocation(line: 1639, column: 71, scope: !725)
!733 = !DILocation(line: 1639, column: 61, scope: !725)
!734 = !DILocation(line: 1639, column: 12, scope: !725)
!735 = !DILocation(line: 1639, column: 5, scope: !725)
!736 = !DILocation(line: 1640, column: 9, scope: !708)
!737 = !DILocation(line: 1641, column: 45, scope: !738)
!738 = distinct !DILexicalBlock(scope: !708, file: !1, line: 1641, column: 7)
!739 = !DILocation(line: 1641, column: 52, scope: !738)
!740 = !DILocation(line: 1641, column: 7, scope: !738)
!741 = !DILocation(line: 1641, column: 57, scope: !738)
!742 = !DILocation(line: 1641, column: 7, scope: !708)
!743 = !DILocation(line: 1643, column: 7, scope: !744)
!744 = distinct !DILexicalBlock(scope: !738, file: !1, line: 1642, column: 5)
!745 = !DILocation(line: 1643, column: 12, scope: !744)
!746 = !DILocation(line: 1644, column: 35, scope: !744)
!747 = !DILocation(line: 1645, column: 32, scope: !744)
!748 = !DILocation(line: 1644, column: 14, scope: !744)
!749 = !DILocation(line: 1646, column: 7, scope: !744)
!750 = !DILocalVariable(name: "image_filter", scope: !751, file: !1, line: 1656, type: !412)
!751 = distinct !DILexicalBlock(scope: !708, file: !1, line: 1654, column: 3)
!752 = !DILocation(line: 1656, column: 8, scope: !751)
!753 = !DILocation(line: 1658, column: 17, scope: !751)
!754 = !DILocation(line: 1659, column: 33, scope: !755)
!755 = distinct !DILexicalBlock(scope: !751, file: !1, line: 1659, column: 9)
!756 = !DILocation(line: 1659, column: 9, scope: !755)
!757 = !DILocation(line: 1659, column: 38, scope: !755)
!758 = !DILocation(line: 1659, column: 9, scope: !751)
