; ModuleID = 'magick/registry.c'
source_filename = "magick/registry.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._SplayTreeInfo = type opaque
%struct.SemaphoreInfo = type opaque
%struct._ExceptionInfo = type { i32, i32, i8*, i8*, i8*, i32, %struct.SemaphoreInfo*, i64 }
%struct._RegistryInfo = type { i32, i8*, i64 }
%struct._Image = type { i32, i32, i32, i64, i32, i32, i32, i64, i64, i64, i64, %struct._PixelPacket*, %struct._PixelPacket, %struct._PixelPacket, %struct._PixelPacket, double, %struct._ChromaticityInfo, i32, i8*, i32, i8*, i8*, i8*, i64, double, double, %struct._RectangleInfo, %struct._RectangleInfo, %struct._RectangleInfo, double, double, double, i32, i32, i32, i32, i32, i32, %struct._Image*, i64, i64, i64, i64, i64, i64, %struct._ErrorInfo, %struct._TimerInfo, i32 (i8*, i64, i64, i8*)*, i8*, i8*, i8*, %struct._Ascii85Info*, %struct._BlobInfo*, [4096 x i8], [4096 x i8], [4096 x i8], i64, i64, %struct._ExceptionInfo, i32, i64, %struct.SemaphoreInfo*, %struct._ProfileInfo, %struct._ProfileInfo, %struct._ProfileInfo*, i64, i64, %struct._Image*, %struct._Image*, %struct._Image*, i32, i32, %struct._PixelPacket, %struct._Image*, %struct._RectangleInfo, i8*, i8*, i32, i32, i64, i32, i64, i64, i32, i64 }
%struct._ChromaticityInfo = type { %struct._PrimaryInfo, %struct._PrimaryInfo, %struct._PrimaryInfo, %struct._PrimaryInfo }

!414 = !DIEnumerator(name: "DullPreview", value: 9, isUnsigned: true)
!415 = !DIEnumerator(name: "GrayscalePreview", value: 10, isUnsigned: true)
!416 = !DIEnumerator(name: "QuantizePreview", value: 11, isUnsigned: true)
!417 = !DIEnumerator(name: "DespecklePreview", value: 12, isUnsigned: true)
!418 = !DIEnumerator(name: "ReduceNoisePreview", value: 13, isUnsigned: true)
!419 = !DIEnumerator(name: "AddNoisePreview", value: 14, isUnsigned: true)
!420 = !DIEnumerator(name: "SharpenPreview", value: 15, isUnsigned: true)
!421 = !DIEnumerator(name: "BlurPreview", value: 16, isUnsigned: true)
!422 = !DIEnumerator(name: "ThresholdPreview", value: 17, isUnsigned: true)
!423 = !DIEnumerator(name: "EdgeDetectPreview", value: 18, isUnsigned: true)
!424 = !DIEnumerator(name: "SpreadPreview", value: 19, isUnsigned: true)
!425 = !DIEnumerator(name: "SolarizePreview", value: 20, isUnsigned: true)
!426 = !DIEnumerator(name: "ShadePreview", value: 21, isUnsigned: true)
!427 = !DIEnumerator(name: "RaisePreview", value: 22, isUnsigned: true)
!428 = !DIEnumerator(name: "SegmentPreview", value: 23, isUnsigned: true)
!429 = !DIEnumerator(name: "SwirlPreview", value: 24, isUnsigned: true)
!430 = !DIEnumerator(name: "ImplodePreview", value: 25, isUnsigned: true)
!431 = !DIEnumerator(name: "WavePreview", value: 26, isUnsigned: true)
!432 = !DIEnumerator(name: "OilPaintPreview", value: 27, isUnsigned: true)
!433 = !DIEnumerator(name: "CharcoalDrawingPreview", value: 28, isUnsigned: true)
!434 = !DIEnumerator(name: "JPEGPreview", value: 29, isUnsigned: true)
!435 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 177, baseType: !7, size: 32, elements: !436)
!436 = !{!437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456}
!437 = !DIEnumerator(name: "UndefinedChannel", value: 0, isUnsigned: true)
!438 = !DIEnumerator(name: "RedChannel", value: 1, isUnsigned: true)
!439 = !DIEnumerator(name: "GrayChannel", value: 1, isUnsigned: true)
!440 = !DIEnumerator(name: "CyanChannel", value: 1, isUnsigned: true)
!441 = !DIEnumerator(name: "GreenChannel", value: 2, isUnsigned: true)
!442 = !DIEnumerator(name: "MagentaChannel", value: 2, isUnsigned: true)
!443 = !DIEnumerator(name: "BlueChannel", value: 4, isUnsigned: true)
!444 = !DIEnumerator(name: "YellowChannel", value: 4, isUnsigned: true)
!445 = !DIEnumerator(name: "AlphaChannel", value: 8, isUnsigned: true)
!446 = !DIEnumerator(name: "OpacityChannel", value: 8, isUnsigned: true)
!447 = !DIEnumerator(name: "MatteChannel", value: 8, isUnsigned: true)
!448 = !DIEnumerator(name: "BlackChannel", value: 32, isUnsigned: true)
!449 = !DIEnumerator(name: "IndexChannel", value: 32, isUnsigned: true)
!450 = !DIEnumerator(name: "CompositeChannels", value: 47, isUnsigned: true)
!451 = !DIEnumerator(name: "AllChannels", value: 134217727, isUnsigned: true)
!452 = !DIEnumerator(name: "TrueAlphaChannel", value: 64, isUnsigned: true)
!453 = !DIEnumerator(name: "RGBChannels", value: 128, isUnsigned: true)
!454 = !DIEnumerator(name: "GrayChannels", value: 128, isUnsigned: true)
!455 = !DIEnumerator(name: "SyncChannels", value: 256, isUnsigned: true)
!456 = !DIEnumerator(name: "DefaultChannels", value: 134217719, isUnsigned: true)
!457 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !458, line: 27, baseType: !7, size: 32, elements: !459)
!458 = !DIFile(filename: "./magick/cache-view.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!459 = !{!460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477}
!460 = !DIEnumerator(name: "UndefinedVirtualPixelMethod", value: 0, isUnsigned: true)
!461 = !DIEnumerator(name: "BackgroundVirtualPixelMethod", value: 1, isUnsigned: true)
!462 = !DIEnumerator(name: "ConstantVirtualPixelMethod", value: 2, isUnsigned: true)
!463 = !DIEnumerator(name: "DitherVirtualPixelMethod", value: 3, isUnsigned: true)
!464 = !DIEnumerator(name: "EdgeVirtualPixelMethod", value: 4, isUnsigned: true)
!465 = !DIEnumerator(name: "MirrorVirtualPixelMethod", value: 5, isUnsigned: true)
!466 = !DIEnumerator(name: "RandomVirtualPixelMethod", value: 6, isUnsigned: true)
!467 = !DIEnumerator(name: "TileVirtualPixelMethod", value: 7, isUnsigned: true)
!468 = !DIEnumerator(name: "TransparentVirtualPixelMethod", value: 8, isUnsigned: true)
!469 = !DIEnumerator(name: "MaskVirtualPixelMethod", value: 9, isUnsigned: true)
!470 = !DIEnumerator(name: "BlackVirtualPixelMethod", value: 10, isUnsigned: true)
!471 = !DIEnumerator(name: "GrayVirtualPixelMethod", value: 11, isUnsigned: true)
!472 = !DIEnumerator(name: "WhiteVirtualPixelMethod", value: 12, isUnsigned: true)
!473 = !DIEnumerator(name: "HorizontalTileVirtualPixelMethod", value: 13, isUnsigned: true)
!474 = !DIEnumerator(name: "VerticalTileVirtualPixelMethod", value: 14, isUnsigned: true)
!475 = !DIEnumerator(name: "HorizontalTileEdgeVirtualPixelMethod", value: 15, isUnsigned: true)
!476 = !DIEnumerator(name: "VerticalTileEdgeVirtualPixelMethod", value: 16, isUnsigned: true)
!477 = !DIEnumerator(name: "CheckerTileVirtualPixelMethod", value: 17, isUnsigned: true)
!478 = !{!479, !480, !481, !491, !709, !547, !661, !767, !621, !765, !841, !655, !843}
!479 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64)
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "RegistryInfo", file: !3, line: 67, baseType: !483)
!483 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_RegistryInfo", file: !3, line: 57, size: 192, elements: !484)
!484 = !{!485, !487, !488}
!485 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !483, file: !3, line: 60, baseType: !486, size: 32)
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "RegistryType", file: !12, line: 31, baseType: !11)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !483, file: !3, line: 63, baseType: !480, size: 64, offset: 64)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !483, file: !3, line: 66, baseType: !489, size: 64, offset: 128)
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !490, line: 46, baseType: !479)
!490 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64)
!492 = !DIDerivedType(tag: DW_TAG_typedef, name: "Image", file: !6, line: 221, baseType: !493)
!493 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Image", file: !184, line: 150, size: 105920, elements: !494)
!494 = !{!495, !497, !499, !501, !502, !504, !506, !507, !508, !509, !510, !511, !522, !523, !524, !525, !527, !541, !543, !544, !546, !549, !550, !551, !557, !558, !559, !567, !568, !569, !570, !571, !572, !574, !576, !578, !580, !582, !584, !586, !587, !588, !589, !590, !591, !592, !600, !615, !629, !630, !631, !632, !636, !640, !644, !645, !646, !647, !648, !666, !667, !669, !670, !680, !681, !683, !684, !685, !686, !687, !688, !690, !691, !692, !693, !694, !695, !696, !698, !699, !700, !701, !702, !706, !708}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "storage_class", scope: !493, file: !184, line: 153, baseType: !496, size: 32)
!496 = !DIDerivedType(tag: DW_TAG_typedef, name: "ClassType", file: !6, line: 209, baseType: !116)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !493, file: !184, line: 156, baseType: !498, size: 32, offset: 32)
!498 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorspaceType", file: !122, line: 61, baseType: !121)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !493, file: !184, line: 159, baseType: !500, size: 32, offset: 64)
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompressionType", file: !159, line: 49, baseType: !158)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !493, file: !184, line: 162, baseType: !489, size: 64, offset: 128)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !493, file: !184, line: 165, baseType: !503, size: 32, offset: 192)
!503 = !DIDerivedType(tag: DW_TAG_typedef, name: "OrientationType", file: !184, line: 86, baseType: !183)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "taint", scope: !493, file: !184, line: 168, baseType: !505, size: 32, offset: 224)
!505 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickBooleanType", file: !6, line: 215, baseType: !5)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "matte", scope: !493, file: !184, line: 169, baseType: !505, size: 32, offset: 256)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !493, file: !184, line: 172, baseType: !489, size: 64, offset: 320)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !493, file: !184, line: 173, baseType: !489, size: 64, offset: 384)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !493, file: !184, line: 174, baseType: !489, size: 64, offset: 448)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !493, file: !184, line: 175, baseType: !489, size: 64, offset: 512)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "colormap", scope: !493, file: !184, line: 178, baseType: !512, size: 64, offset: 576)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64)
!513 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelPacket", file: !360, line: 148, baseType: !514)
!514 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PixelPacket", file: !360, line: 131, size: 64, elements: !515)
!515 = !{!516, !519, !520, !521}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !514, file: !360, line: 143, baseType: !517, size: 16)
!517 = !DIDerivedType(tag: DW_TAG_typedef, name: "Quantum", file: !6, line: 93, baseType: !518)
!518 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !514, file: !360, line: 144, baseType: !517, size: 16, offset: 16)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !514, file: !360, line: 145, baseType: !517, size: 16, offset: 32)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !514, file: !360, line: 146, baseType: !517, size: 16, offset: 48)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "background_color", scope: !493, file: !184, line: 179, baseType: !513, size: 64, offset: 640)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !493, file: !184, line: 180, baseType: !513, size: 64, offset: 704)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "matte_color", scope: !493, file: !184, line: 181, baseType: !513, size: 64, offset: 768)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !493, file: !184, line: 184, baseType: !526, size: 64, offset: 832)
!526 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "chromaticity", scope: !493, file: !184, line: 187, baseType: !528, size: 768, offset: 896)
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChromaticityInfo", file: !184, line: 128, baseType: !529)
!529 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ChromaticityInfo", file: !184, line: 121, size: 768, elements: !530)
!530 = !{!531, !538, !539, !540}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "red_primary", scope: !529, file: !184, line: 124, baseType: !532, size: 192)
!532 = !DIDerivedType(tag: DW_TAG_typedef, name: "PrimaryInfo", file: !184, line: 101, baseType: !533)
!533 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PrimaryInfo", file: !184, line: 95, size: 192, elements: !534)
!534 = !{!535, !536, !537}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !533, file: !184, line: 98, baseType: !526, size: 64)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !533, file: !184, line: 99, baseType: !526, size: 64, offset: 64)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !533, file: !184, line: 100, baseType: !526, size: 64, offset: 128)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "green_primary", scope: !529, file: !184, line: 125, baseType: !532, size: 192, offset: 192)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "blue_primary", scope: !529, file: !184, line: 126, baseType: !532, size: 192, offset: 384)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "white_point", scope: !529, file: !184, line: 127, baseType: !532, size: 192, offset: 576)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "rendering_intent", scope: !493, file: !184, line: 190, baseType: !542, size: 32, offset: 1664)
!542 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderingIntent", file: !196, line: 49, baseType: !195)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !493, file: !184, line: 193, baseType: !480, size: 64, offset: 1728)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !493, file: !184, line: 196, baseType: !545, size: 32, offset: 1792)
!545 = !DIDerivedType(tag: DW_TAG_typedef, name: "ResolutionType", file: !184, line: 93, baseType: !203)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "montage", scope: !493, file: !184, line: 199, baseType: !547, size: 64, offset: 1856)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64)
!548 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "directory", scope: !493, file: !184, line: 200, baseType: !547, size: 64, offset: 1920)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "geometry", scope: !493, file: !184, line: 201, baseType: !547, size: 64, offset: 1984)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !493, file: !184, line: 204, baseType: !552, size: 64, offset: 2048)
!552 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !553, line: 77, baseType: !554)
!553 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!554 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !555, line: 193, baseType: !556)
!555 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!556 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "x_resolution", scope: !493, file: !184, line: 207, baseType: !526, size: 64, offset: 2112)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "y_resolution", scope: !493, file: !184, line: 208, baseType: !526, size: 64, offset: 2176)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !493, file: !184, line: 211, baseType: !560, size: 256, offset: 2240)
!560 = !DIDerivedType(tag: DW_TAG_typedef, name: "RectangleInfo", file: !260, line: 130, baseType: !561)
!561 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_RectangleInfo", file: !260, line: 121, size: 256, elements: !562)
!562 = !{!563, !564, !565, !566}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !561, file: !260, line: 124, baseType: !489, size: 64)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !561, file: !260, line: 125, baseType: !489, size: 64, offset: 64)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !561, file: !260, line: 128, baseType: !552, size: 64, offset: 128)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !561, file: !260, line: 129, baseType: !552, size: 64, offset: 192)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "extract_info", scope: !493, file: !184, line: 212, baseType: !560, size: 256, offset: 2496)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "tile_info", scope: !493, file: !184, line: 213, baseType: !560, size: 256, offset: 2752)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "bias", scope: !493, file: !184, line: 216, baseType: !526, size: 64, offset: 3008)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "blur", scope: !493, file: !184, line: 217, baseType: !526, size: 64, offset: 3072)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !493, file: !184, line: 218, baseType: !526, size: 64, offset: 3136)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !493, file: !184, line: 221, baseType: !573, size: 32, offset: 3200)
!573 = !DIDerivedType(tag: DW_TAG_typedef, name: "FilterTypes", file: !209, line: 66, baseType: !208)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "interlace", scope: !493, file: !184, line: 224, baseType: !575, size: 32, offset: 3232)
!575 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterlaceType", file: !184, line: 73, baseType: !243)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !493, file: !184, line: 227, baseType: !577, size: 32, offset: 3264)
!577 = !DIDerivedType(tag: DW_TAG_typedef, name: "EndianType", file: !254, line: 35, baseType: !253)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !493, file: !184, line: 230, baseType: !579, size: 32, offset: 3296)
!579 = !DIDerivedType(tag: DW_TAG_typedef, name: "GravityType", file: !260, line: 91, baseType: !259)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !493, file: !184, line: 233, baseType: !581, size: 32, offset: 3328)
!581 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompositeOperator", file: !275, line: 99, baseType: !274)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "dispose", scope: !493, file: !184, line: 236, baseType: !583, size: 32, offset: 3360)
!583 = !DIDerivedType(tag: DW_TAG_typedef, name: "DisposeType", file: !346, line: 32, baseType: !345)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "clip_mask", scope: !493, file: !184, line: 239, baseType: !585, size: 64, offset: 3392)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !493, file: !184, line: 242, baseType: !489, size: 64, offset: 3456)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !493, file: !184, line: 243, baseType: !489, size: 64, offset: 3520)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_second", scope: !493, file: !184, line: 246, baseType: !552, size: 64, offset: 3584)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "iterations", scope: !493, file: !184, line: 249, baseType: !489, size: 64, offset: 3648)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "total_colors", scope: !493, file: !184, line: 250, baseType: !489, size: 64, offset: 3712)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "start_loop", scope: !493, file: !184, line: 253, baseType: !552, size: 64, offset: 3776)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !493, file: !184, line: 256, baseType: !593, size: 192, offset: 3840)
!593 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErrorInfo", file: !594, line: 68, baseType: !595)
!594 = !DIFile(filename: "./magick/color.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!595 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ErrorInfo", file: !594, line: 62, size: 192, elements: !596)
!596 = !{!597, !598, !599}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "mean_error_per_pixel", scope: !595, file: !594, line: 65, baseType: !526, size: 64)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_mean_error", scope: !595, file: !594, line: 66, baseType: !526, size: 64, offset: 64)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_maximum_error", scope: !595, file: !594, line: 67, baseType: !526, size: 64, offset: 128)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !493, file: !184, line: 259, baseType: !601, size: 512, offset: 4032)
!601 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerInfo", file: !354, line: 51, baseType: !602)
!602 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TimerInfo", file: !354, line: 40, size: 512, elements: !603)
!603 = !{!604, !611, !612, !614}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !602, file: !354, line: 43, baseType: !605, size: 192)
!605 = !DIDerivedType(tag: DW_TAG_typedef, name: "Timer", file: !354, line: 38, baseType: !606)
!606 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Timer", file: !354, line: 32, size: 192, elements: !607)
!607 = !{!608, !609, !610}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !606, file: !354, line: 35, baseType: !526, size: 64)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !606, file: !354, line: 36, baseType: !526, size: 64, offset: 64)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !606, file: !354, line: 37, baseType: !526, size: 64, offset: 128)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "elapsed", scope: !602, file: !354, line: 44, baseType: !605, size: 192, offset: 192)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !602, file: !354, line: 47, baseType: !613, size: 32, offset: 384)
!613 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerState", file: !354, line: 30, baseType: !353)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !602, file: !354, line: 50, baseType: !489, size: 64, offset: 448)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !493, file: !184, line: 262, baseType: !616, size: 64, offset: 4544)
!616 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickProgressMonitor", file: !617, line: 26, baseType: !618)
!617 = !DIFile(filename: "./magick/monitor.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !619, size: 64)
!619 = !DISubroutineType(types: !620)
!620 = !{!505, !621, !623, !626, !480}
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 64)
!622 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !548)
!623 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !624)
!624 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickOffsetType", file: !6, line: 150, baseType: !625)
!625 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!626 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !627)
!627 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickSizeType", file: !6, line: 151, baseType: !628)
!628 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !493, file: !184, line: 265, baseType: !480, size: 64, offset: 4608)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !493, file: !184, line: 266, baseType: !480, size: 64, offset: 4672)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !493, file: !184, line: 267, baseType: !480, size: 64, offset: 4736)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "ascii85", scope: !493, file: !184, line: 270, baseType: !633, size: 64, offset: 4800)
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 64)
!634 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ascii85Info", file: !159, line: 52, baseType: !635)
!635 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Ascii85Info", file: !159, line: 51, flags: DIFlagFwdDecl)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !493, file: !184, line: 273, baseType: !637, size: 64, offset: 4864)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 64)
!638 = !DIDerivedType(tag: DW_TAG_typedef, name: "BlobInfo", file: !6, line: 217, baseType: !639)
!639 = !DICompositeType(tag: DW_TAG_structure_type, name: "_BlobInfo", file: !6, line: 217, flags: DIFlagFwdDecl)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !493, file: !184, line: 276, baseType: !641, size: 32768, offset: 4928)
!641 = !DICompositeType(tag: DW_TAG_array_type, baseType: !548, size: 32768, elements: !642)
!642 = !{!643}
!643 = !DISubrange(count: 4096)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "magick_filename", scope: !493, file: !184, line: 277, baseType: !641, size: 32768, offset: 37696)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !493, file: !184, line: 278, baseType: !641, size: 32768, offset: 70464)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "magick_columns", scope: !493, file: !184, line: 281, baseType: !489, size: 64, offset: 103232)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "magick_rows", scope: !493, file: !184, line: 282, baseType: !489, size: 64, offset: 103296)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "exception", scope: !493, file: !184, line: 285, baseType: !649, size: 448, offset: 103360)
!649 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionInfo", file: !6, line: 219, baseType: !650)
!650 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ExceptionInfo", file: !19, line: 102, size: 448, elements: !651)
!651 = !{!652, !654, !656, !657, !658, !659, !660, !665}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "severity", scope: !650, file: !19, line: 105, baseType: !653, size: 32)
!653 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionType", file: !19, line: 100, baseType: !18)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "error_number", scope: !650, file: !19, line: 108, baseType: !655, size: 32, offset: 32)
!655 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !650, file: !19, line: 111, baseType: !547, size: 64, offset: 64)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !650, file: !19, line: 112, baseType: !547, size: 64, offset: 128)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "exceptions", scope: !650, file: !19, line: 115, baseType: !480, size: 64, offset: 192)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "relinquish", scope: !650, file: !19, line: 118, baseType: !505, size: 32, offset: 256)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !650, file: !19, line: 121, baseType: !661, size: 64, offset: 320)
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !662, size: 64)
!662 = !DIDerivedType(tag: DW_TAG_typedef, name: "SemaphoreInfo", file: !663, line: 26, baseType: !664)
!663 = !DIFile(filename: "./magick/semaphore.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!664 = !DICompositeType(tag: DW_TAG_structure_type, name: "SemaphoreInfo", file: !663, line: 25, flags: DIFlagFwdDecl)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !650, file: !19, line: 124, baseType: !489, size: 64, offset: 384)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !493, file: !184, line: 288, baseType: !505, size: 32, offset: 103808)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !493, file: !184, line: 291, baseType: !668, size: 64, offset: 103872)
!668 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !552)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !493, file: !184, line: 294, baseType: !661, size: 64, offset: 103936)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "color_profile", scope: !493, file: !184, line: 297, baseType: !671, size: 256, offset: 104000)
!671 = !DIDerivedType(tag: DW_TAG_typedef, name: "ProfileInfo", file: !196, line: 40, baseType: !672)
!672 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ProfileInfo", file: !196, line: 27, size: 256, elements: !673)
!673 = !{!674, !675, !676, !679}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !672, file: !196, line: 30, baseType: !547, size: 64)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !672, file: !196, line: 33, baseType: !489, size: 64, offset: 64)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !672, file: !196, line: 36, baseType: !677, size: 64, offset: 128)
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !678, size: 64)
!678 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !672, file: !196, line: 39, baseType: !489, size: 64, offset: 192)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "iptc_profile", scope: !493, file: !184, line: 298, baseType: !671, size: 256, offset: 104256)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profile", scope: !493, file: !184, line: 299, baseType: !682, size: 64, offset: 104512)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profiles", scope: !493, file: !184, line: 302, baseType: !489, size: 64, offset: 104576)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !493, file: !184, line: 305, baseType: !489, size: 64, offset: 104640)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !493, file: !184, line: 308, baseType: !585, size: 64, offset: 104704)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !493, file: !184, line: 309, baseType: !585, size: 64, offset: 104768)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !493, file: !184, line: 310, baseType: !585, size: 64, offset: 104832)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "interpolate", scope: !493, file: !184, line: 313, baseType: !689, size: 32, offset: 104896)
!689 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterpolatePixelMethod", file: !360, line: 47, baseType: !359)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "black_point_compensation", scope: !493, file: !184, line: 316, baseType: !505, size: 32, offset: 104928)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_color", scope: !493, file: !184, line: 319, baseType: !513, size: 64, offset: 104960)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !493, file: !184, line: 322, baseType: !585, size: 64, offset: 105024)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "tile_offset", scope: !493, file: !184, line: 325, baseType: !560, size: 256, offset: 105088)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !493, file: !184, line: 328, baseType: !480, size: 64, offset: 105344)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "artifacts", scope: !493, file: !184, line: 329, baseType: !480, size: 64, offset: 105408)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !493, file: !184, line: 332, baseType: !697, size: 32, offset: 105472)
!697 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageType", file: !184, line: 61, baseType: !376)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !493, file: !184, line: 335, baseType: !505, size: 32, offset: 105504)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !493, file: !184, line: 338, baseType: !627, size: 64, offset: 105536)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "ping", scope: !493, file: !184, line: 341, baseType: !505, size: 32, offset: 105600)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !493, file: !184, line: 344, baseType: !489, size: 64, offset: 105664)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !493, file: !184, line: 347, baseType: !703, size: 64, offset: 105728)
!703 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !704, line: 7, baseType: !705)
!704 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "")
!705 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !555, line: 160, baseType: !556)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "intensity", scope: !493, file: !184, line: 350, baseType: !707, size: 32, offset: 105792)
!707 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelIntensityMethod", file: !360, line: 79, baseType: !390)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !493, file: !184, line: 353, baseType: !489, size: 64, offset: 105856)
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 64)
!710 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageInfo", file: !6, line: 223, baseType: !711)
!711 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ImageInfo", file: !184, line: 356, size: 134336, elements: !712)
!712 = !{!713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !747, !748, !749, !750, !751, !752, !754, !755, !756, !757, !758, !759, !770, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !838, !839, !840}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !711, file: !184, line: 359, baseType: !500, size: 32)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !711, file: !184, line: 362, baseType: !503, size: 32, offset: 32)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "temporary", scope: !711, file: !184, line: 365, baseType: !505, size: 32, offset: 64)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "adjoin", scope: !711, file: !184, line: 366, baseType: !505, size: 32, offset: 96)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "affirm", scope: !711, file: !184, line: 367, baseType: !505, size: 32, offset: 128)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "antialias", scope: !711, file: !184, line: 368, baseType: !505, size: 32, offset: 160)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !711, file: !184, line: 371, baseType: !547, size: 64, offset: 192)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "extract", scope: !711, file: !184, line: 372, baseType: !547, size: 64, offset: 256)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !711, file: !184, line: 373, baseType: !547, size: 64, offset: 320)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "scenes", scope: !711, file: !184, line: 374, baseType: !547, size: 64, offset: 384)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !711, file: !184, line: 377, baseType: !489, size: 64, offset: 448)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "number_scenes", scope: !711, file: !184, line: 378, baseType: !489, size: 64, offset: 512)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !711, file: !184, line: 379, baseType: !489, size: 64, offset: 576)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "interlace", scope: !711, file: !184, line: 382, baseType: !575, size: 32, offset: 640)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !711, file: !184, line: 385, baseType: !577, size: 32, offset: 672)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !711, file: !184, line: 388, baseType: !545, size: 32, offset: 704)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !711, file: !184, line: 391, baseType: !489, size: 64, offset: 768)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "sampling_factor", scope: !711, file: !184, line: 394, baseType: !547, size: 64, offset: 832)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "server_name", scope: !711, file: !184, line: 395, baseType: !547, size: 64, offset: 896)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "font", scope: !711, file: !184, line: 396, baseType: !547, size: 64, offset: 960)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "texture", scope: !711, file: !184, line: 397, baseType: !547, size: 64, offset: 1024)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "density", scope: !711, file: !184, line: 398, baseType: !547, size: 64, offset: 1088)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "pointsize", scope: !711, file: !184, line: 401, baseType: !526, size: 64, offset: 1152)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !711, file: !184, line: 402, baseType: !526, size: 64, offset: 1216)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "background_color", scope: !711, file: !184, line: 405, baseType: !513, size: 64, offset: 1280)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !711, file: !184, line: 406, baseType: !513, size: 64, offset: 1344)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "matte_color", scope: !711, file: !184, line: 407, baseType: !513, size: 64, offset: 1408)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !711, file: !184, line: 410, baseType: !505, size: 32, offset: 1472)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "monochrome", scope: !711, file: !184, line: 411, baseType: !505, size: 32, offset: 1504)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !711, file: !184, line: 414, baseType: !489, size: 64, offset: 1536)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !711, file: !184, line: 417, baseType: !498, size: 32, offset: 1600)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !711, file: !184, line: 420, baseType: !697, size: 32, offset: 1632)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "preview_type", scope: !711, file: !184, line: 423, baseType: !746, size: 32, offset: 1664)
!746 = !DIDerivedType(tag: DW_TAG_typedef, name: "PreviewType", file: !403, line: 59, baseType: !402)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !711, file: !184, line: 426, baseType: !552, size: 64, offset: 1728)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "ping", scope: !711, file: !184, line: 429, baseType: !505, size: 32, offset: 1792)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !711, file: !184, line: 430, baseType: !505, size: 32, offset: 1824)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !711, file: !184, line: 433, baseType: !547, size: 64, offset: 1856)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "authenticate", scope: !711, file: !184, line: 434, baseType: !547, size: 64, offset: 1920)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !711, file: !184, line: 437, baseType: !753, size: 32, offset: 1984)
!753 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChannelType", file: !6, line: 202, baseType: !435)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !711, file: !184, line: 440, baseType: !491, size: 64, offset: 2048)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !711, file: !184, line: 443, baseType: !480, size: 64, offset: 2112)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !711, file: !184, line: 446, baseType: !616, size: 64, offset: 2176)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !711, file: !184, line: 449, baseType: !480, size: 64, offset: 2240)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !711, file: !184, line: 450, baseType: !480, size: 64, offset: 2304)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !711, file: !184, line: 453, baseType: !760, size: 64, offset: 2368)
!760 = !DIDerivedType(tag: DW_TAG_typedef, name: "StreamHandler", file: !761, line: 26, baseType: !762)
!761 = !DIFile(filename: "./magick/stream.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 64)
!763 = !DISubroutineType(types: !764)
!764 = !{!489, !765, !767, !769}
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 64)
!766 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !492)
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 64)
!768 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!769 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !489)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !711, file: !184, line: 456, baseType: !771, size: 64, offset: 2432)
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 64)
!772 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !773, line: 7, baseType: !774)
!773 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!774 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !775, line: 49, size: 1728, elements: !776)
!775 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!776 = !{!777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !792, !794, !795, !796, !798, !799, !801, !805, !808, !810, !813, !816, !817, !818, !819, !820}
!777 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !774, file: !775, line: 51, baseType: !655, size: 32)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !774, file: !775, line: 54, baseType: !547, size: 64, offset: 64)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !774, file: !775, line: 55, baseType: !547, size: 64, offset: 128)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !774, file: !775, line: 56, baseType: !547, size: 64, offset: 192)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !774, file: !775, line: 57, baseType: !547, size: 64, offset: 256)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !774, file: !775, line: 58, baseType: !547, size: 64, offset: 320)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !774, file: !775, line: 59, baseType: !547, size: 64, offset: 384)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !774, file: !775, line: 60, baseType: !547, size: 64, offset: 448)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !774, file: !775, line: 61, baseType: !547, size: 64, offset: 512)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !774, file: !775, line: 64, baseType: !547, size: 64, offset: 576)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !774, file: !775, line: 65, baseType: !547, size: 64, offset: 640)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !774, file: !775, line: 66, baseType: !547, size: 64, offset: 704)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !774, file: !775, line: 68, baseType: !790, size: 64, offset: 768)
!790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !791, size: 64)
!791 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !775, line: 36, flags: DIFlagFwdDecl)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !774, file: !775, line: 70, baseType: !793, size: 64, offset: 832)
!793 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 64)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !774, file: !775, line: 72, baseType: !655, size: 32, offset: 896)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !774, file: !775, line: 73, baseType: !655, size: 32, offset: 928)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !774, file: !775, line: 74, baseType: !797, size: 64, offset: 960)
!797 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !555, line: 152, baseType: !556)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !774, file: !775, line: 77, baseType: !518, size: 16, offset: 1024)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !774, file: !775, line: 78, baseType: !800, size: 8, offset: 1040)
!800 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !774, file: !775, line: 79, baseType: !802, size: 8, offset: 1048)
!802 = !DICompositeType(tag: DW_TAG_array_type, baseType: !548, size: 8, elements: !803)
!803 = !{!804}
!804 = !DISubrange(count: 1)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !774, file: !775, line: 81, baseType: !806, size: 64, offset: 1088)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 64)
!807 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !775, line: 43, baseType: null)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !774, file: !775, line: 89, baseType: !809, size: 64, offset: 1152)
!809 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !555, line: 153, baseType: !556)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !774, file: !775, line: 91, baseType: !811, size: 64, offset: 1216)
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !812, size: 64)
!812 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !775, line: 37, flags: DIFlagFwdDecl)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !774, file: !775, line: 92, baseType: !814, size: 64, offset: 1280)
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !815, size: 64)
!815 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !775, line: 38, flags: DIFlagFwdDecl)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !774, file: !775, line: 93, baseType: !793, size: 64, offset: 1344)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !774, file: !775, line: 94, baseType: !480, size: 64, offset: 1408)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !774, file: !775, line: 95, baseType: !489, size: 64, offset: 1472)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !774, file: !775, line: 96, baseType: !655, size: 32, offset: 1536)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !774, file: !775, line: 98, baseType: !821, size: 160, offset: 1568)
!821 = !DICompositeType(tag: DW_TAG_array_type, baseType: !548, size: 160, elements: !822)
!822 = !{!823}
!823 = !DISubrange(count: 20)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !711, file: !184, line: 459, baseType: !480, size: 64, offset: 2496)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !711, file: !184, line: 462, baseType: !489, size: 64, offset: 2560)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !711, file: !184, line: 465, baseType: !641, size: 32768, offset: 2624)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "unique", scope: !711, file: !184, line: 466, baseType: !641, size: 32768, offset: 35392)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "zero", scope: !711, file: !184, line: 467, baseType: !641, size: 32768, offset: 68160)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !711, file: !184, line: 468, baseType: !641, size: 32768, offset: 100928)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !711, file: !184, line: 471, baseType: !505, size: 32, offset: 133696)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "tile", scope: !711, file: !184, line: 474, baseType: !547, size: 64, offset: 133760)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "subimage", scope: !711, file: !184, line: 477, baseType: !489, size: 64, offset: 133824)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "subrange", scope: !711, file: !184, line: 478, baseType: !489, size: 64, offset: 133888)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "pen", scope: !711, file: !184, line: 481, baseType: !513, size: 64, offset: 133952)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !711, file: !184, line: 484, baseType: !489, size: 64, offset: 134016)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_pixel_method", scope: !711, file: !184, line: 487, baseType: !837, size: 32, offset: 134080)
!837 = !DIDerivedType(tag: DW_TAG_typedef, name: "VirtualPixelMethod", file: !458, line: 47, baseType: !457)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_color", scope: !711, file: !184, line: 490, baseType: !513, size: 64, offset: 134112)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !711, file: !184, line: 493, baseType: !480, size: 64, offset: 134208)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "synchronize", scope: !711, file: !184, line: 496, baseType: !505, size: 32, offset: 134272)
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !842, size: 64)
!842 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !710)
!843 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !844, size: 64)
!844 = !DIDerivedType(tag: DW_TAG_typedef, name: "SplayTreeInfo", file: !845, line: 26, baseType: !846)
!845 = !DIFile(filename: "./magick/splay-tree.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!846 = !DICompositeType(tag: DW_TAG_structure_type, name: "_SplayTreeInfo", file: !845, line: 25, flags: DIFlagFwdDecl)
!847 = !{!0, !848}
!848 = !DIGlobalVariableExpression(var: !849, expr: !DIExpression())
!849 = distinct !DIGlobalVariable(name: "registry_semaphore", scope: !2, file: !3, line: 76, type: !661, isLocal: true, isDefinition: true)
!850 = !{i32 7, !"Dwarf Version", i32 4}
!851 = !{i32 2, !"Debug Info Version", i32 3}
!852 = !{i32 1, !"wchar_size", i32 4}
!853 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!854 = distinct !DISubprogram(name: "DefineImageRegistry", scope: !3, file: !3, line: 105, type: !855, scopeLine: 107, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !859)
!855 = !DISubroutineType(types: !856)
!856 = !{!505, !857, !621, !858}
!857 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !486)
!858 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 64)
!859 = !{}
!860 = !DILocalVariable(name: "type", arg: 1, scope: !854, file: !3, line: 105, type: !857)
!861 = !DILocation(line: 105, column: 71, scope: !854)
!862 = !DILocalVariable(name: "option", arg: 2, scope: !854, file: !3, line: 106, type: !621)
!863 = !DILocation(line: 106, column: 15, scope: !854)
!864 = !DILocalVariable(name: "exception", arg: 3, scope: !854, file: !3, line: 106, type: !858)
!865 = !DILocation(line: 106, column: 37, scope: !854)
!866 = !DILocalVariable(name: "key", scope: !854, file: !3, line: 109, type: !641)
!867 = !DILocation(line: 109, column: 5, scope: !854)
!868 = !DILocalVariable(name: "value", scope: !854, file: !3, line: 110, type: !641)
!869 = !DILocation(line: 110, column: 5, scope: !854)
!870 = !DILocalVariable(name: "p", scope: !854, file: !3, line: 113, type: !547)
!871 = !DILocation(line: 113, column: 6, scope: !854)
!872 = !DILocation(line: 116, column: 27, scope: !854)
!873 = !DILocation(line: 116, column: 31, scope: !854)
!874 = !DILocation(line: 116, column: 10, scope: !854)
!875 = !DILocation(line: 117, column: 10, scope: !876)
!876 = distinct !DILexicalBlock(scope: !854, file: !3, line: 117, column: 3)
!877 = !DILocation(line: 117, column: 9, scope: !876)
!878 = !DILocation(line: 117, column: 8, scope: !876)
!879 = !DILocation(line: 117, column: 16, scope: !880)
!880 = distinct !DILexicalBlock(scope: !876, file: !3, line: 117, column: 3)
!881 = !DILocation(line: 117, column: 15, scope: !880)
!882 = !DILocation(line: 117, column: 18, scope: !880)
!883 = !DILocation(line: 117, column: 3, scope: !876)
!884 = !DILocation(line: 118, column: 10, scope: !885)
!885 = distinct !DILexicalBlock(scope: !880, file: !3, line: 118, column: 9)
!886 = !DILocation(line: 118, column: 9, scope: !885)
!887 = !DILocation(line: 118, column: 12, scope: !885)
!888 = !DILocation(line: 118, column: 9, scope: !880)
!889 = !DILocation(line: 119, column: 7, scope: !885)
!890 = !DILocation(line: 118, column: 15, scope: !885)
!891 = !DILocation(line: 117, column: 28, scope: !880)
!892 = !DILocation(line: 117, column: 3, scope: !880)
!893 = distinct !{!893, !883, !894}
!894 = !DILocation(line: 119, column: 7, scope: !876)
!895 = !DILocation(line: 120, column: 3, scope: !854)
!896 = !DILocation(line: 120, column: 9, scope: !854)
!897 = !DILocation(line: 121, column: 8, scope: !898)
