; ModuleID = 'magick/blob.c'
source_filename = "magick/blob.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct._BlobInfo = type { i64, i64, i64, i32, i32, i64, i64, i32, i32, i32, i32, i32, %union.FileInfo, %struct.stat, i64 (%struct._Image*, i8*, i64)*, i8*, i32, %struct.SemaphoreInfo*, i64, i64 }
%union.FileInfo = type { %struct._IO_FILE* }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }

!485 = !DIEnumerator(name: "ExplicitFormatType", value: 2, isUnsigned: true)
!486 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !487, line: 25, baseType: !5, size: 32, elements: !488)
!487 = !DIFile(filename: "./magick/resource_.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!488 = !{!489, !490, !491, !492, !493, !494, !495, !496, !497}
!489 = !DIEnumerator(name: "UndefinedResource", value: 0, isUnsigned: true)
!490 = !DIEnumerator(name: "AreaResource", value: 1, isUnsigned: true)
!491 = !DIEnumerator(name: "DiskResource", value: 2, isUnsigned: true)
!492 = !DIEnumerator(name: "FileResource", value: 3, isUnsigned: true)
!493 = !DIEnumerator(name: "MapResource", value: 4, isUnsigned: true)
!494 = !DIEnumerator(name: "MemoryResource", value: 5, isUnsigned: true)
!495 = !DIEnumerator(name: "ThreadResource", value: 6, isUnsigned: true)
!496 = !DIEnumerator(name: "TimeResource", value: 7, isUnsigned: true)
!497 = !DIEnumerator(name: "ThrottleResource", value: 8, isUnsigned: true)
!498 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !499, line: 30, baseType: !5, size: 32, elements: !500)
!499 = !DIFile(filename: "./magick/blob.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!500 = !{!501, !502, !503}
!501 = !DIEnumerator(name: "ReadMode", value: 0, isUnsigned: true)
!502 = !DIEnumerator(name: "WriteMode", value: 1, isUnsigned: true)
!503 = !DIEnumerator(name: "IOMode", value: 2, isUnsigned: true)
!504 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !10, line: 35, baseType: !5, size: 32, elements: !505)
!505 = !{!506, !507, !508, !509, !510, !511, !512}
!506 = !DIEnumerator(name: "UndefinedBlobMode", value: 0, isUnsigned: true)
!507 = !DIEnumerator(name: "ReadBlobMode", value: 1, isUnsigned: true)
!508 = !DIEnumerator(name: "ReadBinaryBlobMode", value: 2, isUnsigned: true)
!509 = !DIEnumerator(name: "WriteBlobMode", value: 3, isUnsigned: true)
!510 = !DIEnumerator(name: "WriteBinaryBlobMode", value: 4, isUnsigned: true)
!511 = !DIEnumerator(name: "AppendBlobMode", value: 5, isUnsigned: true)
!512 = !DIEnumerator(name: "AppendBinaryBlobMode", value: 6, isUnsigned: true)
!513 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !514, line: 39, baseType: !5, size: 32, elements: !515)
!514 = !DIFile(filename: "./magick/policy.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!515 = !{!516, !517, !518, !519, !520}
!516 = !DIEnumerator(name: "UndefinedPolicyRights", value: 0, isUnsigned: true)
!517 = !DIEnumerator(name: "NoPolicyRights", value: 0, isUnsigned: true)
!518 = !DIEnumerator(name: "ReadPolicyRights", value: 1, isUnsigned: true)
!519 = !DIEnumerator(name: "WritePolicyRights", value: 2, isUnsigned: true)
!520 = !DIEnumerator(name: "ExecutePolicyRights", value: 4, isUnsigned: true)
!521 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !514, line: 28, baseType: !5, size: 32, elements: !522)
!522 = !{!523, !524, !525, !526, !527, !528, !529}
!523 = !DIEnumerator(name: "UndefinedPolicyDomain", value: 0, isUnsigned: true)
!524 = !DIEnumerator(name: "CoderPolicyDomain", value: 1, isUnsigned: true)
!525 = !DIEnumerator(name: "DelegatePolicyDomain", value: 2, isUnsigned: true)
!526 = !DIEnumerator(name: "FilterPolicyDomain", value: 3, isUnsigned: true)
!527 = !DIEnumerator(name: "PathPolicyDomain", value: 4, isUnsigned: true)
!528 = !DIEnumerator(name: "ResourcePolicyDomain", value: 5, isUnsigned: true)
!529 = !DIEnumerator(name: "SystemPolicyDomain", value: 6, isUnsigned: true)
!530 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !531, line: 25, baseType: !5, size: 32, elements: !532)
!531 = !DIFile(filename: "./magick/utility.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!532 = !{!533, !534, !535, !536, !537, !538, !539, !540, !541}
!533 = !DIEnumerator(name: "UndefinedPath", value: 0, isUnsigned: true)
!534 = !DIEnumerator(name: "MagickPath", value: 1, isUnsigned: true)
!535 = !DIEnumerator(name: "RootPath", value: 2, isUnsigned: true)
!536 = !DIEnumerator(name: "HeadPath", value: 3, isUnsigned: true)
!537 = !DIEnumerator(name: "TailPath", value: 4, isUnsigned: true)
!538 = !DIEnumerator(name: "BasePath", value: 5, isUnsigned: true)
!539 = !DIEnumerator(name: "ExtensionPath", value: 6, isUnsigned: true)
!540 = !DIEnumerator(name: "SubimagePath", value: 7, isUnsigned: true)
!541 = !DIEnumerator(name: "CanonicalPath", value: 8, isUnsigned: true)
!542 = !{!543, !544, !546, !599, !606, !608, !610, !612, !614, !889, !751, !553, !822, !811, !740, !672, !1006, !5, !607, !555, !648, !1007, !579, !556, !987, !1008}
!543 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!544 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !545, line: 46, baseType: !543)
!545 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64)
!547 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !548, line: 7, baseType: !549)
!548 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!549 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !550, line: 49, size: 1728, elements: !551)
!550 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!551 = !{!552, !554, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !570, !572, !573, !574, !578, !580, !582, !586, !589, !591, !594, !597, !598, !600, !601, !602}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !549, file: !550, line: 51, baseType: !553, size: 32)
!553 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !549, file: !550, line: 54, baseType: !555, size: 64, offset: 64)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64)
!556 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !549, file: !550, line: 55, baseType: !555, size: 64, offset: 128)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !549, file: !550, line: 56, baseType: !555, size: 64, offset: 192)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !549, file: !550, line: 57, baseType: !555, size: 64, offset: 256)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !549, file: !550, line: 58, baseType: !555, size: 64, offset: 320)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !549, file: !550, line: 59, baseType: !555, size: 64, offset: 384)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !549, file: !550, line: 60, baseType: !555, size: 64, offset: 448)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !549, file: !550, line: 61, baseType: !555, size: 64, offset: 512)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !549, file: !550, line: 64, baseType: !555, size: 64, offset: 576)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !549, file: !550, line: 65, baseType: !555, size: 64, offset: 640)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !549, file: !550, line: 66, baseType: !555, size: 64, offset: 704)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !549, file: !550, line: 68, baseType: !568, size: 64, offset: 768)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64)
!569 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !550, line: 36, flags: DIFlagFwdDecl)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !549, file: !550, line: 70, baseType: !571, size: 64, offset: 832)
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !549, file: !550, line: 72, baseType: !553, size: 32, offset: 896)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !549, file: !550, line: 73, baseType: !553, size: 32, offset: 928)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !549, file: !550, line: 74, baseType: !575, size: 64, offset: 960)
!575 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !576, line: 152, baseType: !577)
!576 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!577 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !549, file: !550, line: 77, baseType: !579, size: 16, offset: 1024)
!579 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !549, file: !550, line: 78, baseType: !581, size: 8, offset: 1040)
!581 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !549, file: !550, line: 79, baseType: !583, size: 8, offset: 1048)
!583 = !DICompositeType(tag: DW_TAG_array_type, baseType: !556, size: 8, elements: !584)
!584 = !{!585}
!585 = !DISubrange(count: 1)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !549, file: !550, line: 81, baseType: !587, size: 64, offset: 1088)
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 64)
!588 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !550, line: 43, baseType: null)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !549, file: !550, line: 89, baseType: !590, size: 64, offset: 1152)
!590 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !576, line: 153, baseType: !577)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !549, file: !550, line: 91, baseType: !592, size: 64, offset: 1216)
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 64)
!593 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !550, line: 37, flags: DIFlagFwdDecl)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !549, file: !550, line: 92, baseType: !595, size: 64, offset: 1280)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64)
!596 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !550, line: 38, flags: DIFlagFwdDecl)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !549, file: !550, line: 93, baseType: !571, size: 64, offset: 1344)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !549, file: !550, line: 94, baseType: !599, size: 64, offset: 1408)
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !549, file: !550, line: 95, baseType: !544, size: 64, offset: 1472)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !549, file: !550, line: 96, baseType: !553, size: 32, offset: 1536)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !549, file: !550, line: 98, baseType: !603, size: 160, offset: 1568)
!603 = !DICompositeType(tag: DW_TAG_array_type, baseType: !556, size: 160, elements: !604)
!604 = !{!605}
!605 = !DISubrange(count: 20)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!607 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64)
!609 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !556)
!610 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickSizeType", file: !4, line: 151, baseType: !611)
!611 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 64)
!613 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!615 = !DIDerivedType(tag: DW_TAG_typedef, name: "Image", file: !4, line: 221, baseType: !616)
!616 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Image", file: !88, line: 150, size: 105920, elements: !617)
!617 = !{!618, !620, !622, !624, !625, !627, !629, !630, !631, !632, !633, !634, !644, !645, !646, !647, !649, !663, !665, !666, !668, !669, !670, !671, !675, !676, !677, !685, !686, !687, !688, !689, !690, !692, !694, !696, !698, !700, !702, !704, !705, !706, !707, !708, !709, !710, !718, !733, !743, !744, !745, !746, !750, !828, !832, !833, !834, !835, !836, !849, !850, !852, !853, !861, !862, !864, !865, !866, !867, !868, !869, !871, !872, !873, !874, !875, !876, !877, !879, !880, !881, !882, !883, !886, !888}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "storage_class", scope: !616, file: !88, line: 153, baseType: !619, size: 32)
!619 = !DIDerivedType(tag: DW_TAG_typedef, name: "ClassType", file: !4, line: 209, baseType: !20)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !616, file: !88, line: 156, baseType: !621, size: 32, offset: 32)
!621 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorspaceType", file: !26, line: 61, baseType: !25)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !616, file: !88, line: 159, baseType: !623, size: 32, offset: 64)
!623 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompressionType", file: !63, line: 49, baseType: !62)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !616, file: !88, line: 162, baseType: !544, size: 64, offset: 128)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !616, file: !88, line: 165, baseType: !626, size: 32, offset: 192)
!626 = !DIDerivedType(tag: DW_TAG_typedef, name: "OrientationType", file: !88, line: 86, baseType: !87)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "taint", scope: !616, file: !88, line: 168, baseType: !628, size: 32, offset: 224)
!628 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickBooleanType", file: !4, line: 215, baseType: !3)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "matte", scope: !616, file: !88, line: 169, baseType: !628, size: 32, offset: 256)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !616, file: !88, line: 172, baseType: !544, size: 64, offset: 320)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !616, file: !88, line: 173, baseType: !544, size: 64, offset: 384)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !616, file: !88, line: 174, baseType: !544, size: 64, offset: 448)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !616, file: !88, line: 175, baseType: !544, size: 64, offset: 512)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "colormap", scope: !616, file: !88, line: 178, baseType: !635, size: 64, offset: 576)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 64)
!636 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelPacket", file: !337, line: 148, baseType: !637)
!637 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PixelPacket", file: !337, line: 131, size: 64, elements: !638)
!638 = !{!639, !641, !642, !643}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !637, file: !337, line: 143, baseType: !640, size: 16)
!640 = !DIDerivedType(tag: DW_TAG_typedef, name: "Quantum", file: !4, line: 93, baseType: !579)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !637, file: !337, line: 144, baseType: !640, size: 16, offset: 16)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !637, file: !337, line: 145, baseType: !640, size: 16, offset: 32)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !637, file: !337, line: 146, baseType: !640, size: 16, offset: 48)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "background_color", scope: !616, file: !88, line: 179, baseType: !636, size: 64, offset: 640)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !616, file: !88, line: 180, baseType: !636, size: 64, offset: 704)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "matte_color", scope: !616, file: !88, line: 181, baseType: !636, size: 64, offset: 768)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !616, file: !88, line: 184, baseType: !648, size: 64, offset: 832)
!648 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "chromaticity", scope: !616, file: !88, line: 187, baseType: !650, size: 768, offset: 896)
!650 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChromaticityInfo", file: !88, line: 128, baseType: !651)
!651 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ChromaticityInfo", file: !88, line: 121, size: 768, elements: !652)
!652 = !{!653, !660, !661, !662}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "red_primary", scope: !651, file: !88, line: 124, baseType: !654, size: 192)
!654 = !DIDerivedType(tag: DW_TAG_typedef, name: "PrimaryInfo", file: !88, line: 101, baseType: !655)
!655 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PrimaryInfo", file: !88, line: 95, size: 192, elements: !656)
!656 = !{!657, !658, !659}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !655, file: !88, line: 98, baseType: !648, size: 64)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !655, file: !88, line: 99, baseType: !648, size: 64, offset: 64)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !655, file: !88, line: 100, baseType: !648, size: 64, offset: 128)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "green_primary", scope: !651, file: !88, line: 125, baseType: !654, size: 192, offset: 192)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "blue_primary", scope: !651, file: !88, line: 126, baseType: !654, size: 192, offset: 384)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "white_point", scope: !651, file: !88, line: 127, baseType: !654, size: 192, offset: 576)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "rendering_intent", scope: !616, file: !88, line: 190, baseType: !664, size: 32, offset: 1664)
!664 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderingIntent", file: !100, line: 49, baseType: !99)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !616, file: !88, line: 193, baseType: !599, size: 64, offset: 1728)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !616, file: !88, line: 196, baseType: !667, size: 32, offset: 1792)
!667 = !DIDerivedType(tag: DW_TAG_typedef, name: "ResolutionType", file: !88, line: 93, baseType: !107)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "montage", scope: !616, file: !88, line: 199, baseType: !555, size: 64, offset: 1856)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "directory", scope: !616, file: !88, line: 200, baseType: !555, size: 64, offset: 1920)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "geometry", scope: !616, file: !88, line: 201, baseType: !555, size: 64, offset: 1984)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !616, file: !88, line: 204, baseType: !672, size: 64, offset: 2048)
!672 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !673, line: 77, baseType: !674)
!673 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!674 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !576, line: 193, baseType: !577)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "x_resolution", scope: !616, file: !88, line: 207, baseType: !648, size: 64, offset: 2112)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "y_resolution", scope: !616, file: !88, line: 208, baseType: !648, size: 64, offset: 2176)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !616, file: !88, line: 211, baseType: !678, size: 256, offset: 2240)
!678 = !DIDerivedType(tag: DW_TAG_typedef, name: "RectangleInfo", file: !164, line: 130, baseType: !679)
!679 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_RectangleInfo", file: !164, line: 121, size: 256, elements: !680)
!680 = !{!681, !682, !683, !684}
!681 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !679, file: !164, line: 124, baseType: !544, size: 64)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !679, file: !164, line: 125, baseType: !544, size: 64, offset: 64)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !679, file: !164, line: 128, baseType: !672, size: 64, offset: 128)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !679, file: !164, line: 129, baseType: !672, size: 64, offset: 192)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "extract_info", scope: !616, file: !88, line: 212, baseType: !678, size: 256, offset: 2496)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "tile_info", scope: !616, file: !88, line: 213, baseType: !678, size: 256, offset: 2752)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "bias", scope: !616, file: !88, line: 216, baseType: !648, size: 64, offset: 3008)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "blur", scope: !616, file: !88, line: 217, baseType: !648, size: 64, offset: 3072)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !616, file: !88, line: 218, baseType: !648, size: 64, offset: 3136)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !616, file: !88, line: 221, baseType: !691, size: 32, offset: 3200)
!691 = !DIDerivedType(tag: DW_TAG_typedef, name: "FilterTypes", file: !113, line: 66, baseType: !112)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "interlace", scope: !616, file: !88, line: 224, baseType: !693, size: 32, offset: 3232)
!693 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterlaceType", file: !88, line: 73, baseType: !147)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !616, file: !88, line: 227, baseType: !695, size: 32, offset: 3264)
!695 = !DIDerivedType(tag: DW_TAG_typedef, name: "EndianType", file: !158, line: 35, baseType: !157)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !616, file: !88, line: 230, baseType: !697, size: 32, offset: 3296)
!697 = !DIDerivedType(tag: DW_TAG_typedef, name: "GravityType", file: !164, line: 91, baseType: !163)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !616, file: !88, line: 233, baseType: !699, size: 32, offset: 3328)
!699 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompositeOperator", file: !179, line: 99, baseType: !178)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "dispose", scope: !616, file: !88, line: 236, baseType: !701, size: 32, offset: 3360)
!701 = !DIDerivedType(tag: DW_TAG_typedef, name: "DisposeType", file: !250, line: 32, baseType: !249)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "clip_mask", scope: !616, file: !88, line: 239, baseType: !703, size: 64, offset: 3392)
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 64)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !616, file: !88, line: 242, baseType: !544, size: 64, offset: 3456)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !616, file: !88, line: 243, baseType: !544, size: 64, offset: 3520)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_second", scope: !616, file: !88, line: 246, baseType: !672, size: 64, offset: 3584)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "iterations", scope: !616, file: !88, line: 249, baseType: !544, size: 64, offset: 3648)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "total_colors", scope: !616, file: !88, line: 250, baseType: !544, size: 64, offset: 3712)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "start_loop", scope: !616, file: !88, line: 253, baseType: !672, size: 64, offset: 3776)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !616, file: !88, line: 256, baseType: !711, size: 192, offset: 3840)
!711 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErrorInfo", file: !712, line: 68, baseType: !713)
!712 = !DIFile(filename: "./magick/color.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!713 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ErrorInfo", file: !712, line: 62, size: 192, elements: !714)
!714 = !{!715, !716, !717}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "mean_error_per_pixel", scope: !713, file: !712, line: 65, baseType: !648, size: 64)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_mean_error", scope: !713, file: !712, line: 66, baseType: !648, size: 64, offset: 64)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_maximum_error", scope: !713, file: !712, line: 67, baseType: !648, size: 64, offset: 128)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !616, file: !88, line: 259, baseType: !719, size: 512, offset: 4032)
!719 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerInfo", file: !258, line: 51, baseType: !720)
!720 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TimerInfo", file: !258, line: 40, size: 512, elements: !721)
!721 = !{!722, !729, !730, !732}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !720, file: !258, line: 43, baseType: !723, size: 192)
!723 = !DIDerivedType(tag: DW_TAG_typedef, name: "Timer", file: !258, line: 38, baseType: !724)
!724 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Timer", file: !258, line: 32, size: 192, elements: !725)
!725 = !{!726, !727, !728}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !724, file: !258, line: 35, baseType: !648, size: 64)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !724, file: !258, line: 36, baseType: !648, size: 64, offset: 64)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !724, file: !258, line: 37, baseType: !648, size: 64, offset: 128)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "elapsed", scope: !720, file: !258, line: 44, baseType: !723, size: 192, offset: 192)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !720, file: !258, line: 47, baseType: !731, size: 32, offset: 384)
!731 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerState", file: !258, line: 30, baseType: !257)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !720, file: !258, line: 50, baseType: !544, size: 64, offset: 448)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !616, file: !88, line: 262, baseType: !734, size: 64, offset: 4544)
!734 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickProgressMonitor", file: !735, line: 26, baseType: !736)
!735 = !DIFile(filename: "./magick/monitor.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !737, size: 64)
!737 = !DISubroutineType(types: !738)
!738 = !{!628, !608, !739, !742, !599}
!739 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !740)
!740 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickOffsetType", file: !4, line: 150, baseType: !741)
!741 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!742 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !610)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !616, file: !88, line: 265, baseType: !599, size: 64, offset: 4608)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !616, file: !88, line: 266, baseType: !599, size: 64, offset: 4672)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !616, file: !88, line: 267, baseType: !599, size: 64, offset: 4736)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "ascii85", scope: !616, file: !88, line: 270, baseType: !747, size: 64, offset: 4800)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64)
!748 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ascii85Info", file: !63, line: 52, baseType: !749)
!749 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Ascii85Info", file: !63, line: 51, flags: DIFlagFwdDecl)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !616, file: !88, line: 273, baseType: !751, size: 64, offset: 4864)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64)
!752 = !DIDerivedType(tag: DW_TAG_typedef, name: "BlobInfo", file: !4, line: 217, baseType: !753)
!753 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_BlobInfo", file: !1, line: 108, size: 2176, elements: !754)
!754 = !{!755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !768, !773, !810, !819, !820, !821, !826, !827}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !753, file: !1, line: 111, baseType: !544, size: 64)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !753, file: !1, line: 112, baseType: !544, size: 64, offset: 64)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "quantum", scope: !753, file: !1, line: 113, baseType: !544, size: 64, offset: 128)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "mapped", scope: !753, file: !1, line: 116, baseType: !628, size: 32, offset: 192)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "eof", scope: !753, file: !1, line: 117, baseType: !628, size: 32, offset: 224)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !753, file: !1, line: 120, baseType: !740, size: 64, offset: 256)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !753, file: !1, line: 123, baseType: !610, size: 64, offset: 320)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "exempt", scope: !753, file: !1, line: 126, baseType: !628, size: 32, offset: 384)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "synchronize", scope: !753, file: !1, line: 127, baseType: !628, size: 32, offset: 416)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !753, file: !1, line: 128, baseType: !628, size: 32, offset: 448)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "temporary", scope: !753, file: !1, line: 129, baseType: !628, size: 32, offset: 480)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !753, file: !1, line: 132, baseType: !767, size: 32, offset: 512)
!767 = !DIDerivedType(tag: DW_TAG_typedef, name: "StreamType", file: !10, line: 56, baseType: !9)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "file_info", scope: !753, file: !1, line: 135, baseType: !769, size: 64, offset: 576)
!769 = !DIDerivedType(tag: DW_TAG_typedef, name: "FileInfo", file: !1, line: 106, baseType: !770)
!770 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "FileInfo", file: !1, line: 92, size: 64, elements: !771)
!771 = !{!772}
!772 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !770, file: !1, line: 95, baseType: !546, size: 64)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !753, file: !1, line: 138, baseType: !774, size: 1152, offset: 640)
!774 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !775, line: 46, size: 1152, elements: !776)
!775 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "")
!776 = !{!777, !779, !781, !783, !785, !787, !789, !790, !791, !792, !794, !796, !804, !805, !806}
!777 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !774, file: !775, line: 48, baseType: !778, size: 64)
!778 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !576, line: 145, baseType: !543)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !774, file: !775, line: 53, baseType: !780, size: 64, offset: 64)
!780 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !576, line: 148, baseType: !543)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !774, file: !775, line: 61, baseType: !782, size: 64, offset: 128)
!782 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !576, line: 151, baseType: !543)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !774, file: !775, line: 62, baseType: !784, size: 32, offset: 192)
!784 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !576, line: 150, baseType: !5)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !774, file: !775, line: 64, baseType: !786, size: 32, offset: 224)
!786 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !576, line: 146, baseType: !5)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !774, file: !775, line: 65, baseType: !788, size: 32, offset: 256)
!788 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !576, line: 147, baseType: !5)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !774, file: !775, line: 67, baseType: !553, size: 32, offset: 288)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !774, file: !775, line: 69, baseType: !778, size: 64, offset: 320)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !774, file: !775, line: 74, baseType: !575, size: 64, offset: 384)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !774, file: !775, line: 78, baseType: !793, size: 64, offset: 448)
!793 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !576, line: 174, baseType: !577)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !774, file: !775, line: 80, baseType: !795, size: 64, offset: 512)
!795 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !576, line: 179, baseType: !577)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !774, file: !775, line: 91, baseType: !797, size: 128, offset: 576)
!797 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !798, line: 10, size: 128, elements: !799)
!798 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "")
!799 = !{!800, !802}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !797, file: !798, line: 12, baseType: !801, size: 64)
!801 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !576, line: 160, baseType: !577)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !797, file: !798, line: 16, baseType: !803, size: 64, offset: 64)
!803 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !576, line: 196, baseType: !577)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !774, file: !775, line: 92, baseType: !797, size: 128, offset: 704)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !774, file: !775, line: 93, baseType: !797, size: 128, offset: 832)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !774, file: !775, line: 106, baseType: !807, size: 192, offset: 960)
!807 = !DICompositeType(tag: DW_TAG_array_type, baseType: !803, size: 192, elements: !808)
!808 = !{!809}
!809 = !DISubrange(count: 3)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !753, file: !1, line: 141, baseType: !811, size: 64, offset: 1792)
!811 = !DIDerivedType(tag: DW_TAG_typedef, name: "StreamHandler", file: !812, line: 26, baseType: !813)
!812 = !DIFile(filename: "./magick/stream.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 64)
!814 = !DISubroutineType(types: !815)
!815 = !{!544, !816, !612, !818}
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 64)
!817 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !615)
!818 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !544)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !753, file: !1, line: 144, baseType: !606, size: 64, offset: 1856)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !753, file: !1, line: 147, baseType: !628, size: 32, offset: 1920)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !753, file: !1, line: 150, baseType: !822, size: 64, offset: 1984)
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !823, size: 64)
!823 = !DIDerivedType(tag: DW_TAG_typedef, name: "SemaphoreInfo", file: !824, line: 26, baseType: !825)
!824 = !DIFile(filename: "./magick/semaphore.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!825 = !DICompositeType(tag: DW_TAG_structure_type, name: "SemaphoreInfo", file: !824, line: 25, flags: DIFlagFwdDecl)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !753, file: !1, line: 153, baseType: !672, size: 64, offset: 2048)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !753, file: !1, line: 156, baseType: !544, size: 64, offset: 2112)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !616, file: !88, line: 276, baseType: !829, size: 32768, offset: 4928)
!829 = !DICompositeType(tag: DW_TAG_array_type, baseType: !556, size: 32768, elements: !830)
!830 = !{!831}
!831 = !DISubrange(count: 4096)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "magick_filename", scope: !616, file: !88, line: 277, baseType: !829, size: 32768, offset: 37696)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !616, file: !88, line: 278, baseType: !829, size: 32768, offset: 70464)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "magick_columns", scope: !616, file: !88, line: 281, baseType: !544, size: 64, offset: 103232)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "magick_rows", scope: !616, file: !88, line: 282, baseType: !544, size: 64, offset: 103296)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "exception", scope: !616, file: !88, line: 285, baseType: !837, size: 448, offset: 103360)
!837 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionInfo", file: !4, line: 219, baseType: !838)
!838 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ExceptionInfo", file: !264, line: 102, size: 448, elements: !839)
!839 = !{!840, !842, !843, !844, !845, !846, !847, !848}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "severity", scope: !838, file: !264, line: 105, baseType: !841, size: 32)
!841 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionType", file: !264, line: 100, baseType: !263)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "error_number", scope: !838, file: !264, line: 108, baseType: !553, size: 32, offset: 32)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !838, file: !264, line: 111, baseType: !555, size: 64, offset: 64)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !838, file: !264, line: 112, baseType: !555, size: 64, offset: 128)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "exceptions", scope: !838, file: !264, line: 115, baseType: !599, size: 64, offset: 192)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "relinquish", scope: !838, file: !264, line: 118, baseType: !628, size: 32, offset: 256)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !838, file: !264, line: 121, baseType: !822, size: 64, offset: 320)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !838, file: !264, line: 124, baseType: !544, size: 64, offset: 384)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !616, file: !88, line: 288, baseType: !628, size: 32, offset: 103808)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !616, file: !88, line: 291, baseType: !851, size: 64, offset: 103872)
!851 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !672)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !616, file: !88, line: 294, baseType: !822, size: 64, offset: 103936)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "color_profile", scope: !616, file: !88, line: 297, baseType: !854, size: 256, offset: 104000)
!854 = !DIDerivedType(tag: DW_TAG_typedef, name: "ProfileInfo", file: !100, line: 40, baseType: !855)
!855 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ProfileInfo", file: !100, line: 27, size: 256, elements: !856)
!856 = !{!857, !858, !859, !860}
!857 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !855, file: !100, line: 30, baseType: !555, size: 64)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !855, file: !100, line: 33, baseType: !544, size: 64, offset: 64)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !855, file: !100, line: 36, baseType: !606, size: 64, offset: 128)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !855, file: !100, line: 39, baseType: !544, size: 64, offset: 192)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "iptc_profile", scope: !616, file: !88, line: 298, baseType: !854, size: 256, offset: 104256)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profile", scope: !616, file: !88, line: 299, baseType: !863, size: 64, offset: 104512)
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !854, size: 64)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profiles", scope: !616, file: !88, line: 302, baseType: !544, size: 64, offset: 104576)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !616, file: !88, line: 305, baseType: !544, size: 64, offset: 104640)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !616, file: !88, line: 308, baseType: !703, size: 64, offset: 104704)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !616, file: !88, line: 309, baseType: !703, size: 64, offset: 104768)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !616, file: !88, line: 310, baseType: !703, size: 64, offset: 104832)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "interpolate", scope: !616, file: !88, line: 313, baseType: !870, size: 32, offset: 104896)
!870 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterpolatePixelMethod", file: !337, line: 47, baseType: !336)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "black_point_compensation", scope: !616, file: !88, line: 316, baseType: !628, size: 32, offset: 104928)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_color", scope: !616, file: !88, line: 319, baseType: !636, size: 64, offset: 104960)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !616, file: !88, line: 322, baseType: !703, size: 64, offset: 105024)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "tile_offset", scope: !616, file: !88, line: 325, baseType: !678, size: 256, offset: 105088)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !616, file: !88, line: 328, baseType: !599, size: 64, offset: 105344)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "artifacts", scope: !616, file: !88, line: 329, baseType: !599, size: 64, offset: 105408)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !616, file: !88, line: 332, baseType: !878, size: 32, offset: 105472)
!878 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageType", file: !88, line: 61, baseType: !353)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !616, file: !88, line: 335, baseType: !628, size: 32, offset: 105504)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !616, file: !88, line: 338, baseType: !610, size: 64, offset: 105536)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "ping", scope: !616, file: !88, line: 341, baseType: !628, size: 32, offset: 105600)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !616, file: !88, line: 344, baseType: !544, size: 64, offset: 105664)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !616, file: !88, line: 347, baseType: !884, size: 64, offset: 105728)
!884 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !885, line: 7, baseType: !801)
!885 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "")
!886 = !DIDerivedType(tag: DW_TAG_member, name: "intensity", scope: !616, file: !88, line: 350, baseType: !887, size: 32, offset: 105792)
!887 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelIntensityMethod", file: !337, line: 79, baseType: !367)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !616, file: !88, line: 353, baseType: !544, size: 64, offset: 105856)
!889 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !890, size: 64)
!890 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !891)
!891 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickInfo", file: !481, line: 103, baseType: !892)
!892 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MagickInfo", file: !481, line: 51, size: 1216, elements: !893)
!893 = !{!894, !895, !896, !897, !898, !899, !969, !977, !982, !989, !990, !991, !992, !993, !994, !995, !997, !999, !1000, !1002, !1003, !1004, !1005}
!894 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !892, file: !481, line: 54, baseType: !555, size: 64)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !892, file: !481, line: 55, baseType: !555, size: 64, offset: 64)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !892, file: !481, line: 56, baseType: !555, size: 64, offset: 128)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "note", scope: !892, file: !481, line: 57, baseType: !555, size: 64, offset: 192)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "module", scope: !892, file: !481, line: 58, baseType: !555, size: 64, offset: 256)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "image_info", scope: !892, file: !481, line: 61, baseType: !900, size: 64, offset: 320)
!900 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !901, size: 64)
!901 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageInfo", file: !4, line: 223, baseType: !902)
!902 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ImageInfo", file: !88, line: 356, size: 134336, elements: !903)
!903 = !{!904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !938, !939, !940, !941, !942, !943, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !966, !967, !968}
!904 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !902, file: !88, line: 359, baseType: !623, size: 32)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !902, file: !88, line: 362, baseType: !626, size: 32, offset: 32)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "temporary", scope: !902, file: !88, line: 365, baseType: !628, size: 32, offset: 64)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "adjoin", scope: !902, file: !88, line: 366, baseType: !628, size: 32, offset: 96)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "affirm", scope: !902, file: !88, line: 367, baseType: !628, size: 32, offset: 128)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "antialias", scope: !902, file: !88, line: 368, baseType: !628, size: 32, offset: 160)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !902, file: !88, line: 371, baseType: !555, size: 64, offset: 192)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "extract", scope: !902, file: !88, line: 372, baseType: !555, size: 64, offset: 256)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !902, file: !88, line: 373, baseType: !555, size: 64, offset: 320)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "scenes", scope: !902, file: !88, line: 374, baseType: !555, size: 64, offset: 384)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !902, file: !88, line: 377, baseType: !544, size: 64, offset: 448)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "number_scenes", scope: !902, file: !88, line: 378, baseType: !544, size: 64, offset: 512)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !902, file: !88, line: 379, baseType: !544, size: 64, offset: 576)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "interlace", scope: !902, file: !88, line: 382, baseType: !693, size: 32, offset: 640)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !902, file: !88, line: 385, baseType: !695, size: 32, offset: 672)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !902, file: !88, line: 388, baseType: !667, size: 32, offset: 704)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !902, file: !88, line: 391, baseType: !544, size: 64, offset: 768)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "sampling_factor", scope: !902, file: !88, line: 394, baseType: !555, size: 64, offset: 832)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "server_name", scope: !902, file: !88, line: 395, baseType: !555, size: 64, offset: 896)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "font", scope: !902, file: !88, line: 396, baseType: !555, size: 64, offset: 960)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "texture", scope: !902, file: !88, line: 397, baseType: !555, size: 64, offset: 1024)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "density", scope: !902, file: !88, line: 398, baseType: !555, size: 64, offset: 1088)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "pointsize", scope: !902, file: !88, line: 401, baseType: !648, size: 64, offset: 1152)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !902, file: !88, line: 402, baseType: !648, size: 64, offset: 1216)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "background_color", scope: !902, file: !88, line: 405, baseType: !636, size: 64, offset: 1280)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !902, file: !88, line: 406, baseType: !636, size: 64, offset: 1344)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "matte_color", scope: !902, file: !88, line: 407, baseType: !636, size: 64, offset: 1408)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !902, file: !88, line: 410, baseType: !628, size: 32, offset: 1472)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "monochrome", scope: !902, file: !88, line: 411, baseType: !628, size: 32, offset: 1504)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !902, file: !88, line: 414, baseType: !544, size: 64, offset: 1536)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !902, file: !88, line: 417, baseType: !621, size: 32, offset: 1600)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !902, file: !88, line: 420, baseType: !878, size: 32, offset: 1632)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "preview_type", scope: !902, file: !88, line: 423, baseType: !937, size: 32, offset: 1664)
!937 = !DIDerivedType(tag: DW_TAG_typedef, name: "PreviewType", file: !405, line: 59, baseType: !404)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !902, file: !88, line: 426, baseType: !672, size: 64, offset: 1728)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "ping", scope: !902, file: !88, line: 429, baseType: !628, size: 32, offset: 1792)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !902, file: !88, line: 430, baseType: !628, size: 32, offset: 1824)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !902, file: !88, line: 433, baseType: !555, size: 64, offset: 1856)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "authenticate", scope: !902, file: !88, line: 434, baseType: !555, size: 64, offset: 1920)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !902, file: !88, line: 437, baseType: !944, size: 32, offset: 1984)
!944 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChannelType", file: !4, line: 202, baseType: !437)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !902, file: !88, line: 440, baseType: !614, size: 64, offset: 2048)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !902, file: !88, line: 443, baseType: !599, size: 64, offset: 2112)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !902, file: !88, line: 446, baseType: !734, size: 64, offset: 2176)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !902, file: !88, line: 449, baseType: !599, size: 64, offset: 2240)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !902, file: !88, line: 450, baseType: !599, size: 64, offset: 2304)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !902, file: !88, line: 453, baseType: !811, size: 64, offset: 2368)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !902, file: !88, line: 456, baseType: !546, size: 64, offset: 2432)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !902, file: !88, line: 459, baseType: !599, size: 64, offset: 2496)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !902, file: !88, line: 462, baseType: !544, size: 64, offset: 2560)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !902, file: !88, line: 465, baseType: !829, size: 32768, offset: 2624)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "unique", scope: !902, file: !88, line: 466, baseType: !829, size: 32768, offset: 35392)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "zero", scope: !902, file: !88, line: 467, baseType: !829, size: 32768, offset: 68160)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !902, file: !88, line: 468, baseType: !829, size: 32768, offset: 100928)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !902, file: !88, line: 471, baseType: !628, size: 32, offset: 133696)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "tile", scope: !902, file: !88, line: 474, baseType: !555, size: 64, offset: 133760)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "subimage", scope: !902, file: !88, line: 477, baseType: !544, size: 64, offset: 133824)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "subrange", scope: !902, file: !88, line: 478, baseType: !544, size: 64, offset: 133888)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "pen", scope: !902, file: !88, line: 481, baseType: !636, size: 64, offset: 133952)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !902, file: !88, line: 484, baseType: !544, size: 64, offset: 134016)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_pixel_method", scope: !902, file: !88, line: 487, baseType: !965, size: 32, offset: 134080)
!965 = !DIDerivedType(tag: DW_TAG_typedef, name: "VirtualPixelMethod", file: !460, line: 47, baseType: !459)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_color", scope: !902, file: !88, line: 490, baseType: !636, size: 64, offset: 134112)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !902, file: !88, line: 493, baseType: !599, size: 64, offset: 134208)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "synchronize", scope: !902, file: !88, line: 496, baseType: !628, size: 32, offset: 134272)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "decoder", scope: !892, file: !481, line: 64, baseType: !970, size: 64, offset: 384)
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64)
!971 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeImageHandler", file: !481, line: 43, baseType: !972)
!972 = !DISubroutineType(types: !973)
!973 = !{!614, !974, !976}
!974 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !975, size: 64)
!975 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !901)
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !837, size: 64)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "encoder", scope: !892, file: !481, line: 67, baseType: !978, size: 64, offset: 448)
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 64)
!979 = !DIDerivedType(tag: DW_TAG_typedef, name: "EncodeImageHandler", file: !481, line: 46, baseType: !980)
!980 = !DISubroutineType(types: !981)
!981 = !{!628, !974, !614}
!982 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !892, file: !481, line: 70, baseType: !983, size: 64, offset: 512)
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64)
!984 = !DIDerivedType(tag: DW_TAG_typedef, name: "IsImageFormatHandler", file: !481, line: 49, baseType: !985)
!985 = !DISubroutineType(types: !986)
!986 = !{!628, !987, !818}
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 64)
!988 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !607)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !892, file: !481, line: 73, baseType: !599, size: 64, offset: 576)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "adjoin", scope: !892, file: !481, line: 76, baseType: !628, size: 32, offset: 640)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !892, file: !481, line: 77, baseType: !628, size: 32, offset: 672)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "endian_support", scope: !892, file: !481, line: 78, baseType: !628, size: 32, offset: 704)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "blob_support", scope: !892, file: !481, line: 79, baseType: !628, size: 32, offset: 736)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "seekable_stream", scope: !892, file: !481, line: 80, baseType: !628, size: 32, offset: 768)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "format_type", scope: !892, file: !481, line: 83, baseType: !996, size: 32, offset: 800)
!996 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickFormatType", file: !481, line: 33, baseType: !480)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "thread_support", scope: !892, file: !481, line: 86, baseType: !998, size: 32, offset: 832)
!998 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickStatusType", file: !4, line: 147, baseType: !5)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "stealth", scope: !892, file: !481, line: 89, baseType: !628, size: 32, offset: 864)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !892, file: !481, line: 92, baseType: !1001, size: 64, offset: 896)
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !892, size: 64)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !892, file: !481, line: 93, baseType: !1001, size: 64, offset: 960)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !892, file: !481, line: 96, baseType: !544, size: 64, offset: 1024)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !892, file: !481, line: 99, baseType: !555, size: 64, offset: 1088)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !892, file: !481, line: 102, baseType: !822, size: 64, offset: 1152)
!1006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !884, size: 64)
!1007 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !673, line: 63, baseType: !575)
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 64)
!1009 = !{i32 7, !"Dwarf Version", i32 4}
!1010 = !{i32 2, !"Debug Info Version", i32 3}
!1011 = !{i32 1, !"wchar_size", i32 4}
!1012 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!1013 = distinct !DISubprogram(name: "AttachBlob", scope: !1, file: !1, line: 192, type: !1014, scopeLine: 194, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !1016)
!1014 = !DISubroutineType(types: !1015)
!1015 = !{null, !751, !612, !818}
!1016 = !{}
!1017 = !DILocalVariable(name: "blob_info", arg: 1, scope: !1013, file: !1, line: 192, type: !751)
!1018 = !DILocation(line: 192, column: 40, scope: !1013)
!1019 = !DILocalVariable(name: "blob", arg: 2, scope: !1013, file: !1, line: 192, type: !612)
!1020 = !DILocation(line: 192, column: 62, scope: !1013)
!1021 = !DILocalVariable(name: "length", arg: 3, scope: !1013, file: !1, line: 193, type: !818)
!1022 = !DILocation(line: 193, column: 16, scope: !1013)
!1023 = !DILocation(line: 196, column: 7, scope: !1024)
!1024 = distinct !DILexicalBlock(scope: !1013, file: !1, line: 196, column: 7)
!1025 = !DILocation(line: 196, column: 18, scope: !1024)
!1026 = !DILocation(line: 196, column: 24, scope: !1024)
!1027 = !DILocation(line: 196, column: 7, scope: !1013)
!1028 = !DILocation(line: 197, column: 12, scope: !1024)
!1029 = !DILocation(line: 197, column: 5, scope: !1024)
!1030 = !DILocation(line: 198, column: 21, scope: !1013)
!1031 = !DILocation(line: 198, column: 3, scope: !1013)
!1032 = !DILocation(line: 198, column: 14, scope: !1013)
!1033 = !DILocation(line: 198, column: 20, scope: !1013)
!1034 = !DILocation(line: 199, column: 21, scope: !1013)
!1035 = !DILocation(line: 199, column: 3, scope: !1013)
!1036 = !DILocation(line: 199, column: 14, scope: !1013)
!1037 = !DILocation(line: 199, column: 20, scope: !1013)
!1038 = !DILocation(line: 200, column: 3, scope: !1013)
!1039 = !DILocation(line: 200, column: 14, scope: !1013)
!1040 = !DILocation(line: 200, column: 21, scope: !1013)
!1041 = !DILocation(line: 201, column: 3, scope: !1013)
!1042 = !DILocation(line: 201, column: 14, scope: !1013)
!1043 = !DILocation(line: 201, column: 20, scope: !1013)
!1044 = !DILocation(line: 202, column: 3, scope: !1013)
!1045 = !DILocation(line: 202, column: 14, scope: !1013)
!1046 = !DILocation(line: 202, column: 18, scope: !1013)
!1047 = !DILocation(line: 203, column: 3, scope: !1013)
!1048 = !DILocation(line: 203, column: 14, scope: !1013)
!1049 = !DILocation(line: 203, column: 24, scope: !1013)
!1050 = !DILocation(line: 203, column: 28, scope: !1013)
!1051 = !DILocation(line: 204, column: 37, scope: !1013)
!1052 = !DILocation(line: 204, column: 3, scope: !1013)
!1053 = !DILocation(line: 204, column: 14, scope: !1013)
!1054 = !DILocation(line: 204, column: 18, scope: !1013)
!1055 = !DILocation(line: 205, column: 3, scope: !1013)
!1056 = !DILocation(line: 205, column: 14, scope: !1013)
!1057 = !DILocation(line: 205, column: 20, scope: !1013)
!1058 = !DILocation(line: 206, column: 1, scope: !1013)
!1059 = distinct !DISubprogram(name: "BlobToFile", scope: !1, file: !1, line: 247, type: !1060, scopeLine: 249, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !1016)
!1060 = !DISubroutineType(types: !1061)
!1061 = !{!628, !555, !612, !818, !976}
!1062 = !DILocalVariable(name: "filename", arg: 1, scope: !1059, file: !1, line: 247, type: !555)
!1063 = !DILocation(line: 247, column: 49, scope: !1059)
!1064 = !DILocalVariable(name: "blob", arg: 2, scope: !1059, file: !1, line: 247, type: !612)
