; ModuleID = 'magick/distribute-cache.c'
source_filename = "magick/distribute-cache.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._DistributeCacheInfo = type { i32, i64, [4096 x i8], i32, i64, i32 }
%struct._ExceptionInfo = type { i32, i32, i8*, i8*, i8*, i32, %struct.SemaphoreInfo*, i64 }
%struct.SemaphoreInfo = type opaque
%struct._Image = type { i32, i32, i32, i64, i32, i32, i32, i64, i64, i64, i64, %struct._PixelPacket*, %struct._PixelPacket, %struct._PixelPacket, %struct._PixelPacket, double, %struct._ChromaticityInfo, i32, i8*, i32, i8*, i8*, i8*, i64, double, double, %struct._RectangleInfo, %struct._RectangleInfo, %struct._RectangleInfo, double, double, double, i32, i32, i32, i32, i32, i32, %struct._Image*, i64, i64, i64, i64, i64, i64, %struct._ErrorInfo, %struct._TimerInfo, i32 (i8*, i64, i64, i8*)*, i8*, i8*, i8*, %struct._Ascii85Info*, %struct._BlobInfo*, [4096 x i8], [4096 x i8], [4096 x i8], i64, i64, %struct._ExceptionInfo, i32, i64, %struct.SemaphoreInfo*, %struct._ProfileInfo, %struct._ProfileInfo, %struct._ProfileInfo*, i64, i64, %struct._Image*, %struct._Image*, %struct._Image*, i32, i32, %struct._PixelPacket, %struct._Image*, %struct._RectangleInfo, i8*, i8*, i32, i32, i64, i32, i64, i64, i32, i64 }
%struct._ChromaticityInfo = type { %struct._PrimaryInfo, %struct._PrimaryInfo, %struct._PrimaryInfo, %struct._PrimaryInfo }

!16 = !DIDerivedType(tag: DW_TAG_member, name: "severity", scope: !13, file: !14, line: 105, baseType: !17, size: 32)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionType", file: !14, line: 100, baseType: !18)
!18 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !14, line: 28, baseType: !19, size: 32, elements: !20)
!19 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!20 = !{!21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90}
!21 = !DIEnumerator(name: "UndefinedException", value: 0, isUnsigned: true)
!22 = !DIEnumerator(name: "WarningException", value: 300, isUnsigned: true)
!23 = !DIEnumerator(name: "ResourceLimitWarning", value: 300, isUnsigned: true)
!24 = !DIEnumerator(name: "TypeWarning", value: 305, isUnsigned: true)
!25 = !DIEnumerator(name: "OptionWarning", value: 310, isUnsigned: true)
!26 = !DIEnumerator(name: "DelegateWarning", value: 315, isUnsigned: true)
!27 = !DIEnumerator(name: "MissingDelegateWarning", value: 320, isUnsigned: true)
!28 = !DIEnumerator(name: "CorruptImageWarning", value: 325, isUnsigned: true)
!29 = !DIEnumerator(name: "FileOpenWarning", value: 330, isUnsigned: true)
!30 = !DIEnumerator(name: "BlobWarning", value: 335, isUnsigned: true)
!31 = !DIEnumerator(name: "StreamWarning", value: 340, isUnsigned: true)
!32 = !DIEnumerator(name: "CacheWarning", value: 345, isUnsigned: true)
!33 = !DIEnumerator(name: "CoderWarning", value: 350, isUnsigned: true)
!34 = !DIEnumerator(name: "FilterWarning", value: 352, isUnsigned: true)
!35 = !DIEnumerator(name: "ModuleWarning", value: 355, isUnsigned: true)
!36 = !DIEnumerator(name: "DrawWarning", value: 360, isUnsigned: true)
!37 = !DIEnumerator(name: "ImageWarning", value: 365, isUnsigned: true)
!38 = !DIEnumerator(name: "WandWarning", value: 370, isUnsigned: true)
!39 = !DIEnumerator(name: "RandomWarning", value: 375, isUnsigned: true)
!40 = !DIEnumerator(name: "XServerWarning", value: 380, isUnsigned: true)
!41 = !DIEnumerator(name: "MonitorWarning", value: 385, isUnsigned: true)
!42 = !DIEnumerator(name: "RegistryWarning", value: 390, isUnsigned: true)
!43 = !DIEnumerator(name: "ConfigureWarning", value: 395, isUnsigned: true)
!44 = !DIEnumerator(name: "PolicyWarning", value: 399, isUnsigned: true)
!45 = !DIEnumerator(name: "ErrorException", value: 400, isUnsigned: true)
!46 = !DIEnumerator(name: "ResourceLimitError", value: 400, isUnsigned: true)
!47 = !DIEnumerator(name: "TypeError", value: 405, isUnsigned: true)
!48 = !DIEnumerator(name: "OptionError", value: 410, isUnsigned: true)
!49 = !DIEnumerator(name: "DelegateError", value: 415, isUnsigned: true)
!50 = !DIEnumerator(name: "MissingDelegateError", value: 420, isUnsigned: true)
!51 = !DIEnumerator(name: "CorruptImageError", value: 425, isUnsigned: true)
!52 = !DIEnumerator(name: "FileOpenError", value: 430, isUnsigned: true)
!53 = !DIEnumerator(name: "BlobError", value: 435, isUnsigned: true)
!54 = !DIEnumerator(name: "StreamError", value: 440, isUnsigned: true)
!55 = !DIEnumerator(name: "CacheError", value: 445, isUnsigned: true)
!56 = !DIEnumerator(name: "CoderError", value: 450, isUnsigned: true)
!57 = !DIEnumerator(name: "FilterError", value: 452, isUnsigned: true)
!58 = !DIEnumerator(name: "ModuleError", value: 455, isUnsigned: true)
!59 = !DIEnumerator(name: "DrawError", value: 460, isUnsigned: true)
!60 = !DIEnumerator(name: "ImageError", value: 465, isUnsigned: true)
!61 = !DIEnumerator(name: "WandError", value: 470, isUnsigned: true)
!62 = !DIEnumerator(name: "RandomError", value: 475, isUnsigned: true)
!63 = !DIEnumerator(name: "XServerError", value: 480, isUnsigned: true)
!64 = !DIEnumerator(name: "MonitorError", value: 485, isUnsigned: true)
!65 = !DIEnumerator(name: "RegistryError", value: 490, isUnsigned: true)
!66 = !DIEnumerator(name: "ConfigureError", value: 495, isUnsigned: true)
!67 = !DIEnumerator(name: "PolicyError", value: 499, isUnsigned: true)
!68 = !DIEnumerator(name: "FatalErrorException", value: 700, isUnsigned: true)
!69 = !DIEnumerator(name: "ResourceLimitFatalError", value: 700, isUnsigned: true)
!70 = !DIEnumerator(name: "TypeFatalError", value: 705, isUnsigned: true)
!71 = !DIEnumerator(name: "OptionFatalError", value: 710, isUnsigned: true)
!72 = !DIEnumerator(name: "DelegateFatalError", value: 715, isUnsigned: true)
!73 = !DIEnumerator(name: "MissingDelegateFatalError", value: 720, isUnsigned: true)
!74 = !DIEnumerator(name: "CorruptImageFatalError", value: 725, isUnsigned: true)
!75 = !DIEnumerator(name: "FileOpenFatalError", value: 730, isUnsigned: true)
!76 = !DIEnumerator(name: "BlobFatalError", value: 735, isUnsigned: true)
!77 = !DIEnumerator(name: "StreamFatalError", value: 740, isUnsigned: true)
!78 = !DIEnumerator(name: "CacheFatalError", value: 745, isUnsigned: true)
!79 = !DIEnumerator(name: "CoderFatalError", value: 750, isUnsigned: true)
!80 = !DIEnumerator(name: "FilterFatalError", value: 752, isUnsigned: true)
!81 = !DIEnumerator(name: "ModuleFatalError", value: 755, isUnsigned: true)
!82 = !DIEnumerator(name: "DrawFatalError", value: 760, isUnsigned: true)
!83 = !DIEnumerator(name: "ImageFatalError", value: 765, isUnsigned: true)
!84 = !DIEnumerator(name: "WandFatalError", value: 770, isUnsigned: true)
!85 = !DIEnumerator(name: "RandomFatalError", value: 775, isUnsigned: true)
!86 = !DIEnumerator(name: "XServerFatalError", value: 780, isUnsigned: true)
!87 = !DIEnumerator(name: "MonitorFatalError", value: 785, isUnsigned: true)
!88 = !DIEnumerator(name: "RegistryFatalError", value: 790, isUnsigned: true)
!89 = !DIEnumerator(name: "ConfigureFatalError", value: 795, isUnsigned: true)
!90 = !DIEnumerator(name: "PolicyFatalError", value: 799, isUnsigned: true)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "error_number", scope: !13, file: !14, line: 108, baseType: !9, size: 32, offset: 32)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !13, file: !14, line: 111, baseType: !6, size: 64, offset: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !13, file: !14, line: 112, baseType: !6, size: 64, offset: 128)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "exceptions", scope: !13, file: !14, line: 115, baseType: !95, size: 64, offset: 192)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "relinquish", scope: !13, file: !14, line: 118, baseType: !97, size: 32, offset: 256)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickBooleanType", file: !12, line: 215, baseType: !98)
!98 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !12, line: 211, baseType: !19, size: 32, elements: !99)
!99 = !{!100, !101}
!100 = !DIEnumerator(name: "MagickFalse", value: 0, isUnsigned: true)
!101 = !DIEnumerator(name: "MagickTrue", value: 1, isUnsigned: true)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !13, file: !14, line: 121, baseType: !103, size: 64, offset: 320)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "SemaphoreInfo", file: !105, line: 26, baseType: !106)
!105 = !DIFile(filename: "./magick/semaphore.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!106 = !DICompositeType(tag: DW_TAG_structure_type, name: "SemaphoreInfo", file: !105, line: 25, flags: DIFlagFwdDecl)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !13, file: !14, line: 124, baseType: !108, size: 64, offset: 384)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !109, line: 46, baseType: !110)
!109 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!110 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!111 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !112, retainedTypes: !406, globals: !433, splitDebugInlining: false, nameTableKind: None)
!112 = !{!98, !18, !113, !118, !155, !180, !192, !200, !205, !240, !250, !256, !271, !342, !350, !356, !373, !387, !399}
!113 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !12, line: 204, baseType: !19, size: 32, elements: !114)
!114 = !{!115, !116, !117}
!115 = !DIEnumerator(name: "UndefinedClass", value: 0, isUnsigned: true)
!116 = !DIEnumerator(name: "DirectClass", value: 1, isUnsigned: true)
!117 = !DIEnumerator(name: "PseudoClass", value: 2, isUnsigned: true)
!118 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !119, line: 25, baseType: !19, size: 32, elements: !120)
!119 = !DIFile(filename: "./magick/colorspace.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!120 = !{!121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154}
!121 = !DIEnumerator(name: "UndefinedColorspace", value: 0, isUnsigned: true)
!122 = !DIEnumerator(name: "RGBColorspace", value: 1, isUnsigned: true)
!123 = !DIEnumerator(name: "GRAYColorspace", value: 2, isUnsigned: true)
!124 = !DIEnumerator(name: "TransparentColorspace", value: 3, isUnsigned: true)
!125 = !DIEnumerator(name: "OHTAColorspace", value: 4, isUnsigned: true)
!126 = !DIEnumerator(name: "LabColorspace", value: 5, isUnsigned: true)
!127 = !DIEnumerator(name: "XYZColorspace", value: 6, isUnsigned: true)
!128 = !DIEnumerator(name: "YCbCrColorspace", value: 7, isUnsigned: true)
!129 = !DIEnumerator(name: "YCCColorspace", value: 8, isUnsigned: true)
!130 = !DIEnumerator(name: "YIQColorspace", value: 9, isUnsigned: true)
!131 = !DIEnumerator(name: "YPbPrColorspace", value: 10, isUnsigned: true)
!132 = !DIEnumerator(name: "YUVColorspace", value: 11, isUnsigned: true)
!133 = !DIEnumerator(name: "CMYKColorspace", value: 12, isUnsigned: true)
!134 = !DIEnumerator(name: "sRGBColorspace", value: 13, isUnsigned: true)
!135 = !DIEnumerator(name: "HSBColorspace", value: 14, isUnsigned: true)
!136 = !DIEnumerator(name: "HSLColorspace", value: 15, isUnsigned: true)
!137 = !DIEnumerator(name: "HWBColorspace", value: 16, isUnsigned: true)
!138 = !DIEnumerator(name: "Rec601LumaColorspace", value: 17, isUnsigned: true)
!139 = !DIEnumerator(name: "Rec601YCbCrColorspace", value: 18, isUnsigned: true)
!140 = !DIEnumerator(name: "Rec709LumaColorspace", value: 19, isUnsigned: true)
!141 = !DIEnumerator(name: "Rec709YCbCrColorspace", value: 20, isUnsigned: true)
!142 = !DIEnumerator(name: "LogColorspace", value: 21, isUnsigned: true)
!143 = !DIEnumerator(name: "CMYColorspace", value: 22, isUnsigned: true)
!144 = !DIEnumerator(name: "LuvColorspace", value: 23, isUnsigned: true)
!145 = !DIEnumerator(name: "HCLColorspace", value: 24, isUnsigned: true)
!146 = !DIEnumerator(name: "LCHColorspace", value: 25, isUnsigned: true)
!147 = !DIEnumerator(name: "LMSColorspace", value: 26, isUnsigned: true)
!148 = !DIEnumerator(name: "LCHabColorspace", value: 27, isUnsigned: true)
!149 = !DIEnumerator(name: "LCHuvColorspace", value: 28, isUnsigned: true)
!150 = !DIEnumerator(name: "scRGBColorspace", value: 29, isUnsigned: true)
!151 = !DIEnumerator(name: "HSIColorspace", value: 30, isUnsigned: true)
!152 = !DIEnumerator(name: "HSVColorspace", value: 31, isUnsigned: true)
!153 = !DIEnumerator(name: "HCLpColorspace", value: 32, isUnsigned: true)
!154 = !DIEnumerator(name: "YDbDrColorspace", value: 33, isUnsigned: true)
!155 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !156, line: 25, baseType: !19, size: 32, elements: !157)
!156 = !DIFile(filename: "./magick/compress.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!157 = !{!158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179}
!158 = !DIEnumerator(name: "UndefinedCompression", value: 0, isUnsigned: true)
!159 = !DIEnumerator(name: "NoCompression", value: 1, isUnsigned: true)
!160 = !DIEnumerator(name: "BZipCompression", value: 2, isUnsigned: true)
!161 = !DIEnumerator(name: "DXT1Compression", value: 3, isUnsigned: true)
!162 = !DIEnumerator(name: "DXT3Compression", value: 4, isUnsigned: true)
!163 = !DIEnumerator(name: "DXT5Compression", value: 5, isUnsigned: true)
!164 = !DIEnumerator(name: "FaxCompression", value: 6, isUnsigned: true)
!165 = !DIEnumerator(name: "Group4Compression", value: 7, isUnsigned: true)
!166 = !DIEnumerator(name: "JPEGCompression", value: 8, isUnsigned: true)
!167 = !DIEnumerator(name: "JPEG2000Compression", value: 9, isUnsigned: true)
!168 = !DIEnumerator(name: "LosslessJPEGCompression", value: 10, isUnsigned: true)
!169 = !DIEnumerator(name: "LZWCompression", value: 11, isUnsigned: true)
!170 = !DIEnumerator(name: "RLECompression", value: 12, isUnsigned: true)
!171 = !DIEnumerator(name: "ZipCompression", value: 13, isUnsigned: true)
!172 = !DIEnumerator(name: "ZipSCompression", value: 14, isUnsigned: true)
!173 = !DIEnumerator(name: "PizCompression", value: 15, isUnsigned: true)
!174 = !DIEnumerator(name: "Pxr24Compression", value: 16, isUnsigned: true)
!175 = !DIEnumerator(name: "B44Compression", value: 17, isUnsigned: true)
!176 = !DIEnumerator(name: "B44ACompression", value: 18, isUnsigned: true)
!177 = !DIEnumerator(name: "LZMACompression", value: 19, isUnsigned: true)
!178 = !DIEnumerator(name: "JBIG1Compression", value: 20, isUnsigned: true)
!179 = !DIEnumerator(name: "JBIG2Compression", value: 21, isUnsigned: true)
!180 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !181, line: 75, baseType: !19, size: 32, elements: !182)
!181 = !DIFile(filename: "./magick/image.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!182 = !{!183, !184, !185, !186, !187, !188, !189, !190, !191}
!183 = !DIEnumerator(name: "UndefinedOrientation", value: 0, isUnsigned: true)
!184 = !DIEnumerator(name: "TopLeftOrientation", value: 1, isUnsigned: true)
!185 = !DIEnumerator(name: "TopRightOrientation", value: 2, isUnsigned: true)
!186 = !DIEnumerator(name: "BottomRightOrientation", value: 3, isUnsigned: true)
!187 = !DIEnumerator(name: "BottomLeftOrientation", value: 4, isUnsigned: true)
!188 = !DIEnumerator(name: "LeftTopOrientation", value: 5, isUnsigned: true)
!189 = !DIEnumerator(name: "RightTopOrientation", value: 6, isUnsigned: true)
!190 = !DIEnumerator(name: "RightBottomOrientation", value: 7, isUnsigned: true)
!191 = !DIEnumerator(name: "LeftBottomOrientation", value: 8, isUnsigned: true)
!192 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !193, line: 42, baseType: !19, size: 32, elements: !194)
!193 = !DIFile(filename: "./magick/profile.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!194 = !{!195, !196, !197, !198, !199}
!195 = !DIEnumerator(name: "UndefinedIntent", value: 0, isUnsigned: true)
!196 = !DIEnumerator(name: "SaturationIntent", value: 1, isUnsigned: true)
!197 = !DIEnumerator(name: "PerceptualIntent", value: 2, isUnsigned: true)
!198 = !DIEnumerator(name: "AbsoluteIntent", value: 3, isUnsigned: true)
!199 = !DIEnumerator(name: "RelativeIntent", value: 4, isUnsigned: true)
!200 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !181, line: 88, baseType: !19, size: 32, elements: !201)
!201 = !{!202, !203, !204}
!202 = !DIEnumerator(name: "UndefinedResolution", value: 0, isUnsigned: true)
!203 = !DIEnumerator(name: "PixelsPerInchResolution", value: 1, isUnsigned: true)
!204 = !DIEnumerator(name: "PixelsPerCentimeterResolution", value: 2, isUnsigned: true)
!205 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !206, line: 32, baseType: !19, size: 32, elements: !207)
!206 = !DIFile(filename: "./magick/resample.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!207 = !{!208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239}
!208 = !DIEnumerator(name: "UndefinedFilter", value: 0, isUnsigned: true)
!209 = !DIEnumerator(name: "PointFilter", value: 1, isUnsigned: true)
!210 = !DIEnumerator(name: "BoxFilter", value: 2, isUnsigned: true)
!211 = !DIEnumerator(name: "TriangleFilter", value: 3, isUnsigned: true)
!212 = !DIEnumerator(name: "HermiteFilter", value: 4, isUnsigned: true)
!213 = !DIEnumerator(name: "HanningFilter", value: 5, isUnsigned: true)
!214 = !DIEnumerator(name: "HammingFilter", value: 6, isUnsigned: true)
!215 = !DIEnumerator(name: "BlackmanFilter", value: 7, isUnsigned: true)
!216 = !DIEnumerator(name: "GaussianFilter", value: 8, isUnsigned: true)
!217 = !DIEnumerator(name: "QuadraticFilter", value: 9, isUnsigned: true)
!218 = !DIEnumerator(name: "CubicFilter", value: 10, isUnsigned: true)
!219 = !DIEnumerator(name: "CatromFilter", value: 11, isUnsigned: true)
!220 = !DIEnumerator(name: "MitchellFilter", value: 12, isUnsigned: true)
!221 = !DIEnumerator(name: "JincFilter", value: 13, isUnsigned: true)
!222 = !DIEnumerator(name: "SincFilter", value: 14, isUnsigned: true)
!223 = !DIEnumerator(name: "SincFastFilter", value: 15, isUnsigned: true)
!224 = !DIEnumerator(name: "KaiserFilter", value: 16, isUnsigned: true)
!225 = !DIEnumerator(name: "WelshFilter", value: 17, isUnsigned: true)
!226 = !DIEnumerator(name: "ParzenFilter", value: 18, isUnsigned: true)
!227 = !DIEnumerator(name: "BohmanFilter", value: 19, isUnsigned: true)
!228 = !DIEnumerator(name: "BartlettFilter", value: 20, isUnsigned: true)
!229 = !DIEnumerator(name: "LagrangeFilter", value: 21, isUnsigned: true)
!230 = !DIEnumerator(name: "LanczosFilter", value: 22, isUnsigned: true)
!231 = !DIEnumerator(name: "LanczosSharpFilter", value: 23, isUnsigned: true)
!232 = !DIEnumerator(name: "Lanczos2Filter", value: 24, isUnsigned: true)
!233 = !DIEnumerator(name: "Lanczos2SharpFilter", value: 25, isUnsigned: true)
!234 = !DIEnumerator(name: "RobidouxFilter", value: 26, isUnsigned: true)
!235 = !DIEnumerator(name: "RobidouxSharpFilter", value: 27, isUnsigned: true)
!236 = !DIEnumerator(name: "CosineFilter", value: 28, isUnsigned: true)
!237 = !DIEnumerator(name: "SplineFilter", value: 29, isUnsigned: true)
!238 = !DIEnumerator(name: "LanczosRadiusFilter", value: 30, isUnsigned: true)
!239 = !DIEnumerator(name: "SentinelFilter", value: 31, isUnsigned: true)
!240 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !181, line: 63, baseType: !19, size: 32, elements: !241)
!241 = !{!242, !243, !244, !245, !246, !247, !248, !249}
!242 = !DIEnumerator(name: "UndefinedInterlace", value: 0, isUnsigned: true)
!243 = !DIEnumerator(name: "NoInterlace", value: 1, isUnsigned: true)
!244 = !DIEnumerator(name: "LineInterlace", value: 2, isUnsigned: true)
!245 = !DIEnumerator(name: "PlaneInterlace", value: 3, isUnsigned: true)
!246 = !DIEnumerator(name: "PartitionInterlace", value: 4, isUnsigned: true)
!247 = !DIEnumerator(name: "GIFInterlace", value: 5, isUnsigned: true)
!248 = !DIEnumerator(name: "JPEGInterlace", value: 6, isUnsigned: true)
!249 = !DIEnumerator(name: "PNGInterlace", value: 7, isUnsigned: true)
!250 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !251, line: 30, baseType: !19, size: 32, elements: !252)
!251 = !DIFile(filename: "./magick/quantum.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!252 = !{!253, !254, !255}
!253 = !DIEnumerator(name: "UndefinedEndian", value: 0, isUnsigned: true)
!254 = !DIEnumerator(name: "LSBEndian", value: 1, isUnsigned: true)
!255 = !DIEnumerator(name: "MSBEndian", value: 2, isUnsigned: true)
!256 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !257, line: 77, baseType: !19, size: 32, elements: !258)
!257 = !DIFile(filename: "./magick/geometry.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!258 = !{!259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270}
!259 = !DIEnumerator(name: "UndefinedGravity", value: 0, isUnsigned: true)
!260 = !DIEnumerator(name: "ForgetGravity", value: 0, isUnsigned: true)
!261 = !DIEnumerator(name: "NorthWestGravity", value: 1, isUnsigned: true)
!262 = !DIEnumerator(name: "NorthGravity", value: 2, isUnsigned: true)
!263 = !DIEnumerator(name: "NorthEastGravity", value: 3, isUnsigned: true)
!264 = !DIEnumerator(name: "WestGravity", value: 4, isUnsigned: true)
!265 = !DIEnumerator(name: "CenterGravity", value: 5, isUnsigned: true)
!266 = !DIEnumerator(name: "EastGravity", value: 6, isUnsigned: true)
!267 = !DIEnumerator(name: "SouthWestGravity", value: 7, isUnsigned: true)
!268 = !DIEnumerator(name: "SouthGravity", value: 8, isUnsigned: true)
!269 = !DIEnumerator(name: "SouthEastGravity", value: 9, isUnsigned: true)
!270 = !DIEnumerator(name: "StaticGravity", value: 10, isUnsigned: true)
!271 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !272, line: 25, baseType: !19, size: 32, elements: !273)
!272 = !DIFile(filename: "./magick/composite.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!273 = !{!274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341}
!274 = !DIEnumerator(name: "UndefinedCompositeOp", value: 0, isUnsigned: true)
!275 = !DIEnumerator(name: "NoCompositeOp", value: 1, isUnsigned: true)
!276 = !DIEnumerator(name: "ModulusAddCompositeOp", value: 2, isUnsigned: true)
!277 = !DIEnumerator(name: "AtopCompositeOp", value: 3, isUnsigned: true)
!278 = !DIEnumerator(name: "BlendCompositeOp", value: 4, isUnsigned: true)
!279 = !DIEnumerator(name: "BumpmapCompositeOp", value: 5, isUnsigned: true)
!280 = !DIEnumerator(name: "ChangeMaskCompositeOp", value: 6, isUnsigned: true)
!281 = !DIEnumerator(name: "ClearCompositeOp", value: 7, isUnsigned: true)
!282 = !DIEnumerator(name: "ColorBurnCompositeOp", value: 8, isUnsigned: true)
!283 = !DIEnumerator(name: "ColorDodgeCompositeOp", value: 9, isUnsigned: true)
!284 = !DIEnumerator(name: "ColorizeCompositeOp", value: 10, isUnsigned: true)
!285 = !DIEnumerator(name: "CopyBlackCompositeOp", value: 11, isUnsigned: true)
!286 = !DIEnumerator(name: "CopyBlueCompositeOp", value: 12, isUnsigned: true)
!287 = !DIEnumerator(name: "CopyCompositeOp", value: 13, isUnsigned: true)
!288 = !DIEnumerator(name: "CopyCyanCompositeOp", value: 14, isUnsigned: true)
!289 = !DIEnumerator(name: "CopyGreenCompositeOp", value: 15, isUnsigned: true)
!290 = !DIEnumerator(name: "CopyMagentaCompositeOp", value: 16, isUnsigned: true)
!291 = !DIEnumerator(name: "CopyOpacityCompositeOp", value: 17, isUnsigned: true)
!292 = !DIEnumerator(name: "CopyRedCompositeOp", value: 18, isUnsigned: true)
!293 = !DIEnumerator(name: "CopyYellowCompositeOp", value: 19, isUnsigned: true)
!294 = !DIEnumerator(name: "DarkenCompositeOp", value: 20, isUnsigned: true)
!295 = !DIEnumerator(name: "DstAtopCompositeOp", value: 21, isUnsigned: true)
!296 = !DIEnumerator(name: "DstCompositeOp", value: 22, isUnsigned: true)
!297 = !DIEnumerator(name: "DstInCompositeOp", value: 23, isUnsigned: true)
!298 = !DIEnumerator(name: "DstOutCompositeOp", value: 24, isUnsigned: true)
!299 = !DIEnumerator(name: "DstOverCompositeOp", value: 25, isUnsigned: true)
!300 = !DIEnumerator(name: "DifferenceCompositeOp", value: 26, isUnsigned: true)
!301 = !DIEnumerator(name: "DisplaceCompositeOp", value: 27, isUnsigned: true)
!302 = !DIEnumerator(name: "DissolveCompositeOp", value: 28, isUnsigned: true)
!303 = !DIEnumerator(name: "ExclusionCompositeOp", value: 29, isUnsigned: true)
!304 = !DIEnumerator(name: "HardLightCompositeOp", value: 30, isUnsigned: true)
!305 = !DIEnumerator(name: "HueCompositeOp", value: 31, isUnsigned: true)
!306 = !DIEnumerator(name: "InCompositeOp", value: 32, isUnsigned: true)
!307 = !DIEnumerator(name: "LightenCompositeOp", value: 33, isUnsigned: true)
!308 = !DIEnumerator(name: "LinearLightCompositeOp", value: 34, isUnsigned: true)
!309 = !DIEnumerator(name: "LuminizeCompositeOp", value: 35, isUnsigned: true)
!310 = !DIEnumerator(name: "MinusDstCompositeOp", value: 36, isUnsigned: true)
!311 = !DIEnumerator(name: "ModulateCompositeOp", value: 37, isUnsigned: true)
!312 = !DIEnumerator(name: "MultiplyCompositeOp", value: 38, isUnsigned: true)
!313 = !DIEnumerator(name: "OutCompositeOp", value: 39, isUnsigned: true)
!314 = !DIEnumerator(name: "OverCompositeOp", value: 40, isUnsigned: true)
!315 = !DIEnumerator(name: "OverlayCompositeOp", value: 41, isUnsigned: true)
!316 = !DIEnumerator(name: "PlusCompositeOp", value: 42, isUnsigned: true)
!317 = !DIEnumerator(name: "ReplaceCompositeOp", value: 43, isUnsigned: true)
!318 = !DIEnumerator(name: "SaturateCompositeOp", value: 44, isUnsigned: true)
!319 = !DIEnumerator(name: "ScreenCompositeOp", value: 45, isUnsigned: true)
!320 = !DIEnumerator(name: "SoftLightCompositeOp", value: 46, isUnsigned: true)
!321 = !DIEnumerator(name: "SrcAtopCompositeOp", value: 47, isUnsigned: true)
!322 = !DIEnumerator(name: "SrcCompositeOp", value: 48, isUnsigned: true)
!323 = !DIEnumerator(name: "SrcInCompositeOp", value: 49, isUnsigned: true)
!324 = !DIEnumerator(name: "SrcOutCompositeOp", value: 50, isUnsigned: true)
!325 = !DIEnumerator(name: "SrcOverCompositeOp", value: 51, isUnsigned: true)
!326 = !DIEnumerator(name: "ModulusSubtractCompositeOp", value: 52, isUnsigned: true)
!327 = !DIEnumerator(name: "ThresholdCompositeOp", value: 53, isUnsigned: true)
!328 = !DIEnumerator(name: "XorCompositeOp", value: 54, isUnsigned: true)
!329 = !DIEnumerator(name: "DivideDstCompositeOp", value: 55, isUnsigned: true)
!330 = !DIEnumerator(name: "DistortCompositeOp", value: 56, isUnsigned: true)
!331 = !DIEnumerator(name: "BlurCompositeOp", value: 57, isUnsigned: true)
!332 = !DIEnumerator(name: "PegtopLightCompositeOp", value: 58, isUnsigned: true)
!333 = !DIEnumerator(name: "VividLightCompositeOp", value: 59, isUnsigned: true)
!334 = !DIEnumerator(name: "PinLightCompositeOp", value: 60, isUnsigned: true)
!335 = !DIEnumerator(name: "LinearDodgeCompositeOp", value: 61, isUnsigned: true)
!336 = !DIEnumerator(name: "LinearBurnCompositeOp", value: 62, isUnsigned: true)
!337 = !DIEnumerator(name: "MathematicsCompositeOp", value: 63, isUnsigned: true)
!338 = !DIEnumerator(name: "DivideSrcCompositeOp", value: 64, isUnsigned: true)
!339 = !DIEnumerator(name: "MinusSrcCompositeOp", value: 65, isUnsigned: true)
!340 = !DIEnumerator(name: "DarkenIntensityCompositeOp", value: 66, isUnsigned: true)
!341 = !DIEnumerator(name: "LightenIntensityCompositeOp", value: 67, isUnsigned: true)
!342 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !343, line: 25, baseType: !19, size: 32, elements: !344)
!343 = !DIFile(filename: "./magick/layer.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!344 = !{!345, !346, !347, !348, !349}
!345 = !DIEnumerator(name: "UnrecognizedDispose", value: 0, isUnsigned: true)
!346 = !DIEnumerator(name: "UndefinedDispose", value: 0, isUnsigned: true)
!347 = !DIEnumerator(name: "NoneDispose", value: 1, isUnsigned: true)
!348 = !DIEnumerator(name: "BackgroundDispose", value: 2, isUnsigned: true)
!349 = !DIEnumerator(name: "PreviousDispose", value: 3, isUnsigned: true)
!350 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !351, line: 25, baseType: !19, size: 32, elements: !352)
!351 = !DIFile(filename: "./magick/timer.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!352 = !{!353, !354, !355}
!353 = !DIEnumerator(name: "UndefinedTimerState", value: 0, isUnsigned: true)
!354 = !DIEnumerator(name: "StoppedTimerState", value: 1, isUnsigned: true)
!355 = !DIEnumerator(name: "RunningTimerState", value: 2, isUnsigned: true)
!356 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !357, line: 31, baseType: !19, size: 32, elements: !358)
!357 = !DIFile(filename: "./magick/pixel.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!358 = !{!359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372}
!359 = !DIEnumerator(name: "UndefinedInterpolatePixel", value: 0, isUnsigned: true)
!360 = !DIEnumerator(name: "AverageInterpolatePixel", value: 1, isUnsigned: true)
!361 = !DIEnumerator(name: "BicubicInterpolatePixel", value: 2, isUnsigned: true)
!362 = !DIEnumerator(name: "BilinearInterpolatePixel", value: 3, isUnsigned: true)
!363 = !DIEnumerator(name: "FilterInterpolatePixel", value: 4, isUnsigned: true)
!364 = !DIEnumerator(name: "IntegerInterpolatePixel", value: 5, isUnsigned: true)
!365 = !DIEnumerator(name: "MeshInterpolatePixel", value: 6, isUnsigned: true)
!366 = !DIEnumerator(name: "NearestNeighborInterpolatePixel", value: 7, isUnsigned: true)
!367 = !DIEnumerator(name: "SplineInterpolatePixel", value: 8, isUnsigned: true)
!368 = !DIEnumerator(name: "Average9InterpolatePixel", value: 9, isUnsigned: true)
!369 = !DIEnumerator(name: "Average16InterpolatePixel", value: 10, isUnsigned: true)
!370 = !DIEnumerator(name: "BlendInterpolatePixel", value: 11, isUnsigned: true)
!371 = !DIEnumerator(name: "BackgroundInterpolatePixel", value: 12, isUnsigned: true)
!372 = !DIEnumerator(name: "CatromInterpolatePixel", value: 13, isUnsigned: true)
!373 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !181, line: 47, baseType: !19, size: 32, elements: !374)
!374 = !{!375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386}
!375 = !DIEnumerator(name: "UndefinedType", value: 0, isUnsigned: true)
!376 = !DIEnumerator(name: "BilevelType", value: 1, isUnsigned: true)
!377 = !DIEnumerator(name: "GrayscaleType", value: 2, isUnsigned: true)
!378 = !DIEnumerator(name: "GrayscaleMatteType", value: 3, isUnsigned: true)
!379 = !DIEnumerator(name: "PaletteType", value: 4, isUnsigned: true)
!380 = !DIEnumerator(name: "PaletteMatteType", value: 5, isUnsigned: true)
!381 = !DIEnumerator(name: "TrueColorType", value: 6, isUnsigned: true)
!382 = !DIEnumerator(name: "TrueColorMatteType", value: 7, isUnsigned: true)
!383 = !DIEnumerator(name: "ColorSeparationType", value: 8, isUnsigned: true)
!384 = !DIEnumerator(name: "ColorSeparationMatteType", value: 9, isUnsigned: true)
!385 = !DIEnumerator(name: "OptimizeType", value: 10, isUnsigned: true)
!386 = !DIEnumerator(name: "PaletteBilevelMatteType", value: 11, isUnsigned: true)
!387 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !357, line: 67, baseType: !19, size: 32, elements: !388)
!388 = !{!389, !390, !391, !392, !393, !394, !395, !396, !397, !398}
!389 = !DIEnumerator(name: "UndefinedPixelIntensityMethod", value: 0, isUnsigned: true)
!390 = !DIEnumerator(name: "AveragePixelIntensityMethod", value: 1, isUnsigned: true)
!391 = !DIEnumerator(name: "BrightnessPixelIntensityMethod", value: 2, isUnsigned: true)
!392 = !DIEnumerator(name: "LightnessPixelIntensityMethod", value: 3, isUnsigned: true)
!393 = !DIEnumerator(name: "Rec601LumaPixelIntensityMethod", value: 4, isUnsigned: true)
!394 = !DIEnumerator(name: "Rec601LuminancePixelIntensityMethod", value: 5, isUnsigned: true)
!395 = !DIEnumerator(name: "Rec709LumaPixelIntensityMethod", value: 6, isUnsigned: true)
!396 = !DIEnumerator(name: "Rec709LuminancePixelIntensityMethod", value: 7, isUnsigned: true)
!397 = !DIEnumerator(name: "RMSPixelIntensityMethod", value: 8, isUnsigned: true)
!398 = !DIEnumerator(name: "MSPixelIntensityMethod", value: 9, isUnsigned: true)
!399 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !400, line: 25, baseType: !19, size: 32, elements: !401)
!400 = !DIFile(filename: "./magick/registry.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!401 = !{!402, !403, !404, !405}
!402 = !DIEnumerator(name: "UndefinedRegistryType", value: 0, isUnsigned: true)
!403 = !DIEnumerator(name: "ImageRegistryType", value: 1, isUnsigned: true)
!404 = !DIEnumerator(name: "ImageInfoRegistryType", value: 2, isUnsigned: true)
!405 = !DIEnumerator(name: "StringRegistryType", value: 3, isUnsigned: true)
!406 = !{!407, !95, !110, !9, !421, !423, !425, !6, !427, !428}
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "DistributeCacheInfo", file: !409, line: 47, baseType: !410)
!409 = !DIFile(filename: "./magick/distribute-cache-private.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!410 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DistributeCacheInfo", file: !409, line: 28, size: 33088, elements: !411)
!411 = !{!412, !413, !414, !418, !419, !420}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !410, file: !409, line: 31, baseType: !9, size: 32)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "session_key", scope: !410, file: !409, line: 34, baseType: !108, size: 64, offset: 64)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "hostname", scope: !410, file: !409, line: 37, baseType: !415, size: 32768, offset: 128)
!415 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 32768, elements: !416)
!416 = !{!417}
!417 = !DISubrange(count: 4096)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !410, file: !409, line: 40, baseType: !9, size: 32, offset: 32896)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !410, file: !409, line: 43, baseType: !108, size: 64, offset: 32960)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !410, file: !409, line: 46, baseType: !97, size: 32, offset: 33024)
!421 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickOffsetType", file: !12, line: 150, baseType: !422)
!422 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!424 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickSizeType", file: !12, line: 151, baseType: !426)
!426 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !429, line: 77, baseType: !430)
!429 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!430 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !431, line: 193, baseType: !432)
!431 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!432 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!433 = !{!0}
!434 = !{}
!435 = !{i32 7, !"Dwarf Version", i32 4}
!436 = !{i32 2, !"Debug Info Version", i32 3}
!437 = !{i32 1, !"wchar_size", i32 4}
!438 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!439 = distinct !DISubprogram(name: "AcquireDistributeCacheInfo", scope: !3, file: !3, line: 304, type: !440, scopeLine: 306, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !111, retainedNodes: !434)
!440 = !DISubroutineType(types: !441)
!441 = !{!407, !10}
!442 = !DILocalVariable(name: "exception", arg: 1, scope: !439, file: !3, line: 305, type: !10)
!443 = !DILocation(line: 305, column: 18, scope: !439)
!444 = !DILocalVariable(name: "hostname", scope: !439, file: !3, line: 308, type: !6)
!445 = !DILocation(line: 308, column: 6, scope: !439)
!446 = !DILocalVariable(name: "server_info", scope: !439, file: !3, line: 311, type: !407)
!447 = !DILocation(line: 311, column: 6, scope: !439)
!448 = !DILocalVariable(name: "session_key", scope: !439, file: !3, line: 314, type: !108)
!449 = !DILocation(line: 314, column: 5, scope: !439)
!450 = !DILocation(line: 319, column: 39, scope: !439)
!451 = !DILocation(line: 319, column: 15, scope: !439)
!452 = !DILocation(line: 319, column: 14, scope: !439)
!453 = !DILocation(line: 320, column: 7, scope: !454)
!454 = distinct !DILexicalBlock(scope: !439, file: !3, line: 320, column: 7)
!455 = !DILocation(line: 320, column: 19, scope: !454)
!456 = !DILocation(line: 320, column: 7, scope: !439)
!457 = !DILocalVariable(name: "message", scope: !458, file: !3, line: 321, type: !6)
!458 = distinct !DILexicalBlock(scope: !454, file: !3, line: 321, column: 5)
!459 = !DILocation(line: 321, column: 5, scope: !458)
!460 = !DILocalVariable(name: "exception", scope: !458, file: !3, line: 321, type: !11)
!461 = !DILocation(line: 322, column: 28, scope: !439)
!462 = !DILocation(line: 322, column: 10, scope: !439)
!463 = !DILocation(line: 323, column: 3, scope: !439)
!464 = !DILocation(line: 323, column: 16, scope: !439)
!465 = !DILocation(line: 323, column: 25, scope: !439)
!466 = !DILocation(line: 324, column: 3, scope: !439)
!467 = !DILocation(line: 324, column: 16, scope: !439)
!468 = !DILocation(line: 324, column: 20, scope: !439)
!469 = !DILocation(line: 325, column: 25, scope: !439)
!470 = !DILocation(line: 325, column: 38, scope: !439)
!471 = !DILocation(line: 325, column: 43, scope: !439)
!472 = !DILocation(line: 325, column: 12, scope: !439)
!473 = !DILocation(line: 325, column: 11, scope: !439)
!474 = !DILocation(line: 326, column: 14, scope: !439)
!475 = !DILocation(line: 327, column: 45, scope: !439)
!476 = !DILocation(line: 327, column: 54, scope: !439)
!477 = !DILocation(line: 327, column: 67, scope: !439)
!478 = !DILocation(line: 328, column: 18, scope: !439)
!479 = !DILocation(line: 327, column: 21, scope: !439)
!480 = !DILocation(line: 327, column: 3, scope: !439)
!481 = !DILocation(line: 327, column: 16, scope: !439)
!482 = !DILocation(line: 327, column: 20, scope: !439)
!483 = !DILocation(line: 329, column: 28, scope: !439)
!484 = !DILocation(line: 329, column: 3, scope: !439)
!485 = !DILocation(line: 329, column: 16, scope: !439)
!486 = !DILocation(line: 329, column: 27, scope: !439)
!487 = !DILocation(line: 330, column: 27, scope: !439)
!488 = !DILocation(line: 330, column: 40, scope: !439)
!489 = !DILocation(line: 330, column: 49, scope: !439)
!490 = !DILocation(line: 330, column: 10, scope: !439)
!491 = !DILocation(line: 331, column: 26, scope: !439)
!492 = !DILocation(line: 331, column: 12, scope: !439)
!493 = !DILocation(line: 331, column: 11, scope: !439)
!494 = !DILocation(line: 332, column: 7, scope: !495)
!495 = distinct !DILexicalBlock(scope: !439, file: !3, line: 332, column: 7)
!496 = !DILocation(line: 332, column: 20, scope: !495)
!497 = !DILocation(line: 332, column: 25, scope: !495)
!498 = !DILocation(line: 332, column: 7, scope: !439)
!499 = !DILocation(line: 333, column: 44, scope: !495)
!500 = !DILocation(line: 333, column: 17, scope: !495)
!501 = !DILocation(line: 333, column: 16, scope: !495)
!502 = !DILocation(line: 333, column: 5, scope: !495)
!503 = !DILocation(line: 334, column: 22, scope: !439)
!504 = !DILocation(line: 334, column: 3, scope: !439)
!505 = !DILocation(line: 334, column: 16, scope: !439)
!506 = !DILocation(line: 334, column: 21, scope: !439)
!507 = !DILocation(line: 335, column: 10, scope: !439)
!508 = !DILocation(line: 335, column: 3, scope: !439)
!509 = !DILocalVariable(name: "port", arg: 1, scope: !2, file: !3, line: 249, type: !8)
!510 = !DILocation(line: 249, column: 31, scope: !2)
!511 = !DILocalVariable(name: "exception", arg: 2, scope: !2, file: !3, line: 249, type: !10)
!512 = !DILocation(line: 249, column: 51, scope: !2)
!513 = !DILocalVariable(name: "host", scope: !2, file: !3, line: 252, type: !6)
!514 = !DILocation(line: 252, column: 6, scope: !2)
!515 = !DILocalVariable(name: "hosts", scope: !2, file: !3, line: 253, type: !6)
!516 = !DILocation(line: 253, column: 6, scope: !2)
!517 = !DILocalVariable(name: "hostlist", scope: !2, file: !3, line: 254, type: !427)
!518 = !DILocation(line: 254, column: 7, scope: !2)
!519 = !DILocalVariable(name: "argc", scope: !2, file: !3, line: 257, type: !9)
!520 = !DILocation(line: 257, column: 5, scope: !2)
!521 = !DILocalVariable(name: "i", scope: !2, file: !3, line: 260, type: !428)
!522 = !DILocation(line: 260, column: 5, scope: !2)
!523 = !DILocation(line: 268, column: 68, scope: !2)
!524 = !DILocation(line: 268, column: 18, scope: !2)
!525 = !DILocation(line: 268, column: 8, scope: !2)
!526 = !DILocation(line: 269, column: 7, scope: !527)
!527 = distinct !DILexicalBlock(scope: !2, file: !3, line: 269, column: 7)
!528 = !DILocation(line: 269, column: 13, scope: !527)
!529 = !DILocation(line: 269, column: 7, scope: !2)
!530 = !DILocation(line: 271, column: 8, scope: !531)
!531 = distinct !DILexicalBlock(scope: !527, file: !3, line: 270, column: 5)
!532 = !DILocation(line: 271, column: 12, scope: !531)
!533 = !DILocation(line: 272, column: 14, scope: !531)
!534 = !DILocation(line: 272, column: 7, scope: !531)
!535 = !DILocation(line: 274, column: 10, scope: !2)
!536 = !DILocation(line: 275, column: 25, scope: !2)
!537 = !DILocation(line: 275, column: 12, scope: !2)
!538 = !DILocation(line: 275, column: 11, scope: !2)
!539 = !DILocation(line: 276, column: 23, scope: !2)
!540 = !DILocation(line: 276, column: 9, scope: !2)
!541 = !DILocation(line: 276, column: 8, scope: !2)
!542 = !DILocation(line: 277, column: 7, scope: !543)
!543 = distinct !DILexicalBlock(scope: !2, file: !3, line: 277, column: 7)
!544 = !DILocation(line: 277, column: 16, scope: !543)
!545 = !DILocation(line: 277, column: 7, scope: !2)
!546 = !DILocation(line: 279, column: 8, scope: !547)
!547 = distinct !DILexicalBlock(scope: !543, file: !3, line: 278, column: 5)
!548 = !DILocation(line: 279, column: 12, scope: !547)
!549 = !DILocation(line: 280, column: 14, scope: !547)
!550 = !DILocation(line: 280, column: 7, scope: !547)
!551 = !DILocation(line: 282, column: 23, scope: !2)
!552 = !DILocation(line: 282, column: 35, scope: !2)
!553 = !DILocation(line: 282, column: 41, scope: !2)
!554 = !DILocation(line: 282, column: 45, scope: !2)
!555 = !DILocation(line: 282, column: 40, scope: !2)
!556 = !DILocation(line: 282, column: 38, scope: !2)
!557 = !DILocation(line: 282, column: 49, scope: !2)
!558 = !DILocation(line: 282, column: 9, scope: !2)
!559 = !DILocation(line: 282, column: 8, scope: !2)
!560 = !DILocation(line: 283, column: 9, scope: !561)
!561 = distinct !DILexicalBlock(scope: !2, file: !3, line: 283, column: 3)
!562 = !DILocation(line: 283, column: 8, scope: !561)
!563 = !DILocation(line: 283, column: 13, scope: !564)
!564 = distinct !DILexicalBlock(scope: !561, file: !3, line: 283, column: 3)
!565 = !DILocation(line: 283, column: 27, scope: !564)
!566 = !DILocation(line: 283, column: 17, scope: !564)
!567 = !DILocation(line: 283, column: 15, scope: !564)
!568 = !DILocation(line: 283, column: 3, scope: !561)
!569 = !DILocation(line: 284, column: 31, scope: !564)
!570 = !DILocation(line: 284, column: 40, scope: !564)
!571 = !DILocation(line: 284, column: 17, scope: !564)
!572 = !DILocation(line: 284, column: 5, scope: !564)
!573 = !DILocation(line: 284, column: 14, scope: !564)
!574 = !DILocation(line: 284, column: 16, scope: !564)
!575 = !DILocation(line: 283, column: 34, scope: !564)
!576 = !DILocation(line: 283, column: 3, scope: !564)
!577 = distinct !{!577, !568, !578}
!578 = !DILocation(line: 284, column: 42, scope: !561)
!579 = !DILocation(line: 285, column: 45, scope: !2)
!580 = !DILocation(line: 285, column: 22, scope: !2)
!581 = !DILocation(line: 285, column: 12, scope: !2)
!582 = !DILocation(line: 285, column: 11, scope: !2)
!583 = !DILocation(line: 286, column: 10, scope: !2)
!584 = !DILocation(line: 287, column: 25, scope: !2)
!585 = !DILocation(line: 287, column: 12, scope: !2)
!586 = !DILocation(line: 287, column: 11, scope: !2)
!587 = !DILocation(line: 288, column: 7, scope: !588)
!588 = distinct !DILexicalBlock(scope: !2, file: !3, line: 288, column: 7)
!589 = !DILocation(line: 288, column: 16, scope: !588)
!590 = !DILocation(line: 288, column: 7, scope: !2)
!591 = !DILocation(line: 290, column: 8, scope: !592)
!592 = distinct !DILexicalBlock(scope: !588, file: !3, line: 289, column: 5)
!593 = !DILocation(line: 290, column: 12, scope: !592)
!594 = !DILocation(line: 291, column: 14, scope: !592)
!595 = !DILocation(line: 291, column: 7, scope: !592)
!596 = !DILocation(line: 293, column: 22, scope: !2)
!597 = !DILocation(line: 293, column: 8, scope: !2)
!598 = !DILocation(line: 293, column: 7, scope: !2)
!599 = !DILocation(line: 294, column: 7, scope: !600)
!600 = distinct !DILexicalBlock(scope: !2, file: !3, line: 294, column: 7)
!601 = !DILocation(line: 294, column: 19, scope: !600)
!602 = !DILocation(line: 294, column: 7, scope: !2)
!603 = !DILocation(line: 295, column: 6, scope: !600)
!604 = !DILocation(line: 295, column: 10, scope: !600)
!605 = !DILocation(line: 295, column: 5, scope: !600)
!606 = !DILocation(line: 297, column: 24, scope: !600)
!607 = !DILocation(line: 297, column: 11, scope: !600)
!608 = !DILocation(line: 297, column: 6, scope: !600)
!609 = !DILocation(line: 297, column: 10, scope: !600)
!610 = !DILocation(line: 298, column: 9, scope: !611)
!611 = distinct !DILexicalBlock(scope: !2, file: !3, line: 298, column: 3)
!612 = !DILocation(line: 298, column: 8, scope: !611)
!613 = !DILocation(line: 298, column: 13, scope: !614)
!614 = distinct !DILexicalBlock(scope: !611, file: !3, line: 298, column: 3)
!615 = !DILocation(line: 298, column: 27, scope: !614)
!616 = !DILocation(line: 298, column: 17, scope: !614)
!617 = !DILocation(line: 298, column: 15, scope: !614)
!618 = !DILocation(line: 298, column: 3, scope: !611)
!619 = !DILocation(line: 299, column: 31, scope: !614)
!620 = !DILocation(line: 299, column: 40, scope: !614)
!621 = !DILocation(line: 299, column: 17, scope: !614)
!622 = !DILocation(line: 299, column: 5, scope: !614)
!623 = !DILocation(line: 299, column: 14, scope: !614)
!624 = !DILocation(line: 299, column: 16, scope: !614)
!625 = !DILocation(line: 298, column: 34, scope: !614)
!626 = !DILocation(line: 298, column: 3, scope: !614)
!627 = distinct !{!627, !618, !628}
!628 = !DILocation(line: 299, column: 42, scope: !611)
!629 = !DILocation(line: 300, column: 45, scope: !2)
!630 = !DILocation(line: 300, column: 22, scope: !2)
!631 = !DILocation(line: 300, column: 12, scope: !2)
!632 = !DILocation(line: 300, column: 11, scope: !2)
!633 = !DILocation(line: 301, column: 10, scope: !2)
!634 = !DILocation(line: 301, column: 3, scope: !2)
!635 = !DILocation(line: 302, column: 1, scope: !2)
!636 = distinct !DISubprogram(name: "ConnectPixelCacheServer", scope: !3, file: !3, line: 158, type: !637, scopeLine: 160, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !111, retainedNodes: !434)
!637 = !DISubroutineType(types: !638)
!638 = !{!9, !639, !641, !642, !10}
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64)
!640 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !7)
!641 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !9)
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!643 = !DILocalVariable(name: "hostname", arg: 1, scope: !636, file: !3, line: 158, type: !639)
!644 = !DILocation(line: 158, column: 48, scope: !636)
!645 = !DILocalVariable(name: "port", arg: 2, scope: !636, file: !3, line: 158, type: !641)
!646 = !DILocation(line: 158, column: 67, scope: !636)
!647 = !DILocalVariable(name: "session_key", arg: 3, scope: !636, file: !3, line: 159, type: !642)
!648 = !DILocation(line: 159, column: 11, scope: !636)
!649 = !DILocalVariable(name: "exception", arg: 4, scope: !636, file: !3, line: 159, type: !10)
!650 = !DILocation(line: 159, column: 38, scope: !636)
!651 = !DILocation(line: 243, column: 31, scope: !636)
!652 = !DILocation(line: 243, column: 10, scope: !636)
!653 = !DILocation(line: 245, column: 3, scope: !636)
!654 = distinct !DISubprogram(name: "DestroyDistributeCacheInfo", scope: !3, file: !3, line: 362, type: !655, scopeLine: 364, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !111, retainedNodes: !434)
!655 = !DISubroutineType(types: !656)
!656 = !{!407, !407}
!657 = !DILocalVariable(name: "server_info", arg: 1, scope: !654, file: !3, line: 363, type: !407)
!658 = !DILocation(line: 363, column: 24, scope: !654)
!659 = !DILocation(line: 367, column: 7, scope: !660)
!660 = distinct !DILexicalBlock(scope: !654, file: !3, line: 367, column: 7)
!661 = !DILocation(line: 367, column: 20, scope: !660)
!662 = !DILocation(line: 367, column: 25, scope: !660)
!663 = !DILocation(line: 367, column: 7, scope: !654)
!664 = !DILocation(line: 368, column: 18, scope: !660)
!665 = !DILocation(line: 368, column: 31, scope: !660)
!666 = !DILocation(line: 368, column: 12, scope: !660)
!667 = !DILocation(line: 368, column: 5, scope: !660)
!668 = !DILocation(line: 369, column: 3, scope: !654)
!669 = !DILocation(line: 369, column: 16, scope: !654)
!670 = !DILocation(line: 369, column: 25, scope: !654)
!671 = !DILocation(line: 370, column: 62, scope: !654)
!672 = !DILocation(line: 370, column: 39, scope: !654)
!673 = !DILocation(line: 370, column: 15, scope: !654)
!674 = !DILocation(line: 370, column: 14, scope: !654)
!675 = !DILocation(line: 371, column: 10, scope: !654)
!676 = !DILocation(line: 371, column: 3, scope: !654)
!677 = distinct !DISubprogram(name: "DistributePixelCacheServer", scope: !3, file: !3, line: 850, type: !678, scopeLine: 852, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !111, retainedNodes: !434)
!678 = !DISubroutineType(types: !679)
!679 = !{null, !641, !10}
!680 = !DILocalVariable(name: "port", arg: 1, scope: !677, file: !3, line: 850, type: !641)
!681 = !DILocation(line: 850, column: 56, scope: !677)
!682 = !DILocalVariable(name: "exception", arg: 2, scope: !677, file: !3, line: 851, type: !10)
!683 = !DILocation(line: 851, column: 18, scope: !677)
!684 = !DILocalVariable(name: "message", scope: !685, file: !3, line: 941, type: !6)
!685 = distinct !DILexicalBlock(scope: !677, file: !3, line: 941, column: 3)
!686 = !DILocation(line: 941, column: 3, scope: !685)
!687 = !DILocalVariable(name: "exception", scope: !685, file: !3, line: 941, type: !11)
!688 = distinct !DISubprogram(name: "GetDistributeCacheFile", scope: !3, file: !3, line: 968, type: !689, scopeLine: 969, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !111, retainedNodes: !434)
!689 = !DISubroutineType(types: !690)
!690 = !{!9, !691}
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 64)
!692 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !408)
!693 = !DILocalVariable(name: "server_info", arg: 1, scope: !688, file: !3, line: 968, type: !691)
!694 = !DILocation(line: 968, column: 69, scope: !688)
!695 = !DILocation(line: 972, column: 10, scope: !688)
!696 = !DILocation(line: 972, column: 23, scope: !688)
!697 = !DILocation(line: 972, column: 3, scope: !688)
!698 = distinct !DISubprogram(name: "GetDistributeCacheHostname", scope: !3, file: !3, line: 999, type: !699, scopeLine: 1001, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !111, retainedNodes: !434)
!699 = !DISubroutineType(types: !700)
!700 = !{!639, !691}
!701 = !DILocalVariable(name: "server_info", arg: 1, scope: !698, file: !3, line: 1000, type: !691)
!702 = !DILocation(line: 1000, column: 30, scope: !698)
!703 = !DILocation(line: 1004, column: 10, scope: !698)
!704 = !DILocation(line: 1004, column: 23, scope: !698)
!705 = !DILocation(line: 1004, column: 9, scope: !698)
!706 = !DILocation(line: 1004, column: 3, scope: !698)
!707 = distinct !DISubprogram(name: "GetDistributeCachePort", scope: !3, file: !3, line: 1030, type: !689, scopeLine: 1031, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !111, retainedNodes: !434)
!708 = !DILocalVariable(name: "server_info", arg: 1, scope: !707, file: !3, line: 1030, type: !691)
!709 = !DILocation(line: 1030, column: 69, scope: !707)
!710 = !DILocation(line: 1034, column: 10, scope: !707)
!711 = !DILocation(line: 1034, column: 23, scope: !707)
!712 = !DILocation(line: 1034, column: 3, scope: !707)
!713 = distinct !DISubprogram(name: "OpenDistributePixelCache", scope: !3, file: !3, line: 1062, type: !714, scopeLine: 1064, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !111, retainedNodes: !434)
!714 = !DISubroutineType(types: !715)
!715 = !{!97, !407, !716}
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 64)
!717 = !DIDerivedType(tag: DW_TAG_typedef, name: "Image", file: !12, line: 221, baseType: !718)
!718 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Image", file: !181, line: 150, size: 105920, elements: !719)
!719 = !{!720, !722, !724, !726, !727, !729, !730, !731, !732, !733, !734, !735, !746, !747, !748, !749, !751, !765, !767, !768, !770, !771, !772, !773, !774, !775, !776, !784, !785, !786, !787, !788, !789, !791, !793, !795, !797, !799, !801, !803, !804, !805, !806, !807, !808, !809, !817, !832, !840, !841, !842, !843, !847, !851, !852, !853, !854, !855, !856, !857, !858, !860, !861, !869, !870, !872, !873, !874, !875, !876, !877, !879, !880, !881, !882, !883, !884, !885, !887, !888, !889, !890, !891, !895, !897}
!720 = !DIDerivedType(tag: DW_TAG_member, name: "storage_class", scope: !718, file: !181, line: 153, baseType: !721, size: 32)
!721 = !DIDerivedType(tag: DW_TAG_typedef, name: "ClassType", file: !12, line: 209, baseType: !113)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !718, file: !181, line: 156, baseType: !723, size: 32, offset: 32)
!723 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorspaceType", file: !119, line: 61, baseType: !118)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !718, file: !181, line: 159, baseType: !725, size: 32, offset: 64)
!725 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompressionType", file: !156, line: 49, baseType: !155)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !718, file: !181, line: 162, baseType: !108, size: 64, offset: 128)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !718, file: !181, line: 165, baseType: !728, size: 32, offset: 192)
!728 = !DIDerivedType(tag: DW_TAG_typedef, name: "OrientationType", file: !181, line: 86, baseType: !180)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "taint", scope: !718, file: !181, line: 168, baseType: !97, size: 32, offset: 224)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "matte", scope: !718, file: !181, line: 169, baseType: !97, size: 32, offset: 256)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !718, file: !181, line: 172, baseType: !108, size: 64, offset: 320)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !718, file: !181, line: 173, baseType: !108, size: 64, offset: 384)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !718, file: !181, line: 174, baseType: !108, size: 64, offset: 448)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !718, file: !181, line: 175, baseType: !108, size: 64, offset: 512)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "colormap", scope: !718, file: !181, line: 178, baseType: !736, size: 64, offset: 576)
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !737, size: 64)
!737 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelPacket", file: !357, line: 148, baseType: !738)
!738 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PixelPacket", file: !357, line: 131, size: 64, elements: !739)
!739 = !{!740, !743, !744, !745}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !738, file: !357, line: 143, baseType: !741, size: 16)
!741 = !DIDerivedType(tag: DW_TAG_typedef, name: "Quantum", file: !12, line: 93, baseType: !742)
!742 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !738, file: !357, line: 144, baseType: !741, size: 16, offset: 16)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !738, file: !357, line: 145, baseType: !741, size: 16, offset: 32)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !738, file: !357, line: 146, baseType: !741, size: 16, offset: 48)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "background_color", scope: !718, file: !181, line: 179, baseType: !737, size: 64, offset: 640)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !718, file: !181, line: 180, baseType: !737, size: 64, offset: 704)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "matte_color", scope: !718, file: !181, line: 181, baseType: !737, size: 64, offset: 768)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !718, file: !181, line: 184, baseType: !750, size: 64, offset: 832)
!750 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "chromaticity", scope: !718, file: !181, line: 187, baseType: !752, size: 768, offset: 896)
!752 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChromaticityInfo", file: !181, line: 128, baseType: !753)
!753 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ChromaticityInfo", file: !181, line: 121, size: 768, elements: !754)
!754 = !{!755, !762, !763, !764}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "red_primary", scope: !753, file: !181, line: 124, baseType: !756, size: 192)
!756 = !DIDerivedType(tag: DW_TAG_typedef, name: "PrimaryInfo", file: !181, line: 101, baseType: !757)
!757 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PrimaryInfo", file: !181, line: 95, size: 192, elements: !758)
!758 = !{!759, !760, !761}
!759 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !757, file: !181, line: 98, baseType: !750, size: 64)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !757, file: !181, line: 99, baseType: !750, size: 64, offset: 64)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !757, file: !181, line: 100, baseType: !750, size: 64, offset: 128)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "green_primary", scope: !753, file: !181, line: 125, baseType: !756, size: 192, offset: 192)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "blue_primary", scope: !753, file: !181, line: 126, baseType: !756, size: 192, offset: 384)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "white_point", scope: !753, file: !181, line: 127, baseType: !756, size: 192, offset: 576)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "rendering_intent", scope: !718, file: !181, line: 190, baseType: !766, size: 32, offset: 1664)
!766 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderingIntent", file: !193, line: 49, baseType: !192)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !718, file: !181, line: 193, baseType: !95, size: 64, offset: 1728)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !718, file: !181, line: 196, baseType: !769, size: 32, offset: 1792)
!769 = !DIDerivedType(tag: DW_TAG_typedef, name: "ResolutionType", file: !181, line: 93, baseType: !200)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "montage", scope: !718, file: !181, line: 199, baseType: !6, size: 64, offset: 1856)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "directory", scope: !718, file: !181, line: 200, baseType: !6, size: 64, offset: 1920)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "geometry", scope: !718, file: !181, line: 201, baseType: !6, size: 64, offset: 1984)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !718, file: !181, line: 204, baseType: !428, size: 64, offset: 2048)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "x_resolution", scope: !718, file: !181, line: 207, baseType: !750, size: 64, offset: 2112)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "y_resolution", scope: !718, file: !181, line: 208, baseType: !750, size: 64, offset: 2176)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !718, file: !181, line: 211, baseType: !777, size: 256, offset: 2240)
!777 = !DIDerivedType(tag: DW_TAG_typedef, name: "RectangleInfo", file: !257, line: 130, baseType: !778)
!778 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_RectangleInfo", file: !257, line: 121, size: 256, elements: !779)
!779 = !{!780, !781, !782, !783}
!780 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !778, file: !257, line: 124, baseType: !108, size: 64)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !778, file: !257, line: 125, baseType: !108, size: 64, offset: 64)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !778, file: !257, line: 128, baseType: !428, size: 64, offset: 128)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !778, file: !257, line: 129, baseType: !428, size: 64, offset: 192)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "extract_info", scope: !718, file: !181, line: 212, baseType: !777, size: 256, offset: 2496)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "tile_info", scope: !718, file: !181, line: 213, baseType: !777, size: 256, offset: 2752)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "bias", scope: !718, file: !181, line: 216, baseType: !750, size: 64, offset: 3008)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "blur", scope: !718, file: !181, line: 217, baseType: !750, size: 64, offset: 3072)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !718, file: !181, line: 218, baseType: !750, size: 64, offset: 3136)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !718, file: !181, line: 221, baseType: !790, size: 32, offset: 3200)
!790 = !DIDerivedType(tag: DW_TAG_typedef, name: "FilterTypes", file: !206, line: 66, baseType: !205)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "interlace", scope: !718, file: !181, line: 224, baseType: !792, size: 32, offset: 3232)
!792 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterlaceType", file: !181, line: 73, baseType: !240)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !718, file: !181, line: 227, baseType: !794, size: 32, offset: 3264)
!794 = !DIDerivedType(tag: DW_TAG_typedef, name: "EndianType", file: !251, line: 35, baseType: !250)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !718, file: !181, line: 230, baseType: !796, size: 32, offset: 3296)
!796 = !DIDerivedType(tag: DW_TAG_typedef, name: "GravityType", file: !257, line: 91, baseType: !256)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !718, file: !181, line: 233, baseType: !798, size: 32, offset: 3328)
!798 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompositeOperator", file: !272, line: 99, baseType: !271)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "dispose", scope: !718, file: !181, line: 236, baseType: !800, size: 32, offset: 3360)
!800 = !DIDerivedType(tag: DW_TAG_typedef, name: "DisposeType", file: !343, line: 32, baseType: !342)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "clip_mask", scope: !718, file: !181, line: 239, baseType: !802, size: 64, offset: 3392)
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !718, size: 64)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !718, file: !181, line: 242, baseType: !108, size: 64, offset: 3456)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !718, file: !181, line: 243, baseType: !108, size: 64, offset: 3520)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_second", scope: !718, file: !181, line: 246, baseType: !428, size: 64, offset: 3584)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "iterations", scope: !718, file: !181, line: 249, baseType: !108, size: 64, offset: 3648)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "total_colors", scope: !718, file: !181, line: 250, baseType: !108, size: 64, offset: 3712)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "start_loop", scope: !718, file: !181, line: 253, baseType: !428, size: 64, offset: 3776)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !718, file: !181, line: 256, baseType: !810, size: 192, offset: 3840)
!810 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErrorInfo", file: !811, line: 68, baseType: !812)
!811 = !DIFile(filename: "./magick/color.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!812 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ErrorInfo", file: !811, line: 62, size: 192, elements: !813)
!813 = !{!814, !815, !816}
!814 = !DIDerivedType(tag: DW_TAG_member, name: "mean_error_per_pixel", scope: !812, file: !811, line: 65, baseType: !750, size: 64)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_mean_error", scope: !812, file: !811, line: 66, baseType: !750, size: 64, offset: 64)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_maximum_error", scope: !812, file: !811, line: 67, baseType: !750, size: 64, offset: 128)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !718, file: !181, line: 259, baseType: !818, size: 512, offset: 4032)
!818 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerInfo", file: !351, line: 51, baseType: !819)
!819 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TimerInfo", file: !351, line: 40, size: 512, elements: !820)
!820 = !{!821, !828, !829, !831}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !819, file: !351, line: 43, baseType: !822, size: 192)
!822 = !DIDerivedType(tag: DW_TAG_typedef, name: "Timer", file: !351, line: 38, baseType: !823)
!823 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Timer", file: !351, line: 32, size: 192, elements: !824)
!824 = !{!825, !826, !827}
!825 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !823, file: !351, line: 35, baseType: !750, size: 64)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !823, file: !351, line: 36, baseType: !750, size: 64, offset: 64)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !823, file: !351, line: 37, baseType: !750, size: 64, offset: 128)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "elapsed", scope: !819, file: !351, line: 44, baseType: !822, size: 192, offset: 192)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !819, file: !351, line: 47, baseType: !830, size: 32, offset: 384)
!830 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerState", file: !351, line: 30, baseType: !350)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !819, file: !351, line: 50, baseType: !108, size: 64, offset: 448)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !718, file: !181, line: 262, baseType: !833, size: 64, offset: 4544)
!833 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickProgressMonitor", file: !834, line: 26, baseType: !835)
!834 = !DIFile(filename: "./magick/monitor.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !836, size: 64)
!836 = !DISubroutineType(types: !837)
!837 = !{!97, !639, !838, !839, !95}
!838 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !421)
!839 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !425)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !718, file: !181, line: 265, baseType: !95, size: 64, offset: 4608)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !718, file: !181, line: 266, baseType: !95, size: 64, offset: 4672)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !718, file: !181, line: 267, baseType: !95, size: 64, offset: 4736)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "ascii85", scope: !718, file: !181, line: 270, baseType: !844, size: 64, offset: 4800)
!844 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !845, size: 64)
!845 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ascii85Info", file: !156, line: 52, baseType: !846)
!846 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Ascii85Info", file: !156, line: 51, flags: DIFlagFwdDecl)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !718, file: !181, line: 273, baseType: !848, size: 64, offset: 4864)
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !849, size: 64)
!849 = !DIDerivedType(tag: DW_TAG_typedef, name: "BlobInfo", file: !12, line: 217, baseType: !850)
!850 = !DICompositeType(tag: DW_TAG_structure_type, name: "_BlobInfo", file: !12, line: 217, flags: DIFlagFwdDecl)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !718, file: !181, line: 276, baseType: !415, size: 32768, offset: 4928)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "magick_filename", scope: !718, file: !181, line: 277, baseType: !415, size: 32768, offset: 37696)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !718, file: !181, line: 278, baseType: !415, size: 32768, offset: 70464)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "magick_columns", scope: !718, file: !181, line: 281, baseType: !108, size: 64, offset: 103232)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "magick_rows", scope: !718, file: !181, line: 282, baseType: !108, size: 64, offset: 103296)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "exception", scope: !718, file: !181, line: 285, baseType: !11, size: 448, offset: 103360)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !718, file: !181, line: 288, baseType: !97, size: 32, offset: 103808)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !718, file: !181, line: 291, baseType: !859, size: 64, offset: 103872)
!859 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !428)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !718, file: !181, line: 294, baseType: !103, size: 64, offset: 103936)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "color_profile", scope: !718, file: !181, line: 297, baseType: !862, size: 256, offset: 104000)
!862 = !DIDerivedType(tag: DW_TAG_typedef, name: "ProfileInfo", file: !193, line: 40, baseType: !863)
!863 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ProfileInfo", file: !193, line: 27, size: 256, elements: !864)
!864 = !{!865, !866, !867, !868}
!865 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !863, file: !193, line: 30, baseType: !6, size: 64)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !863, file: !193, line: 33, baseType: !108, size: 64, offset: 64)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !863, file: !193, line: 36, baseType: !423, size: 64, offset: 128)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !863, file: !193, line: 39, baseType: !108, size: 64, offset: 192)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "iptc_profile", scope: !718, file: !181, line: 298, baseType: !862, size: 256, offset: 104256)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profile", scope: !718, file: !181, line: 299, baseType: !871, size: 64, offset: 104512)
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !862, size: 64)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profiles", scope: !718, file: !181, line: 302, baseType: !108, size: 64, offset: 104576)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !718, file: !181, line: 305, baseType: !108, size: 64, offset: 104640)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !718, file: !181, line: 308, baseType: !802, size: 64, offset: 104704)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !718, file: !181, line: 309, baseType: !802, size: 64, offset: 104768)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !718, file: !181, line: 310, baseType: !802, size: 64, offset: 104832)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "interpolate", scope: !718, file: !181, line: 313, baseType: !878, size: 32, offset: 104896)
!878 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterpolatePixelMethod", file: !357, line: 47, baseType: !356)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "black_point_compensation", scope: !718, file: !181, line: 316, baseType: !97, size: 32, offset: 104928)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_color", scope: !718, file: !181, line: 319, baseType: !737, size: 64, offset: 104960)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !718, file: !181, line: 322, baseType: !802, size: 64, offset: 105024)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "tile_offset", scope: !718, file: !181, line: 325, baseType: !777, size: 256, offset: 105088)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !718, file: !181, line: 328, baseType: !95, size: 64, offset: 105344)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "artifacts", scope: !718, file: !181, line: 329, baseType: !95, size: 64, offset: 105408)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !718, file: !181, line: 332, baseType: !886, size: 32, offset: 105472)
!886 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageType", file: !181, line: 61, baseType: !373)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !718, file: !181, line: 335, baseType: !97, size: 32, offset: 105504)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !718, file: !181, line: 338, baseType: !425, size: 64, offset: 105536)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "ping", scope: !718, file: !181, line: 341, baseType: !97, size: 32, offset: 105600)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !718, file: !181, line: 344, baseType: !108, size: 64, offset: 105664)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !718, file: !181, line: 347, baseType: !892, size: 64, offset: 105728)
!892 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !893, line: 7, baseType: !894)
!893 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "")
!894 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !431, line: 160, baseType: !432)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "intensity", scope: !718, file: !181, line: 350, baseType: !896, size: 32, offset: 105792)
!896 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelIntensityMethod", file: !357, line: 79, baseType: !387)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !718, file: !181, line: 353, baseType: !108, size: 64, offset: 105856)
!898 = !DILocalVariable(name: "server_info", arg: 1, scope: !713, file: !3, line: 1063, type: !407)
!899 = !DILocation(line: 1063, column: 24, scope: !713)
!900 = !DILocalVariable(name: "image", arg: 2, scope: !713, file: !3, line: 1063, type: !716)
!901 = !DILocation(line: 1063, column: 43, scope: !713)
!902 = !DILocalVariable(name: "status", scope: !713, file: !3, line: 1066, type: !97)
!903 = !DILocation(line: 1066, column: 5, scope: !713)
!904 = !DILocalVariable(name: "count", scope: !713, file: !3, line: 1069, type: !421)
!905 = !DILocation(line: 1069, column: 5, scope: !713)
!906 = !DILocalVariable(name: "p", scope: !713, file: !3, line: 1072, type: !423)
!907 = !DILocation(line: 1072, column: 6, scope: !713)
!908 = !DILocalVariable(name: "message", scope: !713, file: !3, line: 1075, type: !909)
!909 = !DICompositeType(tag: DW_TAG_array_type, baseType: !424, size: 32768, elements: !416)
!910 = !DILocation(line: 1075, column: 5, scope: !713)
!911 = !DILocation(line: 1084, column: 5, scope: !713)
!912 = !DILocation(line: 1084, column: 4, scope: !713)
!913 = !DILocation(line: 1085, column: 5, scope: !713)
!914 = !DILocation(line: 1085, column: 7, scope: !713)
!915 = !DILocation(line: 1089, column: 17, scope: !713)
!916 = !DILocation(line: 1089, column: 20, scope: !713)
!917 = !DILocation(line: 1089, column: 33, scope: !713)
!918 = !DILocation(line: 1089, column: 10, scope: !713)
!919 = !DILocation(line: 1090, column: 4, scope: !713)
!920 = !DILocation(line: 1091, column: 17, scope: !713)
!921 = !DILocation(line: 1091, column: 20, scope: !713)
!922 = !DILocation(line: 1091, column: 27, scope: !713)
!923 = !DILocation(line: 1091, column: 10, scope: !713)
!924 = !DILocation(line: 1092, column: 4, scope: !713)
!925 = !DILocation(line: 1093, column: 17, scope: !713)
!926 = !DILocation(line: 1093, column: 20, scope: !713)
!927 = !DILocation(line: 1093, column: 27, scope: !713)
!928 = !DILocation(line: 1093, column: 10, scope: !713)
!929 = !DILocation(line: 1094, column: 4, scope: !713)
!930 = !DILocation(line: 1095, column: 17, scope: !713)
!931 = !DILocation(line: 1095, column: 20, scope: !713)
!932 = !DILocation(line: 1095, column: 27, scope: !713)
!933 = !DILocation(line: 1095, column: 10, scope: !713)
!934 = !DILocation(line: 1096, column: 4, scope: !713)
!935 = !DILocation(line: 1097, column: 17, scope: !713)
!936 = !DILocation(line: 1097, column: 20, scope: !713)
!937 = !DILocation(line: 1097, column: 27, scope: !713)
!938 = !DILocation(line: 1097, column: 10, scope: !713)
!939 = !DILocation(line: 1098, column: 4, scope: !713)
!940 = !DILocation(line: 1099, column: 17, scope: !713)
!941 = !DILocation(line: 1099, column: 20, scope: !713)
!942 = !DILocation(line: 1099, column: 27, scope: !713)
!943 = !DILocation(line: 1099, column: 10, scope: !713)
!944 = !DILocation(line: 1100, column: 4, scope: !713)
!945 = !DILocation(line: 1101, column: 18, scope: !713)
!946 = !DILocation(line: 1101, column: 31, scope: !713)
!947 = !DILocation(line: 1101, column: 36, scope: !713)
!948 = !DILocation(line: 1101, column: 38, scope: !713)
!949 = !DILocation(line: 1101, column: 37, scope: !713)
!950 = !DILocation(line: 1101, column: 46, scope: !713)
!951 = !DILocation(line: 1101, column: 9, scope: !713)
!952 = !DILocation(line: 1101, column: 8, scope: !713)
!953 = !DILocation(line: 1102, column: 7, scope: !954)
!954 = distinct !DILexicalBlock(scope: !713, file: !3, line: 1102, column: 7)
!955 = !DILocation(line: 1102, column: 36, scope: !954)
!956 = !DILocation(line: 1102, column: 38, scope: !954)
!957 = !DILocation(line: 1102, column: 37, scope: !954)
!958 = !DILocation(line: 1102, column: 13, scope: !954)
!959 = !DILocation(line: 1102, column: 7, scope: !713)
!960 = !DILocation(line: 1103, column: 5, scope: !954)
!961 = !DILocation(line: 1104, column: 9, scope: !713)
!962 = !DILocation(line: 1105, column: 18, scope: !713)
