; ModuleID = 'magick/channel.c'
source_filename = "magick/channel.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._Image = type { i32, i32, i32, i64, i32, i32, i32, i64, i64, i64, i64, %struct._PixelPacket*, %struct._PixelPacket, %struct._PixelPacket, %struct._PixelPacket, double, %struct._ChromaticityInfo, i32, i8*, i32, i8*, i8*, i8*, i64, double, double, %struct._RectangleInfo, %struct._RectangleInfo, %struct._RectangleInfo, double, double, double, i32, i32, i32, i32, i32, i32, %struct._Image*, i64, i64, i64, i64, i64, i64, %struct._ErrorInfo, %struct._TimerInfo, i32 (i8*, i64, i64, i8*)*, i8*, i8*, i8*, %struct._Ascii85Info*, %struct._BlobInfo*, [4096 x i8], [4096 x i8], [4096 x i8], i64, i64, %struct._ExceptionInfo, i32, i64, %struct.SemaphoreInfo*, %struct._ProfileInfo, %struct._ProfileInfo, %struct._ProfileInfo*, i64, i64, %struct._Image*, %struct._Image*, %struct._Image*, i32, i32, %struct._PixelPacket, %struct._Image*, %struct._RectangleInfo, i8*, i8*, i32, i32, i64, i32, i64, i64, i32, i64 }
%struct._ChromaticityInfo = type { %struct._PrimaryInfo, %struct._PrimaryInfo, %struct._PrimaryInfo, %struct._PrimaryInfo }
%struct._PrimaryInfo = type { double, double, double }
%struct._ErrorInfo = type { double, double, double }
%struct._TimerInfo = type { %struct._Timer, %struct._Timer, i32, i64 }
%struct._Timer = type { double, double, double }

!369 = !{!370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389}
!370 = !DIEnumerator(name: "UndefinedChannel", value: 0, isUnsigned: true)
!371 = !DIEnumerator(name: "RedChannel", value: 1, isUnsigned: true)
!372 = !DIEnumerator(name: "GrayChannel", value: 1, isUnsigned: true)
!373 = !DIEnumerator(name: "CyanChannel", value: 1, isUnsigned: true)
!374 = !DIEnumerator(name: "GreenChannel", value: 2, isUnsigned: true)
!375 = !DIEnumerator(name: "MagentaChannel", value: 2, isUnsigned: true)
!376 = !DIEnumerator(name: "BlueChannel", value: 4, isUnsigned: true)
!377 = !DIEnumerator(name: "YellowChannel", value: 4, isUnsigned: true)
!378 = !DIEnumerator(name: "AlphaChannel", value: 8, isUnsigned: true)
!379 = !DIEnumerator(name: "OpacityChannel", value: 8, isUnsigned: true)
!380 = !DIEnumerator(name: "MatteChannel", value: 8, isUnsigned: true)
!381 = !DIEnumerator(name: "BlackChannel", value: 32, isUnsigned: true)
!382 = !DIEnumerator(name: "IndexChannel", value: 32, isUnsigned: true)
!383 = !DIEnumerator(name: "CompositeChannels", value: 47, isUnsigned: true)
!384 = !DIEnumerator(name: "AllChannels", value: 134217727, isUnsigned: true)
!385 = !DIEnumerator(name: "TrueAlphaChannel", value: 64, isUnsigned: true)
!386 = !DIEnumerator(name: "RGBChannels", value: 128, isUnsigned: true)
!387 = !DIEnumerator(name: "GrayChannels", value: 128, isUnsigned: true)
!388 = !DIEnumerator(name: "SyncChannels", value: 256, isUnsigned: true)
!389 = !DIEnumerator(name: "DefaultChannels", value: 134217719, isUnsigned: true)
!390 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !391, line: 34, baseType: !5, size: 32, elements: !392)
!391 = !DIFile(filename: "./magick/log.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!392 = !{!393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414}
!393 = !DIEnumerator(name: "UndefinedEvents", value: 0, isUnsigned: true)
!394 = !DIEnumerator(name: "NoEvents", value: 0, isUnsigned: true)
!395 = !DIEnumerator(name: "TraceEvent", value: 1, isUnsigned: true)
!396 = !DIEnumerator(name: "AnnotateEvent", value: 2, isUnsigned: true)
!397 = !DIEnumerator(name: "BlobEvent", value: 4, isUnsigned: true)
!398 = !DIEnumerator(name: "CacheEvent", value: 8, isUnsigned: true)
!399 = !DIEnumerator(name: "CoderEvent", value: 16, isUnsigned: true)
!400 = !DIEnumerator(name: "ConfigureEvent", value: 32, isUnsigned: true)
!401 = !DIEnumerator(name: "DeprecateEvent", value: 64, isUnsigned: true)
!402 = !DIEnumerator(name: "DrawEvent", value: 128, isUnsigned: true)
!403 = !DIEnumerator(name: "ExceptionEvent", value: 256, isUnsigned: true)
!404 = !DIEnumerator(name: "ImageEvent", value: 512, isUnsigned: true)
!405 = !DIEnumerator(name: "LocaleEvent", value: 1024, isUnsigned: true)
!406 = !DIEnumerator(name: "ModuleEvent", value: 2048, isUnsigned: true)
!407 = !DIEnumerator(name: "PolicyEvent", value: 4096, isUnsigned: true)
!408 = !DIEnumerator(name: "ResourceEvent", value: 8192, isUnsigned: true)
!409 = !DIEnumerator(name: "TransformEvent", value: 16384, isUnsigned: true)
!410 = !DIEnumerator(name: "UserEvent", value: 36864, isUnsigned: true)
!411 = !DIEnumerator(name: "WandEvent", value: 65536, isUnsigned: true)
!412 = !DIEnumerator(name: "X11Event", value: 131072, isUnsigned: true)
!413 = !DIEnumerator(name: "AccelerateEvent", value: 262144, isUnsigned: true)
!414 = !DIEnumerator(name: "AllEvents", value: 2147483647, isUnsigned: true)
!415 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !73, line: 30, baseType: !5, size: 32, elements: !416)
!416 = !{!417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429}
!417 = !DIEnumerator(name: "UndefinedAlphaChannel", value: 0, isUnsigned: true)
!418 = !DIEnumerator(name: "ActivateAlphaChannel", value: 1, isUnsigned: true)
!419 = !DIEnumerator(name: "BackgroundAlphaChannel", value: 2, isUnsigned: true)
!420 = !DIEnumerator(name: "CopyAlphaChannel", value: 3, isUnsigned: true)
!421 = !DIEnumerator(name: "DeactivateAlphaChannel", value: 4, isUnsigned: true)
!422 = !DIEnumerator(name: "ExtractAlphaChannel", value: 5, isUnsigned: true)
!423 = !DIEnumerator(name: "OpaqueAlphaChannel", value: 6, isUnsigned: true)
!424 = !DIEnumerator(name: "ResetAlphaChannel", value: 7, isUnsigned: true)
!425 = !DIEnumerator(name: "SetAlphaChannel", value: 8, isUnsigned: true)
!426 = !DIEnumerator(name: "ShapeAlphaChannel", value: 9, isUnsigned: true)
!427 = !DIEnumerator(name: "TransparentAlphaChannel", value: 10, isUnsigned: true)
!428 = !DIEnumerator(name: "FlattenAlphaChannel", value: 11, isUnsigned: true)
!429 = !DIEnumerator(name: "RemoveAlphaChannel", value: 12, isUnsigned: true)
!430 = !{!431, !432, !487, !496, !455, !653, !460, !655, !656, !560, !657, !469, !659}
!431 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "Image", file: !4, line: 221, baseType: !434)
!434 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Image", file: !73, line: 150, size: 105920, elements: !435)
!435 = !{!436, !438, !440, !442, !445, !447, !449, !450, !451, !452, !453, !454, !465, !466, !467, !468, !470, !484, !486, !488, !490, !493, !494, !495, !501, !502, !503, !511, !512, !513, !514, !515, !516, !518, !520, !522, !524, !526, !528, !530, !531, !532, !533, !534, !535, !536, !544, !559, !573, !574, !575, !576, !580, !584, !588, !589, !590, !591, !592, !610, !611, !613, !614, !624, !625, !627, !628, !629, !630, !631, !632, !634, !635, !636, !637, !638, !639, !640, !642, !643, !644, !645, !646, !650, !652}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "storage_class", scope: !434, file: !73, line: 153, baseType: !437, size: 32)
!437 = !DIDerivedType(tag: DW_TAG_typedef, name: "ClassType", file: !4, line: 209, baseType: !3)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !434, file: !73, line: 156, baseType: !439, size: 32, offset: 32)
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorspaceType", file: !11, line: 61, baseType: !10)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !434, file: !73, line: 159, baseType: !441, size: 32, offset: 64)
!441 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompressionType", file: !48, line: 49, baseType: !47)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !434, file: !73, line: 162, baseType: !443, size: 64, offset: 128)
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !444, line: 46, baseType: !431)
!444 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!445 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !434, file: !73, line: 165, baseType: !446, size: 32, offset: 192)
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "OrientationType", file: !73, line: 86, baseType: !72)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "taint", scope: !434, file: !73, line: 168, baseType: !448, size: 32, offset: 224)
!448 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickBooleanType", file: !4, line: 215, baseType: !84)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "matte", scope: !434, file: !73, line: 169, baseType: !448, size: 32, offset: 256)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !434, file: !73, line: 172, baseType: !443, size: 64, offset: 320)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !434, file: !73, line: 173, baseType: !443, size: 64, offset: 384)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !434, file: !73, line: 174, baseType: !443, size: 64, offset: 448)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !434, file: !73, line: 175, baseType: !443, size: 64, offset: 512)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "colormap", scope: !434, file: !73, line: 178, baseType: !455, size: 64, offset: 576)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64)
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelPacket", file: !326, line: 148, baseType: !457)
!457 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PixelPacket", file: !326, line: 131, size: 64, elements: !458)
!458 = !{!459, !462, !463, !464}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !457, file: !326, line: 143, baseType: !460, size: 16)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "Quantum", file: !4, line: 93, baseType: !461)
!461 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !457, file: !326, line: 144, baseType: !460, size: 16, offset: 16)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !457, file: !326, line: 145, baseType: !460, size: 16, offset: 32)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !457, file: !326, line: 146, baseType: !460, size: 16, offset: 48)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "background_color", scope: !434, file: !73, line: 179, baseType: !456, size: 64, offset: 640)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !434, file: !73, line: 180, baseType: !456, size: 64, offset: 704)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "matte_color", scope: !434, file: !73, line: 181, baseType: !456, size: 64, offset: 768)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !434, file: !73, line: 184, baseType: !469, size: 64, offset: 832)
!469 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "chromaticity", scope: !434, file: !73, line: 187, baseType: !471, size: 768, offset: 896)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChromaticityInfo", file: !73, line: 128, baseType: !472)
!472 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ChromaticityInfo", file: !73, line: 121, size: 768, elements: !473)
!473 = !{!474, !481, !482, !483}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "red_primary", scope: !472, file: !73, line: 124, baseType: !475, size: 192)
!475 = !DIDerivedType(tag: DW_TAG_typedef, name: "PrimaryInfo", file: !73, line: 101, baseType: !476)
!476 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PrimaryInfo", file: !73, line: 95, size: 192, elements: !477)
!477 = !{!478, !479, !480}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !476, file: !73, line: 98, baseType: !469, size: 64)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !476, file: !73, line: 99, baseType: !469, size: 64, offset: 64)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !476, file: !73, line: 100, baseType: !469, size: 64, offset: 128)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "green_primary", scope: !472, file: !73, line: 125, baseType: !475, size: 192, offset: 192)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "blue_primary", scope: !472, file: !73, line: 126, baseType: !475, size: 192, offset: 384)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "white_point", scope: !472, file: !73, line: 127, baseType: !475, size: 192, offset: 576)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "rendering_intent", scope: !434, file: !73, line: 190, baseType: !485, size: 32, offset: 1664)
!485 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderingIntent", file: !89, line: 49, baseType: !88)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !434, file: !73, line: 193, baseType: !487, size: 64, offset: 1728)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !434, file: !73, line: 196, baseType: !489, size: 32, offset: 1792)
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "ResolutionType", file: !73, line: 93, baseType: !96)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "montage", scope: !434, file: !73, line: 199, baseType: !491, size: 64, offset: 1856)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64)
!492 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "directory", scope: !434, file: !73, line: 200, baseType: !491, size: 64, offset: 1920)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "geometry", scope: !434, file: !73, line: 201, baseType: !491, size: 64, offset: 1984)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !434, file: !73, line: 204, baseType: !496, size: 64, offset: 2048)
!496 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !497, line: 77, baseType: !498)
!497 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!498 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !499, line: 193, baseType: !500)
!499 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!500 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "x_resolution", scope: !434, file: !73, line: 207, baseType: !469, size: 64, offset: 2112)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "y_resolution", scope: !434, file: !73, line: 208, baseType: !469, size: 64, offset: 2176)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !434, file: !73, line: 211, baseType: !504, size: 256, offset: 2240)
!504 = !DIDerivedType(tag: DW_TAG_typedef, name: "RectangleInfo", file: !153, line: 130, baseType: !505)
!505 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_RectangleInfo", file: !153, line: 121, size: 256, elements: !506)
!506 = !{!507, !508, !509, !510}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !505, file: !153, line: 124, baseType: !443, size: 64)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !505, file: !153, line: 125, baseType: !443, size: 64, offset: 64)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !505, file: !153, line: 128, baseType: !496, size: 64, offset: 128)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !505, file: !153, line: 129, baseType: !496, size: 64, offset: 192)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "extract_info", scope: !434, file: !73, line: 212, baseType: !504, size: 256, offset: 2496)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "tile_info", scope: !434, file: !73, line: 213, baseType: !504, size: 256, offset: 2752)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "bias", scope: !434, file: !73, line: 216, baseType: !469, size: 64, offset: 3008)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "blur", scope: !434, file: !73, line: 217, baseType: !469, size: 64, offset: 3072)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !434, file: !73, line: 218, baseType: !469, size: 64, offset: 3136)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !434, file: !73, line: 221, baseType: !517, size: 32, offset: 3200)
!517 = !DIDerivedType(tag: DW_TAG_typedef, name: "FilterTypes", file: !102, line: 66, baseType: !101)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "interlace", scope: !434, file: !73, line: 224, baseType: !519, size: 32, offset: 3232)
!519 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterlaceType", file: !73, line: 73, baseType: !136)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !434, file: !73, line: 227, baseType: !521, size: 32, offset: 3264)
!521 = !DIDerivedType(tag: DW_TAG_typedef, name: "EndianType", file: !147, line: 35, baseType: !146)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !434, file: !73, line: 230, baseType: !523, size: 32, offset: 3296)
!523 = !DIDerivedType(tag: DW_TAG_typedef, name: "GravityType", file: !153, line: 91, baseType: !152)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !434, file: !73, line: 233, baseType: !525, size: 32, offset: 3328)
!525 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompositeOperator", file: !168, line: 99, baseType: !167)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "dispose", scope: !434, file: !73, line: 236, baseType: !527, size: 32, offset: 3360)
!527 = !DIDerivedType(tag: DW_TAG_typedef, name: "DisposeType", file: !239, line: 32, baseType: !238)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "clip_mask", scope: !434, file: !73, line: 239, baseType: !529, size: 64, offset: 3392)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !434, file: !73, line: 242, baseType: !443, size: 64, offset: 3456)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !434, file: !73, line: 243, baseType: !443, size: 64, offset: 3520)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_second", scope: !434, file: !73, line: 246, baseType: !496, size: 64, offset: 3584)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "iterations", scope: !434, file: !73, line: 249, baseType: !443, size: 64, offset: 3648)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "total_colors", scope: !434, file: !73, line: 250, baseType: !443, size: 64, offset: 3712)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "start_loop", scope: !434, file: !73, line: 253, baseType: !496, size: 64, offset: 3776)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !434, file: !73, line: 256, baseType: !537, size: 192, offset: 3840)
!537 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErrorInfo", file: !538, line: 68, baseType: !539)
!538 = !DIFile(filename: "./magick/color.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!539 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ErrorInfo", file: !538, line: 62, size: 192, elements: !540)
!540 = !{!541, !542, !543}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "mean_error_per_pixel", scope: !539, file: !538, line: 65, baseType: !469, size: 64)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_mean_error", scope: !539, file: !538, line: 66, baseType: !469, size: 64, offset: 64)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_maximum_error", scope: !539, file: !538, line: 67, baseType: !469, size: 64, offset: 128)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !434, file: !73, line: 259, baseType: !545, size: 512, offset: 4032)
!545 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerInfo", file: !247, line: 51, baseType: !546)
!546 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TimerInfo", file: !247, line: 40, size: 512, elements: !547)
!547 = !{!548, !555, !556, !558}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !546, file: !247, line: 43, baseType: !549, size: 192)
!549 = !DIDerivedType(tag: DW_TAG_typedef, name: "Timer", file: !247, line: 38, baseType: !550)
!550 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Timer", file: !247, line: 32, size: 192, elements: !551)
!551 = !{!552, !553, !554}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !550, file: !247, line: 35, baseType: !469, size: 64)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !550, file: !247, line: 36, baseType: !469, size: 64, offset: 64)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !550, file: !247, line: 37, baseType: !469, size: 64, offset: 128)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "elapsed", scope: !546, file: !247, line: 44, baseType: !549, size: 192, offset: 192)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !546, file: !247, line: 47, baseType: !557, size: 32, offset: 384)
!557 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerState", file: !247, line: 30, baseType: !246)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !546, file: !247, line: 50, baseType: !443, size: 64, offset: 448)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !434, file: !73, line: 262, baseType: !560, size: 64, offset: 4544)
!560 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickProgressMonitor", file: !561, line: 26, baseType: !562)
!561 = !DIFile(filename: "./magick/monitor.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64)
!563 = !DISubroutineType(types: !564)
!564 = !{!448, !565, !567, !570, !487}
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64)
!566 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !492)
!567 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !568)
!568 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickOffsetType", file: !4, line: 150, baseType: !569)
!569 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!570 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !571)
!571 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickSizeType", file: !4, line: 151, baseType: !572)
!572 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !434, file: !73, line: 265, baseType: !487, size: 64, offset: 4608)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !434, file: !73, line: 266, baseType: !487, size: 64, offset: 4672)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !434, file: !73, line: 267, baseType: !487, size: 64, offset: 4736)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "ascii85", scope: !434, file: !73, line: 270, baseType: !577, size: 64, offset: 4800)
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 64)
!578 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ascii85Info", file: !48, line: 52, baseType: !579)
!579 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Ascii85Info", file: !48, line: 51, flags: DIFlagFwdDecl)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !434, file: !73, line: 273, baseType: !581, size: 64, offset: 4864)
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64)
!582 = !DIDerivedType(tag: DW_TAG_typedef, name: "BlobInfo", file: !4, line: 217, baseType: !583)
!583 = !DICompositeType(tag: DW_TAG_structure_type, name: "_BlobInfo", file: !4, line: 217, flags: DIFlagFwdDecl)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !434, file: !73, line: 276, baseType: !585, size: 32768, offset: 4928)
!585 = !DICompositeType(tag: DW_TAG_array_type, baseType: !492, size: 32768, elements: !586)
!586 = !{!587}
!587 = !DISubrange(count: 4096)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "magick_filename", scope: !434, file: !73, line: 277, baseType: !585, size: 32768, offset: 37696)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !434, file: !73, line: 278, baseType: !585, size: 32768, offset: 70464)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "magick_columns", scope: !434, file: !73, line: 281, baseType: !443, size: 64, offset: 103232)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "magick_rows", scope: !434, file: !73, line: 282, baseType: !443, size: 64, offset: 103296)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "exception", scope: !434, file: !73, line: 285, baseType: !593, size: 448, offset: 103360)
!593 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionInfo", file: !4, line: 219, baseType: !594)
!594 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ExceptionInfo", file: !253, line: 102, size: 448, elements: !595)
!595 = !{!596, !598, !600, !601, !602, !603, !604, !609}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "severity", scope: !594, file: !253, line: 105, baseType: !597, size: 32)
!597 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionType", file: !253, line: 100, baseType: !252)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "error_number", scope: !594, file: !253, line: 108, baseType: !599, size: 32, offset: 32)
!599 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !594, file: !253, line: 111, baseType: !491, size: 64, offset: 64)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !594, file: !253, line: 112, baseType: !491, size: 64, offset: 128)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "exceptions", scope: !594, file: !253, line: 115, baseType: !487, size: 64, offset: 192)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "relinquish", scope: !594, file: !253, line: 118, baseType: !448, size: 32, offset: 256)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !594, file: !253, line: 121, baseType: !605, size: 64, offset: 320)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!606 = !DIDerivedType(tag: DW_TAG_typedef, name: "SemaphoreInfo", file: !607, line: 26, baseType: !608)
!607 = !DIFile(filename: "./magick/semaphore.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!608 = !DICompositeType(tag: DW_TAG_structure_type, name: "SemaphoreInfo", file: !607, line: 25, flags: DIFlagFwdDecl)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !594, file: !253, line: 124, baseType: !443, size: 64, offset: 384)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !434, file: !73, line: 288, baseType: !448, size: 32, offset: 103808)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !434, file: !73, line: 291, baseType: !612, size: 64, offset: 103872)
!612 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !496)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !434, file: !73, line: 294, baseType: !605, size: 64, offset: 103936)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "color_profile", scope: !434, file: !73, line: 297, baseType: !615, size: 256, offset: 104000)
!615 = !DIDerivedType(tag: DW_TAG_typedef, name: "ProfileInfo", file: !89, line: 40, baseType: !616)
!616 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ProfileInfo", file: !89, line: 27, size: 256, elements: !617)
!617 = !{!618, !619, !620, !623}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !616, file: !89, line: 30, baseType: !491, size: 64)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !616, file: !89, line: 33, baseType: !443, size: 64, offset: 64)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !616, file: !89, line: 36, baseType: !621, size: 64, offset: 128)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 64)
!622 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !616, file: !89, line: 39, baseType: !443, size: 64, offset: 192)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "iptc_profile", scope: !434, file: !73, line: 298, baseType: !615, size: 256, offset: 104256)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profile", scope: !434, file: !73, line: 299, baseType: !626, size: 64, offset: 104512)
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profiles", scope: !434, file: !73, line: 302, baseType: !443, size: 64, offset: 104576)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !434, file: !73, line: 305, baseType: !443, size: 64, offset: 104640)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !434, file: !73, line: 308, baseType: !529, size: 64, offset: 104704)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !434, file: !73, line: 309, baseType: !529, size: 64, offset: 104768)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !434, file: !73, line: 310, baseType: !529, size: 64, offset: 104832)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "interpolate", scope: !434, file: !73, line: 313, baseType: !633, size: 32, offset: 104896)
!633 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterpolatePixelMethod", file: !326, line: 47, baseType: !325)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "black_point_compensation", scope: !434, file: !73, line: 316, baseType: !448, size: 32, offset: 104928)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_color", scope: !434, file: !73, line: 319, baseType: !456, size: 64, offset: 104960)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !434, file: !73, line: 322, baseType: !529, size: 64, offset: 105024)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "tile_offset", scope: !434, file: !73, line: 325, baseType: !504, size: 256, offset: 105088)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !434, file: !73, line: 328, baseType: !487, size: 64, offset: 105344)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "artifacts", scope: !434, file: !73, line: 329, baseType: !487, size: 64, offset: 105408)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !434, file: !73, line: 332, baseType: !641, size: 32, offset: 105472)
!641 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageType", file: !73, line: 61, baseType: !342)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !434, file: !73, line: 335, baseType: !448, size: 32, offset: 105504)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !434, file: !73, line: 338, baseType: !571, size: 64, offset: 105536)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "ping", scope: !434, file: !73, line: 341, baseType: !448, size: 32, offset: 105600)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !434, file: !73, line: 344, baseType: !443, size: 64, offset: 105664)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !434, file: !73, line: 347, baseType: !647, size: 64, offset: 105728)
!647 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !648, line: 7, baseType: !649)
!648 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "")
!649 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !499, line: 160, baseType: !500)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "intensity", scope: !434, file: !73, line: 350, baseType: !651, size: 32, offset: 105792)
!651 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelIntensityMethod", file: !326, line: 79, baseType: !356)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !434, file: !73, line: 353, baseType: !443, size: 64, offset: 105856)
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64)
!654 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !456)
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 64)
!656 = !DIDerivedType(tag: DW_TAG_typedef, name: "IndexPacket", file: !326, line: 129, baseType: !460)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64)
!658 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !656)
!659 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickRealType", file: !4, line: 78, baseType: !660)
!660 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!661 = !{i32 7, !"Dwarf Version", i32 4}
!662 = !{i32 2, !"Debug Info Version", i32 3}
!663 = !{i32 1, !"wchar_size", i32 4}
!664 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!665 = distinct !DISubprogram(name: "CombineImages", scope: !1, file: !1, line: 93, type: !666, scopeLine: 95, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !673)
!666 = !DISubroutineType(types: !667)
!667 = !{!432, !668, !670, !672}
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 64)
!669 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !433)
!670 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !671)
!671 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChannelType", file: !4, line: 202, baseType: !368)
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 64)
!673 = !{}
!674 = !DILocalVariable(name: "image", arg: 1, scope: !665, file: !1, line: 93, type: !668)
!675 = !DILocation(line: 93, column: 48, scope: !665)
!676 = !DILocalVariable(name: "channel", arg: 2, scope: !665, file: !1, line: 93, type: !670)
!677 = !DILocation(line: 93, column: 72, scope: !665)
!678 = !DILocalVariable(name: "exception", arg: 3, scope: !665, file: !1, line: 94, type: !672)
!679 = !DILocation(line: 94, column: 18, scope: !665)
!680 = !DILocalVariable(name: "combine_view", scope: !665, file: !1, line: 99, type: !681)
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64)
!682 = !DIDerivedType(tag: DW_TAG_typedef, name: "CacheView", file: !683, line: 50, baseType: !684)
!683 = !DIFile(filename: "./magick/cache-view.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!684 = !DICompositeType(tag: DW_TAG_structure_type, name: "_CacheView", file: !326, line: 160, flags: DIFlagFwdDecl)
!685 = !DILocation(line: 99, column: 6, scope: !665)
!686 = !DILocalVariable(name: "next", scope: !665, file: !1, line: 102, type: !668)
!687 = !DILocation(line: 102, column: 6, scope: !665)
!688 = !DILocalVariable(name: "combine_image", scope: !665, file: !1, line: 105, type: !432)
!689 = !DILocation(line: 105, column: 6, scope: !665)
!690 = !DILocalVariable(name: "status", scope: !665, file: !1, line: 108, type: !448)
!691 = !DILocation(line: 108, column: 5, scope: !665)
!692 = !DILocalVariable(name: "progress", scope: !665, file: !1, line: 111, type: !568)
!693 = !DILocation(line: 111, column: 5, scope: !665)
!694 = !DILocalVariable(name: "y", scope: !665, file: !1, line: 114, type: !496)
!695 = !DILocation(line: 114, column: 5, scope: !665)
!696 = !DILocation(line: 121, column: 7, scope: !697)
!697 = distinct !DILexicalBlock(scope: !665, file: !1, line: 121, column: 7)
!698 = !DILocation(line: 121, column: 14, scope: !697)
!699 = !DILocation(line: 121, column: 20, scope: !697)
!700 = !DILocation(line: 121, column: 7, scope: !665)
!701 = !DILocation(line: 122, column: 61, scope: !697)
!702 = !DILocation(line: 122, column: 68, scope: !697)
!703 = !DILocation(line: 122, column: 12, scope: !697)
!704 = !DILocation(line: 122, column: 5, scope: !697)
!705 = !DILocation(line: 125, column: 13, scope: !706)
!706 = distinct !DILexicalBlock(scope: !665, file: !1, line: 125, column: 3)
!707 = !DILocation(line: 125, column: 12, scope: !706)
!708 = !DILocation(line: 125, column: 8, scope: !706)
!709 = !DILocation(line: 125, column: 20, scope: !710)
!710 = distinct !DILexicalBlock(scope: !706, file: !1, line: 125, column: 3)
!711 = !DILocation(line: 125, column: 25, scope: !710)
!712 = !DILocation(line: 125, column: 3, scope: !706)
!713 = !DILocation(line: 127, column: 10, scope: !714)
!714 = distinct !DILexicalBlock(scope: !715, file: !1, line: 127, column: 9)
!715 = distinct !DILexicalBlock(scope: !710, file: !1, line: 126, column: 3)
!716 = !DILocation(line: 127, column: 16, scope: !714)
!717 = !DILocation(line: 127, column: 27, scope: !714)
!718 = !DILocation(line: 127, column: 34, scope: !714)
!719 = !DILocation(line: 127, column: 24, scope: !714)
!720 = !DILocation(line: 127, column: 43, scope: !714)
!721 = !DILocation(line: 127, column: 47, scope: !714)
!722 = !DILocation(line: 127, column: 53, scope: !714)
!723 = !DILocation(line: 127, column: 61, scope: !714)
!724 = !DILocation(line: 127, column: 68, scope: !714)
!725 = !DILocation(line: 127, column: 58, scope: !714)
!726 = !DILocation(line: 127, column: 9, scope: !715)
!727 = !DILocation(line: 128, column: 7, scope: !728)
!728 = distinct !DILexicalBlock(scope: !714, file: !1, line: 128, column: 7)
!729 = !DILocation(line: 129, column: 3, scope: !715)
!730 = !DILocation(line: 125, column: 68, scope: !710)
!731 = !DILocation(line: 125, column: 49, scope: !710)
!732 = !DILocation(line: 125, column: 48, scope: !710)
!733 = !DILocation(line: 125, column: 3, scope: !710)
!734 = distinct !{!734, !712, !735}
!735 = !DILocation(line: 129, column: 3, scope: !706)
!736 = !DILocation(line: 130, column: 28, scope: !665)
!737 = !DILocation(line: 130, column: 49, scope: !665)
!738 = !DILocation(line: 130, column: 17, scope: !665)
!739 = !DILocation(line: 130, column: 16, scope: !665)
!740 = !DILocation(line: 131, column: 7, scope: !741)
!741 = distinct !DILexicalBlock(scope: !665, file: !1, line: 131, column: 7)
!742 = !DILocation(line: 131, column: 21, scope: !741)
!743 = !DILocation(line: 131, column: 7, scope: !665)
!744 = !DILocation(line: 132, column: 5, scope: !741)
!745 = !DILocation(line: 133, column: 28, scope: !746)
!746 = distinct !DILexicalBlock(scope: !665, file: !1, line: 133, column: 7)
!747 = !DILocation(line: 133, column: 7, scope: !746)
!748 = !DILocation(line: 133, column: 55, scope: !746)
!749 = !DILocation(line: 133, column: 7, scope: !665)
!750 = !DILocation(line: 135, column: 24, scope: !751)
!751 = distinct !DILexicalBlock(scope: !746, file: !1, line: 134, column: 5)
!752 = !DILocation(line: 135, column: 35, scope: !751)
!753 = !DILocation(line: 135, column: 50, scope: !751)
!754 = !DILocation(line: 135, column: 7, scope: !751)
!755 = !DILocation(line: 136, column: 34, scope: !751)
!756 = !DILocation(line: 136, column: 21, scope: !751)
!757 = !DILocation(line: 136, column: 20, scope: !751)
!758 = !DILocation(line: 137, column: 7, scope: !751)
!759 = !DILocation(line: 139, column: 34, scope: !760)
!760 = distinct !DILexicalBlock(scope: !665, file: !1, line: 139, column: 7)
!761 = !DILocation(line: 139, column: 41, scope: !760)
!762 = !DILocation(line: 139, column: 7, scope: !760)
!763 = !DILocation(line: 139, column: 53, scope: !760)
!764 = !DILocation(line: 139, column: 7, scope: !665)
!765 = !DILocation(line: 140, column: 31, scope: !760)
!766 = !DILocation(line: 140, column: 12, scope: !760)
!767 = !DILocation(line: 140, column: 5, scope: !760)
!768 = !DILocation(line: 141, column: 8, scope: !769)
!769 = distinct !DILexicalBlock(scope: !665, file: !1, line: 141, column: 7)
!770 = !DILocation(line: 141, column: 16, scope: !769)
!771 = !DILocation(line: 141, column: 34, scope: !769)
!772 = !DILocation(line: 141, column: 7, scope: !665)
!773 = !DILocation(line: 142, column: 5, scope: !769)
!774 = !DILocation(line: 142, column: 20, scope: !769)
!775 = !DILocation(line: 142, column: 25, scope: !769)
!776 = !DILocation(line: 143, column: 34, scope: !665)
!777 = !DILocation(line: 143, column: 10, scope: !665)
!778 = !DILocation(line: 147, column: 9, scope: !665)
!779 = !DILocation(line: 148, column: 11, scope: !665)
!780 = !DILocation(line: 149, column: 42, scope: !665)
!781 = !DILocation(line: 149, column: 56, scope: !665)
!782 = !DILocation(line: 149, column: 16, scope: !665)
!783 = !DILocation(line: 149, column: 15, scope: !665)
!784 = !DILocation(line: 150, column: 9, scope: !785)
!785 = distinct !DILexicalBlock(scope: !665, file: !1, line: 150, column: 3)
!786 = !DILocation(line: 150, column: 8, scope: !785)
!787 = !DILocation(line: 150, column: 13, scope: !788)
!788 = distinct !DILexicalBlock(scope: !785, file: !1, line: 150, column: 3)
!789 = !DILocation(line: 150, column: 27, scope: !788)
!790 = !DILocation(line: 150, column: 42, scope: !788)
!791 = !DILocation(line: 150, column: 15, scope: !788)
!792 = !DILocation(line: 150, column: 3, scope: !785)
!793 = !DILocalVariable(name: "image_view", scope: !794, file: !1, line: 153, type: !681)
!794 = distinct !DILexicalBlock(scope: !788, file: !1, line: 151, column: 3)
!795 = !DILocation(line: 153, column: 8, scope: !794)
!796 = !DILocalVariable(name: "next", scope: !794, file: !1, line: 156, type: !668)
!797 = !DILocation(line: 156, column: 8, scope: !794)
!798 = !DILocalVariable(name: "pixels", scope: !794, file: !1, line: 159, type: !455)
!799 = !DILocation(line: 159, column: 8, scope: !794)
!800 = !DILocalVariable(name: "p", scope: !794, file: !1, line: 162, type: !801)
!801 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !653)
!802 = !DILocation(line: 162, column: 17, scope: !794)
!803 = !DILocalVariable(name: "q", scope: !794, file: !1, line: 165, type: !804)
!804 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !455)
!805 = !DILocation(line: 165, column: 17, scope: !794)
!806 = !DILocalVariable(name: "x", scope: !794, file: !1, line: 168, type: !496)
!807 = !DILocation(line: 168, column: 7, scope: !794)
!808 = !DILocation(line: 170, column: 9, scope: !809)
!809 = distinct !DILexicalBlock(scope: !794, file: !1, line: 170, column: 9)
!810 = !DILocation(line: 170, column: 16, scope: !809)
!811 = !DILocation(line: 170, column: 9, scope: !794)
!812 = !DILocation(line: 171, column: 7, scope: !809)
!813 = !DILocation(line: 172, column: 40, scope: !794)
!814 = !DILocation(line: 172, column: 55, scope: !794)
!815 = !DILocation(line: 172, column: 57, scope: !794)
!816 = !DILocation(line: 172, column: 72, scope: !794)
!817 = !DILocation(line: 173, column: 9, scope: !794)
!818 = !DILocation(line: 172, column: 12, scope: !794)
!819 = !DILocation(line: 172, column: 11, scope: !794)
!820 = !DILocation(line: 174, column: 9, scope: !821)
!821 = distinct !DILexicalBlock(scope: !794, file: !1, line: 174, column: 9)
!822 = !DILocation(line: 174, column: 16, scope: !821)
!823 = !DILocation(line: 174, column: 9, scope: !794)
!824 = !DILocation(line: 176, column: 15, scope: !825)
!825 = distinct !DILexicalBlock(scope: !821, file: !1, line: 175, column: 7)
!826 = !DILocation(line: 177, column: 9, scope: !825)
!827 = !DILocation(line: 179, column: 10, scope: !794)
!828 = !DILocation(line: 179, column: 9, scope: !794)
!829 = !DILocation(line: 180, column: 11, scope: !830)
!830 = distinct !DILexicalBlock(scope: !794, file: !1, line: 180, column: 9)
!831 = !DILocation(line: 180, column: 19, scope: !830)
!832 = !DILocation(line: 180, column: 33, scope: !830)
!833 = !DILocation(line: 180, column: 39, scope: !830)
!834 = !DILocation(line: 180, column: 43, scope: !830)
!835 = !DILocation(line: 180, column: 48, scope: !830)
!836 = !DILocation(line: 180, column: 9, scope: !794)
!837 = !DILocation(line: 182, column: 44, scope: !838)
!838 = distinct !DILexicalBlock(scope: !830, file: !1, line: 181, column: 7)
!839 = !DILocation(line: 182, column: 49, scope: !838)
!840 = !DILocation(line: 182, column: 20, scope: !838)
!841 = !DILocation(line: 182, column: 19, scope: !838)
!842 = !DILocation(line: 183, column: 37, scope: !838)
!843 = !DILocation(line: 183, column: 50, scope: !838)
!844 = !DILocation(line: 183, column: 52, scope: !838)
!845 = !DILocation(line: 183, column: 58, scope: !838)
!846 = !DILocation(line: 183, column: 68, scope: !838)
!847 = !DILocation(line: 183, column: 11, scope: !838)
!848 = !DILocation(line: 183, column: 10, scope: !838)
!849 = !DILocation(line: 184, column: 13, scope: !850)
!850 = distinct !DILexicalBlock(scope: !838, file: !1, line: 184, column: 13)
!851 = !DILocation(line: 184, column: 15, scope: !850)
!852 = !DILocation(line: 184, column: 13, scope: !838)
!853 = !DILocation(line: 185, column: 11, scope: !850)
!854 = !DILocation(line: 186, column: 11, scope: !838)
!855 = !DILocation(line: 186, column: 10, scope: !838)
!856 = !DILocation(line: 187, column: 15, scope: !857)
!857 = distinct !DILexicalBlock(scope: !838, file: !1, line: 187, column: 9)
!858 = !DILocation(line: 187, column: 14, scope: !857)
!859 = !DILocation(line: 187, column: 19, scope: !860)
!860 = distinct !DILexicalBlock(scope: !857, file: !1, line: 187, column: 9)
!861 = !DILocation(line: 187, column: 33, scope: !860)
!862 = !DILocation(line: 187, column: 48, scope: !860)
!863 = !DILocation(line: 187, column: 21, scope: !860)
!864 = !DILocation(line: 187, column: 9, scope: !857)
!865 = !DILocation(line: 189, column: 11, scope: !866)
!866 = distinct !DILexicalBlock(scope: !860, file: !1, line: 188, column: 9)
!867 = !DILocation(line: 190, column: 12, scope: !866)
!868 = !DILocation(line: 191, column: 12, scope: !866)
!869 = !DILocation(line: 192, column: 9, scope: !866)
!870 = !DILocation(line: 187, column: 58, scope: !860)
!871 = !DILocation(line: 187, column: 9, scope: !860)
!872 = distinct !{!872, !864, !873}
!873 = !DILocation(line: 192, column: 9, scope: !857)
!874 = !DILocation(line: 193, column: 37, scope: !838)
!875 = !DILocation(line: 193, column: 20, scope: !838)
!876 = !DILocation(line: 193, column: 19, scope: !838)
!877 = !DILocation(line: 194, column: 33, scope: !838)
!878 = !DILocation(line: 194, column: 14, scope: !838)
!879 = !DILocation(line: 194, column: 13, scope: !838)
!880 = !DILocation(line: 195, column: 7, scope: !838)
!881 = !DILocation(line: 196, column: 11, scope: !882)
!882 = distinct !DILexicalBlock(scope: !794, file: !1, line: 196, column: 9)
!883 = !DILocation(line: 196, column: 19, scope: !882)
!884 = !DILocation(line: 196, column: 35, scope: !882)
!885 = !DILocation(line: 196, column: 41, scope: !882)
!886 = !DILocation(line: 196, column: 45, scope: !882)
!887 = !DILocation(line: 196, column: 50, scope: !882)
!888 = !DILocation(line: 196, column: 9, scope: !794)
!889 = !DILocation(line: 198, column: 44, scope: !890)
!890 = distinct !DILexicalBlock(scope: !882, file: !1, line: 197, column: 7)
!891 = !DILocation(line: 198, column: 49, scope: !890)
!892 = !DILocation(line: 198, column: 20, scope: !890)
!893 = !DILocation(line: 198, column: 19, scope: !890)
!894 = !DILocation(line: 199, column: 37, scope: !890)
!895 = !DILocation(line: 199, column: 50, scope: !890)
!896 = !DILocation(line: 199, column: 52, scope: !890)
!897 = !DILocation(line: 199, column: 58, scope: !890)
!898 = !DILocation(line: 199, column: 68, scope: !890)
!899 = !DILocation(line: 199, column: 11, scope: !890)
!900 = !DILocation(line: 199, column: 10, scope: !890)
!901 = !DILocation(line: 200, column: 13, scope: !902)
!902 = distinct !DILexicalBlock(scope: !890, file: !1, line: 200, column: 13)
!903 = !DILocation(line: 200, column: 15, scope: !902)
!904 = !DILocation(line: 200, column: 13, scope: !890)
!905 = !DILocation(line: 201, column: 11, scope: !902)
!906 = !DILocation(line: 202, column: 11, scope: !890)
!907 = !DILocation(line: 202, column: 10, scope: !890)
!908 = !DILocation(line: 203, column: 15, scope: !909)
!909 = distinct !DILexicalBlock(scope: !890, file: !1, line: 203, column: 9)
!910 = !DILocation(line: 203, column: 14, scope: !909)
!911 = !DILocation(line: 203, column: 19, scope: !912)
!912 = distinct !DILexicalBlock(scope: !909, file: !1, line: 203, column: 9)
!913 = !DILocation(line: 203, column: 33, scope: !912)
!914 = !DILocation(line: 203, column: 48, scope: !912)
!915 = !DILocation(line: 203, column: 21, scope: !912)
!916 = !DILocation(line: 203, column: 9, scope: !909)
!917 = !DILocation(line: 205, column: 11, scope: !918)
!918 = distinct !DILexicalBlock(scope: !912, file: !1, line: 204, column: 9)
!919 = !DILocation(line: 206, column: 12, scope: !918)
!920 = !DILocation(line: 207, column: 12, scope: !918)
!921 = !DILocation(line: 208, column: 9, scope: !918)
!922 = !DILocation(line: 203, column: 58, scope: !912)
!923 = !DILocation(line: 203, column: 9, scope: !912)
!924 = distinct !{!924, !916, !925}
!925 = !DILocation(line: 208, column: 9, scope: !909)
!926 = !DILocation(line: 209, column: 37, scope: !890)
!927 = !DILocation(line: 209, column: 20, scope: !890)
!928 = !DILocation(line: 209, column: 19, scope: !890)
!929 = !DILocation(line: 210, column: 33, scope: !890)
!930 = !DILocation(line: 210, column: 14, scope: !890)
!931 = !DILocation(line: 210, column: 13, scope: !890)
!932 = !DILocation(line: 211, column: 7, scope: !890)
!933 = !DILocation(line: 212, column: 11, scope: !934)
!934 = distinct !DILexicalBlock(scope: !794, file: !1, line: 212, column: 9)
!935 = !DILocation(line: 212, column: 19, scope: !934)
!936 = !DILocation(line: 212, column: 34, scope: !934)
!937 = !DILocation(line: 212, column: 40, scope: !934)
!938 = !DILocation(line: 212, column: 44, scope: !934)
!939 = !DILocation(line: 212, column: 49, scope: !934)
!940 = !DILocation(line: 212, column: 9, scope: !794)
!941 = !DILocation(line: 214, column: 44, scope: !942)
!942 = distinct !DILexicalBlock(scope: !934, file: !1, line: 213, column: 7)
!943 = !DILocation(line: 214, column: 49, scope: !942)
!944 = !DILocation(line: 214, column: 20, scope: !942)
!945 = !DILocation(line: 214, column: 19, scope: !942)
!946 = !DILocation(line: 215, column: 37, scope: !942)
!947 = !DILocation(line: 215, column: 50, scope: !942)
!948 = !DILocation(line: 215, column: 52, scope: !942)
!949 = !DILocation(line: 215, column: 58, scope: !942)
!950 = !DILocation(line: 215, column: 68, scope: !942)
!951 = !DILocation(line: 215, column: 11, scope: !942)
!952 = !DILocation(line: 215, column: 10, scope: !942)
!953 = !DILocation(line: 216, column: 13, scope: !954)
!954 = distinct !DILexicalBlock(scope: !942, file: !1, line: 216, column: 13)
!955 = !DILocation(line: 216, column: 15, scope: !954)
!956 = !DILocation(line: 216, column: 13, scope: !942)
!957 = !DILocation(line: 217, column: 11, scope: !954)
!958 = !DILocation(line: 218, column: 11, scope: !942)
!959 = !DILocation(line: 218, column: 10, scope: !942)
!960 = !DILocation(line: 219, column: 15, scope: !961)
!961 = distinct !DILexicalBlock(scope: !942, file: !1, line: 219, column: 9)
!962 = !DILocation(line: 219, column: 14, scope: !961)
!963 = !DILocation(line: 219, column: 19, scope: !964)
!964 = distinct !DILexicalBlock(scope: !961, file: !1, line: 219, column: 9)
!965 = !DILocation(line: 219, column: 33, scope: !964)
!966 = !DILocation(line: 219, column: 48, scope: !964)
!967 = !DILocation(line: 219, column: 21, scope: !964)
!968 = !DILocation(line: 219, column: 9, scope: !961)
!969 = !DILocation(line: 221, column: 11, scope: !970)
!970 = distinct !DILexicalBlock(scope: !964, file: !1, line: 220, column: 9)
!971 = !DILocation(line: 222, column: 12, scope: !970)
!972 = !DILocation(line: 223, column: 12, scope: !970)
!973 = !DILocation(line: 224, column: 9, scope: !970)
!974 = !DILocation(line: 219, column: 58, scope: !964)
!975 = !DILocation(line: 219, column: 9, scope: !964)
!976 = distinct !{!976, !968, !977}
!977 = !DILocation(line: 224, column: 9, scope: !961)
!978 = !DILocation(line: 225, column: 37, scope: !942)
!979 = !DILocation(line: 225, column: 20, scope: !942)
!980 = !DILocation(line: 225, column: 19, scope: !942)
!981 = !DILocation(line: 226, column: 33, scope: !942)
!982 = !DILocation(line: 226, column: 14, scope: !942)
!983 = !DILocation(line: 226, column: 13, scope: !942)
!984 = !DILocation(line: 227, column: 7, scope: !942)
!985 = !DILocation(line: 228, column: 11, scope: !986)
!986 = distinct !DILexicalBlock(scope: !794, file: !1, line: 228, column: 9)
!987 = !DILocation(line: 228, column: 19, scope: !986)
!988 = !DILocation(line: 228, column: 37, scope: !986)
!989 = !DILocation(line: 228, column: 43, scope: !986)
!990 = !DILocation(line: 228, column: 47, scope: !986)
!991 = !DILocation(line: 228, column: 52, scope: !986)
!992 = !DILocation(line: 228, column: 9, scope: !794)
!993 = !DILocation(line: 230, column: 44, scope: !994)
!994 = distinct !DILexicalBlock(scope: !986, file: !1, line: 229, column: 7)
!995 = !DILocation(line: 230, column: 49, scope: !994)
!996 = !DILocation(line: 230, column: 20, scope: !994)
!997 = !DILocation(line: 230, column: 19, scope: !994)
!998 = !DILocation(line: 231, column: 37, scope: !994)
!999 = !DILocation(line: 231, column: 50, scope: !994)
!1000 = !DILocation(line: 231, column: 52, scope: !994)
!1001 = !DILocation(line: 231, column: 58, scope: !994)
!1002 = !DILocation(line: 231, column: 68, scope: !994)
!1003 = !DILocation(line: 231, column: 11, scope: !994)
!1004 = !DILocation(line: 231, column: 10, scope: !994)
!1005 = !DILocation(line: 232, column: 13, scope: !1006)
!1006 = distinct !DILexicalBlock(scope: !994, file: !1, line: 232, column: 13)
!1007 = !DILocation(line: 232, column: 15, scope: !1006)
!1008 = !DILocation(line: 232, column: 13, scope: !994)
!1009 = !DILocation(line: 233, column: 11, scope: !1006)
!1010 = !DILocation(line: 234, column: 11, scope: !994)
!1011 = !DILocation(line: 234, column: 10, scope: !994)
!1012 = !DILocation(line: 235, column: 15, scope: !1013)
!1013 = distinct !DILexicalBlock(scope: !994, file: !1, line: 235, column: 9)
!1014 = !DILocation(line: 235, column: 14, scope: !1013)
!1015 = !DILocation(line: 235, column: 19, scope: !1016)
!1016 = distinct !DILexicalBlock(scope: !1013, file: !1, line: 235, column: 9)
!1017 = !DILocation(line: 235, column: 33, scope: !1016)
!1018 = !DILocation(line: 235, column: 48, scope: !1016)
!1019 = !DILocation(line: 235, column: 21, scope: !1016)
!1020 = !DILocation(line: 235, column: 9, scope: !1013)
!1021 = !DILocation(line: 237, column: 11, scope: !1022)
!1022 = distinct !DILexicalBlock(scope: !1016, file: !1, line: 236, column: 9)
!1023 = !DILocation(line: 238, column: 12, scope: !1022)
!1024 = !DILocation(line: 239, column: 12, scope: !1022)
!1025 = !DILocation(line: 240, column: 9, scope: !1022)
!1026 = !DILocation(line: 235, column: 58, scope: !1016)
!1027 = !DILocation(line: 235, column: 9, scope: !1016)
!1028 = distinct !{!1028, !1020, !1029}
!1029 = !DILocation(line: 240, column: 9, scope: !1013)
!1030 = !DILocation(line: 241, column: 37, scope: !994)
!1031 = !DILocation(line: 241, column: 20, scope: !994)
!1032 = !DILocation(line: 241, column: 19, scope: !994)
!1033 = !DILocation(line: 242, column: 33, scope: !994)
!1034 = !DILocation(line: 242, column: 14, scope: !994)
!1035 = !DILocation(line: 242, column: 13, scope: !994)
!1036 = !DILocation(line: 243, column: 7, scope: !994)
!1037 = !DILocation(line: 244, column: 11, scope: !1038)
!1038 = distinct !DILexicalBlock(scope: !794, file: !1, line: 244, column: 9)
!1039 = !DILocation(line: 244, column: 19, scope: !1038)
!1040 = !DILocation(line: 244, column: 35, scope: !1038)
!1041 = !DILocation(line: 244, column: 41, scope: !1038)
!1042 = !DILocation(line: 245, column: 10, scope: !1038)
!1043 = !DILocation(line: 245, column: 17, scope: !1038)
!1044 = !DILocation(line: 245, column: 28, scope: !1038)
!1045 = !DILocation(line: 245, column: 47, scope: !1038)
!1046 = !DILocation(line: 245, column: 51, scope: !1038)
!1047 = !DILocation(line: 245, column: 56, scope: !1038)
!1048 = !DILocation(line: 244, column: 9, scope: !794)
!1049 = !DILocalVariable(name: "indexes", scope: !1050, file: !1, line: 248, type: !655)
!1050 = distinct !DILexicalBlock(scope: !1038, file: !1, line: 246, column: 7)
!1051 = !DILocation(line: 248, column: 12, scope: !1050)
!1052 = !DILocation(line: 250, column: 44, scope: !1050)
!1053 = !DILocation(line: 250, column: 49, scope: !1050)
!1054 = !DILocation(line: 250, column: 20, scope: !1050)
!1055 = !DILocation(line: 250, column: 19, scope: !1050)
!1056 = !DILocation(line: 251, column: 37, scope: !1050)
!1057 = !DILocation(line: 251, column: 50, scope: !1050)
!1058 = !DILocation(line: 251, column: 52, scope: !1050)
!1059 = !DILocation(line: 251, column: 58, scope: !1050)
!1060 = !DILocation(line: 251, column: 68, scope: !1050)
!1061 = !DILocation(line: 251, column: 11, scope: !1050)
!1062 = !DILocation(line: 251, column: 10, scope: !1050)
!1063 = !DILocation(line: 252, column: 13, scope: !1064)
!1064 = distinct !DILexicalBlock(scope: !1050, file: !1, line: 252, column: 13)
!1065 = !DILocation(line: 252, column: 15, scope: !1064)
!1066 = !DILocation(line: 252, column: 13, scope: !1050)
!1067 = !DILocation(line: 253, column: 11, scope: !1064)
!1068 = !DILocation(line: 254, column: 49, scope: !1050)
!1069 = !DILocation(line: 254, column: 17, scope: !1050)
!1070 = !DILocation(line: 254, column: 16, scope: !1050)
!1071 = !DILocation(line: 255, column: 15, scope: !1072)
!1072 = distinct !DILexicalBlock(scope: !1050, file: !1, line: 255, column: 9)
!1073 = !DILocation(line: 255, column: 14, scope: !1072)
!1074 = !DILocation(line: 255, column: 19, scope: !1075)
!1075 = distinct !DILexicalBlock(scope: !1072, file: !1, line: 255, column: 9)
!1076 = !DILocation(line: 255, column: 33, scope: !1075)
!1077 = !DILocation(line: 255, column: 48, scope: !1075)
!1078 = !DILocation(line: 255, column: 21, scope: !1075)
!1079 = !DILocation(line: 255, column: 9, scope: !1072)
!1080 = !DILocation(line: 257, column: 11, scope: !1081)
!1081 = distinct !DILexicalBlock(scope: !1082, file: !1, line: 257, column: 11)
!1082 = distinct !DILexicalBlock(scope: !1083, file: !1, line: 257, column: 11)
!1083 = distinct !DILexicalBlock(scope: !1075, file: !1, line: 256, column: 9)
!1084 = !DILocation(line: 257, column: 11, scope: !1082)
!1085 = !DILocation(line: 258, column: 12, scope: !1083)
!1086 = !DILocation(line: 259, column: 9, scope: !1083)
!1087 = !DILocation(line: 255, column: 58, scope: !1075)
!1088 = !DILocation(line: 255, column: 9, scope: !1075)
!1089 = distinct !{!1089, !1079, !1090}
!1090 = !DILocation(line: 259, column: 9, scope: !1072)
!1091 = !DILocation(line: 260, column: 37, scope: !1050)
!1092 = !DILocation(line: 260, column: 20, scope: !1050)
!1093 = !DILocation(line: 260, column: 19, scope: !1050)
!1094 = !DILocation(line: 261, column: 33, scope: !1050)
!1095 = !DILocation(line: 261, column: 14, scope: !1050)
!1096 = !DILocation(line: 261, column: 13, scope: !1050)
!1097 = !DILocation(line: 262, column: 7, scope: !1050)
!1098 = !DILocation(line: 263, column: 38, scope: !1099)
!1099 = distinct !DILexicalBlock(scope: !794, file: !1, line: 263, column: 9)
!1100 = !DILocation(line: 263, column: 51, scope: !1099)
!1101 = !DILocation(line: 263, column: 9, scope: !1099)
!1102 = !DILocation(line: 263, column: 62, scope: !1099)
!1103 = !DILocation(line: 263, column: 9, scope: !794)
!1104 = !DILocation(line: 264, column: 13, scope: !1099)
!1105 = !DILocation(line: 264, column: 7, scope: !1099)
!1106 = !DILocation(line: 265, column: 9, scope: !1107)
!1107 = distinct !DILexicalBlock(scope: !794, file: !1, line: 265, column: 9)
!1108 = !DILocation(line: 265, column: 16, scope: !1107)
!1109 = !DILocation(line: 265, column: 33, scope: !1107)
!1110 = !DILocation(line: 265, column: 9, scope: !794)
!1111 = !DILocalVariable(name: "proceed", scope: !1112, file: !1, line: 268, type: !448)
!1112 = distinct !DILexicalBlock(scope: !1107, file: !1, line: 266, column: 7)
!1113 = !DILocation(line: 268, column: 11, scope: !1112)
!1114 = !DILocation(line: 270, column: 34, scope: !1112)
!1115 = !DILocation(line: 270, column: 64, scope: !1112)
!1116 = !DILocation(line: 271, column: 11, scope: !1112)
!1117 = !DILocation(line: 271, column: 26, scope: !1112)
!1118 = !DILocation(line: 270, column: 17, scope: !1112)
!1119 = !DILocation(line: 270, column: 16, scope: !1112)
!1120 = !DILocation(line: 272, column: 13, scope: !1121)
!1121 = distinct !DILexicalBlock(scope: !1112, file: !1, line: 272, column: 13)
!1122 = !DILocation(line: 272, column: 21, scope: !1121)
!1123 = !DILocation(line: 272, column: 13, scope: !1112)
!1124 = !DILocation(line: 273, column: 17, scope: !1121)
!1125 = !DILocation(line: 273, column: 11, scope: !1121)
!1126 = !DILocation(line: 274, column: 7, scope: !1112)
!1127 = !DILocation(line: 275, column: 3, scope: !794)
!1128 = !DILocation(line: 150, column: 49, scope: !788)
!1129 = !DILocation(line: 150, column: 3, scope: !788)
!1130 = distinct !{!1130, !792, !1131}
!1131 = !DILocation(line: 275, column: 3, scope: !785)
!1132 = !DILocation(line: 276, column: 33, scope: !665)
!1133 = !DILocation(line: 276, column: 16, scope: !665)
!1134 = !DILocation(line: 276, column: 15, scope: !665)
!1135 = !DILocation(line: 277, column: 24, scope: !1136)
!1136 = distinct !DILexicalBlock(scope: !665, file: !1, line: 277, column: 7)
!1137 = !DILocation(line: 277, column: 39, scope: !1136)
!1138 = !DILocation(line: 277, column: 7, scope: !1136)
!1139 = !DILocation(line: 277, column: 51, scope: !1136)
!1140 = !DILocation(line: 277, column: 7, scope: !665)
!1141 = !DILocation(line: 278, column: 37, scope: !1136)
!1142 = !DILocation(line: 278, column: 12, scope: !1136)
!1143 = !DILocation(line: 278, column: 5, scope: !1136)
!1144 = !DILocation(line: 279, column: 7, scope: !1145)
!1145 = distinct !DILexicalBlock(scope: !665, file: !1, line: 279, column: 7)
!1146 = !DILocation(line: 279, column: 14, scope: !1145)
!1147 = !DILocation(line: 279, column: 7, scope: !665)
!1148 = !DILocation(line: 280, column: 32, scope: !1145)
!1149 = !DILocation(line: 280, column: 19, scope: !1145)
!1150 = !DILocation(line: 280, column: 18, scope: !1145)
!1151 = !DILocation(line: 280, column: 5, scope: !1145)
!1152 = !DILocation(line: 281, column: 10, scope: !665)
!1153 = !DILocation(line: 281, column: 3, scope: !665)
!1154 = !DILocation(line: 282, column: 1, scope: !665)
!1155 = distinct !DISubprogram(name: "IssRGBCompatibleColorspace", scope: !1156, file: !1156, line: 109, type: !1157, scopeLine: 111, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !673)
!1156 = !DIFile(filename: "./magick/colorspace-private.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!1157 = !DISubroutineType(types: !1158)
!1158 = !{!448, !1159}
!1159 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !439)
!1160 = !DILocalVariable(name: "colorspace", arg: 1, scope: !1155, file: !1156, line: 110, type: !1159)
!1161 = !DILocation(line: 110, column: 24, scope: !1155)
!1162 = !DILocation(line: 112, column: 8, scope: !1163)
!1163 = distinct !DILexicalBlock(scope: !1155, file: !1156, line: 112, column: 7)
!1164 = !DILocation(line: 112, column: 19, scope: !1163)
!1165 = !DILocation(line: 112, column: 38, scope: !1163)
!1166 = !DILocation(line: 112, column: 42, scope: !1163)
!1167 = !DILocation(line: 112, column: 53, scope: !1163)
!1168 = !DILocation(line: 112, column: 71, scope: !1163)
!1169 = !DILocation(line: 113, column: 8, scope: !1163)
!1170 = !DILocation(line: 113, column: 19, scope: !1163)
!1171 = !DILocation(line: 113, column: 39, scope: !1163)
!1172 = !DILocation(line: 114, column: 8, scope: !1163)
!1173 = !DILocation(line: 114, column: 19, scope: !1163)
!1174 = !DILocation(line: 114, column: 45, scope: !1163)
!1175 = !DILocation(line: 115, column: 25, scope: !1163)
!1176 = !DILocation(line: 115, column: 8, scope: !1163)
!1177 = !DILocation(line: 115, column: 37, scope: !1163)
!1178 = !DILocation(line: 112, column: 7, scope: !1155)
!1179 = !DILocation(line: 116, column: 5, scope: !1163)
!1180 = !DILocation(line: 117, column: 3, scope: !1155)
!1181 = !DILocation(line: 118, column: 1, scope: !1155)
!1182 = distinct !DISubprogram(name: "ClampToQuantum", scope: !147, file: !147, line: 87, type: !1183, scopeLine: 88, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !673)
!1183 = !DISubroutineType(types: !1184)
!1184 = !{!460, !1185}
!1185 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !659)
!1186 = !DILocalVariable(name: "value", arg: 1, scope: !1182, file: !147, line: 87, type: !1185)
!1187 = !DILocation(line: 87, column: 59, scope: !1182)
!1188 = !DILocation(line: 92, column: 7, scope: !1189)
!1189 = distinct !DILexicalBlock(scope: !1182, file: !147, line: 92, column: 7)
!1190 = !DILocation(line: 92, column: 13, scope: !1189)
!1191 = !DILocation(line: 92, column: 7, scope: !1182)
!1192 = !DILocation(line: 93, column: 5, scope: !1189)
!1193 = !DILocation(line: 94, column: 7, scope: !1194)
!1194 = distinct !DILexicalBlock(scope: !1182, file: !147, line: 94, column: 7)
!1195 = !DILocation(line: 94, column: 13, scope: !1194)
!1196 = !DILocation(line: 94, column: 7, scope: !1182)
!1197 = !DILocation(line: 95, column: 5, scope: !1194)
!1198 = !DILocation(line: 96, column: 21, scope: !1182)
!1199 = !DILocation(line: 96, column: 26, scope: !1182)
!1200 = !DILocation(line: 96, column: 10, scope: !1182)
!1201 = !DILocation(line: 96, column: 3, scope: !1182)
!1202 = !DILocation(line: 98, column: 1, scope: !1182)
!1203 = distinct !DISubprogram(name: "SetImageProgress", scope: !1204, file: !1204, line: 27, type: !1205, scopeLine: 29, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !673)
!1204 = !DIFile(filename: "./magick/monitor-private.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!1205 = !DISubroutineType(types: !1206)
!1206 = !{!448, !668, !565, !567, !570}
!1207 = !DILocalVariable(name: "image", arg: 1, scope: !1203, file: !1204, line: 27, type: !668)
!1208 = !DILocation(line: 27, column: 63, scope: !1203)
!1209 = !DILocalVariable(name: "tag", arg: 2, scope: !1203, file: !1204, line: 28, type: !565)
!1210 = !DILocation(line: 28, column: 15, scope: !1203)
!1211 = !DILocalVariable(name: "offset", arg: 3, scope: !1203, file: !1204, line: 28, type: !567)
!1212 = !DILocation(line: 28, column: 42, scope: !1203)
!1213 = !DILocalVariable(name: "extent", arg: 4, scope: !1203, file: !1204, line: 28, type: !570)
!1214 = !DILocation(line: 28, column: 70, scope: !1203)
!1215 = !DILocalVariable(name: "message", scope: !1203, file: !1204, line: 31, type: !585)
!1216 = !DILocation(line: 31, column: 5, scope: !1203)
!1217 = !DILocation(line: 33, column: 7, scope: !1218)
!1218 = distinct !DILexicalBlock(scope: !1203, file: !1204, line: 33, column: 7)
!1219 = !DILocation(line: 33, column: 14, scope: !1218)
!1220 = !DILocation(line: 33, column: 31, scope: !1218)
!1221 = !DILocation(line: 33, column: 7, scope: !1203)
!1222 = !DILocation(line: 34, column: 5, scope: !1218)
!1223 = !DILocation(line: 35, column: 29, scope: !1203)
!1224 = !DILocation(line: 35, column: 59, scope: !1203)
!1225 = !DILocation(line: 35, column: 63, scope: !1203)
!1226 = !DILocation(line: 35, column: 70, scope: !1203)
!1227 = !DILocation(line: 35, column: 10, scope: !1203)
!1228 = !DILocation(line: 36, column: 10, scope: !1203)
!1229 = !DILocation(line: 36, column: 17, scope: !1203)
!1230 = !DILocation(line: 36, column: 34, scope: !1203)
!1231 = !DILocation(line: 36, column: 42, scope: !1203)
!1232 = !DILocation(line: 36, column: 49, scope: !1203)
!1233 = !DILocation(line: 36, column: 56, scope: !1203)
!1234 = !DILocation(line: 36, column: 63, scope: !1203)
!1235 = !DILocation(line: 36, column: 3, scope: !1203)
!1236 = !DILocation(line: 37, column: 1, scope: !1203)
!1237 = distinct !DISubprogram(name: "IsGrayColorspace", scope: !1156, file: !1156, line: 85, type: !1157, scopeLine: 87, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !673)
!1238 = !DILocalVariable(name: "colorspace", arg: 1, scope: !1237, file: !1156, line: 86, type: !1159)
!1239 = !DILocation(line: 86, column: 24, scope: !1237)
!1240 = !DILocation(line: 88, column: 8, scope: !1241)
!1241 = distinct !DILexicalBlock(scope: !1237, file: !1156, line: 88, column: 7)
!1242 = !DILocation(line: 88, column: 19, scope: !1241)
!1243 = !DILocation(line: 88, column: 38, scope: !1241)
!1244 = !DILocation(line: 88, column: 42, scope: !1241)
!1245 = !DILocation(line: 88, column: 53, scope: !1241)
!1246 = !DILocation(line: 88, column: 78, scope: !1241)
!1247 = !DILocation(line: 89, column: 8, scope: !1241)
!1248 = !DILocation(line: 89, column: 19, scope: !1241)
!1249 = !DILocation(line: 88, column: 7, scope: !1237)
!1250 = !DILocation(line: 90, column: 5, scope: !1241)
!1251 = !DILocation(line: 91, column: 3, scope: !1237)
!1252 = !DILocation(line: 92, column: 1, scope: !1237)
!1253 = distinct !DISubprogram(name: "GetImageAlphaChannel", scope: !1, file: !1, line: 308, type: !1254, scopeLine: 309, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !673)
!1254 = !DISubroutineType(types: !1255)
!1255 = !{!448, !668}
!1256 = !DILocalVariable(name: "image", arg: 1, scope: !1253, file: !1, line: 308, type: !668)
!1257 = !DILocation(line: 308, column: 66, scope: !1253)
!1258 = !DILocation(line: 311, column: 7, scope: !1259)
!1259 = distinct !DILexicalBlock(scope: !1253, file: !1, line: 311, column: 7)
!1260 = !DILocation(line: 311, column: 14, scope: !1259)
!1261 = !DILocation(line: 311, column: 20, scope: !1259)
!1262 = !DILocation(line: 311, column: 7, scope: !1253)
!1263 = !DILocation(line: 312, column: 12, scope: !1259)
!1264 = !DILocation(line: 312, column: 5, scope: !1259)
!1265 = !DILocation(line: 314, column: 10, scope: !1253)
!1266 = !DILocation(line: 314, column: 17, scope: !1253)
!1267 = !DILocation(line: 314, column: 3, scope: !1253)
!1268 = distinct !DISubprogram(name: "SeparateImage", scope: !1, file: !1, line: 347, type: !666, scopeLine: 349, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !673)
!1269 = !DILocalVariable(name: "image", arg: 1, scope: !1268, file: !1, line: 347, type: !668)
!1270 = !DILocation(line: 347, column: 48, scope: !1268)
!1271 = !DILocalVariable(name: "channel", arg: 2, scope: !1268, file: !1, line: 347, type: !670)
!1272 = !DILocation(line: 347, column: 72, scope: !1268)
!1273 = !DILocalVariable(name: "exception", arg: 3, scope: !1268, file: !1, line: 348, type: !672)
!1274 = !DILocation(line: 348, column: 18, scope: !1268)
!1275 = !DILocalVariable(name: "separate_image", scope: !1268, file: !1, line: 351, type: !432)
!1276 = !DILocation(line: 351, column: 6, scope: !1268)
!1277 = !DILocalVariable(name: "status", scope: !1268, file: !1, line: 354, type: !448)
!1278 = !DILocation(line: 354, column: 5, scope: !1268)
!1279 = !DILocation(line: 361, column: 7, scope: !1280)
!1280 = distinct !DILexicalBlock(scope: !1268, file: !1, line: 361, column: 7)
!1281 = !DILocation(line: 361, column: 14, scope: !1280)
!1282 = !DILocation(line: 361, column: 20, scope: !1280)
!1283 = !DILocation(line: 361, column: 7, scope: !1268)
!1284 = !DILocation(line: 362, column: 61, scope: !1280)
!1285 = !DILocation(line: 362, column: 68, scope: !1280)
!1286 = !DILocation(line: 362, column: 12, scope: !1280)
!1287 = !DILocation(line: 362, column: 5, scope: !1280)
!1288 = !DILocation(line: 365, column: 29, scope: !1268)
!1289 = !DILocation(line: 365, column: 50, scope: !1268)
!1290 = !DILocation(line: 365, column: 18, scope: !1268)
!1291 = !DILocation(line: 365, column: 17, scope: !1268)
!1292 = !DILocation(line: 366, column: 7, scope: !1293)
!1293 = distinct !DILexicalBlock(scope: !1268, file: !1, line: 366, column: 7)
!1294 = !DILocation(line: 366, column: 22, scope: !1293)
!1295 = !DILocation(line: 366, column: 7, scope: !1268)
!1296 = !DILocation(line: 367, column: 5, scope: !1293)
!1297 = !DILocation(line: 368, column: 31, scope: !1268)
!1298 = !DILocation(line: 368, column: 46, scope: !1268)
!1299 = !DILocation(line: 368, column: 10, scope: !1268)
!1300 = !DILocation(line: 368, column: 9, scope: !1268)
!1301 = !DILocation(line: 369, column: 7, scope: !1302)
!1302 = distinct !DILexicalBlock(scope: !1268, file: !1, line: 369, column: 7)
!1303 = !DILocation(line: 369, column: 14, scope: !1302)
!1304 = !DILocation(line: 369, column: 7, scope: !1268)
!1305 = !DILocation(line: 370, column: 33, scope: !1302)
!1306 = !DILocation(line: 370, column: 20, scope: !1302)
!1307 = !DILocation(line: 370, column: 19, scope: !1302)
!1308 = !DILocation(line: 370, column: 5, scope: !1302)
!1309 = !DILocation(line: 371, column: 10, scope: !1268)
!1310 = !DILocation(line: 371, column: 3, scope: !1268)
!1311 = !DILocation(line: 372, column: 1, scope: !1268)
!1312 = distinct !DISubprogram(name: "SeparateImageChannel", scope: !1, file: !1, line: 374, type: !1313, scopeLine: 376, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !673)
!1313 = !DISubroutineType(types: !1314)
!1314 = !{!448, !432, !670}
!1315 = !DILocalVariable(name: "image", arg: 1, scope: !1312, file: !1, line: 374, type: !432)
!1316 = !DILocation(line: 374, column: 60, scope: !1312)
!1317 = !DILocalVariable(name: "channel", arg: 2, scope: !1312, file: !1, line: 375, type: !670)
!1318 = !DILocation(line: 375, column: 21, scope: !1312)
!1319 = !DILocalVariable(name: "image_view", scope: !1312, file: !1, line: 380, type: !681)
!1320 = !DILocation(line: 380, column: 6, scope: !1312)
!1321 = !DILocalVariable(name: "exception", scope: !1312, file: !1, line: 383, type: !672)
!1322 = !DILocation(line: 383, column: 6, scope: !1312)
!1323 = !DILocalVariable(name: "status", scope: !1312, file: !1, line: 386, type: !448)
!1324 = !DILocation(line: 386, column: 5, scope: !1312)
!1325 = !DILocalVariable(name: "progress", scope: !1312, file: !1, line: 389, type: !568)
!1326 = !DILocation(line: 389, column: 5, scope: !1312)
!1327 = !DILocalVariable(name: "y", scope: !1312, file: !1, line: 392, type: !496)
!1328 = !DILocation(line: 392, column: 5, scope: !1312)
!1329 = !DILocation(line: 396, column: 7, scope: !1330)
!1330 = distinct !DILexicalBlock(scope: !1312, file: !1, line: 396, column: 7)
!1331 = !DILocation(line: 396, column: 14, scope: !1330)
!1332 = !DILocation(line: 396, column: 20, scope: !1330)
!1333 = !DILocation(line: 396, column: 7, scope: !1312)
!1334 = !DILocation(line: 397, column: 61, scope: !1330)
!1335 = !DILocation(line: 397, column: 68, scope: !1330)
!1336 = !DILocation(line: 397, column: 12, scope: !1330)
!1337 = !DILocation(line: 397, column: 5, scope: !1330)
!1338 = !DILocation(line: 398, column: 28, scope: !1339)
!1339 = distinct !DILexicalBlock(scope: !1312, file: !1, line: 398, column: 7)
!1340 = !DILocation(line: 398, column: 7, scope: !1339)
!1341 = !DILocation(line: 398, column: 47, scope: !1339)
!1342 = !DILocation(line: 398, column: 7, scope: !1312)
!1343 = !DILocation(line: 399, column: 5, scope: !1339)
!1344 = !DILocation(line: 400, column: 7, scope: !1345)
!1345 = distinct !DILexicalBlock(scope: !1312, file: !1, line: 400, column: 7)
!1346 = !DILocation(line: 400, column: 15, scope: !1345)
!1347 = !DILocation(line: 400, column: 7, scope: !1312)
!1348 = !DILocation(line: 401, column: 5, scope: !1345)
!1349 = !DILocation(line: 401, column: 12, scope: !1345)
!1350 = !DILocation(line: 401, column: 17, scope: !1345)
!1351 = !DILocation(line: 405, column: 9, scope: !1312)
!1352 = !DILocation(line: 406, column: 11, scope: !1312)
!1353 = !DILocation(line: 407, column: 15, scope: !1312)
!1354 = !DILocation(line: 407, column: 22, scope: !1312)
!1355 = !DILocation(line: 407, column: 12, scope: !1312)
!1356 = !DILocation(line: 408, column: 40, scope: !1312)
!1357 = !DILocation(line: 408, column: 46, scope: !1312)
!1358 = !DILocation(line: 408, column: 14, scope: !1312)
!1359 = !DILocation(line: 408, column: 13, scope: !1312)
!1360 = !DILocation(line: 413, column: 9, scope: !1361)
!1361 = distinct !DILexicalBlock(scope: !1312, file: !1, line: 413, column: 3)
!1362 = !DILocation(line: 413, column: 8, scope: !1361)
!1363 = !DILocation(line: 413, column: 13, scope: !1364)
!1364 = distinct !DILexicalBlock(scope: !1361, file: !1, line: 413, column: 3)
!1365 = !DILocation(line: 413, column: 27, scope: !1364)
!1366 = !DILocation(line: 413, column: 34, scope: !1364)
!1367 = !DILocation(line: 413, column: 15, scope: !1364)
!1368 = !DILocation(line: 413, column: 3, scope: !1361)
!1369 = !DILocalVariable(name: "indexes", scope: !1370, file: !1, line: 416, type: !1371)
!1370 = distinct !DILexicalBlock(scope: !1364, file: !1, line: 414, column: 3)
!1371 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !655)
!1372 = !DILocation(line: 416, column: 17, scope: !1370)
!1373 = !DILocalVariable(name: "q", scope: !1370, file: !1, line: 419, type: !804)
!1374 = !DILocation(line: 419, column: 17, scope: !1370)
!1375 = !DILocalVariable(name: "x", scope: !1370, file: !1, line: 422, type: !496)
!1376 = !DILocation(line: 422, column: 7, scope: !1370)
!1377 = !DILocation(line: 424, column: 9, scope: !1378)
!1378 = distinct !DILexicalBlock(scope: !1370, file: !1, line: 424, column: 9)
!1379 = !DILocation(line: 424, column: 16, scope: !1378)
!1380 = !DILocation(line: 424, column: 9, scope: !1370)
!1381 = !DILocation(line: 425, column: 7, scope: !1378)
!1382 = !DILocation(line: 426, column: 35, scope: !1370)
!1383 = !DILocation(line: 426, column: 48, scope: !1370)
!1384 = !DILocation(line: 426, column: 50, scope: !1370)
!1385 = !DILocation(line: 426, column: 57, scope: !1370)
!1386 = !DILocation(line: 426, column: 67, scope: !1370)
!1387 = !DILocation(line: 426, column: 7, scope: !1370)
!1388 = !DILocation(line: 426, column: 6, scope: !1370)
!1389 = !DILocation(line: 427, column: 9, scope: !1390)
!1390 = distinct !DILexicalBlock(scope: !1370, file: !1, line: 427, column: 9)
!1391 = !DILocation(line: 427, column: 11, scope: !1390)
!1392 = !DILocation(line: 427, column: 9, scope: !1370)
!1393 = !DILocation(line: 429, column: 15, scope: !1394)
!1394 = distinct !DILexicalBlock(scope: !1390, file: !1, line: 428, column: 7)
!1395 = !DILocation(line: 430, column: 9, scope: !1394)
!1396 = !DILocation(line: 432, column: 45, scope: !1370)
!1397 = !DILocation(line: 432, column: 13, scope: !1370)
!1398 = !DILocation(line: 432, column: 12, scope: !1370)
!1399 = !DILocation(line: 433, column: 13, scope: !1370)
!1400 = !DILocation(line: 433, column: 5, scope: !1370)
!1401 = !DILocation(line: 437, column: 15, scope: !1402)
!1402 = distinct !DILexicalBlock(scope: !1403, file: !1, line: 437, column: 9)
!1403 = distinct !DILexicalBlock(scope: !1404, file: !1, line: 436, column: 7)
!1404 = distinct !DILexicalBlock(scope: !1370, file: !1, line: 434, column: 5)
!1405 = !DILocation(line: 437, column: 14, scope: !1402)
!1406 = !DILocation(line: 437, column: 19, scope: !1407)
!1407 = distinct !DILexicalBlock(scope: !1402, file: !1, line: 437, column: 9)
!1408 = !DILocation(line: 437, column: 33, scope: !1407)
!1409 = !DILocation(line: 437, column: 40, scope: !1407)
!1410 = !DILocation(line: 437, column: 21, scope: !1407)
!1411 = !DILocation(line: 437, column: 9, scope: !1402)
!1412 = !DILocation(line: 439, column: 11, scope: !1413)
!1413 = distinct !DILexicalBlock(scope: !1407, file: !1, line: 438, column: 9)
!1414 = !DILocation(line: 440, column: 11, scope: !1413)
!1415 = !DILocation(line: 441, column: 12, scope: !1413)
!1416 = !DILocation(line: 442, column: 9, scope: !1413)
!1417 = !DILocation(line: 437, column: 50, scope: !1407)
!1418 = !DILocation(line: 437, column: 9, scope: !1407)
!1419 = distinct !{!1419, !1411, !1420}
!1420 = !DILocation(line: 442, column: 9, scope: !1402)
!1421 = !DILocation(line: 443, column: 9, scope: !1403)
!1422 = !DILocation(line: 447, column: 15, scope: !1423)
!1423 = distinct !DILexicalBlock(scope: !1424, file: !1, line: 447, column: 9)
!1424 = distinct !DILexicalBlock(scope: !1404, file: !1, line: 446, column: 7)
!1425 = !DILocation(line: 447, column: 14, scope: !1423)
!1426 = !DILocation(line: 447, column: 19, scope: !1427)
!1427 = distinct !DILexicalBlock(scope: !1423, file: !1, line: 447, column: 9)
!1428 = !DILocation(line: 447, column: 33, scope: !1427)
!1429 = !DILocation(line: 447, column: 40, scope: !1427)
!1430 = !DILocation(line: 447, column: 21, scope: !1427)
!1431 = !DILocation(line: 447, column: 9, scope: !1423)
!1432 = !DILocation(line: 449, column: 11, scope: !1433)
!1433 = distinct !DILexicalBlock(scope: !1427, file: !1, line: 448, column: 9)
!1434 = !DILocation(line: 450, column: 11, scope: !1433)
!1435 = !DILocation(line: 451, column: 12, scope: !1433)
!1436 = !DILocation(line: 452, column: 9, scope: !1433)
!1437 = !DILocation(line: 447, column: 50, scope: !1427)
!1438 = !DILocation(line: 447, column: 9, scope: !1427)
!1439 = distinct !{!1439, !1431, !1440}
!1440 = !DILocation(line: 452, column: 9, scope: !1423)
!1441 = !DILocation(line: 453, column: 9, scope: !1424)
!1442 = !DILocation(line: 457, column: 15, scope: !1443)
!1443 = distinct !DILexicalBlock(scope: !1444, file: !1, line: 457, column: 9)
!1444 = distinct !DILexicalBlock(scope: !1404, file: !1, line: 456, column: 7)
!1445 = !DILocation(line: 457, column: 14, scope: !1443)
!1446 = !DILocation(line: 457, column: 19, scope: !1447)
!1447 = distinct !DILexicalBlock(scope: !1443, file: !1, line: 457, column: 9)
!1448 = !DILocation(line: 457, column: 33, scope: !1447)
!1449 = !DILocation(line: 457, column: 40, scope: !1447)
!1450 = !DILocation(line: 457, column: 21, scope: !1447)
!1451 = !DILocation(line: 457, column: 9, scope: !1443)
!1452 = !DILocation(line: 459, column: 11, scope: !1453)
!1453 = distinct !DILexicalBlock(scope: !1447, file: !1, line: 458, column: 9)
!1454 = !DILocation(line: 460, column: 11, scope: !1453)
!1455 = !DILocation(line: 461, column: 12, scope: !1453)
!1456 = !DILocation(line: 462, column: 9, scope: !1453)
!1457 = !DILocation(line: 457, column: 50, scope: !1447)
!1458 = !DILocation(line: 457, column: 9, scope: !1447)
!1459 = distinct !{!1459, !1451, !1460}
!1460 = !DILocation(line: 462, column: 9, scope: !1443)
!1461 = !DILocation(line: 463, column: 9, scope: !1444)
!1462 = !DILocation(line: 467, column: 15, scope: !1463)
!1463 = distinct !DILexicalBlock(scope: !1464, file: !1, line: 467, column: 9)
!1464 = distinct !DILexicalBlock(scope: !1404, file: !1, line: 466, column: 7)
!1465 = !DILocation(line: 467, column: 14, scope: !1463)
!1466 = !DILocation(line: 467, column: 19, scope: !1467)
!1467 = distinct !DILexicalBlock(scope: !1463, file: !1, line: 467, column: 9)
!1468 = !DILocation(line: 467, column: 33, scope: !1467)
!1469 = !DILocation(line: 467, column: 40, scope: !1467)
!1470 = !DILocation(line: 467, column: 21, scope: !1467)
!1471 = !DILocation(line: 467, column: 9, scope: !1463)
!1472 = !DILocation(line: 469, column: 11, scope: !1473)
!1473 = distinct !DILexicalBlock(scope: !1467, file: !1, line: 468, column: 9)
!1474 = !DILocation(line: 470, column: 11, scope: !1473)
!1475 = !DILocation(line: 471, column: 11, scope: !1473)
!1476 = !DILocation(line: 472, column: 12, scope: !1473)
!1477 = !DILocation(line: 473, column: 9, scope: !1473)
!1478 = !DILocation(line: 467, column: 50, scope: !1467)
!1479 = !DILocation(line: 467, column: 9, scope: !1467)
!1480 = distinct !{!1480, !1471, !1481}
!1481 = !DILocation(line: 473, column: 9, scope: !1463)
!1482 = !DILocation(line: 474, column: 9, scope: !1464)
!1483 = !DILocation(line: 478, column: 14, scope: !1484)
!1484 = distinct !DILexicalBlock(scope: !1485, file: !1, line: 478, column: 13)
!1485 = distinct !DILexicalBlock(scope: !1404, file: !1, line: 477, column: 7)
!1486 = !DILocation(line: 478, column: 21, scope: !1484)
!1487 = !DILocation(line: 478, column: 35, scope: !1484)
!1488 = !DILocation(line: 478, column: 51, scope: !1484)
!1489 = !DILocation(line: 479, column: 14, scope: !1484)
!1490 = !DILocation(line: 479, column: 21, scope: !1484)
!1491 = !DILocation(line: 479, column: 32, scope: !1484)
!1492 = !DILocation(line: 478, column: 13, scope: !1485)
!1493 = !DILocation(line: 480, column: 11, scope: !1484)
!1494 = !DILocation(line: 481, column: 15, scope: !1495)
!1495 = distinct !DILexicalBlock(scope: !1485, file: !1, line: 481, column: 9)
!1496 = !DILocation(line: 481, column: 14, scope: !1495)
!1497 = !DILocation(line: 481, column: 19, scope: !1498)
!1498 = distinct !DILexicalBlock(scope: !1495, file: !1, line: 481, column: 9)
!1499 = !DILocation(line: 481, column: 33, scope: !1498)
!1500 = !DILocation(line: 481, column: 40, scope: !1498)
!1501 = !DILocation(line: 481, column: 21, scope: !1498)
!1502 = !DILocation(line: 481, column: 9, scope: !1495)
!1503 = !DILocation(line: 483, column: 11, scope: !1504)
!1504 = distinct !DILexicalBlock(scope: !1498, file: !1, line: 482, column: 9)
!1505 = !DILocation(line: 484, column: 11, scope: !1504)
!1506 = !DILocation(line: 485, column: 11, scope: !1504)
!1507 = !DILocation(line: 486, column: 12, scope: !1504)
!1508 = !DILocation(line: 487, column: 9, scope: !1504)
!1509 = !DILocation(line: 481, column: 50, scope: !1498)
!1510 = !DILocation(line: 481, column: 9, scope: !1498)
!1511 = distinct !{!1511, !1502, !1512}
!1512 = !DILocation(line: 487, column: 9, scope: !1495)
!1513 = !DILocation(line: 488, column: 9, scope: !1485)
!1514 = !DILocation(line: 492, column: 15, scope: !1515)
!1515 = distinct !DILexicalBlock(scope: !1516, file: !1, line: 492, column: 9)
!1516 = distinct !DILexicalBlock(scope: !1404, file: !1, line: 491, column: 7)
!1517 = !DILocation(line: 492, column: 14, scope: !1515)
!1518 = !DILocation(line: 492, column: 19, scope: !1519)
!1519 = distinct !DILexicalBlock(scope: !1515, file: !1, line: 492, column: 9)
!1520 = !DILocation(line: 492, column: 33, scope: !1519)
!1521 = !DILocation(line: 492, column: 40, scope: !1519)
!1522 = !DILocation(line: 492, column: 21, scope: !1519)
!1523 = !DILocation(line: 492, column: 9, scope: !1515)
!1524 = !DILocation(line: 494, column: 11, scope: !1525)
!1525 = distinct !DILexicalBlock(scope: !1519, file: !1, line: 493, column: 9)
!1526 = !DILocation(line: 495, column: 11, scope: !1525)
!1527 = !DILocation(line: 496, column: 11, scope: !1525)
!1528 = !DILocation(line: 497, column: 12, scope: !1525)
!1529 = !DILocation(line: 498, column: 9, scope: !1525)
!1530 = !DILocation(line: 492, column: 50, scope: !1519)
!1531 = !DILocation(line: 492, column: 9, scope: !1519)
!1532 = distinct !{!1532, !1523, !1533}
!1533 = !DILocation(line: 498, column: 9, scope: !1515)
!1534 = !DILocation(line: 499, column: 9, scope: !1516)
!1535 = !DILocation(line: 503, column: 15, scope: !1536)
!1536 = distinct !DILexicalBlock(scope: !1537, file: !1, line: 503, column: 9)
!1537 = distinct !DILexicalBlock(scope: !1404, file: !1, line: 502, column: 7)
!1538 = !DILocation(line: 503, column: 14, scope: !1536)
!1539 = !DILocation(line: 503, column: 19, scope: !1540)
!1540 = distinct !DILexicalBlock(scope: !1536, file: !1, line: 503, column: 9)
!1541 = !DILocation(line: 503, column: 33, scope: !1540)
!1542 = !DILocation(line: 503, column: 40, scope: !1540)
!1543 = !DILocation(line: 503, column: 21, scope: !1540)
!1544 = !DILocation(line: 503, column: 9, scope: !1536)
!1545 = !DILocation(line: 505, column: 11, scope: !1546)
!1546 = distinct !DILexicalBlock(scope: !1540, file: !1, line: 504, column: 9)
!1547 = !DILocation(line: 506, column: 12, scope: !1546)
!1548 = !DILocation(line: 507, column: 9, scope: !1546)
!1549 = !DILocation(line: 503, column: 50, scope: !1540)
!1550 = !DILocation(line: 503, column: 9, scope: !1540)
!1551 = distinct !{!1551, !1544, !1552}
!1552 = !DILocation(line: 507, column: 9, scope: !1536)
!1553 = !DILocation(line: 508, column: 9, scope: !1537)
!1554 = !DILocation(line: 511, column: 9, scope: !1404)
!1555 = !DILocation(line: 513, column: 38, scope: !1556)
!1556 = distinct !DILexicalBlock(scope: !1370, file: !1, line: 513, column: 9)
!1557 = !DILocation(line: 513, column: 49, scope: !1556)
!1558 = !DILocation(line: 513, column: 9, scope: !1556)
!1559 = !DILocation(line: 513, column: 60, scope: !1556)
!1560 = !DILocation(line: 513, column: 9, scope: !1370)
!1561 = !DILocation(line: 514, column: 13, scope: !1556)
!1562 = !DILocation(line: 514, column: 7, scope: !1556)
!1563 = !DILocation(line: 515, column: 9, scope: !1564)
!1564 = distinct !DILexicalBlock(scope: !1370, file: !1, line: 515, column: 9)
!1565 = !DILocation(line: 515, column: 16, scope: !1564)
!1566 = !DILocation(line: 515, column: 33, scope: !1564)
!1567 = !DILocation(line: 515, column: 9, scope: !1370)
!1568 = !DILocalVariable(name: "proceed", scope: !1569, file: !1, line: 518, type: !448)
!1569 = distinct !DILexicalBlock(scope: !1564, file: !1, line: 516, column: 7)
!1570 = !DILocation(line: 518, column: 11, scope: !1569)
!1571 = !DILocation(line: 523, column: 34, scope: !1569)
!1572 = !DILocation(line: 523, column: 65, scope: !1569)
!1573 = !DILocation(line: 523, column: 68, scope: !1569)
!1574 = !DILocation(line: 523, column: 75, scope: !1569)
!1575 = !DILocation(line: 523, column: 17, scope: !1569)
!1576 = !DILocation(line: 523, column: 16, scope: !1569)
!1577 = !DILocation(line: 524, column: 13, scope: !1578)
!1578 = distinct !DILexicalBlock(scope: !1569, file: !1, line: 524, column: 13)
!1579 = !DILocation(line: 524, column: 21, scope: !1578)
!1580 = !DILocation(line: 524, column: 13, scope: !1569)
!1581 = !DILocation(line: 525, column: 17, scope: !1578)
!1582 = !DILocation(line: 525, column: 11, scope: !1578)
!1583 = !DILocation(line: 526, column: 7, scope: !1569)
!1584 = !DILocation(line: 527, column: 3, scope: !1370)
!1585 = !DILocation(line: 413, column: 41, scope: !1364)
!1586 = !DILocation(line: 413, column: 3, scope: !1364)
!1587 = distinct !{!1587, !1368, !1588}
!1588 = !DILocation(line: 527, column: 3, scope: !1361)
!1589 = !DILocation(line: 528, column: 31, scope: !1312)
!1590 = !DILocation(line: 528, column: 14, scope: !1312)
!1591 = !DILocation(line: 528, column: 13, scope: !1312)
!1592 = !DILocation(line: 529, column: 7, scope: !1593)
!1593 = distinct !DILexicalBlock(scope: !1312, file: !1, line: 529, column: 7)
!1594 = !DILocation(line: 529, column: 15, scope: !1593)
!1595 = !DILocation(line: 529, column: 7, scope: !1312)
!1596 = !DILocation(line: 530, column: 5, scope: !1593)
!1597 = !DILocation(line: 530, column: 12, scope: !1593)
!1598 = !DILocation(line: 530, column: 17, scope: !1593)
!1599 = !DILocation(line: 531, column: 29, scope: !1312)
!1600 = !DILocation(line: 531, column: 10, scope: !1312)
!1601 = !DILocation(line: 532, column: 10, scope: !1312)
!1602 = !DILocation(line: 532, column: 3, scope: !1312)
!1603 = !DILocation(line: 533, column: 1, scope: !1312)
!1604 = distinct !DISubprogram(name: "SeparateImages", scope: !1, file: !1, line: 565, type: !666, scopeLine: 567, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !673)
!1605 = !DILocalVariable(name: "image", arg: 1, scope: !1604, file: !1, line: 565, type: !668)
!1606 = !DILocation(line: 565, column: 49, scope: !1604)
!1607 = !DILocalVariable(name: "channel", arg: 2, scope: !1604, file: !1, line: 565, type: !670)
!1608 = !DILocation(line: 565, column: 73, scope: !1604)
!1609 = !DILocalVariable(name: "exception", arg: 3, scope: !1604, file: !1, line: 566, type: !672)
!1610 = !DILocation(line: 566, column: 18, scope: !1604)
!1611 = !DILocalVariable(name: "images", scope: !1604, file: !1, line: 569, type: !432)
!1612 = !DILocation(line: 569, column: 6, scope: !1604)
!1613 = !DILocalVariable(name: "separate_image", scope: !1604, file: !1, line: 570, type: !432)
!1614 = !DILocation(line: 570, column: 6, scope: !1604)
!1615 = !DILocation(line: 574, column: 7, scope: !1616)
!1616 = distinct !DILexicalBlock(scope: !1604, file: !1, line: 574, column: 7)
!1617 = !DILocation(line: 574, column: 14, scope: !1616)
!1618 = !DILocation(line: 574, column: 20, scope: !1616)
!1619 = !DILocation(line: 574, column: 7, scope: !1604)
!1620 = !DILocation(line: 575, column: 61, scope: !1616)
!1621 = !DILocation(line: 575, column: 68, scope: !1616)
!1622 = !DILocation(line: 575, column: 12, scope: !1616)
!1623 = !DILocation(line: 575, column: 5, scope: !1616)
!1624 = !DILocation(line: 576, column: 10, scope: !1604)
!1625 = !DILocation(line: 576, column: 9, scope: !1604)
!1626 = !DILocation(line: 577, column: 8, scope: !1627)
!1627 = distinct !DILexicalBlock(scope: !1604, file: !1, line: 577, column: 7)
!1628 = !DILocation(line: 577, column: 16, scope: !1627)
!1629 = !DILocation(line: 577, column: 30, scope: !1627)
!1630 = !DILocation(line: 577, column: 7, scope: !1604)
!1631 = !DILocation(line: 579, column: 33, scope: !1632)
!1632 = distinct !DILexicalBlock(scope: !1627, file: !1, line: 578, column: 5)
!1633 = !DILocation(line: 579, column: 54, scope: !1632)
!1634 = !DILocation(line: 579, column: 22, scope: !1632)
!1635 = !DILocation(line: 579, column: 21, scope: !1632)
!1636 = !DILocation(line: 580, column: 35, scope: !1632)
!1637 = !DILocation(line: 580, column: 14, scope: !1632)
!1638 = !DILocation(line: 581, column: 33, scope: !1632)
!1639 = !DILocation(line: 581, column: 7, scope: !1632)
!1640 = !DILocation(line: 582, column: 5, scope: !1632)
!1641 = !DILocation(line: 583, column: 8, scope: !1642)
!1642 = distinct !DILexicalBlock(scope: !1604, file: !1, line: 583, column: 7)
!1643 = !DILocation(line: 583, column: 16, scope: !1642)
!1644 = !DILocation(line: 583, column: 32, scope: !1642)
!1645 = !DILocation(line: 583, column: 7, scope: !1604)
!1646 = !DILocation(line: 585, column: 33, scope: !1647)
!1647 = distinct !DILexicalBlock(scope: !1642, file: !1, line: 584, column: 5)
!1648 = !DILocation(line: 585, column: 54, scope: !1647)
!1649 = !DILocation(line: 585, column: 22, scope: !1647)
!1650 = !DILocation(line: 585, column: 21, scope: !1647)
!1651 = !DILocation(line: 586, column: 35, scope: !1647)
!1652 = !DILocation(line: 586, column: 14, scope: !1647)
!1653 = !DILocation(line: 587, column: 33, scope: !1647)
!1654 = !DILocation(line: 587, column: 7, scope: !1647)
!1655 = !DILocation(line: 588, column: 5, scope: !1647)
!1656 = !DILocation(line: 589, column: 8, scope: !1657)
!1657 = distinct !DILexicalBlock(scope: !1604, file: !1, line: 589, column: 7)
!1658 = !DILocation(line: 589, column: 16, scope: !1657)
!1659 = !DILocation(line: 589, column: 31, scope: !1657)
!1660 = !DILocation(line: 589, column: 7, scope: !1604)
!1661 = !DILocation(line: 591, column: 33, scope: !1662)
!1662 = distinct !DILexicalBlock(scope: !1657, file: !1, line: 590, column: 5)
!1663 = !DILocation(line: 591, column: 54, scope: !1662)
!1664 = !DILocation(line: 591, column: 22, scope: !1662)
!1665 = !DILocation(line: 591, column: 21, scope: !1662)
!1666 = !DILocation(line: 592, column: 35, scope: !1662)
!1667 = !DILocation(line: 592, column: 14, scope: !1662)
!1668 = !DILocation(line: 593, column: 33, scope: !1662)
!1669 = !DILocation(line: 593, column: 7, scope: !1662)
!1670 = !DILocation(line: 594, column: 5, scope: !1662)
!1671 = !DILocation(line: 595, column: 9, scope: !1672)
!1672 = distinct !DILexicalBlock(scope: !1604, file: !1, line: 595, column: 7)
!1673 = !DILocation(line: 595, column: 17, scope: !1672)
!1674 = !DILocation(line: 595, column: 33, scope: !1672)
!1675 = !DILocation(line: 595, column: 39, scope: !1672)
!1676 = !DILocation(line: 595, column: 43, scope: !1672)
!1677 = !DILocation(line: 595, column: 50, scope: !1672)
!1678 = !DILocation(line: 595, column: 61, scope: !1672)
!1679 = !DILocation(line: 595, column: 7, scope: !1604)
!1680 = !DILocation(line: 597, column: 33, scope: !1681)
!1681 = distinct !DILexicalBlock(scope: !1672, file: !1, line: 596, column: 5)
!1682 = !DILocation(line: 597, column: 54, scope: !1681)
!1683 = !DILocation(line: 597, column: 22, scope: !1681)
!1684 = !DILocation(line: 597, column: 21, scope: !1681)
!1685 = !DILocation(line: 598, column: 35, scope: !1681)
!1686 = !DILocation(line: 598, column: 14, scope: !1681)
!1687 = !DILocation(line: 599, column: 33, scope: !1681)
!1688 = !DILocation(line: 599, column: 7, scope: !1681)
!1689 = !DILocation(line: 600, column: 5, scope: !1681)
!1690 = !DILocation(line: 601, column: 8, scope: !1691)
!1691 = distinct !DILexicalBlock(scope: !1604, file: !1, line: 601, column: 7)
!1692 = !DILocation(line: 601, column: 16, scope: !1691)
!1693 = !DILocation(line: 601, column: 32, scope: !1691)
!1694 = !DILocation(line: 601, column: 7, scope: !1604)
!1695 = !DILocation(line: 603, column: 33, scope: !1696)
!1696 = distinct !DILexicalBlock(scope: !1691, file: !1, line: 602, column: 5)
!1697 = !DILocation(line: 603, column: 54, scope: !1696)
!1698 = !DILocation(line: 603, column: 22, scope: !1696)
!1699 = !DILocation(line: 603, column: 21, scope: !1696)
!1700 = !DILocation(line: 604, column: 35, scope: !1696)
!1701 = !DILocation(line: 604, column: 14, scope: !1696)
!1702 = !DILocation(line: 605, column: 33, scope: !1696)
!1703 = !DILocation(line: 605, column: 7, scope: !1696)
!1704 = !DILocation(line: 606, column: 5, scope: !1696)
!1705 = !DILocation(line: 607, column: 10, scope: !1604)
!1706 = !DILocation(line: 607, column: 3, scope: !1604)
!1707 = distinct !DISubprogram(name: "SetImageAlphaChannel", scope: !1, file: !1, line: 639, type: !1708, scopeLine: 641, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !673)
!1708 = !DISubroutineType(types: !1709)
!1709 = !{!448, !432, !1710}
!1710 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1711)
!1711 = !DIDerivedType(tag: DW_TAG_typedef, name: "AlphaChannelType", file: !73, line: 45, baseType: !415)
!1712 = !DILocalVariable(name: "image", arg: 1, scope: !1707, file: !1, line: 639, type: !432)
!1713 = !DILocation(line: 639, column: 60, scope: !1707)
!1714 = !DILocalVariable(name: "alpha_type", arg: 2, scope: !1707, file: !1, line: 640, type: !1710)
!1715 = !DILocation(line: 640, column: 26, scope: !1707)
!1716 = !DILocalVariable(name: "status", scope: !1707, file: !1, line: 643, type: !448)
!1717 = !DILocation(line: 643, column: 5, scope: !1707)
!1718 = !DILocation(line: 646, column: 7, scope: !1719)
!1719 = distinct !DILexicalBlock(scope: !1707, file: !1, line: 646, column: 7)
!1720 = !DILocation(line: 646, column: 14, scope: !1719)
!1721 = !DILocation(line: 646, column: 20, scope: !1719)
!1722 = !DILocation(line: 646, column: 7, scope: !1707)
!1723 = !DILocation(line: 647, column: 12, scope: !1719)
!1724 = !DILocation(line: 647, column: 5, scope: !1719)
!1725 = !DILocation(line: 649, column: 9, scope: !1707)
!1726 = !DILocation(line: 650, column: 11, scope: !1707)
!1727 = !DILocation(line: 650, column: 3, scope: !1707)
!1728 = !DILocation(line: 654, column: 7, scope: !1729)
!1729 = distinct !DILexicalBlock(scope: !1730, file: !1, line: 653, column: 5)
!1730 = distinct !DILexicalBlock(scope: !1707, file: !1, line: 651, column: 3)
!1731 = !DILocation(line: 654, column: 14, scope: !1729)
!1732 = !DILocation(line: 654, column: 19, scope: !1729)
!1733 = !DILocation(line: 655, column: 7, scope: !1729)
!1734 = !DILocalVariable(name: "image_view", scope: !1735, file: !1, line: 660, type: !681)
!1735 = distinct !DILexicalBlock(scope: !1730, file: !1, line: 658, column: 5)
!1736 = !DILocation(line: 660, column: 10, scope: !1735)
!1737 = !DILocalVariable(name: "exception", scope: !1735, file: !1, line: 663, type: !672)
!1738 = !DILocation(line: 663, column: 10, scope: !1735)
!1739 = !DILocalVariable(name: "index", scope: !1735, file: !1, line: 666, type: !656)
!1740 = !DILocation(line: 666, column: 9, scope: !1735)
!1741 = !DILocalVariable(name: "status", scope: !1735, file: !1, line: 669, type: !448)
!1742 = !DILocation(line: 669, column: 9, scope: !1735)
