; ModuleID = 'magick/option.c'
source_filename = "magick/option.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct._OptionInfo = type { i8*, i64, i64, i32 }
%struct._ImageInfo = type { i32, i32, i32, i32, i32, i32, i8*, i8*, i8*, i8*, i64, i64, i64, i32, i32, i32, i64, i8*, i8*, i8*, i8*, i8*, double, double, %struct._PixelPacket, %struct._PixelPacket, %struct._PixelPacket, i32, i32, i64, i32, i32, i32, i64, i32, i32, i8*, i8*, i32, %struct._Image*, i8*, i32 (i8*, i64, i64, i8*)*, i8*, i8*, i64 (%struct._Image*, i8*, i64)*, %struct._IO_FILE*, i8*, i64, [4096 x i8], [4096 x i8], [4096 x i8], [4096 x i8], i32, i8*, i64, i64, %struct._PixelPacket, i64, i32, %struct._PixelPacket, i8*, i32 }

!494 = !DIEnumerator(name: "MagickDirectionOptions", value: 18)
!495 = !DIEnumerator(name: "MagickDisposeOptions", value: 19)
!496 = !DIEnumerator(name: "MagickDistortOptions", value: 20)
!497 = !DIEnumerator(name: "MagickDitherOptions", value: 21)
!498 = !DIEnumerator(name: "MagickEndianOptions", value: 22)
!499 = !DIEnumerator(name: "MagickEvaluateOptions", value: 23)
!500 = !DIEnumerator(name: "MagickFillRuleOptions", value: 24)
!501 = !DIEnumerator(name: "MagickFilterOptions", value: 25)
!502 = !DIEnumerator(name: "MagickFontOptions", value: 26)
!503 = !DIEnumerator(name: "MagickFontsOptions", value: 27)
!504 = !DIEnumerator(name: "MagickFormatOptions", value: 28)
!505 = !DIEnumerator(name: "MagickFunctionOptions", value: 29)
!506 = !DIEnumerator(name: "MagickGravityOptions", value: 30)
!507 = !DIEnumerator(name: "MagickIntentOptions", value: 31)
!508 = !DIEnumerator(name: "MagickInterlaceOptions", value: 32)
!509 = !DIEnumerator(name: "MagickInterpolateOptions", value: 33)
!510 = !DIEnumerator(name: "MagickKernelOptions", value: 34)
!511 = !DIEnumerator(name: "MagickLayerOptions", value: 35)
!512 = !DIEnumerator(name: "MagickLineCapOptions", value: 36)
!513 = !DIEnumerator(name: "MagickLineJoinOptions", value: 37)
!514 = !DIEnumerator(name: "MagickListOptions", value: 38)
!515 = !DIEnumerator(name: "MagickLocaleOptions", value: 39)
!516 = !DIEnumerator(name: "MagickLogEventOptions", value: 40)
!517 = !DIEnumerator(name: "MagickLogOptions", value: 41)
!518 = !DIEnumerator(name: "MagickMagicOptions", value: 42)
!519 = !DIEnumerator(name: "MagickMethodOptions", value: 43)
!520 = !DIEnumerator(name: "MagickMetricOptions", value: 44)
!521 = !DIEnumerator(name: "MagickMimeOptions", value: 45)
!522 = !DIEnumerator(name: "MagickModeOptions", value: 46)
!523 = !DIEnumerator(name: "MagickModuleOptions", value: 47)
!524 = !DIEnumerator(name: "MagickMorphologyOptions", value: 48)
!525 = !DIEnumerator(name: "MagickNoiseOptions", value: 49)
!526 = !DIEnumerator(name: "MagickOrientationOptions", value: 50)
!527 = !DIEnumerator(name: "MagickPixelIntensityOptions", value: 51)
!528 = !DIEnumerator(name: "MagickPolicyOptions", value: 52)
!529 = !DIEnumerator(name: "MagickPolicyDomainOptions", value: 53)
!530 = !DIEnumerator(name: "MagickPolicyRightsOptions", value: 54)
!531 = !DIEnumerator(name: "MagickPreviewOptions", value: 55)
!532 = !DIEnumerator(name: "MagickPrimitiveOptions", value: 56)
!533 = !DIEnumerator(name: "MagickQuantumFormatOptions", value: 57)
!534 = !DIEnumerator(name: "MagickResolutionOptions", value: 58)
!535 = !DIEnumerator(name: "MagickResourceOptions", value: 59)
!536 = !DIEnumerator(name: "MagickSparseColorOptions", value: 60)
!537 = !DIEnumerator(name: "MagickStatisticOptions", value: 61)
!538 = !DIEnumerator(name: "MagickStorageOptions", value: 62)
!539 = !DIEnumerator(name: "MagickStretchOptions", value: 63)
!540 = !DIEnumerator(name: "MagickStyleOptions", value: 64)
!541 = !DIEnumerator(name: "MagickThresholdOptions", value: 65)
!542 = !DIEnumerator(name: "MagickTypeOptions", value: 66)
!543 = !DIEnumerator(name: "MagickValidateOptions", value: 67)
!544 = !DIEnumerator(name: "MagickVirtualPixelOptions", value: 68)
!545 = !DIEnumerator(name: "MagickComplexOptions", value: 69)
!546 = !DIEnumerator(name: "MagickIntensityOptions", value: 70)
!547 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !548, line: 46, baseType: !7, size: 32, elements: !549)
!548 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!549 = !{!550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561}
!550 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!551 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!552 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!553 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!554 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!555 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!556 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!557 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!558 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!559 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!560 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!561 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!562 = !{!563, !564, !565, !569, !572, !575, !590, !473, !591, !592, !593, !594, !596, !582}
!563 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64)
!566 = !DIDerivedType(tag: DW_TAG_typedef, name: "SplayTreeInfo", file: !567, line: 26, baseType: !568)
!567 = !DIFile(filename: "./magick/splay-tree.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!568 = !DICompositeType(tag: DW_TAG_structure_type, name: "_SplayTreeInfo", file: !567, line: 25, flags: DIFlagFwdDecl)
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 64)
!570 = !DISubroutineType(types: !571)
!571 = !{!564, !564}
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 64)
!573 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !574)
!574 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64)
!576 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !577)
!577 = !DIDerivedType(tag: DW_TAG_typedef, name: "OptionInfo", file: !472, line: 130, baseType: !578)
!578 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_OptionInfo", file: !472, line: 119, size: 256, elements: !579)
!579 = !{!580, !581, !587, !588}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "mnemonic", scope: !578, file: !472, line: 122, baseType: !572, size: 64)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !578, file: !472, line: 125, baseType: !582, size: 64, offset: 64)
!582 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !583, line: 77, baseType: !584)
!583 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!584 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !585, line: 193, baseType: !586)
!585 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!586 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !578, file: !472, line: 126, baseType: !582, size: 64, offset: 128)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "stealth", scope: !578, file: !472, line: 129, baseType: !589, size: 32, offset: 192)
!589 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickBooleanType", file: !6, line: 215, baseType: !5)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64)
!591 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!592 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 64)
!594 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !595, line: 46, baseType: !563)
!595 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 64)
!597 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !598, line: 7, baseType: !599)
!598 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!599 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !600, line: 49, size: 1728, elements: !601)
!600 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!601 = !{!602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !617, !619, !620, !621, !623, !624, !626, !630, !633, !635, !638, !641, !642, !643, !644, !645}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !599, file: !600, line: 51, baseType: !473, size: 32)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !599, file: !600, line: 54, baseType: !590, size: 64, offset: 64)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !599, file: !600, line: 55, baseType: !590, size: 64, offset: 128)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !599, file: !600, line: 56, baseType: !590, size: 64, offset: 192)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !599, file: !600, line: 57, baseType: !590, size: 64, offset: 256)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !599, file: !600, line: 58, baseType: !590, size: 64, offset: 320)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !599, file: !600, line: 59, baseType: !590, size: 64, offset: 384)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !599, file: !600, line: 60, baseType: !590, size: 64, offset: 448)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !599, file: !600, line: 61, baseType: !590, size: 64, offset: 512)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !599, file: !600, line: 64, baseType: !590, size: 64, offset: 576)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !599, file: !600, line: 65, baseType: !590, size: 64, offset: 640)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !599, file: !600, line: 66, baseType: !590, size: 64, offset: 704)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !599, file: !600, line: 68, baseType: !615, size: 64, offset: 768)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 64)
!616 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !600, line: 36, flags: DIFlagFwdDecl)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !599, file: !600, line: 70, baseType: !618, size: 64, offset: 832)
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !599, size: 64)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !599, file: !600, line: 72, baseType: !473, size: 32, offset: 896)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !599, file: !600, line: 73, baseType: !473, size: 32, offset: 928)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !599, file: !600, line: 74, baseType: !622, size: 64, offset: 960)
!622 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !585, line: 152, baseType: !586)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !599, file: !600, line: 77, baseType: !592, size: 16, offset: 1024)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !599, file: !600, line: 78, baseType: !625, size: 8, offset: 1040)
!625 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !599, file: !600, line: 79, baseType: !627, size: 8, offset: 1048)
!627 = !DICompositeType(tag: DW_TAG_array_type, baseType: !574, size: 8, elements: !628)
!628 = !{!629}
!629 = !DISubrange(count: 1)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !599, file: !600, line: 81, baseType: !631, size: 64, offset: 1088)
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64)
!632 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !600, line: 43, baseType: null)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !599, file: !600, line: 89, baseType: !634, size: 64, offset: 1152)
!634 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !585, line: 153, baseType: !586)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !599, file: !600, line: 91, baseType: !636, size: 64, offset: 1216)
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 64)
!637 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !600, line: 37, flags: DIFlagFwdDecl)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !599, file: !600, line: 92, baseType: !639, size: 64, offset: 1280)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64)
!640 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !600, line: 38, flags: DIFlagFwdDecl)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !599, file: !600, line: 93, baseType: !618, size: 64, offset: 1344)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !599, file: !600, line: 94, baseType: !564, size: 64, offset: 1408)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !599, file: !600, line: 95, baseType: !594, size: 64, offset: 1472)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !599, file: !600, line: 96, baseType: !473, size: 32, offset: 1536)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !599, file: !600, line: 98, baseType: !646, size: 160, offset: 1568)
!646 = !DICompositeType(tag: DW_TAG_array_type, baseType: !574, size: 160, elements: !647)
!647 = !{!648}
!648 = !DISubrange(count: 20)
!649 = !{!0, !650, !655, !660, !665, !670, !675, !677, !682, !687, !692, !697, !702, !704, !709, !711, !713, !718, !723, !725, !727, !729, !731, !736, !738, !743, !748, !750, !752, !757, !762, !767, !769, !771, !776, !781, !786, !788, !793, !795, !797, !802, !804, !809, !811, !813, !815, !817, !819, !821, !823, !825, !827, !829, !834}
!650 = !DIGlobalVariableExpression(var: !651, expr: !DIExpression())
!651 = distinct !DIGlobalVariable(name: "AlphaOptions", scope: !2, file: !3, line: 94, type: !652, isLocal: true, isDefinition: true)
!652 = !DICompositeType(tag: DW_TAG_array_type, baseType: !576, size: 4096, elements: !653)
!653 = !{!654}
!654 = !DISubrange(count: 16)
!655 = !DIGlobalVariableExpression(var: !656, expr: !DIExpression())
!656 = distinct !DIGlobalVariable(name: "BooleanOptions", scope: !2, file: !3, line: 113, type: !657, isLocal: true, isDefinition: true)
!657 = !DICompositeType(tag: DW_TAG_array_type, baseType: !576, size: 1280, elements: !658)
!658 = !{!659}
!659 = !DISubrange(count: 5)
!660 = !DIGlobalVariableExpression(var: !661, expr: !DIExpression())
!661 = distinct !DIGlobalVariable(name: "CacheOptions", scope: !2, file: !3, line: 121, type: !662, isLocal: true, isDefinition: true)
!662 = !DICompositeType(tag: DW_TAG_array_type, baseType: !576, size: 1536, elements: !663)
!663 = !{!664}
!664 = !DISubrange(count: 6)
!665 = !DIGlobalVariableExpression(var: !666, expr: !DIExpression())
!666 = distinct !DIGlobalVariable(name: "ChannelOptions", scope: !2, file: !3, line: 130, type: !667, isLocal: true, isDefinition: true)
!667 = !DICompositeType(tag: DW_TAG_array_type, baseType: !576, size: 8704, elements: !668)
!668 = !{!669}
!669 = !DISubrange(count: 34)
!670 = !DIGlobalVariableExpression(var: !671, expr: !DIExpression())
!671 = distinct !DIGlobalVariable(name: "ClassOptions", scope: !2, file: !3, line: 167, type: !672, isLocal: true, isDefinition: true)
!672 = !DICompositeType(tag: DW_TAG_array_type, baseType: !576, size: 1024, elements: !673)
!673 = !{!674}
!674 = !DISubrange(count: 4)
!675 = !DIGlobalVariableExpression(var: !676, expr: !DIExpression())
!676 = distinct !DIGlobalVariable(name: "ClipPathOptions", scope: !2, file: !3, line: 174, type: !657, isLocal: true, isDefinition: true)
!677 = !DIGlobalVariableExpression(var: !678, expr: !DIExpression())
!678 = distinct !DIGlobalVariable(name: "ColorspaceOptions", scope: !2, file: !3, line: 879, type: !679, isLocal: true, isDefinition: true)
!679 = !DICompositeType(tag: DW_TAG_array_type, baseType: !576, size: 9216, elements: !680)
!680 = !{!681}
!681 = !DISubrange(count: 36)
!682 = !DIGlobalVariableExpression(var: !683, expr: !DIExpression())
!683 = distinct !DIGlobalVariable(name: "CommandOptions", scope: !2, file: !3, line: 182, type: !684, isLocal: true, isDefinition: true)
!684 = !DICompositeType(tag: DW_TAG_array_type, baseType: !576, size: 151040, elements: !685)
!685 = !{!686}
!686 = !DISubrange(count: 590)
!687 = !DIGlobalVariableExpression(var: !688, expr: !DIExpression())
!688 = distinct !DIGlobalVariable(name: "ComplexOptions", scope: !2, file: !3, line: 918, type: !689, isLocal: true, isDefinition: true)
!689 = !DICompositeType(tag: DW_TAG_array_type, baseType: !576, size: 2304, elements: !690)
!690 = !{!691}
!691 = !DISubrange(count: 9)
!692 = !DIGlobalVariableExpression(var: !693, expr: !DIExpression())
!693 = distinct !DIGlobalVariable(name: "ComposeOptions", scope: !2, file: !3, line: 775, type: !694, isLocal: true, isDefinition: true)
!694 = !DICompositeType(tag: DW_TAG_array_type, baseType: !576, size: 18688, elements: !695)
!695 = !{!696}
!696 = !DISubrange(count: 73)
!697 = !DIGlobalVariableExpression(var: !698, expr: !DIExpression())
!698 = distinct !DIGlobalVariable(name: "CompressOptions", scope: !2, file: !3, line: 851, type: !699, isLocal: true, isDefinition: true)
!699 = !DICompositeType(tag: DW_TAG_array_type, baseType: !576, size: 6400, elements: !700)
!700 = !{!701}
!701 = !DISubrange(count: 25)
!702 = !DIGlobalVariableExpression(var: !703, expr: !DIExpression())
!703 = distinct !DIGlobalVariable(name: "DataTypeOptions", scope: !2, file: !3, line: 930, type: !662, isLocal: true, isDefinition: true)
!704 = !DIGlobalVariableExpression(var: !705, expr: !DIExpression())
!705 = distinct !DIGlobalVariable(name: "LogEventOptions", scope: !2, file: !3, line: 1315, type: !706, isLocal: true, isDefinition: true)
!706 = !DICompositeType(tag: DW_TAG_array_type, baseType: !576, size: 5632, elements: !707)
!707 = !{!708}
!708 = !DISubrange(count: 22)
!709 = !DIGlobalVariableExpression(var: !710, expr: !DIExpression())
!710 = distinct !DIGlobalVariable(name: "DecorateOptions", scope: !2, file: !3, line: 939, type: !662, isLocal: true, isDefinition: true)
!711 = !DIGlobalVariableExpression(var: !712, expr: !DIExpression())
!712 = distinct !DIGlobalVariable(name: "DirectionOptions", scope: !2, file: !3, line: 948, type: !672, isLocal: true, isDefinition: true)
!713 = !DIGlobalVariableExpression(var: !714, expr: !DIExpression())
!714 = distinct !DIGlobalVariable(name: "DisposeOptions", scope: !2, file: !3, line: 955, type: !715, isLocal: true, isDefinition: true)
!715 = !DICompositeType(tag: DW_TAG_array_type, baseType: !576, size: 2560, elements: !716)
!716 = !{!717}
!717 = !DISubrange(count: 10)
!718 = !DIGlobalVariableExpression(var: !719, expr: !DIExpression())
!719 = distinct !DIGlobalVariable(name: "DistortOptions", scope: !2, file: !3, line: 968, type: !720, isLocal: true, isDefinition: true)
!720 = !DICompositeType(tag: DW_TAG_array_type, baseType: !576, size: 5376, elements: !721)
!721 = !{!722}
!722 = !DISubrange(count: 21)
!723 = !DIGlobalVariableExpression(var: !724, expr: !DIExpression())
!724 = distinct !DIGlobalVariable(name: "DitherOptions", scope: !2, file: !3, line: 992, type: !657, isLocal: true, isDefinition: true)
!725 = !DIGlobalVariableExpression(var: !726, expr: !DIExpression())
!726 = distinct !DIGlobalVariable(name: "EndianOptions", scope: !2, file: !3, line: 1000, type: !672, isLocal: true, isDefinition: true)
!727 = !DIGlobalVariableExpression(var: !728, expr: !DIExpression())
!728 = distinct !DIGlobalVariable(name: "EvaluateOptions", scope: !2, file: !3, line: 1007, type: !679, isLocal: true, isDefinition: true)
!729 = !DIGlobalVariableExpression(var: !730, expr: !DIExpression())
!730 = distinct !DIGlobalVariable(name: "FillRuleOptions", scope: !2, file: !3, line: 1046, type: !672, isLocal: true, isDefinition: true)
!731 = !DIGlobalVariableExpression(var: !732, expr: !DIExpression())
!732 = distinct !DIGlobalVariable(name: "FilterOptions", scope: !2, file: !3, line: 1053, type: !733, isLocal: true, isDefinition: true)
!733 = !DICompositeType(tag: DW_TAG_array_type, baseType: !576, size: 8960, elements: !734)
!734 = !{!735}
!735 = !DISubrange(count: 35)
!736 = !DIGlobalVariableExpression(var: !737, expr: !DIExpression())
!737 = distinct !DIGlobalVariable(name: "FunctionOptions", scope: !2, file: !3, line: 1092, type: !662, isLocal: true, isDefinition: true)
!738 = !DIGlobalVariableExpression(var: !739, expr: !DIExpression())
!739 = distinct !DIGlobalVariable(name: "GravityOptions", scope: !2, file: !3, line: 1101, type: !740, isLocal: true, isDefinition: true)
!740 = !DICompositeType(tag: DW_TAG_array_type, baseType: !576, size: 3584, elements: !741)
!741 = !{!742}
!742 = !DISubrange(count: 14)
!743 = !DIGlobalVariableExpression(var: !744, expr: !DIExpression())
!744 = distinct !DIGlobalVariable(name: "PixelIntensityOptions", scope: !2, file: !3, line: 1513, type: !745, isLocal: true, isDefinition: true)
!745 = !DICompositeType(tag: DW_TAG_array_type, baseType: !576, size: 2816, elements: !746)
!746 = !{!747}
!747 = !DISubrange(count: 11)
!748 = !DIGlobalVariableExpression(var: !749, expr: !DIExpression())
!749 = distinct !DIGlobalVariable(name: "IntentOptions", scope: !2, file: !3, line: 1118, type: !662, isLocal: true, isDefinition: true)
!750 = !DIGlobalVariableExpression(var: !751, expr: !DIExpression())
!751 = distinct !DIGlobalVariable(name: "InterlaceOptions", scope: !2, file: !3, line: 1127, type: !689, isLocal: true, isDefinition: true)
!752 = !DIGlobalVariableExpression(var: !753, expr: !DIExpression())
!753 = distinct !DIGlobalVariable(name: "InterpolateOptions", scope: !2, file: !3, line: 1139, type: !754, isLocal: true, isDefinition: true)
!754 = !DICompositeType(tag: DW_TAG_array_type, baseType: !576, size: 4352, elements: !755)
!755 = !{!756}
!756 = !DISubrange(count: 17)
!757 = !DIGlobalVariableExpression(var: !758, expr: !DIExpression())
!758 = distinct !DIGlobalVariable(name: "KernelOptions", scope: !2, file: !3, line: 1160, type: !759, isLocal: true, isDefinition: true)
!759 = !DICompositeType(tag: DW_TAG_array_type, baseType: !576, size: 10240, elements: !760)
!760 = !{!761}
!761 = !DISubrange(count: 40)
!762 = !DIGlobalVariableExpression(var: !763, expr: !DIExpression())
!763 = distinct !DIGlobalVariable(name: "LayerOptions", scope: !2, file: !3, line: 1203, type: !764, isLocal: true, isDefinition: true)
!764 = !DICompositeType(tag: DW_TAG_array_type, baseType: !576, size: 4608, elements: !765)
!765 = !{!766}
!766 = !DISubrange(count: 18)
!767 = !DIGlobalVariableExpression(var: !768, expr: !DIExpression())
!768 = distinct !DIGlobalVariable(name: "LineCapOptions", scope: !2, file: !3, line: 1224, type: !657, isLocal: true, isDefinition: true)
!769 = !DIGlobalVariableExpression(var: !770, expr: !DIExpression())
!770 = distinct !DIGlobalVariable(name: "LineJoinOptions", scope: !2, file: !3, line: 1232, type: !657, isLocal: true, isDefinition: true)
!771 = !DIGlobalVariableExpression(var: !772, expr: !DIExpression())
!772 = distinct !DIGlobalVariable(name: "ListOptions", scope: !2, file: !3, line: 1240, type: !773, isLocal: true, isDefinition: true)
!773 = !DICompositeType(tag: DW_TAG_array_type, baseType: !576, size: 18432, elements: !774)
!774 = !{!775}
!775 = !DISubrange(count: 72)
!776 = !DIGlobalVariableExpression(var: !777, expr: !DIExpression())
!777 = distinct !DIGlobalVariable(name: "MetricOptions", scope: !2, file: !3, line: 1340, type: !778, isLocal: true, isDefinition: true)
!778 = !DICompositeType(tag: DW_TAG_array_type, baseType: !576, size: 3072, elements: !779)
!779 = !{!780}
!780 = !DISubrange(count: 12)
!781 = !DIGlobalVariableExpression(var: !782, expr: !DIExpression())
!782 = distinct !DIGlobalVariable(name: "MethodOptions", scope: !2, file: !3, line: 1355, type: !783, isLocal: true, isDefinition: true)
!783 = !DICompositeType(tag: DW_TAG_array_type, baseType: !576, size: 1792, elements: !784)
!784 = !{!785}
!785 = !DISubrange(count: 7)
!786 = !DIGlobalVariableExpression(var: !787, expr: !DIExpression())
!787 = distinct !DIGlobalVariable(name: "ModeOptions", scope: !2, file: !3, line: 1365, type: !657, isLocal: true, isDefinition: true)
!788 = !DIGlobalVariableExpression(var: !789, expr: !DIExpression())
!789 = distinct !DIGlobalVariable(name: "MorphologyOptions", scope: !2, file: !3, line: 1373, type: !790, isLocal: true, isDefinition: true)
!790 = !DICompositeType(tag: DW_TAG_array_type, baseType: !576, size: 7680, elements: !791)
!791 = !{!792}
!792 = !DISubrange(count: 30)
!793 = !DIGlobalVariableExpression(var: !794, expr: !DIExpression())
!794 = distinct !DIGlobalVariable(name: "NoiseOptions", scope: !2, file: !3, line: 1406, type: !689, isLocal: true, isDefinition: true)
!795 = !DIGlobalVariableExpression(var: !796, expr: !DIExpression())
!796 = distinct !DIGlobalVariable(name: "OrientationOptions", scope: !2, file: !3, line: 1418, type: !715, isLocal: true, isDefinition: true)
!797 = !DIGlobalVariableExpression(var: !798, expr: !DIExpression())
!798 = distinct !DIGlobalVariable(name: "PolicyDomainOptions", scope: !2, file: !3, line: 1431, type: !799, isLocal: true, isDefinition: true)
!799 = !DICompositeType(tag: DW_TAG_array_type, baseType: !576, size: 2048, elements: !800)
!800 = !{!801}
!801 = !DISubrange(count: 8)
!802 = !DIGlobalVariableExpression(var: !803, expr: !DIExpression())
!803 = distinct !DIGlobalVariable(name: "PolicyRightsOptions", scope: !2, file: !3, line: 1442, type: !662, isLocal: true, isDefinition: true)
!804 = !DIGlobalVariableExpression(var: !805, expr: !DIExpression())
!805 = distinct !DIGlobalVariable(name: "PreviewOptions", scope: !2, file: !3, line: 1451, type: !806, isLocal: true, isDefinition: true)
!806 = !DICompositeType(tag: DW_TAG_array_type, baseType: !576, size: 7936, elements: !807)
!807 = !{!808}
!808 = !DISubrange(count: 31)
!809 = !DIGlobalVariableExpression(var: !810, expr: !DIExpression())
!810 = distinct !DIGlobalVariable(name: "PrimitiveOptions", scope: !2, file: !3, line: 1485, type: !754, isLocal: true, isDefinition: true)
!811 = !DIGlobalVariableExpression(var: !812, expr: !DIExpression())
!812 = distinct !DIGlobalVariable(name: "QuantumFormatOptions", scope: !2, file: !3, line: 1505, type: !657, isLocal: true, isDefinition: true)
!813 = !DIGlobalVariableExpression(var: !814, expr: !DIExpression())
!814 = distinct !DIGlobalVariable(name: "ResolutionOptions", scope: !2, file: !3, line: 1527, type: !672, isLocal: true, isDefinition: true)
!815 = !DIGlobalVariableExpression(var: !816, expr: !DIExpression())
!816 = distinct !DIGlobalVariable(name: "ResourceOptions", scope: !2, file: !3, line: 1534, type: !689, isLocal: true, isDefinition: true)
!817 = !DIGlobalVariableExpression(var: !818, expr: !DIExpression())
!818 = distinct !DIGlobalVariable(name: "SparseColorOptions", scope: !2, file: !3, line: 1546, type: !783, isLocal: true, isDefinition: true)
!819 = !DIGlobalVariableExpression(var: !820, expr: !DIExpression())
!820 = distinct !DIGlobalVariable(name: "StatisticOptions", scope: !2, file: !3, line: 1556, type: !715, isLocal: true, isDefinition: true)
!821 = !DIGlobalVariableExpression(var: !822, expr: !DIExpression())
!822 = distinct !DIGlobalVariable(name: "StorageOptions", scope: !2, file: !3, line: 1569, type: !689, isLocal: true, isDefinition: true)
!823 = !DIGlobalVariableExpression(var: !824, expr: !DIExpression())
!824 = distinct !DIGlobalVariable(name: "StretchOptions", scope: !2, file: !3, line: 1581, type: !778, isLocal: true, isDefinition: true)
!825 = !DIGlobalVariableExpression(var: !826, expr: !DIExpression())
!826 = distinct !DIGlobalVariable(name: "StyleOptions", scope: !2, file: !3, line: 1596, type: !662, isLocal: true, isDefinition: true)
!827 = !DIGlobalVariableExpression(var: !828, expr: !DIExpression())
!828 = distinct !DIGlobalVariable(name: "TypeOptions", scope: !2, file: !3, line: 1605, type: !764, isLocal: true, isDefinition: true)
!829 = !DIGlobalVariableExpression(var: !830, expr: !DIExpression())
!830 = distinct !DIGlobalVariable(name: "ValidateOptions", scope: !2, file: !3, line: 1626, type: !831, isLocal: true, isDefinition: true)
!831 = !DICompositeType(tag: DW_TAG_array_type, baseType: !576, size: 3840, elements: !832)
!832 = !{!833}
!833 = !DISubrange(count: 15)
!834 = !DIGlobalVariableExpression(var: !835, expr: !DIExpression())
!835 = distinct !DIGlobalVariable(name: "VirtualPixelOptions", scope: !2, file: !3, line: 1644, type: !836, isLocal: true, isDefinition: true)
!836 = !DICompositeType(tag: DW_TAG_array_type, baseType: !576, size: 4864, elements: !837)
!837 = !{!838}
!838 = !DISubrange(count: 19)
!839 = !{i32 7, !"Dwarf Version", i32 4}
!840 = !{i32 2, !"Debug Info Version", i32 3}
!841 = !{i32 1, !"wchar_size", i32 4}
!842 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!843 = distinct !DISubprogram(name: "CloneImageOptions", scope: !3, file: !3, line: 1692, type: !844, scopeLine: 1694, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !1132)
!844 = !DISubroutineType(types: !845)
!845 = !{!589, !846, !1130}
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 64)
!847 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageInfo", file: !6, line: 223, baseType: !848)
!848 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ImageInfo", file: !37, line: 356, size: 134336, elements: !849)
!849 = !{!850, !852, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !867, !869, !871, !872, !873, !874, !875, !876, !877, !879, !880, !889, !890, !891, !892, !893, !894, !896, !898, !900, !901, !902, !903, !904, !905, !907, !1097, !1098, !1099, !1100, !1101, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1127, !1128, !1129}
!850 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !848, file: !37, line: 359, baseType: !851, size: 32)
!851 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompressionType", file: !12, line: 49, baseType: !11)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !848, file: !37, line: 362, baseType: !853, size: 32, offset: 32)
!853 = !DIDerivedType(tag: DW_TAG_typedef, name: "OrientationType", file: !37, line: 86, baseType: !36)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "temporary", scope: !848, file: !37, line: 365, baseType: !589, size: 32, offset: 64)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "adjoin", scope: !848, file: !37, line: 366, baseType: !589, size: 32, offset: 96)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "affirm", scope: !848, file: !37, line: 367, baseType: !589, size: 32, offset: 128)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "antialias", scope: !848, file: !37, line: 368, baseType: !589, size: 32, offset: 160)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !848, file: !37, line: 371, baseType: !590, size: 64, offset: 192)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "extract", scope: !848, file: !37, line: 372, baseType: !590, size: 64, offset: 256)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !848, file: !37, line: 373, baseType: !590, size: 64, offset: 320)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "scenes", scope: !848, file: !37, line: 374, baseType: !590, size: 64, offset: 384)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !848, file: !37, line: 377, baseType: !594, size: 64, offset: 448)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "number_scenes", scope: !848, file: !37, line: 378, baseType: !594, size: 64, offset: 512)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !848, file: !37, line: 379, baseType: !594, size: 64, offset: 576)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "interlace", scope: !848, file: !37, line: 382, baseType: !866, size: 32, offset: 640)
!866 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterlaceType", file: !37, line: 73, baseType: !48)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !848, file: !37, line: 385, baseType: !868, size: 32, offset: 672)
!868 = !DIDerivedType(tag: DW_TAG_typedef, name: "EndianType", file: !59, line: 35, baseType: !58)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !848, file: !37, line: 388, baseType: !870, size: 32, offset: 704)
!870 = !DIDerivedType(tag: DW_TAG_typedef, name: "ResolutionType", file: !37, line: 93, baseType: !64)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !848, file: !37, line: 391, baseType: !594, size: 64, offset: 768)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "sampling_factor", scope: !848, file: !37, line: 394, baseType: !590, size: 64, offset: 832)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "server_name", scope: !848, file: !37, line: 395, baseType: !590, size: 64, offset: 896)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "font", scope: !848, file: !37, line: 396, baseType: !590, size: 64, offset: 960)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "texture", scope: !848, file: !37, line: 397, baseType: !590, size: 64, offset: 1024)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "density", scope: !848, file: !37, line: 398, baseType: !590, size: 64, offset: 1088)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "pointsize", scope: !848, file: !37, line: 401, baseType: !878, size: 64, offset: 1152)
!878 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !848, file: !37, line: 402, baseType: !878, size: 64, offset: 1216)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "background_color", scope: !848, file: !37, line: 405, baseType: !881, size: 64, offset: 1280)
!881 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelPacket", file: !397, line: 148, baseType: !882)
!882 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PixelPacket", file: !397, line: 131, size: 64, elements: !883)
!883 = !{!884, !886, !887, !888}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !882, file: !397, line: 143, baseType: !885, size: 16)
!885 = !DIDerivedType(tag: DW_TAG_typedef, name: "Quantum", file: !6, line: 93, baseType: !592)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !882, file: !397, line: 144, baseType: !885, size: 16, offset: 16)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !882, file: !397, line: 145, baseType: !885, size: 16, offset: 32)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !882, file: !397, line: 146, baseType: !885, size: 16, offset: 48)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !848, file: !37, line: 406, baseType: !881, size: 64, offset: 1344)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "matte_color", scope: !848, file: !37, line: 407, baseType: !881, size: 64, offset: 1408)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !848, file: !37, line: 410, baseType: !589, size: 32, offset: 1472)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "monochrome", scope: !848, file: !37, line: 411, baseType: !589, size: 32, offset: 1504)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !848, file: !37, line: 414, baseType: !594, size: 64, offset: 1536)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !848, file: !37, line: 417, baseType: !895, size: 32, offset: 1600)
!895 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorspaceType", file: !70, line: 61, baseType: !69)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !848, file: !37, line: 420, baseType: !897, size: 32, offset: 1632)
!897 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageType", file: !37, line: 61, baseType: !106)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "preview_type", scope: !848, file: !37, line: 423, baseType: !899, size: 32, offset: 1664)
!899 = !DIDerivedType(tag: DW_TAG_typedef, name: "PreviewType", file: !121, line: 59, baseType: !120)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !848, file: !37, line: 426, baseType: !582, size: 64, offset: 1728)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "ping", scope: !848, file: !37, line: 429, baseType: !589, size: 32, offset: 1792)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !848, file: !37, line: 430, baseType: !589, size: 32, offset: 1824)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !848, file: !37, line: 433, baseType: !590, size: 64, offset: 1856)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "authenticate", scope: !848, file: !37, line: 434, baseType: !590, size: 64, offset: 1920)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !848, file: !37, line: 437, baseType: !906, size: 32, offset: 1984)
!906 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChannelType", file: !6, line: 202, baseType: !153)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !848, file: !37, line: 440, baseType: !908, size: 64, offset: 2048)
!908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !909, size: 64)
!909 = !DIDerivedType(tag: DW_TAG_typedef, name: "Image", file: !6, line: 221, baseType: !910)
!910 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Image", file: !37, line: 150, size: 105920, elements: !911)
!911 = !{!912, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !926, !927, !928, !929, !930, !944, !946, !947, !948, !949, !950, !951, !952, !953, !954, !962, !963, !964, !965, !966, !967, !969, !970, !971, !973, !975, !977, !979, !980, !981, !982, !983, !984, !985, !993, !1008, !1020, !1021, !1022, !1023, !1027, !1031, !1035, !1036, !1037, !1038, !1039, !1056, !1057, !1059, !1060, !1069, !1070, !1072, !1073, !1074, !1075, !1076, !1077, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1094, !1096}
!912 = !DIDerivedType(tag: DW_TAG_member, name: "storage_class", scope: !910, file: !37, line: 153, baseType: !913, size: 32)
!913 = !DIDerivedType(tag: DW_TAG_typedef, name: "ClassType", file: !6, line: 209, baseType: !175)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !910, file: !37, line: 156, baseType: !895, size: 32, offset: 32)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !910, file: !37, line: 159, baseType: !851, size: 32, offset: 64)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !910, file: !37, line: 162, baseType: !594, size: 64, offset: 128)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !910, file: !37, line: 165, baseType: !853, size: 32, offset: 192)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "taint", scope: !910, file: !37, line: 168, baseType: !589, size: 32, offset: 224)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "matte", scope: !910, file: !37, line: 169, baseType: !589, size: 32, offset: 256)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !910, file: !37, line: 172, baseType: !594, size: 64, offset: 320)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !910, file: !37, line: 173, baseType: !594, size: 64, offset: 384)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !910, file: !37, line: 174, baseType: !594, size: 64, offset: 448)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !910, file: !37, line: 175, baseType: !594, size: 64, offset: 512)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "colormap", scope: !910, file: !37, line: 178, baseType: !925, size: 64, offset: 576)
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !881, size: 64)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "background_color", scope: !910, file: !37, line: 179, baseType: !881, size: 64, offset: 640)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !910, file: !37, line: 180, baseType: !881, size: 64, offset: 704)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "matte_color", scope: !910, file: !37, line: 181, baseType: !881, size: 64, offset: 768)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !910, file: !37, line: 184, baseType: !878, size: 64, offset: 832)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "chromaticity", scope: !910, file: !37, line: 187, baseType: !931, size: 768, offset: 896)
!931 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChromaticityInfo", file: !37, line: 128, baseType: !932)
!932 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ChromaticityInfo", file: !37, line: 121, size: 768, elements: !933)
!933 = !{!934, !941, !942, !943}
!934 = !DIDerivedType(tag: DW_TAG_member, name: "red_primary", scope: !932, file: !37, line: 124, baseType: !935, size: 192)
!935 = !DIDerivedType(tag: DW_TAG_typedef, name: "PrimaryInfo", file: !37, line: 101, baseType: !936)
!936 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PrimaryInfo", file: !37, line: 95, size: 192, elements: !937)
!937 = !{!938, !939, !940}
!938 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !936, file: !37, line: 98, baseType: !878, size: 64)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !936, file: !37, line: 99, baseType: !878, size: 64, offset: 64)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !936, file: !37, line: 100, baseType: !878, size: 64, offset: 128)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "green_primary", scope: !932, file: !37, line: 125, baseType: !935, size: 192, offset: 192)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "blue_primary", scope: !932, file: !37, line: 126, baseType: !935, size: 192, offset: 384)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "white_point", scope: !932, file: !37, line: 127, baseType: !935, size: 192, offset: 576)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "rendering_intent", scope: !910, file: !37, line: 190, baseType: !945, size: 32, offset: 1664)
!945 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderingIntent", file: !181, line: 49, baseType: !180)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !910, file: !37, line: 193, baseType: !564, size: 64, offset: 1728)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !910, file: !37, line: 196, baseType: !870, size: 32, offset: 1792)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "montage", scope: !910, file: !37, line: 199, baseType: !590, size: 64, offset: 1856)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "directory", scope: !910, file: !37, line: 200, baseType: !590, size: 64, offset: 1920)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "geometry", scope: !910, file: !37, line: 201, baseType: !590, size: 64, offset: 1984)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !910, file: !37, line: 204, baseType: !582, size: 64, offset: 2048)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "x_resolution", scope: !910, file: !37, line: 207, baseType: !878, size: 64, offset: 2112)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "y_resolution", scope: !910, file: !37, line: 208, baseType: !878, size: 64, offset: 2176)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !910, file: !37, line: 211, baseType: !955, size: 256, offset: 2240)
!955 = !DIDerivedType(tag: DW_TAG_typedef, name: "RectangleInfo", file: !224, line: 130, baseType: !956)
!956 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_RectangleInfo", file: !224, line: 121, size: 256, elements: !957)
!957 = !{!958, !959, !960, !961}
!958 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !956, file: !224, line: 124, baseType: !594, size: 64)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !956, file: !224, line: 125, baseType: !594, size: 64, offset: 64)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !956, file: !224, line: 128, baseType: !582, size: 64, offset: 128)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !956, file: !224, line: 129, baseType: !582, size: 64, offset: 192)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "extract_info", scope: !910, file: !37, line: 212, baseType: !955, size: 256, offset: 2496)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "tile_info", scope: !910, file: !37, line: 213, baseType: !955, size: 256, offset: 2752)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "bias", scope: !910, file: !37, line: 216, baseType: !878, size: 64, offset: 3008)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "blur", scope: !910, file: !37, line: 217, baseType: !878, size: 64, offset: 3072)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !910, file: !37, line: 218, baseType: !878, size: 64, offset: 3136)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !910, file: !37, line: 221, baseType: !968, size: 32, offset: 3200)
!968 = !DIDerivedType(tag: DW_TAG_typedef, name: "FilterTypes", file: !189, line: 66, baseType: !188)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "interlace", scope: !910, file: !37, line: 224, baseType: !866, size: 32, offset: 3232)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !910, file: !37, line: 227, baseType: !868, size: 32, offset: 3264)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !910, file: !37, line: 230, baseType: !972, size: 32, offset: 3296)
!972 = !DIDerivedType(tag: DW_TAG_typedef, name: "GravityType", file: !224, line: 91, baseType: !223)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !910, file: !37, line: 233, baseType: !974, size: 32, offset: 3328)
!974 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompositeOperator", file: !239, line: 99, baseType: !238)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "dispose", scope: !910, file: !37, line: 236, baseType: !976, size: 32, offset: 3360)
!976 = !DIDerivedType(tag: DW_TAG_typedef, name: "DisposeType", file: !310, line: 32, baseType: !309)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "clip_mask", scope: !910, file: !37, line: 239, baseType: !978, size: 64, offset: 3392)
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 64)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !910, file: !37, line: 242, baseType: !594, size: 64, offset: 3456)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !910, file: !37, line: 243, baseType: !594, size: 64, offset: 3520)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_second", scope: !910, file: !37, line: 246, baseType: !582, size: 64, offset: 3584)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "iterations", scope: !910, file: !37, line: 249, baseType: !594, size: 64, offset: 3648)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "total_colors", scope: !910, file: !37, line: 250, baseType: !594, size: 64, offset: 3712)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "start_loop", scope: !910, file: !37, line: 253, baseType: !582, size: 64, offset: 3776)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !910, file: !37, line: 256, baseType: !986, size: 192, offset: 3840)
!986 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErrorInfo", file: !987, line: 68, baseType: !988)
!987 = !DIFile(filename: "./magick/color.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!988 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ErrorInfo", file: !987, line: 62, size: 192, elements: !989)
!989 = !{!990, !991, !992}
!990 = !DIDerivedType(tag: DW_TAG_member, name: "mean_error_per_pixel", scope: !988, file: !987, line: 65, baseType: !878, size: 64)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_mean_error", scope: !988, file: !987, line: 66, baseType: !878, size: 64, offset: 64)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_maximum_error", scope: !988, file: !987, line: 67, baseType: !878, size: 64, offset: 128)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !910, file: !37, line: 259, baseType: !994, size: 512, offset: 4032)
!994 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerInfo", file: !318, line: 51, baseType: !995)
!995 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TimerInfo", file: !318, line: 40, size: 512, elements: !996)
!996 = !{!997, !1004, !1005, !1007}
!997 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !995, file: !318, line: 43, baseType: !998, size: 192)
!998 = !DIDerivedType(tag: DW_TAG_typedef, name: "Timer", file: !318, line: 38, baseType: !999)
!999 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Timer", file: !318, line: 32, size: 192, elements: !1000)
!1000 = !{!1001, !1002, !1003}
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !999, file: !318, line: 35, baseType: !878, size: 64)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !999, file: !318, line: 36, baseType: !878, size: 64, offset: 64)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !999, file: !318, line: 37, baseType: !878, size: 64, offset: 128)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "elapsed", scope: !995, file: !318, line: 44, baseType: !998, size: 192, offset: 192)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !995, file: !318, line: 47, baseType: !1006, size: 32, offset: 384)
!1006 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerState", file: !318, line: 30, baseType: !317)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !995, file: !318, line: 50, baseType: !594, size: 64, offset: 448)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !910, file: !37, line: 262, baseType: !1009, size: 64, offset: 4544)
!1009 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickProgressMonitor", file: !1010, line: 26, baseType: !1011)
!1010 = !DIFile(filename: "./magick/monitor.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64)
!1012 = !DISubroutineType(types: !1013)
!1013 = !{!589, !572, !1014, !1017, !564}
!1014 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1015)
!1015 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickOffsetType", file: !6, line: 150, baseType: !1016)
!1016 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!1017 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1018)
!1018 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickSizeType", file: !6, line: 151, baseType: !1019)
!1019 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !910, file: !37, line: 265, baseType: !564, size: 64, offset: 4608)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !910, file: !37, line: 266, baseType: !564, size: 64, offset: 4672)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !910, file: !37, line: 267, baseType: !564, size: 64, offset: 4736)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "ascii85", scope: !910, file: !37, line: 270, baseType: !1024, size: 64, offset: 4800)
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 64)
!1025 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ascii85Info", file: !12, line: 52, baseType: !1026)
!1026 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Ascii85Info", file: !12, line: 51, flags: DIFlagFwdDecl)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !910, file: !37, line: 273, baseType: !1028, size: 64, offset: 4864)
!1028 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1029, size: 64)
!1029 = !DIDerivedType(tag: DW_TAG_typedef, name: "BlobInfo", file: !6, line: 217, baseType: !1030)
!1030 = !DICompositeType(tag: DW_TAG_structure_type, name: "_BlobInfo", file: !6, line: 217, flags: DIFlagFwdDecl)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !910, file: !37, line: 276, baseType: !1032, size: 32768, offset: 4928)
!1032 = !DICompositeType(tag: DW_TAG_array_type, baseType: !574, size: 32768, elements: !1033)
!1033 = !{!1034}
!1034 = !DISubrange(count: 4096)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "magick_filename", scope: !910, file: !37, line: 277, baseType: !1032, size: 32768, offset: 37696)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !910, file: !37, line: 278, baseType: !1032, size: 32768, offset: 70464)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "magick_columns", scope: !910, file: !37, line: 281, baseType: !594, size: 64, offset: 103232)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "magick_rows", scope: !910, file: !37, line: 282, baseType: !594, size: 64, offset: 103296)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "exception", scope: !910, file: !37, line: 285, baseType: !1040, size: 448, offset: 103360)
!1040 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionInfo", file: !6, line: 219, baseType: !1041)
!1041 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ExceptionInfo", file: !324, line: 102, size: 448, elements: !1042)
!1042 = !{!1043, !1045, !1046, !1047, !1048, !1049, !1050, !1055}
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "severity", scope: !1041, file: !324, line: 105, baseType: !1044, size: 32)
!1044 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionType", file: !324, line: 100, baseType: !323)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "error_number", scope: !1041, file: !324, line: 108, baseType: !473, size: 32, offset: 32)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !1041, file: !324, line: 111, baseType: !590, size: 64, offset: 64)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !1041, file: !324, line: 112, baseType: !590, size: 64, offset: 128)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "exceptions", scope: !1041, file: !324, line: 115, baseType: !564, size: 64, offset: 192)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "relinquish", scope: !1041, file: !324, line: 118, baseType: !589, size: 32, offset: 256)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !1041, file: !324, line: 121, baseType: !1051, size: 64, offset: 320)
!1051 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1052, size: 64)
!1052 = !DIDerivedType(tag: DW_TAG_typedef, name: "SemaphoreInfo", file: !1053, line: 26, baseType: !1054)
!1053 = !DIFile(filename: "./magick/semaphore.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!1054 = !DICompositeType(tag: DW_TAG_structure_type, name: "SemaphoreInfo", file: !1053, line: 25, flags: DIFlagFwdDecl)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !1041, file: !324, line: 124, baseType: !594, size: 64, offset: 384)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !910, file: !37, line: 288, baseType: !589, size: 32, offset: 103808)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !910, file: !37, line: 291, baseType: !1058, size: 64, offset: 103872)
!1058 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !582)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !910, file: !37, line: 294, baseType: !1051, size: 64, offset: 103936)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "color_profile", scope: !910, file: !37, line: 297, baseType: !1061, size: 256, offset: 104000)
!1061 = !DIDerivedType(tag: DW_TAG_typedef, name: "ProfileInfo", file: !181, line: 40, baseType: !1062)
!1062 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ProfileInfo", file: !181, line: 27, size: 256, elements: !1063)
!1063 = !{!1064, !1065, !1066, !1068}
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1062, file: !181, line: 30, baseType: !590, size: 64)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1062, file: !181, line: 33, baseType: !594, size: 64, offset: 64)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !1062, file: !181, line: 36, baseType: !1067, size: 64, offset: 128)
!1067 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !1062, file: !181, line: 39, baseType: !594, size: 64, offset: 192)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "iptc_profile", scope: !910, file: !37, line: 298, baseType: !1061, size: 256, offset: 104256)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profile", scope: !910, file: !37, line: 299, baseType: !1071, size: 64, offset: 104512)
!1071 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1061, size: 64)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profiles", scope: !910, file: !37, line: 302, baseType: !594, size: 64, offset: 104576)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !910, file: !37, line: 305, baseType: !594, size: 64, offset: 104640)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !910, file: !37, line: 308, baseType: !978, size: 64, offset: 104704)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !910, file: !37, line: 309, baseType: !978, size: 64, offset: 104768)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !910, file: !37, line: 310, baseType: !978, size: 64, offset: 104832)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "interpolate", scope: !910, file: !37, line: 313, baseType: !1078, size: 32, offset: 104896)
!1078 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterpolatePixelMethod", file: !397, line: 47, baseType: !396)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "black_point_compensation", scope: !910, file: !37, line: 316, baseType: !589, size: 32, offset: 104928)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_color", scope: !910, file: !37, line: 319, baseType: !881, size: 64, offset: 104960)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !910, file: !37, line: 322, baseType: !978, size: 64, offset: 105024)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "tile_offset", scope: !910, file: !37, line: 325, baseType: !955, size: 256, offset: 105088)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !910, file: !37, line: 328, baseType: !564, size: 64, offset: 105344)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "artifacts", scope: !910, file: !37, line: 329, baseType: !564, size: 64, offset: 105408)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !910, file: !37, line: 332, baseType: !897, size: 32, offset: 105472)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !910, file: !37, line: 335, baseType: !589, size: 32, offset: 105504)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !910, file: !37, line: 338, baseType: !1018, size: 64, offset: 105536)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "ping", scope: !910, file: !37, line: 341, baseType: !589, size: 32, offset: 105600)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !910, file: !37, line: 344, baseType: !594, size: 64, offset: 105664)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !910, file: !37, line: 347, baseType: !1091, size: 64, offset: 105728)
!1091 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !1092, line: 7, baseType: !1093)
!1092 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "")
!1093 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !585, line: 160, baseType: !586)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "intensity", scope: !910, file: !37, line: 350, baseType: !1095, size: 32, offset: 105792)
!1095 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelIntensityMethod", file: !397, line: 79, baseType: !413)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !910, file: !37, line: 353, baseType: !594, size: 64, offset: 105856)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !848, file: !37, line: 443, baseType: !564, size: 64, offset: 2112)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !848, file: !37, line: 446, baseType: !1009, size: 64, offset: 2176)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !848, file: !37, line: 449, baseType: !564, size: 64, offset: 2240)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !848, file: !37, line: 450, baseType: !564, size: 64, offset: 2304)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !848, file: !37, line: 453, baseType: !1102, size: 64, offset: 2368)
!1102 = !DIDerivedType(tag: DW_TAG_typedef, name: "StreamHandler", file: !1103, line: 26, baseType: !1104)
!1103 = !DIFile(filename: "./magick/stream.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!1104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1105, size: 64)
!1105 = !DISubroutineType(types: !1106)
!1106 = !{!594, !1107, !1109, !1111}
!1107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1108, size: 64)
!1108 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !909)
!1109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1110, size: 64)
!1110 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1111 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !594)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !848, file: !37, line: 456, baseType: !596, size: 64, offset: 2432)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !848, file: !37, line: 459, baseType: !564, size: 64, offset: 2496)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !848, file: !37, line: 462, baseType: !594, size: 64, offset: 2560)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !848, file: !37, line: 465, baseType: !1032, size: 32768, offset: 2624)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "unique", scope: !848, file: !37, line: 466, baseType: !1032, size: 32768, offset: 35392)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "zero", scope: !848, file: !37, line: 467, baseType: !1032, size: 32768, offset: 68160)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !848, file: !37, line: 468, baseType: !1032, size: 32768, offset: 100928)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !848, file: !37, line: 471, baseType: !589, size: 32, offset: 133696)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "tile", scope: !848, file: !37, line: 474, baseType: !590, size: 64, offset: 133760)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "subimage", scope: !848, file: !37, line: 477, baseType: !594, size: 64, offset: 133824)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "subrange", scope: !848, file: !37, line: 478, baseType: !594, size: 64, offset: 133888)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "pen", scope: !848, file: !37, line: 481, baseType: !881, size: 64, offset: 133952)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !848, file: !37, line: 484, baseType: !594, size: 64, offset: 134016)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_pixel_method", scope: !848, file: !37, line: 487, baseType: !1126, size: 32, offset: 134080)
!1126 = !DIDerivedType(tag: DW_TAG_typedef, name: "VirtualPixelMethod", file: !426, line: 47, baseType: !425)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_color", scope: !848, file: !37, line: 490, baseType: !881, size: 64, offset: 134112)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !848, file: !37, line: 493, baseType: !564, size: 64, offset: 134208)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "synchronize", scope: !848, file: !37, line: 496, baseType: !589, size: 32, offset: 134272)
!1130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1131, size: 64)
!1131 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !847)
!1132 = !{}
!1133 = !DILocalVariable(name: "image_info", arg: 1, scope: !843, file: !3, line: 1692, type: !846)
!1134 = !DILocation(line: 1692, column: 61, scope: !843)
!1135 = !DILocalVariable(name: "clone_info", arg: 2, scope: !843, file: !3, line: 1693, type: !1130)
!1136 = !DILocation(line: 1693, column: 20, scope: !843)
!1137 = !DILocation(line: 1697, column: 7, scope: !1138)
!1138 = distinct !DILexicalBlock(scope: !843, file: !3, line: 1697, column: 7)
!1139 = !DILocation(line: 1697, column: 19, scope: !1138)
!1140 = !DILocation(line: 1697, column: 25, scope: !1138)
!1141 = !DILocation(line: 1697, column: 7, scope: !843)
!1142 = !DILocation(line: 1699, column: 7, scope: !1138)
!1143 = !DILocation(line: 1699, column: 19, scope: !1138)
!1144 = !DILocation(line: 1698, column: 12, scope: !1138)
!1145 = !DILocation(line: 1698, column: 5, scope: !1138)
!1146 = !DILocation(line: 1702, column: 7, scope: !1147)
!1147 = distinct !DILexicalBlock(scope: !843, file: !3, line: 1702, column: 7)
!1148 = !DILocation(line: 1702, column: 19, scope: !1147)
!1149 = !DILocation(line: 1702, column: 27, scope: !1147)
!1150 = !DILocation(line: 1702, column: 7, scope: !843)
!1151 = !DILocation(line: 1704, column: 11, scope: !1152)
!1152 = distinct !DILexicalBlock(scope: !1153, file: !3, line: 1704, column: 11)
!1153 = distinct !DILexicalBlock(scope: !1147, file: !3, line: 1703, column: 5)
!1154 = !DILocation(line: 1704, column: 23, scope: !1152)
!1155 = !DILocation(line: 1704, column: 31, scope: !1152)
!1156 = !DILocation(line: 1704, column: 11, scope: !1153)
!1157 = !DILocation(line: 1705, column: 29, scope: !1152)
!1158 = !DILocation(line: 1705, column: 9, scope: !1152)
!1159 = !DILocation(line: 1706, column: 60, scope: !1153)
!1160 = !DILocation(line: 1706, column: 72, scope: !1153)
!1161 = !DILocation(line: 1706, column: 42, scope: !1153)
!1162 = !DILocation(line: 1706, column: 27, scope: !1153)
!1163 = !DILocation(line: 1706, column: 7, scope: !1153)
!1164 = !DILocation(line: 1706, column: 19, scope: !1153)
!1165 = !DILocation(line: 1706, column: 26, scope: !1153)
!1166 = !DILocation(line: 1708, column: 5, scope: !1153)
!1167 = !DILocation(line: 1709, column: 3, scope: !843)
!1168 = distinct !DISubprogram(name: "DestroyImageOptions", scope: !3, file: !3, line: 1820, type: !1169, scopeLine: 1821, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !1132)
!1169 = !DISubroutineType(types: !1170)
!1170 = !{null, !846}
!1171 = !DILocalVariable(name: "image_info", arg: 1, scope: !1168, file: !3, line: 1820, type: !846)
!1172 = !DILocation(line: 1820, column: 50, scope: !1168)
!1173 = !DILocation(line: 1824, column: 7, scope: !1174)
!1174 = distinct !DILexicalBlock(scope: !1168, file: !3, line: 1824, column: 7)
!1175 = !DILocation(line: 1824, column: 19, scope: !1174)
!1176 = !DILocation(line: 1824, column: 25, scope: !1174)
!1177 = !DILocation(line: 1824, column: 7, scope: !1168)
!1178 = !DILocation(line: 1826, column: 7, scope: !1174)
!1179 = !DILocation(line: 1826, column: 19, scope: !1174)
!1180 = !DILocation(line: 1825, column: 12, scope: !1174)
!1181 = !DILocation(line: 1825, column: 5, scope: !1174)
!1182 = !DILocation(line: 1827, column: 7, scope: !1183)
!1183 = distinct !DILexicalBlock(scope: !1168, file: !3, line: 1827, column: 7)
!1184 = !DILocation(line: 1827, column: 19, scope: !1183)
!1185 = !DILocation(line: 1827, column: 27, scope: !1183)
!1186 = !DILocation(line: 1827, column: 7, scope: !1168)
!1187 = !DILocation(line: 1828, column: 60, scope: !1183)
!1188 = !DILocation(line: 1828, column: 72, scope: !1183)
!1189 = !DILocation(line: 1828, column: 42, scope: !1183)
!1190 = !DILocation(line: 1828, column: 25, scope: !1183)
