; ModuleID = 'magick/montage.c'
source_filename = "magick/montage.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._ImageInfo = type { i32, i32, i32, i32, i32, i32, i8*, i8*, i8*, i8*, i64, i64, i64, i32, i32, i32, i64, i8*, i8*, i8*, i8*, i8*, double, double, %struct._PixelPacket, %struct._PixelPacket, %struct._PixelPacket, i32, i32, i64, i32, i32, i32, i64, i32, i32, i8*, i8*, i32, %struct._Image*, i8*, i32 (i8*, i64, i64, i8*)*, i8*, i8*, i64 (%struct._Image*, i8*, i64)*, %struct._IO_FILE*, i8*, i64, [4096 x i8], [4096 x i8], [4096 x i8], [4096 x i8], i32, i8*, i64, i64, %struct._PixelPacket, i64, i32, %struct._PixelPacket, i8*, i32 }

!508 = !DIEnumerator(name: "UndefinedStyle", value: 0, isUnsigned: true)
!509 = !DIEnumerator(name: "NormalStyle", value: 1, isUnsigned: true)
!510 = !DIEnumerator(name: "ItalicStyle", value: 2, isUnsigned: true)
!511 = !DIEnumerator(name: "ObliqueStyle", value: 3, isUnsigned: true)
!512 = !DIEnumerator(name: "AnyStyle", value: 4, isUnsigned: true)
!513 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !506, line: 25, baseType: !5, size: 32, elements: !514)
!514 = !{!515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525}
!515 = !DIEnumerator(name: "UndefinedStretch", value: 0, isUnsigned: true)
!516 = !DIEnumerator(name: "NormalStretch", value: 1, isUnsigned: true)
!517 = !DIEnumerator(name: "UltraCondensedStretch", value: 2, isUnsigned: true)
!518 = !DIEnumerator(name: "ExtraCondensedStretch", value: 3, isUnsigned: true)
!519 = !DIEnumerator(name: "CondensedStretch", value: 4, isUnsigned: true)
!520 = !DIEnumerator(name: "SemiCondensedStretch", value: 5, isUnsigned: true)
!521 = !DIEnumerator(name: "SemiExpandedStretch", value: 6, isUnsigned: true)
!522 = !DIEnumerator(name: "ExpandedStretch", value: 7, isUnsigned: true)
!523 = !DIEnumerator(name: "ExtraExpandedStretch", value: 8, isUnsigned: true)
!524 = !DIEnumerator(name: "UltraExpandedStretch", value: 9, isUnsigned: true)
!525 = !DIEnumerator(name: "AnyStretch", value: 10, isUnsigned: true)
!526 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !470, line: 30, baseType: !5, size: 32, elements: !527)
!527 = !{!528, !529, !530, !531}
!528 = !DIEnumerator(name: "UndefinedAlign", value: 0, isUnsigned: true)
!529 = !DIEnumerator(name: "LeftAlign", value: 1, isUnsigned: true)
!530 = !DIEnumerator(name: "CenterAlign", value: 2, isUnsigned: true)
!531 = !DIEnumerator(name: "RightAlign", value: 3, isUnsigned: true)
!532 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !470, line: 38, baseType: !5, size: 32, elements: !533)
!533 = !{!534, !535, !536, !537}
!534 = !DIEnumerator(name: "UndefinedPathUnits", value: 0, isUnsigned: true)
!535 = !DIEnumerator(name: "UserSpace", value: 1, isUnsigned: true)
!536 = !DIEnumerator(name: "UserSpaceOnUse", value: 2, isUnsigned: true)
!537 = !DIEnumerator(name: "ObjectBoundingBox", value: 3, isUnsigned: true)
!538 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !470, line: 123, baseType: !5, size: 32, elements: !539)
!539 = !{!540, !541}
!540 = !DIEnumerator(name: "UndefinedReference", value: 0, isUnsigned: true)
!541 = !DIEnumerator(name: "GradientReference", value: 1, isUnsigned: true)
!542 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !470, line: 55, baseType: !5, size: 32, elements: !543)
!543 = !{!544, !545, !546}
!544 = !DIEnumerator(name: "UndefinedDirection", value: 0, isUnsigned: true)
!545 = !DIEnumerator(name: "RightToLeftDirection", value: 1, isUnsigned: true)
!546 = !DIEnumerator(name: "LeftToRightDirection", value: 2, isUnsigned: true)
!547 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !10, line: 25, baseType: !5, size: 32, elements: !548)
!548 = !{!549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574}
!549 = !DIEnumerator(name: "NoValue", value: 0, isUnsigned: true)
!550 = !DIEnumerator(name: "XValue", value: 1, isUnsigned: true)
!551 = !DIEnumerator(name: "XiValue", value: 1, isUnsigned: true)
!552 = !DIEnumerator(name: "YValue", value: 2, isUnsigned: true)
!553 = !DIEnumerator(name: "PsiValue", value: 2, isUnsigned: true)
!554 = !DIEnumerator(name: "WidthValue", value: 4, isUnsigned: true)
!555 = !DIEnumerator(name: "RhoValue", value: 4, isUnsigned: true)
!556 = !DIEnumerator(name: "HeightValue", value: 8, isUnsigned: true)
!557 = !DIEnumerator(name: "SigmaValue", value: 8, isUnsigned: true)
!558 = !DIEnumerator(name: "ChiValue", value: 16, isUnsigned: true)
!559 = !DIEnumerator(name: "XiNegative", value: 32, isUnsigned: true)
!560 = !DIEnumerator(name: "XNegative", value: 32, isUnsigned: true)
!561 = !DIEnumerator(name: "PsiNegative", value: 64, isUnsigned: true)
!562 = !DIEnumerator(name: "YNegative", value: 64, isUnsigned: true)
!563 = !DIEnumerator(name: "ChiNegative", value: 128, isUnsigned: true)
!564 = !DIEnumerator(name: "PercentValue", value: 4096, isUnsigned: true)
!565 = !DIEnumerator(name: "AspectValue", value: 8192, isUnsigned: true)
!566 = !DIEnumerator(name: "NormalizeValue", value: 8192, isUnsigned: true)
!567 = !DIEnumerator(name: "LessValue", value: 16384, isUnsigned: true)
!568 = !DIEnumerator(name: "GreaterValue", value: 32768, isUnsigned: true)
!569 = !DIEnumerator(name: "MinimumValue", value: 65536, isUnsigned: true)
!570 = !DIEnumerator(name: "CorrelateNormalizeValue", value: 65536, isUnsigned: true)
!571 = !DIEnumerator(name: "AreaValue", value: 131072, isUnsigned: true)
!572 = !DIEnumerator(name: "DecimalValue", value: 262144, isUnsigned: true)
!573 = !DIEnumerator(name: "SeparatorValue", value: 524288, isUnsigned: true)
!574 = !DIEnumerator(name: "AllValues", value: 2147483647, isUnsigned: true)
!575 = !{!576, !619, !594, !620, !582, !602, !621, !622, !670, !733, !741, !592, !590, !822, !738}
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64)
!577 = !DIDerivedType(tag: DW_TAG_typedef, name: "MontageInfo", file: !578, line: 70, baseType: !579)
!578 = !DIFile(filename: "./magick/montage.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!579 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MontageInfo", file: !578, line: 33, size: 33792, elements: !580)
!580 = !{!581, !584, !585, !586, !587, !588, !589, !591, !595, !597, !607, !608, !609, !610, !611, !613, !617, !618}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "geometry", scope: !579, file: !578, line: 36, baseType: !582, size: 64)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!583 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "tile", scope: !579, file: !578, line: 37, baseType: !582, size: 64, offset: 64)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !579, file: !578, line: 38, baseType: !582, size: 64, offset: 128)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !579, file: !578, line: 39, baseType: !582, size: 64, offset: 192)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "texture", scope: !579, file: !578, line: 40, baseType: !582, size: 64, offset: 256)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "font", scope: !579, file: !578, line: 41, baseType: !582, size: 64, offset: 320)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "pointsize", scope: !579, file: !578, line: 44, baseType: !590, size: 64, offset: 384)
!590 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "border_width", scope: !579, file: !578, line: 47, baseType: !592, size: 64, offset: 448)
!592 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !593, line: 46, baseType: !594)
!593 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!594 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "shadow", scope: !579, file: !578, line: 50, baseType: !596, size: 32, offset: 512)
!596 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickBooleanType", file: !4, line: 215, baseType: !3)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !579, file: !578, line: 53, baseType: !598, size: 64, offset: 544)
!598 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelPacket", file: !395, line: 148, baseType: !599)
!599 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PixelPacket", file: !395, line: 131, size: 64, elements: !600)
!600 = !{!601, !604, !605, !606}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !599, file: !395, line: 143, baseType: !602, size: 16)
!602 = !DIDerivedType(tag: DW_TAG_typedef, name: "Quantum", file: !4, line: 93, baseType: !603)
!603 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !599, file: !395, line: 144, baseType: !602, size: 16, offset: 16)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !599, file: !395, line: 145, baseType: !602, size: 16, offset: 32)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !599, file: !395, line: 146, baseType: !602, size: 16, offset: 48)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "stroke", scope: !579, file: !578, line: 54, baseType: !598, size: 64, offset: 608)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "background_color", scope: !579, file: !578, line: 55, baseType: !598, size: 64, offset: 672)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !579, file: !578, line: 56, baseType: !598, size: 64, offset: 736)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "matte_color", scope: !579, file: !578, line: 57, baseType: !598, size: 64, offset: 800)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !579, file: !578, line: 60, baseType: !612, size: 32, offset: 864)
!612 = !DIDerivedType(tag: DW_TAG_typedef, name: "GravityType", file: !10, line: 91, baseType: !9)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !579, file: !578, line: 63, baseType: !614, size: 32768, offset: 896)
!614 = !DICompositeType(tag: DW_TAG_array_type, baseType: !583, size: 32768, elements: !615)
!615 = !{!616}
!616 = !DISubrange(count: 4096)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !579, file: !578, line: 66, baseType: !596, size: 32, offset: 33664)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !579, file: !578, line: 69, baseType: !592, size: 64, offset: 33728)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!620 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 64)
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 64)
!623 = !DIDerivedType(tag: DW_TAG_typedef, name: "Image", file: !4, line: 221, baseType: !624)
!624 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Image", file: !50, line: 150, size: 105920, elements: !625)
!625 = !{!626, !628, !630, !632, !633, !635, !636, !637, !638, !639, !640, !641, !643, !644, !645, !646, !647, !661, !663, !664, !666, !667, !668, !669, !675, !676, !677, !685, !686, !687, !688, !689, !690, !692, !694, !696, !697, !699, !701, !703, !704, !705, !706, !707, !708, !709, !717, !732, !746, !747, !748, !749, !753, !757, !758, !759, !760, !761, !762, !779, !780, !782, !783, !793, !794, !796, !797, !798, !799, !800, !801, !803, !804, !805, !806, !807, !808, !809, !811, !812, !813, !814, !815, !819, !821}
!626 = !DIDerivedType(tag: DW_TAG_member, name: "storage_class", scope: !624, file: !50, line: 153, baseType: !627, size: 32)
!627 = !DIDerivedType(tag: DW_TAG_typedef, name: "ClassType", file: !4, line: 209, baseType: !188)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !624, file: !50, line: 156, baseType: !629, size: 32, offset: 32)
!629 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorspaceType", file: !83, line: 61, baseType: !82)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !624, file: !50, line: 159, baseType: !631, size: 32, offset: 64)
!631 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompressionType", file: !25, line: 49, baseType: !24)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !624, file: !50, line: 162, baseType: !592, size: 64, offset: 128)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !624, file: !50, line: 165, baseType: !634, size: 32, offset: 192)
!634 = !DIDerivedType(tag: DW_TAG_typedef, name: "OrientationType", file: !50, line: 86, baseType: !49)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "taint", scope: !624, file: !50, line: 168, baseType: !596, size: 32, offset: 224)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "matte", scope: !624, file: !50, line: 169, baseType: !596, size: 32, offset: 256)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !624, file: !50, line: 172, baseType: !592, size: 64, offset: 320)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !624, file: !50, line: 173, baseType: !592, size: 64, offset: 384)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !624, file: !50, line: 174, baseType: !592, size: 64, offset: 448)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !624, file: !50, line: 175, baseType: !592, size: 64, offset: 512)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "colormap", scope: !624, file: !50, line: 178, baseType: !642, size: 64, offset: 576)
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 64)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "background_color", scope: !624, file: !50, line: 179, baseType: !598, size: 64, offset: 640)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !624, file: !50, line: 180, baseType: !598, size: 64, offset: 704)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "matte_color", scope: !624, file: !50, line: 181, baseType: !598, size: 64, offset: 768)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !624, file: !50, line: 184, baseType: !590, size: 64, offset: 832)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "chromaticity", scope: !624, file: !50, line: 187, baseType: !648, size: 768, offset: 896)
!648 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChromaticityInfo", file: !50, line: 128, baseType: !649)
!649 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ChromaticityInfo", file: !50, line: 121, size: 768, elements: !650)
!650 = !{!651, !658, !659, !660}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "red_primary", scope: !649, file: !50, line: 124, baseType: !652, size: 192)
!652 = !DIDerivedType(tag: DW_TAG_typedef, name: "PrimaryInfo", file: !50, line: 101, baseType: !653)
!653 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PrimaryInfo", file: !50, line: 95, size: 192, elements: !654)
!654 = !{!655, !656, !657}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !653, file: !50, line: 98, baseType: !590, size: 64)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !653, file: !50, line: 99, baseType: !590, size: 64, offset: 64)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !653, file: !50, line: 100, baseType: !590, size: 64, offset: 128)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "green_primary", scope: !649, file: !50, line: 125, baseType: !652, size: 192, offset: 192)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "blue_primary", scope: !649, file: !50, line: 126, baseType: !652, size: 192, offset: 384)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "white_point", scope: !649, file: !50, line: 127, baseType: !652, size: 192, offset: 576)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "rendering_intent", scope: !624, file: !50, line: 190, baseType: !662, size: 32, offset: 1664)
!662 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderingIntent", file: !194, line: 49, baseType: !193)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !624, file: !50, line: 193, baseType: !619, size: 64, offset: 1728)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !624, file: !50, line: 196, baseType: !665, size: 32, offset: 1792)
!665 = !DIDerivedType(tag: DW_TAG_typedef, name: "ResolutionType", file: !50, line: 93, baseType: !77)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "montage", scope: !624, file: !50, line: 199, baseType: !582, size: 64, offset: 1856)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "directory", scope: !624, file: !50, line: 200, baseType: !582, size: 64, offset: 1920)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "geometry", scope: !624, file: !50, line: 201, baseType: !582, size: 64, offset: 1984)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !624, file: !50, line: 204, baseType: !670, size: 64, offset: 2048)
!670 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !671, line: 77, baseType: !672)
!671 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!672 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !673, line: 193, baseType: !674)
!673 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!674 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "x_resolution", scope: !624, file: !50, line: 207, baseType: !590, size: 64, offset: 2112)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "y_resolution", scope: !624, file: !50, line: 208, baseType: !590, size: 64, offset: 2176)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !624, file: !50, line: 211, baseType: !678, size: 256, offset: 2240)
!678 = !DIDerivedType(tag: DW_TAG_typedef, name: "RectangleInfo", file: !10, line: 130, baseType: !679)
!679 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_RectangleInfo", file: !10, line: 121, size: 256, elements: !680)
!680 = !{!681, !682, !683, !684}
!681 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !679, file: !10, line: 124, baseType: !592, size: 64)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !679, file: !10, line: 125, baseType: !592, size: 64, offset: 64)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !679, file: !10, line: 128, baseType: !670, size: 64, offset: 128)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !679, file: !10, line: 129, baseType: !670, size: 64, offset: 192)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "extract_info", scope: !624, file: !50, line: 212, baseType: !678, size: 256, offset: 2496)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "tile_info", scope: !624, file: !50, line: 213, baseType: !678, size: 256, offset: 2752)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "bias", scope: !624, file: !50, line: 216, baseType: !590, size: 64, offset: 3008)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "blur", scope: !624, file: !50, line: 217, baseType: !590, size: 64, offset: 3072)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !624, file: !50, line: 218, baseType: !590, size: 64, offset: 3136)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !624, file: !50, line: 221, baseType: !691, size: 32, offset: 3200)
!691 = !DIDerivedType(tag: DW_TAG_typedef, name: "FilterTypes", file: !202, line: 66, baseType: !201)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "interlace", scope: !624, file: !50, line: 224, baseType: !693, size: 32, offset: 3232)
!693 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterlaceType", file: !50, line: 73, baseType: !61)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !624, file: !50, line: 227, baseType: !695, size: 32, offset: 3264)
!695 = !DIDerivedType(tag: DW_TAG_typedef, name: "EndianType", file: !72, line: 35, baseType: !71)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !624, file: !50, line: 230, baseType: !612, size: 32, offset: 3296)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !624, file: !50, line: 233, baseType: !698, size: 32, offset: 3328)
!698 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompositeOperator", file: !237, line: 99, baseType: !236)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "dispose", scope: !624, file: !50, line: 236, baseType: !700, size: 32, offset: 3360)
!700 = !DIDerivedType(tag: DW_TAG_typedef, name: "DisposeType", file: !308, line: 32, baseType: !307)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "clip_mask", scope: !624, file: !50, line: 239, baseType: !702, size: 64, offset: 3392)
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 64)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !624, file: !50, line: 242, baseType: !592, size: 64, offset: 3456)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !624, file: !50, line: 243, baseType: !592, size: 64, offset: 3520)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_second", scope: !624, file: !50, line: 246, baseType: !670, size: 64, offset: 3584)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "iterations", scope: !624, file: !50, line: 249, baseType: !592, size: 64, offset: 3648)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "total_colors", scope: !624, file: !50, line: 250, baseType: !592, size: 64, offset: 3712)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "start_loop", scope: !624, file: !50, line: 253, baseType: !670, size: 64, offset: 3776)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !624, file: !50, line: 256, baseType: !710, size: 192, offset: 3840)
!710 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErrorInfo", file: !711, line: 68, baseType: !712)
!711 = !DIFile(filename: "./magick/color.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!712 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ErrorInfo", file: !711, line: 62, size: 192, elements: !713)
!713 = !{!714, !715, !716}
!714 = !DIDerivedType(tag: DW_TAG_member, name: "mean_error_per_pixel", scope: !712, file: !711, line: 65, baseType: !590, size: 64)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_mean_error", scope: !712, file: !711, line: 66, baseType: !590, size: 64, offset: 64)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_maximum_error", scope: !712, file: !711, line: 67, baseType: !590, size: 64, offset: 128)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !624, file: !50, line: 259, baseType: !718, size: 512, offset: 4032)
!718 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerInfo", file: !316, line: 51, baseType: !719)
!719 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TimerInfo", file: !316, line: 40, size: 512, elements: !720)
!720 = !{!721, !728, !729, !731}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !719, file: !316, line: 43, baseType: !722, size: 192)
!722 = !DIDerivedType(tag: DW_TAG_typedef, name: "Timer", file: !316, line: 38, baseType: !723)
!723 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Timer", file: !316, line: 32, size: 192, elements: !724)
!724 = !{!725, !726, !727}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !723, file: !316, line: 35, baseType: !590, size: 64)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !723, file: !316, line: 36, baseType: !590, size: 64, offset: 64)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !723, file: !316, line: 37, baseType: !590, size: 64, offset: 128)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "elapsed", scope: !719, file: !316, line: 44, baseType: !722, size: 192, offset: 192)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !719, file: !316, line: 47, baseType: !730, size: 32, offset: 384)
!730 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerState", file: !316, line: 30, baseType: !315)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !719, file: !316, line: 50, baseType: !592, size: 64, offset: 448)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !624, file: !50, line: 262, baseType: !733, size: 64, offset: 4544)
!733 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickProgressMonitor", file: !734, line: 26, baseType: !735)
!734 = !DIFile(filename: "./magick/monitor.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !736, size: 64)
!736 = !DISubroutineType(types: !737)
!737 = !{!596, !738, !740, !743, !619}
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 64)
!739 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !583)
!740 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !741)
!741 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickOffsetType", file: !4, line: 150, baseType: !742)
!742 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!743 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !744)
!744 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickSizeType", file: !4, line: 151, baseType: !745)
!745 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !624, file: !50, line: 265, baseType: !619, size: 64, offset: 4608)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !624, file: !50, line: 266, baseType: !619, size: 64, offset: 4672)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !624, file: !50, line: 267, baseType: !619, size: 64, offset: 4736)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "ascii85", scope: !624, file: !50, line: 270, baseType: !750, size: 64, offset: 4800)
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !751, size: 64)
!751 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ascii85Info", file: !25, line: 52, baseType: !752)
!752 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Ascii85Info", file: !25, line: 51, flags: DIFlagFwdDecl)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !624, file: !50, line: 273, baseType: !754, size: 64, offset: 4864)
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 64)
!755 = !DIDerivedType(tag: DW_TAG_typedef, name: "BlobInfo", file: !4, line: 217, baseType: !756)
!756 = !DICompositeType(tag: DW_TAG_structure_type, name: "_BlobInfo", file: !4, line: 217, flags: DIFlagFwdDecl)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !624, file: !50, line: 276, baseType: !614, size: 32768, offset: 4928)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "magick_filename", scope: !624, file: !50, line: 277, baseType: !614, size: 32768, offset: 37696)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !624, file: !50, line: 278, baseType: !614, size: 32768, offset: 70464)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "magick_columns", scope: !624, file: !50, line: 281, baseType: !592, size: 64, offset: 103232)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "magick_rows", scope: !624, file: !50, line: 282, baseType: !592, size: 64, offset: 103296)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "exception", scope: !624, file: !50, line: 285, baseType: !763, size: 448, offset: 103360)
!763 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionInfo", file: !4, line: 219, baseType: !764)
!764 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ExceptionInfo", file: !322, line: 102, size: 448, elements: !765)
!765 = !{!766, !768, !769, !770, !771, !772, !773, !778}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "severity", scope: !764, file: !322, line: 105, baseType: !767, size: 32)
!767 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionType", file: !322, line: 100, baseType: !321)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "error_number", scope: !764, file: !322, line: 108, baseType: !620, size: 32, offset: 32)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !764, file: !322, line: 111, baseType: !582, size: 64, offset: 64)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !764, file: !322, line: 112, baseType: !582, size: 64, offset: 128)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "exceptions", scope: !764, file: !322, line: 115, baseType: !619, size: 64, offset: 192)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "relinquish", scope: !764, file: !322, line: 118, baseType: !596, size: 32, offset: 256)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !764, file: !322, line: 121, baseType: !774, size: 64, offset: 320)
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 64)
!775 = !DIDerivedType(tag: DW_TAG_typedef, name: "SemaphoreInfo", file: !776, line: 26, baseType: !777)
!776 = !DIFile(filename: "./magick/semaphore.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!777 = !DICompositeType(tag: DW_TAG_structure_type, name: "SemaphoreInfo", file: !776, line: 25, flags: DIFlagFwdDecl)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !764, file: !322, line: 124, baseType: !592, size: 64, offset: 384)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !624, file: !50, line: 288, baseType: !596, size: 32, offset: 103808)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !624, file: !50, line: 291, baseType: !781, size: 64, offset: 103872)
!781 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !670)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !624, file: !50, line: 294, baseType: !774, size: 64, offset: 103936)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "color_profile", scope: !624, file: !50, line: 297, baseType: !784, size: 256, offset: 104000)
!784 = !DIDerivedType(tag: DW_TAG_typedef, name: "ProfileInfo", file: !194, line: 40, baseType: !785)
!785 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ProfileInfo", file: !194, line: 27, size: 256, elements: !786)
!786 = !{!787, !788, !789, !792}
!787 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !785, file: !194, line: 30, baseType: !582, size: 64)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !785, file: !194, line: 33, baseType: !592, size: 64, offset: 64)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !785, file: !194, line: 36, baseType: !790, size: 64, offset: 128)
!790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !791, size: 64)
!791 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !785, file: !194, line: 39, baseType: !592, size: 64, offset: 192)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "iptc_profile", scope: !624, file: !50, line: 298, baseType: !784, size: 256, offset: 104256)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profile", scope: !624, file: !50, line: 299, baseType: !795, size: 64, offset: 104512)
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !784, size: 64)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profiles", scope: !624, file: !50, line: 302, baseType: !592, size: 64, offset: 104576)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !624, file: !50, line: 305, baseType: !592, size: 64, offset: 104640)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !624, file: !50, line: 308, baseType: !702, size: 64, offset: 104704)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !624, file: !50, line: 309, baseType: !702, size: 64, offset: 104768)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !624, file: !50, line: 310, baseType: !702, size: 64, offset: 104832)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "interpolate", scope: !624, file: !50, line: 313, baseType: !802, size: 32, offset: 104896)
!802 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterpolatePixelMethod", file: !395, line: 47, baseType: !394)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "black_point_compensation", scope: !624, file: !50, line: 316, baseType: !596, size: 32, offset: 104928)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_color", scope: !624, file: !50, line: 319, baseType: !598, size: 64, offset: 104960)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !624, file: !50, line: 322, baseType: !702, size: 64, offset: 105024)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "tile_offset", scope: !624, file: !50, line: 325, baseType: !678, size: 256, offset: 105088)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !624, file: !50, line: 328, baseType: !619, size: 64, offset: 105344)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "artifacts", scope: !624, file: !50, line: 329, baseType: !619, size: 64, offset: 105408)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !624, file: !50, line: 332, baseType: !810, size: 32, offset: 105472)
!810 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageType", file: !50, line: 61, baseType: !119)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !624, file: !50, line: 335, baseType: !596, size: 32, offset: 105504)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !624, file: !50, line: 338, baseType: !744, size: 64, offset: 105536)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "ping", scope: !624, file: !50, line: 341, baseType: !596, size: 32, offset: 105600)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !624, file: !50, line: 344, baseType: !592, size: 64, offset: 105664)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !624, file: !50, line: 347, baseType: !816, size: 64, offset: 105728)
!816 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !817, line: 7, baseType: !818)
!817 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "")
!818 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !673, line: 160, baseType: !674)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "intensity", scope: !624, file: !50, line: 350, baseType: !820, size: 32, offset: 105792)
!820 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelIntensityMethod", file: !395, line: 79, baseType: !411)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !624, file: !50, line: 353, baseType: !592, size: 64, offset: 105856)
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !823, size: 64)
!823 = !DIDerivedType(tag: DW_TAG_typedef, name: "DrawInfo", file: !470, line: 333, baseType: !824)
!824 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DrawInfo", file: !470, line: 205, size: 5760, elements: !825)
!825 = !{!826, !827, !828, !829, !839, !840, !841, !842, !843, !892, !893, !894, !895, !896, !897, !899, !901, !903, !904, !905, !907, !908, !909, !910, !911, !912, !913, !915, !917, !918, !919, !920, !921, !923, !924, !925, !926, !928, !929, !930, !932, !933, !934, !946, !947, !948, !949, !950, !951}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "primitive", scope: !824, file: !470, line: 208, baseType: !582, size: 64)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "geometry", scope: !824, file: !470, line: 209, baseType: !582, size: 64, offset: 64)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "viewbox", scope: !824, file: !470, line: 212, baseType: !678, size: 256, offset: 128)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "affine", scope: !824, file: !470, line: 215, baseType: !830, size: 384, offset: 384)
!830 = !DIDerivedType(tag: DW_TAG_typedef, name: "AffineMatrix", file: !10, line: 102, baseType: !831)
!831 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_AffineMatrix", file: !10, line: 93, size: 384, elements: !832)
!832 = !{!833, !834, !835, !836, !837, !838}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !831, file: !10, line: 96, baseType: !590, size: 64)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "rx", scope: !831, file: !10, line: 97, baseType: !590, size: 64, offset: 64)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "ry", scope: !831, file: !10, line: 98, baseType: !590, size: 64, offset: 128)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !831, file: !10, line: 99, baseType: !590, size: 64, offset: 192)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "tx", scope: !831, file: !10, line: 100, baseType: !590, size: 64, offset: 256)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "ty", scope: !831, file: !10, line: 101, baseType: !590, size: 64, offset: 320)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !824, file: !470, line: 218, baseType: !612, size: 32, offset: 768)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !824, file: !470, line: 221, baseType: !598, size: 64, offset: 800)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "stroke", scope: !824, file: !470, line: 222, baseType: !598, size: 64, offset: 864)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "stroke_width", scope: !824, file: !470, line: 225, baseType: !590, size: 64, offset: 960)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "gradient", scope: !824, file: !470, line: 228, baseType: !844, size: 1024, offset: 1024)
!844 = !DIDerivedType(tag: DW_TAG_typedef, name: "GradientInfo", file: !470, line: 184, baseType: !845)
!845 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GradientInfo", file: !470, line: 153, size: 1024, elements: !846)
!846 = !{!847, !849, !850, !858, !880, !881, !883, !884, !885, !891}
!847 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !845, file: !470, line: 156, baseType: !848, size: 32)
!848 = !DIDerivedType(tag: DW_TAG_typedef, name: "GradientType", file: !470, line: 75, baseType: !469)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "bounding_box", scope: !845, file: !470, line: 159, baseType: !678, size: 256, offset: 64)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "gradient_vector", scope: !845, file: !470, line: 162, baseType: !851, size: 256, offset: 320)
!851 = !DIDerivedType(tag: DW_TAG_typedef, name: "SegmentInfo", file: !50, line: 110, baseType: !852)
!852 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SegmentInfo", file: !50, line: 103, size: 256, elements: !853)
!853 = !{!854, !855, !856, !857}
!854 = !DIDerivedType(tag: DW_TAG_member, name: "x1", scope: !852, file: !50, line: 106, baseType: !590, size: 64)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "y1", scope: !852, file: !50, line: 107, baseType: !590, size: 64, offset: 64)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "x2", scope: !852, file: !50, line: 108, baseType: !590, size: 64, offset: 128)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "y2", scope: !852, file: !50, line: 109, baseType: !590, size: 64, offset: 192)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "stops", scope: !845, file: !470, line: 165, baseType: !859, size: 64, offset: 576)
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !860, size: 64)
!860 = !DIDerivedType(tag: DW_TAG_typedef, name: "StopInfo", file: !470, line: 151, baseType: !861)
!861 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_StopInfo", file: !470, line: 144, size: 512, elements: !862)
!862 = !{!863, !879}
!863 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !861, file: !470, line: 147, baseType: !864, size: 448)
!864 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickPixelPacket", file: !395, line: 127, baseType: !865)
!865 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MagickPixelPacket", file: !395, line: 104, size: 448, elements: !866)
!866 = !{!867, !868, !869, !870, !871, !872, !875, !876, !877, !878}
!867 = !DIDerivedType(tag: DW_TAG_member, name: "storage_class", scope: !865, file: !395, line: 107, baseType: !627, size: 32)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !865, file: !395, line: 110, baseType: !629, size: 32, offset: 32)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "matte", scope: !865, file: !395, line: 113, baseType: !596, size: 32, offset: 64)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !865, file: !395, line: 116, baseType: !590, size: 64, offset: 128)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !865, file: !395, line: 119, baseType: !592, size: 64, offset: 192)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !865, file: !395, line: 122, baseType: !873, size: 32, offset: 256)
!873 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickRealType", file: !4, line: 78, baseType: !874)
!874 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !865, file: !395, line: 123, baseType: !873, size: 32, offset: 288)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !865, file: !395, line: 124, baseType: !873, size: 32, offset: 320)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !865, file: !395, line: 125, baseType: !873, size: 32, offset: 352)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !865, file: !395, line: 126, baseType: !873, size: 32, offset: 384)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !861, file: !470, line: 150, baseType: !873, size: 32, offset: 448)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "number_stops", scope: !845, file: !470, line: 168, baseType: !592, size: 64, offset: 640)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "spread", scope: !845, file: !470, line: 171, baseType: !882, size: 32, offset: 704)
!882 = !DIDerivedType(tag: DW_TAG_typedef, name: "SpreadMethod", file: !470, line: 135, baseType: !475)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !845, file: !470, line: 174, baseType: !596, size: 32, offset: 736)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !845, file: !470, line: 177, baseType: !592, size: 64, offset: 768)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "center", scope: !845, file: !470, line: 180, baseType: !886, size: 128, offset: 832)
!886 = !DIDerivedType(tag: DW_TAG_typedef, name: "PointInfo", file: !470, line: 142, baseType: !887)
!887 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PointInfo", file: !470, line: 137, size: 128, elements: !888)
!888 = !{!889, !890}
!889 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !887, file: !470, line: 140, baseType: !590, size: 64)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !887, file: !470, line: 141, baseType: !590, size: 64, offset: 64)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "radius", scope: !845, file: !470, line: 183, baseType: !873, size: 32, offset: 960)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "fill_pattern", scope: !824, file: !470, line: 231, baseType: !622, size: 64, offset: 2048)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "tile", scope: !824, file: !470, line: 232, baseType: !622, size: 64, offset: 2112)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "stroke_pattern", scope: !824, file: !470, line: 233, baseType: !622, size: 64, offset: 2176)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "stroke_antialias", scope: !824, file: !470, line: 236, baseType: !596, size: 32, offset: 2240)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "text_antialias", scope: !824, file: !470, line: 237, baseType: !596, size: 32, offset: 2272)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "fill_rule", scope: !824, file: !470, line: 240, baseType: !898, size: 32, offset: 2304)
!898 = !DIDerivedType(tag: DW_TAG_typedef, name: "FillRule", file: !470, line: 68, baseType: !481)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "linecap", scope: !824, file: !470, line: 243, baseType: !900, size: 32, offset: 2336)
!900 = !DIDerivedType(tag: DW_TAG_typedef, name: "LineCap", file: !470, line: 83, baseType: !486)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "linejoin", scope: !824, file: !470, line: 246, baseType: !902, size: 32, offset: 2368)
!902 = !DIDerivedType(tag: DW_TAG_typedef, name: "LineJoin", file: !470, line: 91, baseType: !492)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "miterlimit", scope: !824, file: !470, line: 249, baseType: !592, size: 64, offset: 2432)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "dash_offset", scope: !824, file: !470, line: 252, baseType: !590, size: 64, offset: 2496)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "decorate", scope: !824, file: !470, line: 255, baseType: !906, size: 32, offset: 2560)
!906 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecorationType", file: !470, line: 53, baseType: !498)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !824, file: !470, line: 258, baseType: !698, size: 32, offset: 2592)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !824, file: !470, line: 261, baseType: !582, size: 64, offset: 2624)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "face", scope: !824, file: !470, line: 264, baseType: !592, size: 64, offset: 2688)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "font", scope: !824, file: !470, line: 267, baseType: !582, size: 64, offset: 2752)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "metrics", scope: !824, file: !470, line: 268, baseType: !582, size: 64, offset: 2816)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !824, file: !470, line: 269, baseType: !582, size: 64, offset: 2880)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !824, file: !470, line: 272, baseType: !914, size: 32, offset: 2944)
!914 = !DIDerivedType(tag: DW_TAG_typedef, name: "StyleType", file: !506, line: 47, baseType: !505)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "stretch", scope: !824, file: !470, line: 275, baseType: !916, size: 32, offset: 2976)
!916 = !DIDerivedType(tag: DW_TAG_typedef, name: "StretchType", file: !506, line: 38, baseType: !513)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !824, file: !470, line: 278, baseType: !592, size: 64, offset: 3008)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !824, file: !470, line: 281, baseType: !582, size: 64, offset: 3072)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "pointsize", scope: !824, file: !470, line: 284, baseType: !590, size: 64, offset: 3136)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "density", scope: !824, file: !470, line: 287, baseType: !582, size: 64, offset: 3200)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !824, file: !470, line: 290, baseType: !922, size: 32, offset: 3264)
!922 = !DIDerivedType(tag: DW_TAG_typedef, name: "AlignType", file: !470, line: 36, baseType: !526)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "undercolor", scope: !824, file: !470, line: 293, baseType: !598, size: 64, offset: 3296)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !824, file: !470, line: 294, baseType: !598, size: 64, offset: 3360)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "server_name", scope: !824, file: !470, line: 297, baseType: !582, size: 64, offset: 3456)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "dash_pattern", scope: !824, file: !470, line: 300, baseType: !927, size: 64, offset: 3520)
!927 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 64)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "clip_mask", scope: !824, file: !470, line: 303, baseType: !582, size: 64, offset: 3584)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "bounds", scope: !824, file: !470, line: 306, baseType: !851, size: 256, offset: 3648)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "clip_units", scope: !824, file: !470, line: 309, baseType: !931, size: 32, offset: 3904)
!931 = !DIDerivedType(tag: DW_TAG_typedef, name: "ClipPathUnits", file: !470, line: 44, baseType: !532)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !824, file: !470, line: 312, baseType: !602, size: 16, offset: 3936)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "render", scope: !824, file: !470, line: 315, baseType: !596, size: 32, offset: 3968)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "element_reference", scope: !824, file: !470, line: 318, baseType: !935, size: 1344, offset: 4032)
!935 = !DIDerivedType(tag: DW_TAG_typedef, name: "ElementReference", file: !470, line: 203, baseType: !936)
!936 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ElementReference", file: !470, line: 186, size: 1344, elements: !937)
!937 = !{!938, !939, !941, !942, !943, !945}
!938 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !936, file: !470, line: 189, baseType: !582, size: 64)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !936, file: !470, line: 192, baseType: !940, size: 32, offset: 64)
!940 = !DIDerivedType(tag: DW_TAG_typedef, name: "ReferenceType", file: !470, line: 127, baseType: !538)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "gradient", scope: !936, file: !470, line: 195, baseType: !844, size: 1024, offset: 128)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !936, file: !470, line: 198, baseType: !592, size: 64, offset: 1152)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !936, file: !470, line: 201, baseType: !944, size: 64, offset: 1216)
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 64)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !936, file: !470, line: 202, baseType: !944, size: 64, offset: 1280)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !824, file: !470, line: 321, baseType: !596, size: 32, offset: 5376)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !824, file: !470, line: 324, baseType: !592, size: 64, offset: 5440)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "kerning", scope: !824, file: !470, line: 327, baseType: !590, size: 64, offset: 5504)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "interword_spacing", scope: !824, file: !470, line: 328, baseType: !590, size: 64, offset: 5568)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "interline_spacing", scope: !824, file: !470, line: 329, baseType: !590, size: 64, offset: 5632)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "direction", scope: !824, file: !470, line: 332, baseType: !952, size: 32, offset: 5696)
!952 = !DIDerivedType(tag: DW_TAG_typedef, name: "DirectionType", file: !470, line: 60, baseType: !542)
!953 = !{i32 7, !"Dwarf Version", i32 4}
!954 = !{i32 2, !"Debug Info Version", i32 3}
!955 = !{i32 1, !"wchar_size", i32 4}
!956 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!957 = distinct !DISubprogram(name: "CloneMontageInfo", scope: !1, file: !1, line: 101, type: !958, scopeLine: 103, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !1095)
!958 = !DISubroutineType(types: !959)
!959 = !{!576, !960, !1093}
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 64)
!961 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !962)
!962 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageInfo", file: !4, line: 223, baseType: !963)
!963 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ImageInfo", file: !50, line: 356, size: 134336, elements: !964)
!964 = !{!965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !999, !1000, !1001, !1002, !1003, !1004, !1006, !1007, !1008, !1009, !1010, !1011, !1022, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1090, !1091, !1092}
!965 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !963, file: !50, line: 359, baseType: !631, size: 32)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !963, file: !50, line: 362, baseType: !634, size: 32, offset: 32)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "temporary", scope: !963, file: !50, line: 365, baseType: !596, size: 32, offset: 64)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "adjoin", scope: !963, file: !50, line: 366, baseType: !596, size: 32, offset: 96)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "affirm", scope: !963, file: !50, line: 367, baseType: !596, size: 32, offset: 128)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "antialias", scope: !963, file: !50, line: 368, baseType: !596, size: 32, offset: 160)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !963, file: !50, line: 371, baseType: !582, size: 64, offset: 192)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "extract", scope: !963, file: !50, line: 372, baseType: !582, size: 64, offset: 256)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !963, file: !50, line: 373, baseType: !582, size: 64, offset: 320)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "scenes", scope: !963, file: !50, line: 374, baseType: !582, size: 64, offset: 384)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !963, file: !50, line: 377, baseType: !592, size: 64, offset: 448)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "number_scenes", scope: !963, file: !50, line: 378, baseType: !592, size: 64, offset: 512)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !963, file: !50, line: 379, baseType: !592, size: 64, offset: 576)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "interlace", scope: !963, file: !50, line: 382, baseType: !693, size: 32, offset: 640)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !963, file: !50, line: 385, baseType: !695, size: 32, offset: 672)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !963, file: !50, line: 388, baseType: !665, size: 32, offset: 704)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !963, file: !50, line: 391, baseType: !592, size: 64, offset: 768)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "sampling_factor", scope: !963, file: !50, line: 394, baseType: !582, size: 64, offset: 832)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "server_name", scope: !963, file: !50, line: 395, baseType: !582, size: 64, offset: 896)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "font", scope: !963, file: !50, line: 396, baseType: !582, size: 64, offset: 960)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "texture", scope: !963, file: !50, line: 397, baseType: !582, size: 64, offset: 1024)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "density", scope: !963, file: !50, line: 398, baseType: !582, size: 64, offset: 1088)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "pointsize", scope: !963, file: !50, line: 401, baseType: !590, size: 64, offset: 1152)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !963, file: !50, line: 402, baseType: !590, size: 64, offset: 1216)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "background_color", scope: !963, file: !50, line: 405, baseType: !598, size: 64, offset: 1280)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !963, file: !50, line: 406, baseType: !598, size: 64, offset: 1344)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "matte_color", scope: !963, file: !50, line: 407, baseType: !598, size: 64, offset: 1408)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !963, file: !50, line: 410, baseType: !596, size: 32, offset: 1472)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "monochrome", scope: !963, file: !50, line: 411, baseType: !596, size: 32, offset: 1504)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !963, file: !50, line: 414, baseType: !592, size: 64, offset: 1536)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !963, file: !50, line: 417, baseType: !629, size: 32, offset: 1600)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !963, file: !50, line: 420, baseType: !810, size: 32, offset: 1632)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "preview_type", scope: !963, file: !50, line: 423, baseType: !998, size: 32, offset: 1664)
!998 = !DIDerivedType(tag: DW_TAG_typedef, name: "PreviewType", file: !134, line: 59, baseType: !133)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !963, file: !50, line: 426, baseType: !670, size: 64, offset: 1728)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "ping", scope: !963, file: !50, line: 429, baseType: !596, size: 32, offset: 1792)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !963, file: !50, line: 430, baseType: !596, size: 32, offset: 1824)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !963, file: !50, line: 433, baseType: !582, size: 64, offset: 1856)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "authenticate", scope: !963, file: !50, line: 434, baseType: !582, size: 64, offset: 1920)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !963, file: !50, line: 437, baseType: !1005, size: 32, offset: 1984)
!1005 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChannelType", file: !4, line: 202, baseType: !166)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !963, file: !50, line: 440, baseType: !622, size: 64, offset: 2048)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !963, file: !50, line: 443, baseType: !619, size: 64, offset: 2112)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !963, file: !50, line: 446, baseType: !733, size: 64, offset: 2176)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !963, file: !50, line: 449, baseType: !619, size: 64, offset: 2240)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !963, file: !50, line: 450, baseType: !619, size: 64, offset: 2304)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !963, file: !50, line: 453, baseType: !1012, size: 64, offset: 2368)
!1012 = !DIDerivedType(tag: DW_TAG_typedef, name: "StreamHandler", file: !1013, line: 26, baseType: !1014)
!1013 = !DIFile(filename: "./magick/stream.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64)
!1015 = !DISubroutineType(types: !1016)
!1016 = !{!592, !1017, !1019, !1021}
!1017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1018, size: 64)
!1018 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !623)
!1019 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1020, size: 64)
!1020 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1021 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !592)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !963, file: !50, line: 456, baseType: !1023, size: 64, offset: 2432)
!1023 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1024, size: 64)
!1024 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !1025, line: 7, baseType: !1026)
!1025 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!1026 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !1027, line: 49, size: 1728, elements: !1028)
!1027 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!1028 = !{!1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1044, !1046, !1047, !1048, !1050, !1051, !1053, !1057, !1060, !1062, !1065, !1068, !1069, !1070, !1071, !1072}
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1026, file: !1027, line: 51, baseType: !620, size: 32)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1026, file: !1027, line: 54, baseType: !582, size: 64, offset: 64)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1026, file: !1027, line: 55, baseType: !582, size: 64, offset: 128)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1026, file: !1027, line: 56, baseType: !582, size: 64, offset: 192)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1026, file: !1027, line: 57, baseType: !582, size: 64, offset: 256)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1026, file: !1027, line: 58, baseType: !582, size: 64, offset: 320)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1026, file: !1027, line: 59, baseType: !582, size: 64, offset: 384)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1026, file: !1027, line: 60, baseType: !582, size: 64, offset: 448)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !1026, file: !1027, line: 61, baseType: !582, size: 64, offset: 512)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !1026, file: !1027, line: 64, baseType: !582, size: 64, offset: 576)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !1026, file: !1027, line: 65, baseType: !582, size: 64, offset: 640)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !1026, file: !1027, line: 66, baseType: !582, size: 64, offset: 704)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !1026, file: !1027, line: 68, baseType: !1042, size: 64, offset: 768)
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1043, size: 64)
!1043 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !1027, line: 36, flags: DIFlagFwdDecl)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !1026, file: !1027, line: 70, baseType: !1045, size: 64, offset: 832)
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1026, size: 64)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !1026, file: !1027, line: 72, baseType: !620, size: 32, offset: 896)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !1026, file: !1027, line: 73, baseType: !620, size: 32, offset: 928)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !1026, file: !1027, line: 74, baseType: !1049, size: 64, offset: 960)
!1049 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !673, line: 152, baseType: !674)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !1026, file: !1027, line: 77, baseType: !603, size: 16, offset: 1024)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !1026, file: !1027, line: 78, baseType: !1052, size: 8, offset: 1040)
!1052 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !1026, file: !1027, line: 79, baseType: !1054, size: 8, offset: 1048)
!1054 = !DICompositeType(tag: DW_TAG_array_type, baseType: !583, size: 8, elements: !1055)
!1055 = !{!1056}
!1056 = !DISubrange(count: 1)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !1026, file: !1027, line: 81, baseType: !1058, size: 64, offset: 1088)
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1059, size: 64)
!1059 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !1027, line: 43, baseType: null)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !1026, file: !1027, line: 89, baseType: !1061, size: 64, offset: 1152)
!1061 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !673, line: 153, baseType: !674)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !1026, file: !1027, line: 91, baseType: !1063, size: 64, offset: 1216)
!1063 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1064, size: 64)
!1064 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !1027, line: 37, flags: DIFlagFwdDecl)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !1026, file: !1027, line: 92, baseType: !1066, size: 64, offset: 1280)
!1066 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1067, size: 64)
!1067 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !1027, line: 38, flags: DIFlagFwdDecl)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !1026, file: !1027, line: 93, baseType: !1045, size: 64, offset: 1344)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !1026, file: !1027, line: 94, baseType: !619, size: 64, offset: 1408)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !1026, file: !1027, line: 95, baseType: !592, size: 64, offset: 1472)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !1026, file: !1027, line: 96, baseType: !620, size: 32, offset: 1536)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !1026, file: !1027, line: 98, baseType: !1073, size: 160, offset: 1568)
!1073 = !DICompositeType(tag: DW_TAG_array_type, baseType: !583, size: 160, elements: !1074)
!1074 = !{!1075}
!1075 = !DISubrange(count: 20)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !963, file: !50, line: 459, baseType: !619, size: 64, offset: 2496)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !963, file: !50, line: 462, baseType: !592, size: 64, offset: 2560)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !963, file: !50, line: 465, baseType: !614, size: 32768, offset: 2624)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "unique", scope: !963, file: !50, line: 466, baseType: !614, size: 32768, offset: 35392)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "zero", scope: !963, file: !50, line: 467, baseType: !614, size: 32768, offset: 68160)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !963, file: !50, line: 468, baseType: !614, size: 32768, offset: 100928)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !963, file: !50, line: 471, baseType: !596, size: 32, offset: 133696)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "tile", scope: !963, file: !50, line: 474, baseType: !582, size: 64, offset: 133760)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "subimage", scope: !963, file: !50, line: 477, baseType: !592, size: 64, offset: 133824)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "subrange", scope: !963, file: !50, line: 478, baseType: !592, size: 64, offset: 133888)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "pen", scope: !963, file: !50, line: 481, baseType: !598, size: 64, offset: 133952)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !963, file: !50, line: 484, baseType: !592, size: 64, offset: 134016)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_pixel_method", scope: !963, file: !50, line: 487, baseType: !1089, size: 32, offset: 134080)
!1089 = !DIDerivedType(tag: DW_TAG_typedef, name: "VirtualPixelMethod", file: !424, line: 47, baseType: !423)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_color", scope: !963, file: !50, line: 490, baseType: !598, size: 64, offset: 134112)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !963, file: !50, line: 493, baseType: !619, size: 64, offset: 134208)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "synchronize", scope: !963, file: !50, line: 496, baseType: !596, size: 32, offset: 134272)
!1093 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1094, size: 64)
!1094 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !577)
!1095 = !{}
!1096 = !DILocalVariable(name: "image_info", arg: 1, scope: !957, file: !1, line: 101, type: !960)
!1097 = !DILocation(line: 101, column: 61, scope: !957)
!1098 = !DILocalVariable(name: "montage_info", arg: 2, scope: !957, file: !1, line: 102, type: !1093)
!1099 = !DILocation(line: 102, column: 22, scope: !957)
!1100 = !DILocalVariable(name: "clone_info", scope: !957, file: !1, line: 105, type: !576)
!1101 = !DILocation(line: 105, column: 6, scope: !957)
!1102 = !DILocation(line: 107, column: 30, scope: !957)
!1103 = !DILocation(line: 107, column: 14, scope: !957)
!1104 = !DILocation(line: 107, column: 13, scope: !957)
!1105 = !DILocation(line: 108, column: 7, scope: !1106)
!1106 = distinct !DILexicalBlock(scope: !957, file: !1, line: 108, column: 7)
!1107 = !DILocation(line: 108, column: 18, scope: !1106)
!1108 = !DILocation(line: 108, column: 7, scope: !957)
!1109 = !DILocalVariable(name: "message", scope: !1110, file: !1, line: 109, type: !582)
!1110 = distinct !DILexicalBlock(scope: !1106, file: !1, line: 109, column: 5)
!1111 = !DILocation(line: 109, column: 5, scope: !1110)
!1112 = !DILocalVariable(name: "exception", scope: !1110, file: !1, line: 109, type: !763)
!1113 = !DILocation(line: 110, column: 18, scope: !957)
!1114 = !DILocation(line: 110, column: 29, scope: !957)
!1115 = !DILocation(line: 110, column: 3, scope: !957)
!1116 = !DILocation(line: 111, column: 7, scope: !1117)
!1117 = distinct !DILexicalBlock(scope: !957, file: !1, line: 111, column: 7)
!1118 = !DILocation(line: 111, column: 20, scope: !1117)
!1119 = !DILocation(line: 111, column: 7, scope: !957)
!1120 = !DILocation(line: 112, column: 12, scope: !1117)
!1121 = !DILocation(line: 112, column: 5, scope: !1117)
!1122 = !DILocation(line: 113, column: 7, scope: !1123)
!1123 = distinct !DILexicalBlock(scope: !957, file: !1, line: 113, column: 7)
!1124 = !DILocation(line: 113, column: 21, scope: !1123)
!1125 = !DILocation(line: 113, column: 30, scope: !1123)
!1126 = !DILocation(line: 113, column: 7, scope: !957)
!1127 = !DILocation(line: 114, column: 40, scope: !1123)
!1128 = !DILocation(line: 114, column: 54, scope: !1123)
!1129 = !DILocation(line: 114, column: 26, scope: !1123)
!1130 = !DILocation(line: 114, column: 5, scope: !1123)
!1131 = !DILocation(line: 114, column: 17, scope: !1123)
!1132 = !DILocation(line: 114, column: 25, scope: !1123)
!1133 = !DILocation(line: 115, column: 7, scope: !1134)
!1134 = distinct !DILexicalBlock(scope: !957, file: !1, line: 115, column: 7)
!1135 = !DILocation(line: 115, column: 21, scope: !1134)
!1136 = !DILocation(line: 115, column: 26, scope: !1134)
!1137 = !DILocation(line: 115, column: 7, scope: !957)
!1138 = !DILocation(line: 116, column: 36, scope: !1134)
!1139 = !DILocation(line: 116, column: 50, scope: !1134)
!1140 = !DILocation(line: 116, column: 22, scope: !1134)
!1141 = !DILocation(line: 116, column: 5, scope: !1134)
!1142 = !DILocation(line: 116, column: 17, scope: !1134)
!1143 = !DILocation(line: 116, column: 21, scope: !1134)
!1144 = !DILocation(line: 117, column: 7, scope: !1145)
!1145 = distinct !DILexicalBlock(scope: !957, file: !1, line: 117, column: 7)
!1146 = !DILocation(line: 117, column: 21, scope: !1145)
!1147 = !DILocation(line: 117, column: 27, scope: !1145)
!1148 = !DILocation(line: 117, column: 7, scope: !957)
!1149 = !DILocation(line: 118, column: 37, scope: !1145)
!1150 = !DILocation(line: 118, column: 51, scope: !1145)
!1151 = !DILocation(line: 118, column: 23, scope: !1145)
!1152 = !DILocation(line: 118, column: 5, scope: !1145)
!1153 = !DILocation(line: 118, column: 17, scope: !1145)
!1154 = !DILocation(line: 118, column: 22, scope: !1145)
!1155 = !DILocation(line: 119, column: 7, scope: !1156)
!1156 = distinct !DILexicalBlock(scope: !957, file: !1, line: 119, column: 7)
!1157 = !DILocation(line: 119, column: 21, scope: !1156)
!1158 = !DILocation(line: 119, column: 27, scope: !1156)
!1159 = !DILocation(line: 119, column: 7, scope: !957)
!1160 = !DILocation(line: 120, column: 37, scope: !1156)
!1161 = !DILocation(line: 120, column: 51, scope: !1156)
!1162 = !DILocation(line: 120, column: 23, scope: !1156)
!1163 = !DILocation(line: 120, column: 5, scope: !1156)
!1164 = !DILocation(line: 120, column: 17, scope: !1156)
!1165 = !DILocation(line: 120, column: 22, scope: !1156)
!1166 = !DILocation(line: 121, column: 7, scope: !1167)
!1167 = distinct !DILexicalBlock(scope: !957, file: !1, line: 121, column: 7)
!1168 = !DILocation(line: 121, column: 21, scope: !1167)
!1169 = !DILocation(line: 121, column: 29, scope: !1167)
!1170 = !DILocation(line: 121, column: 7, scope: !957)
!1171 = !DILocation(line: 122, column: 39, scope: !1167)
!1172 = !DILocation(line: 122, column: 53, scope: !1167)
!1173 = !DILocation(line: 122, column: 25, scope: !1167)
!1174 = !DILocation(line: 122, column: 5, scope: !1167)
!1175 = !DILocation(line: 122, column: 17, scope: !1167)
!1176 = !DILocation(line: 122, column: 24, scope: !1167)
!1177 = !DILocation(line: 123, column: 7, scope: !1178)
!1178 = distinct !DILexicalBlock(scope: !957, file: !1, line: 123, column: 7)
!1179 = !DILocation(line: 123, column: 21, scope: !1178)
!1180 = !DILocation(line: 123, column: 26, scope: !1178)
!1181 = !DILocation(line: 123, column: 7, scope: !957)
!1182 = !DILocation(line: 124, column: 36, scope: !1178)
!1183 = !DILocation(line: 124, column: 50, scope: !1178)
!1184 = !DILocation(line: 124, column: 22, scope: !1178)
!1185 = !DILocation(line: 124, column: 5, scope: !1178)
!1186 = !DILocation(line: 124, column: 17, scope: !1178)
!1187 = !DILocation(line: 124, column: 21, scope: !1178)
!1188 = !DILocation(line: 125, column: 25, scope: !957)
!1189 = !DILocation(line: 125, column: 39, scope: !957)
!1190 = !DILocation(line: 125, column: 3, scope: !957)
!1191 = !DILocation(line: 125, column: 15, scope: !957)
!1192 = !DILocation(line: 125, column: 24, scope: !957)
!1193 = !DILocation(line: 126, column: 28, scope: !957)
!1194 = !DILocation(line: 126, column: 42, scope: !957)
!1195 = !DILocation(line: 126, column: 3, scope: !957)
!1196 = !DILocation(line: 126, column: 15, scope: !957)
!1197 = !DILocation(line: 126, column: 27, scope: !957)
!1198 = !DILocation(line: 127, column: 22, scope: !957)
!1199 = !DILocation(line: 127, column: 36, scope: !957)
!1200 = !DILocation(line: 127, column: 3, scope: !957)
!1201 = !DILocation(line: 127, column: 15, scope: !957)
!1202 = !DILocation(line: 127, column: 21, scope: !957)
!1203 = !DILocation(line: 128, column: 3, scope: !957)
!1204 = !DILocation(line: 128, column: 15, scope: !957)
!1205 = !DILocation(line: 128, column: 20, scope: !957)
!1206 = !DILocation(line: 128, column: 34, scope: !957)
!1207 = !DILocation(line: 129, column: 3, scope: !957)
!1208 = !DILocation(line: 129, column: 15, scope: !957)
!1209 = !DILocation(line: 129, column: 22, scope: !957)
!1210 = !DILocation(line: 129, column: 36, scope: !957)
!1211 = !DILocation(line: 130, column: 3, scope: !957)
!1212 = !DILocation(line: 130, column: 15, scope: !957)
!1213 = !DILocation(line: 130, column: 32, scope: !957)
!1214 = !DILocation(line: 130, column: 46, scope: !957)
!1215 = !DILocation(line: 131, column: 3, scope: !957)
!1216 = !DILocation(line: 131, column: 15, scope: !957)
!1217 = !DILocation(line: 131, column: 28, scope: !957)
!1218 = !DILocation(line: 131, column: 42, scope: !957)
!1219 = !DILocation(line: 132, column: 3, scope: !957)
!1220 = !DILocation(line: 132, column: 15, scope: !957)
!1221 = !DILocation(line: 132, column: 27, scope: !957)
!1222 = !DILocation(line: 132, column: 41, scope: !957)
!1223 = !DILocation(line: 133, column: 23, scope: !957)
!1224 = !DILocation(line: 133, column: 37, scope: !957)
!1225 = !DILocation(line: 133, column: 3, scope: !957)
!1226 = !DILocation(line: 133, column: 15, scope: !957)
!1227 = !DILocation(line: 133, column: 22, scope: !957)
!1228 = !DILocation(line: 134, column: 27, scope: !957)
!1229 = !DILocation(line: 134, column: 39, scope: !957)
!1230 = !DILocation(line: 134, column: 48, scope: !957)
!1231 = !DILocation(line: 134, column: 62, scope: !957)
!1232 = !DILocation(line: 134, column: 10, scope: !957)
!1233 = !DILocation(line: 136, column: 21, scope: !957)
!1234 = !DILocation(line: 136, column: 3, scope: !957)
!1235 = !DILocation(line: 136, column: 15, scope: !957)
!1236 = !DILocation(line: 136, column: 20, scope: !957)
!1237 = !DILocation(line: 137, column: 10, scope: !957)
!1238 = !DILocation(line: 137, column: 3, scope: !957)
!1239 = !DILocation(line: 138, column: 1, scope: !957)
!1240 = distinct !DISubprogram(name: "GetMontageInfo", scope: !1, file: !1, line: 213, type: !1241, scopeLine: 215, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !1095)
!1241 = !DISubroutineType(types: !1242)
!1242 = !{null, !960, !576}
!1243 = !DILocalVariable(name: "image_info", arg: 1, scope: !1240, file: !1, line: 213, type: !960)
!1244 = !DILocation(line: 213, column: 51, scope: !1240)
!1245 = !DILocalVariable(name: "montage_info", arg: 2, scope: !1240, file: !1, line: 214, type: !576)
!1246 = !DILocation(line: 214, column: 16, scope: !1240)
!1247 = !DILocation(line: 218, column: 7, scope: !1248)
!1248 = distinct !DILexicalBlock(scope: !1240, file: !1, line: 218, column: 7)
!1249 = !DILocation(line: 218, column: 19, scope: !1248)
!1250 = !DILocation(line: 218, column: 25, scope: !1248)
!1251 = !DILocation(line: 218, column: 7, scope: !1240)
!1252 = !DILocation(line: 220, column: 7, scope: !1248)
!1253 = !DILocation(line: 220, column: 19, scope: !1248)
!1254 = !DILocation(line: 219, column: 12, scope: !1248)
!1255 = !DILocation(line: 219, column: 5, scope: !1248)
!1256 = !DILocation(line: 222, column: 28, scope: !1240)
!1257 = !DILocation(line: 222, column: 10, scope: !1240)
!1258 = !DILocation(line: 223, column: 27, scope: !1240)
!1259 = !DILocation(line: 223, column: 41, scope: !1240)
!1260 = !DILocation(line: 223, column: 50, scope: !1240)
!1261 = !DILocation(line: 223, column: 62, scope: !1240)
!1262 = !DILocation(line: 223, column: 10, scope: !1240)
!1263 = !DILocation(line: 225, column: 26, scope: !1240)
!1264 = !DILocation(line: 225, column: 3, scope: !1240)
!1265 = !DILocation(line: 225, column: 17, scope: !1240)
!1266 = !DILocation(line: 225, column: 25, scope: !1240)
!1267 = !DILocation(line: 226, column: 7, scope: !1268)
!1268 = distinct !DILexicalBlock(scope: !1240, file: !1, line: 226, column: 7)
!1269 = !DILocation(line: 226, column: 19, scope: !1268)
!1270 = !DILocation(line: 226, column: 24, scope: !1268)
!1271 = !DILocation(line: 226, column: 7, scope: !1240)
!1272 = !DILocation(line: 227, column: 38, scope: !1268)
!1273 = !DILocation(line: 227, column: 50, scope: !1268)
!1274 = !DILocation(line: 227, column: 24, scope: !1268)
!1275 = !DILocation(line: 227, column: 5, scope: !1268)
!1276 = !DILocation(line: 227, column: 19, scope: !1268)
!1277 = !DILocation(line: 227, column: 23, scope: !1268)
!1278 = !DILocation(line: 228, column: 3, scope: !1240)
!1279 = !DILocation(line: 228, column: 17, scope: !1240)
!1280 = !DILocation(line: 228, column: 24, scope: !1240)
!1281 = !DILocation(line: 229, column: 27, scope: !1240)
!1282 = !DILocation(line: 229, column: 39, scope: !1240)
!1283 = !DILocation(line: 229, column: 3, scope: !1240)
!1284 = !DILocation(line: 229, column: 17, scope: !1240)
!1285 = !DILocation(line: 229, column: 26, scope: !1240)
!1286 = !DILocation(line: 230, column: 3, scope: !1240)
!1287 = !DILocation(line: 230, column: 17, scope: !1240)
!1288 = !DILocation(line: 230, column: 22, scope: !1240)
!1289 = !DILocation(line: 230, column: 29, scope: !1240)
!1290 = !DILocation(line: 231, column: 3, scope: !1240)
!1291 = !DILocation(line: 231, column: 17, scope: !1240)
!1292 = !DILocation(line: 231, column: 24, scope: !1240)
!1293 = !DILocation(line: 231, column: 31, scope: !1240)
!1294 = !DILocation(line: 232, column: 3, scope: !1240)
!1295 = !DILocation(line: 232, column: 17, scope: !1240)
!1296 = !DILocation(line: 232, column: 34, scope: !1240)
!1297 = !DILocation(line: 232, column: 46, scope: !1240)
!1298 = !DILocation(line: 233, column: 3, scope: !1240)
!1299 = !DILocation(line: 233, column: 17, scope: !1240)
!1300 = !DILocation(line: 233, column: 30, scope: !1240)
!1301 = !DILocation(line: 233, column: 42, scope: !1240)
!1302 = !DILocation(line: 234, column: 3, scope: !1240)
!1303 = !DILocation(line: 234, column: 17, scope: !1240)
!1304 = !DILocation(line: 234, column: 29, scope: !1240)
!1305 = !DILocation(line: 234, column: 41, scope: !1240)
!1306 = !DILocation(line: 235, column: 23, scope: !1240)
!1307 = !DILocation(line: 235, column: 3, scope: !1240)
!1308 = !DILocation(line: 235, column: 17, scope: !1240)
!1309 = !DILocation(line: 235, column: 22, scope: !1240)
!1310 = !DILocation(line: 236, column: 3, scope: !1240)
!1311 = !DILocation(line: 236, column: 17, scope: !1240)
!1312 = !DILocation(line: 236, column: 26, scope: !1240)
!1313 = !DILocation(line: 237, column: 1, scope: !1240)
!1314 = distinct !DISubprogram(name: "DestroyMontageInfo", scope: !1, file: !1, line: 163, type: !1315, scopeLine: 164, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !1095)
!1315 = !DISubroutineType(types: !1316)
!1316 = !{!576, !576}
!1317 = !DILocalVariable(name: "montage_info", arg: 1, scope: !1314, file: !1, line: 163, type: !576)
!1318 = !DILocation(line: 163, column: 59, scope: !1314)
!1319 = !DILocation(line: 165, column: 7, scope: !1320)
!1320 = distinct !DILexicalBlock(scope: !1314, file: !1, line: 165, column: 7)
!1321 = !DILocation(line: 165, column: 21, scope: !1320)
!1322 = !DILocation(line: 165, column: 27, scope: !1320)
!1323 = !DILocation(line: 165, column: 7, scope: !1314)
!1324 = !DILocation(line: 166, column: 12, scope: !1320)
!1325 = !DILocation(line: 166, column: 5, scope: !1320)
!1326 = !DILocation(line: 169, column: 7, scope: !1327)
!1327 = distinct !DILexicalBlock(scope: !1314, file: !1, line: 169, column: 7)
!1328 = !DILocation(line: 169, column: 21, scope: !1327)
!1329 = !DILocation(line: 169, column: 30, scope: !1327)
!1330 = !DILocation(line: 169, column: 7, scope: !1314)
!1331 = !DILocation(line: 171, column: 30, scope: !1327)
!1332 = !DILocation(line: 171, column: 44, scope: !1327)
!1333 = !DILocation(line: 171, column: 7, scope: !1327)
!1334 = !DILocation(line: 170, column: 5, scope: !1327)
!1335 = !DILocation(line: 170, column: 19, scope: !1327)
!1336 = !DILocation(line: 170, column: 27, scope: !1327)
!1337 = !DILocation(line: 172, column: 7, scope: !1338)
!1338 = distinct !DILexicalBlock(scope: !1314, file: !1, line: 172, column: 7)
!1339 = !DILocation(line: 172, column: 21, scope: !1338)
!1340 = !DILocation(line: 172, column: 26, scope: !1338)
!1341 = !DILocation(line: 172, column: 7, scope: !1314)
!1342 = !DILocation(line: 173, column: 38, scope: !1338)
!1343 = !DILocation(line: 173, column: 52, scope: !1338)
!1344 = !DILocation(line: 173, column: 24, scope: !1338)
!1345 = !DILocation(line: 173, column: 5, scope: !1338)
!1346 = !DILocation(line: 173, column: 19, scope: !1338)
!1347 = !DILocation(line: 173, column: 23, scope: !1338)
!1348 = !DILocation(line: 174, column: 7, scope: !1349)
!1349 = distinct !DILexicalBlock(scope: !1314, file: !1, line: 174, column: 7)
!1350 = !DILocation(line: 174, column: 21, scope: !1349)
!1351 = !DILocation(line: 174, column: 27, scope: !1349)
!1352 = !DILocation(line: 174, column: 7, scope: !1314)
!1353 = !DILocation(line: 175, column: 39, scope: !1349)
!1354 = !DILocation(line: 175, column: 53, scope: !1349)
!1355 = !DILocation(line: 175, column: 25, scope: !1349)
!1356 = !DILocation(line: 175, column: 5, scope: !1349)
!1357 = !DILocation(line: 175, column: 19, scope: !1349)
!1358 = !DILocation(line: 175, column: 24, scope: !1349)
!1359 = !DILocation(line: 176, column: 7, scope: !1360)
!1360 = distinct !DILexicalBlock(scope: !1314, file: !1, line: 176, column: 7)
!1361 = !DILocation(line: 176, column: 21, scope: !1360)
!1362 = !DILocation(line: 176, column: 27, scope: !1360)
!1363 = !DILocation(line: 176, column: 7, scope: !1314)
!1364 = !DILocation(line: 177, column: 39, scope: !1360)
!1365 = !DILocation(line: 177, column: 53, scope: !1360)
!1366 = !DILocation(line: 177, column: 25, scope: !1360)
!1367 = !DILocation(line: 177, column: 5, scope: !1360)
!1368 = !DILocation(line: 177, column: 19, scope: !1360)
!1369 = !DILocation(line: 177, column: 24, scope: !1360)
!1370 = !DILocation(line: 178, column: 7, scope: !1371)
!1371 = distinct !DILexicalBlock(scope: !1314, file: !1, line: 178, column: 7)
!1372 = !DILocation(line: 178, column: 21, scope: !1371)
!1373 = !DILocation(line: 178, column: 29, scope: !1371)
!1374 = !DILocation(line: 178, column: 7, scope: !1314)
!1375 = !DILocation(line: 180, column: 7, scope: !1371)
!1376 = !DILocation(line: 180, column: 21, scope: !1371)
!1377 = !DILocation(line: 179, column: 36, scope: !1371)
!1378 = !DILocation(line: 179, column: 5, scope: !1371)
!1379 = !DILocation(line: 179, column: 19, scope: !1371)
!1380 = !DILocation(line: 179, column: 26, scope: !1371)
!1381 = !DILocation(line: 181, column: 7, scope: !1382)
!1382 = distinct !DILexicalBlock(scope: !1314, file: !1, line: 181, column: 7)
!1383 = !DILocation(line: 181, column: 21, scope: !1382)
!1384 = !DILocation(line: 181, column: 26, scope: !1382)
!1385 = !DILocation(line: 181, column: 7, scope: !1314)
!1386 = !DILocation(line: 182, column: 38, scope: !1382)
!1387 = !DILocation(line: 182, column: 52, scope: !1382)
!1388 = !DILocation(line: 182, column: 24, scope: !1382)
!1389 = !DILocation(line: 182, column: 5, scope: !1382)
!1390 = !DILocation(line: 182, column: 19, scope: !1382)
!1391 = !DILocation(line: 182, column: 23, scope: !1382)
!1392 = !DILocation(line: 183, column: 3, scope: !1314)
!1393 = !DILocation(line: 183, column: 17, scope: !1314)
!1394 = !DILocation(line: 183, column: 26, scope: !1314)
!1395 = !DILocation(line: 184, column: 55, scope: !1314)
!1396 = !DILocation(line: 184, column: 32, scope: !1314)
!1397 = !DILocation(line: 184, column: 16, scope: !1314)
!1398 = !DILocation(line: 184, column: 15, scope: !1314)
!1399 = !DILocation(line: 185, column: 10, scope: !1314)
!1400 = !DILocation(line: 185, column: 3, scope: !1314)
!1401 = distinct !DISubprogram(name: "MontageImages", scope: !1, file: !1, line: 321, type: !1402, scopeLine: 323, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !1095)
!1402 = !DISubroutineType(types: !1403)
!1403 = !{!622, !1017, !1093, !1404}
!1404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 64)
!1405 = !DILocalVariable(name: "images", arg: 1, scope: !1401, file: !1, line: 321, type: !1017)
!1406 = !DILocation(line: 321, column: 48, scope: !1401)
!1407 = !DILocalVariable(name: "montage_info", arg: 2, scope: !1401, file: !1, line: 322, type: !1093)
!1408 = !DILocation(line: 322, column: 22, scope: !1401)
!1409 = !DILocalVariable(name: "exception", arg: 3, scope: !1401, file: !1, line: 322, type: !1404)
!1410 = !DILocation(line: 322, column: 50, scope: !1401)
!1411 = !DILocalVariable(name: "montage_image", scope: !1401, file: !1, line: 325, type: !622)
!1412 = !DILocation(line: 325, column: 6, scope: !1401)
!1413 = !DILocalVariable(name: "image_info", scope: !1401, file: !1, line: 328, type: !1414)
!1414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 64)
!1415 = !DILocation(line: 328, column: 6, scope: !1401)
!1416 = !DILocation(line: 330, column: 14, scope: !1401)
!1417 = !DILocation(line: 330, column: 13, scope: !1401)
!1418 = !DILocation(line: 331, column: 34, scope: !1401)
!1419 = !DILocation(line: 331, column: 45, scope: !1401)
!1420 = !DILocation(line: 331, column: 58, scope: !1401)
!1421 = !DILocation(line: 331, column: 65, scope: !1401)
!1422 = !DILocation(line: 331, column: 17, scope: !1401)
!1423 = !DILocation(line: 331, column: 16, scope: !1401)
!1424 = !DILocation(line: 332, column: 31, scope: !1401)
!1425 = !DILocation(line: 332, column: 14, scope: !1401)
!1426 = !DILocation(line: 332, column: 13, scope: !1401)
!1427 = !DILocation(line: 333, column: 10, scope: !1401)
!1428 = !DILocation(line: 333, column: 3, scope: !1401)
!1429 = distinct !DISubprogram(name: "MontageImageList", scope: !1, file: !1, line: 336, type: !1430, scopeLine: 338, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !1095)
!1430 = !DISubroutineType(types: !1431)
!1431 = !{!622, !960, !1093, !1017, !1404}
!1432 = !DILocalVariable(name: "image_info", arg: 1, scope: !1429, file: !1, line: 336, type: !960)
!1433 = !DILocation(line: 336, column: 55, scope: !1429)
!1434 = !DILocalVariable(name: "montage_info", arg: 2, scope: !1429, file: !1, line: 337, type: !1093)
!1435 = !DILocation(line: 337, column: 22, scope: !1429)
!1436 = !DILocalVariable(name: "images", arg: 3, scope: !1429, file: !1, line: 337, type: !1017)
!1437 = !DILocation(line: 337, column: 48, scope: !1429)
!1438 = !DILocalVariable(name: "exception", arg: 4, scope: !1429, file: !1, line: 337, type: !1404)
!1439 = !DILocation(line: 337, column: 70, scope: !1429)
!1440 = !DILocalVariable(name: "tile_geometry", scope: !1429, file: !1, line: 343, type: !614)
!1441 = !DILocation(line: 343, column: 5, scope: !1429)
!1442 = !DILocalVariable(name: "title", scope: !1429, file: !1, line: 344, type: !582)
!1443 = !DILocation(line: 344, column: 6, scope: !1429)
!1444 = !DILocalVariable(name: "value", scope: !1429, file: !1, line: 347, type: !738)
!1445 = !DILocation(line: 347, column: 6, scope: !1429)
!1446 = !DILocalVariable(name: "draw_info", scope: !1429, file: !1, line: 350, type: !822)
!1447 = !DILocation(line: 350, column: 6, scope: !1429)
!1448 = !DILocalVariable(name: "frame_info", scope: !1429, file: !1, line: 353, type: !1449)
!1449 = !DIDerivedType(tag: DW_TAG_typedef, name: "FrameInfo", file: !1450, line: 36, baseType: !1451)
!1450 = !DIFile(filename: "./magick/decorate.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!1451 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_FrameInfo", file: !1450, line: 25, size: 384, elements: !1452)
!1452 = !{!1453, !1454, !1455, !1456, !1457, !1458}
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1451, file: !1450, line: 28, baseType: !592, size: 64)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1451, file: !1450, line: 29, baseType: !592, size: 64, offset: 64)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1451, file: !1450, line: 32, baseType: !670, size: 64, offset: 128)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1451, file: !1450, line: 33, baseType: !670, size: 64, offset: 192)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "inner_bevel", scope: !1451, file: !1450, line: 34, baseType: !670, size: 64, offset: 256)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "outer_bevel", scope: !1451, file: !1450, line: 35, baseType: !670, size: 64, offset: 320)
!1459 = !DILocation(line: 353, column: 5, scope: !1429)
!1460 = !DILocalVariable(name: "image", scope: !1429, file: !1, line: 356, type: !622)
!1461 = !DILocation(line: 356, column: 6, scope: !1429)
!1462 = !DILocalVariable(name: "image_list", scope: !1429, file: !1, line: 357, type: !621)
!1463 = !DILocation(line: 357, column: 7, scope: !1429)
!1464 = !DILocalVariable(name: "master_list", scope: !1429, file: !1, line: 358, type: !621)
!1465 = !DILocation(line: 358, column: 7, scope: !1429)
!1466 = !DILocalVariable(name: "montage", scope: !1429, file: !1, line: 359, type: !622)
!1467 = !DILocation(line: 359, column: 6, scope: !1429)
!1468 = !DILocalVariable(name: "texture", scope: !1429, file: !1, line: 360, type: !622)
!1469 = !DILocation(line: 360, column: 6, scope: !1429)
!1470 = !DILocalVariable(name: "tile_image", scope: !1429, file: !1, line: 361, type: !622)
!1471 = !DILocation(line: 361, column: 6, scope: !1429)
!1472 = !DILocalVariable(name: "thumbnail", scope: !1429, file: !1, line: 362, type: !622)
!1473 = !DILocation(line: 362, column: 6, scope: !1429)
!1474 = !DILocalVariable(name: "clone_info", scope: !1429, file: !1, line: 365, type: !1414)
!1475 = !DILocation(line: 365, column: 6, scope: !1429)
!1476 = !DILocalVariable(name: "concatenate", scope: !1429, file: !1, line: 368, type: !596)
!1477 = !DILocation(line: 368, column: 5, scope: !1429)
!1478 = !DILocalVariable(name: "proceed", scope: !1429, file: !1, line: 369, type: !596)
!1479 = !DILocation(line: 369, column: 5, scope: !1429)
!1480 = !DILocalVariable(name: "status", scope: !1429, file: !1, line: 370, type: !596)
!1481 = !DILocation(line: 370, column: 5, scope: !1429)
!1482 = !DILocalVariable(name: "tiles", scope: !1429, file: !1, line: 373, type: !741)
!1483 = !DILocation(line: 373, column: 5, scope: !1429)
!1484 = !DILocalVariable(name: "progress_monitor", scope: !1429, file: !1, line: 376, type: !733)
!1485 = !DILocation(line: 376, column: 5, scope: !1429)
!1486 = !DILocalVariable(name: "flags", scope: !1429, file: !1, line: 379, type: !1487)
!1487 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickStatusType", file: !4, line: 147, baseType: !5)
!1488 = !DILocation(line: 379, column: 5, scope: !1429)
!1489 = !DILocalVariable(name: "i", scope: !1429, file: !1, line: 382, type: !670)
!1490 = !DILocation(line: 382, column: 5, scope: !1429)
!1491 = !DILocalVariable(name: "bounds", scope: !1429, file: !1, line: 385, type: !678)
!1492 = !DILocation(line: 385, column: 5, scope: !1429)
!1493 = !DILocalVariable(name: "geometry", scope: !1429, file: !1, line: 386, type: !678)
!1494 = !DILocation(line: 386, column: 5, scope: !1429)
!1495 = !DILocalVariable(name: "extract_info", scope: !1429, file: !1, line: 387, type: !678)
!1496 = !DILocation(line: 387, column: 5, scope: !1429)
!1497 = !DILocalVariable(name: "bevel_width", scope: !1429, file: !1, line: 391, type: !592)
!1498 = !DILocation(line: 391, column: 5, scope: !1429)
!1499 = !DILocalVariable(name: "border_width", scope: !1429, file: !1, line: 392, type: !592)
!1500 = !DILocation(line: 392, column: 5, scope: !1429)
!1501 = !DILocalVariable(name: "extent", scope: !1429, file: !1, line: 393, type: !592)
!1502 = !DILocation(line: 393, column: 5, scope: !1429)
!1503 = !DILocalVariable(name: "height", scope: !1429, file: !1, line: 394, type: !592)
!1504 = !DILocation(line: 394, column: 5, scope: !1429)
!1505 = !DILocalVariable(name: "images_per_page", scope: !1429, file: !1, line: 395, type: !592)
!1506 = !DILocation(line: 395, column: 5, scope: !1429)
!1507 = !DILocalVariable(name: "max_height", scope: !1429, file: !1, line: 396, type: !592)
!1508 = !DILocation(line: 396, column: 5, scope: !1429)
!1509 = !DILocalVariable(name: "number_images", scope: !1429, file: !1, line: 397, type: !592)
!1510 = !DILocation(line: 397, column: 5, scope: !1429)
!1511 = !DILocalVariable(name: "number_lines", scope: !1429, file: !1, line: 398, type: !592)
!1512 = !DILocation(line: 398, column: 5, scope: !1429)
!1513 = !DILocalVariable(name: "sans", scope: !1429, file: !1, line: 399, type: !592)
!1514 = !DILocation(line: 399, column: 5, scope: !1429)
!1515 = !DILocalVariable(name: "tiles_per_column", scope: !1429, file: !1, line: 400, type: !592)
!1516 = !DILocation(line: 400, column: 5, scope: !1429)
!1517 = !DILocalVariable(name: "tiles_per_page", scope: !1429, file: !1, line: 401, type: !592)
!1518 = !DILocation(line: 401, column: 5, scope: !1429)
!1519 = !DILocalVariable(name: "tiles_per_row", scope: !1429, file: !1, line: 402, type: !592)
!1520 = !DILocation(line: 402, column: 5, scope: !1429)
!1521 = !DILocalVariable(name: "title_offset", scope: !1429, file: !1, line: 403, type: !592)
!1522 = !DILocation(line: 403, column: 5, scope: !1429)
!1523 = !DILocalVariable(name: "total_tiles", scope: !1429, file: !1, line: 404, type: !592)
!1524 = !DILocation(line: 404, column: 5, scope: !1429)
!1525 = !DILocalVariable(name: "width", scope: !1429, file: !1, line: 405, type: !592)
!1526 = !DILocation(line: 405, column: 5, scope: !1429)
!1527 = !DILocalVariable(name: "tile", scope: !1429, file: !1, line: 408, type: !670)
!1528 = !DILocation(line: 408, column: 5, scope: !1429)
!1529 = !DILocalVariable(name: "x", scope: !1429, file: !1, line: 409, type: !670)
!1530 = !DILocation(line: 409, column: 5, scope: !1429)
!1531 = !DILocalVariable(name: "x_offset", scope: !1429, file: !1, line: 410, type: !670)
!1532 = !DILocation(line: 410, column: 5, scope: !1429)
!1533 = !DILocalVariable(name: "y", scope: !1429, file: !1, line: 411, type: !670)
!1534 = !DILocation(line: 411, column: 5, scope: !1429)
!1535 = !DILocalVariable(name: "y_offset", scope: !1429, file: !1, line: 412, type: !670)
!1536 = !DILocation(line: 412, column: 5, scope: !1429)
!1537 = !DILocalVariable(name: "metrics", scope: !1429, file: !1, line: 415, type: !1538)
!1538 = !DIDerivedType(tag: DW_TAG_typedef, name: "TypeMetric", file: !470, line: 372, baseType: !1539)
!1539 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TypeMetric", file: !470, line: 353, size: 960, elements: !1540)
!1540 = !{!1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550}
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "pixels_per_em", scope: !1539, file: !470, line: 356, baseType: !886, size: 128)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "ascent", scope: !1539, file: !470, line: 359, baseType: !590, size: 64, offset: 128)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "descent", scope: !1539, file: !470, line: 360, baseType: !590, size: 64, offset: 192)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1539, file: !470, line: 361, baseType: !590, size: 64, offset: 256)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1539, file: !470, line: 362, baseType: !590, size: 64, offset: 320)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "max_advance", scope: !1539, file: !470, line: 363, baseType: !590, size: 64, offset: 384)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "underline_position", scope: !1539, file: !470, line: 364, baseType: !590, size: 64, offset: 448)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "underline_thickness", scope: !1539, file: !470, line: 365, baseType: !590, size: 64, offset: 512)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "bounds", scope: !1539, file: !470, line: 368, baseType: !851, size: 256, offset: 576)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "origin", scope: !1539, file: !470, line: 371, baseType: !886, size: 128, offset: 832)
!1551 = !DILocation(line: 415, column: 5, scope: !1429)
!1552 = !DILocation(line: 422, column: 7, scope: !1553)
!1553 = distinct !DILexicalBlock(scope: !1429, file: !1, line: 422, column: 7)
!1554 = !DILocation(line: 422, column: 15, scope: !1553)
!1555 = !DILocation(line: 422, column: 21, scope: !1553)
!1556 = !DILocation(line: 422, column: 7, scope: !1429)
!1557 = !DILocation(line: 423, column: 61, scope: !1553)
!1558 = !DILocation(line: 423, column: 69, scope: !1553)
!1559 = !DILocation(line: 423, column: 12, scope: !1553)
!1560 = !DILocation(line: 423, column: 5, scope: !1553)
!1561 = !DILocation(line: 428, column: 36, scope: !1429)
!1562 = !DILocation(line: 428, column: 17, scope: !1429)
!1563 = !DILocation(line: 428, column: 16, scope: !1429)
!1564 = !DILocation(line: 429, column: 32, scope: !1429)
!1565 = !DILocation(line: 429, column: 39, scope: !1429)
!1566 = !DILocation(line: 429, column: 15, scope: !1429)
!1567 = !DILocation(line: 429, column: 14, scope: !1429)
!1568 = !DILocation(line: 430, column: 14, scope: !1429)
!1569 = !DILocation(line: 430, column: 13, scope: !1429)
!1570 = !DILocation(line: 431, column: 9, scope: !1429)
!1571 = !DILocation(line: 431, column: 8, scope: !1429)
!1572 = !DILocation(line: 432, column: 7, scope: !1573)
!1573 = distinct !DILexicalBlock(scope: !1429, file: !1, line: 432, column: 7)
!1574 = !DILocation(line: 432, column: 19, scope: !1573)
