; ModuleID = 'magick/magic.c'
source_filename = "magick/magic.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.SemaphoreInfo = type opaque
%struct._LinkedListInfo = type opaque
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct._MagicMapInfo = type { i8*, i64, i8*, i64 }
%struct._MagicInfo = type { i8*, i8*, i8*, i8*, i64, i64, i32, i32, %struct._MagicInfo*, %struct._MagicInfo*, i64 }
%struct._ExceptionInfo = type { i32, i32, i8*, i8*, i8*, i32, %struct.SemaphoreInfo*, i64 }
%struct._StringInfo = type { [4096 x i8], i8*, i64, i64 }

@magic_semaphore = internal global %struct.SemaphoreInfo* null, align 8, !dbg !0
@magic_cache = internal global %struct._LinkedListInfo* null, align 8, !dbg !257
@.str = private unnamed_addr constant [15 x i8] c"magick/magic.c\00", align 1
@.str.1 = private unnamed_addr constant [1 x i8] zeroinitializer, align 1
@.str.2 = private unnamed_addr constant [3 x i8] c"%s\00", align 1
@.str.3 = private unnamed_addr constant [4 x i8] c"...\00", align 1
@stdout = external dso_local global %struct._IO_FILE*, align 8

!72 = !DIEnumerator(name: "CoderFatalError", value: 750, isUnsigned: true)
!73 = !DIEnumerator(name: "FilterFatalError", value: 752, isUnsigned: true)
!74 = !DIEnumerator(name: "ModuleFatalError", value: 755, isUnsigned: true)
!75 = !DIEnumerator(name: "DrawFatalError", value: 760, isUnsigned: true)
!76 = !DIEnumerator(name: "ImageFatalError", value: 765, isUnsigned: true)
!77 = !DIEnumerator(name: "WandFatalError", value: 770, isUnsigned: true)
!78 = !DIEnumerator(name: "RandomFatalError", value: 775, isUnsigned: true)
!79 = !DIEnumerator(name: "XServerFatalError", value: 780, isUnsigned: true)
!80 = !DIEnumerator(name: "MonitorFatalError", value: 785, isUnsigned: true)
!81 = !DIEnumerator(name: "RegistryFatalError", value: 790, isUnsigned: true)
!82 = !DIEnumerator(name: "ConfigureFatalError", value: 795, isUnsigned: true)
!83 = !DIEnumerator(name: "PolicyFatalError", value: 799, isUnsigned: true)
!84 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !85, line: 34, baseType: !7, size: 32, elements: !86)
!85 = !DIFile(filename: "./magick/log.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!86 = !{!87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108}
!87 = !DIEnumerator(name: "UndefinedEvents", value: 0, isUnsigned: true)
!88 = !DIEnumerator(name: "NoEvents", value: 0, isUnsigned: true)
!89 = !DIEnumerator(name: "TraceEvent", value: 1, isUnsigned: true)
!90 = !DIEnumerator(name: "AnnotateEvent", value: 2, isUnsigned: true)
!91 = !DIEnumerator(name: "BlobEvent", value: 4, isUnsigned: true)
!92 = !DIEnumerator(name: "CacheEvent", value: 8, isUnsigned: true)
!93 = !DIEnumerator(name: "CoderEvent", value: 16, isUnsigned: true)
!94 = !DIEnumerator(name: "ConfigureEvent", value: 32, isUnsigned: true)
!95 = !DIEnumerator(name: "DeprecateEvent", value: 64, isUnsigned: true)
!96 = !DIEnumerator(name: "DrawEvent", value: 128, isUnsigned: true)
!97 = !DIEnumerator(name: "ExceptionEvent", value: 256, isUnsigned: true)
!98 = !DIEnumerator(name: "ImageEvent", value: 512, isUnsigned: true)
!99 = !DIEnumerator(name: "LocaleEvent", value: 1024, isUnsigned: true)
!100 = !DIEnumerator(name: "ModuleEvent", value: 2048, isUnsigned: true)
!101 = !DIEnumerator(name: "PolicyEvent", value: 4096, isUnsigned: true)
!102 = !DIEnumerator(name: "ResourceEvent", value: 8192, isUnsigned: true)
!103 = !DIEnumerator(name: "TransformEvent", value: 16384, isUnsigned: true)
!104 = !DIEnumerator(name: "UserEvent", value: 36864, isUnsigned: true)
!105 = !DIEnumerator(name: "WandEvent", value: 65536, isUnsigned: true)
!106 = !DIEnumerator(name: "X11Event", value: 131072, isUnsigned: true)
!107 = !DIEnumerator(name: "AccelerateEvent", value: 262144, isUnsigned: true)
!108 = !DIEnumerator(name: "AllEvents", value: 2147483647, isUnsigned: true)
!109 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !110, line: 46, baseType: !7, size: 32, elements: !111)
!110 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!111 = !{!112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123}
!112 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!113 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!114 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!115 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!116 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!117 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!118 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!119 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!120 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!121 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!122 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!123 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!124 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !125, line: 25, baseType: !7, size: 32, elements: !126)
!125 = !DIFile(filename: "./magick/utility.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!126 = !{!127, !128, !129, !130, !131, !132, !133, !134, !135}
!127 = !DIEnumerator(name: "UndefinedPath", value: 0, isUnsigned: true)
!128 = !DIEnumerator(name: "MagickPath", value: 1, isUnsigned: true)
!129 = !DIEnumerator(name: "RootPath", value: 2, isUnsigned: true)
!130 = !DIEnumerator(name: "HeadPath", value: 3, isUnsigned: true)
!131 = !DIEnumerator(name: "TailPath", value: 4, isUnsigned: true)
!132 = !DIEnumerator(name: "BasePath", value: 5, isUnsigned: true)
!133 = !DIEnumerator(name: "ExtensionPath", value: 6, isUnsigned: true)
!134 = !DIEnumerator(name: "SubimagePath", value: 7, isUnsigned: true)
!135 = !DIEnumerator(name: "CanonicalPath", value: 8, isUnsigned: true)
!136 = !{!137, !165, !166, !152, !154, !168, !169, !170, !144, !171, !229, !231, !201, !179, !150, !203, !7, !234, !238, !242, !149, !255, !156}
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !139)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagicInfo", file: !140, line: 51, baseType: !141)
!140 = !DIFile(filename: "./magick/magic.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MagicInfo", file: !140, line: 25, size: 640, elements: !142)
!142 = !{!143, !146, !147, !148, !151, !155, !158, !160, !161, !163, !164}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !141, file: !140, line: 28, baseType: !144, size: 64)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !141, file: !140, line: 29, baseType: !144, size: 64, offset: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !141, file: !140, line: 30, baseType: !144, size: 64, offset: 128)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !141, file: !140, line: 33, baseType: !149, size: 64, offset: 192)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!150 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !141, file: !140, line: 36, baseType: !152, size: 64, offset: 256)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !153, line: 46, baseType: !154)
!153 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!154 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !141, file: !140, line: 39, baseType: !156, size: 64, offset: 320)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickOffsetType", file: !6, line: 150, baseType: !157)
!157 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "exempt", scope: !141, file: !140, line: 42, baseType: !159, size: 32, offset: 384)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickBooleanType", file: !6, line: 215, baseType: !5)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "stealth", scope: !141, file: !140, line: 43, baseType: !159, size: 32, offset: 416)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !141, file: !140, line: 46, baseType: !162, size: 64, offset: 448)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !141, file: !140, line: 47, baseType: !162, size: 64, offset: 512)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !141, file: !140, line: 50, baseType: !152, size: 64, offset: 576)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!167 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !150)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!172 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !173)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !174, line: 7, baseType: !175)
!174 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !176, line: 49, size: 1728, elements: !177)
!176 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!177 = !{!178, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !194, !196, !197, !198, !202, !204, !206, !210, !213, !215, !218, !221, !222, !223, !224, !225}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !175, file: !176, line: 51, baseType: !179, size: 32)
!179 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !175, file: !176, line: 54, baseType: !144, size: 64, offset: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !175, file: !176, line: 55, baseType: !144, size: 64, offset: 128)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !175, file: !176, line: 56, baseType: !144, size: 64, offset: 192)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !175, file: !176, line: 57, baseType: !144, size: 64, offset: 256)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !175, file: !176, line: 58, baseType: !144, size: 64, offset: 320)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !175, file: !176, line: 59, baseType: !144, size: 64, offset: 384)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !175, file: !176, line: 60, baseType: !144, size: 64, offset: 448)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !175, file: !176, line: 61, baseType: !144, size: 64, offset: 512)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !175, file: !176, line: 64, baseType: !144, size: 64, offset: 576)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !175, file: !176, line: 65, baseType: !144, size: 64, offset: 640)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !175, file: !176, line: 66, baseType: !144, size: 64, offset: 704)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !175, file: !176, line: 68, baseType: !192, size: 64, offset: 768)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !176, line: 36, flags: DIFlagFwdDecl)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !175, file: !176, line: 70, baseType: !195, size: 64, offset: 832)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !175, file: !176, line: 72, baseType: !179, size: 32, offset: 896)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !175, file: !176, line: 73, baseType: !179, size: 32, offset: 928)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !175, file: !176, line: 74, baseType: !199, size: 64, offset: 960)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !200, line: 152, baseType: !201)
!200 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!201 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !175, file: !176, line: 77, baseType: !203, size: 16, offset: 1024)
!203 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !175, file: !176, line: 78, baseType: !205, size: 8, offset: 1040)
!205 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !175, file: !176, line: 79, baseType: !207, size: 8, offset: 1048)
!207 = !DICompositeType(tag: DW_TAG_array_type, baseType: !145, size: 8, elements: !208)
!208 = !{!209}
!209 = !DISubrange(count: 1)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !175, file: !176, line: 81, baseType: !211, size: 64, offset: 1088)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !176, line: 43, baseType: null)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !175, file: !176, line: 89, baseType: !214, size: 64, offset: 1152)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !200, line: 153, baseType: !201)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !175, file: !176, line: 91, baseType: !216, size: 64, offset: 1216)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
!217 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !176, line: 37, flags: DIFlagFwdDecl)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !175, file: !176, line: 92, baseType: !219, size: 64, offset: 1280)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!220 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !176, line: 38, flags: DIFlagFwdDecl)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !175, file: !176, line: 93, baseType: !195, size: 64, offset: 1344)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !175, file: !176, line: 94, baseType: !165, size: 64, offset: 1408)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !175, file: !176, line: 95, baseType: !152, size: 64, offset: 1472)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !175, file: !176, line: 96, baseType: !179, size: 32, offset: 1536)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !175, file: !176, line: 98, baseType: !226, size: 160, offset: 1568)
!226 = !DICompositeType(tag: DW_TAG_array_type, baseType: !145, size: 160, elements: !227)
!227 = !{!228}
!228 = !DISubrange(count: 20)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!230 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !145)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !232, line: 77, baseType: !233)
!232 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !200, line: 193, baseType: !201)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "SemaphoreInfo", file: !236, line: 26, baseType: !237)
!236 = !DIFile(filename: "./magick/semaphore.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!237 = !DICompositeType(tag: DW_TAG_structure_type, name: "SemaphoreInfo", file: !236, line: 25, flags: DIFlagFwdDecl)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "LinkedListInfo", file: !240, line: 34, baseType: !241)
!240 = !DIFile(filename: "./magick/hashmap.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!241 = !DICompositeType(tag: DW_TAG_structure_type, name: "_LinkedListInfo", file: !240, line: 33, flags: DIFlagFwdDecl)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64)
!243 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !244)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "StringInfo", file: !245, line: 40, baseType: !246)
!245 = !DIFile(filename: "./magick/string_.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!246 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_StringInfo", file: !245, line: 29, size: 32960, elements: !247)
!247 = !{!248, !252, !253, !254}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !246, file: !245, line: 32, baseType: !249, size: 32768)
!249 = !DICompositeType(tag: DW_TAG_array_type, baseType: !145, size: 32768, elements: !250)
!250 = !{!251}
!251 = !DISubrange(count: 4096)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "datum", scope: !246, file: !245, line: 35, baseType: !149, size: 64, offset: 32768)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !246, file: !245, line: 38, baseType: !152, size: 64, offset: 32832)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !246, file: !245, line: 39, baseType: !152, size: 64, offset: 32896)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!256 = !{!0, !257, !259}
!257 = !DIGlobalVariableExpression(var: !258, expr: !DIExpression())
!258 = distinct !DIGlobalVariable(name: "magic_cache", scope: !2, file: !3, line: 205, type: !238, isLocal: true, isDefinition: true)
!259 = !DIGlobalVariableExpression(var: !260, expr: !DIExpression())
!260 = distinct !DIGlobalVariable(name: "MagicMap", scope: !2, file: !3, line: 87, type: !261, isLocal: true, isDefinition: true)
!261 = !DICompositeType(tag: DW_TAG_array_type, baseType: !262, size: 28928, elements: !272)
!262 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !263)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagicMapInfo", file: !3, line: 81, baseType: !264)
!264 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MagicMapInfo", file: !3, line: 68, size: 256, elements: !265)
!265 = !{!266, !267, !269, !270}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !264, file: !3, line: 71, baseType: !229, size: 64)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !264, file: !3, line: 74, baseType: !268, size: 64, offset: 64)
!268 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !156)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !264, file: !3, line: 77, baseType: !166, size: 64, offset: 128)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !264, file: !3, line: 80, baseType: !271, size: 64, offset: 192)
!271 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !152)
!272 = !{!273}
!273 = !DISubrange(count: 113)
!274 = !{i32 7, !"Dwarf Version", i32 4}
!275 = !{i32 2, !"Debug Info Version", i32 3}
!276 = !{i32 1, !"wchar_size", i32 4}
!277 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!278 = distinct !DISubprogram(name: "GetMagicInfo", scope: !3, file: !3, line: 346, type: !279, scopeLine: 348, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !294)
!279 = !DISubroutineType(types: !280)
!280 = !{!137, !166, !271, !281}
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionInfo", file: !6, line: 219, baseType: !283)
!283 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ExceptionInfo", file: !12, line: 102, size: 448, elements: !284)
!284 = !{!285, !287, !288, !289, !290, !291, !292, !293}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "severity", scope: !283, file: !12, line: 105, baseType: !286, size: 32)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionType", file: !12, line: 100, baseType: !11)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "error_number", scope: !283, file: !12, line: 108, baseType: !179, size: 32, offset: 32)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !283, file: !12, line: 111, baseType: !144, size: 64, offset: 64)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !283, file: !12, line: 112, baseType: !144, size: 64, offset: 128)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "exceptions", scope: !283, file: !12, line: 115, baseType: !165, size: 64, offset: 192)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "relinquish", scope: !283, file: !12, line: 118, baseType: !159, size: 32, offset: 256)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !283, file: !12, line: 121, baseType: !234, size: 64, offset: 320)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !283, file: !12, line: 124, baseType: !152, size: 64, offset: 384)
!294 = !{}
!295 = !DILocalVariable(name: "magic", arg: 1, scope: !278, file: !3, line: 346, type: !166)
!296 = !DILocation(line: 346, column: 65, scope: !278)
!297 = !DILocalVariable(name: "length", arg: 2, scope: !278, file: !3, line: 347, type: !271)
!298 = !DILocation(line: 347, column: 16, scope: !278)
!299 = !DILocalVariable(name: "exception", arg: 3, scope: !278, file: !3, line: 347, type: !281)
!300 = !DILocation(line: 347, column: 38, scope: !278)
!301 = !DILocalVariable(name: "p", scope: !278, file: !3, line: 350, type: !137)
!302 = !DILocation(line: 350, column: 6, scope: !278)
!303 = !DILocation(line: 353, column: 32, scope: !304)
!304 = distinct !DILexicalBlock(scope: !278, file: !3, line: 353, column: 7)
!305 = !DILocation(line: 353, column: 7, scope: !304)
!306 = !DILocation(line: 353, column: 43, scope: !304)
!307 = !DILocation(line: 353, column: 7, scope: !278)
!308 = !DILocation(line: 354, column: 5, scope: !304)
!309 = !DILocation(line: 358, column: 21, scope: !278)
!310 = !DILocation(line: 358, column: 3, scope: !278)
!311 = !DILocation(line: 359, column: 27, scope: !278)
!312 = !DILocation(line: 359, column: 3, scope: !278)
!313 = !DILocation(line: 360, column: 50, scope: !278)
!314 = !DILocation(line: 360, column: 25, scope: !278)
!315 = !DILocation(line: 360, column: 5, scope: !278)
!316 = !DILocation(line: 360, column: 4, scope: !278)
!317 = !DILocation(line: 361, column: 7, scope: !318)
!318 = distinct !DILexicalBlock(scope: !278, file: !3, line: 361, column: 7)
!319 = !DILocation(line: 361, column: 13, scope: !318)
!320 = !DILocation(line: 361, column: 7, scope: !278)
!321 = !DILocation(line: 363, column: 27, scope: !322)
!322 = distinct !DILexicalBlock(scope: !318, file: !3, line: 362, column: 5)
!323 = !DILocation(line: 363, column: 7, scope: !322)
!324 = !DILocation(line: 364, column: 14, scope: !322)
!325 = !DILocation(line: 364, column: 7, scope: !322)
!326 = !DILocation(line: 366, column: 3, scope: !278)
!327 = !DILocation(line: 366, column: 10, scope: !278)
!328 = !DILocation(line: 366, column: 12, scope: !278)
!329 = !DILocation(line: 369, column: 20, scope: !330)
!330 = distinct !DILexicalBlock(scope: !331, file: !3, line: 369, column: 9)
!331 = distinct !DILexicalBlock(scope: !278, file: !3, line: 367, column: 3)
!332 = !DILocation(line: 369, column: 23, scope: !330)
!333 = !DILocation(line: 369, column: 30, scope: !330)
!334 = !DILocation(line: 369, column: 33, scope: !330)
!335 = !DILocation(line: 369, column: 29, scope: !330)
!336 = !DILocation(line: 369, column: 44, scope: !330)
!337 = !DILocation(line: 369, column: 41, scope: !330)
!338 = !DILocation(line: 369, column: 52, scope: !330)
!339 = !DILocation(line: 370, column: 17, scope: !330)
!340 = !DILocation(line: 370, column: 23, scope: !330)
!341 = !DILocation(line: 370, column: 26, scope: !330)
!342 = !DILocation(line: 370, column: 22, scope: !330)
!343 = !DILocation(line: 370, column: 33, scope: !330)
!344 = !DILocation(line: 370, column: 36, scope: !330)
!345 = !DILocation(line: 370, column: 42, scope: !330)
!346 = !DILocation(line: 370, column: 45, scope: !330)
!347 = !DILocation(line: 370, column: 10, scope: !330)
!348 = !DILocation(line: 370, column: 53, scope: !330)
!349 = !DILocation(line: 369, column: 9, scope: !331)
!350 = !DILocation(line: 371, column: 7, scope: !330)
!351 = !DILocation(line: 372, column: 52, scope: !331)
!352 = !DILocation(line: 372, column: 27, scope: !331)
!353 = !DILocation(line: 372, column: 7, scope: !331)
!354 = !DILocation(line: 372, column: 6, scope: !331)
!355 = distinct !{!355, !326, !356}
!356 = !DILocation(line: 373, column: 3, scope: !278)
!357 = !DILocation(line: 374, column: 7, scope: !358)
!358 = distinct !DILexicalBlock(scope: !278, file: !3, line: 374, column: 7)
!359 = !DILocation(line: 374, column: 9, scope: !358)
!360 = !DILocation(line: 374, column: 7, scope: !278)
