; ModuleID = 'magick/splay-tree.c'
source_filename = "magick/splay-tree.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._SplayTreeInfo = type { %struct._NodeInfo*, i32 (i8*, i8*)*, i8* (i8*)*, i8* (i8*)*, i32, i8*, i8*, i64, i32, %struct.SemaphoreInfo*, i64 }
%struct._NodeInfo = type { i8*, i8*, %struct._NodeInfo*, %struct._NodeInfo* }
%struct.SemaphoreInfo = type opaque
%struct._ExceptionInfo = type { i32, i32, i8*, i8*, i8*, i32, %struct.SemaphoreInfo*, i64 }
%struct._StringInfo = type { [4096 x i8], i8*, i64, i64 }

@.str = private unnamed_addr constant [20 x i8] c"magick/splay-tree.c\00", align 1
@.str.1 = private unnamed_addr constant [1 x i8] zeroinitializer, align 1
@.str.2 = private unnamed_addr constant [4 x i8] c"...\00", align 1
@.str.3 = private unnamed_addr constant [23 x i8] c"MemoryAllocationFailed\00", align 1
@.str.4 = private unnamed_addr constant [5 x i8] c"`%s'\00", align 1

; Function Attrs: noinline nounwind uwtable
define dso_local i32 @AddValueToSplayTree(%struct._SplayTreeInfo* %splay_tree, i8* %key, i8* %value) #0 !dbg !192 {
entry:
  %retval = alloca i32, align 4
  %splay_tree.addr = alloca %struct._SplayTreeInfo*, align 8
  %key.addr = alloca i8*, align 8
  %value.addr = alloca i8*, align 8
  %compare = alloca i32, align 4
  %node = alloca %struct._NodeInfo*, align 8

!49 = !DIEnumerator(name: "CoderWarning", value: 350, isUnsigned: true)
!50 = !DIEnumerator(name: "FilterWarning", value: 352, isUnsigned: true)
!51 = !DIEnumerator(name: "ModuleWarning", value: 355, isUnsigned: true)
!52 = !DIEnumerator(name: "DrawWarning", value: 360, isUnsigned: true)
!53 = !DIEnumerator(name: "ImageWarning", value: 365, isUnsigned: true)
!54 = !DIEnumerator(name: "WandWarning", value: 370, isUnsigned: true)
!55 = !DIEnumerator(name: "RandomWarning", value: 375, isUnsigned: true)
!56 = !DIEnumerator(name: "XServerWarning", value: 380, isUnsigned: true)
!57 = !DIEnumerator(name: "MonitorWarning", value: 385, isUnsigned: true)
!58 = !DIEnumerator(name: "RegistryWarning", value: 390, isUnsigned: true)
!59 = !DIEnumerator(name: "ConfigureWarning", value: 395, isUnsigned: true)
!60 = !DIEnumerator(name: "PolicyWarning", value: 399, isUnsigned: true)
!61 = !DIEnumerator(name: "ErrorException", value: 400, isUnsigned: true)
!62 = !DIEnumerator(name: "ResourceLimitError", value: 400, isUnsigned: true)
!63 = !DIEnumerator(name: "TypeError", value: 405, isUnsigned: true)
!64 = !DIEnumerator(name: "OptionError", value: 410, isUnsigned: true)
!65 = !DIEnumerator(name: "DelegateError", value: 415, isUnsigned: true)
!66 = !DIEnumerator(name: "MissingDelegateError", value: 420, isUnsigned: true)
!67 = !DIEnumerator(name: "CorruptImageError", value: 425, isUnsigned: true)
!68 = !DIEnumerator(name: "FileOpenError", value: 430, isUnsigned: true)
!69 = !DIEnumerator(name: "BlobError", value: 435, isUnsigned: true)
!70 = !DIEnumerator(name: "StreamError", value: 440, isUnsigned: true)
!71 = !DIEnumerator(name: "CacheError", value: 445, isUnsigned: true)
!72 = !DIEnumerator(name: "CoderError", value: 450, isUnsigned: true)
!73 = !DIEnumerator(name: "FilterError", value: 452, isUnsigned: true)
!74 = !DIEnumerator(name: "ModuleError", value: 455, isUnsigned: true)
!75 = !DIEnumerator(name: "DrawError", value: 460, isUnsigned: true)
!76 = !DIEnumerator(name: "ImageError", value: 465, isUnsigned: true)
!77 = !DIEnumerator(name: "WandError", value: 470, isUnsigned: true)
!78 = !DIEnumerator(name: "RandomError", value: 475, isUnsigned: true)
!79 = !DIEnumerator(name: "XServerError", value: 480, isUnsigned: true)
!80 = !DIEnumerator(name: "MonitorError", value: 485, isUnsigned: true)
!81 = !DIEnumerator(name: "RegistryError", value: 490, isUnsigned: true)
!82 = !DIEnumerator(name: "ConfigureError", value: 495, isUnsigned: true)
!83 = !DIEnumerator(name: "PolicyError", value: 499, isUnsigned: true)
!84 = !DIEnumerator(name: "FatalErrorException", value: 700, isUnsigned: true)
!85 = !DIEnumerator(name: "ResourceLimitFatalError", value: 700, isUnsigned: true)
!86 = !DIEnumerator(name: "TypeFatalError", value: 705, isUnsigned: true)
!87 = !DIEnumerator(name: "OptionFatalError", value: 710, isUnsigned: true)
!88 = !DIEnumerator(name: "DelegateFatalError", value: 715, isUnsigned: true)
!89 = !DIEnumerator(name: "MissingDelegateFatalError", value: 720, isUnsigned: true)
!90 = !DIEnumerator(name: "CorruptImageFatalError", value: 725, isUnsigned: true)
!91 = !DIEnumerator(name: "FileOpenFatalError", value: 730, isUnsigned: true)
!92 = !DIEnumerator(name: "BlobFatalError", value: 735, isUnsigned: true)
!93 = !DIEnumerator(name: "StreamFatalError", value: 740, isUnsigned: true)
!94 = !DIEnumerator(name: "CacheFatalError", value: 745, isUnsigned: true)
!95 = !DIEnumerator(name: "CoderFatalError", value: 750, isUnsigned: true)
!96 = !DIEnumerator(name: "FilterFatalError", value: 752, isUnsigned: true)
!97 = !DIEnumerator(name: "ModuleFatalError", value: 755, isUnsigned: true)
!98 = !DIEnumerator(name: "DrawFatalError", value: 760, isUnsigned: true)
!99 = !DIEnumerator(name: "ImageFatalError", value: 765, isUnsigned: true)
!100 = !DIEnumerator(name: "WandFatalError", value: 770, isUnsigned: true)
!101 = !DIEnumerator(name: "RandomFatalError", value: 775, isUnsigned: true)
!102 = !DIEnumerator(name: "XServerFatalError", value: 780, isUnsigned: true)
!103 = !DIEnumerator(name: "MonitorFatalError", value: 785, isUnsigned: true)
!104 = !DIEnumerator(name: "RegistryFatalError", value: 790, isUnsigned: true)
!105 = !DIEnumerator(name: "ConfigureFatalError", value: 795, isUnsigned: true)
!106 = !DIEnumerator(name: "PolicyFatalError", value: 799, isUnsigned: true)
!107 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !108, file: !1, line: 973, baseType: !5, size: 32, elements: !158)
!108 = distinct !DISubprogram(name: "IterateOverSplayTree", scope: !1, file: !1, line: 970, type: !109, scopeLine: 972, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !157)
!109 = !DISubroutineType(types: !110)
!110 = !{!111, !112, !154, !132}
!111 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "SplayTreeInfo", file: !114, line: 26, baseType: !115)
!114 = !DIFile(filename: "./magick/splay-tree.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SplayTreeInfo", file: !1, line: 81, size: 704, elements: !116)
!116 = !{!117, !128, !134, !138, !139, !141, !142, !143, !147, !148, !153}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !115, file: !1, line: 84, baseType: !118, size: 64)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "NodeInfo", file: !1, line: 79, baseType: !120)
!120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NodeInfo", file: !1, line: 68, size: 256, elements: !121)
!121 = !{!122, !124, !125, !127}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !120, file: !1, line: 71, baseType: !123, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !120, file: !1, line: 74, baseType: !123, size: 64, offset: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !120, file: !1, line: 77, baseType: !126, size: 64, offset: 128)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !120, file: !1, line: 78, baseType: !126, size: 64, offset: 192)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "compare", scope: !115, file: !1, line: 87, baseType: !129, size: 64, offset: 64)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DISubroutineType(types: !131)
!131 = !{!111, !132, !132}
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "relinquish_key", scope: !115, file: !1, line: 90, baseType: !135, size: 64, offset: 128)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!136 = !DISubroutineType(types: !137)
!137 = !{!123, !123}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "relinquish_value", scope: !115, file: !1, line: 91, baseType: !135, size: 64, offset: 192)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "balance", scope: !115, file: !1, line: 94, baseType: !140, size: 32, offset: 256)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickBooleanType", file: !4, line: 215, baseType: !3)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !115, file: !1, line: 97, baseType: !123, size: 64, offset: 320)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !115, file: !1, line: 98, baseType: !123, size: 64, offset: 384)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !115, file: !1, line: 101, baseType: !144, size: 64, offset: 448)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !145, line: 46, baseType: !146)
!145 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!146 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !115, file: !1, line: 104, baseType: !140, size: 32, offset: 512)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !115, file: !1, line: 107, baseType: !149, size: 64, offset: 576)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "SemaphoreInfo", file: !151, line: 26, baseType: !152)
!151 = !DIFile(filename: "./magick/semaphore.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!152 = !DICompositeType(tag: DW_TAG_structure_type, name: "SemaphoreInfo", file: !151, line: 25, flags: DIFlagFwdDecl)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !115, file: !1, line: 110, baseType: !144, size: 64, offset: 640)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!155 = !DISubroutineType(types: !156)
!156 = !{!111, !118, !132}
!157 = !{}
!158 = !{!159, !160, !161, !162}
!159 = !DIEnumerator(name: "LeftTransition", value: 0, isUnsigned: true)
!160 = !DIEnumerator(name: "RightTransition", value: 1, isUnsigned: true)
!161 = !DIEnumerator(name: "DownTransition", value: 2, isUnsigned: true)
!162 = !DIEnumerator(name: "UpTransition", value: 3, isUnsigned: true)
!163 = !{!118, !123, !129, !135, !146, !164, !167, !112, !111, !182, !144, !132, !178, !179, !183, !184}
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!165 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !166)
!166 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !169)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "StringInfo", file: !170, line: 40, baseType: !171)
!170 = !DIFile(filename: "./magick/string_.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_StringInfo", file: !170, line: 29, size: 32960, elements: !172)
!172 = !{!173, !177, !180, !181}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !171, file: !170, line: 32, baseType: !174, size: 32768)
!174 = !DICompositeType(tag: DW_TAG_array_type, baseType: !166, size: 32768, elements: !175)
!175 = !{!176}
!176 = !DISubrange(count: 4096)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "datum", scope: !171, file: !170, line: 35, baseType: !178, size: 64, offset: 32768)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !171, file: !170, line: 38, baseType: !144, size: 64, offset: 32832)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !171, file: !170, line: 39, baseType: !144, size: 64, offset: 32896)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "TransitionType", scope: !108, file: !1, line: 979, baseType: !107)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!187 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !119)
!188 = !{i32 7, !"Dwarf Version", i32 4}
!189 = !{i32 2, !"Debug Info Version", i32 3}
!190 = !{i32 1, !"wchar_size", i32 4}
!191 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!192 = distinct !DISubprogram(name: "AddValueToSplayTree", scope: !1, file: !1, line: 152, type: !193, scopeLine: 154, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !157)
!193 = !DISubroutineType(types: !194)
!194 = !{!140, !112, !132, !132}
!195 = !DILocalVariable(name: "splay_tree", arg: 1, scope: !192, file: !1, line: 152, type: !112)
!196 = !DILocation(line: 152, column: 67, scope: !192)
!197 = !DILocalVariable(name: "key", arg: 2, scope: !192, file: !1, line: 153, type: !132)
!198 = !DILocation(line: 153, column: 15, scope: !192)
!199 = !DILocalVariable(name: "value", arg: 3, scope: !192, file: !1, line: 153, type: !132)
!200 = !DILocation(line: 153, column: 31, scope: !192)
!201 = !DILocalVariable(name: "compare", scope: !192, file: !1, line: 156, type: !111)
!202 = !DILocation(line: 156, column: 5, scope: !192)
!203 = !DILocalVariable(name: "node", scope: !192, file: !1, line: 159, type: !118)
!204 = !DILocation(line: 159, column: 6, scope: !192)
!205 = !DILocation(line: 161, column: 21, scope: !192)
!206 = !DILocation(line: 161, column: 33, scope: !192)
!207 = !DILocation(line: 161, column: 3, scope: !192)
!208 = !DILocation(line: 162, column: 18, scope: !192)
!209 = !DILocation(line: 162, column: 29, scope: !192)
!210 = !DILocation(line: 162, column: 3, scope: !192)
!211 = !DILocation(line: 163, column: 10, scope: !192)
!212 = !DILocation(line: 164, column: 7, scope: !213)
!213 = distinct !DILexicalBlock(scope: !192, file: !1, line: 164, column: 7)
!214 = !DILocation(line: 164, column: 19, scope: !213)
!215 = !DILocation(line: 164, column: 24, scope: !213)
!216 = !DILocation(line: 164, column: 7, scope: !192)
!217 = !DILocation(line: 166, column: 11, scope: !218)
!218 = distinct !DILexicalBlock(scope: !219, file: !1, line: 166, column: 11)
!219 = distinct !DILexicalBlock(scope: !213, file: !1, line: 165, column: 5)
!220 = !DILocation(line: 166, column: 23, scope: !218)
!221 = !DILocation(line: 166, column: 31, scope: !218)
!222 = !DILocation(line: 166, column: 11, scope: !219)
!223 = !DILocation(line: 167, column: 17, scope: !218)
!224 = !DILocation(line: 167, column: 29, scope: !218)
!225 = !DILocation(line: 167, column: 37, scope: !218)
!226 = !DILocation(line: 167, column: 49, scope: !218)
!227 = !DILocation(line: 167, column: 55, scope: !218)
!228 = !DILocation(line: 167, column: 59, scope: !218)
!229 = !DILocation(line: 167, column: 16, scope: !218)
!230 = !DILocation(line: 167, column: 9, scope: !218)
!231 = !DILocation(line: 169, column: 18, scope: !218)
!232 = !DILocation(line: 169, column: 30, scope: !218)
!233 = !DILocation(line: 169, column: 36, scope: !218)
!234 = !DILocation(line: 169, column: 42, scope: !218)
!235 = !DILocation(line: 169, column: 40, scope: !218)
!236 = !DILocation(line: 169, column: 17, scope: !218)
!237 = !DILocation(line: 170, column: 13, scope: !218)
!238 = !DILocation(line: 170, column: 25, scope: !218)
!239 = !DILocation(line: 170, column: 31, scope: !218)
!240 = !DILocation(line: 170, column: 37, scope: !218)
!241 = !DILocation(line: 170, column: 35, scope: !218)
!242 = !DILocation(line: 170, column: 12, scope: !218)
!243 = !DILocation(line: 169, column: 16, scope: !218)
!244 = !DILocation(line: 171, column: 11, scope: !245)
!245 = distinct !DILexicalBlock(scope: !219, file: !1, line: 171, column: 11)
!246 = !DILocation(line: 171, column: 19, scope: !245)
!247 = !DILocation(line: 171, column: 11, scope: !219)
!248 = !DILocation(line: 173, column: 16, scope: !249)
!249 = distinct !DILexicalBlock(scope: !250, file: !1, line: 173, column: 15)
!250 = distinct !DILexicalBlock(scope: !245, file: !1, line: 172, column: 9)
!251 = !DILocation(line: 173, column: 28, scope: !249)
!252 = !DILocation(line: 173, column: 45, scope: !249)
!253 = !DILocation(line: 173, column: 74, scope: !249)
!254 = !DILocation(line: 174, column: 16, scope: !249)
!255 = !DILocation(line: 174, column: 28, scope: !249)
!256 = !DILocation(line: 174, column: 34, scope: !249)
!257 = !DILocation(line: 174, column: 40, scope: !249)
!258 = !DILocation(line: 173, column: 15, scope: !250)
!259 = !DILocation(line: 175, column: 37, scope: !249)
!260 = !DILocation(line: 175, column: 49, scope: !249)
!261 = !DILocation(line: 176, column: 15, scope: !249)
!262 = !DILocation(line: 176, column: 27, scope: !249)
!263 = !DILocation(line: 176, column: 33, scope: !249)
!264 = !DILocation(line: 175, column: 13, scope: !249)
!265 = !DILocation(line: 175, column: 25, scope: !249)
!266 = !DILocation(line: 175, column: 31, scope: !249)
!267 = !DILocation(line: 175, column: 36, scope: !249)
!268 = !DILocation(line: 177, column: 16, scope: !269)
!269 = distinct !DILexicalBlock(scope: !250, file: !1, line: 177, column: 15)
!270 = !DILocation(line: 177, column: 28, scope: !269)
!271 = !DILocation(line: 177, column: 43, scope: !269)
!272 = !DILocation(line: 177, column: 72, scope: !269)
!273 = !DILocation(line: 178, column: 16, scope: !269)
!274 = !DILocation(line: 178, column: 28, scope: !269)
!275 = !DILocation(line: 178, column: 34, scope: !269)
!276 = !DILocation(line: 178, column: 38, scope: !269)
!277 = !DILocation(line: 177, column: 15, scope: !250)
!278 = !DILocation(line: 179, column: 35, scope: !269)
!279 = !DILocation(line: 179, column: 47, scope: !269)
!280 = !DILocation(line: 180, column: 15, scope: !269)
!281 = !DILocation(line: 180, column: 27, scope: !269)
!282 = !DILocation(line: 180, column: 33, scope: !269)
!283 = !DILocation(line: 179, column: 13, scope: !269)
!284 = !DILocation(line: 179, column: 25, scope: !269)
!285 = !DILocation(line: 179, column: 31, scope: !269)
!286 = !DILocation(line: 179, column: 34, scope: !269)
!287 = !DILocation(line: 181, column: 42, scope: !250)
!288 = !DILocation(line: 181, column: 11, scope: !250)
!289 = !DILocation(line: 181, column: 23, scope: !250)
!290 = !DILocation(line: 181, column: 29, scope: !250)
!291 = !DILocation(line: 181, column: 32, scope: !250)
!292 = !DILocation(line: 182, column: 44, scope: !250)
!293 = !DILocation(line: 182, column: 11, scope: !250)
!294 = !DILocation(line: 182, column: 23, scope: !250)
!295 = !DILocation(line: 182, column: 29, scope: !250)
!296 = !DILocation(line: 182, column: 34, scope: !250)
!297 = !DILocation(line: 183, column: 31, scope: !250)
!298 = !DILocation(line: 183, column: 43, scope: !250)
!299 = !DILocation(line: 183, column: 11, scope: !250)
!300 = !DILocation(line: 184, column: 11, scope: !250)
!301 = !DILocation(line: 186, column: 5, scope: !219)
!302 = !DILocation(line: 187, column: 21, scope: !192)
!303 = !DILocation(line: 187, column: 8, scope: !192)
!304 = !DILocation(line: 187, column: 7, scope: !192)
!305 = !DILocation(line: 188, column: 7, scope: !306)
!306 = distinct !DILexicalBlock(scope: !192, file: !1, line: 188, column: 7)
!307 = !DILocation(line: 188, column: 12, scope: !306)
!308 = !DILocation(line: 188, column: 7, scope: !192)
!309 = !DILocation(line: 190, column: 27, scope: !310)
!310 = distinct !DILexicalBlock(scope: !306, file: !1, line: 189, column: 5)
!311 = !DILocation(line: 190, column: 39, scope: !310)
!312 = !DILocation(line: 190, column: 7, scope: !310)
!313 = !DILocation(line: 191, column: 7, scope: !310)
!314 = !DILocation(line: 193, column: 22, scope: !192)
!315 = !DILocation(line: 193, column: 3, scope: !192)
!316 = !DILocation(line: 193, column: 9, scope: !192)
!317 = !DILocation(line: 193, column: 12, scope: !192)
!318 = !DILocation(line: 194, column: 24, scope: !192)
!319 = !DILocation(line: 194, column: 3, scope: !192)
!320 = !DILocation(line: 194, column: 9, scope: !192)
!321 = !DILocation(line: 194, column: 14, scope: !192)
!322 = !DILocation(line: 195, column: 7, scope: !323)
!323 = distinct !DILexicalBlock(scope: !192, file: !1, line: 195, column: 7)
!324 = !DILocation(line: 195, column: 19, scope: !323)
!325 = !DILocation(line: 195, column: 24, scope: !323)
!326 = !DILocation(line: 195, column: 7, scope: !192)
!327 = !DILocation(line: 197, column: 7, scope: !328)
!328 = distinct !DILexicalBlock(scope: !323, file: !1, line: 196, column: 5)
!329 = !DILocation(line: 197, column: 13, scope: !328)
!330 = !DILocation(line: 197, column: 17, scope: !328)
!331 = !DILocation(line: 198, column: 7, scope: !328)
!332 = !DILocation(line: 198, column: 13, scope: !328)
!333 = !DILocation(line: 198, column: 18, scope: !328)
!334 = !DILocation(line: 199, column: 5, scope: !328)
!335 = !DILocation(line: 201, column: 9, scope: !336)
!336 = distinct !DILexicalBlock(scope: !323, file: !1, line: 201, column: 9)
!337 = !DILocation(line: 201, column: 17, scope: !336)
!338 = !DILocation(line: 201, column: 9, scope: !323)
!339 = !DILocation(line: 203, column: 20, scope: !340)
!340 = distinct !DILexicalBlock(scope: !336, file: !1, line: 202, column: 7)
!341 = !DILocation(line: 203, column: 32, scope: !340)
!342 = !DILocation(line: 203, column: 9, scope: !340)
!343 = !DILocation(line: 203, column: 15, scope: !340)
!344 = !DILocation(line: 203, column: 19, scope: !340)
!345 = !DILocation(line: 204, column: 21, scope: !340)
!346 = !DILocation(line: 204, column: 27, scope: !340)
!347 = !DILocation(line: 204, column: 33, scope: !340)
!348 = !DILocation(line: 204, column: 9, scope: !340)
!349 = !DILocation(line: 204, column: 15, scope: !340)
!350 = !DILocation(line: 204, column: 20, scope: !340)
!351 = !DILocation(line: 205, column: 9, scope: !340)
!352 = !DILocation(line: 205, column: 15, scope: !340)
!353 = !DILocation(line: 205, column: 21, scope: !340)
!354 = !DILocation(line: 205, column: 26, scope: !340)
!355 = !DILocation(line: 206, column: 7, scope: !340)
!356 = !DILocation(line: 209, column: 21, scope: !357)
!357 = distinct !DILexicalBlock(scope: !336, file: !1, line: 208, column: 7)
!358 = !DILocation(line: 209, column: 33, scope: !357)
!359 = !DILocation(line: 209, column: 9, scope: !357)
!360 = !DILocation(line: 209, column: 15, scope: !357)
!361 = !DILocation(line: 209, column: 20, scope: !357)
!362 = !DILocation(line: 210, column: 20, scope: !357)
!363 = !DILocation(line: 210, column: 26, scope: !357)
!364 = !DILocation(line: 210, column: 33, scope: !357)
!365 = !DILocation(line: 210, column: 9, scope: !357)
!366 = !DILocation(line: 210, column: 15, scope: !357)
!367 = !DILocation(line: 210, column: 19, scope: !357)
!368 = !DILocation(line: 211, column: 9, scope: !357)
!369 = !DILocation(line: 211, column: 15, scope: !357)
!370 = !DILocation(line: 211, column: 22, scope: !357)
!371 = !DILocation(line: 211, column: 26, scope: !357)
!372 = !DILocation(line: 213, column: 20, scope: !192)
!373 = !DILocation(line: 213, column: 3, scope: !192)
!374 = !DILocation(line: 213, column: 15, scope: !192)
!375 = !DILocation(line: 213, column: 19, scope: !192)
!376 = !DILocation(line: 214, column: 3, scope: !192)
!377 = !DILocation(line: 214, column: 15, scope: !192)
!378 = !DILocation(line: 214, column: 18, scope: !192)
!379 = !DILocation(line: 215, column: 3, scope: !192)
!380 = !DILocation(line: 215, column: 15, scope: !192)
!381 = !DILocation(line: 215, column: 20, scope: !192)
!382 = !DILocation(line: 216, column: 23, scope: !192)
!383 = !DILocation(line: 216, column: 35, scope: !192)
!384 = !DILocation(line: 216, column: 3, scope: !192)
!385 = !DILocation(line: 217, column: 3, scope: !192)
!386 = !DILocation(line: 218, column: 1, scope: !192)
!387 = distinct !DISubprogram(name: "SplaySplayTree", scope: !1, file: !1, line: 1565, type: !388, scopeLine: 1566, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !157)
!388 = !DISubroutineType(types: !389)
!389 = !{null, !112, !132}
!390 = !DILocalVariable(name: "splay_tree", arg: 1, scope: !387, file: !1, line: 1565, type: !112)
!391 = !DILocation(line: 1565, column: 43, scope: !387)
!392 = !DILocalVariable(name: "key", arg: 2, scope: !387, file: !1, line: 1565, type: !132)
!393 = !DILocation(line: 1565, column: 66, scope: !387)
!394 = !DILocation(line: 1567, column: 7, scope: !395)
!395 = distinct !DILexicalBlock(scope: !387, file: !1, line: 1567, column: 7)
!396 = !DILocation(line: 1567, column: 19, scope: !395)
!397 = !DILocation(line: 1567, column: 24, scope: !395)
!398 = !DILocation(line: 1567, column: 7, scope: !387)
!399 = !DILocation(line: 1568, column: 5, scope: !395)
!400 = !DILocation(line: 1569, column: 7, scope: !401)
!401 = distinct !DILexicalBlock(scope: !387, file: !1, line: 1569, column: 7)
!402 = !DILocation(line: 1569, column: 19, scope: !401)
!403 = !DILocation(line: 1569, column: 23, scope: !401)
!404 = !DILocation(line: 1569, column: 7, scope: !387)
!405 = !DILocalVariable(name: "compare", scope: !406, file: !1, line: 1572, type: !111)
!406 = distinct !DILexicalBlock(scope: !401, file: !1, line: 1570, column: 5)
!407 = !DILocation(line: 1572, column: 9, scope: !406)
!408 = !DILocation(line: 1574, column: 11, scope: !409)
!409 = distinct !DILexicalBlock(scope: !406, file: !1, line: 1574, column: 11)
!410 = !DILocation(line: 1574, column: 23, scope: !409)
!411 = !DILocation(line: 1574, column: 31, scope: !409)
!412 = !DILocation(line: 1574, column: 11, scope: !406)
!413 = !DILocation(line: 1575, column: 17, scope: !409)
!414 = !DILocation(line: 1575, column: 29, scope: !409)
!415 = !DILocation(line: 1575, column: 37, scope: !409)
!416 = !DILocation(line: 1575, column: 49, scope: !409)
!417 = !DILocation(line: 1575, column: 55, scope: !409)
!418 = !DILocation(line: 1575, column: 59, scope: !409)
!419 = !DILocation(line: 1575, column: 16, scope: !409)
!420 = !DILocation(line: 1575, column: 9, scope: !409)
!421 = !DILocation(line: 1577, column: 18, scope: !409)
!422 = !DILocation(line: 1577, column: 30, scope: !409)
!423 = !DILocation(line: 1577, column: 36, scope: !409)
!424 = !DILocation(line: 1577, column: 34, scope: !409)
!425 = !DILocation(line: 1577, column: 17, scope: !409)
!426 = !DILocation(line: 1578, column: 13, scope: !409)
!427 = !DILocation(line: 1578, column: 25, scope: !409)
!428 = !DILocation(line: 1578, column: 31, scope: !409)
!429 = !DILocation(line: 1578, column: 29, scope: !409)
!430 = !DILocation(line: 1578, column: 12, scope: !409)
!431 = !DILocation(line: 1577, column: 16, scope: !409)
!432 = !DILocation(line: 1579, column: 11, scope: !433)
!433 = distinct !DILexicalBlock(scope: !406, file: !1, line: 1579, column: 11)
!434 = !DILocation(line: 1579, column: 19, scope: !433)
!435 = !DILocation(line: 1579, column: 11, scope: !406)
!436 = !DILocation(line: 1580, column: 9, scope: !433)
!437 = !DILocation(line: 1581, column: 5, scope: !406)
!438 = !DILocation(line: 1582, column: 16, scope: !387)
!439 = !DILocation(line: 1582, column: 31, scope: !387)
!440 = !DILocation(line: 1582, column: 36, scope: !387)
!441 = !DILocation(line: 1582, column: 48, scope: !387)
!442 = !DILocation(line: 1582, column: 10, scope: !387)
!443 = !DILocation(line: 1584, column: 7, scope: !444)
!444 = distinct !DILexicalBlock(scope: !387, file: !1, line: 1584, column: 7)
!445 = !DILocation(line: 1584, column: 19, scope: !444)
!446 = !DILocation(line: 1584, column: 27, scope: !444)
!447 = !DILocation(line: 1584, column: 7, scope: !387)
!448 = !DILocation(line: 1586, column: 24, scope: !449)
!449 = distinct !DILexicalBlock(scope: !444, file: !1, line: 1585, column: 5)
!450 = !DILocation(line: 1586, column: 7, scope: !449)
!451 = !DILocation(line: 1587, column: 20, scope: !449)
!452 = !DILocation(line: 1587, column: 35, scope: !449)
!453 = !DILocation(line: 1587, column: 40, scope: !449)
!454 = !DILocation(line: 1587, column: 52, scope: !449)
!455 = !DILocation(line: 1587, column: 14, scope: !449)
!456 = !DILocation(line: 1589, column: 11, scope: !457)
!457 = distinct !DILexicalBlock(scope: !449, file: !1, line: 1589, column: 11)
!458 = !DILocation(line: 1589, column: 23, scope: !457)
!459 = !DILocation(line: 1589, column: 31, scope: !457)
!460 = !DILocation(line: 1589, column: 11, scope: !449)
!461 = !DILocalVariable(name: "message", scope: !462, file: !1, line: 1590, type: !463)
!462 = distinct !DILexicalBlock(scope: !457, file: !1, line: 1590, column: 9)
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!464 = !DILocation(line: 1590, column: 9, scope: !462)
!465 = !DILocalVariable(name: "exception", scope: !462, file: !1, line: 1590, type: !466)
!466 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionInfo", file: !4, line: 219, baseType: !467)
!467 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ExceptionInfo", file: !35, line: 102, size: 448, elements: !468)
!468 = !{!469, !471, !472, !473, !474, !475, !476, !477}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "severity", scope: !467, file: !35, line: 105, baseType: !470, size: 32)
!470 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionType", file: !35, line: 100, baseType: !34)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "error_number", scope: !467, file: !35, line: 108, baseType: !111, size: 32, offset: 32)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !467, file: !35, line: 111, baseType: !463, size: 64, offset: 64)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !467, file: !35, line: 112, baseType: !463, size: 64, offset: 128)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "exceptions", scope: !467, file: !35, line: 115, baseType: !123, size: 64, offset: 192)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "relinquish", scope: !467, file: !35, line: 118, baseType: !140, size: 32, offset: 256)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !467, file: !35, line: 121, baseType: !149, size: 64, offset: 320)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !467, file: !35, line: 124, baseType: !144, size: 64, offset: 384)
!478 = !DILocation(line: 1591, column: 5, scope: !449)
!479 = !DILocation(line: 1592, column: 28, scope: !387)
!480 = !DILocation(line: 1592, column: 3, scope: !387)
!481 = !DILocation(line: 1592, column: 15, scope: !387)
!482 = !DILocation(line: 1592, column: 18, scope: !387)
!483 = !DILocation(line: 1593, column: 1, scope: !387)
!484 = distinct !DISubprogram(name: "CloneSplayTree", scope: !1, file: !1, line: 344, type: !485, scopeLine: 346, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !157)
!485 = !DISubroutineType(types: !486)
!486 = !{!112, !112, !135, !135}
!487 = !DILocalVariable(name: "splay_tree", arg: 1, scope: !484, file: !1, line: 344, type: !112)
!488 = !DILocation(line: 344, column: 59, scope: !484)
!489 = !DILocalVariable(name: "clone_key", arg: 2, scope: !484, file: !1, line: 345, type: !135)
!490 = !DILocation(line: 345, column: 11, scope: !484)
!491 = !DILocalVariable(name: "clone_value", arg: 3, scope: !484, file: !1, line: 345, type: !135)
!492 = !DILocation(line: 345, column: 38, scope: !484)
!493 = !DILocalVariable(name: "next", scope: !484, file: !1, line: 348, type: !118)
!494 = !DILocation(line: 348, column: 6, scope: !484)
!495 = !DILocalVariable(name: "node", scope: !484, file: !1, line: 349, type: !118)
!496 = !DILocation(line: 349, column: 6, scope: !484)
!497 = !DILocalVariable(name: "clone_tree", scope: !484, file: !1, line: 352, type: !112)
!498 = !DILocation(line: 352, column: 6, scope: !484)
!499 = !DILocation(line: 356, column: 7, scope: !500)
!500 = distinct !DILexicalBlock(scope: !484, file: !1, line: 356, column: 7)
!501 = !DILocation(line: 356, column: 19, scope: !500)
!502 = !DILocation(line: 356, column: 25, scope: !500)
!503 = !DILocation(line: 356, column: 7, scope: !484)
!504 = !DILocation(line: 357, column: 12, scope: !500)
!505 = !DILocation(line: 357, column: 5, scope: !500)
!506 = !DILocation(line: 358, column: 27, scope: !484)
!507 = !DILocation(line: 358, column: 39, scope: !484)
!508 = !DILocation(line: 358, column: 47, scope: !484)
!509 = !DILocation(line: 358, column: 59, scope: !484)
!510 = !DILocation(line: 359, column: 5, scope: !484)
!511 = !DILocation(line: 359, column: 17, scope: !484)
!512 = !DILocation(line: 358, column: 14, scope: !484)
!513 = !DILocation(line: 358, column: 13, scope: !484)
!514 = !DILocation(line: 360, column: 21, scope: !484)
!515 = !DILocation(line: 360, column: 33, scope: !484)
!516 = !DILocation(line: 360, column: 3, scope: !484)
!517 = !DILocation(line: 361, column: 7, scope: !518)
!518 = distinct !DILexicalBlock(scope: !484, file: !1, line: 361, column: 7)
!519 = !DILocation(line: 361, column: 19, scope: !518)
!520 = !DILocation(line: 361, column: 24, scope: !518)
!521 = !DILocation(line: 361, column: 7, scope: !484)
!522 = !DILocation(line: 363, column: 27, scope: !523)
!523 = distinct !DILexicalBlock(scope: !518, file: !1, line: 362, column: 5)
!524 = !DILocation(line: 363, column: 39, scope: !523)
!525 = !DILocation(line: 363, column: 7, scope: !523)
!526 = !DILocation(line: 364, column: 14, scope: !523)
!527 = !DILocation(line: 364, column: 7, scope: !523)
!528 = !DILocation(line: 366, column: 43, scope: !484)
!529 = !DILocation(line: 366, column: 21, scope: !484)
!530 = !DILocation(line: 366, column: 8, scope: !484)
!531 = !DILocation(line: 366, column: 7, scope: !484)
!532 = !DILocation(line: 367, column: 3, scope: !484)
!533 = !DILocation(line: 367, column: 10, scope: !484)
!534 = !DILocation(line: 367, column: 15, scope: !484)
!535 = !DILocation(line: 369, column: 20, scope: !536)
!536 = distinct !DILexicalBlock(scope: !484, file: !1, line: 368, column: 3)
!537 = !DILocation(line: 369, column: 31, scope: !536)
!538 = !DILocation(line: 369, column: 5, scope: !536)
!539 = !DILocation(line: 370, column: 32, scope: !536)
!540 = !DILocation(line: 370, column: 43, scope: !536)
