; ModuleID = 'magick/semaphore.c'
source_filename = "magick/semaphore.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.SemaphoreInfo = type { i64, i32, i64, i64 }
%struct._ExceptionInfo = type { i32, i32, i8*, i8*, i8*, i32, %struct.SemaphoreInfo*, i64 }

@.str = private unnamed_addr constant [19 x i8] c"magick/semaphore.c\00", align 1
@.str.1 = private unnamed_addr constant [1 x i8] zeroinitializer, align 1
@.str.2 = private unnamed_addr constant [23 x i8] c"MemoryAllocationFailed\00", align 1
@.str.3 = private unnamed_addr constant [5 x i8] c"`%s'\00", align 1
@active_mutex = internal global i32 0, align 4, !dbg !0

; Function Attrs: noinline nounwind uwtable
define dso_local void @ActivateSemaphoreInfo(%struct.SemaphoreInfo** %semaphore_info) #0 !dbg !119 {
entry:
  %semaphore_info.addr = alloca %struct.SemaphoreInfo**, align 8
  store %struct.SemaphoreInfo** %semaphore_info, %struct.SemaphoreInfo*** %semaphore_info.addr, align 8
  call void @llvm.dbg.declare(metadata %struct.SemaphoreInfo*** %semaphore_info.addr, metadata !124, metadata !DIExpression()), !dbg !125
  %0 = load %struct.SemaphoreInfo**, %struct.SemaphoreInfo*** %semaphore_info.addr, align 8, !dbg !126
  %1 = load %struct.SemaphoreInfo*, %struct.SemaphoreInfo** %0, align 8, !dbg !128
  %cmp = icmp eq %struct.SemaphoreInfo* %1, null, !dbg !129
  br i1 %cmp, label %if.then, label %if.end3, !dbg !130


!21 = !DIEnumerator(name: "CoderWarning", value: 350, isUnsigned: true)
!22 = !DIEnumerator(name: "FilterWarning", value: 352, isUnsigned: true)
!23 = !DIEnumerator(name: "ModuleWarning", value: 355, isUnsigned: true)
!24 = !DIEnumerator(name: "DrawWarning", value: 360, isUnsigned: true)
!25 = !DIEnumerator(name: "ImageWarning", value: 365, isUnsigned: true)
!26 = !DIEnumerator(name: "WandWarning", value: 370, isUnsigned: true)
!27 = !DIEnumerator(name: "RandomWarning", value: 375, isUnsigned: true)
!28 = !DIEnumerator(name: "XServerWarning", value: 380, isUnsigned: true)
!29 = !DIEnumerator(name: "MonitorWarning", value: 385, isUnsigned: true)
!30 = !DIEnumerator(name: "RegistryWarning", value: 390, isUnsigned: true)
!31 = !DIEnumerator(name: "ConfigureWarning", value: 395, isUnsigned: true)
!32 = !DIEnumerator(name: "PolicyWarning", value: 399, isUnsigned: true)
!33 = !DIEnumerator(name: "ErrorException", value: 400, isUnsigned: true)
!34 = !DIEnumerator(name: "ResourceLimitError", value: 400, isUnsigned: true)
!35 = !DIEnumerator(name: "TypeError", value: 405, isUnsigned: true)
!36 = !DIEnumerator(name: "OptionError", value: 410, isUnsigned: true)
!37 = !DIEnumerator(name: "DelegateError", value: 415, isUnsigned: true)
!38 = !DIEnumerator(name: "MissingDelegateError", value: 420, isUnsigned: true)
!39 = !DIEnumerator(name: "CorruptImageError", value: 425, isUnsigned: true)
!40 = !DIEnumerator(name: "FileOpenError", value: 430, isUnsigned: true)
!41 = !DIEnumerator(name: "BlobError", value: 435, isUnsigned: true)
!42 = !DIEnumerator(name: "StreamError", value: 440, isUnsigned: true)
!43 = !DIEnumerator(name: "CacheError", value: 445, isUnsigned: true)
!44 = !DIEnumerator(name: "CoderError", value: 450, isUnsigned: true)
!45 = !DIEnumerator(name: "FilterError", value: 452, isUnsigned: true)
!46 = !DIEnumerator(name: "ModuleError", value: 455, isUnsigned: true)
!47 = !DIEnumerator(name: "DrawError", value: 460, isUnsigned: true)
!48 = !DIEnumerator(name: "ImageError", value: 465, isUnsigned: true)
!49 = !DIEnumerator(name: "WandError", value: 470, isUnsigned: true)
!50 = !DIEnumerator(name: "RandomError", value: 475, isUnsigned: true)
!51 = !DIEnumerator(name: "XServerError", value: 480, isUnsigned: true)
!52 = !DIEnumerator(name: "MonitorError", value: 485, isUnsigned: true)
!53 = !DIEnumerator(name: "RegistryError", value: 490, isUnsigned: true)
!54 = !DIEnumerator(name: "ConfigureError", value: 495, isUnsigned: true)
!55 = !DIEnumerator(name: "PolicyError", value: 499, isUnsigned: true)
!56 = !DIEnumerator(name: "FatalErrorException", value: 700, isUnsigned: true)
!57 = !DIEnumerator(name: "ResourceLimitFatalError", value: 700, isUnsigned: true)
!58 = !DIEnumerator(name: "TypeFatalError", value: 705, isUnsigned: true)
!59 = !DIEnumerator(name: "OptionFatalError", value: 710, isUnsigned: true)
!60 = !DIEnumerator(name: "DelegateFatalError", value: 715, isUnsigned: true)
!61 = !DIEnumerator(name: "MissingDelegateFatalError", value: 720, isUnsigned: true)
!62 = !DIEnumerator(name: "CorruptImageFatalError", value: 725, isUnsigned: true)
!63 = !DIEnumerator(name: "FileOpenFatalError", value: 730, isUnsigned: true)
!64 = !DIEnumerator(name: "BlobFatalError", value: 735, isUnsigned: true)
!65 = !DIEnumerator(name: "StreamFatalError", value: 740, isUnsigned: true)
!66 = !DIEnumerator(name: "CacheFatalError", value: 745, isUnsigned: true)
!67 = !DIEnumerator(name: "CoderFatalError", value: 750, isUnsigned: true)
!68 = !DIEnumerator(name: "FilterFatalError", value: 752, isUnsigned: true)
!69 = !DIEnumerator(name: "ModuleFatalError", value: 755, isUnsigned: true)
!70 = !DIEnumerator(name: "DrawFatalError", value: 760, isUnsigned: true)
!71 = !DIEnumerator(name: "ImageFatalError", value: 765, isUnsigned: true)
!72 = !DIEnumerator(name: "WandFatalError", value: 770, isUnsigned: true)
!73 = !DIEnumerator(name: "RandomFatalError", value: 775, isUnsigned: true)
!74 = !DIEnumerator(name: "XServerFatalError", value: 780, isUnsigned: true)
!75 = !DIEnumerator(name: "MonitorFatalError", value: 785, isUnsigned: true)
!76 = !DIEnumerator(name: "RegistryFatalError", value: 790, isUnsigned: true)
!77 = !DIEnumerator(name: "ConfigureFatalError", value: 795, isUnsigned: true)
!78 = !DIEnumerator(name: "PolicyFatalError", value: 799, isUnsigned: true)
!79 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !80, line: 211, baseType: !7, size: 32, elements: !81)
!80 = !DIFile(filename: "./magick/magick-type.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!81 = !{!82, !83}
!82 = !DIEnumerator(name: "MagickFalse", value: 0, isUnsigned: true)
!83 = !DIEnumerator(name: "MagickTrue", value: 1, isUnsigned: true)
!84 = !{!85, !110, !95, !103, !93, !111}
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "SemaphoreInfo", file: !87, line: 26, baseType: !88)
!87 = !DIFile(filename: "./magick/semaphore.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!88 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SemaphoreInfo", file: !3, line: 58, size: 256, elements: !89)
!89 = !{!90, !96, !104, !109}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !88, file: !3, line: 61, baseType: !91, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickMutexType", file: !92, line: 52, baseType: !93)
!92 = !DIFile(filename: "./magick/thread-private.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !94, line: 46, baseType: !95)
!94 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!95 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !88, file: !3, line: 64, baseType: !97, size: 32, offset: 64)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickThreadType", file: !98, line: 30, baseType: !99)
!98 = !DIFile(filename: "./magick/thread_.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !100, line: 97, baseType: !101)
!100 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "")
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !102, line: 154, baseType: !103)
!102 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!103 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !88, file: !3, line: 67, baseType: !105, size: 64, offset: 128)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !106, line: 77, baseType: !107)
!106 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !102, line: 193, baseType: !108)
!108 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !88, file: !3, line: 70, baseType: !93, size: 64, offset: 192)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!112 = !{!0}
!113 = !DIFile(filename: "./magick/semaphore-private.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickBooleanType", file: !80, line: 215, baseType: !79)
!115 = !{i32 7, !"Dwarf Version", i32 4}
!116 = !{i32 2, !"Debug Info Version", i32 3}
!117 = !{i32 1, !"wchar_size", i32 4}
!118 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!119 = distinct !DISubprogram(name: "ActivateSemaphoreInfo", scope: !3, file: !3, line: 96, type: !120, scopeLine: 97, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !123)
!120 = !DISubroutineType(types: !121)
!121 = !{null, !122}
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!123 = !{}
!124 = !DILocalVariable(name: "semaphore_info", arg: 1, scope: !119, file: !3, line: 96, type: !122)
!125 = !DILocation(line: 96, column: 57, scope: !119)
!126 = !DILocation(line: 99, column: 8, scope: !127)
!127 = distinct !DILexicalBlock(scope: !119, file: !3, line: 99, column: 7)
!128 = !DILocation(line: 99, column: 7, scope: !127)
!129 = !DILocation(line: 99, column: 23, scope: !127)
!130 = !DILocation(line: 99, column: 7, scope: !119)
!131 = !DILocation(line: 101, column: 7, scope: !132)
!132 = distinct !DILexicalBlock(scope: !127, file: !3, line: 100, column: 5)
!133 = !DILocation(line: 102, column: 7, scope: !132)
!134 = !DILocation(line: 103, column: 12, scope: !135)
!135 = distinct !DILexicalBlock(scope: !132, file: !3, line: 103, column: 11)
!136 = !DILocation(line: 103, column: 11, scope: !135)
!137 = !DILocation(line: 103, column: 27, scope: !135)
!138 = !DILocation(line: 103, column: 11, scope: !132)
!139 = !DILocation(line: 104, column: 25, scope: !135)
!140 = !DILocation(line: 104, column: 10, scope: !135)
!141 = !DILocation(line: 104, column: 24, scope: !135)
!142 = !DILocation(line: 104, column: 9, scope: !135)
!143 = !DILocation(line: 105, column: 7, scope: !132)
!144 = !DILocation(line: 106, column: 5, scope: !132)
!145 = !DILocation(line: 107, column: 1, scope: !119)
!146 = distinct !DISubprogram(name: "InitializeMagickMutex", scope: !113, file: !113, line: 51, type: !147, scopeLine: 52, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !123)
!147 = !DISubroutineType(types: !148)
!148 = !{null}
!149 = !DILocation(line: 57, column: 15, scope: !146)
!150 = !DILocation(line: 58, column: 1, scope: !146)
!151 = distinct !DISubprogram(name: "LockMagickMutex", scope: !113, file: !113, line: 60, type: !147, scopeLine: 61, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !123)
!152 = !DILocation(line: 80, column: 1, scope: !151)
!153 = distinct !DISubprogram(name: "AllocateSemaphoreInfo", scope: !3, file: !3, line: 191, type: !154, scopeLine: 192, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !123)
!154 = !DISubroutineType(types: !155)
!155 = !{!85}
!156 = !DILocalVariable(name: "semaphore_info", scope: !153, file: !3, line: 194, type: !85)
!157 = !DILocation(line: 194, column: 6, scope: !153)
!158 = !DILocation(line: 199, column: 36, scope: !153)
!159 = !DILocation(line: 199, column: 18, scope: !153)
!160 = !DILocation(line: 199, column: 17, scope: !153)
!161 = !DILocation(line: 201, column: 7, scope: !162)
!162 = distinct !DILexicalBlock(scope: !153, file: !3, line: 201, column: 7)
!163 = !DILocation(line: 201, column: 22, scope: !162)
!164 = !DILocation(line: 201, column: 7, scope: !153)
!165 = !DILocalVariable(name: "message", scope: !166, file: !3, line: 202, type: !167)
!166 = distinct !DILexicalBlock(scope: !162, file: !3, line: 202, column: 5)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!169 = !DILocation(line: 202, column: 5, scope: !166)
!170 = !DILocalVariable(name: "exception", scope: !166, file: !3, line: 202, type: !171)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionInfo", file: !80, line: 219, baseType: !172)
!172 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ExceptionInfo", file: !6, line: 102, size: 448, elements: !173)
!173 = !{!174, !176, !177, !178, !179, !180, !181, !182}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "severity", scope: !172, file: !6, line: 105, baseType: !175, size: 32)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionType", file: !6, line: 100, baseType: !5)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "error_number", scope: !172, file: !6, line: 108, baseType: !103, size: 32, offset: 32)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !172, file: !6, line: 111, baseType: !167, size: 64, offset: 64)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !172, file: !6, line: 112, baseType: !167, size: 64, offset: 128)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "exceptions", scope: !172, file: !6, line: 115, baseType: !110, size: 64, offset: 192)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "relinquish", scope: !172, file: !6, line: 118, baseType: !114, size: 32, offset: 256)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !172, file: !6, line: 121, baseType: !85, size: 64, offset: 320)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !172, file: !6, line: 124, baseType: !93, size: 64, offset: 384)
!183 = !DILocation(line: 203, column: 28, scope: !153)
!184 = !DILocation(line: 203, column: 10, scope: !153)
!185 = !DILocation(line: 264, column: 22, scope: !153)
!186 = !DILocation(line: 264, column: 3, scope: !153)
!187 = !DILocation(line: 264, column: 19, scope: !153)
!188 = !DILocation(line: 264, column: 21, scope: !153)
!189 = !DILocation(line: 265, column: 3, scope: !153)
!190 = !DILocation(line: 265, column: 19, scope: !153)
!191 = !DILocation(line: 265, column: 34, scope: !153)
!192 = !DILocation(line: 266, column: 3, scope: !153)
!193 = !DILocation(line: 266, column: 19, scope: !153)
!194 = !DILocation(line: 266, column: 28, scope: !153)
!195 = !DILocation(line: 267, column: 10, scope: !153)
!196 = !DILocation(line: 267, column: 3, scope: !153)
!197 = distinct !DISubprogram(name: "UnlockMagickMutex", scope: !113, file: !113, line: 82, type: !147, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !123)
!198 = !DILocation(line: 101, column: 1, scope: !197)
!199 = distinct !DISubprogram(name: "AcquireSemaphoreMemory", scope: !3, file: !3, line: 128, type: !200, scopeLine: 129, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !123)
!200 = !DISubroutineType(types: !201)
!201 = !{!110, !202, !202}
!202 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !93)
!203 = !DILocalVariable(name: "count", arg: 1, scope: !199, file: !3, line: 128, type: !202)
!204 = !DILocation(line: 128, column: 50, scope: !199)
!205 = !DILocalVariable(name: "quantum", arg: 2, scope: !199, file: !3, line: 128, type: !202)
!206 = !DILocation(line: 128, column: 69, scope: !199)
!207 = !DILocalVariable(name: "alignment", scope: !199, file: !3, line: 134, type: !93)
!208 = !DILocation(line: 134, column: 5, scope: !199)
!209 = !DILocalVariable(name: "extent", scope: !199, file: !3, line: 135, type: !93)
!210 = !DILocation(line: 135, column: 5, scope: !199)
!211 = !DILocalVariable(name: "size", scope: !199, file: !3, line: 136, type: !93)
!212 = !DILocation(line: 136, column: 5, scope: !199)
!213 = !DILocalVariable(name: "memory", scope: !199, file: !3, line: 139, type: !110)
!214 = !DILocation(line: 139, column: 6, scope: !199)
!215 = !DILocation(line: 141, column: 8, scope: !199)
!216 = !DILocation(line: 141, column: 14, scope: !199)
!217 = !DILocation(line: 141, column: 13, scope: !199)
!218 = !DILocation(line: 141, column: 7, scope: !199)
!219 = !DILocation(line: 142, column: 8, scope: !220)
!220 = distinct !DILexicalBlock(scope: !199, file: !3, line: 142, column: 7)
!221 = !DILocation(line: 142, column: 14, scope: !220)
!222 = !DILocation(line: 142, column: 20, scope: !220)
!223 = !DILocation(line: 142, column: 24, scope: !220)
!224 = !DILocation(line: 142, column: 36, scope: !220)
!225 = !DILocation(line: 142, column: 41, scope: !220)
!226 = !DILocation(line: 142, column: 40, scope: !220)
!227 = !DILocation(line: 142, column: 32, scope: !220)
!228 = !DILocation(line: 142, column: 7, scope: !199)
!229 = !DILocation(line: 144, column: 7, scope: !230)
!230 = distinct !DILexicalBlock(scope: !220, file: !3, line: 143, column: 5)
!231 = !DILocation(line: 144, column: 12, scope: !230)
!232 = !DILocation(line: 145, column: 7, scope: !230)
!233 = !DILocation(line: 147, column: 9, scope: !199)
!234 = !DILocation(line: 148, column: 12, scope: !199)
!235 = !DILocation(line: 149, column: 10, scope: !199)
!236 = !DILocation(line: 149, column: 9, scope: !199)
!237 = !DILocation(line: 150, column: 8, scope: !238)
!238 = distinct !DILexicalBlock(scope: !199, file: !3, line: 150, column: 7)
!239 = !DILocation(line: 150, column: 13, scope: !238)
!240 = !DILocation(line: 150, column: 19, scope: !238)
!241 = !DILocation(line: 150, column: 23, scope: !238)
!242 = !DILocation(line: 150, column: 33, scope: !238)
