; ModuleID = 'magick/list.c'
source_filename = "magick/list.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._Image = type { i32, i32, i32, i64, i32, i32, i32, i64, i64, i64, i64, %struct._PixelPacket*, %struct._PixelPacket, %struct._PixelPacket, %struct._PixelPacket, double, %struct._ChromaticityInfo, i32, i8*, i32, i8*, i8*, i8*, i64, double, double, %struct._RectangleInfo, %struct._RectangleInfo, %struct._RectangleInfo, double, double, double, i32, i32, i32, i32, i32, i32, %struct._Image*, i64, i64, i64, i64, i64, i64, %struct._ErrorInfo, %struct._TimerInfo, i32 (i8*, i64, i64, i8*)*, i8*, i8*, i8*, %struct._Ascii85Info*, %struct._BlobInfo*, [4096 x i8], [4096 x i8], [4096 x i8], i64, i64, %struct._ExceptionInfo, i32, i64, %struct.SemaphoreInfo*, %struct._ProfileInfo, %struct._ProfileInfo, %struct._ProfileInfo*, i64, i64, %struct._Image*, %struct._Image*, %struct._Image*, i32, i32, %struct._PixelPacket, %struct._Image*, %struct._RectangleInfo, i8*, i8*, i32, i32, i64, i32, i64, i64, i32, i64 }
%struct._ChromaticityInfo = type { %struct._PrimaryInfo, %struct._PrimaryInfo, %struct._PrimaryInfo, %struct._PrimaryInfo }
%struct._PrimaryInfo = type { double, double, double }
%struct._ErrorInfo = type { double, double, double }
%struct._TimerInfo = type { %struct._Timer, %struct._Timer, i32, i64 }
%struct._Timer = type { double, double, double }
%struct._Ascii85Info = type opaque

!347 = !DIEnumerator(name: "GrayscaleMatteType", value: 3, isUnsigned: true)
!348 = !DIEnumerator(name: "PaletteType", value: 4, isUnsigned: true)
!349 = !DIEnumerator(name: "PaletteMatteType", value: 5, isUnsigned: true)
!350 = !DIEnumerator(name: "TrueColorType", value: 6, isUnsigned: true)
!351 = !DIEnumerator(name: "TrueColorMatteType", value: 7, isUnsigned: true)
!352 = !DIEnumerator(name: "ColorSeparationType", value: 8, isUnsigned: true)
!353 = !DIEnumerator(name: "ColorSeparationMatteType", value: 9, isUnsigned: true)
!354 = !DIEnumerator(name: "OptimizeType", value: 10, isUnsigned: true)
!355 = !DIEnumerator(name: "PaletteBilevelMatteType", value: 11, isUnsigned: true)
!356 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !326, line: 67, baseType: !5, size: 32, elements: !357)
!357 = !{!358, !359, !360, !361, !362, !363, !364, !365, !366, !367}
!358 = !DIEnumerator(name: "UndefinedPixelIntensityMethod", value: 0, isUnsigned: true)
!359 = !DIEnumerator(name: "AveragePixelIntensityMethod", value: 1, isUnsigned: true)
!360 = !DIEnumerator(name: "BrightnessPixelIntensityMethod", value: 2, isUnsigned: true)
!361 = !DIEnumerator(name: "LightnessPixelIntensityMethod", value: 3, isUnsigned: true)
!362 = !DIEnumerator(name: "Rec601LumaPixelIntensityMethod", value: 4, isUnsigned: true)
!363 = !DIEnumerator(name: "Rec601LuminancePixelIntensityMethod", value: 5, isUnsigned: true)
!364 = !DIEnumerator(name: "Rec709LumaPixelIntensityMethod", value: 6, isUnsigned: true)
!365 = !DIEnumerator(name: "Rec709LuminancePixelIntensityMethod", value: 7, isUnsigned: true)
!366 = !DIEnumerator(name: "RMSPixelIntensityMethod", value: 8, isUnsigned: true)
!367 = !DIEnumerator(name: "MSPixelIntensityMethod", value: 9, isUnsigned: true)
!368 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !369, line: 34, baseType: !5, size: 32, elements: !370)
!369 = !DIFile(filename: "./magick/log.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!370 = !{!371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392}
!371 = !DIEnumerator(name: "UndefinedEvents", value: 0, isUnsigned: true)
!372 = !DIEnumerator(name: "NoEvents", value: 0, isUnsigned: true)
!373 = !DIEnumerator(name: "TraceEvent", value: 1, isUnsigned: true)
!374 = !DIEnumerator(name: "AnnotateEvent", value: 2, isUnsigned: true)
!375 = !DIEnumerator(name: "BlobEvent", value: 4, isUnsigned: true)
!376 = !DIEnumerator(name: "CacheEvent", value: 8, isUnsigned: true)
!377 = !DIEnumerator(name: "CoderEvent", value: 16, isUnsigned: true)
!378 = !DIEnumerator(name: "ConfigureEvent", value: 32, isUnsigned: true)
!379 = !DIEnumerator(name: "DeprecateEvent", value: 64, isUnsigned: true)
!380 = !DIEnumerator(name: "DrawEvent", value: 128, isUnsigned: true)
!381 = !DIEnumerator(name: "ExceptionEvent", value: 256, isUnsigned: true)
!382 = !DIEnumerator(name: "ImageEvent", value: 512, isUnsigned: true)
!383 = !DIEnumerator(name: "LocaleEvent", value: 1024, isUnsigned: true)
!384 = !DIEnumerator(name: "ModuleEvent", value: 2048, isUnsigned: true)
!385 = !DIEnumerator(name: "PolicyEvent", value: 4096, isUnsigned: true)
!386 = !DIEnumerator(name: "ResourceEvent", value: 8192, isUnsigned: true)
!387 = !DIEnumerator(name: "TransformEvent", value: 16384, isUnsigned: true)
!388 = !DIEnumerator(name: "UserEvent", value: 36864, isUnsigned: true)
!389 = !DIEnumerator(name: "WandEvent", value: 65536, isUnsigned: true)
!390 = !DIEnumerator(name: "X11Event", value: 131072, isUnsigned: true)
!391 = !DIEnumerator(name: "AccelerateEvent", value: 262144, isUnsigned: true)
!392 = !DIEnumerator(name: "AllEvents", value: 2147483647, isUnsigned: true)
!393 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !394, line: 46, baseType: !5, size: 32, elements: !395)
!394 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!395 = !{!396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407}
!396 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!397 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!398 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!399 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!400 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!401 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!402 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!403 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!404 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!405 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!406 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!407 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!408 = !{!409, !465, !422, !469, !577, !600, !439, !478, !474, !631, !632, !420, !634}
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "Image", file: !4, line: 221, baseType: !411)
!411 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Image", file: !73, line: 150, size: 105920, elements: !412)
!412 = !{!413, !415, !417, !419, !423, !425, !427, !428, !429, !430, !431, !432, !443, !444, !445, !446, !448, !462, !464, !466, !468, !471, !472, !473, !479, !480, !481, !489, !490, !491, !492, !493, !494, !496, !498, !500, !502, !504, !506, !508, !509, !510, !511, !512, !513, !514, !522, !537, !551, !552, !553, !554, !558, !562, !566, !567, !568, !569, !570, !588, !589, !591, !592, !602, !603, !605, !606, !607, !608, !609, !610, !612, !613, !614, !615, !616, !617, !618, !620, !621, !622, !623, !624, !628, !630}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "storage_class", scope: !411, file: !73, line: 153, baseType: !414, size: 32)
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "ClassType", file: !4, line: 209, baseType: !3)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !411, file: !73, line: 156, baseType: !416, size: 32, offset: 32)
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorspaceType", file: !11, line: 61, baseType: !10)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !411, file: !73, line: 159, baseType: !418, size: 32, offset: 64)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompressionType", file: !48, line: 49, baseType: !47)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !411, file: !73, line: 162, baseType: !420, size: 64, offset: 128)
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !421, line: 46, baseType: !422)
!421 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!422 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !411, file: !73, line: 165, baseType: !424, size: 32, offset: 192)
!424 = !DIDerivedType(tag: DW_TAG_typedef, name: "OrientationType", file: !73, line: 86, baseType: !72)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "taint", scope: !411, file: !73, line: 168, baseType: !426, size: 32, offset: 224)
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickBooleanType", file: !4, line: 215, baseType: !84)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "matte", scope: !411, file: !73, line: 169, baseType: !426, size: 32, offset: 256)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !411, file: !73, line: 172, baseType: !420, size: 64, offset: 320)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !411, file: !73, line: 173, baseType: !420, size: 64, offset: 384)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !411, file: !73, line: 174, baseType: !420, size: 64, offset: 448)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !411, file: !73, line: 175, baseType: !420, size: 64, offset: 512)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "colormap", scope: !411, file: !73, line: 178, baseType: !433, size: 64, offset: 576)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelPacket", file: !326, line: 148, baseType: !435)
!435 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PixelPacket", file: !326, line: 131, size: 64, elements: !436)
!436 = !{!437, !440, !441, !442}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !435, file: !326, line: 143, baseType: !438, size: 16)
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "Quantum", file: !4, line: 93, baseType: !439)
!439 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !435, file: !326, line: 144, baseType: !438, size: 16, offset: 16)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !435, file: !326, line: 145, baseType: !438, size: 16, offset: 32)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !435, file: !326, line: 146, baseType: !438, size: 16, offset: 48)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "background_color", scope: !411, file: !73, line: 179, baseType: !434, size: 64, offset: 640)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !411, file: !73, line: 180, baseType: !434, size: 64, offset: 704)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "matte_color", scope: !411, file: !73, line: 181, baseType: !434, size: 64, offset: 768)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !411, file: !73, line: 184, baseType: !447, size: 64, offset: 832)
!447 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "chromaticity", scope: !411, file: !73, line: 187, baseType: !449, size: 768, offset: 896)
!449 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChromaticityInfo", file: !73, line: 128, baseType: !450)
!450 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ChromaticityInfo", file: !73, line: 121, size: 768, elements: !451)
!451 = !{!452, !459, !460, !461}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "red_primary", scope: !450, file: !73, line: 124, baseType: !453, size: 192)
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "PrimaryInfo", file: !73, line: 101, baseType: !454)
!454 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PrimaryInfo", file: !73, line: 95, size: 192, elements: !455)
!455 = !{!456, !457, !458}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !454, file: !73, line: 98, baseType: !447, size: 64)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !454, file: !73, line: 99, baseType: !447, size: 64, offset: 64)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !454, file: !73, line: 100, baseType: !447, size: 64, offset: 128)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "green_primary", scope: !450, file: !73, line: 125, baseType: !453, size: 192, offset: 192)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "blue_primary", scope: !450, file: !73, line: 126, baseType: !453, size: 192, offset: 384)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "white_point", scope: !450, file: !73, line: 127, baseType: !453, size: 192, offset: 576)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "rendering_intent", scope: !411, file: !73, line: 190, baseType: !463, size: 32, offset: 1664)
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderingIntent", file: !89, line: 49, baseType: !88)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !411, file: !73, line: 193, baseType: !465, size: 64, offset: 1728)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !411, file: !73, line: 196, baseType: !467, size: 32, offset: 1792)
!467 = !DIDerivedType(tag: DW_TAG_typedef, name: "ResolutionType", file: !73, line: 93, baseType: !96)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "montage", scope: !411, file: !73, line: 199, baseType: !469, size: 64, offset: 1856)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64)
!470 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "directory", scope: !411, file: !73, line: 200, baseType: !469, size: 64, offset: 1920)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "geometry", scope: !411, file: !73, line: 201, baseType: !469, size: 64, offset: 1984)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !411, file: !73, line: 204, baseType: !474, size: 64, offset: 2048)
!474 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !475, line: 77, baseType: !476)
!475 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !477, line: 193, baseType: !478)
!477 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!478 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "x_resolution", scope: !411, file: !73, line: 207, baseType: !447, size: 64, offset: 2112)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "y_resolution", scope: !411, file: !73, line: 208, baseType: !447, size: 64, offset: 2176)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !411, file: !73, line: 211, baseType: !482, size: 256, offset: 2240)
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "RectangleInfo", file: !153, line: 130, baseType: !483)
!483 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_RectangleInfo", file: !153, line: 121, size: 256, elements: !484)
!484 = !{!485, !486, !487, !488}
!485 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !483, file: !153, line: 124, baseType: !420, size: 64)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !483, file: !153, line: 125, baseType: !420, size: 64, offset: 64)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !483, file: !153, line: 128, baseType: !474, size: 64, offset: 128)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !483, file: !153, line: 129, baseType: !474, size: 64, offset: 192)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "extract_info", scope: !411, file: !73, line: 212, baseType: !482, size: 256, offset: 2496)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "tile_info", scope: !411, file: !73, line: 213, baseType: !482, size: 256, offset: 2752)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "bias", scope: !411, file: !73, line: 216, baseType: !447, size: 64, offset: 3008)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "blur", scope: !411, file: !73, line: 217, baseType: !447, size: 64, offset: 3072)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !411, file: !73, line: 218, baseType: !447, size: 64, offset: 3136)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !411, file: !73, line: 221, baseType: !495, size: 32, offset: 3200)
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "FilterTypes", file: !102, line: 66, baseType: !101)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "interlace", scope: !411, file: !73, line: 224, baseType: !497, size: 32, offset: 3232)
!497 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterlaceType", file: !73, line: 73, baseType: !136)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !411, file: !73, line: 227, baseType: !499, size: 32, offset: 3264)
!499 = !DIDerivedType(tag: DW_TAG_typedef, name: "EndianType", file: !147, line: 35, baseType: !146)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !411, file: !73, line: 230, baseType: !501, size: 32, offset: 3296)
!501 = !DIDerivedType(tag: DW_TAG_typedef, name: "GravityType", file: !153, line: 91, baseType: !152)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !411, file: !73, line: 233, baseType: !503, size: 32, offset: 3328)
!503 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompositeOperator", file: !168, line: 99, baseType: !167)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "dispose", scope: !411, file: !73, line: 236, baseType: !505, size: 32, offset: 3360)
!505 = !DIDerivedType(tag: DW_TAG_typedef, name: "DisposeType", file: !239, line: 32, baseType: !238)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "clip_mask", scope: !411, file: !73, line: 239, baseType: !507, size: 64, offset: 3392)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !411, file: !73, line: 242, baseType: !420, size: 64, offset: 3456)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !411, file: !73, line: 243, baseType: !420, size: 64, offset: 3520)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_second", scope: !411, file: !73, line: 246, baseType: !474, size: 64, offset: 3584)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "iterations", scope: !411, file: !73, line: 249, baseType: !420, size: 64, offset: 3648)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "total_colors", scope: !411, file: !73, line: 250, baseType: !420, size: 64, offset: 3712)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "start_loop", scope: !411, file: !73, line: 253, baseType: !474, size: 64, offset: 3776)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !411, file: !73, line: 256, baseType: !515, size: 192, offset: 3840)
!515 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErrorInfo", file: !516, line: 68, baseType: !517)
!516 = !DIFile(filename: "./magick/color.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!517 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ErrorInfo", file: !516, line: 62, size: 192, elements: !518)
!518 = !{!519, !520, !521}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "mean_error_per_pixel", scope: !517, file: !516, line: 65, baseType: !447, size: 64)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_mean_error", scope: !517, file: !516, line: 66, baseType: !447, size: 64, offset: 64)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_maximum_error", scope: !517, file: !516, line: 67, baseType: !447, size: 64, offset: 128)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !411, file: !73, line: 259, baseType: !523, size: 512, offset: 4032)
!523 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerInfo", file: !247, line: 51, baseType: !524)
!524 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TimerInfo", file: !247, line: 40, size: 512, elements: !525)
!525 = !{!526, !533, !534, !536}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !524, file: !247, line: 43, baseType: !527, size: 192)
!527 = !DIDerivedType(tag: DW_TAG_typedef, name: "Timer", file: !247, line: 38, baseType: !528)
!528 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Timer", file: !247, line: 32, size: 192, elements: !529)
!529 = !{!530, !531, !532}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !528, file: !247, line: 35, baseType: !447, size: 64)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !528, file: !247, line: 36, baseType: !447, size: 64, offset: 64)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !528, file: !247, line: 37, baseType: !447, size: 64, offset: 128)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "elapsed", scope: !524, file: !247, line: 44, baseType: !527, size: 192, offset: 192)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !524, file: !247, line: 47, baseType: !535, size: 32, offset: 384)
!535 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerState", file: !247, line: 30, baseType: !246)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !524, file: !247, line: 50, baseType: !420, size: 64, offset: 448)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !411, file: !73, line: 262, baseType: !538, size: 64, offset: 4544)
!538 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickProgressMonitor", file: !539, line: 26, baseType: !540)
!539 = !DIFile(filename: "./magick/monitor.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64)
!541 = !DISubroutineType(types: !542)
!542 = !{!426, !543, !545, !548, !465}
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64)
!544 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !470)
!545 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !546)
!546 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickOffsetType", file: !4, line: 150, baseType: !547)
!547 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!548 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !549)
!549 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickSizeType", file: !4, line: 151, baseType: !550)
!550 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !411, file: !73, line: 265, baseType: !465, size: 64, offset: 4608)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !411, file: !73, line: 266, baseType: !465, size: 64, offset: 4672)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !411, file: !73, line: 267, baseType: !465, size: 64, offset: 4736)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "ascii85", scope: !411, file: !73, line: 270, baseType: !555, size: 64, offset: 4800)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64)
!556 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ascii85Info", file: !48, line: 52, baseType: !557)
!557 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Ascii85Info", file: !48, line: 51, flags: DIFlagFwdDecl)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !411, file: !73, line: 273, baseType: !559, size: 64, offset: 4864)
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 64)
!560 = !DIDerivedType(tag: DW_TAG_typedef, name: "BlobInfo", file: !4, line: 217, baseType: !561)
!561 = !DICompositeType(tag: DW_TAG_structure_type, name: "_BlobInfo", file: !4, line: 217, flags: DIFlagFwdDecl)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !411, file: !73, line: 276, baseType: !563, size: 32768, offset: 4928)
!563 = !DICompositeType(tag: DW_TAG_array_type, baseType: !470, size: 32768, elements: !564)
!564 = !{!565}
!565 = !DISubrange(count: 4096)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "magick_filename", scope: !411, file: !73, line: 277, baseType: !563, size: 32768, offset: 37696)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !411, file: !73, line: 278, baseType: !563, size: 32768, offset: 70464)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "magick_columns", scope: !411, file: !73, line: 281, baseType: !420, size: 64, offset: 103232)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "magick_rows", scope: !411, file: !73, line: 282, baseType: !420, size: 64, offset: 103296)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "exception", scope: !411, file: !73, line: 285, baseType: !571, size: 448, offset: 103360)
!571 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionInfo", file: !4, line: 219, baseType: !572)
!572 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ExceptionInfo", file: !253, line: 102, size: 448, elements: !573)
!573 = !{!574, !576, !578, !579, !580, !581, !582, !587}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "severity", scope: !572, file: !253, line: 105, baseType: !575, size: 32)
!575 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionType", file: !253, line: 100, baseType: !252)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "error_number", scope: !572, file: !253, line: 108, baseType: !577, size: 32, offset: 32)
!577 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !572, file: !253, line: 111, baseType: !469, size: 64, offset: 64)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !572, file: !253, line: 112, baseType: !469, size: 64, offset: 128)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "exceptions", scope: !572, file: !253, line: 115, baseType: !465, size: 64, offset: 192)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "relinquish", scope: !572, file: !253, line: 118, baseType: !426, size: 32, offset: 256)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !572, file: !253, line: 121, baseType: !583, size: 64, offset: 320)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64)
!584 = !DIDerivedType(tag: DW_TAG_typedef, name: "SemaphoreInfo", file: !585, line: 26, baseType: !586)
!585 = !DIFile(filename: "./magick/semaphore.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!586 = !DICompositeType(tag: DW_TAG_structure_type, name: "SemaphoreInfo", file: !585, line: 25, flags: DIFlagFwdDecl)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !572, file: !253, line: 124, baseType: !420, size: 64, offset: 384)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !411, file: !73, line: 288, baseType: !426, size: 32, offset: 103808)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !411, file: !73, line: 291, baseType: !590, size: 64, offset: 103872)
!590 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !474)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !411, file: !73, line: 294, baseType: !583, size: 64, offset: 103936)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "color_profile", scope: !411, file: !73, line: 297, baseType: !593, size: 256, offset: 104000)
!593 = !DIDerivedType(tag: DW_TAG_typedef, name: "ProfileInfo", file: !89, line: 40, baseType: !594)
!594 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ProfileInfo", file: !89, line: 27, size: 256, elements: !595)
!595 = !{!596, !597, !598, !601}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !594, file: !89, line: 30, baseType: !469, size: 64)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !594, file: !89, line: 33, baseType: !420, size: 64, offset: 64)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !594, file: !89, line: 36, baseType: !599, size: 64, offset: 128)
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64)
!600 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !594, file: !89, line: 39, baseType: !420, size: 64, offset: 192)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "iptc_profile", scope: !411, file: !73, line: 298, baseType: !593, size: 256, offset: 104256)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profile", scope: !411, file: !73, line: 299, baseType: !604, size: 64, offset: 104512)
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 64)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profiles", scope: !411, file: !73, line: 302, baseType: !420, size: 64, offset: 104576)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !411, file: !73, line: 305, baseType: !420, size: 64, offset: 104640)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !411, file: !73, line: 308, baseType: !507, size: 64, offset: 104704)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !411, file: !73, line: 309, baseType: !507, size: 64, offset: 104768)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !411, file: !73, line: 310, baseType: !507, size: 64, offset: 104832)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "interpolate", scope: !411, file: !73, line: 313, baseType: !611, size: 32, offset: 104896)
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterpolatePixelMethod", file: !326, line: 47, baseType: !325)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "black_point_compensation", scope: !411, file: !73, line: 316, baseType: !426, size: 32, offset: 104928)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_color", scope: !411, file: !73, line: 319, baseType: !434, size: 64, offset: 104960)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !411, file: !73, line: 322, baseType: !507, size: 64, offset: 105024)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "tile_offset", scope: !411, file: !73, line: 325, baseType: !482, size: 256, offset: 105088)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !411, file: !73, line: 328, baseType: !465, size: 64, offset: 105344)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "artifacts", scope: !411, file: !73, line: 329, baseType: !465, size: 64, offset: 105408)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !411, file: !73, line: 332, baseType: !619, size: 32, offset: 105472)
!619 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageType", file: !73, line: 61, baseType: !342)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !411, file: !73, line: 335, baseType: !426, size: 32, offset: 105504)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !411, file: !73, line: 338, baseType: !549, size: 64, offset: 105536)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "ping", scope: !411, file: !73, line: 341, baseType: !426, size: 32, offset: 105600)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !411, file: !73, line: 344, baseType: !420, size: 64, offset: 105664)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !411, file: !73, line: 347, baseType: !625, size: 64, offset: 105728)
!625 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !626, line: 7, baseType: !627)
!626 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "")
!627 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !477, line: 160, baseType: !478)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "intensity", scope: !411, file: !73, line: 350, baseType: !629, size: 32, offset: 105792)
!629 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelIntensityMethod", file: !326, line: 79, baseType: !356)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !411, file: !73, line: 353, baseType: !420, size: 64, offset: 105856)
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !633, size: 64)
!633 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !410)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!635 = !{i32 7, !"Dwarf Version", i32 4}
!636 = !{i32 2, !"Debug Info Version", i32 3}
!637 = !{i32 1, !"wchar_size", i32 4}
!638 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!639 = distinct !DISubprogram(name: "AppendImageToList", scope: !1, file: !1, line: 77, type: !640, scopeLine: 78, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !642)
!640 = !DISubroutineType(types: !641)
!641 = !{null, !634, !632}
!642 = !{}
!643 = !DILocalVariable(name: "images", arg: 1, scope: !639, file: !1, line: 77, type: !634)
!644 = !DILocation(line: 77, column: 45, scope: !639)
!645 = !DILocalVariable(name: "append", arg: 2, scope: !639, file: !1, line: 77, type: !632)
!646 = !DILocation(line: 77, column: 65, scope: !639)
!647 = !DILocalVariable(name: "p", scope: !639, file: !1, line: 80, type: !409)
!648 = !DILocation(line: 80, column: 6, scope: !639)
!649 = !DILocalVariable(name: "q", scope: !639, file: !1, line: 81, type: !409)
!650 = !DILocation(line: 81, column: 6, scope: !639)
!651 = !DILocation(line: 84, column: 7, scope: !652)
!652 = distinct !DILexicalBlock(scope: !639, file: !1, line: 84, column: 7)
!653 = !DILocation(line: 84, column: 14, scope: !652)
!654 = !DILocation(line: 84, column: 7, scope: !639)
!655 = !DILocation(line: 85, column: 5, scope: !652)
!656 = !DILocation(line: 87, column: 7, scope: !657)
!657 = distinct !DILexicalBlock(scope: !639, file: !1, line: 87, column: 7)
!658 = !DILocation(line: 87, column: 15, scope: !657)
!659 = !DILocation(line: 87, column: 21, scope: !657)
!660 = !DILocation(line: 87, column: 7, scope: !639)
!661 = !DILocation(line: 88, column: 61, scope: !657)
!662 = !DILocation(line: 88, column: 69, scope: !657)
!663 = !DILocation(line: 88, column: 12, scope: !657)
!664 = !DILocation(line: 88, column: 5, scope: !657)
!665 = !DILocation(line: 89, column: 9, scope: !666)
!666 = distinct !DILexicalBlock(scope: !639, file: !1, line: 89, column: 7)
!667 = !DILocation(line: 89, column: 8, scope: !666)
!668 = !DILocation(line: 89, column: 17, scope: !666)
!669 = !DILocation(line: 89, column: 7, scope: !639)
!670 = !DILocation(line: 91, column: 25, scope: !671)
!671 = distinct !DILexicalBlock(scope: !666, file: !1, line: 90, column: 5)
!672 = !DILocation(line: 91, column: 8, scope: !671)
!673 = !DILocation(line: 91, column: 14, scope: !671)
!674 = !DILocation(line: 92, column: 7, scope: !671)
!675 = !DILocation(line: 95, column: 25, scope: !639)
!676 = !DILocation(line: 95, column: 24, scope: !639)
!677 = !DILocation(line: 95, column: 5, scope: !639)
!678 = !DILocation(line: 95, column: 4, scope: !639)
!679 = !DILocation(line: 96, column: 25, scope: !639)
!680 = !DILocation(line: 96, column: 5, scope: !639)
!681 = !DILocation(line: 96, column: 4, scope: !639)
!682 = !DILocation(line: 97, column: 11, scope: !639)
!683 = !DILocation(line: 97, column: 3, scope: !639)
!684 = !DILocation(line: 97, column: 6, scope: !639)
!685 = !DILocation(line: 97, column: 10, scope: !639)
!686 = !DILocation(line: 98, column: 15, scope: !639)
!687 = !DILocation(line: 98, column: 3, scope: !639)
!688 = !DILocation(line: 98, column: 6, scope: !639)
!689 = !DILocation(line: 98, column: 14, scope: !639)
!690 = !DILocation(line: 99, column: 1, scope: !639)
!691 = distinct !DISubprogram(name: "GetLastImageInList", scope: !1, file: !1, line: 720, type: !692, scopeLine: 721, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !642)
!692 = !DISubroutineType(types: !693)
!693 = !{!409, !632}
