; ModuleID = 'magick/coder.c'
source_filename = "magick/coder.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.SemaphoreInfo = type opaque
%struct._SplayTreeInfo = type opaque
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct._CoderMapInfo = type { i8*, i8* }
%struct._CoderInfo = type { i8*, i8*, i8*, i32, i32, %struct._CoderInfo*, %struct._CoderInfo*, i64 }
%struct._ExceptionInfo = type { i32, i32, i8*, i8*, i8*, i32, %struct.SemaphoreInfo*, i64 }
%struct._StringInfo = type { [4096 x i8], i8*, i64, i64 }
%struct._LinkedListInfo = type opaque

@coder_semaphore = internal global %struct.SemaphoreInfo* null, align 8, !dbg !0
@coder_cache = internal global %struct._SplayTreeInfo* null, align 8, !dbg !235
@.str = private unnamed_addr constant [2 x i8] c"*\00", align 1
@.str.1 = private unnamed_addr constant [15 x i8] c"magick/coder.c\00", align 1
@.str.2 = private unnamed_addr constant [1 x i8] zeroinitializer, align 1
@.str.3 = private unnamed_addr constant [3 x i8] c"%s\00", align 1
@stdout = external dso_local global %struct._IO_FILE*, align 8

!70 = !DIEnumerator(name: "StreamFatalError", value: 740, isUnsigned: true)
!71 = !DIEnumerator(name: "CacheFatalError", value: 745, isUnsigned: true)
!72 = !DIEnumerator(name: "CoderFatalError", value: 750, isUnsigned: true)
!73 = !DIEnumerator(name: "FilterFatalError", value: 752, isUnsigned: true)
!74 = !DIEnumerator(name: "ModuleFatalError", value: 755, isUnsigned: true)
!75 = !DIEnumerator(name: "DrawFatalError", value: 760, isUnsigned: true)
!76 = !DIEnumerator(name: "ImageFatalError", value: 765, isUnsigned: true)
!77 = !DIEnumerator(name: "WandFatalError", value: 770, isUnsigned: true)
!78 = !DIEnumerator(name: "RandomFatalError", value: 775, isUnsigned: true)
!79 = !DIEnumerator(name: "XServerFatalError", value: 780, isUnsigned: true)
!80 = !DIEnumerator(name: "MonitorFatalError", value: 785, isUnsigned: true)
!81 = !DIEnumerator(name: "RegistryFatalError", value: 790, isUnsigned: true)
!82 = !DIEnumerator(name: "ConfigureFatalError", value: 795, isUnsigned: true)
!83 = !DIEnumerator(name: "PolicyFatalError", value: 799, isUnsigned: true)
!84 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !85, line: 34, baseType: !7, size: 32, elements: !86)
!85 = !DIFile(filename: "./magick/log.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!86 = !{!87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108}
!87 = !DIEnumerator(name: "UndefinedEvents", value: 0, isUnsigned: true)
!88 = !DIEnumerator(name: "NoEvents", value: 0, isUnsigned: true)
!89 = !DIEnumerator(name: "TraceEvent", value: 1, isUnsigned: true)
!90 = !DIEnumerator(name: "AnnotateEvent", value: 2, isUnsigned: true)
!91 = !DIEnumerator(name: "BlobEvent", value: 4, isUnsigned: true)
!92 = !DIEnumerator(name: "CacheEvent", value: 8, isUnsigned: true)
!93 = !DIEnumerator(name: "CoderEvent", value: 16, isUnsigned: true)
!94 = !DIEnumerator(name: "ConfigureEvent", value: 32, isUnsigned: true)
!95 = !DIEnumerator(name: "DeprecateEvent", value: 64, isUnsigned: true)
!96 = !DIEnumerator(name: "DrawEvent", value: 128, isUnsigned: true)
!97 = !DIEnumerator(name: "ExceptionEvent", value: 256, isUnsigned: true)
!98 = !DIEnumerator(name: "ImageEvent", value: 512, isUnsigned: true)
!99 = !DIEnumerator(name: "LocaleEvent", value: 1024, isUnsigned: true)
!100 = !DIEnumerator(name: "ModuleEvent", value: 2048, isUnsigned: true)
!101 = !DIEnumerator(name: "PolicyEvent", value: 4096, isUnsigned: true)
!102 = !DIEnumerator(name: "ResourceEvent", value: 8192, isUnsigned: true)
!103 = !DIEnumerator(name: "TransformEvent", value: 16384, isUnsigned: true)
!104 = !DIEnumerator(name: "UserEvent", value: 36864, isUnsigned: true)
!105 = !DIEnumerator(name: "WandEvent", value: 65536, isUnsigned: true)
!106 = !DIEnumerator(name: "X11Event", value: 131072, isUnsigned: true)
!107 = !DIEnumerator(name: "AccelerateEvent", value: 262144, isUnsigned: true)
!108 = !DIEnumerator(name: "AllEvents", value: 2147483647, isUnsigned: true)
!109 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !110, line: 25, baseType: !7, size: 32, elements: !111)
!110 = !DIFile(filename: "./magick/utility.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!111 = !{!112, !113, !114, !115, !116, !117, !118, !119, !120}
!112 = !DIEnumerator(name: "UndefinedPath", value: 0, isUnsigned: true)
!113 = !DIEnumerator(name: "MagickPath", value: 1, isUnsigned: true)
!114 = !DIEnumerator(name: "RootPath", value: 2, isUnsigned: true)
!115 = !DIEnumerator(name: "HeadPath", value: 3, isUnsigned: true)
!116 = !DIEnumerator(name: "TailPath", value: 4, isUnsigned: true)
!117 = !DIEnumerator(name: "BasePath", value: 5, isUnsigned: true)
!118 = !DIEnumerator(name: "ExtensionPath", value: 6, isUnsigned: true)
!119 = !DIEnumerator(name: "SubimagePath", value: 7, isUnsigned: true)
!120 = !DIEnumerator(name: "CanonicalPath", value: 8, isUnsigned: true)
!121 = !{!122, !126, !127, !131, !152, !151, !154, !149, !155, !156, !138, !157, !215, !218, !165, !219}
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "SemaphoreInfo", file: !124, line: 26, baseType: !125)
!124 = !DIFile(filename: "./magick/semaphore.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!125 = !DICompositeType(tag: DW_TAG_structure_type, name: "SemaphoreInfo", file: !124, line: 25, flags: DIFlagFwdDecl)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "SplayTreeInfo", file: !129, line: 26, baseType: !130)
!129 = !DIFile(filename: "./magick/splay-tree.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!130 = !DICompositeType(tag: DW_TAG_structure_type, name: "_SplayTreeInfo", file: !129, line: 25, flags: DIFlagFwdDecl)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !133)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "CoderInfo", file: !134, line: 42, baseType: !135)
!134 = !DIFile(filename: "./magick/coder.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_CoderInfo", file: !134, line: 25, size: 448, elements: !136)
!136 = !{!137, !140, !141, !142, !144, !145, !147, !148}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !135, file: !134, line: 28, baseType: !138, size: 64)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !135, file: !134, line: 29, baseType: !138, size: 64, offset: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !135, file: !134, line: 30, baseType: !138, size: 64, offset: 128)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "exempt", scope: !135, file: !134, line: 33, baseType: !143, size: 32, offset: 192)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickBooleanType", file: !6, line: 215, baseType: !5)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "stealth", scope: !135, file: !134, line: 34, baseType: !143, size: 32, offset: 224)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !135, file: !134, line: 37, baseType: !146, size: 64, offset: 256)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !135, file: !134, line: 38, baseType: !146, size: 64, offset: 320)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !135, file: !134, line: 41, baseType: !149, size: 64, offset: 384)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !150, line: 46, baseType: !151)
!150 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!151 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !139)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !159)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !160, line: 7, baseType: !161)
!160 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !162, line: 49, size: 1728, elements: !163)
!162 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!163 = !{!164, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !180, !182, !183, !184, !188, !190, !192, !196, !199, !201, !204, !207, !208, !209, !210, !211}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !161, file: !162, line: 51, baseType: !165, size: 32)
!165 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !161, file: !162, line: 54, baseType: !138, size: 64, offset: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !161, file: !162, line: 55, baseType: !138, size: 64, offset: 128)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !161, file: !162, line: 56, baseType: !138, size: 64, offset: 192)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !161, file: !162, line: 57, baseType: !138, size: 64, offset: 256)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !161, file: !162, line: 58, baseType: !138, size: 64, offset: 320)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !161, file: !162, line: 59, baseType: !138, size: 64, offset: 384)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !161, file: !162, line: 60, baseType: !138, size: 64, offset: 448)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !161, file: !162, line: 61, baseType: !138, size: 64, offset: 512)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !161, file: !162, line: 64, baseType: !138, size: 64, offset: 576)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !161, file: !162, line: 65, baseType: !138, size: 64, offset: 640)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !161, file: !162, line: 66, baseType: !138, size: 64, offset: 704)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !161, file: !162, line: 68, baseType: !178, size: 64, offset: 768)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !162, line: 36, flags: DIFlagFwdDecl)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !161, file: !162, line: 70, baseType: !181, size: 64, offset: 832)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !161, file: !162, line: 72, baseType: !165, size: 32, offset: 896)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !161, file: !162, line: 73, baseType: !165, size: 32, offset: 928)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !161, file: !162, line: 74, baseType: !185, size: 64, offset: 960)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !186, line: 152, baseType: !187)
!186 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!187 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !161, file: !162, line: 77, baseType: !189, size: 16, offset: 1024)
!189 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !161, file: !162, line: 78, baseType: !191, size: 8, offset: 1040)
!191 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !161, file: !162, line: 79, baseType: !193, size: 8, offset: 1048)
!193 = !DICompositeType(tag: DW_TAG_array_type, baseType: !139, size: 8, elements: !194)
!194 = !{!195}
!195 = !DISubrange(count: 1)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !161, file: !162, line: 81, baseType: !197, size: 64, offset: 1088)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !162, line: 43, baseType: null)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !161, file: !162, line: 89, baseType: !200, size: 64, offset: 1152)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !186, line: 153, baseType: !187)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !161, file: !162, line: 91, baseType: !202, size: 64, offset: 1216)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!203 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !162, line: 37, flags: DIFlagFwdDecl)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !161, file: !162, line: 92, baseType: !205, size: 64, offset: 1280)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !162, line: 38, flags: DIFlagFwdDecl)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !161, file: !162, line: 93, baseType: !181, size: 64, offset: 1344)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !161, file: !162, line: 94, baseType: !126, size: 64, offset: 1408)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !161, file: !162, line: 95, baseType: !149, size: 64, offset: 1472)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !161, file: !162, line: 96, baseType: !165, size: 32, offset: 1536)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !161, file: !162, line: 98, baseType: !212, size: 160, offset: 1568)
!212 = !DICompositeType(tag: DW_TAG_array_type, baseType: !139, size: 160, elements: !213)
!213 = !{!214}
!214 = !DISubrange(count: 20)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !216, line: 77, baseType: !217)
!216 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !186, line: 193, baseType: !187)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!220 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !221)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "StringInfo", file: !222, line: 40, baseType: !223)
!222 = !DIFile(filename: "./magick/string_.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!223 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_StringInfo", file: !222, line: 29, size: 32960, elements: !224)
!224 = !{!225, !229, !232, !233}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !223, file: !222, line: 32, baseType: !226, size: 32768)
!226 = !DICompositeType(tag: DW_TAG_array_type, baseType: !139, size: 32768, elements: !227)
!227 = !{!228}
!228 = !DISubrange(count: 4096)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "datum", scope: !223, file: !222, line: 35, baseType: !230, size: 64, offset: 32768)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!231 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !223, file: !222, line: 38, baseType: !149, size: 64, offset: 32832)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !223, file: !222, line: 39, baseType: !149, size: 64, offset: 32896)
!234 = !{!0, !235, !237}
!235 = !DIGlobalVariableExpression(var: !236, expr: !DIExpression())
!236 = distinct !DIGlobalVariable(name: "coder_cache", scope: !2, file: !3, line: 236, type: !127, isLocal: true, isDefinition: true)
!237 = !DIGlobalVariableExpression(var: !238, expr: !DIExpression())
!238 = distinct !DIGlobalVariable(name: "CoderMap", scope: !2, file: !3, line: 81, type: !239, isLocal: true, isDefinition: true)
!239 = !DICompositeType(tag: DW_TAG_array_type, baseType: !240, size: 18432, elements: !246)
!240 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !241)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "CoderMapInfo", file: !3, line: 75, baseType: !242)
!242 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_CoderMapInfo", file: !3, line: 70, size: 128, elements: !243)
!243 = !{!244, !245}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !242, file: !3, line: 73, baseType: !152, size: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !242, file: !3, line: 74, baseType: !152, size: 64, offset: 64)
!246 = !{!247}
!247 = !DISubrange(count: 144)
!248 = !{i32 7, !"Dwarf Version", i32 4}
!249 = !{i32 2, !"Debug Info Version", i32 3}
!250 = !{i32 1, !"wchar_size", i32 4}
!251 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!252 = distinct !DISubprogram(name: "CoderComponentGenesis", scope: !3, file: !3, line: 378, type: !253, scopeLine: 379, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !255)
!253 = !DISubroutineType(types: !254)
!254 = !{!143}
!255 = !{}
!256 = !DILocation(line: 380, column: 7, scope: !257)
!257 = distinct !DILexicalBlock(scope: !252, file: !3, line: 380, column: 7)
!258 = !DILocation(line: 380, column: 23, scope: !257)
!259 = !DILocation(line: 380, column: 7, scope: !252)
!260 = !DILocation(line: 381, column: 21, scope: !257)
!261 = !DILocation(line: 381, column: 20, scope: !257)
!262 = !DILocation(line: 381, column: 5, scope: !257)
!263 = !DILocation(line: 382, column: 3, scope: !252)
!264 = distinct !DISubprogram(name: "CoderComponentTerminus", scope: !3, file: !3, line: 403, type: !265, scopeLine: 404, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !255)
!265 = !DISubroutineType(types: !266)
!266 = !{null}
!267 = !DILocation(line: 405, column: 7, scope: !268)
!268 = distinct !DILexicalBlock(scope: !264, file: !3, line: 405, column: 7)
!269 = !DILocation(line: 405, column: 23, scope: !268)
!270 = !DILocation(line: 405, column: 7, scope: !264)
!271 = !DILocation(line: 406, column: 5, scope: !268)
!272 = !DILocation(line: 407, column: 21, scope: !264)
!273 = !DILocation(line: 407, column: 3, scope: !264)
!274 = !DILocation(line: 408, column: 7, scope: !275)
!275 = distinct !DILexicalBlock(scope: !264, file: !3, line: 408, column: 7)
!276 = !DILocation(line: 408, column: 19, scope: !275)
!277 = !DILocation(line: 408, column: 7, scope: !264)
!278 = !DILocation(line: 409, column: 34, scope: !275)
!279 = !DILocation(line: 409, column: 17, scope: !275)
!280 = !DILocation(line: 409, column: 16, scope: !275)
!281 = !DILocation(line: 409, column: 5, scope: !275)
!282 = !DILocation(line: 410, column: 23, scope: !264)
!283 = !DILocation(line: 410, column: 3, scope: !264)
!284 = !DILocation(line: 411, column: 3, scope: !264)
!285 = !DILocation(line: 412, column: 1, scope: !264)
!286 = distinct !DISubprogram(name: "GetCoderInfo", scope: !3, file: !3, line: 439, type: !287, scopeLine: 441, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !255)
!287 = !DISubroutineType(types: !288)
!288 = !{!131, !152, !289}
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionInfo", file: !6, line: 219, baseType: !291)
!291 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ExceptionInfo", file: !12, line: 102, size: 448, elements: !292)
!292 = !{!293, !295, !296, !297, !298, !299, !300, !301}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "severity", scope: !291, file: !12, line: 105, baseType: !294, size: 32)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionType", file: !12, line: 100, baseType: !11)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "error_number", scope: !291, file: !12, line: 108, baseType: !165, size: 32, offset: 32)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !291, file: !12, line: 111, baseType: !138, size: 64, offset: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !291, file: !12, line: 112, baseType: !138, size: 64, offset: 128)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "exceptions", scope: !291, file: !12, line: 115, baseType: !126, size: 64, offset: 192)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "relinquish", scope: !291, file: !12, line: 118, baseType: !143, size: 32, offset: 256)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !291, file: !12, line: 121, baseType: !122, size: 64, offset: 320)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !291, file: !12, line: 124, baseType: !149, size: 64, offset: 384)
!302 = !DILocalVariable(name: "name", arg: 1, scope: !286, file: !3, line: 439, type: !152)
!303 = !DILocation(line: 439, column: 56, scope: !286)
!304 = !DILocalVariable(name: "exception", arg: 2, scope: !286, file: !3, line: 440, type: !289)
!305 = !DILocation(line: 440, column: 18, scope: !286)
!306 = !DILocalVariable(name: "coder_info", scope: !286, file: !3, line: 443, type: !131)
!307 = !DILocation(line: 443, column: 6, scope: !286)
!308 = !DILocation(line: 446, column: 31, scope: !309)
!309 = distinct !DILexicalBlock(scope: !286, file: !3, line: 446, column: 7)
!310 = !DILocation(line: 446, column: 7, scope: !309)
!311 = !DILocation(line: 446, column: 42, scope: !309)
!312 = !DILocation(line: 446, column: 7, scope: !286)
!313 = !DILocation(line: 447, column: 5, scope: !309)
!314 = !DILocation(line: 448, column: 21, scope: !286)
!315 = !DILocation(line: 448, column: 3, scope: !286)
!316 = !DILocation(line: 449, column: 8, scope: !317)
!317 = distinct !DILexicalBlock(scope: !286, file: !3, line: 449, column: 7)
!318 = !DILocation(line: 449, column: 13, scope: !317)
!319 = !DILocation(line: 449, column: 37, scope: !317)
!320 = !DILocation(line: 449, column: 55, scope: !317)
!321 = !DILocation(line: 449, column: 41, scope: !317)
!322 = !DILocation(line: 449, column: 65, scope: !317)
!323 = !DILocation(line: 449, column: 7, scope: !286)
!324 = !DILocation(line: 451, column: 30, scope: !325)
!325 = distinct !DILexicalBlock(scope: !317, file: !3, line: 450, column: 5)
!326 = !DILocation(line: 451, column: 7, scope: !325)
!327 = !DILocation(line: 452, column: 62, scope: !325)
!328 = !DILocation(line: 452, column: 38, scope: !325)
!329 = !DILocation(line: 452, column: 18, scope: !325)
!330 = !DILocation(line: 452, column: 17, scope: !325)
!331 = !DILocation(line: 453, column: 27, scope: !325)
!332 = !DILocation(line: 453, column: 7, scope: !325)
!333 = !DILocation(line: 454, column: 14, scope: !325)
!334 = !DILocation(line: 454, column: 7, scope: !325)
!335 = !DILocation(line: 456, column: 56, scope: !286)
!336 = !DILocation(line: 456, column: 68, scope: !286)
!337 = !DILocation(line: 456, column: 34, scope: !286)
!338 = !DILocation(line: 456, column: 14, scope: !286)
!339 = !DILocation(line: 456, column: 13, scope: !286)
!340 = !DILocation(line: 457, column: 23, scope: !286)
!341 = !DILocation(line: 457, column: 3, scope: !286)
!342 = !DILocation(line: 458, column: 10, scope: !286)
!343 = !DILocation(line: 458, column: 3, scope: !286)
!344 = !DILocation(line: 459, column: 1, scope: !286)
!345 = distinct !DISubprogram(name: "IsCoderTreeInstantiated", scope: !3, file: !3, line: 655, type: !346, scopeLine: 656, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !255)
!346 = !DISubroutineType(types: !347)
!347 = !{!143, !289}
!348 = !DILocalVariable(name: "exception", arg: 1, scope: !345, file: !3, line: 655, type: !289)
!349 = !DILocation(line: 655, column: 65, scope: !345)
!350 = !DILocation(line: 657, column: 7, scope: !351)
!351 = distinct !DILexicalBlock(scope: !345, file: !3, line: 657, column: 7)
!352 = !DILocation(line: 657, column: 19, scope: !351)
!353 = !DILocation(line: 657, column: 7, scope: !345)
!354 = !DILocation(line: 659, column: 11, scope: !355)
!355 = distinct !DILexicalBlock(scope: !356, file: !3, line: 659, column: 11)
!356 = distinct !DILexicalBlock(scope: !351, file: !3, line: 658, column: 5)
!357 = !DILocation(line: 659, column: 27, scope: !355)
!358 = !DILocation(line: 659, column: 11, scope: !356)
!359 = !DILocation(line: 660, column: 9, scope: !355)
!360 = !DILocation(line: 661, column: 25, scope: !356)
!361 = !DILocation(line: 661, column: 7, scope: !356)
!362 = !DILocation(line: 662, column: 11, scope: !363)
!363 = distinct !DILexicalBlock(scope: !356, file: !3, line: 662, column: 11)
!364 = !DILocation(line: 662, column: 23, scope: !363)
