; ModuleID = 'magick/prepress.c'
source_filename = "magick/prepress.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._Image = type { i32, i32, i32, i64, i32, i32, i32, i64, i64, i64, i64, %struct._PixelPacket*, %struct._PixelPacket, %struct._PixelPacket, %struct._PixelPacket, double, %struct._ChromaticityInfo, i32, i8*, i32, i8*, i8*, i8*, i64, double, double, %struct._RectangleInfo, %struct._RectangleInfo, %struct._RectangleInfo, double, double, double, i32, i32, i32, i32, i32, i32, %struct._Image*, i64, i64, i64, i64, i64, i64, %struct._ErrorInfo, %struct._TimerInfo, i32 (i8*, i64, i64, i8*)*, i8*, i8*, i8*, %struct._Ascii85Info*, %struct._BlobInfo*, [4096 x i8], [4096 x i8], [4096 x i8], i64, i64, %struct._ExceptionInfo, i32, i64, %struct.SemaphoreInfo*, %struct._ProfileInfo, %struct._ProfileInfo, %struct._ProfileInfo*, i64, i64, %struct._Image*, %struct._Image*, %struct._Image*, i32, i32, %struct._PixelPacket, %struct._Image*, %struct._RectangleInfo, i8*, i8*, i32, i32, i64, i32, i64, i64, i32, i64 }
%struct._ChromaticityInfo = type { %struct._PrimaryInfo, %struct._PrimaryInfo, %struct._PrimaryInfo, %struct._PrimaryInfo }
%struct._PrimaryInfo = type { double, double, double }
%struct._ErrorInfo = type { double, double, double }
%struct._TimerInfo = type { %struct._Timer, %struct._Timer, i32, i64 }
%struct._Timer = type { double, double, double }

!335 = !DIEnumerator(name: "NearestNeighborInterpolatePixel", value: 7, isUnsigned: true)
!336 = !DIEnumerator(name: "SplineInterpolatePixel", value: 8, isUnsigned: true)
!337 = !DIEnumerator(name: "Average9InterpolatePixel", value: 9, isUnsigned: true)
!338 = !DIEnumerator(name: "Average16InterpolatePixel", value: 10, isUnsigned: true)
!339 = !DIEnumerator(name: "BlendInterpolatePixel", value: 11, isUnsigned: true)
!340 = !DIEnumerator(name: "BackgroundInterpolatePixel", value: 12, isUnsigned: true)
!341 = !DIEnumerator(name: "CatromInterpolatePixel", value: 13, isUnsigned: true)
!342 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !73, line: 47, baseType: !5, size: 32, elements: !343)
!343 = !{!344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355}
!344 = !DIEnumerator(name: "UndefinedType", value: 0, isUnsigned: true)
!345 = !DIEnumerator(name: "BilevelType", value: 1, isUnsigned: true)
!346 = !DIEnumerator(name: "GrayscaleType", value: 2, isUnsigned: true)
!347 = !DIEnumerator(name: "GrayscaleMatteType", value: 3, isUnsigned: true)
!348 = !DIEnumerator(name: "PaletteType", value: 4, isUnsigned: true)
!349 = !DIEnumerator(name: "PaletteMatteType", value: 5, isUnsigned: true)
!350 = !DIEnumerator(name: "TrueColorType", value: 6, isUnsigned: true)
!351 = !DIEnumerator(name: "TrueColorMatteType", value: 7, isUnsigned: true)
!352 = !DIEnumerator(name: "ColorSeparationType", value: 8, isUnsigned: true)
!353 = !DIEnumerator(name: "ColorSeparationMatteType", value: 9, isUnsigned: true)
!354 = !DIEnumerator(name: "OptimizeType", value: 10, isUnsigned: true)
!355 = !DIEnumerator(name: "PaletteBilevelMatteType", value: 11, isUnsigned: true)
!356 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !326, line: 67, baseType: !5, size: 32, elements: !357)
!357 = !{!358, !359, !360, !361, !362, !363, !364, !365, !366, !367}
!358 = !DIEnumerator(name: "UndefinedPixelIntensityMethod", value: 0, isUnsigned: true)
!359 = !DIEnumerator(name: "AveragePixelIntensityMethod", value: 1, isUnsigned: true)
!360 = !DIEnumerator(name: "BrightnessPixelIntensityMethod", value: 2, isUnsigned: true)
!361 = !DIEnumerator(name: "LightnessPixelIntensityMethod", value: 3, isUnsigned: true)
!362 = !DIEnumerator(name: "Rec601LumaPixelIntensityMethod", value: 4, isUnsigned: true)
!363 = !DIEnumerator(name: "Rec601LuminancePixelIntensityMethod", value: 5, isUnsigned: true)
!364 = !DIEnumerator(name: "Rec709LumaPixelIntensityMethod", value: 6, isUnsigned: true)
!365 = !DIEnumerator(name: "Rec709LuminancePixelIntensityMethod", value: 7, isUnsigned: true)
!366 = !DIEnumerator(name: "RMSPixelIntensityMethod", value: 8, isUnsigned: true)
!367 = !DIEnumerator(name: "MSPixelIntensityMethod", value: 9, isUnsigned: true)
!368 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !369, line: 34, baseType: !5, size: 32, elements: !370)
!369 = !DIFile(filename: "./magick/log.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!370 = !{!371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392}
!371 = !DIEnumerator(name: "UndefinedEvents", value: 0, isUnsigned: true)
!372 = !DIEnumerator(name: "NoEvents", value: 0, isUnsigned: true)
!373 = !DIEnumerator(name: "TraceEvent", value: 1, isUnsigned: true)
!374 = !DIEnumerator(name: "AnnotateEvent", value: 2, isUnsigned: true)
!375 = !DIEnumerator(name: "BlobEvent", value: 4, isUnsigned: true)
!376 = !DIEnumerator(name: "CacheEvent", value: 8, isUnsigned: true)
!377 = !DIEnumerator(name: "CoderEvent", value: 16, isUnsigned: true)
!378 = !DIEnumerator(name: "ConfigureEvent", value: 32, isUnsigned: true)
!379 = !DIEnumerator(name: "DeprecateEvent", value: 64, isUnsigned: true)
!380 = !DIEnumerator(name: "DrawEvent", value: 128, isUnsigned: true)
!381 = !DIEnumerator(name: "ExceptionEvent", value: 256, isUnsigned: true)
!382 = !DIEnumerator(name: "ImageEvent", value: 512, isUnsigned: true)
!383 = !DIEnumerator(name: "LocaleEvent", value: 1024, isUnsigned: true)
!384 = !DIEnumerator(name: "ModuleEvent", value: 2048, isUnsigned: true)
!385 = !DIEnumerator(name: "PolicyEvent", value: 4096, isUnsigned: true)
!386 = !DIEnumerator(name: "ResourceEvent", value: 8192, isUnsigned: true)
!387 = !DIEnumerator(name: "TransformEvent", value: 16384, isUnsigned: true)
!388 = !DIEnumerator(name: "UserEvent", value: 36864, isUnsigned: true)
!389 = !DIEnumerator(name: "WandEvent", value: 65536, isUnsigned: true)
!390 = !DIEnumerator(name: "X11Event", value: 131072, isUnsigned: true)
!391 = !DIEnumerator(name: "AccelerateEvent", value: 262144, isUnsigned: true)
!392 = !DIEnumerator(name: "AllEvents", value: 2147483647, isUnsigned: true)
!393 = !{!394, !395, !400, !411, !412, !413}
!394 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !396, line: 77, baseType: !397)
!396 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !398, line: 193, baseType: !399)
!398 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!399 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64)
!401 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !402)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelPacket", file: !326, line: 148, baseType: !403)
!403 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PixelPacket", file: !326, line: 131, size: 64, elements: !404)
!404 = !{!405, !408, !409, !410}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !403, file: !326, line: 143, baseType: !406, size: 16)
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "Quantum", file: !4, line: 93, baseType: !407)
!407 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !403, file: !326, line: 144, baseType: !406, size: 16, offset: 16)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !403, file: !326, line: 145, baseType: !406, size: 16, offset: 32)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !403, file: !326, line: 146, baseType: !406, size: 16, offset: 48)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!412 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64)
!414 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !415)
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "IndexPacket", file: !326, line: 129, baseType: !406)
!416 = !{i32 7, !"Dwarf Version", i32 4}
!417 = !{i32 2, !"Debug Info Version", i32 3}
!418 = !{i32 1, !"wchar_size", i32 4}
!419 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!420 = distinct !DISubprogram(name: "GetImageTotalInkDensity", scope: !1, file: !1, line: 83, type: !421, scopeLine: 84, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !628)
!421 = !DISubroutineType(types: !422)
!422 = !{!412, !423}
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!424 = !DIDerivedType(tag: DW_TAG_typedef, name: "Image", file: !4, line: 221, baseType: !425)
!425 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Image", file: !73, line: 150, size: 105920, elements: !426)
!426 = !{!427, !429, !431, !433, !436, !438, !440, !441, !442, !443, !444, !445, !447, !448, !449, !450, !451, !465, !467, !468, !470, !473, !474, !475, !476, !477, !478, !486, !487, !488, !489, !490, !491, !493, !495, !497, !499, !501, !503, !505, !506, !507, !508, !509, !510, !511, !519, !534, !548, !549, !550, !551, !555, !559, !563, !564, !565, !566, !567, !585, !586, !588, !589, !599, !600, !602, !603, !604, !605, !606, !607, !609, !610, !611, !612, !613, !614, !615, !617, !618, !619, !620, !621, !625, !627}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "storage_class", scope: !425, file: !73, line: 153, baseType: !428, size: 32)
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "ClassType", file: !4, line: 209, baseType: !3)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !425, file: !73, line: 156, baseType: !430, size: 32, offset: 32)
!430 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorspaceType", file: !11, line: 61, baseType: !10)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !425, file: !73, line: 159, baseType: !432, size: 32, offset: 64)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompressionType", file: !48, line: 49, baseType: !47)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !425, file: !73, line: 162, baseType: !434, size: 64, offset: 128)
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !435, line: 46, baseType: !394)
!435 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!436 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !425, file: !73, line: 165, baseType: !437, size: 32, offset: 192)
!437 = !DIDerivedType(tag: DW_TAG_typedef, name: "OrientationType", file: !73, line: 86, baseType: !72)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "taint", scope: !425, file: !73, line: 168, baseType: !439, size: 32, offset: 224)
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickBooleanType", file: !4, line: 215, baseType: !84)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "matte", scope: !425, file: !73, line: 169, baseType: !439, size: 32, offset: 256)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !425, file: !73, line: 172, baseType: !434, size: 64, offset: 320)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !425, file: !73, line: 173, baseType: !434, size: 64, offset: 384)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !425, file: !73, line: 174, baseType: !434, size: 64, offset: 448)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !425, file: !73, line: 175, baseType: !434, size: 64, offset: 512)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "colormap", scope: !425, file: !73, line: 178, baseType: !446, size: 64, offset: 576)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "background_color", scope: !425, file: !73, line: 179, baseType: !402, size: 64, offset: 640)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !425, file: !73, line: 180, baseType: !402, size: 64, offset: 704)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "matte_color", scope: !425, file: !73, line: 181, baseType: !402, size: 64, offset: 768)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !425, file: !73, line: 184, baseType: !412, size: 64, offset: 832)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "chromaticity", scope: !425, file: !73, line: 187, baseType: !452, size: 768, offset: 896)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChromaticityInfo", file: !73, line: 128, baseType: !453)
!453 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ChromaticityInfo", file: !73, line: 121, size: 768, elements: !454)
!454 = !{!455, !462, !463, !464}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "red_primary", scope: !453, file: !73, line: 124, baseType: !456, size: 192)
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "PrimaryInfo", file: !73, line: 101, baseType: !457)
!457 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PrimaryInfo", file: !73, line: 95, size: 192, elements: !458)
!458 = !{!459, !460, !461}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !457, file: !73, line: 98, baseType: !412, size: 64)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !457, file: !73, line: 99, baseType: !412, size: 64, offset: 64)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !457, file: !73, line: 100, baseType: !412, size: 64, offset: 128)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "green_primary", scope: !453, file: !73, line: 125, baseType: !456, size: 192, offset: 192)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "blue_primary", scope: !453, file: !73, line: 126, baseType: !456, size: 192, offset: 384)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "white_point", scope: !453, file: !73, line: 127, baseType: !456, size: 192, offset: 576)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "rendering_intent", scope: !425, file: !73, line: 190, baseType: !466, size: 32, offset: 1664)
!466 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderingIntent", file: !89, line: 49, baseType: !88)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !425, file: !73, line: 193, baseType: !411, size: 64, offset: 1728)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !425, file: !73, line: 196, baseType: !469, size: 32, offset: 1792)
!469 = !DIDerivedType(tag: DW_TAG_typedef, name: "ResolutionType", file: !73, line: 93, baseType: !96)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "montage", scope: !425, file: !73, line: 199, baseType: !471, size: 64, offset: 1856)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64)
!472 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "directory", scope: !425, file: !73, line: 200, baseType: !471, size: 64, offset: 1920)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "geometry", scope: !425, file: !73, line: 201, baseType: !471, size: 64, offset: 1984)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !425, file: !73, line: 204, baseType: !395, size: 64, offset: 2048)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "x_resolution", scope: !425, file: !73, line: 207, baseType: !412, size: 64, offset: 2112)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "y_resolution", scope: !425, file: !73, line: 208, baseType: !412, size: 64, offset: 2176)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !425, file: !73, line: 211, baseType: !479, size: 256, offset: 2240)
!479 = !DIDerivedType(tag: DW_TAG_typedef, name: "RectangleInfo", file: !153, line: 130, baseType: !480)
!480 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_RectangleInfo", file: !153, line: 121, size: 256, elements: !481)
!481 = !{!482, !483, !484, !485}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !480, file: !153, line: 124, baseType: !434, size: 64)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !480, file: !153, line: 125, baseType: !434, size: 64, offset: 64)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !480, file: !153, line: 128, baseType: !395, size: 64, offset: 128)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !480, file: !153, line: 129, baseType: !395, size: 64, offset: 192)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "extract_info", scope: !425, file: !73, line: 212, baseType: !479, size: 256, offset: 2496)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "tile_info", scope: !425, file: !73, line: 213, baseType: !479, size: 256, offset: 2752)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "bias", scope: !425, file: !73, line: 216, baseType: !412, size: 64, offset: 3008)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "blur", scope: !425, file: !73, line: 217, baseType: !412, size: 64, offset: 3072)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !425, file: !73, line: 218, baseType: !412, size: 64, offset: 3136)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !425, file: !73, line: 221, baseType: !492, size: 32, offset: 3200)
!492 = !DIDerivedType(tag: DW_TAG_typedef, name: "FilterTypes", file: !102, line: 66, baseType: !101)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "interlace", scope: !425, file: !73, line: 224, baseType: !494, size: 32, offset: 3232)
!494 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterlaceType", file: !73, line: 73, baseType: !136)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !425, file: !73, line: 227, baseType: !496, size: 32, offset: 3264)
!496 = !DIDerivedType(tag: DW_TAG_typedef, name: "EndianType", file: !147, line: 35, baseType: !146)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !425, file: !73, line: 230, baseType: !498, size: 32, offset: 3296)
!498 = !DIDerivedType(tag: DW_TAG_typedef, name: "GravityType", file: !153, line: 91, baseType: !152)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !425, file: !73, line: 233, baseType: !500, size: 32, offset: 3328)
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompositeOperator", file: !168, line: 99, baseType: !167)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "dispose", scope: !425, file: !73, line: 236, baseType: !502, size: 32, offset: 3360)
!502 = !DIDerivedType(tag: DW_TAG_typedef, name: "DisposeType", file: !239, line: 32, baseType: !238)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "clip_mask", scope: !425, file: !73, line: 239, baseType: !504, size: 64, offset: 3392)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !425, file: !73, line: 242, baseType: !434, size: 64, offset: 3456)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !425, file: !73, line: 243, baseType: !434, size: 64, offset: 3520)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_second", scope: !425, file: !73, line: 246, baseType: !395, size: 64, offset: 3584)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "iterations", scope: !425, file: !73, line: 249, baseType: !434, size: 64, offset: 3648)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "total_colors", scope: !425, file: !73, line: 250, baseType: !434, size: 64, offset: 3712)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "start_loop", scope: !425, file: !73, line: 253, baseType: !395, size: 64, offset: 3776)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !425, file: !73, line: 256, baseType: !512, size: 192, offset: 3840)
!512 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErrorInfo", file: !513, line: 68, baseType: !514)
!513 = !DIFile(filename: "./magick/color.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!514 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ErrorInfo", file: !513, line: 62, size: 192, elements: !515)
!515 = !{!516, !517, !518}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "mean_error_per_pixel", scope: !514, file: !513, line: 65, baseType: !412, size: 64)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_mean_error", scope: !514, file: !513, line: 66, baseType: !412, size: 64, offset: 64)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_maximum_error", scope: !514, file: !513, line: 67, baseType: !412, size: 64, offset: 128)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !425, file: !73, line: 259, baseType: !520, size: 512, offset: 4032)
!520 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerInfo", file: !247, line: 51, baseType: !521)
!521 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TimerInfo", file: !247, line: 40, size: 512, elements: !522)
!522 = !{!523, !530, !531, !533}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !521, file: !247, line: 43, baseType: !524, size: 192)
!524 = !DIDerivedType(tag: DW_TAG_typedef, name: "Timer", file: !247, line: 38, baseType: !525)
!525 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Timer", file: !247, line: 32, size: 192, elements: !526)
!526 = !{!527, !528, !529}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !525, file: !247, line: 35, baseType: !412, size: 64)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !525, file: !247, line: 36, baseType: !412, size: 64, offset: 64)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !525, file: !247, line: 37, baseType: !412, size: 64, offset: 128)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "elapsed", scope: !521, file: !247, line: 44, baseType: !524, size: 192, offset: 192)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !521, file: !247, line: 47, baseType: !532, size: 32, offset: 384)
!532 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerState", file: !247, line: 30, baseType: !246)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !521, file: !247, line: 50, baseType: !434, size: 64, offset: 448)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !425, file: !73, line: 262, baseType: !535, size: 64, offset: 4544)
!535 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickProgressMonitor", file: !536, line: 26, baseType: !537)
!536 = !DIFile(filename: "./magick/monitor.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64)
!538 = !DISubroutineType(types: !539)
!539 = !{!439, !540, !542, !545, !411}
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64)
!541 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !472)
!542 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !543)
!543 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickOffsetType", file: !4, line: 150, baseType: !544)
!544 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!545 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !546)
!546 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickSizeType", file: !4, line: 151, baseType: !547)
!547 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !425, file: !73, line: 265, baseType: !411, size: 64, offset: 4608)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !425, file: !73, line: 266, baseType: !411, size: 64, offset: 4672)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !425, file: !73, line: 267, baseType: !411, size: 64, offset: 4736)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "ascii85", scope: !425, file: !73, line: 270, baseType: !552, size: 64, offset: 4800)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64)
!553 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ascii85Info", file: !48, line: 52, baseType: !554)
!554 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Ascii85Info", file: !48, line: 51, flags: DIFlagFwdDecl)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !425, file: !73, line: 273, baseType: !556, size: 64, offset: 4864)
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 64)
!557 = !DIDerivedType(tag: DW_TAG_typedef, name: "BlobInfo", file: !4, line: 217, baseType: !558)
!558 = !DICompositeType(tag: DW_TAG_structure_type, name: "_BlobInfo", file: !4, line: 217, flags: DIFlagFwdDecl)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !425, file: !73, line: 276, baseType: !560, size: 32768, offset: 4928)
!560 = !DICompositeType(tag: DW_TAG_array_type, baseType: !472, size: 32768, elements: !561)
!561 = !{!562}
!562 = !DISubrange(count: 4096)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "magick_filename", scope: !425, file: !73, line: 277, baseType: !560, size: 32768, offset: 37696)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !425, file: !73, line: 278, baseType: !560, size: 32768, offset: 70464)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "magick_columns", scope: !425, file: !73, line: 281, baseType: !434, size: 64, offset: 103232)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "magick_rows", scope: !425, file: !73, line: 282, baseType: !434, size: 64, offset: 103296)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "exception", scope: !425, file: !73, line: 285, baseType: !568, size: 448, offset: 103360)
!568 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionInfo", file: !4, line: 219, baseType: !569)
!569 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ExceptionInfo", file: !253, line: 102, size: 448, elements: !570)
!570 = !{!571, !573, !575, !576, !577, !578, !579, !584}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "severity", scope: !569, file: !253, line: 105, baseType: !572, size: 32)
!572 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionType", file: !253, line: 100, baseType: !252)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "error_number", scope: !569, file: !253, line: 108, baseType: !574, size: 32, offset: 32)
!574 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !569, file: !253, line: 111, baseType: !471, size: 64, offset: 64)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !569, file: !253, line: 112, baseType: !471, size: 64, offset: 128)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "exceptions", scope: !569, file: !253, line: 115, baseType: !411, size: 64, offset: 192)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "relinquish", scope: !569, file: !253, line: 118, baseType: !439, size: 32, offset: 256)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !569, file: !253, line: 121, baseType: !580, size: 64, offset: 320)
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 64)
!581 = !DIDerivedType(tag: DW_TAG_typedef, name: "SemaphoreInfo", file: !582, line: 26, baseType: !583)
!582 = !DIFile(filename: "./magick/semaphore.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!583 = !DICompositeType(tag: DW_TAG_structure_type, name: "SemaphoreInfo", file: !582, line: 25, flags: DIFlagFwdDecl)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !569, file: !253, line: 124, baseType: !434, size: 64, offset: 384)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !425, file: !73, line: 288, baseType: !439, size: 32, offset: 103808)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !425, file: !73, line: 291, baseType: !587, size: 64, offset: 103872)
!587 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !395)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !425, file: !73, line: 294, baseType: !580, size: 64, offset: 103936)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "color_profile", scope: !425, file: !73, line: 297, baseType: !590, size: 256, offset: 104000)
!590 = !DIDerivedType(tag: DW_TAG_typedef, name: "ProfileInfo", file: !89, line: 40, baseType: !591)
!591 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ProfileInfo", file: !89, line: 27, size: 256, elements: !592)
!592 = !{!593, !594, !595, !598}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !591, file: !89, line: 30, baseType: !471, size: 64)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !591, file: !89, line: 33, baseType: !434, size: 64, offset: 64)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !591, file: !89, line: 36, baseType: !596, size: 64, offset: 128)
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 64)
!597 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !591, file: !89, line: 39, baseType: !434, size: 64, offset: 192)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "iptc_profile", scope: !425, file: !73, line: 298, baseType: !590, size: 256, offset: 104256)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profile", scope: !425, file: !73, line: 299, baseType: !601, size: 64, offset: 104512)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 64)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profiles", scope: !425, file: !73, line: 302, baseType: !434, size: 64, offset: 104576)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !425, file: !73, line: 305, baseType: !434, size: 64, offset: 104640)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !425, file: !73, line: 308, baseType: !504, size: 64, offset: 104704)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !425, file: !73, line: 309, baseType: !504, size: 64, offset: 104768)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !425, file: !73, line: 310, baseType: !504, size: 64, offset: 104832)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "interpolate", scope: !425, file: !73, line: 313, baseType: !608, size: 32, offset: 104896)
!608 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterpolatePixelMethod", file: !326, line: 47, baseType: !325)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "black_point_compensation", scope: !425, file: !73, line: 316, baseType: !439, size: 32, offset: 104928)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_color", scope: !425, file: !73, line: 319, baseType: !402, size: 64, offset: 104960)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !425, file: !73, line: 322, baseType: !504, size: 64, offset: 105024)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "tile_offset", scope: !425, file: !73, line: 325, baseType: !479, size: 256, offset: 105088)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !425, file: !73, line: 328, baseType: !411, size: 64, offset: 105344)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "artifacts", scope: !425, file: !73, line: 329, baseType: !411, size: 64, offset: 105408)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !425, file: !73, line: 332, baseType: !616, size: 32, offset: 105472)
!616 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageType", file: !73, line: 61, baseType: !342)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !425, file: !73, line: 335, baseType: !439, size: 32, offset: 105504)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !425, file: !73, line: 338, baseType: !546, size: 64, offset: 105536)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "ping", scope: !425, file: !73, line: 341, baseType: !439, size: 32, offset: 105600)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !425, file: !73, line: 344, baseType: !434, size: 64, offset: 105664)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !425, file: !73, line: 347, baseType: !622, size: 64, offset: 105728)
!622 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !623, line: 7, baseType: !624)
!623 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "")
!624 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !398, line: 160, baseType: !399)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "intensity", scope: !425, file: !73, line: 350, baseType: !626, size: 32, offset: 105792)
!626 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelIntensityMethod", file: !326, line: 79, baseType: !356)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !425, file: !73, line: 353, baseType: !434, size: 64, offset: 105856)
!628 = !{}
!629 = !DILocalVariable(name: "image", arg: 1, scope: !420, file: !1, line: 83, type: !423)
!630 = !DILocation(line: 83, column: 52, scope: !420)
!631 = !DILocalVariable(name: "image_view", scope: !420, file: !1, line: 86, type: !632)
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !633, size: 64)
!633 = !DIDerivedType(tag: DW_TAG_typedef, name: "CacheView", file: !634, line: 50, baseType: !635)
!634 = !DIFile(filename: "./magick/cache-view.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!635 = !DICompositeType(tag: DW_TAG_structure_type, name: "_CacheView", file: !326, line: 160, flags: DIFlagFwdDecl)
!636 = !DILocation(line: 86, column: 6, scope: !420)
!637 = !DILocalVariable(name: "total_ink_density", scope: !420, file: !1, line: 89, type: !412)
!638 = !DILocation(line: 89, column: 5, scope: !420)
!639 = !DILocalVariable(name: "exception", scope: !420, file: !1, line: 92, type: !640)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!641 = !DILocation(line: 92, column: 6, scope: !420)
!642 = !DILocalVariable(name: "status", scope: !420, file: !1, line: 95, type: !439)
!643 = !DILocation(line: 95, column: 5, scope: !420)
!644 = !DILocalVariable(name: "y", scope: !420, file: !1, line: 98, type: !395)
!645 = !DILocation(line: 98, column: 5, scope: !420)
!646 = !DILocation(line: 101, column: 7, scope: !647)
!647 = distinct !DILexicalBlock(scope: !420, file: !1, line: 101, column: 7)
!648 = !DILocation(line: 101, column: 14, scope: !647)
!649 = !DILocation(line: 101, column: 20, scope: !647)
!650 = !DILocation(line: 101, column: 7, scope: !420)
!651 = !DILocation(line: 102, column: 12, scope: !647)
!652 = !DILocation(line: 102, column: 5, scope: !647)
!653 = !DILocation(line: 104, column: 7, scope: !654)
!654 = distinct !DILexicalBlock(scope: !420, file: !1, line: 104, column: 7)
!655 = !DILocation(line: 104, column: 14, scope: !654)
!656 = !DILocation(line: 104, column: 25, scope: !654)
!657 = !DILocation(line: 104, column: 7, scope: !420)
!658 = !DILocation(line: 106, column: 36, scope: !659)
!659 = distinct !DILexicalBlock(scope: !654, file: !1, line: 105, column: 5)
!660 = !DILocation(line: 106, column: 43, scope: !659)
!661 = !DILocation(line: 107, column: 57, scope: !659)
!662 = !DILocation(line: 107, column: 64, scope: !659)
!663 = !DILocation(line: 106, column: 14, scope: !659)
!664 = !DILocation(line: 108, column: 7, scope: !659)
!665 = !DILocation(line: 110, column: 9, scope: !420)
!666 = !DILocation(line: 111, column: 20, scope: !420)
!667 = !DILocation(line: 112, column: 15, scope: !420)
!668 = !DILocation(line: 112, column: 22, scope: !420)
!669 = !DILocation(line: 112, column: 12, scope: !420)
!670 = !DILocation(line: 113, column: 38, scope: !420)
!671 = !DILocation(line: 113, column: 44, scope: !420)
!672 = !DILocation(line: 113, column: 14, scope: !420)
!673 = !DILocation(line: 113, column: 13, scope: !420)
!674 = !DILocation(line: 118, column: 9, scope: !675)
!675 = distinct !DILexicalBlock(scope: !420, file: !1, line: 118, column: 3)
!676 = !DILocation(line: 118, column: 8, scope: !675)
!677 = !DILocation(line: 118, column: 13, scope: !678)
!678 = distinct !DILexicalBlock(scope: !675, file: !1, line: 118, column: 3)
!679 = !DILocation(line: 118, column: 27, scope: !678)
!680 = !DILocation(line: 118, column: 34, scope: !678)
!681 = !DILocation(line: 118, column: 15, scope: !678)
!682 = !DILocation(line: 118, column: 3, scope: !675)
!683 = !DILocalVariable(name: "density", scope: !684, file: !1, line: 121, type: !412)
!684 = distinct !DILexicalBlock(scope: !678, file: !1, line: 119, column: 3)
!685 = !DILocation(line: 121, column: 7, scope: !684)
!686 = !DILocalVariable(name: "indexes", scope: !684, file: !1, line: 124, type: !413)
