; ModuleID = 'magick/profile.c'
source_filename = "magick/profile.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._Image = type { i32, i32, i32, i64, i32, i32, i32, i64, i64, i64, i64, %struct._PixelPacket*, %struct._PixelPacket, %struct._PixelPacket, %struct._PixelPacket, double, %struct._ChromaticityInfo, i32, i8*, i32, i8*, i8*, i8*, i64, double, double, %struct._RectangleInfo, %struct._RectangleInfo, %struct._RectangleInfo, double, double, double, i32, i32, i32, i32, i32, i32, %struct._Image*, i64, i64, i64, i64, i64, i64, %struct._ErrorInfo, %struct._TimerInfo, i32 (i8*, i64, i64, i8*)*, i8*, i8*, i8*, %struct._Ascii85Info*, %struct._BlobInfo*, [4096 x i8], [4096 x i8], [4096 x i8], i64, i64, %struct._ExceptionInfo, i32, i64, %struct.SemaphoreInfo*, %struct._ProfileInfo, %struct._ProfileInfo, %struct._ProfileInfo*, i64, i64, %struct._Image*, %struct._Image*, %struct._Image*, i32, i32, %struct._PixelPacket, %struct._Image*, %struct._RectangleInfo, i8*, i8*, i32, i32, i64, i32, i64, i64, i32, i64 }
%struct._ChromaticityInfo = type { %struct._PrimaryInfo, %struct._PrimaryInfo, %struct._PrimaryInfo, %struct._PrimaryInfo }
%struct._PrimaryInfo = type { double, double, double }
%struct._ErrorInfo = type { double, double, double }
%struct._TimerInfo = type { %struct._Timer, %struct._Timer, i32, i64 }
%struct._Timer = type { double, double, double }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "format_bytes", scope: !2, file: !3, line: 1723, type: !647, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "SyncExifProfile", scope: !3, file: !3, line: 1686, type: !4, scopeLine: 1687, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !602, retainedNodes: !646)
!3 = !DIFile(filename: "magick/profile.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !DISubroutineType(types: !5)
!5 = !{!6, !13, !593}
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickBooleanType", file: !7, line: 215, baseType: !8)
!7 = !DIFile(filename: "./magick/magick-type.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!8 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !7, line: 211, baseType: !9, size: 32, elements: !10)
!9 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!10 = !{!11, !12}
!11 = !DIEnumerator(name: "MagickFalse", value: 0, isUnsigned: true)
!12 = !DIEnumerator(name: "MagickTrue", value: 1, isUnsigned: true)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "Image", file: !7, line: 221, baseType: !15)
!15 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Image", file: !16, line: 150, size: 105920, elements: !17)
!16 = !DIFile(filename: "./magick/image.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!17 = !{!18, !25, !64, !91, !95, !108, !109, !110, !111, !112, !113, !114, !126, !127, !128, !129, !131, !145, !155, !157, !164, !167, !168, !169, !175, !176, !177, !186, !187, !188, !189, !190, !191, !228, !240, !248, !264, !337, !347, !349, !350, !351, !352, !353, !354, !355, !363, !384, !398, !399, !400, !401, !405, !409, !413, !414, !415, !416, !417, !508, !509, !511, !512, !522, !523, !525, !526, !527, !528, !529, !530, !548, !549, !550, !551, !552, !553, !554, !570, !571, !572, !573, !574, !578, !592}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "storage_class", scope: !15, file: !16, line: 153, baseType: !19, size: 32)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "ClassType", file: !7, line: 209, baseType: !20)
!20 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !7, line: 204, baseType: !9, size: 32, elements: !21)
!21 = !{!22, !23, !24}
!22 = !DIEnumerator(name: "UndefinedClass", value: 0, isUnsigned: true)
!23 = !DIEnumerator(name: "DirectClass", value: 1, isUnsigned: true)
!24 = !DIEnumerator(name: "PseudoClass", value: 2, isUnsigned: true)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !15, file: !16, line: 156, baseType: !26, size: 32, offset: 32)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorspaceType", file: !27, line: 61, baseType: !28)
!27 = !DIFile(filename: "./magick/colorspace.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!28 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !27, line: 25, baseType: !9, size: 32, elements: !29)
!29 = !{!30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63}
!30 = !DIEnumerator(name: "UndefinedColorspace", value: 0, isUnsigned: true)
!31 = !DIEnumerator(name: "RGBColorspace", value: 1, isUnsigned: true)
!32 = !DIEnumerator(name: "GRAYColorspace", value: 2, isUnsigned: true)
!33 = !DIEnumerator(name: "TransparentColorspace", value: 3, isUnsigned: true)
!34 = !DIEnumerator(name: "OHTAColorspace", value: 4, isUnsigned: true)
!35 = !DIEnumerator(name: "LabColorspace", value: 5, isUnsigned: true)
!36 = !DIEnumerator(name: "XYZColorspace", value: 6, isUnsigned: true)
!37 = !DIEnumerator(name: "YCbCrColorspace", value: 7, isUnsigned: true)
!38 = !DIEnumerator(name: "YCCColorspace", value: 8, isUnsigned: true)
!39 = !DIEnumerator(name: "YIQColorspace", value: 9, isUnsigned: true)
!40 = !DIEnumerator(name: "YPbPrColorspace", value: 10, isUnsigned: true)
!41 = !DIEnumerator(name: "YUVColorspace", value: 11, isUnsigned: true)
!42 = !DIEnumerator(name: "CMYKColorspace", value: 12, isUnsigned: true)
!43 = !DIEnumerator(name: "sRGBColorspace", value: 13, isUnsigned: true)
!44 = !DIEnumerator(name: "HSBColorspace", value: 14, isUnsigned: true)
!45 = !DIEnumerator(name: "HSLColorspace", value: 15, isUnsigned: true)
!46 = !DIEnumerator(name: "HWBColorspace", value: 16, isUnsigned: true)
!47 = !DIEnumerator(name: "Rec601LumaColorspace", value: 17, isUnsigned: true)
!48 = !DIEnumerator(name: "Rec601YCbCrColorspace", value: 18, isUnsigned: true)
!49 = !DIEnumerator(name: "Rec709LumaColorspace", value: 19, isUnsigned: true)
!50 = !DIEnumerator(name: "Rec709YCbCrColorspace", value: 20, isUnsigned: true)
!51 = !DIEnumerator(name: "LogColorspace", value: 21, isUnsigned: true)
!52 = !DIEnumerator(name: "CMYColorspace", value: 22, isUnsigned: true)
!53 = !DIEnumerator(name: "LuvColorspace", value: 23, isUnsigned: true)
!54 = !DIEnumerator(name: "HCLColorspace", value: 24, isUnsigned: true)
!55 = !DIEnumerator(name: "LCHColorspace", value: 25, isUnsigned: true)
!56 = !DIEnumerator(name: "LMSColorspace", value: 26, isUnsigned: true)
!57 = !DIEnumerator(name: "LCHabColorspace", value: 27, isUnsigned: true)
!58 = !DIEnumerator(name: "LCHuvColorspace", value: 28, isUnsigned: true)
!59 = !DIEnumerator(name: "scRGBColorspace", value: 29, isUnsigned: true)
!60 = !DIEnumerator(name: "HSIColorspace", value: 30, isUnsigned: true)
!61 = !DIEnumerator(name: "HSVColorspace", value: 31, isUnsigned: true)
!62 = !DIEnumerator(name: "HCLpColorspace", value: 32, isUnsigned: true)
!63 = !DIEnumerator(name: "YDbDrColorspace", value: 33, isUnsigned: true)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !15, file: !16, line: 159, baseType: !65, size: 32, offset: 64)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompressionType", file: !66, line: 49, baseType: !67)
!66 = !DIFile(filename: "./magick/compress.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!67 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !66, line: 25, baseType: !9, size: 32, elements: !68)
!68 = !{!69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90}
!69 = !DIEnumerator(name: "UndefinedCompression", value: 0, isUnsigned: true)
!70 = !DIEnumerator(name: "NoCompression", value: 1, isUnsigned: true)
!71 = !DIEnumerator(name: "BZipCompression", value: 2, isUnsigned: true)
!72 = !DIEnumerator(name: "DXT1Compression", value: 3, isUnsigned: true)
!73 = !DIEnumerator(name: "DXT3Compression", value: 4, isUnsigned: true)
!74 = !DIEnumerator(name: "DXT5Compression", value: 5, isUnsigned: true)
!75 = !DIEnumerator(name: "FaxCompression", value: 6, isUnsigned: true)
!76 = !DIEnumerator(name: "Group4Compression", value: 7, isUnsigned: true)
!77 = !DIEnumerator(name: "JPEGCompression", value: 8, isUnsigned: true)
!78 = !DIEnumerator(name: "JPEG2000Compression", value: 9, isUnsigned: true)
!79 = !DIEnumerator(name: "LosslessJPEGCompression", value: 10, isUnsigned: true)
!80 = !DIEnumerator(name: "LZWCompression", value: 11, isUnsigned: true)
!81 = !DIEnumerator(name: "RLECompression", value: 12, isUnsigned: true)
!82 = !DIEnumerator(name: "ZipCompression", value: 13, isUnsigned: true)
!83 = !DIEnumerator(name: "ZipSCompression", value: 14, isUnsigned: true)
!84 = !DIEnumerator(name: "PizCompression", value: 15, isUnsigned: true)
!85 = !DIEnumerator(name: "Pxr24Compression", value: 16, isUnsigned: true)
!86 = !DIEnumerator(name: "B44Compression", value: 17, isUnsigned: true)
!87 = !DIEnumerator(name: "B44ACompression", value: 18, isUnsigned: true)
!88 = !DIEnumerator(name: "LZMACompression", value: 19, isUnsigned: true)
!89 = !DIEnumerator(name: "JBIG1Compression", value: 20, isUnsigned: true)
!90 = !DIEnumerator(name: "JBIG2Compression", value: 21, isUnsigned: true)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !15, file: !16, line: 162, baseType: !92, size: 64, offset: 128)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !93, line: 46, baseType: !94)
!93 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!94 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !15, file: !16, line: 165, baseType: !96, size: 32, offset: 192)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "OrientationType", file: !16, line: 86, baseType: !97)
!97 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !16, line: 75, baseType: !9, size: 32, elements: !98)
!98 = !{!99, !100, !101, !102, !103, !104, !105, !106, !107}
!99 = !DIEnumerator(name: "UndefinedOrientation", value: 0, isUnsigned: true)
!100 = !DIEnumerator(name: "TopLeftOrientation", value: 1, isUnsigned: true)
!101 = !DIEnumerator(name: "TopRightOrientation", value: 2, isUnsigned: true)
!102 = !DIEnumerator(name: "BottomRightOrientation", value: 3, isUnsigned: true)
!103 = !DIEnumerator(name: "BottomLeftOrientation", value: 4, isUnsigned: true)
!104 = !DIEnumerator(name: "LeftTopOrientation", value: 5, isUnsigned: true)
!105 = !DIEnumerator(name: "RightTopOrientation", value: 6, isUnsigned: true)
!106 = !DIEnumerator(name: "RightBottomOrientation", value: 7, isUnsigned: true)
!107 = !DIEnumerator(name: "LeftBottomOrientation", value: 8, isUnsigned: true)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "taint", scope: !15, file: !16, line: 168, baseType: !6, size: 32, offset: 224)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "matte", scope: !15, file: !16, line: 169, baseType: !6, size: 32, offset: 256)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !15, file: !16, line: 172, baseType: !92, size: 64, offset: 320)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !15, file: !16, line: 173, baseType: !92, size: 64, offset: 384)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !15, file: !16, line: 174, baseType: !92, size: 64, offset: 448)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !15, file: !16, line: 175, baseType: !92, size: 64, offset: 512)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "colormap", scope: !15, file: !16, line: 178, baseType: !115, size: 64, offset: 576)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelPacket", file: !117, line: 148, baseType: !118)
!117 = !DIFile(filename: "./magick/pixel.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PixelPacket", file: !117, line: 131, size: 64, elements: !119)
!119 = !{!120, !123, !124, !125}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !118, file: !117, line: 143, baseType: !121, size: 16)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "Quantum", file: !7, line: 93, baseType: !122)
!122 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !118, file: !117, line: 144, baseType: !121, size: 16, offset: 16)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !118, file: !117, line: 145, baseType: !121, size: 16, offset: 32)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !118, file: !117, line: 146, baseType: !121, size: 16, offset: 48)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "background_color", scope: !15, file: !16, line: 179, baseType: !116, size: 64, offset: 640)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !15, file: !16, line: 180, baseType: !116, size: 64, offset: 704)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "matte_color", scope: !15, file: !16, line: 181, baseType: !116, size: 64, offset: 768)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !15, file: !16, line: 184, baseType: !130, size: 64, offset: 832)
!130 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "chromaticity", scope: !15, file: !16, line: 187, baseType: !132, size: 768, offset: 896)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChromaticityInfo", file: !16, line: 128, baseType: !133)
!133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ChromaticityInfo", file: !16, line: 121, size: 768, elements: !134)
!134 = !{!135, !142, !143, !144}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "red_primary", scope: !133, file: !16, line: 124, baseType: !136, size: 192)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "PrimaryInfo", file: !16, line: 101, baseType: !137)
!137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PrimaryInfo", file: !16, line: 95, size: 192, elements: !138)
!138 = !{!139, !140, !141}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !137, file: !16, line: 98, baseType: !130, size: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !137, file: !16, line: 99, baseType: !130, size: 64, offset: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !137, file: !16, line: 100, baseType: !130, size: 64, offset: 128)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "green_primary", scope: !133, file: !16, line: 125, baseType: !136, size: 192, offset: 192)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "blue_primary", scope: !133, file: !16, line: 126, baseType: !136, size: 192, offset: 384)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "white_point", scope: !133, file: !16, line: 127, baseType: !136, size: 192, offset: 576)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "rendering_intent", scope: !15, file: !16, line: 190, baseType: !146, size: 32, offset: 1664)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderingIntent", file: !147, line: 49, baseType: !148)
!147 = !DIFile(filename: "./magick/profile.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!148 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !147, line: 42, baseType: !9, size: 32, elements: !149)
!149 = !{!150, !151, !152, !153, !154}
!150 = !DIEnumerator(name: "UndefinedIntent", value: 0, isUnsigned: true)
!151 = !DIEnumerator(name: "SaturationIntent", value: 1, isUnsigned: true)
!152 = !DIEnumerator(name: "PerceptualIntent", value: 2, isUnsigned: true)
!153 = !DIEnumerator(name: "AbsoluteIntent", value: 3, isUnsigned: true)
!154 = !DIEnumerator(name: "RelativeIntent", value: 4, isUnsigned: true)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !15, file: !16, line: 193, baseType: !156, size: 64, offset: 1728)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !15, file: !16, line: 196, baseType: !158, size: 32, offset: 1792)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "ResolutionType", file: !16, line: 93, baseType: !159)
!159 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !16, line: 88, baseType: !9, size: 32, elements: !160)
!160 = !{!161, !162, !163}
!161 = !DIEnumerator(name: "UndefinedResolution", value: 0, isUnsigned: true)
!162 = !DIEnumerator(name: "PixelsPerInchResolution", value: 1, isUnsigned: true)
!163 = !DIEnumerator(name: "PixelsPerCentimeterResolution", value: 2, isUnsigned: true)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "montage", scope: !15, file: !16, line: 199, baseType: !165, size: 64, offset: 1856)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "directory", scope: !15, file: !16, line: 200, baseType: !165, size: 64, offset: 1920)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "geometry", scope: !15, file: !16, line: 201, baseType: !165, size: 64, offset: 1984)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !15, file: !16, line: 204, baseType: !170, size: 64, offset: 2048)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !171, line: 77, baseType: !172)
!171 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !173, line: 193, baseType: !174)
!173 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!174 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "x_resolution", scope: !15, file: !16, line: 207, baseType: !130, size: 64, offset: 2112)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "y_resolution", scope: !15, file: !16, line: 208, baseType: !130, size: 64, offset: 2176)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !15, file: !16, line: 211, baseType: !178, size: 256, offset: 2240)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "RectangleInfo", file: !179, line: 130, baseType: !180)
!179 = !DIFile(filename: "./magick/geometry.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!180 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_RectangleInfo", file: !179, line: 121, size: 256, elements: !181)
!181 = !{!182, !183, !184, !185}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !180, file: !179, line: 124, baseType: !92, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !180, file: !179, line: 125, baseType: !92, size: 64, offset: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !180, file: !179, line: 128, baseType: !170, size: 64, offset: 128)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !180, file: !179, line: 129, baseType: !170, size: 64, offset: 192)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "extract_info", scope: !15, file: !16, line: 212, baseType: !178, size: 256, offset: 2496)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "tile_info", scope: !15, file: !16, line: 213, baseType: !178, size: 256, offset: 2752)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "bias", scope: !15, file: !16, line: 216, baseType: !130, size: 64, offset: 3008)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "blur", scope: !15, file: !16, line: 217, baseType: !130, size: 64, offset: 3072)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !15, file: !16, line: 218, baseType: !130, size: 64, offset: 3136)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !15, file: !16, line: 221, baseType: !192, size: 32, offset: 3200)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "FilterTypes", file: !193, line: 66, baseType: !194)
!193 = !DIFile(filename: "./magick/resample.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!194 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !193, line: 32, baseType: !9, size: 32, elements: !195)
!195 = !{!196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227}
!196 = !DIEnumerator(name: "UndefinedFilter", value: 0, isUnsigned: true)
!197 = !DIEnumerator(name: "PointFilter", value: 1, isUnsigned: true)
!198 = !DIEnumerator(name: "BoxFilter", value: 2, isUnsigned: true)
!199 = !DIEnumerator(name: "TriangleFilter", value: 3, isUnsigned: true)
!200 = !DIEnumerator(name: "HermiteFilter", value: 4, isUnsigned: true)
!201 = !DIEnumerator(name: "HanningFilter", value: 5, isUnsigned: true)
!202 = !DIEnumerator(name: "HammingFilter", value: 6, isUnsigned: true)
!203 = !DIEnumerator(name: "BlackmanFilter", value: 7, isUnsigned: true)
!204 = !DIEnumerator(name: "GaussianFilter", value: 8, isUnsigned: true)
!205 = !DIEnumerator(name: "QuadraticFilter", value: 9, isUnsigned: true)
!206 = !DIEnumerator(name: "CubicFilter", value: 10, isUnsigned: true)
!207 = !DIEnumerator(name: "CatromFilter", value: 11, isUnsigned: true)
!208 = !DIEnumerator(name: "MitchellFilter", value: 12, isUnsigned: true)
!209 = !DIEnumerator(name: "JincFilter", value: 13, isUnsigned: true)
!210 = !DIEnumerator(name: "SincFilter", value: 14, isUnsigned: true)
!211 = !DIEnumerator(name: "SincFastFilter", value: 15, isUnsigned: true)
!212 = !DIEnumerator(name: "KaiserFilter", value: 16, isUnsigned: true)
!213 = !DIEnumerator(name: "WelshFilter", value: 17, isUnsigned: true)
!214 = !DIEnumerator(name: "ParzenFilter", value: 18, isUnsigned: true)
!215 = !DIEnumerator(name: "BohmanFilter", value: 19, isUnsigned: true)
!216 = !DIEnumerator(name: "BartlettFilter", value: 20, isUnsigned: true)
!217 = !DIEnumerator(name: "LagrangeFilter", value: 21, isUnsigned: true)
!218 = !DIEnumerator(name: "LanczosFilter", value: 22, isUnsigned: true)
!219 = !DIEnumerator(name: "LanczosSharpFilter", value: 23, isUnsigned: true)
!220 = !DIEnumerator(name: "Lanczos2Filter", value: 24, isUnsigned: true)
!221 = !DIEnumerator(name: "Lanczos2SharpFilter", value: 25, isUnsigned: true)
!222 = !DIEnumerator(name: "RobidouxFilter", value: 26, isUnsigned: true)
!223 = !DIEnumerator(name: "RobidouxSharpFilter", value: 27, isUnsigned: true)
!224 = !DIEnumerator(name: "CosineFilter", value: 28, isUnsigned: true)
!225 = !DIEnumerator(name: "SplineFilter", value: 29, isUnsigned: true)
!226 = !DIEnumerator(name: "LanczosRadiusFilter", value: 30, isUnsigned: true)
!227 = !DIEnumerator(name: "SentinelFilter", value: 31, isUnsigned: true)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "interlace", scope: !15, file: !16, line: 224, baseType: !229, size: 32, offset: 3232)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterlaceType", file: !16, line: 73, baseType: !230)
!230 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !16, line: 63, baseType: !9, size: 32, elements: !231)
!231 = !{!232, !233, !234, !235, !236, !237, !238, !239}
!232 = !DIEnumerator(name: "UndefinedInterlace", value: 0, isUnsigned: true)
!233 = !DIEnumerator(name: "NoInterlace", value: 1, isUnsigned: true)
!234 = !DIEnumerator(name: "LineInterlace", value: 2, isUnsigned: true)
!235 = !DIEnumerator(name: "PlaneInterlace", value: 3, isUnsigned: true)
!236 = !DIEnumerator(name: "PartitionInterlace", value: 4, isUnsigned: true)
!237 = !DIEnumerator(name: "GIFInterlace", value: 5, isUnsigned: true)
!238 = !DIEnumerator(name: "JPEGInterlace", value: 6, isUnsigned: true)
!239 = !DIEnumerator(name: "PNGInterlace", value: 7, isUnsigned: true)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !15, file: !16, line: 227, baseType: !241, size: 32, offset: 3264)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "EndianType", file: !242, line: 35, baseType: !243)
!242 = !DIFile(filename: "./magick/quantum.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!243 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !242, line: 30, baseType: !9, size: 32, elements: !244)
!244 = !{!245, !246, !247}
!245 = !DIEnumerator(name: "UndefinedEndian", value: 0, isUnsigned: true)
!246 = !DIEnumerator(name: "LSBEndian", value: 1, isUnsigned: true)
!247 = !DIEnumerator(name: "MSBEndian", value: 2, isUnsigned: true)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !15, file: !16, line: 230, baseType: !249, size: 32, offset: 3296)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "GravityType", file: !179, line: 91, baseType: !250)
!250 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !179, line: 77, baseType: !9, size: 32, elements: !251)
!251 = !{!252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263}
!252 = !DIEnumerator(name: "UndefinedGravity", value: 0, isUnsigned: true)
!253 = !DIEnumerator(name: "ForgetGravity", value: 0, isUnsigned: true)
!254 = !DIEnumerator(name: "NorthWestGravity", value: 1, isUnsigned: true)
!255 = !DIEnumerator(name: "NorthGravity", value: 2, isUnsigned: true)
!256 = !DIEnumerator(name: "NorthEastGravity", value: 3, isUnsigned: true)
!257 = !DIEnumerator(name: "WestGravity", value: 4, isUnsigned: true)
!258 = !DIEnumerator(name: "CenterGravity", value: 5, isUnsigned: true)
!259 = !DIEnumerator(name: "EastGravity", value: 6, isUnsigned: true)
!260 = !DIEnumerator(name: "SouthWestGravity", value: 7, isUnsigned: true)
!261 = !DIEnumerator(name: "SouthGravity", value: 8, isUnsigned: true)
!262 = !DIEnumerator(name: "SouthEastGravity", value: 9, isUnsigned: true)
!263 = !DIEnumerator(name: "StaticGravity", value: 10, isUnsigned: true)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !15, file: !16, line: 233, baseType: !265, size: 32, offset: 3328)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompositeOperator", file: !266, line: 99, baseType: !267)
!266 = !DIFile(filename: "./magick/composite.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!267 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !266, line: 25, baseType: !9, size: 32, elements: !268)
!268 = !{!269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336}
!269 = !DIEnumerator(name: "UndefinedCompositeOp", value: 0, isUnsigned: true)
!270 = !DIEnumerator(name: "NoCompositeOp", value: 1, isUnsigned: true)
!271 = !DIEnumerator(name: "ModulusAddCompositeOp", value: 2, isUnsigned: true)
!272 = !DIEnumerator(name: "AtopCompositeOp", value: 3, isUnsigned: true)
!273 = !DIEnumerator(name: "BlendCompositeOp", value: 4, isUnsigned: true)
!274 = !DIEnumerator(name: "BumpmapCompositeOp", value: 5, isUnsigned: true)
!275 = !DIEnumerator(name: "ChangeMaskCompositeOp", value: 6, isUnsigned: true)
!276 = !DIEnumerator(name: "ClearCompositeOp", value: 7, isUnsigned: true)
!277 = !DIEnumerator(name: "ColorBurnCompositeOp", value: 8, isUnsigned: true)
!278 = !DIEnumerator(name: "ColorDodgeCompositeOp", value: 9, isUnsigned: true)
!279 = !DIEnumerator(name: "ColorizeCompositeOp", value: 10, isUnsigned: true)
!280 = !DIEnumerator(name: "CopyBlackCompositeOp", value: 11, isUnsigned: true)
!281 = !DIEnumerator(name: "CopyBlueCompositeOp", value: 12, isUnsigned: true)
!282 = !DIEnumerator(name: "CopyCompositeOp", value: 13, isUnsigned: true)
!283 = !DIEnumerator(name: "CopyCyanCompositeOp", value: 14, isUnsigned: true)
!284 = !DIEnumerator(name: "CopyGreenCompositeOp", value: 15, isUnsigned: true)
!285 = !DIEnumerator(name: "CopyMagentaCompositeOp", value: 16, isUnsigned: true)
!286 = !DIEnumerator(name: "CopyOpacityCompositeOp", value: 17, isUnsigned: true)
!287 = !DIEnumerator(name: "CopyRedCompositeOp", value: 18, isUnsigned: true)
!288 = !DIEnumerator(name: "CopyYellowCompositeOp", value: 19, isUnsigned: true)
!289 = !DIEnumerator(name: "DarkenCompositeOp", value: 20, isUnsigned: true)
!290 = !DIEnumerator(name: "DstAtopCompositeOp", value: 21, isUnsigned: true)
!291 = !DIEnumerator(name: "DstCompositeOp", value: 22, isUnsigned: true)
!292 = !DIEnumerator(name: "DstInCompositeOp", value: 23, isUnsigned: true)
!293 = !DIEnumerator(name: "DstOutCompositeOp", value: 24, isUnsigned: true)
!294 = !DIEnumerator(name: "DstOverCompositeOp", value: 25, isUnsigned: true)
!295 = !DIEnumerator(name: "DifferenceCompositeOp", value: 26, isUnsigned: true)
!296 = !DIEnumerator(name: "DisplaceCompositeOp", value: 27, isUnsigned: true)
!297 = !DIEnumerator(name: "DissolveCompositeOp", value: 28, isUnsigned: true)
!298 = !DIEnumerator(name: "ExclusionCompositeOp", value: 29, isUnsigned: true)
!299 = !DIEnumerator(name: "HardLightCompositeOp", value: 30, isUnsigned: true)
!300 = !DIEnumerator(name: "HueCompositeOp", value: 31, isUnsigned: true)
!301 = !DIEnumerator(name: "InCompositeOp", value: 32, isUnsigned: true)
!302 = !DIEnumerator(name: "LightenCompositeOp", value: 33, isUnsigned: true)
!303 = !DIEnumerator(name: "LinearLightCompositeOp", value: 34, isUnsigned: true)
!304 = !DIEnumerator(name: "LuminizeCompositeOp", value: 35, isUnsigned: true)
!305 = !DIEnumerator(name: "MinusDstCompositeOp", value: 36, isUnsigned: true)
!306 = !DIEnumerator(name: "ModulateCompositeOp", value: 37, isUnsigned: true)
!307 = !DIEnumerator(name: "MultiplyCompositeOp", value: 38, isUnsigned: true)
!308 = !DIEnumerator(name: "OutCompositeOp", value: 39, isUnsigned: true)
!309 = !DIEnumerator(name: "OverCompositeOp", value: 40, isUnsigned: true)
!310 = !DIEnumerator(name: "OverlayCompositeOp", value: 41, isUnsigned: true)
!311 = !DIEnumerator(name: "PlusCompositeOp", value: 42, isUnsigned: true)
!312 = !DIEnumerator(name: "ReplaceCompositeOp", value: 43, isUnsigned: true)
!313 = !DIEnumerator(name: "SaturateCompositeOp", value: 44, isUnsigned: true)
!314 = !DIEnumerator(name: "ScreenCompositeOp", value: 45, isUnsigned: true)
!315 = !DIEnumerator(name: "SoftLightCompositeOp", value: 46, isUnsigned: true)
!316 = !DIEnumerator(name: "SrcAtopCompositeOp", value: 47, isUnsigned: true)
!317 = !DIEnumerator(name: "SrcCompositeOp", value: 48, isUnsigned: true)
!318 = !DIEnumerator(name: "SrcInCompositeOp", value: 49, isUnsigned: true)
!319 = !DIEnumerator(name: "SrcOutCompositeOp", value: 50, isUnsigned: true)
!320 = !DIEnumerator(name: "SrcOverCompositeOp", value: 51, isUnsigned: true)
!321 = !DIEnumerator(name: "ModulusSubtractCompositeOp", value: 52, isUnsigned: true)
!322 = !DIEnumerator(name: "ThresholdCompositeOp", value: 53, isUnsigned: true)
!323 = !DIEnumerator(name: "XorCompositeOp", value: 54, isUnsigned: true)
!324 = !DIEnumerator(name: "DivideDstCompositeOp", value: 55, isUnsigned: true)
!325 = !DIEnumerator(name: "DistortCompositeOp", value: 56, isUnsigned: true)
!326 = !DIEnumerator(name: "BlurCompositeOp", value: 57, isUnsigned: true)
!327 = !DIEnumerator(name: "PegtopLightCompositeOp", value: 58, isUnsigned: true)
!328 = !DIEnumerator(name: "VividLightCompositeOp", value: 59, isUnsigned: true)
!329 = !DIEnumerator(name: "PinLightCompositeOp", value: 60, isUnsigned: true)
!330 = !DIEnumerator(name: "LinearDodgeCompositeOp", value: 61, isUnsigned: true)
!331 = !DIEnumerator(name: "LinearBurnCompositeOp", value: 62, isUnsigned: true)
!332 = !DIEnumerator(name: "MathematicsCompositeOp", value: 63, isUnsigned: true)
!333 = !DIEnumerator(name: "DivideSrcCompositeOp", value: 64, isUnsigned: true)
!334 = !DIEnumerator(name: "MinusSrcCompositeOp", value: 65, isUnsigned: true)
!335 = !DIEnumerator(name: "DarkenIntensityCompositeOp", value: 66, isUnsigned: true)
!336 = !DIEnumerator(name: "LightenIntensityCompositeOp", value: 67, isUnsigned: true)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "dispose", scope: !15, file: !16, line: 236, baseType: !338, size: 32, offset: 3360)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "DisposeType", file: !339, line: 32, baseType: !340)
!339 = !DIFile(filename: "./magick/layer.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!340 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !339, line: 25, baseType: !9, size: 32, elements: !341)
!341 = !{!342, !343, !344, !345, !346}
!342 = !DIEnumerator(name: "UnrecognizedDispose", value: 0, isUnsigned: true)
!343 = !DIEnumerator(name: "UndefinedDispose", value: 0, isUnsigned: true)
!344 = !DIEnumerator(name: "NoneDispose", value: 1, isUnsigned: true)
!345 = !DIEnumerator(name: "BackgroundDispose", value: 2, isUnsigned: true)
!346 = !DIEnumerator(name: "PreviousDispose", value: 3, isUnsigned: true)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "clip_mask", scope: !15, file: !16, line: 239, baseType: !348, size: 64, offset: 3392)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !15, file: !16, line: 242, baseType: !92, size: 64, offset: 3456)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !15, file: !16, line: 243, baseType: !92, size: 64, offset: 3520)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_second", scope: !15, file: !16, line: 246, baseType: !170, size: 64, offset: 3584)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "iterations", scope: !15, file: !16, line: 249, baseType: !92, size: 64, offset: 3648)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "total_colors", scope: !15, file: !16, line: 250, baseType: !92, size: 64, offset: 3712)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "start_loop", scope: !15, file: !16, line: 253, baseType: !170, size: 64, offset: 3776)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !15, file: !16, line: 256, baseType: !356, size: 192, offset: 3840)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErrorInfo", file: !357, line: 68, baseType: !358)
!357 = !DIFile(filename: "./magick/color.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!358 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ErrorInfo", file: !357, line: 62, size: 192, elements: !359)
!359 = !{!360, !361, !362}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "mean_error_per_pixel", scope: !358, file: !357, line: 65, baseType: !130, size: 64)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_mean_error", scope: !358, file: !357, line: 66, baseType: !130, size: 64, offset: 64)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_maximum_error", scope: !358, file: !357, line: 67, baseType: !130, size: 64, offset: 128)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !15, file: !16, line: 259, baseType: !364, size: 512, offset: 4032)
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerInfo", file: !365, line: 51, baseType: !366)
!365 = !DIFile(filename: "./magick/timer.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!366 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TimerInfo", file: !365, line: 40, size: 512, elements: !367)
!367 = !{!368, !375, !376, !383}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !366, file: !365, line: 43, baseType: !369, size: 192)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "Timer", file: !365, line: 38, baseType: !370)
!370 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Timer", file: !365, line: 32, size: 192, elements: !371)
!371 = !{!372, !373, !374}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !370, file: !365, line: 35, baseType: !130, size: 64)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !370, file: !365, line: 36, baseType: !130, size: 64, offset: 64)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !370, file: !365, line: 37, baseType: !130, size: 64, offset: 128)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "elapsed", scope: !366, file: !365, line: 44, baseType: !369, size: 192, offset: 192)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !366, file: !365, line: 47, baseType: !377, size: 32, offset: 384)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerState", file: !365, line: 30, baseType: !378)
!378 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !365, line: 25, baseType: !9, size: 32, elements: !379)
!379 = !{!380, !381, !382}
!380 = !DIEnumerator(name: "UndefinedTimerState", value: 0, isUnsigned: true)
!381 = !DIEnumerator(name: "StoppedTimerState", value: 1, isUnsigned: true)
!382 = !DIEnumerator(name: "RunningTimerState", value: 2, isUnsigned: true)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !366, file: !365, line: 50, baseType: !92, size: 64, offset: 448)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !15, file: !16, line: 262, baseType: !385, size: 64, offset: 4544)
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickProgressMonitor", file: !386, line: 26, baseType: !387)
!386 = !DIFile(filename: "./magick/monitor.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!388 = !DISubroutineType(types: !389)
!389 = !{!6, !390, !392, !395, !156}
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!391 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !166)
!392 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !393)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickOffsetType", file: !7, line: 150, baseType: !394)
!394 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!395 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !396)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickSizeType", file: !7, line: 151, baseType: !397)
!397 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !15, file: !16, line: 265, baseType: !156, size: 64, offset: 4608)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !15, file: !16, line: 266, baseType: !156, size: 64, offset: 4672)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !15, file: !16, line: 267, baseType: !156, size: 64, offset: 4736)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "ascii85", scope: !15, file: !16, line: 270, baseType: !402, size: 64, offset: 4800)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ascii85Info", file: !66, line: 52, baseType: !404)
!404 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Ascii85Info", file: !66, line: 51, flags: DIFlagFwdDecl)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !15, file: !16, line: 273, baseType: !406, size: 64, offset: 4864)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "BlobInfo", file: !7, line: 217, baseType: !408)
!408 = !DICompositeType(tag: DW_TAG_structure_type, name: "_BlobInfo", file: !7, line: 217, flags: DIFlagFwdDecl)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !15, file: !16, line: 276, baseType: !410, size: 32768, offset: 4928)
!410 = !DICompositeType(tag: DW_TAG_array_type, baseType: !166, size: 32768, elements: !411)
!411 = !{!412}
!412 = !DISubrange(count: 4096)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "magick_filename", scope: !15, file: !16, line: 277, baseType: !410, size: 32768, offset: 37696)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !15, file: !16, line: 278, baseType: !410, size: 32768, offset: 70464)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "magick_columns", scope: !15, file: !16, line: 281, baseType: !92, size: 64, offset: 103232)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "magick_rows", scope: !15, file: !16, line: 282, baseType: !92, size: 64, offset: 103296)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "exception", scope: !15, file: !16, line: 285, baseType: !418, size: 448, offset: 103360)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionInfo", file: !7, line: 219, baseType: !419)
!419 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ExceptionInfo", file: !420, line: 102, size: 448, elements: !421)
!420 = !DIFile(filename: "./magick/exception.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!421 = !{!422, !496, !498, !499, !500, !501, !502, !507}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "severity", scope: !419, file: !420, line: 105, baseType: !423, size: 32)
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionType", file: !420, line: 100, baseType: !424)
!424 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !420, line: 28, baseType: !9, size: 32, elements: !425)
!425 = !{!426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495}
!426 = !DIEnumerator(name: "UndefinedException", value: 0, isUnsigned: true)
!427 = !DIEnumerator(name: "WarningException", value: 300, isUnsigned: true)
!428 = !DIEnumerator(name: "ResourceLimitWarning", value: 300, isUnsigned: true)
!429 = !DIEnumerator(name: "TypeWarning", value: 305, isUnsigned: true)
!430 = !DIEnumerator(name: "OptionWarning", value: 310, isUnsigned: true)
!431 = !DIEnumerator(name: "DelegateWarning", value: 315, isUnsigned: true)
!432 = !DIEnumerator(name: "MissingDelegateWarning", value: 320, isUnsigned: true)
!433 = !DIEnumerator(name: "CorruptImageWarning", value: 325, isUnsigned: true)
!434 = !DIEnumerator(name: "FileOpenWarning", value: 330, isUnsigned: true)
!435 = !DIEnumerator(name: "BlobWarning", value: 335, isUnsigned: true)
!436 = !DIEnumerator(name: "StreamWarning", value: 340, isUnsigned: true)
!437 = !DIEnumerator(name: "CacheWarning", value: 345, isUnsigned: true)
!438 = !DIEnumerator(name: "CoderWarning", value: 350, isUnsigned: true)
!439 = !DIEnumerator(name: "FilterWarning", value: 352, isUnsigned: true)
!440 = !DIEnumerator(name: "ModuleWarning", value: 355, isUnsigned: true)
!441 = !DIEnumerator(name: "DrawWarning", value: 360, isUnsigned: true)
!442 = !DIEnumerator(name: "ImageWarning", value: 365, isUnsigned: true)
!443 = !DIEnumerator(name: "WandWarning", value: 370, isUnsigned: true)
!444 = !DIEnumerator(name: "RandomWarning", value: 375, isUnsigned: true)
!445 = !DIEnumerator(name: "XServerWarning", value: 380, isUnsigned: true)
!446 = !DIEnumerator(name: "MonitorWarning", value: 385, isUnsigned: true)
!447 = !DIEnumerator(name: "RegistryWarning", value: 390, isUnsigned: true)
!448 = !DIEnumerator(name: "ConfigureWarning", value: 395, isUnsigned: true)
!449 = !DIEnumerator(name: "PolicyWarning", value: 399, isUnsigned: true)
!450 = !DIEnumerator(name: "ErrorException", value: 400, isUnsigned: true)
!451 = !DIEnumerator(name: "ResourceLimitError", value: 400, isUnsigned: true)
!452 = !DIEnumerator(name: "TypeError", value: 405, isUnsigned: true)
!453 = !DIEnumerator(name: "OptionError", value: 410, isUnsigned: true)
!454 = !DIEnumerator(name: "DelegateError", value: 415, isUnsigned: true)
!455 = !DIEnumerator(name: "MissingDelegateError", value: 420, isUnsigned: true)
!456 = !DIEnumerator(name: "CorruptImageError", value: 425, isUnsigned: true)
!457 = !DIEnumerator(name: "FileOpenError", value: 430, isUnsigned: true)
!458 = !DIEnumerator(name: "BlobError", value: 435, isUnsigned: true)
!459 = !DIEnumerator(name: "StreamError", value: 440, isUnsigned: true)
!460 = !DIEnumerator(name: "CacheError", value: 445, isUnsigned: true)
!461 = !DIEnumerator(name: "CoderError", value: 450, isUnsigned: true)
!462 = !DIEnumerator(name: "FilterError", value: 452, isUnsigned: true)
!463 = !DIEnumerator(name: "ModuleError", value: 455, isUnsigned: true)
!464 = !DIEnumerator(name: "DrawError", value: 460, isUnsigned: true)
!465 = !DIEnumerator(name: "ImageError", value: 465, isUnsigned: true)
!466 = !DIEnumerator(name: "WandError", value: 470, isUnsigned: true)
!467 = !DIEnumerator(name: "RandomError", value: 475, isUnsigned: true)
!468 = !DIEnumerator(name: "XServerError", value: 480, isUnsigned: true)
!469 = !DIEnumerator(name: "MonitorError", value: 485, isUnsigned: true)
!470 = !DIEnumerator(name: "RegistryError", value: 490, isUnsigned: true)
!471 = !DIEnumerator(name: "ConfigureError", value: 495, isUnsigned: true)
!472 = !DIEnumerator(name: "PolicyError", value: 499, isUnsigned: true)
!473 = !DIEnumerator(name: "FatalErrorException", value: 700, isUnsigned: true)
!474 = !DIEnumerator(name: "ResourceLimitFatalError", value: 700, isUnsigned: true)
!475 = !DIEnumerator(name: "TypeFatalError", value: 705, isUnsigned: true)
!476 = !DIEnumerator(name: "OptionFatalError", value: 710, isUnsigned: true)
!477 = !DIEnumerator(name: "DelegateFatalError", value: 715, isUnsigned: true)
!478 = !DIEnumerator(name: "MissingDelegateFatalError", value: 720, isUnsigned: true)
!479 = !DIEnumerator(name: "CorruptImageFatalError", value: 725, isUnsigned: true)
!480 = !DIEnumerator(name: "FileOpenFatalError", value: 730, isUnsigned: true)
!481 = !DIEnumerator(name: "BlobFatalError", value: 735, isUnsigned: true)
!482 = !DIEnumerator(name: "StreamFatalError", value: 740, isUnsigned: true)
!483 = !DIEnumerator(name: "CacheFatalError", value: 745, isUnsigned: true)
!484 = !DIEnumerator(name: "CoderFatalError", value: 750, isUnsigned: true)
!485 = !DIEnumerator(name: "FilterFatalError", value: 752, isUnsigned: true)
!486 = !DIEnumerator(name: "ModuleFatalError", value: 755, isUnsigned: true)
!487 = !DIEnumerator(name: "DrawFatalError", value: 760, isUnsigned: true)
!488 = !DIEnumerator(name: "ImageFatalError", value: 765, isUnsigned: true)
!489 = !DIEnumerator(name: "WandFatalError", value: 770, isUnsigned: true)
!490 = !DIEnumerator(name: "RandomFatalError", value: 775, isUnsigned: true)
!491 = !DIEnumerator(name: "XServerFatalError", value: 780, isUnsigned: true)
!492 = !DIEnumerator(name: "MonitorFatalError", value: 785, isUnsigned: true)
!493 = !DIEnumerator(name: "RegistryFatalError", value: 790, isUnsigned: true)
!494 = !DIEnumerator(name: "ConfigureFatalError", value: 795, isUnsigned: true)
!495 = !DIEnumerator(name: "PolicyFatalError", value: 799, isUnsigned: true)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "error_number", scope: !419, file: !420, line: 108, baseType: !497, size: 32, offset: 32)
!497 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !419, file: !420, line: 111, baseType: !165, size: 64, offset: 64)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !419, file: !420, line: 112, baseType: !165, size: 64, offset: 128)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "exceptions", scope: !419, file: !420, line: 115, baseType: !156, size: 64, offset: 192)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "relinquish", scope: !419, file: !420, line: 118, baseType: !6, size: 32, offset: 256)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !419, file: !420, line: 121, baseType: !503, size: 64, offset: 320)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64)
!504 = !DIDerivedType(tag: DW_TAG_typedef, name: "SemaphoreInfo", file: !505, line: 26, baseType: !506)
!505 = !DIFile(filename: "./magick/semaphore.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!506 = !DICompositeType(tag: DW_TAG_structure_type, name: "SemaphoreInfo", file: !505, line: 25, flags: DIFlagFwdDecl)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !419, file: !420, line: 124, baseType: !92, size: 64, offset: 384)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !15, file: !16, line: 288, baseType: !6, size: 32, offset: 103808)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !15, file: !16, line: 291, baseType: !510, size: 64, offset: 103872)
!510 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !170)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !15, file: !16, line: 294, baseType: !503, size: 64, offset: 103936)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "color_profile", scope: !15, file: !16, line: 297, baseType: !513, size: 256, offset: 104000)
!513 = !DIDerivedType(tag: DW_TAG_typedef, name: "ProfileInfo", file: !147, line: 40, baseType: !514)
!514 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ProfileInfo", file: !147, line: 27, size: 256, elements: !515)
!515 = !{!516, !517, !518, !521}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !514, file: !147, line: 30, baseType: !165, size: 64)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !514, file: !147, line: 33, baseType: !92, size: 64, offset: 64)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !514, file: !147, line: 36, baseType: !519, size: 64, offset: 128)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!520 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !514, file: !147, line: 39, baseType: !92, size: 64, offset: 192)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "iptc_profile", scope: !15, file: !16, line: 298, baseType: !513, size: 256, offset: 104256)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profile", scope: !15, file: !16, line: 299, baseType: !524, size: 64, offset: 104512)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profiles", scope: !15, file: !16, line: 302, baseType: !92, size: 64, offset: 104576)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !15, file: !16, line: 305, baseType: !92, size: 64, offset: 104640)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !15, file: !16, line: 308, baseType: !348, size: 64, offset: 104704)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !15, file: !16, line: 309, baseType: !348, size: 64, offset: 104768)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !15, file: !16, line: 310, baseType: !348, size: 64, offset: 104832)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "interpolate", scope: !15, file: !16, line: 313, baseType: !531, size: 32, offset: 104896)
!531 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterpolatePixelMethod", file: !117, line: 47, baseType: !532)
!532 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !117, line: 31, baseType: !9, size: 32, elements: !533)
!533 = !{!534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547}
!534 = !DIEnumerator(name: "UndefinedInterpolatePixel", value: 0, isUnsigned: true)
!535 = !DIEnumerator(name: "AverageInterpolatePixel", value: 1, isUnsigned: true)
!536 = !DIEnumerator(name: "BicubicInterpolatePixel", value: 2, isUnsigned: true)
!537 = !DIEnumerator(name: "BilinearInterpolatePixel", value: 3, isUnsigned: true)
!538 = !DIEnumerator(name: "FilterInterpolatePixel", value: 4, isUnsigned: true)
!539 = !DIEnumerator(name: "IntegerInterpolatePixel", value: 5, isUnsigned: true)
!540 = !DIEnumerator(name: "MeshInterpolatePixel", value: 6, isUnsigned: true)
!541 = !DIEnumerator(name: "NearestNeighborInterpolatePixel", value: 7, isUnsigned: true)
!542 = !DIEnumerator(name: "SplineInterpolatePixel", value: 8, isUnsigned: true)
!543 = !DIEnumerator(name: "Average9InterpolatePixel", value: 9, isUnsigned: true)
!544 = !DIEnumerator(name: "Average16InterpolatePixel", value: 10, isUnsigned: true)
!545 = !DIEnumerator(name: "BlendInterpolatePixel", value: 11, isUnsigned: true)
!546 = !DIEnumerator(name: "BackgroundInterpolatePixel", value: 12, isUnsigned: true)
!547 = !DIEnumerator(name: "CatromInterpolatePixel", value: 13, isUnsigned: true)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "black_point_compensation", scope: !15, file: !16, line: 316, baseType: !6, size: 32, offset: 104928)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_color", scope: !15, file: !16, line: 319, baseType: !116, size: 64, offset: 104960)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !15, file: !16, line: 322, baseType: !348, size: 64, offset: 105024)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "tile_offset", scope: !15, file: !16, line: 325, baseType: !178, size: 256, offset: 105088)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !15, file: !16, line: 328, baseType: !156, size: 64, offset: 105344)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "artifacts", scope: !15, file: !16, line: 329, baseType: !156, size: 64, offset: 105408)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !15, file: !16, line: 332, baseType: !555, size: 32, offset: 105472)
!555 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageType", file: !16, line: 61, baseType: !556)
!556 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !16, line: 47, baseType: !9, size: 32, elements: !557)
!557 = !{!558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569}
!558 = !DIEnumerator(name: "UndefinedType", value: 0, isUnsigned: true)
!559 = !DIEnumerator(name: "BilevelType", value: 1, isUnsigned: true)
!560 = !DIEnumerator(name: "GrayscaleType", value: 2, isUnsigned: true)
!561 = !DIEnumerator(name: "GrayscaleMatteType", value: 3, isUnsigned: true)
!562 = !DIEnumerator(name: "PaletteType", value: 4, isUnsigned: true)
!563 = !DIEnumerator(name: "PaletteMatteType", value: 5, isUnsigned: true)
!564 = !DIEnumerator(name: "TrueColorType", value: 6, isUnsigned: true)
!565 = !DIEnumerator(name: "TrueColorMatteType", value: 7, isUnsigned: true)
!566 = !DIEnumerator(name: "ColorSeparationType", value: 8, isUnsigned: true)
!567 = !DIEnumerator(name: "ColorSeparationMatteType", value: 9, isUnsigned: true)
!568 = !DIEnumerator(name: "OptimizeType", value: 10, isUnsigned: true)
!569 = !DIEnumerator(name: "PaletteBilevelMatteType", value: 11, isUnsigned: true)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !15, file: !16, line: 335, baseType: !6, size: 32, offset: 105504)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !15, file: !16, line: 338, baseType: !396, size: 64, offset: 105536)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "ping", scope: !15, file: !16, line: 341, baseType: !6, size: 32, offset: 105600)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !15, file: !16, line: 344, baseType: !92, size: 64, offset: 105664)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !15, file: !16, line: 347, baseType: !575, size: 64, offset: 105728)
!575 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !576, line: 7, baseType: !577)
!576 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "")
!577 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !173, line: 160, baseType: !174)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "intensity", scope: !15, file: !16, line: 350, baseType: !579, size: 32, offset: 105792)
!579 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelIntensityMethod", file: !117, line: 79, baseType: !580)
!580 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !117, line: 67, baseType: !9, size: 32, elements: !581)
!581 = !{!582, !583, !584, !585, !586, !587, !588, !589, !590, !591}
!582 = !DIEnumerator(name: "UndefinedPixelIntensityMethod", value: 0, isUnsigned: true)
!583 = !DIEnumerator(name: "AveragePixelIntensityMethod", value: 1, isUnsigned: true)
!584 = !DIEnumerator(name: "BrightnessPixelIntensityMethod", value: 2, isUnsigned: true)
!585 = !DIEnumerator(name: "LightnessPixelIntensityMethod", value: 3, isUnsigned: true)
!586 = !DIEnumerator(name: "Rec601LumaPixelIntensityMethod", value: 4, isUnsigned: true)
!587 = !DIEnumerator(name: "Rec601LuminancePixelIntensityMethod", value: 5, isUnsigned: true)
!588 = !DIEnumerator(name: "Rec709LumaPixelIntensityMethod", value: 6, isUnsigned: true)
!589 = !DIEnumerator(name: "Rec709LuminancePixelIntensityMethod", value: 7, isUnsigned: true)
!590 = !DIEnumerator(name: "RMSPixelIntensityMethod", value: 8, isUnsigned: true)
!591 = !DIEnumerator(name: "MSPixelIntensityMethod", value: 9, isUnsigned: true)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !15, file: !16, line: 353, baseType: !92, size: 64, offset: 105856)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64)
!594 = !DIDerivedType(tag: DW_TAG_typedef, name: "StringInfo", file: !595, line: 40, baseType: !596)
!595 = !DIFile(filename: "./magick/string_.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!596 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_StringInfo", file: !595, line: 29, size: 32960, elements: !597)
!597 = !{!598, !599, !600, !601}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !596, file: !595, line: 32, baseType: !410, size: 32768)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "datum", scope: !596, file: !595, line: 35, baseType: !519, size: 64, offset: 32768)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !596, file: !595, line: 38, baseType: !92, size: 64, offset: 32832)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !596, file: !595, line: 39, baseType: !92, size: 64, offset: 32896)
!602 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !603, retainedTypes: !629, globals: !645, splitDebugInlining: false, nameTableKind: None)
!603 = !{!8, !20, !28, !67, !97, !148, !159, !194, !230, !243, !250, !267, !340, !378, !424, !532, !556, !580, !604}
!604 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !605, line: 34, baseType: !9, size: 32, elements: !606)
!605 = !DIFile(filename: "./magick/log.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!606 = !{!607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628}
!607 = !DIEnumerator(name: "UndefinedEvents", value: 0, isUnsigned: true)
!608 = !DIEnumerator(name: "NoEvents", value: 0, isUnsigned: true)
!609 = !DIEnumerator(name: "TraceEvent", value: 1, isUnsigned: true)
!610 = !DIEnumerator(name: "AnnotateEvent", value: 2, isUnsigned: true)
!611 = !DIEnumerator(name: "BlobEvent", value: 4, isUnsigned: true)
!612 = !DIEnumerator(name: "CacheEvent", value: 8, isUnsigned: true)
!613 = !DIEnumerator(name: "CoderEvent", value: 16, isUnsigned: true)
!614 = !DIEnumerator(name: "ConfigureEvent", value: 32, isUnsigned: true)
!615 = !DIEnumerator(name: "DeprecateEvent", value: 64, isUnsigned: true)
!616 = !DIEnumerator(name: "DrawEvent", value: 128, isUnsigned: true)
!617 = !DIEnumerator(name: "ExceptionEvent", value: 256, isUnsigned: true)
!618 = !DIEnumerator(name: "ImageEvent", value: 512, isUnsigned: true)
!619 = !DIEnumerator(name: "LocaleEvent", value: 1024, isUnsigned: true)
!620 = !DIEnumerator(name: "ModuleEvent", value: 2048, isUnsigned: true)
!621 = !DIEnumerator(name: "PolicyEvent", value: 4096, isUnsigned: true)
!622 = !DIEnumerator(name: "ResourceEvent", value: 8192, isUnsigned: true)
!623 = !DIEnumerator(name: "TransformEvent", value: 16384, isUnsigned: true)
!624 = !DIEnumerator(name: "UserEvent", value: 36864, isUnsigned: true)
!625 = !DIEnumerator(name: "WandEvent", value: 65536, isUnsigned: true)
!626 = !DIEnumerator(name: "X11Event", value: 131072, isUnsigned: true)
!627 = !DIEnumerator(name: "AccelerateEvent", value: 262144, isUnsigned: true)
!628 = !DIEnumerator(name: "AllEvents", value: 2147483647, isUnsigned: true)
!629 = !{!94, !156, !630, !634, !519, !593, !637, !165, !639, !641, !390, !170, !92, !122, !520, !130, !158, !9, !497, !642}
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64)
!631 = !DIDerivedType(tag: DW_TAG_typedef, name: "SplayTreeInfo", file: !632, line: 26, baseType: !633)
!632 = !DIFile(filename: "./magick/splay-tree.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!633 = !DICompositeType(tag: DW_TAG_structure_type, name: "_SplayTreeInfo", file: !632, line: 25, flags: DIFlagFwdDecl)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64)
!635 = !DISubroutineType(types: !636)
!636 = !{!156, !156}
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 64)
!638 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !594)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64)
!640 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 64)
!643 = !DISubroutineType(types: !644)
!644 = !{!497, !639, !639}
!645 = !{!0}
!646 = !{}
!647 = !DICompositeType(tag: DW_TAG_array_type, baseType: !497, size: 416, elements: !648)
!648 = !{!649}
!649 = !DISubrange(count: 13)
!650 = !{i32 7, !"Dwarf Version", i32 4}
!651 = !{i32 2, !"Debug Info Version", i32 3}
!652 = !{i32 1, !"wchar_size", i32 4}
!653 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!654 = distinct !DISubprogram(name: "CloneImageProfiles", scope: !3, file: !3, line: 137, type: !655, scopeLine: 139, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !602, retainedNodes: !646)
!655 = !DISubroutineType(types: !656)
!656 = !{!6, !13, !657}
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64)
!658 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !14)
!659 = !DILocalVariable(name: "image", arg: 1, scope: !654, file: !3, line: 137, type: !13)
!660 = !DILocation(line: 137, column: 58, scope: !654)
!661 = !DILocalVariable(name: "clone_image", arg: 2, scope: !654, file: !3, line: 138, type: !657)
!662 = !DILocation(line: 138, column: 16, scope: !654)
!663 = !DILocation(line: 142, column: 7, scope: !664)
!664 = distinct !DILexicalBlock(scope: !654, file: !3, line: 142, column: 7)
!665 = !DILocation(line: 142, column: 14, scope: !664)
!666 = !DILocation(line: 142, column: 20, scope: !664)
!667 = !DILocation(line: 142, column: 7, scope: !654)
!668 = !DILocation(line: 143, column: 61, scope: !664)
!669 = !DILocation(line: 143, column: 68, scope: !664)
!670 = !DILocation(line: 143, column: 12, scope: !664)
!671 = !DILocation(line: 143, column: 5, scope: !664)
!672 = !DILocation(line: 146, column: 31, scope: !654)
!673 = !DILocation(line: 146, column: 44, scope: !654)
!674 = !DILocation(line: 146, column: 58, scope: !654)
!675 = !DILocation(line: 146, column: 3, scope: !654)
!676 = !DILocation(line: 146, column: 10, scope: !654)
!677 = !DILocation(line: 146, column: 24, scope: !654)
!678 = !DILocation(line: 146, column: 30, scope: !654)
!679 = !DILocation(line: 147, column: 29, scope: !654)
!680 = !DILocation(line: 147, column: 42, scope: !654)
!681 = !DILocation(line: 147, column: 56, scope: !654)
!682 = !DILocation(line: 147, column: 3, scope: !654)
!683 = !DILocation(line: 147, column: 10, scope: !654)
!684 = !DILocation(line: 147, column: 24, scope: !654)
!685 = !DILocation(line: 147, column: 28, scope: !654)
!686 = !DILocation(line: 148, column: 30, scope: !654)
!687 = !DILocation(line: 148, column: 43, scope: !654)
!688 = !DILocation(line: 148, column: 56, scope: !654)
!689 = !DILocation(line: 148, column: 3, scope: !654)
!690 = !DILocation(line: 148, column: 10, scope: !654)
!691 = !DILocation(line: 148, column: 23, scope: !654)
!692 = !DILocation(line: 148, column: 29, scope: !654)
!693 = !DILocation(line: 149, column: 28, scope: !654)
!694 = !DILocation(line: 149, column: 41, scope: !654)
!695 = !DILocation(line: 149, column: 54, scope: !654)
!696 = !DILocation(line: 149, column: 3, scope: !654)
!697 = !DILocation(line: 149, column: 10, scope: !654)
!698 = !DILocation(line: 149, column: 23, scope: !654)
!699 = !DILocation(line: 149, column: 27, scope: !654)
!700 = !DILocation(line: 150, column: 7, scope: !701)
!701 = distinct !DILexicalBlock(scope: !654, file: !3, line: 150, column: 7)
!702 = !DILocation(line: 150, column: 20, scope: !701)
!703 = !DILocation(line: 150, column: 29, scope: !701)
!704 = !DILocation(line: 150, column: 7, scope: !654)
!705 = !DILocation(line: 152, column: 11, scope: !706)
!706 = distinct !DILexicalBlock(scope: !707, file: !3, line: 152, column: 11)
!707 = distinct !DILexicalBlock(scope: !701, file: !3, line: 151, column: 5)
!708 = !DILocation(line: 152, column: 18, scope: !706)
!709 = !DILocation(line: 152, column: 27, scope: !706)
!710 = !DILocation(line: 152, column: 11, scope: !707)
!711 = !DILocation(line: 153, column: 30, scope: !706)
!712 = !DILocation(line: 153, column: 9, scope: !706)
!713 = !DILocation(line: 154, column: 56, scope: !707)
!714 = !DILocation(line: 154, column: 69, scope: !707)
!715 = !DILocation(line: 154, column: 38, scope: !707)
!716 = !DILocation(line: 154, column: 23, scope: !707)
!717 = !DILocation(line: 154, column: 7, scope: !707)
!718 = !DILocation(line: 154, column: 14, scope: !707)
!719 = !DILocation(line: 154, column: 22, scope: !707)
!720 = !DILocation(line: 156, column: 4, scope: !707)
!721 = !DILocation(line: 157, column: 3, scope: !654)
!722 = distinct !DISubprogram(name: "DestroyImageProfiles", scope: !3, file: !3, line: 234, type: !723, scopeLine: 235, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !602, retainedNodes: !646)
!723 = !DISubroutineType(types: !724)
!724 = !{null, !13}
!725 = !DILocalVariable(name: "image", arg: 1, scope: !722, file: !3, line: 234, type: !13)
!726 = !DILocation(line: 234, column: 47, scope: !722)
!727 = !DILocation(line: 236, column: 7, scope: !728)
!728 = distinct !DILexicalBlock(scope: !722, file: !3, line: 236, column: 7)
!729 = !DILocation(line: 236, column: 14, scope: !728)
!730 = !DILocation(line: 236, column: 23, scope: !728)
!731 = !DILocation(line: 236, column: 7, scope: !722)
!732 = !DILocation(line: 237, column: 56, scope: !728)
!733 = !DILocation(line: 237, column: 63, scope: !728)
!734 = !DILocation(line: 237, column: 38, scope: !728)
!735 = !DILocation(line: 237, column: 21, scope: !728)
!736 = !DILocation(line: 237, column: 5, scope: !728)
!737 = !DILocation(line: 237, column: 12, scope: !728)
!738 = !DILocation(line: 237, column: 20, scope: !728)
!739 = !DILocation(line: 238, column: 1, scope: !722)
!740 = distinct !DISubprogram(name: "DeleteImageProfile", scope: !3, file: !3, line: 184, type: !741, scopeLine: 185, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !602, retainedNodes: !646)
!741 = !DISubroutineType(types: !742)
!742 = !{!6, !13, !390}
!743 = !DILocalVariable(name: "image", arg: 1, scope: !740, file: !3, line: 184, type: !13)
!744 = !DILocation(line: 184, column: 58, scope: !740)
!745 = !DILocalVariable(name: "name", arg: 2, scope: !740, file: !3, line: 184, type: !390)
!746 = !DILocation(line: 184, column: 76, scope: !740)
!747 = !DILocation(line: 188, column: 7, scope: !748)
!748 = distinct !DILexicalBlock(scope: !740, file: !3, line: 188, column: 7)
!749 = !DILocation(line: 188, column: 14, scope: !748)
!750 = !DILocation(line: 188, column: 20, scope: !748)
!751 = !DILocation(line: 188, column: 7, scope: !740)
!752 = !DILocation(line: 189, column: 61, scope: !748)
!753 = !DILocation(line: 189, column: 68, scope: !748)
!754 = !DILocation(line: 189, column: 12, scope: !748)
!755 = !DILocation(line: 189, column: 5, scope: !748)
!756 = !DILocation(line: 190, column: 7, scope: !757)
!757 = distinct !DILexicalBlock(scope: !740, file: !3, line: 190, column: 7)
!758 = !DILocation(line: 190, column: 14, scope: !757)
!759 = !DILocation(line: 190, column: 23, scope: !757)
!760 = !DILocation(line: 190, column: 7, scope: !740)
!761 = !DILocation(line: 191, column: 5, scope: !757)
!762 = !DILocation(line: 192, column: 21, scope: !763)
!763 = distinct !DILexicalBlock(scope: !740, file: !3, line: 192, column: 7)
!764 = !DILocation(line: 192, column: 7, scope: !763)
!765 = !DILocation(line: 192, column: 33, scope: !763)
!766 = !DILocation(line: 192, column: 7, scope: !740)
!767 = !DILocation(line: 197, column: 7, scope: !768)
!768 = distinct !DILexicalBlock(scope: !763, file: !3, line: 193, column: 5)
!769 = !DILocation(line: 197, column: 14, scope: !768)
!770 = !DILocation(line: 197, column: 28, scope: !768)
!771 = !DILocation(line: 197, column: 34, scope: !768)
!772 = !DILocation(line: 198, column: 7, scope: !768)
!773 = !DILocation(line: 198, column: 14, scope: !768)
!774 = !DILocation(line: 198, column: 28, scope: !768)
!775 = !DILocation(line: 198, column: 32, scope: !768)
!776 = !DILocation(line: 199, column: 5, scope: !768)
!777 = !DILocation(line: 200, column: 21, scope: !778)
!778 = distinct !DILexicalBlock(scope: !740, file: !3, line: 200, column: 7)
!779 = !DILocation(line: 200, column: 7, scope: !778)
!780 = !DILocation(line: 200, column: 34, scope: !778)
!781 = !DILocation(line: 200, column: 7, scope: !740)
!782 = !DILocation(line: 205, column: 7, scope: !783)
!783 = distinct !DILexicalBlock(scope: !778, file: !3, line: 201, column: 5)
!784 = !DILocation(line: 205, column: 14, scope: !783)
!785 = !DILocation(line: 205, column: 27, scope: !783)
!786 = !DILocation(line: 205, column: 33, scope: !783)
!787 = !DILocation(line: 206, column: 7, scope: !783)
!788 = !DILocation(line: 206, column: 14, scope: !783)
!789 = !DILocation(line: 206, column: 27, scope: !783)
!790 = !DILocation(line: 206, column: 31, scope: !783)
!791 = !DILocation(line: 207, column: 5, scope: !783)
!792 = !DILocation(line: 208, column: 22, scope: !740)
!793 = !DILocation(line: 208, column: 28, scope: !740)
!794 = !DILocation(line: 208, column: 3, scope: !740)
!795 = !DILocation(line: 209, column: 52, scope: !740)
!796 = !DILocation(line: 209, column: 59, scope: !740)
!797 = !DILocation(line: 209, column: 34, scope: !740)
!798 = !DILocation(line: 209, column: 68, scope: !740)
!799 = !DILocation(line: 209, column: 10, scope: !740)
!800 = !DILocation(line: 209, column: 3, scope: !740)
!801 = !DILocation(line: 210, column: 1, scope: !740)
!802 = distinct !DISubprogram(name: "WriteTo8BimProfile", scope: !3, file: !3, line: 1164, type: !803, scopeLine: 1166, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !602, retainedNodes: !646)
!803 = !DISubroutineType(types: !804)
!804 = !{null, !13, !390, !637}
!805 = !DILocalVariable(name: "image", arg: 1, scope: !802, file: !3, line: 1164, type: !13)
!806 = !DILocation(line: 1164, column: 39, scope: !802)
!807 = !DILocalVariable(name: "name", arg: 2, scope: !802, file: !3, line: 1164, type: !390)
!808 = !DILocation(line: 1164, column: 57, scope: !802)
!809 = !DILocalVariable(name: "profile", arg: 3, scope: !802, file: !3, line: 1165, type: !637)
!810 = !DILocation(line: 1165, column: 21, scope: !802)
!811 = !DILocalVariable(name: "datum", scope: !802, file: !3, line: 1169, type: !812)
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !813, size: 64)
!813 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !520)
!814 = !DILocation(line: 1169, column: 6, scope: !802)
!815 = !DILocalVariable(name: "s", scope: !802, file: !3, line: 1170, type: !812)
!816 = !DILocation(line: 1170, column: 6, scope: !802)
!817 = !DILocalVariable(name: "p", scope: !802, file: !3, line: 1173, type: !812)
!818 = !DILocation(line: 1173, column: 6, scope: !802)
!819 = !DILocalVariable(name: "length", scope: !802, file: !3, line: 1176, type: !92)
!820 = !DILocation(line: 1176, column: 5, scope: !802)
!821 = !DILocalVariable(name: "profile_8bim", scope: !802, file: !3, line: 1179, type: !593)
!822 = !DILocation(line: 1179, column: 6, scope: !802)
!823 = !DILocalVariable(name: "count", scope: !802, file: !3, line: 1182, type: !170)
!824 = !DILocation(line: 1182, column: 5, scope: !802)
!825 = !DILocalVariable(name: "length_byte", scope: !802, file: !3, line: 1185, type: !520)
!826 = !DILocation(line: 1185, column: 5, scope: !802)
!827 = !DILocalVariable(name: "value", scope: !802, file: !3, line: 1188, type: !9)
!828 = !DILocation(line: 1188, column: 5, scope: !802)
!829 = !DILocalVariable(name: "id", scope: !802, file: !3, line: 1191, type: !122)
!830 = !DILocation(line: 1191, column: 5, scope: !802)
!831 = !DILocalVariable(name: "profile_id", scope: !802, file: !3, line: 1192, type: !122)
!832 = !DILocation(line: 1192, column: 5, scope: !802)
!833 = !DILocation(line: 1194, column: 21, scope: !834)
!834 = distinct !DILexicalBlock(scope: !802, file: !3, line: 1194, column: 7)
!835 = !DILocation(line: 1194, column: 7, scope: !834)
!836 = !DILocation(line: 1194, column: 33, scope: !834)
!837 = !DILocation(line: 1194, column: 7, scope: !802)
!838 = !DILocation(line: 1195, column: 15, scope: !834)
!839 = !DILocation(line: 1195, column: 5, scope: !834)
!840 = !DILocation(line: 1196, column: 26, scope: !841)
!841 = distinct !DILexicalBlock(scope: !834, file: !3, line: 1196, column: 12)
!842 = !DILocation(line: 1196, column: 12, scope: !841)
!843 = !DILocation(line: 1196, column: 39, scope: !841)
!844 = !DILocation(line: 1196, column: 12, scope: !834)
!845 = !DILocation(line: 1197, column: 15, scope: !841)
!846 = !DILocation(line: 1197, column: 5, scope: !841)
!847 = !DILocation(line: 1198, column: 26, scope: !848)
!848 = distinct !DILexicalBlock(scope: !841, file: !3, line: 1198, column: 12)
!849 = !DILocation(line: 1198, column: 12, scope: !848)
!850 = !DILocation(line: 1198, column: 38, scope: !848)
!851 = !DILocation(line: 1198, column: 12, scope: !841)
!852 = !DILocation(line: 1199, column: 15, scope: !848)
!853 = !DILocation(line: 1199, column: 5, scope: !848)
!854 = !DILocation(line: 1201, column: 5, scope: !848)
!855 = !DILocation(line: 1203, column: 5, scope: !802)
!856 = !DILocation(line: 1203, column: 12, scope: !802)
!857 = !DILocation(line: 1202, column: 52, scope: !802)
!858 = !DILocation(line: 1202, column: 30, scope: !802)
!859 = !DILocation(line: 1202, column: 16, scope: !802)
!860 = !DILocation(line: 1202, column: 15, scope: !802)
!861 = !DILocation(line: 1204, column: 7, scope: !862)
!862 = distinct !DILexicalBlock(scope: !802, file: !3, line: 1204, column: 7)
!863 = !DILocation(line: 1204, column: 20, scope: !862)
!864 = !DILocation(line: 1204, column: 7, scope: !802)
!865 = !DILocation(line: 1205, column: 5, scope: !862)
!866 = !DILocation(line: 1206, column: 28, scope: !802)
!867 = !DILocation(line: 1206, column: 9, scope: !802)
!868 = !DILocation(line: 1206, column: 8, scope: !802)
!869 = !DILocation(line: 1207, column: 30, scope: !802)
!870 = !DILocation(line: 1207, column: 10, scope: !802)
!871 = !DILocation(line: 1207, column: 9, scope: !802)
!872 = !DILocation(line: 1208, column: 10, scope: !873)
!873 = distinct !DILexicalBlock(scope: !802, file: !3, line: 1208, column: 3)
!874 = !DILocation(line: 1208, column: 9, scope: !873)
!875 = !DILocation(line: 1208, column: 8, scope: !873)
!876 = !DILocation(line: 1208, column: 17, scope: !877)
!877 = distinct !DILexicalBlock(scope: !873, file: !3, line: 1208, column: 3)
!878 = !DILocation(line: 1208, column: 22, scope: !877)
!879 = !DILocation(line: 1208, column: 28, scope: !877)
!880 = !DILocation(line: 1208, column: 27, scope: !877)
!881 = !DILocation(line: 1208, column: 34, scope: !877)
!882 = !DILocation(line: 1208, column: 19, scope: !877)
!883 = !DILocation(line: 1208, column: 3, scope: !873)
!884 = !DILocation(line: 1210, column: 7, scope: !885)
!885 = distinct !DILexicalBlock(scope: !877, file: !3, line: 1209, column: 3)
!886 = !DILocation(line: 1210, column: 6, scope: !885)
!887 = !DILocation(line: 1211, column: 33, scope: !888)
!888 = distinct !DILexicalBlock(scope: !885, file: !3, line: 1211, column: 9)
!889 = !DILocation(line: 1211, column: 9, scope: !888)
!890 = !DILocation(line: 1211, column: 45, scope: !888)
!891 = !DILocation(line: 1211, column: 9, scope: !885)
!892 = !DILocation(line: 1212, column: 7, scope: !888)
!893 = !DILocation(line: 1213, column: 6, scope: !885)
!894 = !DILocation(line: 1214, column: 25, scope: !885)
!895 = !DILocation(line: 1214, column: 7, scope: !885)
!896 = !DILocation(line: 1214, column: 6, scope: !885)
!897 = !DILocation(line: 1215, column: 24, scope: !885)
!898 = !DILocation(line: 1215, column: 7, scope: !885)
!899 = !DILocation(line: 1215, column: 6, scope: !885)
!900 = !DILocation(line: 1216, column: 8, scope: !885)
!901 = !DILocation(line: 1216, column: 6, scope: !885)
!902 = !DILocation(line: 1217, column: 11, scope: !903)
!903 = distinct !DILexicalBlock(scope: !885, file: !3, line: 1217, column: 9)
!904 = !DILocation(line: 1217, column: 22, scope: !903)
!905 = !DILocation(line: 1217, column: 26, scope: !903)
!906 = !DILocation(line: 1217, column: 34, scope: !903)
!907 = !DILocation(line: 1217, column: 9, scope: !885)
!908 = !DILocation(line: 1218, column: 8, scope: !903)
!909 = !DILocation(line: 1218, column: 7, scope: !903)
!910 = !DILocation(line: 1219, column: 9, scope: !911)
!911 = distinct !DILexicalBlock(scope: !885, file: !3, line: 1219, column: 9)
!912 = !DILocation(line: 1219, column: 14, scope: !911)
!913 = !DILocation(line: 1219, column: 20, scope: !911)
!914 = !DILocation(line: 1219, column: 19, scope: !911)
!915 = !DILocation(line: 1219, column: 26, scope: !911)
!916 = !DILocation(line: 1219, column: 11, scope: !911)
!917 = !DILocation(line: 1219, column: 9, scope: !885)
!918 = !DILocation(line: 1220, column: 7, scope: !911)
!919 = !DILocation(line: 1221, column: 24, scope: !885)
!920 = !DILocation(line: 1221, column: 7, scope: !885)
!921 = !DILocation(line: 1221, column: 6, scope: !885)
!922 = !DILocation(line: 1222, column: 21, scope: !885)
!923 = !DILocation(line: 1222, column: 11, scope: !885)
!924 = !DILocation(line: 1222, column: 10, scope: !885)
!925 = !DILocation(line: 1223, column: 10, scope: !926)
!926 = distinct !DILexicalBlock(scope: !885, file: !3, line: 1223, column: 9)
!927 = !DILocation(line: 1223, column: 15, scope: !926)
!928 = !DILocation(line: 1223, column: 21, scope: !926)
!929 = !DILocation(line: 1223, column: 20, scope: !926)
!930 = !DILocation(line: 1223, column: 28, scope: !926)
!931 = !DILocation(line: 1223, column: 27, scope: !926)
!932 = !DILocation(line: 1223, column: 12, scope: !926)
!933 = !DILocation(line: 1223, column: 36, scope: !926)
!934 = !DILocation(line: 1223, column: 40, scope: !926)
!935 = !DILocation(line: 1223, column: 57, scope: !926)
!936 = !DILocation(line: 1223, column: 46, scope: !926)
!937 = !DILocation(line: 1223, column: 9, scope: !885)
!938 = !DILocation(line: 1224, column: 7, scope: !926)
!939 = !DILocation(line: 1225, column: 10, scope: !940)
!940 = distinct !DILexicalBlock(scope: !885, file: !3, line: 1225, column: 9)
!941 = !DILocation(line: 1225, column: 16, scope: !940)
!942 = !DILocation(line: 1225, column: 24, scope: !940)
!943 = !DILocation(line: 1225, column: 9, scope: !885)
!944 = !DILocation(line: 1226, column: 12, scope: !940)
!945 = !DILocation(line: 1226, column: 7, scope: !940)
!946 = !DILocation(line: 1227, column: 9, scope: !947)
!947 = distinct !DILexicalBlock(scope: !885, file: !3, line: 1227, column: 9)
!948 = !DILocation(line: 1227, column: 15, scope: !947)
!949 = !DILocation(line: 1227, column: 12, scope: !947)
!950 = !DILocation(line: 1227, column: 9, scope: !885)
!951 = !DILocalVariable(name: "offset", scope: !952, file: !3, line: 1230, type: !92)
!952 = distinct !DILexicalBlock(scope: !947, file: !3, line: 1228, column: 7)
!953 = !DILocation(line: 1230, column: 11, scope: !952)
!954 = !DILocalVariable(name: "rest", scope: !952, file: !3, line: 1231, type: !92)
!955 = !DILocation(line: 1231, column: 11, scope: !952)
!956 = !DILocalVariable(name: "new_count", scope: !952, file: !3, line: 1234, type: !170)
!957 = !DILocation(line: 1234, column: 11, scope: !952)
!958 = !DILocalVariable(name: "new_profile", scope: !952, file: !3, line: 1237, type: !593)
!959 = !DILocation(line: 1237, column: 12, scope: !952)
!960 = !DILocation(line: 1239, column: 18, scope: !952)
!961 = !DILocation(line: 1240, column: 15, scope: !952)
!962 = !DILocation(line: 1240, column: 21, scope: !952)
!963 = !DILocation(line: 1240, column: 20, scope: !952)
!964 = !DILocation(line: 1240, column: 30, scope: !952)
!965 = !DILocation(line: 1240, column: 32, scope: !952)
!966 = !DILocation(line: 1240, column: 31, scope: !952)
!967 = !DILocation(line: 1240, column: 28, scope: !952)
!968 = !DILocation(line: 1240, column: 13, scope: !952)
!969 = !DILocation(line: 1241, column: 13, scope: !970)
!970 = distinct !DILexicalBlock(scope: !952, file: !3, line: 1241, column: 13)
!971 = !DILocation(line: 1241, column: 21, scope: !970)
!972 = !DILocation(line: 1241, column: 13, scope: !952)
!973 = !DILocation(line: 1243, column: 21, scope: !974)
!974 = distinct !DILexicalBlock(scope: !970, file: !3, line: 1242, column: 11)
!975 = !DILocation(line: 1243, column: 23, scope: !974)
!976 = !DILocation(line: 1243, column: 22, scope: !974)
!977 = !DILocation(line: 1243, column: 19, scope: !974)
!978 = !DILocation(line: 1244, column: 43, scope: !974)
!979 = !DILocation(line: 1244, column: 50, scope: !974)
!980 = !DILocation(line: 1244, column: 49, scope: !974)
!981 = !DILocation(line: 1244, column: 25, scope: !974)
!982 = !DILocation(line: 1244, column: 24, scope: !974)
!983 = !DILocation(line: 1245, column: 37, scope: !974)
!984 = !DILocation(line: 1245, column: 50, scope: !974)
!985 = !DILocation(line: 1245, column: 56, scope: !974)
!986 = !DILocation(line: 1245, column: 62, scope: !974)
!987 = !DILocation(line: 1245, column: 20, scope: !974)
!988 = !DILocation(line: 1246, column: 11, scope: !974)
!989 = !DILocation(line: 1249, column: 21, scope: !990)
!990 = distinct !DILexicalBlock(scope: !970, file: !3, line: 1248, column: 11)
!991 = !DILocation(line: 1249, column: 23, scope: !990)
!992 = !DILocation(line: 1249, column: 22, scope: !990)
!993 = !DILocation(line: 1249, column: 19, scope: !990)
!994 = !DILocation(line: 1250, column: 23, scope: !990)
!995 = !DILocation(line: 1250, column: 32, scope: !990)
!996 = !DILocation(line: 1250, column: 22, scope: !990)
!997 = !DILocation(line: 1251, column: 18, scope: !998)
!998 = distinct !DILexicalBlock(scope: !990, file: !3, line: 1251, column: 17)
!999 = !DILocation(line: 1251, column: 28, scope: !998)
!1000 = !DILocation(line: 1251, column: 36, scope: !998)
!1001 = !DILocation(line: 1251, column: 17, scope: !990)
!1002 = !DILocation(line: 1252, column: 24, scope: !998)
!1003 = !DILocation(line: 1252, column: 15, scope: !998)
!1004 = !DILocation(line: 1253, column: 43, scope: !990)
!1005 = !DILocation(line: 1253, column: 50, scope: !990)
!1006 = !DILocation(line: 1253, column: 49, scope: !990)
!1007 = !DILocation(line: 1253, column: 60, scope: !990)
!1008 = !DILocation(line: 1253, column: 59, scope: !990)
!1009 = !DILocation(line: 1253, column: 25, scope: !990)
!1010 = !DILocation(line: 1253, column: 24, scope: !990)
!1011 = !DILocation(line: 1254, column: 37, scope: !990)
!1012 = !DILocation(line: 1254, column: 50, scope: !990)
!1013 = !DILocation(line: 1254, column: 56, scope: !990)
!1014 = !DILocation(line: 1254, column: 62, scope: !990)
!1015 = !DILocation(line: 1254, column: 68, scope: !990)
!1016 = !DILocation(line: 1254, column: 20, scope: !990)
!1017 = !DILocation(line: 1255, column: 31, scope: !990)
!1018 = !DILocation(line: 1255, column: 44, scope: !990)
!1019 = !DILocation(line: 1255, column: 50, scope: !990)
!1020 = !DILocation(line: 1255, column: 49, scope: !990)
!1021 = !DILocation(line: 1255, column: 56, scope: !990)
!1022 = !DILocation(line: 1255, column: 59, scope: !990)
!1023 = !DILocation(line: 1255, column: 68, scope: !990)
!1024 = !DILocation(line: 1255, column: 13, scope: !990)
!1025 = !DILocation(line: 1256, column: 37, scope: !990)
!1026 = !DILocation(line: 1256, column: 50, scope: !990)
!1027 = !DILocation(line: 1256, column: 56, scope: !990)
!1028 = !DILocation(line: 1256, column: 55, scope: !990)
!1029 = !DILocation(line: 1256, column: 63, scope: !990)
!1030 = !DILocation(line: 1256, column: 72, scope: !990)
!1031 = !DILocation(line: 1257, column: 15, scope: !990)
!1032 = !DILocation(line: 1257, column: 24, scope: !990)
!1033 = !DILocation(line: 1256, column: 20, scope: !990)
!1034 = !DILocation(line: 1259, column: 33, scope: !952)
!1035 = !DILocation(line: 1259, column: 46, scope: !952)
!1036 = !DILocation(line: 1259, column: 52, scope: !952)
!1037 = !DILocation(line: 1259, column: 51, scope: !952)
!1038 = !DILocation(line: 1259, column: 59, scope: !952)
!1039 = !DILocation(line: 1259, column: 58, scope: !952)
!1040 = !DILocation(line: 1259, column: 69, scope: !952)
!1041 = !DILocation(line: 1259, column: 71, scope: !952)
!1042 = !DILocation(line: 1259, column: 70, scope: !952)
!1043 = !DILocation(line: 1260, column: 11, scope: !952)
!1044 = !DILocation(line: 1259, column: 16, scope: !952)
!1045 = !DILocation(line: 1261, column: 54, scope: !952)
!1046 = !DILocation(line: 1261, column: 61, scope: !952)
!1047 = !DILocation(line: 1261, column: 36, scope: !952)
!1048 = !DILocation(line: 1262, column: 11, scope: !952)
!1049 = !DILocation(line: 1262, column: 50, scope: !952)
!1050 = !DILocation(line: 1262, column: 34, scope: !952)
!1051 = !DILocation(line: 1261, column: 16, scope: !952)
!1052 = !DILocation(line: 1263, column: 39, scope: !952)
!1053 = !DILocation(line: 1263, column: 21, scope: !952)
!1054 = !DILocation(line: 1263, column: 20, scope: !952)
!1055 = !DILocation(line: 1264, column: 9, scope: !952)
!1056 = !DILocation(line: 1267, column: 10, scope: !947)
!1057 = !DILocation(line: 1267, column: 8, scope: !947)
!1058 = !DILocation(line: 1208, column: 3, scope: !877)
!1059 = distinct !{!1059, !883, !1060}
!1060 = !DILocation(line: 1268, column: 3, scope: !873)
!1061 = !DILocation(line: 1269, column: 1, scope: !802)
!1062 = distinct !DISubprogram(name: "GetImageProfile", scope: !3, file: !3, line: 264, type: !1063, scopeLine: 266, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !602, retainedNodes: !646)
!1063 = !DISubroutineType(types: !1064)
!1064 = !{!637, !657, !390}
!1065 = !DILocalVariable(name: "image", arg: 1, scope: !1062, file: !3, line: 264, type: !657)
!1066 = !DILocation(line: 264, column: 61, scope: !1062)
!1067 = !DILocalVariable(name: "name", arg: 2, scope: !1062, file: !3, line: 265, type: !390)
!1068 = !DILocation(line: 265, column: 15, scope: !1062)
!1069 = !DILocalVariable(name: "key", scope: !1062, file: !3, line: 268, type: !410)
!1070 = !DILocation(line: 268, column: 5, scope: !1062)
!1071 = !DILocalVariable(name: "profile", scope: !1062, file: !3, line: 271, type: !637)
!1072 = !DILocation(line: 271, column: 6, scope: !1062)
!1073 = !DILocation(line: 275, column: 7, scope: !1074)
!1074 = distinct !DILexicalBlock(scope: !1062, file: !3, line: 275, column: 7)
!1075 = !DILocation(line: 275, column: 14, scope: !1074)
!1076 = !DILocation(line: 275, column: 20, scope: !1074)
!1077 = !DILocation(line: 275, column: 7, scope: !1062)
!1078 = !DILocation(line: 276, column: 61, scope: !1074)
!1079 = !DILocation(line: 276, column: 68, scope: !1074)
!1080 = !DILocation(line: 276, column: 12, scope: !1074)
!1081 = !DILocation(line: 276, column: 5, scope: !1074)
!1082 = !DILocation(line: 277, column: 7, scope: !1083)
!1083 = distinct !DILexicalBlock(scope: !1062, file: !3, line: 277, column: 7)
!1084 = !DILocation(line: 277, column: 14, scope: !1083)
!1085 = !DILocation(line: 277, column: 23, scope: !1083)
!1086 = !DILocation(line: 277, column: 7, scope: !1062)
!1087 = !DILocation(line: 278, column: 5, scope: !1083)
!1088 = !DILocation(line: 279, column: 27, scope: !1062)
!1089 = !DILocation(line: 279, column: 31, scope: !1062)
!1090 = !DILocation(line: 279, column: 10, scope: !1062)
!1091 = !DILocation(line: 281, column: 5, scope: !1062)
!1092 = !DILocation(line: 281, column: 12, scope: !1062)
!1093 = !DILocation(line: 280, column: 54, scope: !1062)
!1094 = !DILocation(line: 281, column: 21, scope: !1062)
!1095 = !DILocation(line: 280, column: 32, scope: !1062)
!1096 = !DILocation(line: 280, column: 11, scope: !1062)
!1097 = !DILocation(line: 280, column: 10, scope: !1062)
!1098 = !DILocation(line: 282, column: 10, scope: !1062)
!1099 = !DILocation(line: 282, column: 3, scope: !1062)
!1100 = !DILocation(line: 283, column: 1, scope: !1062)
!1101 = distinct !DISubprogram(name: "GetNextImageProfile", scope: !3, file: !3, line: 307, type: !1102, scopeLine: 308, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !602, retainedNodes: !646)
!1102 = !DISubroutineType(types: !1103)
!1103 = !{!165, !657}
!1104 = !DILocalVariable(name: "image", arg: 1, scope: !1101, file: !3, line: 307, type: !657)
!1105 = !DILocation(line: 307, column: 53, scope: !1101)
!1106 = !DILocation(line: 311, column: 7, scope: !1107)
!1107 = distinct !DILexicalBlock(scope: !1101, file: !3, line: 311, column: 7)
!1108 = !DILocation(line: 311, column: 14, scope: !1107)
!1109 = !DILocation(line: 311, column: 20, scope: !1107)
!1110 = !DILocation(line: 311, column: 7, scope: !1101)
!1111 = !DILocation(line: 312, column: 61, scope: !1107)
!1112 = !DILocation(line: 312, column: 68, scope: !1107)
!1113 = !DILocation(line: 312, column: 12, scope: !1107)
!1114 = !DILocation(line: 312, column: 5, scope: !1107)
!1115 = !DILocation(line: 313, column: 7, scope: !1116)
!1116 = distinct !DILexicalBlock(scope: !1101, file: !3, line: 313, column: 7)
!1117 = !DILocation(line: 313, column: 14, scope: !1116)
!1118 = !DILocation(line: 313, column: 23, scope: !1116)
!1119 = !DILocation(line: 313, column: 7, scope: !1101)
!1120 = !DILocation(line: 314, column: 5, scope: !1116)
!1121 = !DILocation(line: 315, column: 59, scope: !1101)
!1122 = !DILocation(line: 315, column: 66, scope: !1101)
!1123 = !DILocation(line: 315, column: 41, scope: !1101)
!1124 = !DILocation(line: 315, column: 19, scope: !1101)
!1125 = !DILocation(line: 315, column: 3, scope: !1101)
!1126 = !DILocation(line: 316, column: 1, scope: !1101)
!1127 = distinct !DISubprogram(name: "ProfileImage", scope: !3, file: !3, line: 472, type: !1128, scopeLine: 475, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !602, retainedNodes: !646)
!1128 = !DISubroutineType(types: !1129)
!1129 = !{!6, !13, !390, !639, !1130, !1131}
!1130 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !92)
!1131 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !6)
!1132 = !DILocalVariable(name: "image", arg: 1, scope: !1127, file: !3, line: 472, type: !13)
!1133 = !DILocation(line: 472, column: 52, scope: !1127)
!1134 = !DILocalVariable(name: "name", arg: 2, scope: !1127, file: !3, line: 472, type: !390)
!1135 = !DILocation(line: 472, column: 70, scope: !1127)
!1136 = !DILocalVariable(name: "datum", arg: 3, scope: !1127, file: !3, line: 473, type: !639)
!1137 = !DILocation(line: 473, column: 15, scope: !1127)
!1138 = !DILocalVariable(name: "length", arg: 4, scope: !1127, file: !3, line: 473, type: !1130)
!1139 = !DILocation(line: 473, column: 34, scope: !1127)
!1140 = !DILocalVariable(name: "clone", arg: 5, scope: !1127, file: !3, line: 474, type: !1131)
!1141 = !DILocation(line: 474, column: 27, scope: !1127)
!1142 = !DILocalVariable(name: "status", scope: !1127, file: !3, line: 487, type: !6)
!1143 = !DILocation(line: 487, column: 5, scope: !1127)
!1144 = !DILocalVariable(name: "profile", scope: !1127, file: !3, line: 490, type: !593)
!1145 = !DILocation(line: 490, column: 6, scope: !1127)
!1146 = !DILocation(line: 496, column: 7, scope: !1147)
!1147 = distinct !DILexicalBlock(scope: !1127, file: !3, line: 496, column: 7)
!1148 = !DILocation(line: 496, column: 14, scope: !1147)
!1149 = !DILocation(line: 496, column: 20, scope: !1147)
!1150 = !DILocation(line: 496, column: 7, scope: !1127)
!1151 = !DILocation(line: 497, column: 61, scope: !1147)
!1152 = !DILocation(line: 497, column: 68, scope: !1147)
!1153 = !DILocation(line: 497, column: 12, scope: !1147)
!1154 = !DILocation(line: 497, column: 5, scope: !1147)
!1155 = !DILocation(line: 499, column: 8, scope: !1156)
!1156 = distinct !DILexicalBlock(scope: !1127, file: !3, line: 499, column: 7)
!1157 = !DILocation(line: 499, column: 14, scope: !1156)
!1158 = !DILocation(line: 499, column: 38, scope: !1156)
!1159 = !DILocation(line: 499, column: 42, scope: !1156)
!1160 = !DILocation(line: 499, column: 49, scope: !1156)
!1161 = !DILocation(line: 499, column: 7, scope: !1127)
!1162 = !DILocalVariable(name: "arguments", scope: !1163, file: !3, line: 502, type: !641)
!1163 = distinct !DILexicalBlock(scope: !1156, file: !3, line: 500, column: 5)
!1164 = !DILocation(line: 502, column: 11, scope: !1163)
!1165 = !DILocalVariable(name: "names", scope: !1163, file: !3, line: 503, type: !165)
!1166 = !DILocation(line: 503, column: 10, scope: !1163)
!1167 = !DILocalVariable(name: "number_arguments", scope: !1163, file: !3, line: 506, type: !497)
!1168 = !DILocation(line: 506, column: 9, scope: !1163)
!1169 = !DILocalVariable(name: "i", scope: !1163, file: !3, line: 509, type: !170)
!1170 = !DILocation(line: 509, column: 9, scope: !1163)
!1171 = !DILocation(line: 514, column: 28, scope: !1163)
!1172 = !DILocation(line: 514, column: 13, scope: !1163)
!1173 = !DILocation(line: 514, column: 12, scope: !1163)
!1174 = !DILocation(line: 515, column: 14, scope: !1163)
!1175 = !DILocation(line: 516, column: 30, scope: !1163)
!1176 = !DILocation(line: 516, column: 17, scope: !1163)
!1177 = !DILocation(line: 516, column: 16, scope: !1163)
!1178 = !DILocation(line: 517, column: 27, scope: !1163)
!1179 = !DILocation(line: 517, column: 13, scope: !1163)
!1180 = !DILocation(line: 517, column: 12, scope: !1163)
!1181 = !DILocation(line: 518, column: 11, scope: !1182)
!1182 = distinct !DILexicalBlock(scope: !1163, file: !3, line: 518, column: 11)
!1183 = !DILocation(line: 518, column: 21, scope: !1182)
!1184 = !DILocation(line: 518, column: 11, scope: !1163)
!1185 = !DILocation(line: 519, column: 9, scope: !1182)
!1186 = !DILocation(line: 520, column: 33, scope: !1163)
!1187 = !DILocation(line: 520, column: 7, scope: !1163)
!1188 = !DILocation(line: 521, column: 37, scope: !1189)
!1189 = distinct !DILexicalBlock(scope: !1163, file: !3, line: 521, column: 7)
!1190 = !DILocation(line: 521, column: 17, scope: !1189)
!1191 = !DILocation(line: 521, column: 16, scope: !1189)
!1192 = !DILocation(line: 521, column: 12, scope: !1189)
!1193 = !DILocation(line: 521, column: 45, scope: !1194)
!1194 = distinct !DILexicalBlock(scope: !1189, file: !3, line: 521, column: 7)
!1195 = !DILocation(line: 521, column: 50, scope: !1194)
!1196 = !DILocation(line: 521, column: 7, scope: !1189)
!1197 = !DILocation(line: 523, column: 15, scope: !1198)
!1198 = distinct !DILexicalBlock(scope: !1199, file: !3, line: 523, column: 9)
!1199 = distinct !DILexicalBlock(scope: !1194, file: !3, line: 522, column: 7)
!1200 = !DILocation(line: 523, column: 14, scope: !1198)
!1201 = !DILocation(line: 523, column: 19, scope: !1202)
!1202 = distinct !DILexicalBlock(scope: !1198, file: !3, line: 523, column: 9)
!1203 = !DILocation(line: 523, column: 33, scope: !1202)
!1204 = !DILocation(line: 523, column: 23, scope: !1202)
!1205 = !DILocation(line: 523, column: 21, scope: !1202)
!1206 = !DILocation(line: 523, column: 9, scope: !1198)
!1207 = !DILocation(line: 525, column: 17, scope: !1208)
!1208 = distinct !DILexicalBlock(scope: !1209, file: !3, line: 525, column: 15)
!1209 = distinct !DILexicalBlock(scope: !1202, file: !3, line: 524, column: 9)
!1210 = !DILocation(line: 525, column: 27, scope: !1208)
!1211 = !DILocation(line: 525, column: 16, scope: !1208)
!1212 = !DILocation(line: 525, column: 30, scope: !1208)
!1213 = !DILocation(line: 525, column: 38, scope: !1208)
!1214 = !DILocation(line: 526, column: 30, scope: !1208)
!1215 = !DILocation(line: 526, column: 35, scope: !1208)
!1216 = !DILocation(line: 526, column: 45, scope: !1208)
!1217 = !DILocation(line: 526, column: 47, scope: !1208)
!1218 = !DILocation(line: 526, column: 16, scope: !1208)
!1219 = !DILocation(line: 526, column: 51, scope: !1208)
!1220 = !DILocation(line: 525, column: 15, scope: !1209)
!1221 = !DILocation(line: 527, column: 13, scope: !1208)
!1222 = !DILocation(line: 528, column: 30, scope: !1223)
!1223 = distinct !DILexicalBlock(scope: !1209, file: !3, line: 528, column: 15)
!1224 = !DILocation(line: 528, column: 35, scope: !1223)
!1225 = !DILocation(line: 528, column: 45, scope: !1223)
!1226 = !DILocation(line: 528, column: 15, scope: !1223)
!1227 = !DILocation(line: 528, column: 60, scope: !1223)
!1228 = !DILocation(line: 528, column: 15, scope: !1209)
!1229 = !DILocation(line: 530, column: 41, scope: !1230)
!1230 = distinct !DILexicalBlock(scope: !1223, file: !3, line: 529, column: 13)
!1231 = !DILocation(line: 530, column: 47, scope: !1230)
!1232 = !DILocation(line: 530, column: 22, scope: !1230)
!1233 = !DILocation(line: 531, column: 41, scope: !1230)
!1234 = !DILocation(line: 531, column: 15, scope: !1230)
!1235 = !DILocation(line: 532, column: 15, scope: !1230)
!1236 = !DILocation(line: 534, column: 9, scope: !1209)
!1237 = !DILocation(line: 523, column: 52, scope: !1202)
!1238 = !DILocation(line: 523, column: 9, scope: !1202)
!1239 = distinct !{!1239, !1206, !1240}
!1240 = !DILocation(line: 534, column: 9, scope: !1198)
!1241 = !DILocation(line: 535, column: 34, scope: !1199)
!1242 = !DILocation(line: 535, column: 14, scope: !1199)
!1243 = !DILocation(line: 535, column: 13, scope: !1199)
!1244 = !DILocation(line: 521, column: 7, scope: !1194)
!1245 = distinct !{!1245, !1196, !1246}
!1246 = !DILocation(line: 536, column: 7, scope: !1189)
!1247 = !DILocation(line: 537, column: 13, scope: !1248)
!1248 = distinct !DILexicalBlock(scope: !1163, file: !3, line: 537, column: 7)
!1249 = !DILocation(line: 537, column: 12, scope: !1248)
