; ModuleID = 'magick/timer.c'
source_filename = "magick/timer.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._TimerInfo = type { %struct._Timer, %struct._Timer, i32, i64 }
%struct._Timer = type { double, double, double }
%struct._ExceptionInfo = type { i32, i32, i8*, i8*, i8*, i32, %struct.SemaphoreInfo*, i64 }
%struct.SemaphoreInfo = type opaque

@.str = private unnamed_addr constant [15 x i8] c"magick/timer.c\00", align 1
@.str.1 = private unnamed_addr constant [1 x i8] zeroinitializer, align 1
@.str.2 = private unnamed_addr constant [22 x i8] c"UnableToAcquireString\00", align 1
@.str.3 = private unnamed_addr constant [5 x i8] c"`%s'\00", align 1

; Function Attrs: noinline nounwind uwtable
define dso_local %struct._TimerInfo* @AcquireTimerInfo() #0 !dbg !114 {
entry:
  %timer_info = alloca %struct._TimerInfo*, align 8
  %message = alloca i8*, align 8
  %exception = alloca %struct._ExceptionInfo, align 8
  call void @llvm.dbg.declare(metadata %struct._TimerInfo** %timer_info, metadata !118, metadata !DIExpression()), !dbg !119
  %call = call i8* @AcquireMagickMemory(i64 64) #6, !dbg !120
  %0 = bitcast i8* %call to %struct._TimerInfo*, !dbg !121
  store %struct._TimerInfo* %0, %struct._TimerInfo** %timer_info, align 8, !dbg !122
  %1 = load %struct._TimerInfo*, %struct._TimerInfo** %timer_info, align 8, !dbg !123
  %cmp = icmp eq %struct._TimerInfo* %1, null, !dbg !125

!20 = !DIEnumerator(name: "CorruptImageWarning", value: 325, isUnsigned: true)
!21 = !DIEnumerator(name: "FileOpenWarning", value: 330, isUnsigned: true)
!22 = !DIEnumerator(name: "BlobWarning", value: 335, isUnsigned: true)
!23 = !DIEnumerator(name: "StreamWarning", value: 340, isUnsigned: true)
!24 = !DIEnumerator(name: "CacheWarning", value: 345, isUnsigned: true)
!25 = !DIEnumerator(name: "CoderWarning", value: 350, isUnsigned: true)
!26 = !DIEnumerator(name: "FilterWarning", value: 352, isUnsigned: true)
!27 = !DIEnumerator(name: "ModuleWarning", value: 355, isUnsigned: true)
!28 = !DIEnumerator(name: "DrawWarning", value: 360, isUnsigned: true)
!29 = !DIEnumerator(name: "ImageWarning", value: 365, isUnsigned: true)
!30 = !DIEnumerator(name: "WandWarning", value: 370, isUnsigned: true)
!31 = !DIEnumerator(name: "RandomWarning", value: 375, isUnsigned: true)
!32 = !DIEnumerator(name: "XServerWarning", value: 380, isUnsigned: true)
!33 = !DIEnumerator(name: "MonitorWarning", value: 385, isUnsigned: true)
!34 = !DIEnumerator(name: "RegistryWarning", value: 390, isUnsigned: true)
!35 = !DIEnumerator(name: "ConfigureWarning", value: 395, isUnsigned: true)
!36 = !DIEnumerator(name: "PolicyWarning", value: 399, isUnsigned: true)
!37 = !DIEnumerator(name: "ErrorException", value: 400, isUnsigned: true)
!38 = !DIEnumerator(name: "ResourceLimitError", value: 400, isUnsigned: true)
!39 = !DIEnumerator(name: "TypeError", value: 405, isUnsigned: true)
!40 = !DIEnumerator(name: "OptionError", value: 410, isUnsigned: true)
!41 = !DIEnumerator(name: "DelegateError", value: 415, isUnsigned: true)
!42 = !DIEnumerator(name: "MissingDelegateError", value: 420, isUnsigned: true)
!43 = !DIEnumerator(name: "CorruptImageError", value: 425, isUnsigned: true)
!44 = !DIEnumerator(name: "FileOpenError", value: 430, isUnsigned: true)
!45 = !DIEnumerator(name: "BlobError", value: 435, isUnsigned: true)
!46 = !DIEnumerator(name: "StreamError", value: 440, isUnsigned: true)
!47 = !DIEnumerator(name: "CacheError", value: 445, isUnsigned: true)
!48 = !DIEnumerator(name: "CoderError", value: 450, isUnsigned: true)
!49 = !DIEnumerator(name: "FilterError", value: 452, isUnsigned: true)
!50 = !DIEnumerator(name: "ModuleError", value: 455, isUnsigned: true)
!51 = !DIEnumerator(name: "DrawError", value: 460, isUnsigned: true)
!52 = !DIEnumerator(name: "ImageError", value: 465, isUnsigned: true)
!53 = !DIEnumerator(name: "WandError", value: 470, isUnsigned: true)
!54 = !DIEnumerator(name: "RandomError", value: 475, isUnsigned: true)
!55 = !DIEnumerator(name: "XServerError", value: 480, isUnsigned: true)
!56 = !DIEnumerator(name: "MonitorError", value: 485, isUnsigned: true)
!57 = !DIEnumerator(name: "RegistryError", value: 490, isUnsigned: true)
!58 = !DIEnumerator(name: "ConfigureError", value: 495, isUnsigned: true)
!59 = !DIEnumerator(name: "PolicyError", value: 499, isUnsigned: true)
!60 = !DIEnumerator(name: "FatalErrorException", value: 700, isUnsigned: true)
!61 = !DIEnumerator(name: "ResourceLimitFatalError", value: 700, isUnsigned: true)
!62 = !DIEnumerator(name: "TypeFatalError", value: 705, isUnsigned: true)
!63 = !DIEnumerator(name: "OptionFatalError", value: 710, isUnsigned: true)
!64 = !DIEnumerator(name: "DelegateFatalError", value: 715, isUnsigned: true)
!65 = !DIEnumerator(name: "MissingDelegateFatalError", value: 720, isUnsigned: true)
!66 = !DIEnumerator(name: "CorruptImageFatalError", value: 725, isUnsigned: true)
!67 = !DIEnumerator(name: "FileOpenFatalError", value: 730, isUnsigned: true)
!68 = !DIEnumerator(name: "BlobFatalError", value: 735, isUnsigned: true)
!69 = !DIEnumerator(name: "StreamFatalError", value: 740, isUnsigned: true)
!70 = !DIEnumerator(name: "CacheFatalError", value: 745, isUnsigned: true)
!71 = !DIEnumerator(name: "CoderFatalError", value: 750, isUnsigned: true)
!72 = !DIEnumerator(name: "FilterFatalError", value: 752, isUnsigned: true)
!73 = !DIEnumerator(name: "ModuleFatalError", value: 755, isUnsigned: true)
!74 = !DIEnumerator(name: "DrawFatalError", value: 760, isUnsigned: true)
!75 = !DIEnumerator(name: "ImageFatalError", value: 765, isUnsigned: true)
!76 = !DIEnumerator(name: "WandFatalError", value: 770, isUnsigned: true)
!77 = !DIEnumerator(name: "RandomFatalError", value: 775, isUnsigned: true)
!78 = !DIEnumerator(name: "XServerFatalError", value: 780, isUnsigned: true)
!79 = !DIEnumerator(name: "MonitorFatalError", value: 785, isUnsigned: true)
!80 = !DIEnumerator(name: "RegistryFatalError", value: 790, isUnsigned: true)
!81 = !DIEnumerator(name: "ConfigureFatalError", value: 795, isUnsigned: true)
!82 = !DIEnumerator(name: "PolicyFatalError", value: 799, isUnsigned: true)
!83 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !84, line: 211, baseType: !5, size: 32, elements: !85)
!84 = !DIFile(filename: "./magick/magick-type.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!85 = !{!86, !87}
!86 = !DIEnumerator(name: "MagickFalse", value: 0, isUnsigned: true)
!87 = !DIEnumerator(name: "MagickTrue", value: 1, isUnsigned: true)
!88 = !{!89, !108, !107, !109}
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerInfo", file: !4, line: 51, baseType: !91)
!91 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TimerInfo", file: !4, line: 40, size: 512, elements: !92)
!92 = !{!93, !101, !102, !104}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !91, file: !4, line: 43, baseType: !94, size: 192)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "Timer", file: !4, line: 38, baseType: !95)
!95 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Timer", file: !4, line: 32, size: 192, elements: !96)
!96 = !{!97, !99, !100}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !95, file: !4, line: 35, baseType: !98, size: 64)
!98 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !95, file: !4, line: 36, baseType: !98, size: 64, offset: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !95, file: !4, line: 37, baseType: !98, size: 64, offset: 128)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "elapsed", scope: !91, file: !4, line: 44, baseType: !94, size: 192, offset: 192)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !91, file: !4, line: 47, baseType: !103, size: 32, offset: 384)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerState", file: !4, line: 30, baseType: !3)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !91, file: !4, line: 50, baseType: !105, size: 64, offset: 448)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !106, line: 46, baseType: !107)
!106 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!107 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!109 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!110 = !{i32 7, !"Dwarf Version", i32 4}
!111 = !{i32 2, !"Debug Info Version", i32 3}
!112 = !{i32 1, !"wchar_size", i32 4}
!113 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!114 = distinct !DISubprogram(name: "AcquireTimerInfo", scope: !1, file: !1, line: 91, type: !115, scopeLine: 92, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !117)
!115 = !DISubroutineType(types: !116)
!116 = !{!89}
!117 = !{}
!118 = !DILocalVariable(name: "timer_info", scope: !114, file: !1, line: 94, type: !89)
!119 = !DILocation(line: 94, column: 6, scope: !114)
!120 = !DILocation(line: 96, column: 28, scope: !114)
!121 = !DILocation(line: 96, column: 14, scope: !114)
!122 = !DILocation(line: 96, column: 13, scope: !114)
!123 = !DILocation(line: 97, column: 7, scope: !124)
!124 = distinct !DILexicalBlock(scope: !114, file: !1, line: 97, column: 7)
!125 = !DILocation(line: 97, column: 18, scope: !124)
!126 = !DILocation(line: 97, column: 7, scope: !114)
!127 = !DILocalVariable(name: "message", scope: !128, file: !1, line: 98, type: !129)
!128 = distinct !DILexicalBlock(scope: !124, file: !1, line: 98, column: 5)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!131 = !DILocation(line: 98, column: 5, scope: !128)
!132 = !DILocalVariable(name: "exception", scope: !128, file: !1, line: 98, type: !133)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionInfo", file: !84, line: 219, baseType: !134)
!134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ExceptionInfo", file: !11, line: 102, size: 448, elements: !135)
!135 = !{!136, !138, !139, !140, !141, !142, !144, !149}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "severity", scope: !134, file: !11, line: 105, baseType: !137, size: 32)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionType", file: !11, line: 100, baseType: !10)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "error_number", scope: !134, file: !11, line: 108, baseType: !109, size: 32, offset: 32)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !134, file: !11, line: 111, baseType: !129, size: 64, offset: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !134, file: !11, line: 112, baseType: !129, size: 64, offset: 128)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "exceptions", scope: !134, file: !11, line: 115, baseType: !108, size: 64, offset: 192)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "relinquish", scope: !134, file: !11, line: 118, baseType: !143, size: 32, offset: 256)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickBooleanType", file: !84, line: 215, baseType: !83)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !134, file: !11, line: 121, baseType: !145, size: 64, offset: 320)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "SemaphoreInfo", file: !147, line: 26, baseType: !148)
!147 = !DIFile(filename: "./magick/semaphore.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!148 = !DICompositeType(tag: DW_TAG_structure_type, name: "SemaphoreInfo", file: !147, line: 25, flags: DIFlagFwdDecl)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !134, file: !11, line: 124, baseType: !105, size: 64, offset: 384)
!150 = !DILocation(line: 99, column: 28, scope: !114)
!151 = !DILocation(line: 99, column: 10, scope: !114)
!152 = !DILocation(line: 100, column: 3, scope: !114)
!153 = !DILocation(line: 100, column: 15, scope: !114)
!154 = !DILocation(line: 100, column: 24, scope: !114)
!155 = !DILocation(line: 101, column: 16, scope: !114)
!156 = !DILocation(line: 101, column: 3, scope: !114)
!157 = !DILocation(line: 102, column: 10, scope: !114)
!158 = !DILocation(line: 102, column: 3, scope: !114)
!159 = distinct !DISubprogram(name: "GetTimerInfo", scope: !1, file: !1, line: 271, type: !160, scopeLine: 272, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !117)
!160 = !DISubroutineType(types: !161)
!161 = !{null, !89}
!162 = !DILocalVariable(name: "time_info", arg: 1, scope: !159, file: !1, line: 271, type: !89)
!163 = !DILocation(line: 271, column: 43, scope: !159)
!164 = !DILocation(line: 277, column: 28, scope: !159)
!165 = !DILocation(line: 277, column: 10, scope: !159)
!166 = !DILocation(line: 278, column: 3, scope: !159)
!167 = !DILocation(line: 278, column: 14, scope: !159)
!168 = !DILocation(line: 278, column: 19, scope: !159)
!169 = !DILocation(line: 279, column: 3, scope: !159)
!170 = !DILocation(line: 279, column: 14, scope: !159)
!171 = !DILocation(line: 279, column: 23, scope: !159)
!172 = !DILocation(line: 280, column: 14, scope: !159)
!173 = !DILocation(line: 280, column: 3, scope: !159)
!174 = !DILocation(line: 281, column: 1, scope: !159)
!175 = distinct !DISubprogram(name: "ContinueTimer", scope: !1, file: !1, line: 128, type: !176, scopeLine: 129, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !117)
!176 = !DISubroutineType(types: !177)
!177 = !{!143, !89}
!178 = !DILocalVariable(name: "time_info", arg: 1, scope: !175, file: !1, line: 128, type: !89)
!179 = !DILocation(line: 128, column: 57, scope: !175)
!180 = !DILocation(line: 132, column: 7, scope: !181)
!181 = distinct !DILexicalBlock(scope: !175, file: !1, line: 132, column: 7)
!182 = !DILocation(line: 132, column: 18, scope: !181)
!183 = !DILocation(line: 132, column: 24, scope: !181)
!184 = !DILocation(line: 132, column: 7, scope: !175)
!185 = !DILocation(line: 133, column: 5, scope: !181)
!186 = !DILocation(line: 134, column: 7, scope: !187)
!187 = distinct !DILexicalBlock(scope: !175, file: !1, line: 134, column: 7)
!188 = !DILocation(line: 134, column: 18, scope: !187)
!189 = !DILocation(line: 134, column: 24, scope: !187)
!190 = !DILocation(line: 134, column: 7, scope: !175)
!191 = !DILocation(line: 136, column: 30, scope: !192)
!192 = distinct !DILexicalBlock(scope: !187, file: !1, line: 135, column: 5)
!193 = !DILocation(line: 136, column: 41, scope: !192)
!194 = !DILocation(line: 136, column: 46, scope: !192)
!195 = !DILocation(line: 136, column: 51, scope: !192)
!196 = !DILocation(line: 136, column: 62, scope: !192)
!197 = !DILocation(line: 136, column: 67, scope: !192)
!198 = !DILocation(line: 136, column: 50, scope: !192)
!199 = !DILocation(line: 136, column: 7, scope: !192)
!200 = !DILocation(line: 136, column: 18, scope: !192)
!201 = !DILocation(line: 136, column: 23, scope: !192)
!202 = !DILocation(line: 136, column: 28, scope: !192)
!203 = !DILocation(line: 137, column: 33, scope: !192)
!204 = !DILocation(line: 137, column: 44, scope: !192)
!205 = !DILocation(line: 137, column: 52, scope: !192)
!206 = !DILocation(line: 138, column: 9, scope: !192)
!207 = !DILocation(line: 138, column: 20, scope: !192)
!208 = !DILocation(line: 138, column: 28, scope: !192)
!209 = !DILocation(line: 137, column: 56, scope: !192)
!210 = !DILocation(line: 137, column: 7, scope: !192)
!211 = !DILocation(line: 137, column: 18, scope: !192)
!212 = !DILocation(line: 137, column: 26, scope: !192)
!213 = !DILocation(line: 137, column: 31, scope: !192)
!214 = !DILocation(line: 139, column: 5, scope: !192)
