; ModuleID = 'magick/compare.c'
source_filename = "magick/compare.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._Image = type { i32, i32, i32, i64, i32, i32, i32, i64, i64, i64, i64, %struct._PixelPacket*, %struct._PixelPacket, %struct._PixelPacket, %struct._PixelPacket, double, %struct._ChromaticityInfo, i32, i8*, i32, i8*, i8*, i8*, i64, double, double, %struct._RectangleInfo, %struct._RectangleInfo, %struct._RectangleInfo, double, double, double, i32, i32, i32, i32, i32, i32, %struct._Image*, i64, i64, i64, i64, i64, i64, %struct._ErrorInfo, %struct._TimerInfo, i32 (i8*, i64, i64, i8*)*, i8*, i8*, i8*, %struct._Ascii85Info*, %struct._BlobInfo*, [4096 x i8], [4096 x i8], [4096 x i8], i64, i64, %struct._ExceptionInfo, i32, i64, %struct.SemaphoreInfo*, %struct._ProfileInfo, %struct._ProfileInfo, %struct._ProfileInfo*, i64, i64, %struct._Image*, %struct._Image*, %struct._Image*, i32, i32, %struct._PixelPacket, %struct._Image*, %struct._RectangleInfo, i8*, i8*, i32, i32, i64, i32, i64, i64, i32, i64 }
%struct._ChromaticityInfo = type { %struct._PrimaryInfo, %struct._PrimaryInfo, %struct._PrimaryInfo, %struct._PrimaryInfo }
%struct._PrimaryInfo = type { double, double, double }
%struct._ErrorInfo = type { double, double, double }
%struct._TimerInfo = type { %struct._Timer, %struct._Timer, i32, i64 }
%struct._Timer = type { double, double, double }

!384 = !{!385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404}
!385 = !DIEnumerator(name: "UndefinedChannel", value: 0, isUnsigned: true)
!386 = !DIEnumerator(name: "RedChannel", value: 1, isUnsigned: true)
!387 = !DIEnumerator(name: "GrayChannel", value: 1, isUnsigned: true)
!388 = !DIEnumerator(name: "CyanChannel", value: 1, isUnsigned: true)
!389 = !DIEnumerator(name: "GreenChannel", value: 2, isUnsigned: true)
!390 = !DIEnumerator(name: "MagentaChannel", value: 2, isUnsigned: true)
!391 = !DIEnumerator(name: "BlueChannel", value: 4, isUnsigned: true)
!392 = !DIEnumerator(name: "YellowChannel", value: 4, isUnsigned: true)
!393 = !DIEnumerator(name: "AlphaChannel", value: 8, isUnsigned: true)
!394 = !DIEnumerator(name: "OpacityChannel", value: 8, isUnsigned: true)
!395 = !DIEnumerator(name: "MatteChannel", value: 8, isUnsigned: true)
!396 = !DIEnumerator(name: "BlackChannel", value: 32, isUnsigned: true)
!397 = !DIEnumerator(name: "IndexChannel", value: 32, isUnsigned: true)
!398 = !DIEnumerator(name: "CompositeChannels", value: 47, isUnsigned: true)
!399 = !DIEnumerator(name: "AllChannels", value: 134217727, isUnsigned: true)
!400 = !DIEnumerator(name: "TrueAlphaChannel", value: 64, isUnsigned: true)
!401 = !DIEnumerator(name: "RGBChannels", value: 128, isUnsigned: true)
!402 = !DIEnumerator(name: "GrayChannels", value: 128, isUnsigned: true)
!403 = !DIEnumerator(name: "SyncChannels", value: 256, isUnsigned: true)
!404 = !DIEnumerator(name: "DefaultChannels", value: 134217719, isUnsigned: true)
!405 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !406, line: 34, baseType: !5, size: 32, elements: !407)
!406 = !DIFile(filename: "./magick/log.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!407 = !{!408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429}
!408 = !DIEnumerator(name: "UndefinedEvents", value: 0, isUnsigned: true)
!409 = !DIEnumerator(name: "NoEvents", value: 0, isUnsigned: true)
!410 = !DIEnumerator(name: "TraceEvent", value: 1, isUnsigned: true)
!411 = !DIEnumerator(name: "AnnotateEvent", value: 2, isUnsigned: true)
!412 = !DIEnumerator(name: "BlobEvent", value: 4, isUnsigned: true)
!413 = !DIEnumerator(name: "CacheEvent", value: 8, isUnsigned: true)
!414 = !DIEnumerator(name: "CoderEvent", value: 16, isUnsigned: true)
!415 = !DIEnumerator(name: "ConfigureEvent", value: 32, isUnsigned: true)
!416 = !DIEnumerator(name: "DeprecateEvent", value: 64, isUnsigned: true)
!417 = !DIEnumerator(name: "DrawEvent", value: 128, isUnsigned: true)
!418 = !DIEnumerator(name: "ExceptionEvent", value: 256, isUnsigned: true)
!419 = !DIEnumerator(name: "ImageEvent", value: 512, isUnsigned: true)
!420 = !DIEnumerator(name: "LocaleEvent", value: 1024, isUnsigned: true)
!421 = !DIEnumerator(name: "ModuleEvent", value: 2048, isUnsigned: true)
!422 = !DIEnumerator(name: "PolicyEvent", value: 4096, isUnsigned: true)
!423 = !DIEnumerator(name: "ResourceEvent", value: 8192, isUnsigned: true)
!424 = !DIEnumerator(name: "TransformEvent", value: 16384, isUnsigned: true)
!425 = !DIEnumerator(name: "UserEvent", value: 36864, isUnsigned: true)
!426 = !DIEnumerator(name: "WandEvent", value: 65536, isUnsigned: true)
!427 = !DIEnumerator(name: "X11Event", value: 131072, isUnsigned: true)
!428 = !DIEnumerator(name: "AccelerateEvent", value: 262144, isUnsigned: true)
!429 = !DIEnumerator(name: "AllEvents", value: 2147483647, isUnsigned: true)
!430 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !73, line: 30, baseType: !5, size: 32, elements: !431)
!431 = !{!432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444}
!432 = !DIEnumerator(name: "UndefinedAlphaChannel", value: 0, isUnsigned: true)
!433 = !DIEnumerator(name: "ActivateAlphaChannel", value: 1, isUnsigned: true)
!434 = !DIEnumerator(name: "BackgroundAlphaChannel", value: 2, isUnsigned: true)
!435 = !DIEnumerator(name: "CopyAlphaChannel", value: 3, isUnsigned: true)
!436 = !DIEnumerator(name: "DeactivateAlphaChannel", value: 4, isUnsigned: true)
!437 = !DIEnumerator(name: "ExtractAlphaChannel", value: 5, isUnsigned: true)
!438 = !DIEnumerator(name: "OpaqueAlphaChannel", value: 6, isUnsigned: true)
!439 = !DIEnumerator(name: "ResetAlphaChannel", value: 7, isUnsigned: true)
!440 = !DIEnumerator(name: "SetAlphaChannel", value: 8, isUnsigned: true)
!441 = !DIEnumerator(name: "ShapeAlphaChannel", value: 9, isUnsigned: true)
!442 = !DIEnumerator(name: "TransparentAlphaChannel", value: 10, isUnsigned: true)
!443 = !DIEnumerator(name: "FlattenAlphaChannel", value: 11, isUnsigned: true)
!444 = !DIEnumerator(name: "RemoveAlphaChannel", value: 12, isUnsigned: true)
!445 = !{!446, !447, !502, !580, !511, !668, !470, !670, !673, !614, !484, !475, !674, !575, !675, !677, !672, !678, !695}
!446 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64)
!448 = !DIDerivedType(tag: DW_TAG_typedef, name: "Image", file: !4, line: 221, baseType: !449)
!449 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Image", file: !73, line: 150, size: 105920, elements: !450)
!450 = !{!451, !453, !455, !457, !460, !462, !464, !465, !466, !467, !468, !469, !480, !481, !482, !483, !485, !499, !501, !503, !505, !508, !509, !510, !516, !517, !518, !526, !527, !528, !529, !530, !531, !533, !535, !537, !539, !541, !543, !545, !546, !547, !548, !549, !550, !551, !559, !574, !588, !589, !590, !591, !595, !599, !603, !604, !605, !606, !607, !625, !626, !628, !629, !639, !640, !642, !643, !644, !645, !646, !647, !649, !650, !651, !652, !653, !654, !655, !657, !658, !659, !660, !661, !665, !667}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "storage_class", scope: !449, file: !73, line: 153, baseType: !452, size: 32)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "ClassType", file: !4, line: 209, baseType: !3)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !449, file: !73, line: 156, baseType: !454, size: 32, offset: 32)
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorspaceType", file: !11, line: 61, baseType: !10)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !449, file: !73, line: 159, baseType: !456, size: 32, offset: 64)
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompressionType", file: !48, line: 49, baseType: !47)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !449, file: !73, line: 162, baseType: !458, size: 64, offset: 128)
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !459, line: 46, baseType: !446)
!459 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!460 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !449, file: !73, line: 165, baseType: !461, size: 32, offset: 192)
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "OrientationType", file: !73, line: 86, baseType: !72)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "taint", scope: !449, file: !73, line: 168, baseType: !463, size: 32, offset: 224)
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickBooleanType", file: !4, line: 215, baseType: !84)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "matte", scope: !449, file: !73, line: 169, baseType: !463, size: 32, offset: 256)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !449, file: !73, line: 172, baseType: !458, size: 64, offset: 320)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !449, file: !73, line: 173, baseType: !458, size: 64, offset: 384)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !449, file: !73, line: 174, baseType: !458, size: 64, offset: 448)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !449, file: !73, line: 175, baseType: !458, size: 64, offset: 512)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "colormap", scope: !449, file: !73, line: 178, baseType: !470, size: 64, offset: 576)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelPacket", file: !326, line: 148, baseType: !472)
!472 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PixelPacket", file: !326, line: 131, size: 64, elements: !473)
!473 = !{!474, !477, !478, !479}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !472, file: !326, line: 143, baseType: !475, size: 16)
!475 = !DIDerivedType(tag: DW_TAG_typedef, name: "Quantum", file: !4, line: 93, baseType: !476)
!476 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !472, file: !326, line: 144, baseType: !475, size: 16, offset: 16)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !472, file: !326, line: 145, baseType: !475, size: 16, offset: 32)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !472, file: !326, line: 146, baseType: !475, size: 16, offset: 48)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "background_color", scope: !449, file: !73, line: 179, baseType: !471, size: 64, offset: 640)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !449, file: !73, line: 180, baseType: !471, size: 64, offset: 704)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "matte_color", scope: !449, file: !73, line: 181, baseType: !471, size: 64, offset: 768)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !449, file: !73, line: 184, baseType: !484, size: 64, offset: 832)
!484 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "chromaticity", scope: !449, file: !73, line: 187, baseType: !486, size: 768, offset: 896)
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChromaticityInfo", file: !73, line: 128, baseType: !487)
!487 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ChromaticityInfo", file: !73, line: 121, size: 768, elements: !488)
!488 = !{!489, !496, !497, !498}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "red_primary", scope: !487, file: !73, line: 124, baseType: !490, size: 192)
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "PrimaryInfo", file: !73, line: 101, baseType: !491)
!491 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PrimaryInfo", file: !73, line: 95, size: 192, elements: !492)
!492 = !{!493, !494, !495}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !491, file: !73, line: 98, baseType: !484, size: 64)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !491, file: !73, line: 99, baseType: !484, size: 64, offset: 64)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !491, file: !73, line: 100, baseType: !484, size: 64, offset: 128)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "green_primary", scope: !487, file: !73, line: 125, baseType: !490, size: 192, offset: 192)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "blue_primary", scope: !487, file: !73, line: 126, baseType: !490, size: 192, offset: 384)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "white_point", scope: !487, file: !73, line: 127, baseType: !490, size: 192, offset: 576)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "rendering_intent", scope: !449, file: !73, line: 190, baseType: !500, size: 32, offset: 1664)
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderingIntent", file: !89, line: 49, baseType: !88)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !449, file: !73, line: 193, baseType: !502, size: 64, offset: 1728)
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !449, file: !73, line: 196, baseType: !504, size: 32, offset: 1792)
!504 = !DIDerivedType(tag: DW_TAG_typedef, name: "ResolutionType", file: !73, line: 93, baseType: !96)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "montage", scope: !449, file: !73, line: 199, baseType: !506, size: 64, offset: 1856)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!507 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "directory", scope: !449, file: !73, line: 200, baseType: !506, size: 64, offset: 1920)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "geometry", scope: !449, file: !73, line: 201, baseType: !506, size: 64, offset: 1984)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !449, file: !73, line: 204, baseType: !511, size: 64, offset: 2048)
!511 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !512, line: 77, baseType: !513)
!512 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!513 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !514, line: 193, baseType: !515)
!514 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!515 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "x_resolution", scope: !449, file: !73, line: 207, baseType: !484, size: 64, offset: 2112)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "y_resolution", scope: !449, file: !73, line: 208, baseType: !484, size: 64, offset: 2176)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !449, file: !73, line: 211, baseType: !519, size: 256, offset: 2240)
!519 = !DIDerivedType(tag: DW_TAG_typedef, name: "RectangleInfo", file: !153, line: 130, baseType: !520)
!520 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_RectangleInfo", file: !153, line: 121, size: 256, elements: !521)
!521 = !{!522, !523, !524, !525}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !520, file: !153, line: 124, baseType: !458, size: 64)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !520, file: !153, line: 125, baseType: !458, size: 64, offset: 64)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !520, file: !153, line: 128, baseType: !511, size: 64, offset: 128)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !520, file: !153, line: 129, baseType: !511, size: 64, offset: 192)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "extract_info", scope: !449, file: !73, line: 212, baseType: !519, size: 256, offset: 2496)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "tile_info", scope: !449, file: !73, line: 213, baseType: !519, size: 256, offset: 2752)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "bias", scope: !449, file: !73, line: 216, baseType: !484, size: 64, offset: 3008)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "blur", scope: !449, file: !73, line: 217, baseType: !484, size: 64, offset: 3072)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !449, file: !73, line: 218, baseType: !484, size: 64, offset: 3136)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !449, file: !73, line: 221, baseType: !532, size: 32, offset: 3200)
!532 = !DIDerivedType(tag: DW_TAG_typedef, name: "FilterTypes", file: !102, line: 66, baseType: !101)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "interlace", scope: !449, file: !73, line: 224, baseType: !534, size: 32, offset: 3232)
!534 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterlaceType", file: !73, line: 73, baseType: !136)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !449, file: !73, line: 227, baseType: !536, size: 32, offset: 3264)
!536 = !DIDerivedType(tag: DW_TAG_typedef, name: "EndianType", file: !147, line: 35, baseType: !146)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !449, file: !73, line: 230, baseType: !538, size: 32, offset: 3296)
!538 = !DIDerivedType(tag: DW_TAG_typedef, name: "GravityType", file: !153, line: 91, baseType: !152)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !449, file: !73, line: 233, baseType: !540, size: 32, offset: 3328)
!540 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompositeOperator", file: !168, line: 99, baseType: !167)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "dispose", scope: !449, file: !73, line: 236, baseType: !542, size: 32, offset: 3360)
!542 = !DIDerivedType(tag: DW_TAG_typedef, name: "DisposeType", file: !239, line: 32, baseType: !238)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "clip_mask", scope: !449, file: !73, line: 239, baseType: !544, size: 64, offset: 3392)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !449, file: !73, line: 242, baseType: !458, size: 64, offset: 3456)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !449, file: !73, line: 243, baseType: !458, size: 64, offset: 3520)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_second", scope: !449, file: !73, line: 246, baseType: !511, size: 64, offset: 3584)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "iterations", scope: !449, file: !73, line: 249, baseType: !458, size: 64, offset: 3648)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "total_colors", scope: !449, file: !73, line: 250, baseType: !458, size: 64, offset: 3712)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "start_loop", scope: !449, file: !73, line: 253, baseType: !511, size: 64, offset: 3776)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !449, file: !73, line: 256, baseType: !552, size: 192, offset: 3840)
!552 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErrorInfo", file: !553, line: 68, baseType: !554)
!553 = !DIFile(filename: "./magick/color.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!554 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ErrorInfo", file: !553, line: 62, size: 192, elements: !555)
!555 = !{!556, !557, !558}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "mean_error_per_pixel", scope: !554, file: !553, line: 65, baseType: !484, size: 64)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_mean_error", scope: !554, file: !553, line: 66, baseType: !484, size: 64, offset: 64)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_maximum_error", scope: !554, file: !553, line: 67, baseType: !484, size: 64, offset: 128)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !449, file: !73, line: 259, baseType: !560, size: 512, offset: 4032)
!560 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerInfo", file: !247, line: 51, baseType: !561)
!561 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TimerInfo", file: !247, line: 40, size: 512, elements: !562)
!562 = !{!563, !570, !571, !573}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !561, file: !247, line: 43, baseType: !564, size: 192)
!564 = !DIDerivedType(tag: DW_TAG_typedef, name: "Timer", file: !247, line: 38, baseType: !565)
!565 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Timer", file: !247, line: 32, size: 192, elements: !566)
!566 = !{!567, !568, !569}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !565, file: !247, line: 35, baseType: !484, size: 64)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !565, file: !247, line: 36, baseType: !484, size: 64, offset: 64)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !565, file: !247, line: 37, baseType: !484, size: 64, offset: 128)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "elapsed", scope: !561, file: !247, line: 44, baseType: !564, size: 192, offset: 192)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !561, file: !247, line: 47, baseType: !572, size: 32, offset: 384)
!572 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerState", file: !247, line: 30, baseType: !246)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !561, file: !247, line: 50, baseType: !458, size: 64, offset: 448)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !449, file: !73, line: 262, baseType: !575, size: 64, offset: 4544)
!575 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickProgressMonitor", file: !576, line: 26, baseType: !577)
!576 = !DIFile(filename: "./magick/monitor.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 64)
!578 = !DISubroutineType(types: !579)
!579 = !{!463, !580, !582, !585, !502}
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 64)
!581 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !507)
!582 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !583)
!583 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickOffsetType", file: !4, line: 150, baseType: !584)
!584 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!585 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !586)
!586 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickSizeType", file: !4, line: 151, baseType: !587)
!587 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !449, file: !73, line: 265, baseType: !502, size: 64, offset: 4608)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !449, file: !73, line: 266, baseType: !502, size: 64, offset: 4672)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !449, file: !73, line: 267, baseType: !502, size: 64, offset: 4736)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "ascii85", scope: !449, file: !73, line: 270, baseType: !592, size: 64, offset: 4800)
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 64)
!593 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ascii85Info", file: !48, line: 52, baseType: !594)
!594 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Ascii85Info", file: !48, line: 51, flags: DIFlagFwdDecl)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !449, file: !73, line: 273, baseType: !596, size: 64, offset: 4864)
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 64)
!597 = !DIDerivedType(tag: DW_TAG_typedef, name: "BlobInfo", file: !4, line: 217, baseType: !598)
!598 = !DICompositeType(tag: DW_TAG_structure_type, name: "_BlobInfo", file: !4, line: 217, flags: DIFlagFwdDecl)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !449, file: !73, line: 276, baseType: !600, size: 32768, offset: 4928)
!600 = !DICompositeType(tag: DW_TAG_array_type, baseType: !507, size: 32768, elements: !601)
!601 = !{!602}
!602 = !DISubrange(count: 4096)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "magick_filename", scope: !449, file: !73, line: 277, baseType: !600, size: 32768, offset: 37696)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !449, file: !73, line: 278, baseType: !600, size: 32768, offset: 70464)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "magick_columns", scope: !449, file: !73, line: 281, baseType: !458, size: 64, offset: 103232)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "magick_rows", scope: !449, file: !73, line: 282, baseType: !458, size: 64, offset: 103296)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "exception", scope: !449, file: !73, line: 285, baseType: !608, size: 448, offset: 103360)
!608 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionInfo", file: !4, line: 219, baseType: !609)
!609 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ExceptionInfo", file: !253, line: 102, size: 448, elements: !610)
!610 = !{!611, !613, !615, !616, !617, !618, !619, !624}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "severity", scope: !609, file: !253, line: 105, baseType: !612, size: 32)
!612 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionType", file: !253, line: 100, baseType: !252)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "error_number", scope: !609, file: !253, line: 108, baseType: !614, size: 32, offset: 32)
!614 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !609, file: !253, line: 111, baseType: !506, size: 64, offset: 64)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !609, file: !253, line: 112, baseType: !506, size: 64, offset: 128)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "exceptions", scope: !609, file: !253, line: 115, baseType: !502, size: 64, offset: 192)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "relinquish", scope: !609, file: !253, line: 118, baseType: !463, size: 32, offset: 256)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !609, file: !253, line: 121, baseType: !620, size: 64, offset: 320)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64)
!621 = !DIDerivedType(tag: DW_TAG_typedef, name: "SemaphoreInfo", file: !622, line: 26, baseType: !623)
!622 = !DIFile(filename: "./magick/semaphore.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!623 = !DICompositeType(tag: DW_TAG_structure_type, name: "SemaphoreInfo", file: !622, line: 25, flags: DIFlagFwdDecl)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !609, file: !253, line: 124, baseType: !458, size: 64, offset: 384)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !449, file: !73, line: 288, baseType: !463, size: 32, offset: 103808)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !449, file: !73, line: 291, baseType: !627, size: 64, offset: 103872)
!627 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !511)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !449, file: !73, line: 294, baseType: !620, size: 64, offset: 103936)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "color_profile", scope: !449, file: !73, line: 297, baseType: !630, size: 256, offset: 104000)
!630 = !DIDerivedType(tag: DW_TAG_typedef, name: "ProfileInfo", file: !89, line: 40, baseType: !631)
!631 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ProfileInfo", file: !89, line: 27, size: 256, elements: !632)
!632 = !{!633, !634, !635, !638}
!633 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !631, file: !89, line: 30, baseType: !506, size: 64)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !631, file: !89, line: 33, baseType: !458, size: 64, offset: 64)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !631, file: !89, line: 36, baseType: !636, size: 64, offset: 128)
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 64)
!637 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !631, file: !89, line: 39, baseType: !458, size: 64, offset: 192)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "iptc_profile", scope: !449, file: !73, line: 298, baseType: !630, size: 256, offset: 104256)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profile", scope: !449, file: !73, line: 299, baseType: !641, size: 64, offset: 104512)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 64)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profiles", scope: !449, file: !73, line: 302, baseType: !458, size: 64, offset: 104576)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !449, file: !73, line: 305, baseType: !458, size: 64, offset: 104640)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !449, file: !73, line: 308, baseType: !544, size: 64, offset: 104704)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !449, file: !73, line: 309, baseType: !544, size: 64, offset: 104768)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !449, file: !73, line: 310, baseType: !544, size: 64, offset: 104832)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "interpolate", scope: !449, file: !73, line: 313, baseType: !648, size: 32, offset: 104896)
!648 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterpolatePixelMethod", file: !326, line: 47, baseType: !325)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "black_point_compensation", scope: !449, file: !73, line: 316, baseType: !463, size: 32, offset: 104928)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_color", scope: !449, file: !73, line: 319, baseType: !471, size: 64, offset: 104960)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !449, file: !73, line: 322, baseType: !544, size: 64, offset: 105024)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "tile_offset", scope: !449, file: !73, line: 325, baseType: !519, size: 256, offset: 105088)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !449, file: !73, line: 328, baseType: !502, size: 64, offset: 105344)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "artifacts", scope: !449, file: !73, line: 329, baseType: !502, size: 64, offset: 105408)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !449, file: !73, line: 332, baseType: !656, size: 32, offset: 105472)
!656 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageType", file: !73, line: 61, baseType: !342)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !449, file: !73, line: 335, baseType: !463, size: 32, offset: 105504)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !449, file: !73, line: 338, baseType: !586, size: 64, offset: 105536)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "ping", scope: !449, file: !73, line: 341, baseType: !463, size: 32, offset: 105600)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !449, file: !73, line: 344, baseType: !458, size: 64, offset: 105664)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !449, file: !73, line: 347, baseType: !662, size: 64, offset: 105728)
!662 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !663, line: 7, baseType: !664)
!663 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "")
!664 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !514, line: 160, baseType: !515)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "intensity", scope: !449, file: !73, line: 350, baseType: !666, size: 32, offset: 105792)
!666 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelIntensityMethod", file: !326, line: 79, baseType: !356)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !449, file: !73, line: 353, baseType: !458, size: 64, offset: 105856)
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 64)
!669 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !471)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64)
!671 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !672)
!672 = !DIDerivedType(tag: DW_TAG_typedef, name: "IndexPacket", file: !326, line: 129, baseType: !475)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64)
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64)
!675 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickRealType", file: !4, line: 78, baseType: !676)
!676 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 64)
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 64)
!679 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChannelStatistics", file: !680, line: 44, baseType: !681)
!680 = !DIFile(filename: "./magick/statistic.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!681 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ChannelStatistics", file: !680, line: 27, size: 768, elements: !682)
!682 = !{!683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !681, file: !680, line: 30, baseType: !458, size: 64)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "minima", scope: !681, file: !680, line: 33, baseType: !484, size: 64, offset: 64)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "maxima", scope: !681, file: !680, line: 34, baseType: !484, size: 64, offset: 128)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "sum", scope: !681, file: !680, line: 35, baseType: !484, size: 64, offset: 192)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "sum_squared", scope: !681, file: !680, line: 36, baseType: !484, size: 64, offset: 256)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "sum_cubed", scope: !681, file: !680, line: 37, baseType: !484, size: 64, offset: 320)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "sum_fourth_power", scope: !681, file: !680, line: 38, baseType: !484, size: 64, offset: 384)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "mean", scope: !681, file: !680, line: 39, baseType: !484, size: 64, offset: 448)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "variance", scope: !681, file: !680, line: 40, baseType: !484, size: 64, offset: 512)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "standard_deviation", scope: !681, file: !680, line: 41, baseType: !484, size: 64, offset: 576)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "kurtosis", scope: !681, file: !680, line: 42, baseType: !484, size: 64, offset: 640)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "skewness", scope: !681, file: !680, line: 43, baseType: !484, size: 64, offset: 704)
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 64)
!696 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChannelPerceptualHash", file: !680, line: 66, baseType: !697)
!697 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ChannelPerceptualHash", file: !680, line: 61, size: 4096, elements: !698)
!698 = !{!699, !703}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "P", scope: !697, file: !680, line: 64, baseType: !700, size: 2048)
!700 = !DICompositeType(tag: DW_TAG_array_type, baseType: !484, size: 2048, elements: !701)
!701 = !{!702}
!702 = !DISubrange(count: 32)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "Q", scope: !697, file: !680, line: 65, baseType: !700, size: 2048, offset: 2048)
!704 = !{i32 7, !"Dwarf Version", i32 4}
!705 = !{i32 2, !"Debug Info Version", i32 3}
!706 = !{i32 1, !"wchar_size", i32 4}
!707 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!708 = distinct !DISubprogram(name: "CompareImages", scope: !1, file: !1, line: 111, type: !709, scopeLine: 113, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !716)
!709 = !DISubroutineType(types: !710)
!710 = !{!447, !447, !711, !713, !673, !715}
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 64)
!712 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !448)
!713 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !714)
!714 = !DIDerivedType(tag: DW_TAG_typedef, name: "MetricType", file: !369, line: 41, baseType: !368)
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64)
!716 = !{}
!717 = !DILocalVariable(name: "image", arg: 1, scope: !708, file: !1, line: 111, type: !447)
!718 = !DILocation(line: 111, column: 42, scope: !708)
!719 = !DILocalVariable(name: "reconstruct_image", arg: 2, scope: !708, file: !1, line: 111, type: !711)
!720 = !DILocation(line: 111, column: 61, scope: !708)
!721 = !DILocalVariable(name: "metric", arg: 3, scope: !708, file: !1, line: 112, type: !713)
!722 = !DILocation(line: 112, column: 20, scope: !708)
!723 = !DILocalVariable(name: "distortion", arg: 4, scope: !708, file: !1, line: 112, type: !673)
!724 = !DILocation(line: 112, column: 35, scope: !708)
!725 = !DILocalVariable(name: "exception", arg: 5, scope: !708, file: !1, line: 112, type: !715)
!726 = !DILocation(line: 112, column: 61, scope: !708)
!727 = !DILocalVariable(name: "highlight_image", scope: !708, file: !1, line: 115, type: !447)
!728 = !DILocation(line: 115, column: 6, scope: !708)
!729 = !DILocation(line: 117, column: 40, scope: !708)
!730 = !DILocation(line: 117, column: 46, scope: !708)
!731 = !DILocation(line: 118, column: 23, scope: !708)
!732 = !DILocation(line: 118, column: 30, scope: !708)
!733 = !DILocation(line: 118, column: 41, scope: !708)
!734 = !DILocation(line: 117, column: 19, scope: !708)
!735 = !DILocation(line: 117, column: 18, scope: !708)
!736 = !DILocation(line: 119, column: 10, scope: !708)
!737 = !DILocation(line: 119, column: 3, scope: !708)
!738 = distinct !DISubprogram(name: "CompareImageChannels", scope: !1, file: !1, line: 122, type: !739, scopeLine: 125, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !716)
!739 = !DISubroutineType(types: !740)
!740 = !{!447, !447, !711, !741, !713, !673, !715}
!741 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !742)
!742 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChannelType", file: !4, line: 202, baseType: !383)
!743 = !DILocalVariable(name: "image", arg: 1, scope: !738, file: !1, line: 122, type: !447)
!744 = !DILocation(line: 122, column: 49, scope: !738)
!745 = !DILocalVariable(name: "reconstruct_image", arg: 2, scope: !738, file: !1, line: 123, type: !711)
!746 = !DILocation(line: 123, column: 16, scope: !738)
!747 = !DILocalVariable(name: "channel", arg: 3, scope: !738, file: !1, line: 123, type: !741)
!748 = !DILocation(line: 123, column: 52, scope: !738)
!749 = !DILocalVariable(name: "metric", arg: 4, scope: !738, file: !1, line: 124, type: !713)
!750 = !DILocation(line: 124, column: 20, scope: !738)
!751 = !DILocalVariable(name: "distortion", arg: 5, scope: !738, file: !1, line: 124, type: !673)
!752 = !DILocation(line: 124, column: 35, scope: !738)
!753 = !DILocalVariable(name: "exception", arg: 6, scope: !738, file: !1, line: 124, type: !715)
!754 = !DILocation(line: 124, column: 61, scope: !738)
!755 = !DILocalVariable(name: "highlight_view", scope: !738, file: !1, line: 127, type: !756)
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !757, size: 64)
!757 = !DIDerivedType(tag: DW_TAG_typedef, name: "CacheView", file: !758, line: 50, baseType: !759)
!758 = !DIFile(filename: "./magick/cache-view.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!759 = !DICompositeType(tag: DW_TAG_structure_type, name: "_CacheView", file: !326, line: 160, flags: DIFlagFwdDecl)
!760 = !DILocation(line: 127, column: 6, scope: !738)
!761 = !DILocalVariable(name: "image_view", scope: !738, file: !1, line: 128, type: !756)
!762 = !DILocation(line: 128, column: 6, scope: !738)
!763 = !DILocalVariable(name: "reconstruct_view", scope: !738, file: !1, line: 129, type: !756)
!764 = !DILocation(line: 129, column: 6, scope: !738)
!765 = !DILocalVariable(name: "artifact", scope: !738, file: !1, line: 132, type: !580)
!766 = !DILocation(line: 132, column: 6, scope: !738)
!767 = !DILocalVariable(name: "difference_image", scope: !738, file: !1, line: 135, type: !447)
!768 = !DILocation(line: 135, column: 6, scope: !738)
!769 = !DILocalVariable(name: "highlight_image", scope: !738, file: !1, line: 136, type: !447)
!770 = !DILocation(line: 136, column: 6, scope: !738)
!771 = !DILocalVariable(name: "status", scope: !738, file: !1, line: 139, type: !463)
!772 = !DILocation(line: 139, column: 5, scope: !738)
!773 = !DILocalVariable(name: "highlight", scope: !738, file: !1, line: 142, type: !774)
!774 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickPixelPacket", file: !326, line: 127, baseType: !775)
!775 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MagickPixelPacket", file: !326, line: 104, size: 448, elements: !776)
!776 = !{!777, !778, !779, !780, !781, !782, !783, !784, !785, !786}
!777 = !DIDerivedType(tag: DW_TAG_member, name: "storage_class", scope: !775, file: !326, line: 107, baseType: !452, size: 32)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !775, file: !326, line: 110, baseType: !454, size: 32, offset: 32)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "matte", scope: !775, file: !326, line: 113, baseType: !463, size: 32, offset: 64)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !775, file: !326, line: 116, baseType: !484, size: 64, offset: 128)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !775, file: !326, line: 119, baseType: !458, size: 64, offset: 192)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !775, file: !326, line: 122, baseType: !675, size: 32, offset: 256)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !775, file: !326, line: 123, baseType: !675, size: 32, offset: 288)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !775, file: !326, line: 124, baseType: !675, size: 32, offset: 320)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !775, file: !326, line: 125, baseType: !675, size: 32, offset: 352)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !775, file: !326, line: 126, baseType: !675, size: 32, offset: 384)
!787 = !DILocation(line: 142, column: 5, scope: !738)
!788 = !DILocalVariable(name: "lowlight", scope: !738, file: !1, line: 143, type: !774)
!789 = !DILocation(line: 143, column: 5, scope: !738)
!790 = !DILocalVariable(name: "zero", scope: !738, file: !1, line: 144, type: !774)
!791 = !DILocation(line: 144, column: 5, scope: !738)
!792 = !DILocalVariable(name: "y", scope: !738, file: !1, line: 147, type: !511)
!793 = !DILocation(line: 147, column: 5, scope: !738)
!794 = !DILocation(line: 151, column: 7, scope: !795)
!795 = distinct !DILexicalBlock(scope: !738, file: !1, line: 151, column: 7)
!796 = !DILocation(line: 151, column: 14, scope: !795)
!797 = !DILocation(line: 151, column: 20, scope: !795)
!798 = !DILocation(line: 151, column: 7, scope: !738)
!799 = !DILocation(line: 152, column: 61, scope: !795)
!800 = !DILocation(line: 152, column: 68, scope: !795)
!801 = !DILocation(line: 152, column: 12, scope: !795)
!802 = !DILocation(line: 152, column: 5, scope: !795)
!803 = !DILocation(line: 156, column: 4, scope: !738)
!804 = !DILocation(line: 156, column: 14, scope: !738)
!805 = !DILocation(line: 157, column: 7, scope: !806)
!806 = distinct !DILexicalBlock(scope: !738, file: !1, line: 157, column: 7)
!807 = !DILocation(line: 157, column: 14, scope: !806)
!808 = !DILocation(line: 157, column: 20, scope: !806)
!809 = !DILocation(line: 157, column: 7, scope: !738)
!810 = !DILocation(line: 158, column: 61, scope: !806)
!811 = !DILocation(line: 158, column: 68, scope: !806)
!812 = !DILocation(line: 158, column: 12, scope: !806)
!813 = !DILocation(line: 158, column: 5, scope: !806)
!814 = !DILocation(line: 159, column: 7, scope: !815)
!815 = distinct !DILexicalBlock(scope: !738, file: !1, line: 159, column: 7)
!816 = !DILocation(line: 159, column: 14, scope: !815)
!817 = !DILocation(line: 159, column: 7, scope: !738)
!818 = !DILocation(line: 160, column: 10, scope: !819)
!819 = distinct !DILexicalBlock(scope: !815, file: !1, line: 160, column: 9)
!820 = !DILocation(line: 160, column: 29, scope: !819)
!821 = !DILocation(line: 160, column: 40, scope: !819)
!822 = !DILocation(line: 160, column: 47, scope: !819)
!823 = !DILocation(line: 160, column: 37, scope: !819)
!824 = !DILocation(line: 160, column: 56, scope: !819)
!825 = !DILocation(line: 161, column: 10, scope: !819)
!826 = !DILocation(line: 161, column: 29, scope: !819)
!827 = !DILocation(line: 161, column: 37, scope: !819)
!828 = !DILocation(line: 161, column: 44, scope: !819)
!829 = !DILocation(line: 161, column: 34, scope: !819)
!830 = !DILocation(line: 160, column: 9, scope: !815)
!831 = !DILocation(line: 162, column: 7, scope: !832)
!832 = distinct !DILexicalBlock(scope: !819, file: !1, line: 162, column: 7)
!833 = !DILocation(line: 161, column: 48, scope: !819)
!834 = !DILocation(line: 163, column: 36, scope: !738)
!835 = !DILocation(line: 163, column: 42, scope: !738)
!836 = !DILocation(line: 163, column: 60, scope: !738)
!837 = !DILocation(line: 163, column: 68, scope: !738)
!838 = !DILocation(line: 164, column: 5, scope: !738)
!839 = !DILocation(line: 164, column: 16, scope: !738)
!840 = !DILocation(line: 163, column: 10, scope: !738)
!841 = !DILocation(line: 163, column: 9, scope: !738)
!842 = !DILocation(line: 165, column: 7, scope: !843)
!843 = distinct !DILexicalBlock(scope: !738, file: !1, line: 165, column: 7)
!844 = !DILocation(line: 165, column: 14, scope: !843)
!845 = !DILocation(line: 165, column: 7, scope: !738)
!846 = !DILocation(line: 166, column: 5, scope: !843)
!847 = !DILocation(line: 167, column: 31, scope: !738)
!848 = !DILocation(line: 167, column: 52, scope: !738)
!849 = !DILocation(line: 167, column: 20, scope: !738)
!850 = !DILocation(line: 167, column: 19, scope: !738)
!851 = !DILocation(line: 168, column: 7, scope: !852)
!852 = distinct !DILexicalBlock(scope: !738, file: !1, line: 168, column: 7)
