; ModuleID = 'magick/attribute.c'
source_filename = "magick/attribute.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._RectangleInfo = type { i64, i64, i64, i64 }
%struct._Image = type { i32, i32, i32, i64, i32, i32, i32, i64, i64, i64, i64, %struct._PixelPacket*, %struct._PixelPacket, %struct._PixelPacket, %struct._PixelPacket, double, %struct._ChromaticityInfo, i32, i8*, i32, i8*, i8*, i8*, i64, double, double, %struct._RectangleInfo, %struct._RectangleInfo, %struct._RectangleInfo, double, double, double, i32, i32, i32, i32, i32, i32, %struct._Image*, i64, i64, i64, i64, i64, i64, %struct._ErrorInfo, %struct._TimerInfo, i32 (i8*, i64, i64, i8*)*, i8*, i8*, i8*, %struct._Ascii85Info*, %struct._BlobInfo*, [4096 x i8], [4096 x i8], [4096 x i8], i64, i64, %struct._ExceptionInfo, i32, i64, %struct.SemaphoreInfo*, %struct._ProfileInfo, %struct._ProfileInfo, %struct._ProfileInfo*, i64, i64, %struct._Image*, %struct._Image*, %struct._Image*, i32, i32, %struct._PixelPacket, %struct._Image*, %struct._RectangleInfo, i8*, i8*, i32, i32, i64, i32, i64, i64, i32, i64 }
%struct._ChromaticityInfo = type { %struct._PrimaryInfo, %struct._PrimaryInfo, %struct._PrimaryInfo, %struct._PrimaryInfo }
%struct._PrimaryInfo = type { double, double, double }
%struct._ErrorInfo = type { double, double, double }
%struct._TimerInfo = type { %struct._Timer, %struct._Timer, i32, i64 }

!448 = !DIEnumerator(name: "EdgeDetectPreview", value: 18, isUnsigned: true)
!449 = !DIEnumerator(name: "SpreadPreview", value: 19, isUnsigned: true)
!450 = !DIEnumerator(name: "SolarizePreview", value: 20, isUnsigned: true)
!451 = !DIEnumerator(name: "ShadePreview", value: 21, isUnsigned: true)
!452 = !DIEnumerator(name: "RaisePreview", value: 22, isUnsigned: true)
!453 = !DIEnumerator(name: "SegmentPreview", value: 23, isUnsigned: true)
!454 = !DIEnumerator(name: "SwirlPreview", value: 24, isUnsigned: true)
!455 = !DIEnumerator(name: "ImplodePreview", value: 25, isUnsigned: true)
!456 = !DIEnumerator(name: "WavePreview", value: 26, isUnsigned: true)
!457 = !DIEnumerator(name: "OilPaintPreview", value: 27, isUnsigned: true)
!458 = !DIEnumerator(name: "CharcoalDrawingPreview", value: 28, isUnsigned: true)
!459 = !DIEnumerator(name: "JPEGPreview", value: 29, isUnsigned: true)
!460 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !461, line: 27, baseType: !5, size: 32, elements: !462)
!461 = !DIFile(filename: "./magick/cache-view.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!462 = !{!463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480}
!463 = !DIEnumerator(name: "UndefinedVirtualPixelMethod", value: 0, isUnsigned: true)
!464 = !DIEnumerator(name: "BackgroundVirtualPixelMethod", value: 1, isUnsigned: true)
!465 = !DIEnumerator(name: "ConstantVirtualPixelMethod", value: 2, isUnsigned: true)
!466 = !DIEnumerator(name: "DitherVirtualPixelMethod", value: 3, isUnsigned: true)
!467 = !DIEnumerator(name: "EdgeVirtualPixelMethod", value: 4, isUnsigned: true)
!468 = !DIEnumerator(name: "MirrorVirtualPixelMethod", value: 5, isUnsigned: true)
!469 = !DIEnumerator(name: "RandomVirtualPixelMethod", value: 6, isUnsigned: true)
!470 = !DIEnumerator(name: "TileVirtualPixelMethod", value: 7, isUnsigned: true)
!471 = !DIEnumerator(name: "TransparentVirtualPixelMethod", value: 8, isUnsigned: true)
!472 = !DIEnumerator(name: "MaskVirtualPixelMethod", value: 9, isUnsigned: true)
!473 = !DIEnumerator(name: "BlackVirtualPixelMethod", value: 10, isUnsigned: true)
!474 = !DIEnumerator(name: "GrayVirtualPixelMethod", value: 11, isUnsigned: true)
!475 = !DIEnumerator(name: "WhiteVirtualPixelMethod", value: 12, isUnsigned: true)
!476 = !DIEnumerator(name: "HorizontalTileVirtualPixelMethod", value: 13, isUnsigned: true)
!477 = !DIEnumerator(name: "VerticalTileVirtualPixelMethod", value: 14, isUnsigned: true)
!478 = !DIEnumerator(name: "HorizontalTileEdgeVirtualPixelMethod", value: 15, isUnsigned: true)
!479 = !DIEnumerator(name: "VerticalTileEdgeVirtualPixelMethod", value: 16, isUnsigned: true)
!480 = !DIEnumerator(name: "CheckerTileVirtualPixelMethod", value: 17, isUnsigned: true)
!481 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !482, line: 27, baseType: !5, size: 32, elements: !483)
!482 = !DIFile(filename: "./magick/quantize.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!483 = !{!484, !485, !486, !487}
!484 = !DIEnumerator(name: "UndefinedDitherMethod", value: 0, isUnsigned: true)
!485 = !DIEnumerator(name: "NoDitherMethod", value: 1, isUnsigned: true)
!486 = !DIEnumerator(name: "RiemersmaDitherMethod", value: 2, isUnsigned: true)
!487 = !DIEnumerator(name: "FloydSteinbergDitherMethod", value: 3, isUnsigned: true)
!488 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !73, line: 30, baseType: !5, size: 32, elements: !489)
!489 = !{!490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502}
!490 = !DIEnumerator(name: "UndefinedAlphaChannel", value: 0, isUnsigned: true)
!491 = !DIEnumerator(name: "ActivateAlphaChannel", value: 1, isUnsigned: true)
!492 = !DIEnumerator(name: "BackgroundAlphaChannel", value: 2, isUnsigned: true)
!493 = !DIEnumerator(name: "CopyAlphaChannel", value: 3, isUnsigned: true)
!494 = !DIEnumerator(name: "DeactivateAlphaChannel", value: 4, isUnsigned: true)
!495 = !DIEnumerator(name: "ExtractAlphaChannel", value: 5, isUnsigned: true)
!496 = !DIEnumerator(name: "OpaqueAlphaChannel", value: 6, isUnsigned: true)
!497 = !DIEnumerator(name: "ResetAlphaChannel", value: 7, isUnsigned: true)
!498 = !DIEnumerator(name: "SetAlphaChannel", value: 8, isUnsigned: true)
!499 = !DIEnumerator(name: "ShapeAlphaChannel", value: 9, isUnsigned: true)
!500 = !DIEnumerator(name: "TransparentAlphaChannel", value: 10, isUnsigned: true)
!501 = !DIEnumerator(name: "FlattenAlphaChannel", value: 11, isUnsigned: true)
!502 = !DIEnumerator(name: "RemoveAlphaChannel", value: 12, isUnsigned: true)
!503 = !{!504, !505, !510, !521, !522, !524, !525, !516, !526, !529, !530, !732, !551, !645, !733, !651, !735, !5}
!504 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!505 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !506, line: 77, baseType: !507)
!506 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!507 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !508, line: 193, baseType: !509)
!508 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!509 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 64)
!511 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !512)
!512 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelPacket", file: !326, line: 148, baseType: !513)
!513 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PixelPacket", file: !326, line: 131, size: 64, elements: !514)
!514 = !{!515, !518, !519, !520}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !513, file: !326, line: 143, baseType: !516, size: 16)
!516 = !DIDerivedType(tag: DW_TAG_typedef, name: "Quantum", file: !4, line: 93, baseType: !517)
!517 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !513, file: !326, line: 144, baseType: !516, size: 16, offset: 16)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !513, file: !326, line: 145, baseType: !516, size: 16, offset: 32)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !513, file: !326, line: 146, baseType: !516, size: 16, offset: 48)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!522 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !523, line: 46, baseType: !504)
!523 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64)
!525 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64)
!527 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !528)
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "IndexPacket", file: !326, line: 129, baseType: !516)
!529 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64)
!531 = !DIDerivedType(tag: DW_TAG_typedef, name: "Image", file: !4, line: 221, baseType: !532)
!532 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Image", file: !73, line: 150, size: 105920, elements: !533)
!533 = !{!534, !536, !538, !540, !541, !543, !545, !546, !547, !548, !549, !550, !552, !553, !554, !555, !556, !570, !572, !573, !575, !578, !579, !580, !581, !582, !583, !591, !592, !593, !594, !595, !596, !598, !600, !602, !604, !606, !608, !610, !611, !612, !613, !614, !615, !616, !624, !639, !653, !654, !655, !656, !660, !664, !668, !669, !670, !671, !672, !689, !690, !692, !693, !703, !704, !706, !707, !708, !709, !710, !711, !713, !714, !715, !716, !717, !718, !719, !721, !722, !723, !724, !725, !729, !731}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "storage_class", scope: !532, file: !73, line: 153, baseType: !535, size: 32)
!535 = !DIDerivedType(tag: DW_TAG_typedef, name: "ClassType", file: !4, line: 209, baseType: !3)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !532, file: !73, line: 156, baseType: !537, size: 32, offset: 32)
!537 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorspaceType", file: !11, line: 61, baseType: !10)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !532, file: !73, line: 159, baseType: !539, size: 32, offset: 64)
!539 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompressionType", file: !48, line: 49, baseType: !47)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !532, file: !73, line: 162, baseType: !522, size: 64, offset: 128)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !532, file: !73, line: 165, baseType: !542, size: 32, offset: 192)
!542 = !DIDerivedType(tag: DW_TAG_typedef, name: "OrientationType", file: !73, line: 86, baseType: !72)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "taint", scope: !532, file: !73, line: 168, baseType: !544, size: 32, offset: 224)
!544 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickBooleanType", file: !4, line: 215, baseType: !84)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "matte", scope: !532, file: !73, line: 169, baseType: !544, size: 32, offset: 256)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !532, file: !73, line: 172, baseType: !522, size: 64, offset: 320)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !532, file: !73, line: 173, baseType: !522, size: 64, offset: 384)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !532, file: !73, line: 174, baseType: !522, size: 64, offset: 448)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !532, file: !73, line: 175, baseType: !522, size: 64, offset: 512)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "colormap", scope: !532, file: !73, line: 178, baseType: !551, size: 64, offset: 576)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 64)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "background_color", scope: !532, file: !73, line: 179, baseType: !512, size: 64, offset: 640)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !532, file: !73, line: 180, baseType: !512, size: 64, offset: 704)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "matte_color", scope: !532, file: !73, line: 181, baseType: !512, size: 64, offset: 768)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !532, file: !73, line: 184, baseType: !529, size: 64, offset: 832)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "chromaticity", scope: !532, file: !73, line: 187, baseType: !557, size: 768, offset: 896)
!557 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChromaticityInfo", file: !73, line: 128, baseType: !558)
!558 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ChromaticityInfo", file: !73, line: 121, size: 768, elements: !559)
!559 = !{!560, !567, !568, !569}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "red_primary", scope: !558, file: !73, line: 124, baseType: !561, size: 192)
!561 = !DIDerivedType(tag: DW_TAG_typedef, name: "PrimaryInfo", file: !73, line: 101, baseType: !562)
!562 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PrimaryInfo", file: !73, line: 95, size: 192, elements: !563)
!563 = !{!564, !565, !566}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !562, file: !73, line: 98, baseType: !529, size: 64)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !562, file: !73, line: 99, baseType: !529, size: 64, offset: 64)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !562, file: !73, line: 100, baseType: !529, size: 64, offset: 128)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "green_primary", scope: !558, file: !73, line: 125, baseType: !561, size: 192, offset: 192)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "blue_primary", scope: !558, file: !73, line: 126, baseType: !561, size: 192, offset: 384)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "white_point", scope: !558, file: !73, line: 127, baseType: !561, size: 192, offset: 576)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "rendering_intent", scope: !532, file: !73, line: 190, baseType: !571, size: 32, offset: 1664)
!571 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderingIntent", file: !89, line: 49, baseType: !88)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !532, file: !73, line: 193, baseType: !521, size: 64, offset: 1728)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !532, file: !73, line: 196, baseType: !574, size: 32, offset: 1792)
!574 = !DIDerivedType(tag: DW_TAG_typedef, name: "ResolutionType", file: !73, line: 93, baseType: !96)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "montage", scope: !532, file: !73, line: 199, baseType: !576, size: 64, offset: 1856)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64)
!577 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "directory", scope: !532, file: !73, line: 200, baseType: !576, size: 64, offset: 1920)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "geometry", scope: !532, file: !73, line: 201, baseType: !576, size: 64, offset: 1984)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !532, file: !73, line: 204, baseType: !505, size: 64, offset: 2048)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "x_resolution", scope: !532, file: !73, line: 207, baseType: !529, size: 64, offset: 2112)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "y_resolution", scope: !532, file: !73, line: 208, baseType: !529, size: 64, offset: 2176)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !532, file: !73, line: 211, baseType: !584, size: 256, offset: 2240)
!584 = !DIDerivedType(tag: DW_TAG_typedef, name: "RectangleInfo", file: !153, line: 130, baseType: !585)
!585 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_RectangleInfo", file: !153, line: 121, size: 256, elements: !586)
!586 = !{!587, !588, !589, !590}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !585, file: !153, line: 124, baseType: !522, size: 64)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !585, file: !153, line: 125, baseType: !522, size: 64, offset: 64)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !585, file: !153, line: 128, baseType: !505, size: 64, offset: 128)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !585, file: !153, line: 129, baseType: !505, size: 64, offset: 192)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "extract_info", scope: !532, file: !73, line: 212, baseType: !584, size: 256, offset: 2496)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "tile_info", scope: !532, file: !73, line: 213, baseType: !584, size: 256, offset: 2752)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "bias", scope: !532, file: !73, line: 216, baseType: !529, size: 64, offset: 3008)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "blur", scope: !532, file: !73, line: 217, baseType: !529, size: 64, offset: 3072)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !532, file: !73, line: 218, baseType: !529, size: 64, offset: 3136)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !532, file: !73, line: 221, baseType: !597, size: 32, offset: 3200)
!597 = !DIDerivedType(tag: DW_TAG_typedef, name: "FilterTypes", file: !102, line: 66, baseType: !101)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "interlace", scope: !532, file: !73, line: 224, baseType: !599, size: 32, offset: 3232)
!599 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterlaceType", file: !73, line: 73, baseType: !136)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !532, file: !73, line: 227, baseType: !601, size: 32, offset: 3264)
!601 = !DIDerivedType(tag: DW_TAG_typedef, name: "EndianType", file: !147, line: 35, baseType: !146)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !532, file: !73, line: 230, baseType: !603, size: 32, offset: 3296)
!603 = !DIDerivedType(tag: DW_TAG_typedef, name: "GravityType", file: !153, line: 91, baseType: !152)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !532, file: !73, line: 233, baseType: !605, size: 32, offset: 3328)
!605 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompositeOperator", file: !168, line: 99, baseType: !167)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "dispose", scope: !532, file: !73, line: 236, baseType: !607, size: 32, offset: 3360)
!607 = !DIDerivedType(tag: DW_TAG_typedef, name: "DisposeType", file: !239, line: 32, baseType: !238)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "clip_mask", scope: !532, file: !73, line: 239, baseType: !609, size: 64, offset: 3392)
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !532, file: !73, line: 242, baseType: !522, size: 64, offset: 3456)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !532, file: !73, line: 243, baseType: !522, size: 64, offset: 3520)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_second", scope: !532, file: !73, line: 246, baseType: !505, size: 64, offset: 3584)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "iterations", scope: !532, file: !73, line: 249, baseType: !522, size: 64, offset: 3648)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "total_colors", scope: !532, file: !73, line: 250, baseType: !522, size: 64, offset: 3712)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "start_loop", scope: !532, file: !73, line: 253, baseType: !505, size: 64, offset: 3776)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !532, file: !73, line: 256, baseType: !617, size: 192, offset: 3840)
!617 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErrorInfo", file: !618, line: 68, baseType: !619)
!618 = !DIFile(filename: "./magick/color.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!619 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ErrorInfo", file: !618, line: 62, size: 192, elements: !620)
!620 = !{!621, !622, !623}
!621 = !DIDerivedType(tag: DW_TAG_member, name: "mean_error_per_pixel", scope: !619, file: !618, line: 65, baseType: !529, size: 64)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_mean_error", scope: !619, file: !618, line: 66, baseType: !529, size: 64, offset: 64)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_maximum_error", scope: !619, file: !618, line: 67, baseType: !529, size: 64, offset: 128)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !532, file: !73, line: 259, baseType: !625, size: 512, offset: 4032)
!625 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerInfo", file: !247, line: 51, baseType: !626)
!626 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TimerInfo", file: !247, line: 40, size: 512, elements: !627)
!627 = !{!628, !635, !636, !638}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !626, file: !247, line: 43, baseType: !629, size: 192)
!629 = !DIDerivedType(tag: DW_TAG_typedef, name: "Timer", file: !247, line: 38, baseType: !630)
!630 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Timer", file: !247, line: 32, size: 192, elements: !631)
!631 = !{!632, !633, !634}
!632 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !630, file: !247, line: 35, baseType: !529, size: 64)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !630, file: !247, line: 36, baseType: !529, size: 64, offset: 64)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !630, file: !247, line: 37, baseType: !529, size: 64, offset: 128)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "elapsed", scope: !626, file: !247, line: 44, baseType: !629, size: 192, offset: 192)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !626, file: !247, line: 47, baseType: !637, size: 32, offset: 384)
!637 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerState", file: !247, line: 30, baseType: !246)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !626, file: !247, line: 50, baseType: !522, size: 64, offset: 448)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !532, file: !73, line: 262, baseType: !640, size: 64, offset: 4544)
!640 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickProgressMonitor", file: !641, line: 26, baseType: !642)
!641 = !DIFile(filename: "./magick/monitor.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 64)
!643 = !DISubroutineType(types: !644)
!644 = !{!544, !645, !647, !650, !521}
!645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !646, size: 64)
!646 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !577)
!647 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !648)
!648 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickOffsetType", file: !4, line: 150, baseType: !649)
!649 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!650 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !651)
!651 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickSizeType", file: !4, line: 151, baseType: !652)
!652 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !532, file: !73, line: 265, baseType: !521, size: 64, offset: 4608)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !532, file: !73, line: 266, baseType: !521, size: 64, offset: 4672)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !532, file: !73, line: 267, baseType: !521, size: 64, offset: 4736)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "ascii85", scope: !532, file: !73, line: 270, baseType: !657, size: 64, offset: 4800)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64)
!658 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ascii85Info", file: !48, line: 52, baseType: !659)
!659 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Ascii85Info", file: !48, line: 51, flags: DIFlagFwdDecl)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !532, file: !73, line: 273, baseType: !661, size: 64, offset: 4864)
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !662, size: 64)
!662 = !DIDerivedType(tag: DW_TAG_typedef, name: "BlobInfo", file: !4, line: 217, baseType: !663)
!663 = !DICompositeType(tag: DW_TAG_structure_type, name: "_BlobInfo", file: !4, line: 217, flags: DIFlagFwdDecl)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !532, file: !73, line: 276, baseType: !665, size: 32768, offset: 4928)
!665 = !DICompositeType(tag: DW_TAG_array_type, baseType: !577, size: 32768, elements: !666)
!666 = !{!667}
!667 = !DISubrange(count: 4096)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "magick_filename", scope: !532, file: !73, line: 277, baseType: !665, size: 32768, offset: 37696)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !532, file: !73, line: 278, baseType: !665, size: 32768, offset: 70464)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "magick_columns", scope: !532, file: !73, line: 281, baseType: !522, size: 64, offset: 103232)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "magick_rows", scope: !532, file: !73, line: 282, baseType: !522, size: 64, offset: 103296)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "exception", scope: !532, file: !73, line: 285, baseType: !673, size: 448, offset: 103360)
!673 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionInfo", file: !4, line: 219, baseType: !674)
!674 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ExceptionInfo", file: !253, line: 102, size: 448, elements: !675)
!675 = !{!676, !678, !679, !680, !681, !682, !683, !688}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "severity", scope: !674, file: !253, line: 105, baseType: !677, size: 32)
!677 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionType", file: !253, line: 100, baseType: !252)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "error_number", scope: !674, file: !253, line: 108, baseType: !525, size: 32, offset: 32)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !674, file: !253, line: 111, baseType: !576, size: 64, offset: 64)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !674, file: !253, line: 112, baseType: !576, size: 64, offset: 128)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "exceptions", scope: !674, file: !253, line: 115, baseType: !521, size: 64, offset: 192)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "relinquish", scope: !674, file: !253, line: 118, baseType: !544, size: 32, offset: 256)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !674, file: !253, line: 121, baseType: !684, size: 64, offset: 320)
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 64)
!685 = !DIDerivedType(tag: DW_TAG_typedef, name: "SemaphoreInfo", file: !686, line: 26, baseType: !687)
!686 = !DIFile(filename: "./magick/semaphore.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!687 = !DICompositeType(tag: DW_TAG_structure_type, name: "SemaphoreInfo", file: !686, line: 25, flags: DIFlagFwdDecl)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !674, file: !253, line: 124, baseType: !522, size: 64, offset: 384)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !532, file: !73, line: 288, baseType: !544, size: 32, offset: 103808)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !532, file: !73, line: 291, baseType: !691, size: 64, offset: 103872)
!691 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !505)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !532, file: !73, line: 294, baseType: !684, size: 64, offset: 103936)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "color_profile", scope: !532, file: !73, line: 297, baseType: !694, size: 256, offset: 104000)
!694 = !DIDerivedType(tag: DW_TAG_typedef, name: "ProfileInfo", file: !89, line: 40, baseType: !695)
!695 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ProfileInfo", file: !89, line: 27, size: 256, elements: !696)
!696 = !{!697, !698, !699, !702}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !695, file: !89, line: 30, baseType: !576, size: 64)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !695, file: !89, line: 33, baseType: !522, size: 64, offset: 64)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !695, file: !89, line: 36, baseType: !700, size: 64, offset: 128)
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !701, size: 64)
!701 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !695, file: !89, line: 39, baseType: !522, size: 64, offset: 192)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "iptc_profile", scope: !532, file: !73, line: 298, baseType: !694, size: 256, offset: 104256)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profile", scope: !532, file: !73, line: 299, baseType: !705, size: 64, offset: 104512)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 64)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profiles", scope: !532, file: !73, line: 302, baseType: !522, size: 64, offset: 104576)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !532, file: !73, line: 305, baseType: !522, size: 64, offset: 104640)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !532, file: !73, line: 308, baseType: !609, size: 64, offset: 104704)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !532, file: !73, line: 309, baseType: !609, size: 64, offset: 104768)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !532, file: !73, line: 310, baseType: !609, size: 64, offset: 104832)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "interpolate", scope: !532, file: !73, line: 313, baseType: !712, size: 32, offset: 104896)
!712 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterpolatePixelMethod", file: !326, line: 47, baseType: !325)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "black_point_compensation", scope: !532, file: !73, line: 316, baseType: !544, size: 32, offset: 104928)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_color", scope: !532, file: !73, line: 319, baseType: !512, size: 64, offset: 104960)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !532, file: !73, line: 322, baseType: !609, size: 64, offset: 105024)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "tile_offset", scope: !532, file: !73, line: 325, baseType: !584, size: 256, offset: 105088)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !532, file: !73, line: 328, baseType: !521, size: 64, offset: 105344)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "artifacts", scope: !532, file: !73, line: 329, baseType: !521, size: 64, offset: 105408)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !532, file: !73, line: 332, baseType: !720, size: 32, offset: 105472)
!720 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageType", file: !73, line: 61, baseType: !342)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !532, file: !73, line: 335, baseType: !544, size: 32, offset: 105504)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !532, file: !73, line: 338, baseType: !651, size: 64, offset: 105536)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "ping", scope: !532, file: !73, line: 341, baseType: !544, size: 32, offset: 105600)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !532, file: !73, line: 344, baseType: !522, size: 64, offset: 105664)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !532, file: !73, line: 347, baseType: !726, size: 64, offset: 105728)
!726 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !727, line: 7, baseType: !728)
!727 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "")
!728 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !508, line: 160, baseType: !509)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "intensity", scope: !532, file: !73, line: 350, baseType: !730, size: 32, offset: 105792)
!730 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelIntensityMethod", file: !326, line: 79, baseType: !356)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !532, file: !73, line: 353, baseType: !522, size: 64, offset: 105856)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 64)
!733 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickRealType", file: !4, line: 78, baseType: !734)
!734 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!735 = !DIDerivedType(tag: DW_TAG_typedef, name: "QuantumAny", file: !4, line: 170, baseType: !651)
!736 = !{i32 7, !"Dwarf Version", i32 4}
!737 = !{i32 2, !"Debug Info Version", i32 3}
!738 = !{i32 1, !"wchar_size", i32 4}
!739 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!740 = distinct !DISubprogram(name: "GetImageBoundingBox", scope: !1, file: !1, line: 125, type: !741, scopeLine: 127, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !746)
!741 = !DISubroutineType(types: !742)
!742 = !{!584, !743, !745}
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64)
!744 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !531)
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 64)
!746 = !{}
!747 = !DILocalVariable(name: "image", arg: 1, scope: !740, file: !1, line: 125, type: !743)
!748 = !DILocation(line: 125, column: 61, scope: !740)
!749 = !DILocalVariable(name: "exception", arg: 2, scope: !740, file: !1, line: 126, type: !745)
!750 = !DILocation(line: 126, column: 18, scope: !740)
!751 = !DILocalVariable(name: "image_view", scope: !740, file: !1, line: 129, type: !752)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 64)
!753 = !DIDerivedType(tag: DW_TAG_typedef, name: "CacheView", file: !461, line: 50, baseType: !754)
!754 = !DICompositeType(tag: DW_TAG_structure_type, name: "_CacheView", file: !326, line: 160, flags: DIFlagFwdDecl)
!755 = !DILocation(line: 129, column: 6, scope: !740)
!756 = !DILocalVariable(name: "status", scope: !740, file: !1, line: 132, type: !544)
!757 = !DILocation(line: 132, column: 5, scope: !740)
!758 = !DILocalVariable(name: "target", scope: !740, file: !1, line: 135, type: !759)
!759 = !DICompositeType(tag: DW_TAG_array_type, baseType: !760, size: 1344, elements: !773)
!760 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickPixelPacket", file: !326, line: 127, baseType: !761)
!761 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MagickPixelPacket", file: !326, line: 104, size: 448, elements: !762)
!762 = !{!763, !764, !765, !766, !767, !768, !769, !770, !771, !772}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "storage_class", scope: !761, file: !326, line: 107, baseType: !535, size: 32)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !761, file: !326, line: 110, baseType: !537, size: 32, offset: 32)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "matte", scope: !761, file: !326, line: 113, baseType: !544, size: 32, offset: 64)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !761, file: !326, line: 116, baseType: !529, size: 64, offset: 128)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !761, file: !326, line: 119, baseType: !522, size: 64, offset: 192)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !761, file: !326, line: 122, baseType: !733, size: 32, offset: 256)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !761, file: !326, line: 123, baseType: !733, size: 32, offset: 288)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !761, file: !326, line: 124, baseType: !733, size: 32, offset: 320)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !761, file: !326, line: 125, baseType: !733, size: 32, offset: 352)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !761, file: !326, line: 126, baseType: !733, size: 32, offset: 384)
!773 = !{!774}
!774 = !DISubrange(count: 3)
!775 = !DILocation(line: 135, column: 5, scope: !740)
!776 = !DILocalVariable(name: "zero", scope: !740, file: !1, line: 136, type: !760)
!777 = !DILocation(line: 136, column: 5, scope: !740)
!778 = !DILocalVariable(name: "bounds", scope: !740, file: !1, line: 139, type: !584)
!779 = !DILocation(line: 139, column: 5, scope: !740)
!780 = !DILocalVariable(name: "p", scope: !740, file: !1, line: 142, type: !510)
!781 = !DILocation(line: 142, column: 6, scope: !740)
!782 = !DILocalVariable(name: "y", scope: !740, file: !1, line: 145, type: !505)
!783 = !DILocation(line: 145, column: 5, scope: !740)
!784 = !DILocation(line: 149, column: 7, scope: !785)
!785 = distinct !DILexicalBlock(scope: !740, file: !1, line: 149, column: 7)
!786 = !DILocation(line: 149, column: 14, scope: !785)
!787 = !DILocation(line: 149, column: 20, scope: !785)
!788 = !DILocation(line: 149, column: 7, scope: !740)
!789 = !DILocation(line: 150, column: 61, scope: !785)
!790 = !DILocation(line: 150, column: 68, scope: !785)
!791 = !DILocation(line: 150, column: 12, scope: !785)
!792 = !DILocation(line: 150, column: 5, scope: !785)
!793 = !DILocation(line: 151, column: 10, scope: !740)
!794 = !DILocation(line: 151, column: 15, scope: !740)
!795 = !DILocation(line: 152, column: 10, scope: !740)
!796 = !DILocation(line: 152, column: 16, scope: !740)
!797 = !DILocation(line: 153, column: 22, scope: !740)
!798 = !DILocation(line: 153, column: 29, scope: !740)
!799 = !DILocation(line: 153, column: 10, scope: !740)
!800 = !DILocation(line: 153, column: 11, scope: !740)
!801 = !DILocation(line: 154, column: 22, scope: !740)
!802 = !DILocation(line: 154, column: 29, scope: !740)
!803 = !DILocation(line: 154, column: 10, scope: !740)
!804 = !DILocation(line: 154, column: 11, scope: !740)
!805 = !DILocation(line: 155, column: 24, scope: !740)
!806 = !DILocation(line: 155, column: 31, scope: !740)
!807 = !DILocation(line: 155, column: 3, scope: !740)
!808 = !DILocation(line: 156, column: 38, scope: !740)
!809 = !DILocation(line: 156, column: 44, scope: !740)
!810 = !DILocation(line: 156, column: 14, scope: !740)
!811 = !DILocation(line: 156, column: 13, scope: !740)
!812 = !DILocation(line: 157, column: 31, scope: !740)
!813 = !DILocation(line: 157, column: 50, scope: !740)
!814 = !DILocation(line: 157, column: 5, scope: !740)
!815 = !DILocation(line: 157, column: 4, scope: !740)
!816 = !DILocation(line: 158, column: 7, scope: !817)
!817 = distinct !DILexicalBlock(scope: !740, file: !1, line: 158, column: 7)
!818 = !DILocation(line: 158, column: 9, scope: !817)
!819 = !DILocation(line: 158, column: 7, scope: !740)
!820 = !DILocation(line: 160, column: 35, scope: !821)
!821 = distinct !DILexicalBlock(scope: !817, file: !1, line: 159, column: 5)
!822 = !DILocation(line: 160, column: 18, scope: !821)
!823 = !DILocation(line: 160, column: 17, scope: !821)
!824 = !DILocation(line: 161, column: 7, scope: !821)
!825 = !DILocation(line: 163, column: 24, scope: !740)
!826 = !DILocation(line: 163, column: 30, scope: !740)
!827 = !DILocation(line: 163, column: 62, scope: !740)
!828 = !DILocation(line: 163, column: 32, scope: !740)
!829 = !DILocation(line: 164, column: 6, scope: !740)
!830 = !DILocation(line: 163, column: 3, scope: !740)
!831 = !DILocation(line: 165, column: 24, scope: !740)
!832 = !DILocation(line: 165, column: 31, scope: !740)
!833 = !DILocation(line: 165, column: 3, scope: !740)
!834 = !DILocation(line: 166, column: 31, scope: !740)
!835 = !DILocation(line: 166, column: 52, scope: !740)
!836 = !DILocation(line: 166, column: 59, scope: !740)
!837 = !DILocation(line: 166, column: 66, scope: !740)
!838 = !DILocation(line: 167, column: 5, scope: !740)
!839 = !DILocation(line: 166, column: 5, scope: !740)
!840 = !DILocation(line: 166, column: 4, scope: !740)
!841 = !DILocation(line: 168, column: 24, scope: !740)
!842 = !DILocation(line: 168, column: 30, scope: !740)
!843 = !DILocation(line: 168, column: 62, scope: !740)
!844 = !DILocation(line: 168, column: 32, scope: !740)
!845 = !DILocation(line: 169, column: 6, scope: !740)
!846 = !DILocation(line: 168, column: 3, scope: !740)
!847 = !DILocation(line: 170, column: 24, scope: !740)
!848 = !DILocation(line: 170, column: 31, scope: !740)
!849 = !DILocation(line: 170, column: 3, scope: !740)
!850 = !DILocation(line: 171, column: 31, scope: !740)
!851 = !DILocation(line: 171, column: 54, scope: !740)
!852 = !DILocation(line: 171, column: 61, scope: !740)
!853 = !DILocation(line: 171, column: 65, scope: !740)
!854 = !DILocation(line: 172, column: 5, scope: !740)
!855 = !DILocation(line: 171, column: 5, scope: !740)
!856 = !DILocation(line: 171, column: 4, scope: !740)
!857 = !DILocation(line: 173, column: 24, scope: !740)
!858 = !DILocation(line: 173, column: 30, scope: !740)
!859 = !DILocation(line: 173, column: 62, scope: !740)
!860 = !DILocation(line: 173, column: 32, scope: !740)
!861 = !DILocation(line: 174, column: 6, scope: !740)
!862 = !DILocation(line: 173, column: 3, scope: !740)
!863 = !DILocation(line: 175, column: 9, scope: !740)
!864 = !DILocation(line: 176, column: 24, scope: !740)
!865 = !DILocation(line: 176, column: 3, scope: !740)
!866 = !DILocation(line: 181, column: 9, scope: !867)
!867 = distinct !DILexicalBlock(scope: !740, file: !1, line: 181, column: 3)
!868 = !DILocation(line: 181, column: 8, scope: !867)
!869 = !DILocation(line: 181, column: 13, scope: !870)
!870 = distinct !DILexicalBlock(scope: !867, file: !1, line: 181, column: 3)
!871 = !DILocation(line: 181, column: 27, scope: !870)
!872 = !DILocation(line: 181, column: 34, scope: !870)
!873 = !DILocation(line: 181, column: 15, scope: !870)
!874 = !DILocation(line: 181, column: 3, scope: !867)
!875 = !DILocalVariable(name: "pixel", scope: !876, file: !1, line: 184, type: !760)
!876 = distinct !DILexicalBlock(scope: !870, file: !1, line: 182, column: 3)
!877 = !DILocation(line: 184, column: 7, scope: !876)
!878 = !DILocalVariable(name: "bounding_box", scope: !876, file: !1, line: 187, type: !584)
!879 = !DILocation(line: 187, column: 7, scope: !876)
!880 = !DILocalVariable(name: "indexes", scope: !876, file: !1, line: 190, type: !881)
!881 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !526)
!882 = !DILocation(line: 190, column: 17, scope: !876)
!883 = !DILocalVariable(name: "p", scope: !876, file: !1, line: 193, type: !884)
!884 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !510)
!885 = !DILocation(line: 193, column: 17, scope: !876)
!886 = !DILocalVariable(name: "x", scope: !876, file: !1, line: 196, type: !505)
!887 = !DILocation(line: 196, column: 7, scope: !876)
!888 = !DILocation(line: 198, column: 9, scope: !889)
!889 = distinct !DILexicalBlock(scope: !876, file: !1, line: 198, column: 9)
!890 = !DILocation(line: 198, column: 16, scope: !889)
!891 = !DILocation(line: 198, column: 9, scope: !876)
!892 = !DILocation(line: 199, column: 7, scope: !889)
!893 = !DILocation(line: 203, column: 18, scope: !876)
!894 = !DILocation(line: 204, column: 33, scope: !876)
!895 = !DILocation(line: 204, column: 46, scope: !876)
!896 = !DILocation(line: 204, column: 48, scope: !876)
!897 = !DILocation(line: 204, column: 55, scope: !876)
!898 = !DILocation(line: 204, column: 65, scope: !876)
!899 = !DILocation(line: 204, column: 7, scope: !876)
!900 = !DILocation(line: 204, column: 6, scope: !876)
!901 = !DILocation(line: 205, column: 9, scope: !902)
!902 = distinct !DILexicalBlock(scope: !876, file: !1, line: 205, column: 9)
!903 = !DILocation(line: 205, column: 11, scope: !902)
!904 = !DILocation(line: 205, column: 9, scope: !876)
!905 = !DILocation(line: 207, column: 15, scope: !906)
!906 = distinct !DILexicalBlock(scope: !902, file: !1, line: 206, column: 7)
!907 = !DILocation(line: 208, column: 9, scope: !906)
!908 = !DILocation(line: 210, column: 43, scope: !876)
!909 = !DILocation(line: 210, column: 13, scope: !876)
!910 = !DILocation(line: 210, column: 12, scope: !876)
!911 = !DILocation(line: 211, column: 11, scope: !876)
!912 = !DILocation(line: 212, column: 11, scope: !913)
!913 = distinct !DILexicalBlock(scope: !876, file: !1, line: 212, column: 5)
!914 = !DILocation(line: 212, column: 10, scope: !913)
!915 = !DILocation(line: 212, column: 15, scope: !916)
!916 = distinct !DILexicalBlock(scope: !913, file: !1, line: 212, column: 5)
!917 = !DILocation(line: 212, column: 29, scope: !916)
!918 = !DILocation(line: 212, column: 36, scope: !916)
!919 = !DILocation(line: 212, column: 17, scope: !916)
!920 = !DILocation(line: 212, column: 5, scope: !913)
!921 = !DILocation(line: 214, column: 28, scope: !922)
!922 = distinct !DILexicalBlock(scope: !916, file: !1, line: 213, column: 5)
!923 = !DILocation(line: 214, column: 34, scope: !922)
!924 = !DILocation(line: 214, column: 36, scope: !922)
!925 = !DILocation(line: 214, column: 44, scope: !922)
!926 = !DILocation(line: 214, column: 43, scope: !922)
!927 = !DILocation(line: 214, column: 7, scope: !922)
!928 = !DILocation(line: 215, column: 12, scope: !929)
!929 = distinct !DILexicalBlock(scope: !922, file: !1, line: 215, column: 11)
!930 = !DILocation(line: 215, column: 29, scope: !929)
!931 = !DILocation(line: 215, column: 14, scope: !929)
!932 = !DILocation(line: 215, column: 32, scope: !929)
!933 = !DILocation(line: 216, column: 41, scope: !929)
!934 = !DILocation(line: 216, column: 12, scope: !929)
!935 = !DILocation(line: 216, column: 52, scope: !929)
!936 = !DILocation(line: 215, column: 11, scope: !922)
!937 = !DILocation(line: 217, column: 24, scope: !929)
!938 = !DILocation(line: 217, column: 22, scope: !929)
!939 = !DILocation(line: 217, column: 23, scope: !929)
!940 = !DILocation(line: 217, column: 9, scope: !929)
!941 = !DILocation(line: 218, column: 12, scope: !942)
!942 = distinct !DILexicalBlock(scope: !922, file: !1, line: 218, column: 11)
!943 = !DILocation(line: 218, column: 39, scope: !942)
!944 = !DILocation(line: 218, column: 14, scope: !942)
!945 = !DILocation(line: 218, column: 46, scope: !942)
!946 = !DILocation(line: 219, column: 41, scope: !942)
!947 = !DILocation(line: 219, column: 12, scope: !942)
!948 = !DILocation(line: 219, column: 52, scope: !942)
!949 = !DILocation(line: 218, column: 11, scope: !922)
!950 = !DILocation(line: 220, column: 37, scope: !942)
!951 = !DILocation(line: 220, column: 22, scope: !942)
!952 = !DILocation(line: 220, column: 27, scope: !942)
!953 = !DILocation(line: 220, column: 9, scope: !942)
!954 = !DILocation(line: 221, column: 12, scope: !955)
!955 = distinct !DILexicalBlock(scope: !922, file: !1, line: 221, column: 11)
!956 = !DILocation(line: 221, column: 29, scope: !955)
!957 = !DILocation(line: 221, column: 14, scope: !955)
!958 = !DILocation(line: 221, column: 32, scope: !955)
!959 = !DILocation(line: 222, column: 41, scope: !955)
!960 = !DILocation(line: 222, column: 12, scope: !955)
!961 = !DILocation(line: 222, column: 52, scope: !955)
!962 = !DILocation(line: 221, column: 11, scope: !922)
!963 = !DILocation(line: 223, column: 24, scope: !955)
!964 = !DILocation(line: 223, column: 22, scope: !955)
!965 = !DILocation(line: 223, column: 23, scope: !955)
!966 = !DILocation(line: 223, column: 9, scope: !955)
!967 = !DILocation(line: 224, column: 12, scope: !968)
!968 = distinct !DILexicalBlock(scope: !922, file: !1, line: 224, column: 11)
!969 = !DILocation(line: 224, column: 39, scope: !968)
!970 = !DILocation(line: 224, column: 14, scope: !968)
!971 = !DILocation(line: 224, column: 47, scope: !968)
!972 = !DILocation(line: 225, column: 41, scope: !968)
!973 = !DILocation(line: 225, column: 12, scope: !968)
!974 = !DILocation(line: 225, column: 52, scope: !968)
!975 = !DILocation(line: 224, column: 11, scope: !922)
!976 = !DILocation(line: 226, column: 38, scope: !968)
!977 = !DILocation(line: 226, column: 22, scope: !968)
!978 = !DILocation(line: 226, column: 28, scope: !968)
!979 = !DILocation(line: 226, column: 9, scope: !968)
!980 = !DILocation(line: 227, column: 8, scope: !922)
!981 = !DILocation(line: 228, column: 5, scope: !922)
!982 = !DILocation(line: 212, column: 46, scope: !916)
!983 = !DILocation(line: 212, column: 5, scope: !916)
!984 = distinct !{!984, !920, !985}
!985 = !DILocation(line: 228, column: 5, scope: !913)
!986 = !DILocation(line: 233, column: 24, scope: !987)
!987 = distinct !DILexicalBlock(scope: !988, file: !1, line: 233, column: 11)
!988 = distinct !DILexicalBlock(scope: !876, file: !1, line: 232, column: 5)
!989 = !DILocation(line: 233, column: 35, scope: !987)
!990 = !DILocation(line: 233, column: 26, scope: !987)
!991 = !DILocation(line: 233, column: 11, scope: !988)
!992 = !DILocation(line: 234, column: 31, scope: !987)
!993 = !DILocation(line: 234, column: 16, scope: !987)
!994 = !DILocation(line: 234, column: 17, scope: !987)
!995 = !DILocation(line: 234, column: 9, scope: !987)
!996 = !DILocation(line: 235, column: 24, scope: !997)
!997 = distinct !DILexicalBlock(scope: !988, file: !1, line: 235, column: 11)
!998 = !DILocation(line: 235, column: 35, scope: !997)
!999 = !DILocation(line: 235, column: 26, scope: !997)
!1000 = !DILocation(line: 235, column: 11, scope: !988)
!1001 = !DILocation(line: 236, column: 31, scope: !997)
!1002 = !DILocation(line: 236, column: 16, scope: !997)
!1003 = !DILocation(line: 236, column: 17, scope: !997)
!1004 = !DILocation(line: 236, column: 9, scope: !997)
!1005 = !DILocation(line: 237, column: 24, scope: !1006)
!1006 = distinct !DILexicalBlock(scope: !988, file: !1, line: 237, column: 11)
!1007 = !DILocation(line: 237, column: 39, scope: !1006)
!1008 = !DILocation(line: 237, column: 30, scope: !1006)
!1009 = !DILocation(line: 237, column: 11, scope: !988)
!1010 = !DILocation(line: 238, column: 35, scope: !1006)
!1011 = !DILocation(line: 238, column: 16, scope: !1006)
!1012 = !DILocation(line: 238, column: 21, scope: !1006)
!1013 = !DILocation(line: 238, column: 9, scope: !1006)
!1014 = !DILocation(line: 239, column: 24, scope: !1015)
!1015 = distinct !DILexicalBlock(scope: !988, file: !1, line: 239, column: 11)
!1016 = !DILocation(line: 239, column: 40, scope: !1015)
!1017 = !DILocation(line: 239, column: 31, scope: !1015)
!1018 = !DILocation(line: 239, column: 11, scope: !988)
!1019 = !DILocation(line: 240, column: 36, scope: !1015)
!1020 = !DILocation(line: 240, column: 16, scope: !1015)
!1021 = !DILocation(line: 240, column: 22, scope: !1015)
!1022 = !DILocation(line: 240, column: 9, scope: !1015)
!1023 = !DILocation(line: 242, column: 3, scope: !876)
!1024 = !DILocation(line: 181, column: 41, scope: !870)
!1025 = !DILocation(line: 181, column: 3, scope: !870)
!1026 = distinct !{!1026, !874, !1027}
!1027 = !DILocation(line: 242, column: 3, scope: !867)
!1028 = !DILocation(line: 243, column: 31, scope: !740)
!1029 = !DILocation(line: 243, column: 14, scope: !740)
!1030 = !DILocation(line: 243, column: 13, scope: !740)
!1031 = !DILocation(line: 244, column: 15, scope: !1032)
!1032 = distinct !DILexicalBlock(scope: !740, file: !1, line: 244, column: 7)
!1033 = !DILocation(line: 244, column: 21, scope: !1032)
!1034 = !DILocation(line: 244, column: 27, scope: !1032)
!1035 = !DILocation(line: 244, column: 38, scope: !1032)
!1036 = !DILocation(line: 244, column: 45, scope: !1032)
!1037 = !DILocation(line: 244, column: 7, scope: !740)
!1038 = !DILocation(line: 245, column: 33, scope: !1032)
!1039 = !DILocation(line: 246, column: 44, scope: !1032)
!1040 = !DILocation(line: 246, column: 51, scope: !1032)
!1041 = !DILocation(line: 245, column: 12, scope: !1032)
!1042 = !DILocation(line: 245, column: 5, scope: !1032)
!1043 = !DILocation(line: 249, column: 29, scope: !1044)
!1044 = distinct !DILexicalBlock(scope: !1032, file: !1, line: 248, column: 5)
!1045 = !DILocation(line: 249, column: 30, scope: !1044)
!1046 = !DILocation(line: 249, column: 14, scope: !1044)
!1047 = !DILocation(line: 249, column: 19, scope: !1044)
!1048 = !DILocation(line: 250, column: 30, scope: !1044)
!1049 = !DILocation(line: 250, column: 31, scope: !1044)
!1050 = !DILocation(line: 250, column: 14, scope: !1044)
!1051 = !DILocation(line: 250, column: 20, scope: !1044)
!1052 = !DILocation(line: 252, column: 3, scope: !740)
!1053 = !DILocation(line: 253, column: 1, scope: !740)
!1054 = distinct !DISubprogram(name: "SetMagickPixelPacket", scope: !1055, file: !1055, line: 92, type: !1056, scopeLine: 94, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !746)
!1055 = !DIFile(filename: "./magick/pixel-private.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!1056 = !DISubroutineType(types: !1057)
!1057 = !{null, !743, !510, !526, !1058}
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !760, size: 64)
!1059 = !DILocalVariable(name: "image", arg: 1, scope: !1054, file: !1055, line: 92, type: !743)
!1060 = !DILocation(line: 92, column: 54, scope: !1054)
!1061 = !DILocalVariable(name: "color", arg: 2, scope: !1054, file: !1055, line: 93, type: !510)
!1062 = !DILocation(line: 93, column: 22, scope: !1054)
!1063 = !DILocalVariable(name: "index", arg: 3, scope: !1054, file: !1055, line: 93, type: !526)
!1064 = !DILocation(line: 93, column: 47, scope: !1054)
!1065 = !DILocalVariable(name: "pixel", arg: 4, scope: !1054, file: !1055, line: 93, type: !1058)
!1066 = !DILocation(line: 93, column: 72, scope: !1054)
!1067 = !DILocation(line: 95, column: 31, scope: !1054)
!1068 = !DILocation(line: 95, column: 14, scope: !1054)
!1069 = !DILocation(line: 95, column: 3, scope: !1054)
!1070 = !DILocation(line: 95, column: 10, scope: !1054)
!1071 = !DILocation(line: 95, column: 13, scope: !1054)
!1072 = !DILocation(line: 96, column: 33, scope: !1054)
!1073 = !DILocation(line: 96, column: 16, scope: !1054)
!1074 = !DILocation(line: 96, column: 3, scope: !1054)
!1075 = !DILocation(line: 96, column: 10, scope: !1054)
!1076 = !DILocation(line: 96, column: 15, scope: !1054)
!1077 = !DILocation(line: 97, column: 32, scope: !1054)
!1078 = !DILocation(line: 97, column: 15, scope: !1054)
!1079 = !DILocation(line: 97, column: 3, scope: !1054)
!1080 = !DILocation(line: 97, column: 10, scope: !1054)
!1081 = !DILocation(line: 97, column: 14, scope: !1054)
!1082 = !DILocation(line: 98, column: 35, scope: !1054)
!1083 = !DILocation(line: 98, column: 18, scope: !1054)
!1084 = !DILocation(line: 98, column: 3, scope: !1054)
!1085 = !DILocation(line: 98, column: 10, scope: !1054)
!1086 = !DILocation(line: 98, column: 17, scope: !1054)
!1087 = !DILocation(line: 99, column: 8, scope: !1088)
!1088 = distinct !DILexicalBlock(scope: !1054, file: !1055, line: 99, column: 7)
!1089 = !DILocation(line: 99, column: 15, scope: !1088)
!1090 = !DILocation(line: 99, column: 26, scope: !1088)
!1091 = !DILocation(line: 99, column: 45, scope: !1088)
!1092 = !DILocation(line: 100, column: 8, scope: !1088)
!1093 = !DILocation(line: 100, column: 14, scope: !1088)
!1094 = !DILocation(line: 99, column: 7, scope: !1054)
!1095 = !DILocation(line: 101, column: 35, scope: !1088)
!1096 = !DILocation(line: 101, column: 18, scope: !1088)
!1097 = !DILocation(line: 101, column: 5, scope: !1088)
!1098 = !DILocation(line: 101, column: 12, scope: !1088)
!1099 = !DILocation(line: 101, column: 17, scope: !1088)
!1100 = !DILocation(line: 102, column: 1, scope: !1054)
!1101 = distinct !DISubprogram(name: "GetImageDepth", scope: !1, file: !1, line: 283, type: !1102, scopeLine: 284, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !746)
!1102 = !DISubroutineType(types: !1103)
!1103 = !{!522, !743, !745}
!1104 = !DILocalVariable(name: "image", arg: 1, scope: !1101, file: !1, line: 283, type: !743)
!1105 = !DILocation(line: 283, column: 48, scope: !1101)
!1106 = !DILocalVariable(name: "exception", arg: 2, scope: !1101, file: !1, line: 283, type: !745)
!1107 = !DILocation(line: 283, column: 69, scope: !1101)
!1108 = !DILocation(line: 285, column: 31, scope: !1101)
!1109 = !DILocation(line: 285, column: 55, scope: !1101)
!1110 = !DILocation(line: 285, column: 10, scope: !1101)
!1111 = !DILocation(line: 285, column: 3, scope: !1101)
!1112 = distinct !DISubprogram(name: "GetImageChannelDepth", scope: !1, file: !1, line: 288, type: !1113, scopeLine: 290, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !746)
!1113 = !DISubroutineType(types: !1114)
!1114 = !{!522, !743, !1115, !745}
!1115 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1116)
!1116 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChannelType", file: !4, line: 202, baseType: !393)
!1117 = !DILocalVariable(name: "image", arg: 1, scope: !1112, file: !1, line: 288, type: !743)
!1118 = !DILocation(line: 288, column: 55, scope: !1112)
!1119 = !DILocalVariable(name: "channel", arg: 2, scope: !1112, file: !1, line: 289, type: !1115)
!1120 = !DILocation(line: 289, column: 21, scope: !1112)
!1121 = !DILocalVariable(name: "exception", arg: 3, scope: !1112, file: !1, line: 289, type: !745)
!1122 = !DILocation(line: 289, column: 44, scope: !1112)
!1123 = !DILocalVariable(name: "image_view", scope: !1112, file: !1, line: 292, type: !752)
!1124 = !DILocation(line: 292, column: 6, scope: !1112)
!1125 = !DILocalVariable(name: "status", scope: !1112, file: !1, line: 295, type: !544)
!1126 = !DILocation(line: 295, column: 5, scope: !1112)
!1127 = !DILocalVariable(name: "i", scope: !1112, file: !1, line: 298, type: !505)
!1128 = !DILocation(line: 298, column: 5, scope: !1112)
!1129 = !DILocalVariable(name: "current_depth", scope: !1112, file: !1, line: 301, type: !524)
!1130 = !DILocation(line: 301, column: 6, scope: !1112)
!1131 = !DILocalVariable(name: "depth", scope: !1112, file: !1, line: 302, type: !522)
!1132 = !DILocation(line: 302, column: 5, scope: !1112)
!1133 = !DILocalVariable(name: "number_threads", scope: !1112, file: !1, line: 303, type: !522)
!1134 = !DILocation(line: 303, column: 5, scope: !1112)
!1135 = !DILocalVariable(name: "y", scope: !1112, file: !1, line: 306, type: !505)
!1136 = !DILocation(line: 306, column: 5, scope: !1112)
!1137 = !DILocation(line: 314, column: 7, scope: !1138)
!1138 = distinct !DILexicalBlock(scope: !1112, file: !1, line: 314, column: 7)
!1139 = !DILocation(line: 314, column: 14, scope: !1138)
!1140 = !DILocation(line: 314, column: 20, scope: !1138)
!1141 = !DILocation(line: 314, column: 7, scope: !1112)
!1142 = !DILocation(line: 315, column: 61, scope: !1138)
!1143 = !DILocation(line: 315, column: 68, scope: !1138)
!1144 = !DILocation(line: 315, column: 12, scope: !1138)
!1145 = !DILocation(line: 315, column: 5, scope: !1138)
!1146 = !DILocation(line: 316, column: 27, scope: !1112)
!1147 = !DILocation(line: 316, column: 17, scope: !1112)
!1148 = !DILocation(line: 317, column: 49, scope: !1112)
!1149 = !DILocation(line: 317, column: 28, scope: !1112)
!1150 = !DILocation(line: 317, column: 17, scope: !1112)
!1151 = !DILocation(line: 317, column: 16, scope: !1112)
!1152 = !DILocation(line: 319, column: 7, scope: !1153)
!1153 = distinct !DILexicalBlock(scope: !1112, file: !1, line: 319, column: 7)
!1154 = !DILocation(line: 319, column: 21, scope: !1153)
!1155 = !DILocation(line: 319, column: 7, scope: !1112)
!1156 = !DILocalVariable(name: "message", scope: !1157, file: !1, line: 320, type: !576)
!1157 = distinct !DILexicalBlock(scope: !1153, file: !1, line: 320, column: 5)
!1158 = !DILocation(line: 320, column: 5, scope: !1157)
!1159 = !DILocalVariable(name: "exception", scope: !1157, file: !1, line: 320, type: !673)
!1160 = !DILocation(line: 321, column: 9, scope: !1112)
!1161 = !DILocation(line: 322, column: 9, scope: !1162)
!1162 = distinct !DILexicalBlock(scope: !1112, file: !1, line: 322, column: 3)
!1163 = !DILocation(line: 322, column: 8, scope: !1162)
!1164 = !DILocation(line: 322, column: 13, scope: !1165)
!1165 = distinct !DILexicalBlock(scope: !1162, file: !1, line: 322, column: 3)
!1166 = !DILocation(line: 322, column: 27, scope: !1165)
!1167 = !DILocation(line: 322, column: 15, scope: !1165)
!1168 = !DILocation(line: 322, column: 3, scope: !1162)
!1169 = !DILocation(line: 323, column: 5, scope: !1165)
!1170 = !DILocation(line: 323, column: 19, scope: !1165)
!1171 = !DILocation(line: 323, column: 21, scope: !1165)
!1172 = !DILocation(line: 322, column: 44, scope: !1165)
!1173 = !DILocation(line: 322, column: 3, scope: !1165)
!1174 = distinct !{!1174, !1168, !1175}
!1175 = !DILocation(line: 323, column: 22, scope: !1162)
!1176 = !DILocation(line: 324, column: 8, scope: !1177)
!1177 = distinct !DILexicalBlock(scope: !1112, file: !1, line: 324, column: 7)
!1178 = !DILocation(line: 324, column: 15, scope: !1177)
!1179 = !DILocation(line: 324, column: 29, scope: !1177)
!1180 = !DILocation(line: 324, column: 45, scope: !1177)
!1181 = !DILocation(line: 324, column: 49, scope: !1177)
!1182 = !DILocation(line: 324, column: 56, scope: !1177)
!1183 = !DILocation(line: 324, column: 62, scope: !1177)
!1184 = !DILocation(line: 324, column: 7, scope: !1112)
!1185 = !DILocation(line: 330, column: 13, scope: !1186)
!1186 = distinct !DILexicalBlock(scope: !1187, file: !1, line: 330, column: 7)
!1187 = distinct !DILexicalBlock(scope: !1177, file: !1, line: 325, column: 5)
!1188 = !DILocation(line: 330, column: 12, scope: !1186)
!1189 = !DILocation(line: 330, column: 17, scope: !1190)
!1190 = distinct !DILexicalBlock(scope: !1186, file: !1, line: 330, column: 7)
!1191 = !DILocation(line: 330, column: 31, scope: !1190)
!1192 = !DILocation(line: 330, column: 38, scope: !1190)
!1193 = !DILocation(line: 330, column: 19, scope: !1190)
!1194 = !DILocation(line: 330, column: 7, scope: !1186)
!1195 = !DILocalVariable(name: "id", scope: !1196, file: !1, line: 333, type: !1197)
!1196 = distinct !DILexicalBlock(scope: !1190, file: !1, line: 331, column: 7)
!1197 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !525)
!1198 = !DILocation(line: 333, column: 11, scope: !1196)
!1199 = !DILocation(line: 333, column: 16, scope: !1196)
!1200 = !DILocation(line: 335, column: 9, scope: !1196)
!1201 = !DILocation(line: 335, column: 16, scope: !1196)
!1202 = !DILocation(line: 335, column: 30, scope: !1196)
!1203 = !DILocation(line: 335, column: 34, scope: !1196)
!1204 = !DILocalVariable(name: "atDepth", scope: !1205, file: !1, line: 338, type: !544)
!1205 = distinct !DILexicalBlock(scope: !1196, file: !1, line: 336, column: 9)
!1206 = !DILocation(line: 338, column: 13, scope: !1205)
!1207 = !DILocalVariable(name: "range", scope: !1205, file: !1, line: 341, type: !735)
!1208 = !DILocation(line: 341, column: 13, scope: !1205)
!1209 = !DILocation(line: 343, column: 18, scope: !1205)
!1210 = !DILocation(line: 344, column: 33, scope: !1205)
!1211 = !DILocation(line: 344, column: 47, scope: !1205)
!1212 = !DILocation(line: 344, column: 17, scope: !1205)
!1213 = !DILocation(line: 344, column: 16, scope: !1205)
!1214 = !DILocation(line: 345, column: 16, scope: !1215)
!1215 = distinct !DILexicalBlock(scope: !1205, file: !1, line: 345, column: 15)
!1216 = !DILocation(line: 345, column: 24, scope: !1215)
!1217 = !DILocation(line: 345, column: 40, scope: !1215)
!1218 = !DILocation(line: 345, column: 45, scope: !1215)
!1219 = !DILocation(line: 345, column: 53, scope: !1215)
!1220 = !DILocation(line: 345, column: 67, scope: !1215)
!1221 = !DILocation(line: 345, column: 15, scope: !1205)
!1222 = !DILocation(line: 346, column: 32, scope: !1223)
!1223 = distinct !DILexicalBlock(scope: !1215, file: !1, line: 346, column: 17)
!1224 = !DILocation(line: 346, column: 39, scope: !1223)
!1225 = !DILocation(line: 346, column: 48, scope: !1223)
!1226 = !DILocation(line: 346, column: 51, scope: !1223)
!1227 = !DILocation(line: 346, column: 55, scope: !1223)
!1228 = !DILocation(line: 346, column: 17, scope: !1223)
!1229 = !DILocation(line: 346, column: 62, scope: !1223)
!1230 = !DILocation(line: 346, column: 17, scope: !1215)
!1231 = !DILocation(line: 347, column: 22, scope: !1223)
!1232 = !DILocation(line: 347, column: 15, scope: !1223)
!1233 = !DILocation(line: 346, column: 65, scope: !1223)
!1234 = !DILocation(line: 348, column: 16, scope: !1235)
!1235 = distinct !DILexicalBlock(scope: !1205, file: !1, line: 348, column: 15)
!1236 = !DILocation(line: 348, column: 24, scope: !1235)
!1237 = !DILocation(line: 348, column: 40, scope: !1235)
!1238 = !DILocation(line: 348, column: 45, scope: !1235)
!1239 = !DILocation(line: 348, column: 53, scope: !1235)
!1240 = !DILocation(line: 348, column: 69, scope: !1235)
!1241 = !DILocation(line: 348, column: 15, scope: !1205)
!1242 = !DILocation(line: 349, column: 32, scope: !1243)
!1243 = distinct !DILexicalBlock(scope: !1235, file: !1, line: 349, column: 17)
!1244 = !DILocation(line: 349, column: 39, scope: !1243)
!1245 = !DILocation(line: 349, column: 48, scope: !1243)
!1246 = !DILocation(line: 349, column: 51, scope: !1243)
!1247 = !DILocation(line: 349, column: 57, scope: !1243)
!1248 = !DILocation(line: 349, column: 17, scope: !1243)
!1249 = !DILocation(line: 349, column: 64, scope: !1243)
!1250 = !DILocation(line: 349, column: 17, scope: !1235)
!1251 = !DILocation(line: 350, column: 22, scope: !1243)
!1252 = !DILocation(line: 350, column: 15, scope: !1243)
!1253 = !DILocation(line: 349, column: 67, scope: !1243)
!1254 = !DILocation(line: 351, column: 16, scope: !1255)
!1255 = distinct !DILexicalBlock(scope: !1205, file: !1, line: 351, column: 15)
!1256 = !DILocation(line: 351, column: 24, scope: !1255)
!1257 = !DILocation(line: 351, column: 40, scope: !1255)
!1258 = !DILocation(line: 351, column: 45, scope: !1255)
!1259 = !DILocation(line: 351, column: 53, scope: !1255)
!1260 = !DILocation(line: 351, column: 68, scope: !1255)
!1261 = !DILocation(line: 351, column: 15, scope: !1205)
!1262 = !DILocation(line: 352, column: 32, scope: !1263)
!1263 = distinct !DILexicalBlock(scope: !1255, file: !1, line: 352, column: 17)
!1264 = !DILocation(line: 352, column: 39, scope: !1263)
!1265 = !DILocation(line: 352, column: 48, scope: !1263)
!1266 = !DILocation(line: 352, column: 51, scope: !1263)
!1267 = !DILocation(line: 352, column: 56, scope: !1263)
!1268 = !DILocation(line: 352, column: 17, scope: !1263)
!1269 = !DILocation(line: 352, column: 63, scope: !1263)
!1270 = !DILocation(line: 352, column: 17, scope: !1255)
!1271 = !DILocation(line: 353, column: 22, scope: !1263)
!1272 = !DILocation(line: 353, column: 15, scope: !1263)
!1273 = !DILocation(line: 352, column: 66, scope: !1263)
!1274 = !DILocation(line: 354, column: 16, scope: !1275)
!1275 = distinct !DILexicalBlock(scope: !1205, file: !1, line: 354, column: 15)
!1276 = !DILocation(line: 354, column: 24, scope: !1275)
!1277 = !DILocation(line: 354, column: 15, scope: !1205)
!1278 = !DILocation(line: 355, column: 13, scope: !1275)
!1279 = !DILocation(line: 356, column: 11, scope: !1205)
!1280 = !DILocation(line: 356, column: 25, scope: !1205)
!1281 = !DILocation(line: 356, column: 28, scope: !1205)
!1282 = distinct !{!1282, !1200, !1283}
!1283 = !DILocation(line: 357, column: 9, scope: !1196)
!1284 = !DILocation(line: 358, column: 7, scope: !1196)
!1285 = !DILocation(line: 330, column: 47, scope: !1190)
!1286 = !DILocation(line: 330, column: 7, scope: !1190)
!1287 = distinct !{!1287, !1194, !1288}
!1288 = !DILocation(line: 358, column: 7, scope: !1186)
!1289 = !DILocation(line: 359, column: 13, scope: !1187)
!1290 = !DILocation(line: 359, column: 12, scope: !1187)
!1291 = !DILocation(line: 360, column: 13, scope: !1292)
!1292 = distinct !DILexicalBlock(scope: !1187, file: !1, line: 360, column: 7)
!1293 = !DILocation(line: 360, column: 12, scope: !1292)
!1294 = !DILocation(line: 360, column: 17, scope: !1295)
!1295 = distinct !DILexicalBlock(scope: !1292, file: !1, line: 360, column: 7)
!1296 = !DILocation(line: 360, column: 31, scope: !1295)
!1297 = !DILocation(line: 360, column: 19, scope: !1295)
!1298 = !DILocation(line: 360, column: 7, scope: !1292)
!1299 = !DILocation(line: 361, column: 13, scope: !1300)
!1300 = distinct !DILexicalBlock(scope: !1295, file: !1, line: 361, column: 13)
!1301 = !DILocation(line: 361, column: 21, scope: !1300)
!1302 = !DILocation(line: 361, column: 35, scope: !1300)
!1303 = !DILocation(line: 361, column: 19, scope: !1300)
!1304 = !DILocation(line: 361, column: 13, scope: !1295)
!1305 = !DILocation(line: 362, column: 17, scope: !1300)
!1306 = !DILocation(line: 362, column: 31, scope: !1300)
!1307 = !DILocation(line: 362, column: 16, scope: !1300)
!1308 = !DILocation(line: 362, column: 11, scope: !1300)
!1309 = !DILocation(line: 361, column: 36, scope: !1300)
!1310 = !DILocation(line: 360, column: 48, scope: !1295)
!1311 = !DILocation(line: 360, column: 7, scope: !1295)
!1312 = distinct !{!1312, !1298, !1313}
!1313 = !DILocation(line: 362, column: 32, scope: !1292)
!1314 = !DILocation(line: 363, column: 55, scope: !1187)
!1315 = !DILocation(line: 363, column: 32, scope: !1187)
!1316 = !DILocation(line: 363, column: 21, scope: !1187)
!1317 = !DILocation(line: 363, column: 20, scope: !1187)
!1318 = !DILocation(line: 364, column: 14, scope: !1187)
!1319 = !DILocation(line: 364, column: 7, scope: !1187)
!1320 = !DILocation(line: 366, column: 38, scope: !1112)
!1321 = !DILocation(line: 366, column: 44, scope: !1112)
!1322 = !DILocation(line: 366, column: 14, scope: !1112)
!1323 = !DILocation(line: 366, column: 13, scope: !1112)
!1324 = !DILocalVariable(name: "depth_map", scope: !1325, file: !1, line: 373, type: !524)
!1325 = distinct !DILexicalBlock(scope: !1326, file: !1, line: 371, column: 5)
!1326 = distinct !DILexicalBlock(scope: !1112, file: !1, line: 369, column: 7)
!1327 = !DILocation(line: 373, column: 10, scope: !1325)
!1328 = !DILocation(line: 378, column: 28, scope: !1325)
!1329 = !DILocation(line: 378, column: 17, scope: !1325)
!1330 = !DILocation(line: 378, column: 16, scope: !1325)
!1331 = !DILocation(line: 379, column: 11, scope: !1332)
!1332 = distinct !DILexicalBlock(scope: !1325, file: !1, line: 379, column: 11)
!1333 = !DILocation(line: 379, column: 21, scope: !1332)
!1334 = !DILocation(line: 379, column: 11, scope: !1325)
!1335 = !DILocalVariable(name: "message", scope: !1336, file: !1, line: 380, type: !576)
!1336 = distinct !DILexicalBlock(scope: !1332, file: !1, line: 380, column: 9)
!1337 = !DILocation(line: 380, column: 9, scope: !1336)
!1338 = !DILocalVariable(name: "exception", scope: !1336, file: !1, line: 380, type: !673)
!1339 = !DILocation(line: 381, column: 13, scope: !1340)
!1340 = distinct !DILexicalBlock(scope: !1325, file: !1, line: 381, column: 7)
!1341 = !DILocation(line: 381, column: 12, scope: !1340)
!1342 = !DILocation(line: 381, column: 17, scope: !1343)
!1343 = distinct !DILexicalBlock(scope: !1340, file: !1, line: 381, column: 7)
!1344 = !DILocation(line: 381, column: 19, scope: !1343)
!1345 = !DILocation(line: 381, column: 7, scope: !1340)
!1346 = !DILocalVariable(name: "depth", scope: !1347, file: !1, line: 384, type: !5)
!1347 = distinct !DILexicalBlock(scope: !1343, file: !1, line: 382, column: 7)
!1348 = !DILocation(line: 384, column: 11, scope: !1347)
!1349 = !DILocation(line: 386, column: 19, scope: !1350)
!1350 = distinct !DILexicalBlock(scope: !1347, file: !1, line: 386, column: 9)
!1351 = !DILocation(line: 386, column: 14, scope: !1350)
!1352 = !DILocation(line: 386, column: 23, scope: !1353)
!1353 = distinct !DILexicalBlock(scope: !1350, file: !1, line: 386, column: 9)
!1354 = !DILocation(line: 386, column: 29, scope: !1353)
!1355 = !DILocation(line: 386, column: 9, scope: !1350)
!1356 = !DILocalVariable(name: "pixel", scope: !1357, file: !1, line: 389, type: !516)
!1357 = distinct !DILexicalBlock(scope: !1353, file: !1, line: 387, column: 9)
!1358 = !DILocation(line: 389, column: 13, scope: !1357)
!1359 = !DILocalVariable(name: "range", scope: !1357, file: !1, line: 392, type: !735)
!1360 = !DILocation(line: 392, column: 13, scope: !1357)
!1361 = !DILocation(line: 394, column: 33, scope: !1357)
!1362 = !DILocation(line: 394, column: 17, scope: !1357)
!1363 = !DILocation(line: 394, column: 16, scope: !1357)
!1364 = !DILocation(line: 395, column: 27, scope: !1357)
!1365 = !DILocation(line: 395, column: 17, scope: !1357)
!1366 = !DILocation(line: 395, column: 16, scope: !1357)
!1367 = !DILocation(line: 396, column: 15, scope: !1368)
!1368 = distinct !DILexicalBlock(scope: !1357, file: !1, line: 396, column: 15)
!1369 = !DILocation(line: 396, column: 60, scope: !1368)
!1370 = !DILocation(line: 396, column: 66, scope: !1368)
!1371 = !DILocation(line: 396, column: 42, scope: !1368)
!1372 = !DILocation(line: 396, column: 73, scope: !1368)
!1373 = !DILocation(line: 396, column: 24, scope: !1368)
!1374 = !DILocation(line: 396, column: 21, scope: !1368)
!1375 = !DILocation(line: 396, column: 15, scope: !1357)
!1376 = !DILocation(line: 397, column: 13, scope: !1368)
!1377 = !DILocation(line: 398, column: 9, scope: !1357)
!1378 = !DILocation(line: 386, column: 62, scope: !1353)
!1379 = !DILocation(line: 386, column: 9, scope: !1353)
!1380 = distinct !{!1380, !1355, !1381}
!1381 = !DILocation(line: 398, column: 9, scope: !1350)
!1382 = !DILocation(line: 399, column: 22, scope: !1347)
!1383 = !DILocation(line: 399, column: 9, scope: !1347)
!1384 = !DILocation(line: 399, column: 19, scope: !1347)
!1385 = !DILocation(line: 399, column: 21, scope: !1347)
!1386 = !DILocation(line: 400, column: 7, scope: !1347)
!1387 = !DILocation(line: 381, column: 41, scope: !1343)
!1388 = !DILocation(line: 381, column: 7, scope: !1343)
!1389 = distinct !{!1389, !1345, !1390}
!1390 = !DILocation(line: 400, column: 7, scope: !1340)
!1391 = !DILocation(line: 405, column: 13, scope: !1392)
!1392 = distinct !DILexicalBlock(scope: !1325, file: !1, line: 405, column: 7)
!1393 = !DILocation(line: 405, column: 12, scope: !1392)
!1394 = !DILocation(line: 405, column: 17, scope: !1395)
!1395 = distinct !DILexicalBlock(scope: !1392, file: !1, line: 405, column: 7)
!1396 = !DILocation(line: 405, column: 31, scope: !1395)
!1397 = !DILocation(line: 405, column: 38, scope: !1395)
!1398 = !DILocation(line: 405, column: 19, scope: !1395)
!1399 = !DILocation(line: 405, column: 7, scope: !1392)
!1400 = !DILocalVariable(name: "id", scope: !1401, file: !1, line: 408, type: !1197)
!1401 = distinct !DILexicalBlock(scope: !1395, file: !1, line: 406, column: 7)
!1402 = !DILocation(line: 408, column: 11, scope: !1401)
!1403 = !DILocation(line: 408, column: 16, scope: !1401)
!1404 = !DILocalVariable(name: "indexes", scope: !1401, file: !1, line: 411, type: !881)
!1405 = !DILocation(line: 411, column: 21, scope: !1401)
!1406 = !DILocalVariable(name: "p", scope: !1401, file: !1, line: 414, type: !884)
!1407 = !DILocation(line: 414, column: 21, scope: !1401)
!1408 = !DILocalVariable(name: "x", scope: !1401, file: !1, line: 417, type: !505)
!1409 = !DILocation(line: 417, column: 11, scope: !1401)
!1410 = !DILocation(line: 419, column: 13, scope: !1411)
!1411 = distinct !DILexicalBlock(scope: !1401, file: !1, line: 419, column: 13)
!1412 = !DILocation(line: 419, column: 20, scope: !1411)
!1413 = !DILocation(line: 419, column: 13, scope: !1401)
!1414 = !DILocation(line: 420, column: 11, scope: !1411)
!1415 = !DILocation(line: 421, column: 37, scope: !1401)
!1416 = !DILocation(line: 421, column: 50, scope: !1401)
!1417 = !DILocation(line: 421, column: 52, scope: !1401)
!1418 = !DILocation(line: 421, column: 59, scope: !1401)
!1419 = !DILocation(line: 421, column: 69, scope: !1401)
!1420 = !DILocation(line: 421, column: 11, scope: !1401)
!1421 = !DILocation(line: 421, column: 10, scope: !1401)
!1422 = !DILocation(line: 422, column: 13, scope: !1423)
!1423 = distinct !DILexicalBlock(scope: !1401, file: !1, line: 422, column: 13)
!1424 = !DILocation(line: 422, column: 15, scope: !1423)
!1425 = !DILocation(line: 422, column: 13, scope: !1401)
!1426 = !DILocation(line: 423, column: 11, scope: !1423)
!1427 = !DILocation(line: 424, column: 47, scope: !1401)
!1428 = !DILocation(line: 424, column: 17, scope: !1401)
!1429 = !DILocation(line: 424, column: 16, scope: !1401)
!1430 = !DILocation(line: 425, column: 15, scope: !1431)
!1431 = distinct !DILexicalBlock(scope: !1401, file: !1, line: 425, column: 9)
!1432 = !DILocation(line: 425, column: 14, scope: !1431)
!1433 = !DILocation(line: 425, column: 19, scope: !1434)
!1434 = distinct !DILexicalBlock(scope: !1431, file: !1, line: 425, column: 9)
!1435 = !DILocation(line: 425, column: 33, scope: !1434)
!1436 = !DILocation(line: 425, column: 40, scope: !1434)
!1437 = !DILocation(line: 425, column: 21, scope: !1434)
!1438 = !DILocation(line: 425, column: 9, scope: !1431)
!1439 = !DILocalVariable(name: "pixel", scope: !1440, file: !1, line: 428, type: !516)
!1440 = distinct !DILexicalBlock(scope: !1434, file: !1, line: 426, column: 9)
!1441 = !DILocation(line: 428, column: 13, scope: !1440)
!1442 = !DILocation(line: 430, column: 16, scope: !1443)
!1443 = distinct !DILexicalBlock(scope: !1440, file: !1, line: 430, column: 15)
!1444 = !DILocation(line: 430, column: 24, scope: !1443)
!1445 = !DILocation(line: 430, column: 38, scope: !1443)
!1446 = !DILocation(line: 430, column: 15, scope: !1440)
!1447 = !DILocation(line: 432, column: 21, scope: !1448)
!1448 = distinct !DILexicalBlock(scope: !1443, file: !1, line: 431, column: 13)
!1449 = !DILocation(line: 432, column: 20, scope: !1448)
!1450 = !DILocation(line: 433, column: 19, scope: !1451)
!1451 = distinct !DILexicalBlock(scope: !1448, file: !1, line: 433, column: 19)
!1452 = !DILocation(line: 433, column: 47, scope: !1451)
!1453 = !DILocation(line: 433, column: 29, scope: !1451)
!1454 = !DILocation(line: 433, column: 57, scope: !1451)
!1455 = !DILocation(line: 433, column: 71, scope: !1451)
!1456 = !DILocation(line: 433, column: 55, scope: !1451)
!1457 = !DILocation(line: 433, column: 19, scope: !1448)
!1458 = !DILocation(line: 434, column: 35, scope: !1451)
!1459 = !DILocation(line: 434, column: 63, scope: !1451)
!1460 = !DILocation(line: 434, column: 45, scope: !1451)
!1461 = !DILocation(line: 434, column: 17, scope: !1451)
!1462 = !DILocation(line: 434, column: 31, scope: !1451)
!1463 = !DILocation(line: 434, column: 34, scope: !1451)
!1464 = !DILocation(line: 435, column: 13, scope: !1448)
!1465 = !DILocation(line: 436, column: 16, scope: !1466)
!1466 = distinct !DILexicalBlock(scope: !1440, file: !1, line: 436, column: 15)
!1467 = !DILocation(line: 436, column: 24, scope: !1466)
!1468 = !DILocation(line: 436, column: 40, scope: !1466)
!1469 = !DILocation(line: 436, column: 15, scope: !1440)
!1470 = !DILocation(line: 438, column: 21, scope: !1471)
!1471 = distinct !DILexicalBlock(scope: !1466, file: !1, line: 437, column: 13)
!1472 = !DILocation(line: 438, column: 20, scope: !1471)
!1473 = !DILocation(line: 439, column: 19, scope: !1474)
!1474 = distinct !DILexicalBlock(scope: !1471, file: !1, line: 439, column: 19)
!1475 = !DILocation(line: 439, column: 47, scope: !1474)
!1476 = !DILocation(line: 439, column: 29, scope: !1474)
!1477 = !DILocation(line: 439, column: 57, scope: !1474)
!1478 = !DILocation(line: 439, column: 71, scope: !1474)
!1479 = !DILocation(line: 439, column: 55, scope: !1474)
!1480 = !DILocation(line: 439, column: 19, scope: !1471)
!1481 = !DILocation(line: 440, column: 35, scope: !1474)
!1482 = !DILocation(line: 440, column: 63, scope: !1474)
!1483 = !DILocation(line: 440, column: 45, scope: !1474)
!1484 = !DILocation(line: 440, column: 17, scope: !1474)
!1485 = !DILocation(line: 440, column: 31, scope: !1474)
!1486 = !DILocation(line: 440, column: 34, scope: !1474)
!1487 = !DILocation(line: 441, column: 13, scope: !1471)
!1488 = !DILocation(line: 442, column: 16, scope: !1489)
!1489 = distinct !DILexicalBlock(scope: !1440, file: !1, line: 442, column: 15)
!1490 = !DILocation(line: 442, column: 24, scope: !1489)
!1491 = !DILocation(line: 442, column: 39, scope: !1489)
!1492 = !DILocation(line: 442, column: 15, scope: !1440)
!1493 = !DILocation(line: 444, column: 21, scope: !1494)
!1494 = distinct !DILexicalBlock(scope: !1489, file: !1, line: 443, column: 13)
!1495 = !DILocation(line: 444, column: 20, scope: !1494)
!1496 = !DILocation(line: 445, column: 19, scope: !1497)
!1497 = distinct !DILexicalBlock(scope: !1494, file: !1, line: 445, column: 19)
!1498 = !DILocation(line: 445, column: 47, scope: !1497)
!1499 = !DILocation(line: 445, column: 29, scope: !1497)
!1500 = !DILocation(line: 445, column: 57, scope: !1497)
!1501 = !DILocation(line: 445, column: 71, scope: !1497)
!1502 = !DILocation(line: 445, column: 55, scope: !1497)
!1503 = !DILocation(line: 445, column: 19, scope: !1494)
!1504 = !DILocation(line: 446, column: 35, scope: !1497)
!1505 = !DILocation(line: 446, column: 63, scope: !1497)
!1506 = !DILocation(line: 446, column: 45, scope: !1497)
!1507 = !DILocation(line: 446, column: 17, scope: !1497)
!1508 = !DILocation(line: 446, column: 31, scope: !1497)
!1509 = !DILocation(line: 446, column: 34, scope: !1497)
!1510 = !DILocation(line: 447, column: 13, scope: !1494)
!1511 = !DILocation(line: 448, column: 17, scope: !1512)
!1512 = distinct !DILexicalBlock(scope: !1440, file: !1, line: 448, column: 15)
!1513 = !DILocation(line: 448, column: 25, scope: !1512)
!1514 = !DILocation(line: 448, column: 43, scope: !1512)
!1515 = !DILocation(line: 448, column: 49, scope: !1512)
!1516 = !DILocation(line: 449, column: 17, scope: !1512)
!1517 = !DILocation(line: 449, column: 24, scope: !1512)
!1518 = !DILocation(line: 449, column: 30, scope: !1512)
!1519 = !DILocation(line: 448, column: 15, scope: !1440)
!1520 = !DILocation(line: 451, column: 21, scope: !1521)
!1521 = distinct !DILexicalBlock(scope: !1512, file: !1, line: 450, column: 13)
!1522 = !DILocation(line: 451, column: 20, scope: !1521)
!1523 = !DILocation(line: 452, column: 19, scope: !1524)
!1524 = distinct !DILexicalBlock(scope: !1521, file: !1, line: 452, column: 19)
!1525 = !DILocation(line: 452, column: 47, scope: !1524)
!1526 = !DILocation(line: 452, column: 29, scope: !1524)
!1527 = !DILocation(line: 452, column: 57, scope: !1524)
!1528 = !DILocation(line: 452, column: 71, scope: !1524)
!1529 = !DILocation(line: 452, column: 55, scope: !1524)
!1530 = !DILocation(line: 452, column: 19, scope: !1521)
!1531 = !DILocation(line: 453, column: 35, scope: !1524)
!1532 = !DILocation(line: 453, column: 63, scope: !1524)
!1533 = !DILocation(line: 453, column: 45, scope: !1524)
!1534 = !DILocation(line: 453, column: 17, scope: !1524)
!1535 = !DILocation(line: 453, column: 31, scope: !1524)
!1536 = !DILocation(line: 453, column: 34, scope: !1524)
!1537 = !DILocation(line: 454, column: 13, scope: !1521)
!1538 = !DILocation(line: 455, column: 17, scope: !1539)
!1539 = distinct !DILexicalBlock(scope: !1440, file: !1, line: 455, column: 15)
!1540 = !DILocation(line: 455, column: 25, scope: !1539)
!1541 = !DILocation(line: 455, column: 41, scope: !1539)
!1542 = !DILocation(line: 455, column: 47, scope: !1539)
!1543 = !DILocation(line: 456, column: 16, scope: !1539)
!1544 = !DILocation(line: 456, column: 23, scope: !1539)
!1545 = !DILocation(line: 456, column: 34, scope: !1539)
!1546 = !DILocation(line: 455, column: 15, scope: !1440)
!1547 = !DILocation(line: 458, column: 21, scope: !1548)
!1548 = distinct !DILexicalBlock(scope: !1539, file: !1, line: 457, column: 13)
!1549 = !DILocation(line: 458, column: 20, scope: !1548)
!1550 = !DILocation(line: 459, column: 19, scope: !1551)
!1551 = distinct !DILexicalBlock(scope: !1548, file: !1, line: 459, column: 19)
!1552 = !DILocation(line: 459, column: 47, scope: !1551)
!1553 = !DILocation(line: 459, column: 29, scope: !1551)
!1554 = !DILocation(line: 459, column: 57, scope: !1551)
!1555 = !DILocation(line: 459, column: 71, scope: !1551)
!1556 = !DILocation(line: 459, column: 55, scope: !1551)
!1557 = !DILocation(line: 459, column: 19, scope: !1548)
!1558 = !DILocation(line: 460, column: 35, scope: !1551)
!1559 = !DILocation(line: 460, column: 63, scope: !1551)
!1560 = !DILocation(line: 460, column: 45, scope: !1551)
!1561 = !DILocation(line: 460, column: 17, scope: !1551)
!1562 = !DILocation(line: 460, column: 31, scope: !1551)
!1563 = !DILocation(line: 460, column: 34, scope: !1551)
!1564 = !DILocation(line: 461, column: 13, scope: !1548)
!1565 = !DILocation(line: 462, column: 12, scope: !1440)
!1566 = !DILocation(line: 463, column: 9, scope: !1440)
!1567 = !DILocation(line: 425, column: 50, scope: !1434)
!1568 = !DILocation(line: 425, column: 9, scope: !1434)
!1569 = distinct !{!1569, !1438, !1570}
!1570 = !DILocation(line: 463, column: 9, scope: !1431)
!1571 = !DILocation(line: 464, column: 13, scope: !1572)
!1572 = distinct !DILexicalBlock(scope: !1401, file: !1, line: 464, column: 13)
!1573 = !DILocation(line: 464, column: 27, scope: !1572)
!1574 = !DILocation(line: 464, column: 31, scope: !1572)
!1575 = !DILocation(line: 464, column: 13, scope: !1401)
!1576 = !DILocation(line: 465, column: 17, scope: !1572)
!1577 = !DILocation(line: 465, column: 11, scope: !1572)
!1578 = !DILocation(line: 466, column: 7, scope: !1401)
!1579 = !DILocation(line: 405, column: 45, scope: !1395)
!1580 = !DILocation(line: 405, column: 7, scope: !1395)
!1581 = distinct !{!1581, !1399, !1582}
!1582 = !DILocation(line: 466, column: 7, scope: !1392)
!1583 = !DILocation(line: 467, column: 35, scope: !1325)
!1584 = !DILocation(line: 467, column: 18, scope: !1325)
!1585 = !DILocation(line: 467, column: 17, scope: !1325)
!1586 = !DILocation(line: 468, column: 13, scope: !1325)
!1587 = !DILocation(line: 468, column: 12, scope: !1325)
!1588 = !DILocation(line: 469, column: 13, scope: !1589)
!1589 = distinct !DILexicalBlock(scope: !1325, file: !1, line: 469, column: 7)
!1590 = !DILocation(line: 469, column: 12, scope: !1589)
!1591 = !DILocation(line: 469, column: 17, scope: !1592)
!1592 = distinct !DILexicalBlock(scope: !1589, file: !1, line: 469, column: 7)
!1593 = !DILocation(line: 469, column: 31, scope: !1592)
!1594 = !DILocation(line: 469, column: 19, scope: !1592)
!1595 = !DILocation(line: 469, column: 7, scope: !1589)
!1596 = !DILocation(line: 470, column: 13, scope: !1597)
!1597 = distinct !DILexicalBlock(scope: !1592, file: !1, line: 470, column: 13)
!1598 = !DILocation(line: 470, column: 21, scope: !1597)
!1599 = !DILocation(line: 470, column: 35, scope: !1597)
!1600 = !DILocation(line: 470, column: 19, scope: !1597)
!1601 = !DILocation(line: 470, column: 13, scope: !1592)
!1602 = !DILocation(line: 471, column: 17, scope: !1597)
!1603 = !DILocation(line: 471, column: 31, scope: !1597)
!1604 = !DILocation(line: 471, column: 16, scope: !1597)
!1605 = !DILocation(line: 471, column: 11, scope: !1597)
!1606 = !DILocation(line: 470, column: 36, scope: !1597)
!1607 = !DILocation(line: 469, column: 48, scope: !1592)
!1608 = !DILocation(line: 469, column: 7, scope: !1592)
!1609 = distinct !{!1609, !1595, !1610}
!1610 = !DILocation(line: 471, column: 32, scope: !1589)
!1611 = !DILocation(line: 472, column: 51, scope: !1325)
!1612 = !DILocation(line: 472, column: 28, scope: !1325)
!1613 = !DILocation(line: 472, column: 17, scope: !1325)
!1614 = !DILocation(line: 472, column: 16, scope: !1325)
!1615 = !DILocation(line: 473, column: 55, scope: !1325)
!1616 = !DILocation(line: 473, column: 32, scope: !1325)
!1617 = !DILocation(line: 473, column: 21, scope: !1325)
!1618 = !DILocation(line: 473, column: 20, scope: !1325)
!1619 = !DILocation(line: 474, column: 14, scope: !1325)
!1620 = !DILocation(line: 474, column: 7, scope: !1325)
!1621 = !DILocation(line: 546, column: 1, scope: !1112)
!1622 = distinct !DISubprogram(name: "GetOpenMPThreadId", scope: !1623, file: !1623, line: 117, type: !1624, scopeLine: 118, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !746)
!1623 = !DIFile(filename: "./magick/thread-private.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!1624 = !DISubroutineType(types: !1625)
!1625 = !{!525}
!1626 = !DILocation(line: 122, column: 3, scope: !1622)
!1627 = distinct !DISubprogram(name: "GetQuantumRange", scope: !1628, file: !1628, line: 91, type: !1629, scopeLine: 92, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !746)
!1628 = !DIFile(filename: "./magick/quantum-private.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!1629 = !DISubroutineType(types: !1630)
!1630 = !{!651, !1631}
!1631 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !522)
!1632 = !DILocalVariable(name: "depth", arg: 1, scope: !1627, file: !1628, line: 91, type: !1631)
!1633 = !DILocation(line: 91, column: 59, scope: !1627)
!1634 = !DILocalVariable(name: "one", scope: !1627, file: !1628, line: 94, type: !651)
!1635 = !DILocation(line: 94, column: 5, scope: !1627)
!1636 = !DILocation(line: 96, column: 6, scope: !1627)
!1637 = !DILocation(line: 97, column: 29, scope: !1627)
!1638 = !DILocation(line: 97, column: 37, scope: !1627)
!1639 = !DILocation(line: 97, column: 42, scope: !1627)
!1640 = !DILocation(line: 97, column: 33, scope: !1627)
!1641 = !DILocation(line: 97, column: 49, scope: !1627)
!1642 = !DILocation(line: 97, column: 57, scope: !1627)
!1643 = !DILocation(line: 97, column: 62, scope: !1627)
!1644 = !DILocation(line: 97, column: 53, scope: !1627)
!1645 = !DILocation(line: 97, column: 66, scope: !1627)
!1646 = !DILocation(line: 97, column: 46, scope: !1627)
!1647 = !DILocation(line: 97, column: 3, scope: !1627)
!1648 = distinct !DISubprogram(name: "IsPixelAtDepth", scope: !1649, file: !1649, line: 142, type: !1650, scopeLine: 144, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !746)
!1649 = !DIFile(filename: "./magick/pixel-accessor.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!1650 = !DISubroutineType(types: !1651)
!1651 = !{!544, !1652, !1653}
!1652 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !516)
!1653 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !735)
!1654 = !DILocalVariable(name: "pixel", arg: 1, scope: !1648, file: !1649, line: 142, type: !1652)
!1655 = !DILocation(line: 142, column: 62, scope: !1648)
!1656 = !DILocalVariable(name: "range", arg: 2, scope: !1648, file: !1649, line: 143, type: !1653)
!1657 = !DILocation(line: 143, column: 20, scope: !1648)
!1658 = !DILocalVariable(name: "quantum", scope: !1648, file: !1649, line: 146, type: !516)
!1659 = !DILocation(line: 146, column: 5, scope: !1648)
!1660 = !DILocation(line: 150, column: 24, scope: !1648)
!1661 = !DILocation(line: 150, column: 7, scope: !1648)
!1662 = !DILocation(line: 150, column: 30, scope: !1648)
!1663 = !DILocation(line: 150, column: 29, scope: !1648)
!1664 = !DILocation(line: 150, column: 36, scope: !1648)
!1665 = !DILocation(line: 150, column: 6, scope: !1648)
!1666 = !DILocation(line: 150, column: 49, scope: !1648)
!1667 = !DILocation(line: 149, column: 54, scope: !1648)
!1668 = !DILocation(line: 149, column: 53, scope: !1648)
!1669 = !DILocation(line: 149, column: 52, scope: !1648)
!1670 = !DILocation(line: 150, column: 57, scope: !1648)
!1671 = !DILocation(line: 150, column: 56, scope: !1648)
!1672 = !DILocation(line: 149, column: 22, scope: !1648)
!1673 = !DILocation(line: 150, column: 62, scope: !1648)
!1674 = !DILocation(line: 149, column: 11, scope: !1648)
!1675 = !DILocation(line: 149, column: 10, scope: !1648)
!1676 = !DILocation(line: 155, column: 10, scope: !1648)
!1677 = !DILocation(line: 155, column: 19, scope: !1648)
!1678 = !DILocation(line: 155, column: 16, scope: !1648)
!1679 = !DILocation(line: 155, column: 3, scope: !1648)
!1680 = distinct !DISubprogram(name: "ScaleAnyToQuantum", scope: !1628, file: !1628, line: 271, type: !1681, scopeLine: 273, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !746)
!1681 = !DISubroutineType(types: !1682)
!1682 = !{!516, !1653, !1653}
!1683 = !DILocalVariable(name: "quantum", arg: 1, scope: !1680, file: !1628, line: 271, type: !1653)
!1684 = !DILocation(line: 271, column: 58, scope: !1680)
!1685 = !DILocalVariable(name: "range", arg: 2, scope: !1680, file: !1628, line: 272, type: !1653)
!1686 = !DILocation(line: 272, column: 20, scope: !1680)
!1687 = !DILocation(line: 275, column: 52, scope: !1680)
!1688 = !DILocation(line: 275, column: 51, scope: !1680)
!1689 = !DILocation(line: 275, column: 61, scope: !1680)
!1690 = !DILocation(line: 275, column: 60, scope: !1680)
!1691 = !DILocation(line: 275, column: 21, scope: !1680)
!1692 = !DILocation(line: 275, column: 66, scope: !1680)
!1693 = !DILocation(line: 275, column: 10, scope: !1680)
!1694 = !DILocation(line: 275, column: 3, scope: !1680)
!1695 = distinct !DISubprogram(name: "ScaleQuantumToAny", scope: !1628, file: !1628, line: 281, type: !1696, scopeLine: 283, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !746)
!1696 = !DISubroutineType(types: !1697)
!1697 = !{!735, !1652, !1653}
!1698 = !DILocalVariable(name: "quantum", arg: 1, scope: !1695, file: !1628, line: 281, type: !1652)
!1699 = !DILocation(line: 281, column: 58, scope: !1695)
!1700 = !DILocalVariable(name: "range", arg: 2, scope: !1695, file: !1628, line: 282, type: !1653)
!1701 = !DILocation(line: 282, column: 20, scope: !1695)
!1702 = !DILocation(line: 284, column: 42, scope: !1695)
!1703 = !DILocation(line: 284, column: 25, scope: !1695)
!1704 = !DILocation(line: 284, column: 48, scope: !1695)
!1705 = !DILocation(line: 284, column: 47, scope: !1695)
!1706 = !DILocation(line: 284, column: 56, scope: !1695)
!1707 = !DILocation(line: 284, column: 24, scope: !1695)
!1708 = !DILocation(line: 284, column: 69, scope: !1695)
!1709 = !DILocation(line: 284, column: 10, scope: !1695)
!1710 = !DILocation(line: 284, column: 3, scope: !1695)
!1711 = distinct !DISubprogram(name: "ScaleQuantumToMap", scope: !1628, file: !1628, line: 408, type: !1712, scopeLine: 409, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !746)
!1712 = !DISubroutineType(types: !1713)
!1713 = !{!5, !1652}
!1714 = !DILocalVariable(name: "quantum", arg: 1, scope: !1711, file: !1628, line: 408, type: !1652)
!1715 = !DILocation(line: 408, column: 60, scope: !1711)
!1716 = !DILocation(line: 410, column: 7, scope: !1717)
!1717 = distinct !DILexicalBlock(scope: !1711, file: !1628, line: 410, column: 7)
!1718 = !DILocation(line: 410, column: 15, scope: !1717)
!1719 = !DILocation(line: 410, column: 7, scope: !1711)
!1720 = !DILocation(line: 411, column: 5, scope: !1717)
!1721 = !DILocation(line: 413, column: 25, scope: !1711)
!1722 = !DILocation(line: 413, column: 10, scope: !1711)
!1723 = !DILocation(line: 413, column: 3, scope: !1711)
!1724 = !DILocation(line: 419, column: 1, scope: !1711)
!1725 = distinct !DISubprogram(name: "GetImageQuantumDepth", scope: !1, file: !1, line: 583, type: !1726, scopeLine: 585, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !746)
!1726 = !DISubroutineType(types: !1727)
!1727 = !{!522, !743, !1728}
!1728 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !544)
!1729 = !DILocalVariable(name: "image", arg: 1, scope: !1725, file: !1, line: 583, type: !743)
!1730 = !DILocation(line: 583, column: 55, scope: !1725)
!1731 = !DILocalVariable(name: "constrain", arg: 2, scope: !1725, file: !1, line: 584, type: !1728)
!1732 = !DILocation(line: 584, column: 27, scope: !1725)
!1733 = !DILocalVariable(name: "depth", scope: !1725, file: !1, line: 587, type: !522)
!1734 = !DILocation(line: 587, column: 5, scope: !1725)
!1735 = !DILocation(line: 589, column: 9, scope: !1725)
!1736 = !DILocation(line: 589, column: 16, scope: !1725)
!1737 = !DILocation(line: 589, column: 8, scope: !1725)
!1738 = !DILocation(line: 590, column: 7, scope: !1739)
!1739 = distinct !DILexicalBlock(scope: !1725, file: !1, line: 590, column: 7)
!1740 = !DILocation(line: 590, column: 13, scope: !1739)
!1741 = !DILocation(line: 590, column: 7, scope: !1725)
!1742 = !DILocation(line: 591, column: 10, scope: !1739)
!1743 = !DILocation(line: 591, column: 5, scope: !1739)
!1744 = !DILocation(line: 593, column: 9, scope: !1745)
!1745 = distinct !DILexicalBlock(scope: !1739, file: !1, line: 593, column: 9)
!1746 = !DILocation(line: 593, column: 15, scope: !1745)
!1747 = !DILocation(line: 593, column: 9, scope: !1739)
!1748 = !DILocation(line: 594, column: 12, scope: !1745)
!1749 = !DILocation(line: 594, column: 7, scope: !1745)
!1750 = !DILocation(line: 596, column: 11, scope: !1751)
!1751 = distinct !DILexicalBlock(scope: !1745, file: !1, line: 596, column: 11)
!1752 = !DILocation(line: 596, column: 17, scope: !1751)
!1753 = !DILocation(line: 596, column: 11, scope: !1745)
!1754 = !DILocation(line: 597, column: 14, scope: !1751)
!1755 = !DILocation(line: 597, column: 9, scope: !1751)
!1756 = !DILocation(line: 599, column: 13, scope: !1757)
!1757 = distinct !DILexicalBlock(scope: !1751, file: !1, line: 599, column: 13)
!1758 = !DILocation(line: 599, column: 19, scope: !1757)
!1759 = !DILocation(line: 599, column: 13, scope: !1751)
!1760 = !DILocation(line: 600, column: 16, scope: !1757)
!1761 = !DILocation(line: 600, column: 11, scope: !1757)
!1762 = !DILocation(line: 601, column: 7, scope: !1763)
!1763 = distinct !DILexicalBlock(scope: !1725, file: !1, line: 601, column: 7)
!1764 = !DILocation(line: 601, column: 17, scope: !1763)
!1765 = !DILocation(line: 601, column: 7, scope: !1725)
!1766 = !DILocation(line: 602, column: 39, scope: !1763)
!1767 = !DILocation(line: 602, column: 30, scope: !1763)
!1768 = !DILocation(line: 602, column: 20, scope: !1763)
!1769 = !DILocation(line: 602, column: 11, scope: !1763)
!1770 = !DILocation(line: 602, column: 10, scope: !1763)
!1771 = !DILocation(line: 602, column: 5, scope: !1763)
!1772 = !DILocation(line: 603, column: 10, scope: !1725)
!1773 = !DILocation(line: 603, column: 3, scope: !1725)
!1774 = distinct !DISubprogram(name: "MagickMin", scope: !1, file: !1, line: 576, type: !1775, scopeLine: 577, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !746)
!1775 = !DISubroutineType(types: !1776)
!1776 = !{!529, !1777, !1777}
!1777 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !529)
!1778 = !DILocalVariable(name: "x", arg: 1, scope: !1774, file: !1, line: 576, type: !1777)
!1779 = !DILocation(line: 576, column: 45, scope: !1774)
!1780 = !DILocalVariable(name: "y", arg: 2, scope: !1774, file: !1, line: 576, type: !1777)
!1781 = !DILocation(line: 576, column: 60, scope: !1774)
!1782 = !DILocation(line: 578, column: 7, scope: !1783)
!1783 = distinct !DILexicalBlock(scope: !1774, file: !1, line: 578, column: 7)
!1784 = !DILocation(line: 578, column: 11, scope: !1783)
!1785 = !DILocation(line: 578, column: 9, scope: !1783)
!1786 = !DILocation(line: 578, column: 7, scope: !1774)
!1787 = !DILocation(line: 579, column: 12, scope: !1783)
!1788 = !DILocation(line: 579, column: 5, scope: !1783)
!1789 = !DILocation(line: 580, column: 10, scope: !1774)
!1790 = !DILocation(line: 580, column: 3, scope: !1774)
!1791 = !DILocation(line: 581, column: 1, scope: !1774)
!1792 = distinct !DISubprogram(name: "GetImageType", scope: !1, file: !1, line: 638, type: !1793, scopeLine: 639, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !746)
!1793 = !DISubroutineType(types: !1794)
!1794 = !{!720, !743, !745}
!1795 = !DILocalVariable(name: "image", arg: 1, scope: !1792, file: !1, line: 638, type: !743)
!1796 = !DILocation(line: 638, column: 50, scope: !1792)
