; ModuleID = 'magick/configure.c'
source_filename = "magick/configure.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.SemaphoreInfo = type opaque
%struct._LinkedListInfo = type opaque
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct._ConfigureMapInfo = type { i8*, i8* }
%struct._ConfigureInfo = type { i8*, i8*, i8*, i32, i32, %struct._ConfigureInfo*, %struct._ConfigureInfo*, i64 }
%struct._StringInfo = type { [4096 x i8], i8*, i64, i64 }
%struct._ExceptionInfo = type { i32, i32, i8*, i8*, i8*, i32, %struct.SemaphoreInfo*, i64 }

@configure_semaphore = internal global %struct.SemaphoreInfo* null, align 8, !dbg !0
@configure_cache = internal global %struct._LinkedListInfo* null, align 8, !dbg !236
@.str = private unnamed_addr constant [2 x i8] c"*\00", align 1
@.str.1 = private unnamed_addr constant [19 x i8] c"magick/configure.c\00", align 1
@.str.2 = private unnamed_addr constant [1 x i8] zeroinitializer, align 1
@.str.3 = private unnamed_addr constant [3 x i8] c"%s\00", align 1
@.str.4 = private unnamed_addr constant [5 x i8] c"%s%s\00", align 1

!70 = !DIEnumerator(name: "StreamFatalError", value: 740, isUnsigned: true)
!71 = !DIEnumerator(name: "CacheFatalError", value: 745, isUnsigned: true)
!72 = !DIEnumerator(name: "CoderFatalError", value: 750, isUnsigned: true)
!73 = !DIEnumerator(name: "FilterFatalError", value: 752, isUnsigned: true)
!74 = !DIEnumerator(name: "ModuleFatalError", value: 755, isUnsigned: true)
!75 = !DIEnumerator(name: "DrawFatalError", value: 760, isUnsigned: true)
!76 = !DIEnumerator(name: "ImageFatalError", value: 765, isUnsigned: true)
!77 = !DIEnumerator(name: "WandFatalError", value: 770, isUnsigned: true)
!78 = !DIEnumerator(name: "RandomFatalError", value: 775, isUnsigned: true)
!79 = !DIEnumerator(name: "XServerFatalError", value: 780, isUnsigned: true)
!80 = !DIEnumerator(name: "MonitorFatalError", value: 785, isUnsigned: true)
!81 = !DIEnumerator(name: "RegistryFatalError", value: 790, isUnsigned: true)
!82 = !DIEnumerator(name: "ConfigureFatalError", value: 795, isUnsigned: true)
!83 = !DIEnumerator(name: "PolicyFatalError", value: 799, isUnsigned: true)
!84 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !85, line: 34, baseType: !7, size: 32, elements: !86)
!85 = !DIFile(filename: "./magick/log.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!86 = !{!87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108}
!87 = !DIEnumerator(name: "UndefinedEvents", value: 0, isUnsigned: true)
!88 = !DIEnumerator(name: "NoEvents", value: 0, isUnsigned: true)
!89 = !DIEnumerator(name: "TraceEvent", value: 1, isUnsigned: true)
!90 = !DIEnumerator(name: "AnnotateEvent", value: 2, isUnsigned: true)
!91 = !DIEnumerator(name: "BlobEvent", value: 4, isUnsigned: true)
!92 = !DIEnumerator(name: "CacheEvent", value: 8, isUnsigned: true)
!93 = !DIEnumerator(name: "CoderEvent", value: 16, isUnsigned: true)
!94 = !DIEnumerator(name: "ConfigureEvent", value: 32, isUnsigned: true)
!95 = !DIEnumerator(name: "DeprecateEvent", value: 64, isUnsigned: true)
!96 = !DIEnumerator(name: "DrawEvent", value: 128, isUnsigned: true)
!97 = !DIEnumerator(name: "ExceptionEvent", value: 256, isUnsigned: true)
!98 = !DIEnumerator(name: "ImageEvent", value: 512, isUnsigned: true)
!99 = !DIEnumerator(name: "LocaleEvent", value: 1024, isUnsigned: true)
!100 = !DIEnumerator(name: "ModuleEvent", value: 2048, isUnsigned: true)
!101 = !DIEnumerator(name: "PolicyEvent", value: 4096, isUnsigned: true)
!102 = !DIEnumerator(name: "ResourceEvent", value: 8192, isUnsigned: true)
!103 = !DIEnumerator(name: "TransformEvent", value: 16384, isUnsigned: true)
!104 = !DIEnumerator(name: "UserEvent", value: 36864, isUnsigned: true)
!105 = !DIEnumerator(name: "WandEvent", value: 65536, isUnsigned: true)
!106 = !DIEnumerator(name: "X11Event", value: 131072, isUnsigned: true)
!107 = !DIEnumerator(name: "AccelerateEvent", value: 262144, isUnsigned: true)
!108 = !DIEnumerator(name: "AllEvents", value: 2147483647, isUnsigned: true)
!109 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !110, line: 25, baseType: !7, size: 32, elements: !111)
!110 = !DIFile(filename: "./magick/utility.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!111 = !{!112, !113, !114, !115, !116, !117, !118, !119, !120}
!112 = !DIEnumerator(name: "UndefinedPath", value: 0, isUnsigned: true)
!113 = !DIEnumerator(name: "MagickPath", value: 1, isUnsigned: true)
!114 = !DIEnumerator(name: "RootPath", value: 2, isUnsigned: true)
!115 = !DIEnumerator(name: "HeadPath", value: 3, isUnsigned: true)
!116 = !DIEnumerator(name: "TailPath", value: 4, isUnsigned: true)
!117 = !DIEnumerator(name: "BasePath", value: 5, isUnsigned: true)
!118 = !DIEnumerator(name: "ExtensionPath", value: 6, isUnsigned: true)
!119 = !DIEnumerator(name: "SubimagePath", value: 7, isUnsigned: true)
!120 = !DIEnumerator(name: "CanonicalPath", value: 8, isUnsigned: true)
!121 = !{!122, !126, !127, !131, !152, !154, !151, !155, !149, !156, !138, !157, !171, !229, !179, !232, !234}
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "SemaphoreInfo", file: !124, line: 26, baseType: !125)
!124 = !DIFile(filename: "./magick/semaphore.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!125 = !DICompositeType(tag: DW_TAG_structure_type, name: "SemaphoreInfo", file: !124, line: 25, flags: DIFlagFwdDecl)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "LinkedListInfo", file: !129, line: 34, baseType: !130)
!129 = !DIFile(filename: "./magick/hashmap.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!130 = !DICompositeType(tag: DW_TAG_structure_type, name: "_LinkedListInfo", file: !129, line: 33, flags: DIFlagFwdDecl)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !133)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "ConfigureInfo", file: !134, line: 44, baseType: !135)
!134 = !DIFile(filename: "./magick/configure.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ConfigureInfo", file: !134, line: 27, size: 448, elements: !136)
!136 = !{!137, !140, !141, !142, !144, !145, !147, !148}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !135, file: !134, line: 30, baseType: !138, size: 64)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !135, file: !134, line: 31, baseType: !138, size: 64, offset: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !135, file: !134, line: 32, baseType: !138, size: 64, offset: 128)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "exempt", scope: !135, file: !134, line: 35, baseType: !143, size: 32, offset: 192)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickBooleanType", file: !6, line: 215, baseType: !5)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "stealth", scope: !135, file: !134, line: 36, baseType: !143, size: 32, offset: 224)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !135, file: !134, line: 39, baseType: !146, size: 64, offset: 256)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !135, file: !134, line: 40, baseType: !146, size: 64, offset: 320)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !135, file: !134, line: 43, baseType: !149, size: 64, offset: 384)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !150, line: 46, baseType: !151)
!150 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!151 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !139)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "StringInfo", file: !159, line: 40, baseType: !160)
!159 = !DIFile(filename: "./magick/string_.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_StringInfo", file: !159, line: 29, size: 32960, elements: !161)
!161 = !{!162, !166, !169, !170}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !160, file: !159, line: 32, baseType: !163, size: 32768)
!163 = !DICompositeType(tag: DW_TAG_array_type, baseType: !139, size: 32768, elements: !164)
!164 = !{!165}
!165 = !DISubrange(count: 4096)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "datum", scope: !160, file: !159, line: 35, baseType: !167, size: 64, offset: 32768)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !160, file: !159, line: 38, baseType: !149, size: 64, offset: 32832)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !160, file: !159, line: 39, baseType: !149, size: 64, offset: 32896)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!172 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !173)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !174, line: 7, baseType: !175)
!174 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !176, line: 49, size: 1728, elements: !177)
!176 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!177 = !{!178, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !194, !196, !197, !198, !202, !204, !206, !210, !213, !215, !218, !221, !222, !223, !224, !225}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !175, file: !176, line: 51, baseType: !179, size: 32)
!179 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !175, file: !176, line: 54, baseType: !138, size: 64, offset: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !175, file: !176, line: 55, baseType: !138, size: 64, offset: 128)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !175, file: !176, line: 56, baseType: !138, size: 64, offset: 192)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !175, file: !176, line: 57, baseType: !138, size: 64, offset: 256)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !175, file: !176, line: 58, baseType: !138, size: 64, offset: 320)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !175, file: !176, line: 59, baseType: !138, size: 64, offset: 384)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !175, file: !176, line: 60, baseType: !138, size: 64, offset: 448)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !175, file: !176, line: 61, baseType: !138, size: 64, offset: 512)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !175, file: !176, line: 64, baseType: !138, size: 64, offset: 576)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !175, file: !176, line: 65, baseType: !138, size: 64, offset: 640)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !175, file: !176, line: 66, baseType: !138, size: 64, offset: 704)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !175, file: !176, line: 68, baseType: !192, size: 64, offset: 768)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !176, line: 36, flags: DIFlagFwdDecl)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !175, file: !176, line: 70, baseType: !195, size: 64, offset: 832)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !175, file: !176, line: 72, baseType: !179, size: 32, offset: 896)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !175, file: !176, line: 73, baseType: !179, size: 32, offset: 928)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !175, file: !176, line: 74, baseType: !199, size: 64, offset: 960)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !200, line: 152, baseType: !201)
!200 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!201 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !175, file: !176, line: 77, baseType: !203, size: 16, offset: 1024)
!203 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !175, file: !176, line: 78, baseType: !205, size: 8, offset: 1040)
!205 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !175, file: !176, line: 79, baseType: !207, size: 8, offset: 1048)
!207 = !DICompositeType(tag: DW_TAG_array_type, baseType: !139, size: 8, elements: !208)
!208 = !{!209}
!209 = !DISubrange(count: 1)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !175, file: !176, line: 81, baseType: !211, size: 64, offset: 1088)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !176, line: 43, baseType: null)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !175, file: !176, line: 89, baseType: !214, size: 64, offset: 1152)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !200, line: 153, baseType: !201)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !175, file: !176, line: 91, baseType: !216, size: 64, offset: 1216)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
!217 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !176, line: 37, flags: DIFlagFwdDecl)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !175, file: !176, line: 92, baseType: !219, size: 64, offset: 1280)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!220 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !176, line: 38, flags: DIFlagFwdDecl)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !175, file: !176, line: 93, baseType: !195, size: 64, offset: 1344)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !175, file: !176, line: 94, baseType: !126, size: 64, offset: 1408)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !175, file: !176, line: 95, baseType: !149, size: 64, offset: 1472)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !175, file: !176, line: 96, baseType: !179, size: 32, offset: 1536)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !175, file: !176, line: 98, baseType: !226, size: 160, offset: 1568)
!226 = !DICompositeType(tag: DW_TAG_array_type, baseType: !139, size: 160, elements: !227)
!227 = !{!228}
!228 = !DISubrange(count: 20)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !230, line: 77, baseType: !231)
!230 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !200, line: 193, baseType: !201)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !158)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!235 = !{!0, !236, !238}
!236 = !DIGlobalVariableExpression(var: !237, expr: !DIExpression())
!237 = distinct !DIGlobalVariable(name: "configure_cache", scope: !2, file: !3, line: 113, type: !127, isLocal: true, isDefinition: true)
!238 = !DIGlobalVariableExpression(var: !239, expr: !DIExpression())
!239 = distinct !DIGlobalVariable(name: "ConfigureMap", scope: !2, file: !3, line: 105, type: !240, isLocal: true, isDefinition: true)
!240 = !DICompositeType(tag: DW_TAG_array_type, baseType: !241, size: 384, elements: !247)
!241 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !242)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "ConfigureMapInfo", file: !3, line: 99, baseType: !243)
!243 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ConfigureMapInfo", file: !3, line: 94, size: 128, elements: !244)
!244 = !{!245, !246}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !243, file: !3, line: 97, baseType: !152, size: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !243, file: !3, line: 98, baseType: !152, size: 64, offset: 64)
!247 = !{!248}
!248 = !DISubrange(count: 3)
!249 = !{i32 7, !"Dwarf Version", i32 4}
!250 = !{i32 2, !"Debug Info Version", i32 3}
!251 = !{i32 1, !"wchar_size", i32 4}
!252 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!253 = distinct !DISubprogram(name: "ConfigureComponentGenesis", scope: !3, file: !3, line: 237, type: !254, scopeLine: 238, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !256)
!254 = !DISubroutineType(types: !255)
!255 = !{!143}
!256 = !{}
!257 = !DILocation(line: 239, column: 7, scope: !258)
!258 = distinct !DILexicalBlock(scope: !253, file: !3, line: 239, column: 7)
!259 = !DILocation(line: 239, column: 27, scope: !258)
!260 = !DILocation(line: 239, column: 7, scope: !253)
!261 = !DILocation(line: 240, column: 25, scope: !258)
!262 = !DILocation(line: 240, column: 24, scope: !258)
!263 = !DILocation(line: 240, column: 5, scope: !258)
!264 = !DILocation(line: 241, column: 3, scope: !253)
!265 = distinct !DISubprogram(name: "ConfigureComponentTerminus", scope: !3, file: !3, line: 282, type: !266, scopeLine: 283, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !256)
!266 = !DISubroutineType(types: !267)
!267 = !{null}
!268 = !DILocation(line: 284, column: 7, scope: !269)
!269 = distinct !DILexicalBlock(scope: !265, file: !3, line: 284, column: 7)
!270 = !DILocation(line: 284, column: 27, scope: !269)
!271 = !DILocation(line: 284, column: 7, scope: !265)
!272 = !DILocation(line: 285, column: 5, scope: !269)
!273 = !DILocation(line: 286, column: 21, scope: !265)
!274 = !DILocation(line: 286, column: 3, scope: !265)
!275 = !DILocation(line: 287, column: 7, scope: !276)
!276 = distinct !DILexicalBlock(scope: !265, file: !3, line: 287, column: 7)
!277 = !DILocation(line: 287, column: 23, scope: !276)
!278 = !DILocation(line: 287, column: 7, scope: !265)
!279 = !DILocation(line: 288, column: 39, scope: !276)
!280 = !DILocation(line: 288, column: 21, scope: !276)
!281 = !DILocation(line: 288, column: 20, scope: !276)
!282 = !DILocation(line: 288, column: 5, scope: !276)
!283 = !DILocation(line: 289, column: 18, scope: !265)
!284 = !DILocation(line: 290, column: 23, scope: !265)
!285 = !DILocation(line: 290, column: 3, scope: !265)
!286 = !DILocation(line: 291, column: 3, scope: !265)
!287 = !DILocation(line: 292, column: 1, scope: !265)
!288 = distinct !DISubprogram(name: "DestroyConfigureElement", scope: !3, file: !3, line: 263, type: !289, scopeLine: 264, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !256)
!289 = !DISubroutineType(types: !290)
!290 = !{!126, !126}
!291 = !DILocalVariable(name: "configure_info", arg: 1, scope: !288, file: !3, line: 263, type: !126)
!292 = !DILocation(line: 263, column: 44, scope: !288)
!293 = !DILocalVariable(name: "p", scope: !288, file: !3, line: 266, type: !154)
!294 = !DILocation(line: 266, column: 6, scope: !288)
!295 = !DILocation(line: 268, column: 23, scope: !288)
!296 = !DILocation(line: 268, column: 5, scope: !288)
!297 = !DILocation(line: 268, column: 4, scope: !288)
!298 = !DILocation(line: 269, column: 7, scope: !299)
!299 = distinct !DILexicalBlock(scope: !288, file: !3, line: 269, column: 7)
!300 = !DILocation(line: 269, column: 10, scope: !299)
!301 = !DILocation(line: 269, column: 17, scope: !299)
!302 = !DILocation(line: 269, column: 7, scope: !288)
!303 = !DILocation(line: 271, column: 11, scope: !304)
!304 = distinct !DILexicalBlock(scope: !305, file: !3, line: 271, column: 11)
!305 = distinct !DILexicalBlock(scope: !299, file: !3, line: 270, column: 5)
!306 = !DILocation(line: 271, column: 14, scope: !304)
!307 = !DILocation(line: 271, column: 20, scope: !304)
!308 = !DILocation(line: 271, column: 11, scope: !305)
!309 = !DILocation(line: 272, column: 32, scope: !304)
!310 = !DILocation(line: 272, column: 35, scope: !304)
!311 = !DILocation(line: 272, column: 18, scope: !304)
!312 = !DILocation(line: 272, column: 9, scope: !304)
!313 = !DILocation(line: 272, column: 12, scope: !304)
!314 = !DILocation(line: 272, column: 17, scope: !304)
!315 = !DILocation(line: 273, column: 11, scope: !316)
!316 = distinct !DILexicalBlock(scope: !305, file: !3, line: 273, column: 11)
!317 = !DILocation(line: 273, column: 14, scope: !316)
!318 = !DILocation(line: 273, column: 19, scope: !316)
!319 = !DILocation(line: 273, column: 11, scope: !305)
!320 = !DILocation(line: 274, column: 31, scope: !316)
!321 = !DILocation(line: 274, column: 34, scope: !316)
!322 = !DILocation(line: 274, column: 17, scope: !316)
!323 = !DILocation(line: 274, column: 9, scope: !316)
!324 = !DILocation(line: 274, column: 12, scope: !316)
!325 = !DILocation(line: 274, column: 16, scope: !316)
!326 = !DILocation(line: 275, column: 11, scope: !327)
!327 = distinct !DILexicalBlock(scope: !305, file: !3, line: 275, column: 11)
!328 = !DILocation(line: 275, column: 14, scope: !327)
!329 = !DILocation(line: 275, column: 19, scope: !327)
!330 = !DILocation(line: 275, column: 11, scope: !305)
!331 = !DILocation(line: 276, column: 31, scope: !327)
!332 = !DILocation(line: 276, column: 34, scope: !327)
!333 = !DILocation(line: 276, column: 17, scope: !327)
!334 = !DILocation(line: 276, column: 9, scope: !327)
!335 = !DILocation(line: 276, column: 12, scope: !327)
!336 = !DILocation(line: 276, column: 16, scope: !327)
!337 = !DILocation(line: 277, column: 5, scope: !305)
!338 = !DILocation(line: 278, column: 46, scope: !288)
!339 = !DILocation(line: 278, column: 23, scope: !288)
!340 = !DILocation(line: 278, column: 5, scope: !288)
!341 = !DILocation(line: 278, column: 4, scope: !288)
!342 = !DILocation(line: 279, column: 3, scope: !288)
!343 = distinct !DISubprogram(name: "DestroyConfigureOptions", scope: !3, file: !3, line: 323, type: !344, scopeLine: 324, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !256)
!344 = !DISubroutineType(types: !345)
!345 = !{!127, !127}
!346 = !DILocalVariable(name: "options", arg: 1, scope: !343, file: !3, line: 323, type: !127)
!347 = !DILocation(line: 323, column: 70, scope: !343)
!348 = !DILocation(line: 326, column: 28, scope: !343)
!349 = !DILocation(line: 326, column: 10, scope: !343)
!350 = !DILocation(line: 326, column: 3, scope: !343)
!351 = distinct !DISubprogram(name: "DestroyOptions", scope: !3, file: !3, line: 318, type: !289, scopeLine: 319, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !256)
!352 = !DILocalVariable(name: "option", arg: 1, scope: !351, file: !3, line: 318, type: !126)
!353 = !DILocation(line: 318, column: 35, scope: !351)
!354 = !DILocation(line: 320, column: 43, scope: !351)
!355 = !DILocation(line: 320, column: 28, scope: !351)
!356 = !DILocation(line: 320, column: 10, scope: !351)
!357 = !DILocation(line: 320, column: 9, scope: !351)
!358 = !DILocation(line: 320, column: 3, scope: !351)
!359 = distinct !DISubprogram(name: "GetConfigureInfo", scope: !3, file: !3, line: 358, type: !360, scopeLine: 360, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !256)
!360 = !DISubroutineType(types: !361)
!361 = !{!131, !152, !362}
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionInfo", file: !6, line: 219, baseType: !364)
!364 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ExceptionInfo", file: !12, line: 102, size: 448, elements: !365)
!365 = !{!366, !368, !369, !370, !371, !372, !373, !374}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "severity", scope: !364, file: !12, line: 105, baseType: !367, size: 32)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionType", file: !12, line: 100, baseType: !11)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "error_number", scope: !364, file: !12, line: 108, baseType: !179, size: 32, offset: 32)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !364, file: !12, line: 111, baseType: !138, size: 64, offset: 64)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !364, file: !12, line: 112, baseType: !138, size: 64, offset: 128)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "exceptions", scope: !364, file: !12, line: 115, baseType: !126, size: 64, offset: 192)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "relinquish", scope: !364, file: !12, line: 118, baseType: !143, size: 32, offset: 256)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !364, file: !12, line: 121, baseType: !122, size: 64, offset: 320)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !364, file: !12, line: 124, baseType: !149, size: 64, offset: 384)
!375 = !DILocalVariable(name: "name", arg: 1, scope: !359, file: !3, line: 358, type: !152)
!376 = !DILocation(line: 358, column: 64, scope: !359)
!377 = !DILocalVariable(name: "exception", arg: 2, scope: !359, file: !3, line: 359, type: !362)
!378 = !DILocation(line: 359, column: 18, scope: !359)
!379 = !DILocalVariable(name: "p", scope: !359, file: !3, line: 362, type: !131)
!380 = !DILocation(line: 362, column: 6, scope: !359)
!381 = !DILocation(line: 365, column: 36, scope: !382)
!382 = distinct !DILexicalBlock(scope: !359, file: !3, line: 365, column: 7)
!383 = !DILocation(line: 365, column: 7, scope: !382)
!384 = !DILocation(line: 365, column: 47, scope: !382)
!385 = !DILocation(line: 365, column: 7, scope: !359)
!386 = !DILocation(line: 366, column: 5, scope: !382)
!387 = !DILocation(line: 370, column: 21, scope: !359)
!388 = !DILocation(line: 370, column: 3, scope: !359)
!389 = !DILocation(line: 371, column: 27, scope: !359)
!390 = !DILocation(line: 371, column: 3, scope: !359)
!391 = !DILocation(line: 372, column: 54, scope: !359)
!392 = !DILocation(line: 372, column: 29, scope: !359)
!393 = !DILocation(line: 372, column: 5, scope: !359)
!394 = !DILocation(line: 372, column: 4, scope: !359)
!395 = !DILocation(line: 373, column: 8, scope: !396)
!396 = distinct !DILexicalBlock(scope: !359, file: !3, line: 373, column: 7)
!397 = !DILocation(line: 373, column: 13, scope: !396)
!398 = !DILocation(line: 373, column: 37, scope: !396)
!399 = !DILocation(line: 373, column: 55, scope: !396)
!400 = !DILocation(line: 373, column: 41, scope: !396)
!401 = !DILocation(line: 373, column: 65, scope: !396)
!402 = !DILocation(line: 373, column: 7, scope: !359)
!403 = !DILocation(line: 375, column: 27, scope: !404)
!404 = distinct !DILexicalBlock(scope: !396, file: !3, line: 374, column: 5)
!405 = !DILocation(line: 375, column: 7, scope: !404)
!406 = !DILocation(line: 376, column: 14, scope: !404)
!407 = !DILocation(line: 376, column: 7, scope: !404)
!408 = !DILocation(line: 378, column: 3, scope: !359)
!409 = !DILocation(line: 378, column: 10, scope: !359)
!410 = !DILocation(line: 378, column: 12, scope: !359)
!411 = !DILocation(line: 380, column: 23, scope: !412)
!412 = distinct !DILexicalBlock(scope: !413, file: !3, line: 380, column: 9)
!413 = distinct !DILexicalBlock(scope: !359, file: !3, line: 379, column: 3)
!414 = !DILocation(line: 380, column: 28, scope: !412)
!415 = !DILocation(line: 380, column: 31, scope: !412)
!416 = !DILocation(line: 380, column: 9, scope: !412)
!417 = !DILocation(line: 380, column: 37, scope: !412)
!418 = !DILocation(line: 380, column: 9, scope: !413)
!419 = !DILocation(line: 381, column: 7, scope: !412)
!420 = !DILocation(line: 382, column: 56, scope: !413)
!421 = !DILocation(line: 382, column: 31, scope: !413)
!422 = !DILocation(line: 382, column: 7, scope: !413)
!423 = !DILocation(line: 382, column: 6, scope: !413)
!424 = distinct !{!424, !408, !425}
!425 = !DILocation(line: 383, column: 3, scope: !359)
!426 = !DILocation(line: 384, column: 7, scope: !427)
!427 = distinct !DILexicalBlock(scope: !359, file: !3, line: 384, column: 7)
!428 = !DILocation(line: 384, column: 9, scope: !427)
!429 = !DILocation(line: 384, column: 7, scope: !359)
!430 = !DILocation(line: 385, column: 36, scope: !427)
!431 = !DILocation(line: 386, column: 42, scope: !427)
!432 = !DILocation(line: 386, column: 58, scope: !427)
!433 = !DILocation(line: 386, column: 7, scope: !427)
!434 = !DILocation(line: 385, column: 12, scope: !427)
!435 = !DILocation(line: 385, column: 5, scope: !427)
!436 = !DILocation(line: 387, column: 23, scope: !359)
!437 = !DILocation(line: 387, column: 3, scope: !359)
!438 = !DILocation(line: 388, column: 10, scope: !359)
!439 = !DILocation(line: 388, column: 3, scope: !359)
!440 = !DILocation(line: 389, column: 1, scope: !359)
