; ModuleID = 'magick/cache.c'
source_filename = "magick/cache.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.SemaphoreInfo = type opaque
%struct._CacheInfo = type { i32, i32, i64, i32, i32, i32, i64, i64, i64, i64, i32, %struct._MagickPixelPacket, i64, %struct._NexusInfo**, %struct._PixelPacket*, i16*, i32, i32, [4096 x i8], [4096 x i8], %struct._CacheMethods, %struct._RandomInfo*, i64, i8*, i32, i32, i32, i64, %struct.SemaphoreInfo*, %struct.SemaphoreInfo*, i64, i64 }
%struct._MagickPixelPacket = type { i32, i32, i32, double, i64, float, float, float, float, float }
%struct._NexusInfo = type { i32, %struct._RectangleInfo, i64, %struct._PixelPacket*, %struct._PixelPacket*, i32, i16*, i64 }
%struct._RectangleInfo = type { i64, i64, i64, i64 }
%struct._PixelPacket = type { i16, i16, i16, i16 }

!446 = !{!447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518}
!447 = !DIEnumerator(name: "MagickUndefinedOptions", value: -1)
!448 = !DIEnumerator(name: "MagickAlignOptions", value: 0)
!449 = !DIEnumerator(name: "MagickAlphaOptions", value: 1)
!450 = !DIEnumerator(name: "MagickBooleanOptions", value: 2)
!451 = !DIEnumerator(name: "MagickCacheOptions", value: 3)
!452 = !DIEnumerator(name: "MagickChannelOptions", value: 4)
!453 = !DIEnumerator(name: "MagickClassOptions", value: 5)
!454 = !DIEnumerator(name: "MagickClipPathOptions", value: 6)
!455 = !DIEnumerator(name: "MagickCoderOptions", value: 7)
!456 = !DIEnumerator(name: "MagickColorOptions", value: 8)
!457 = !DIEnumerator(name: "MagickColorspaceOptions", value: 9)
!458 = !DIEnumerator(name: "MagickCommandOptions", value: 10)
!459 = !DIEnumerator(name: "MagickComposeOptions", value: 11)
!460 = !DIEnumerator(name: "MagickCompressOptions", value: 12)
!461 = !DIEnumerator(name: "MagickConfigureOptions", value: 13)
!462 = !DIEnumerator(name: "MagickDataTypeOptions", value: 14)
!463 = !DIEnumerator(name: "MagickDebugOptions", value: 15)
!464 = !DIEnumerator(name: "MagickDecorateOptions", value: 16)
!465 = !DIEnumerator(name: "MagickDelegateOptions", value: 17)
!466 = !DIEnumerator(name: "MagickDirectionOptions", value: 18)
!467 = !DIEnumerator(name: "MagickDisposeOptions", value: 19)
!468 = !DIEnumerator(name: "MagickDistortOptions", value: 20)
!469 = !DIEnumerator(name: "MagickDitherOptions", value: 21)
!470 = !DIEnumerator(name: "MagickEndianOptions", value: 22)
!471 = !DIEnumerator(name: "MagickEvaluateOptions", value: 23)
!472 = !DIEnumerator(name: "MagickFillRuleOptions", value: 24)
!473 = !DIEnumerator(name: "MagickFilterOptions", value: 25)
!474 = !DIEnumerator(name: "MagickFontOptions", value: 26)
!475 = !DIEnumerator(name: "MagickFontsOptions", value: 27)
!476 = !DIEnumerator(name: "MagickFormatOptions", value: 28)
!477 = !DIEnumerator(name: "MagickFunctionOptions", value: 29)
!478 = !DIEnumerator(name: "MagickGravityOptions", value: 30)
!479 = !DIEnumerator(name: "MagickIntentOptions", value: 31)
!480 = !DIEnumerator(name: "MagickInterlaceOptions", value: 32)
!481 = !DIEnumerator(name: "MagickInterpolateOptions", value: 33)
!482 = !DIEnumerator(name: "MagickKernelOptions", value: 34)
!483 = !DIEnumerator(name: "MagickLayerOptions", value: 35)
!484 = !DIEnumerator(name: "MagickLineCapOptions", value: 36)
!485 = !DIEnumerator(name: "MagickLineJoinOptions", value: 37)
!486 = !DIEnumerator(name: "MagickListOptions", value: 38)
!487 = !DIEnumerator(name: "MagickLocaleOptions", value: 39)
!488 = !DIEnumerator(name: "MagickLogEventOptions", value: 40)
!489 = !DIEnumerator(name: "MagickLogOptions", value: 41)
!490 = !DIEnumerator(name: "MagickMagicOptions", value: 42)
!491 = !DIEnumerator(name: "MagickMethodOptions", value: 43)
!492 = !DIEnumerator(name: "MagickMetricOptions", value: 44)
!493 = !DIEnumerator(name: "MagickMimeOptions", value: 45)
!494 = !DIEnumerator(name: "MagickModeOptions", value: 46)
!495 = !DIEnumerator(name: "MagickModuleOptions", value: 47)
!496 = !DIEnumerator(name: "MagickMorphologyOptions", value: 48)
!497 = !DIEnumerator(name: "MagickNoiseOptions", value: 49)
!498 = !DIEnumerator(name: "MagickOrientationOptions", value: 50)
!499 = !DIEnumerator(name: "MagickPixelIntensityOptions", value: 51)
!500 = !DIEnumerator(name: "MagickPolicyOptions", value: 52)
!501 = !DIEnumerator(name: "MagickPolicyDomainOptions", value: 53)
!502 = !DIEnumerator(name: "MagickPolicyRightsOptions", value: 54)
!503 = !DIEnumerator(name: "MagickPreviewOptions", value: 55)
!504 = !DIEnumerator(name: "MagickPrimitiveOptions", value: 56)
!505 = !DIEnumerator(name: "MagickQuantumFormatOptions", value: 57)
!506 = !DIEnumerator(name: "MagickResolutionOptions", value: 58)
!507 = !DIEnumerator(name: "MagickResourceOptions", value: 59)
!508 = !DIEnumerator(name: "MagickSparseColorOptions", value: 60)
!509 = !DIEnumerator(name: "MagickStatisticOptions", value: 61)
!510 = !DIEnumerator(name: "MagickStorageOptions", value: 62)
!511 = !DIEnumerator(name: "MagickStretchOptions", value: 63)
!512 = !DIEnumerator(name: "MagickStyleOptions", value: 64)
!513 = !DIEnumerator(name: "MagickThresholdOptions", value: 65)
!514 = !DIEnumerator(name: "MagickTypeOptions", value: 66)
!515 = !DIEnumerator(name: "MagickValidateOptions", value: 67)
!516 = !DIEnumerator(name: "MagickVirtualPixelOptions", value: 68)
!517 = !DIEnumerator(name: "MagickComplexOptions", value: 69)
!518 = !DIEnumerator(name: "MagickIntensityOptions", value: 70)
!519 = !{!520, !666, !532, !445, !530, !568, !731, !885, !569, !581, !886, !763, !888, !861, !890, !866, !589, !839, !849, !833, !844, !624, !828, !545, !602, !821, !837, !542, !594, !825, !816, !620, !854, !856, !560, !557, !901, !903, !779, !603}
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 64)
!521 = !DIDerivedType(tag: DW_TAG_typedef, name: "CacheInfo", file: !522, line: 217, baseType: !523)
!522 = !DIFile(filename: "./magick/cache-private.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!523 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_CacheInfo", file: !522, line: 128, size: 68224, elements: !524)
!524 = !{!525, !527, !529, !533, !535, !537, !539, !540, !541, !544, !547, !549, !566, !567, !605, !606, !607, !608, !609, !614, !615, !865, !870, !871, !872, !873, !874, !880, !881, !882, !883, !884}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "storage_class", scope: !523, file: !522, line: 131, baseType: !526, size: 32)
!526 = !DIDerivedType(tag: DW_TAG_typedef, name: "ClassType", file: !6, line: 209, baseType: !5)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !523, file: !522, line: 134, baseType: !528, size: 32, offset: 32)
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorspaceType", file: !13, line: 61, baseType: !12)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !523, file: !522, line: 137, baseType: !530, size: 64, offset: 64)
!530 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !531, line: 46, baseType: !532)
!531 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!532 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !523, file: !522, line: 140, baseType: !534, size: 32, offset: 128)
!534 = !DIDerivedType(tag: DW_TAG_typedef, name: "CacheType", file: !50, line: 35, baseType: !49)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !523, file: !522, line: 143, baseType: !536, size: 32, offset: 160)
!536 = !DIDerivedType(tag: DW_TAG_typedef, name: "MapMode", file: !59, line: 35, baseType: !58)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "mapped", scope: !523, file: !522, line: 146, baseType: !538, size: 32, offset: 192)
!538 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickBooleanType", file: !6, line: 215, baseType: !64)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !523, file: !522, line: 149, baseType: !530, size: 64, offset: 256)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !523, file: !522, line: 150, baseType: !530, size: 64, offset: 320)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !523, file: !522, line: 153, baseType: !542, size: 64, offset: 384)
!542 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickOffsetType", file: !6, line: 150, baseType: !543)
!543 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !523, file: !522, line: 156, baseType: !545, size: 64, offset: 448)
!545 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickSizeType", file: !6, line: 151, baseType: !546)
!546 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_pixel_method", scope: !523, file: !522, line: 159, baseType: !548, size: 32, offset: 512)
!548 = !DIDerivedType(tag: DW_TAG_typedef, name: "VirtualPixelMethod", file: !69, line: 47, baseType: !68)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_pixel_color", scope: !523, file: !522, line: 162, baseType: !550, size: 448, offset: 576)
!550 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickPixelPacket", file: !364, line: 127, baseType: !551)
!551 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MagickPixelPacket", file: !364, line: 104, size: 448, elements: !552)
!552 = !{!553, !554, !555, !556, !558, !559, !562, !563, !564, !565}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "storage_class", scope: !551, file: !364, line: 107, baseType: !526, size: 32)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !551, file: !364, line: 110, baseType: !528, size: 32, offset: 32)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "matte", scope: !551, file: !364, line: 113, baseType: !538, size: 32, offset: 64)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !551, file: !364, line: 116, baseType: !557, size: 64, offset: 128)
!557 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !551, file: !364, line: 119, baseType: !530, size: 64, offset: 192)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !551, file: !364, line: 122, baseType: !560, size: 32, offset: 256)
!560 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickRealType", file: !6, line: 78, baseType: !561)
!561 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !551, file: !364, line: 123, baseType: !560, size: 32, offset: 288)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !551, file: !364, line: 124, baseType: !560, size: 32, offset: 320)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !551, file: !364, line: 125, baseType: !560, size: 32, offset: 352)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !551, file: !364, line: 126, baseType: !560, size: 32, offset: 384)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "number_threads", scope: !523, file: !522, line: 165, baseType: !530, size: 64, offset: 1024)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "nexus_info", scope: !523, file: !522, line: 168, baseType: !568, size: 64, offset: 1088)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64)
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 64)
!570 = !DIDerivedType(tag: DW_TAG_typedef, name: "NexusInfo", file: !522, line: 126, baseType: !571)
!571 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NexusInfo", file: !522, line: 103, size: 704, elements: !572)
!572 = !{!573, !574, !587, !588, !599, !600, !601, !604}
!573 = !DIDerivedType(tag: DW_TAG_member, name: "mapped", scope: !571, file: !522, line: 106, baseType: !538, size: 32)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !571, file: !522, line: 109, baseType: !575, size: 256, offset: 64)
!575 = !DIDerivedType(tag: DW_TAG_typedef, name: "RectangleInfo", file: !191, line: 130, baseType: !576)
!576 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_RectangleInfo", file: !191, line: 121, size: 256, elements: !577)
!577 = !{!578, !579, !580, !586}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !576, file: !191, line: 124, baseType: !530, size: 64)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !576, file: !191, line: 125, baseType: !530, size: 64, offset: 64)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !576, file: !191, line: 128, baseType: !581, size: 64, offset: 128)
!581 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !582, line: 77, baseType: !583)
!582 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!583 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !584, line: 193, baseType: !585)
!584 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!585 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !576, file: !191, line: 129, baseType: !581, size: 64, offset: 192)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !571, file: !522, line: 112, baseType: !545, size: 64, offset: 320)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !571, file: !522, line: 115, baseType: !589, size: 64, offset: 384)
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 64)
!590 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelPacket", file: !364, line: 148, baseType: !591)
!591 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PixelPacket", file: !364, line: 131, size: 64, elements: !592)
!592 = !{!593, !596, !597, !598}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !591, file: !364, line: 143, baseType: !594, size: 16)
!594 = !DIDerivedType(tag: DW_TAG_typedef, name: "Quantum", file: !6, line: 93, baseType: !595)
!595 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !591, file: !364, line: 144, baseType: !594, size: 16, offset: 16)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !591, file: !364, line: 145, baseType: !594, size: 16, offset: 32)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !591, file: !364, line: 146, baseType: !594, size: 16, offset: 48)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "pixels", scope: !571, file: !522, line: 116, baseType: !589, size: 64, offset: 448)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "authentic_pixel_cache", scope: !571, file: !522, line: 119, baseType: !538, size: 32, offset: 512)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "indexes", scope: !571, file: !522, line: 122, baseType: !602, size: 64, offset: 576)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64)
!603 = !DIDerivedType(tag: DW_TAG_typedef, name: "IndexPacket", file: !364, line: 129, baseType: !594)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !571, file: !522, line: 125, baseType: !530, size: 64, offset: 640)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "pixels", scope: !523, file: !522, line: 171, baseType: !589, size: 64, offset: 1152)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "indexes", scope: !523, file: !522, line: 174, baseType: !602, size: 64, offset: 1216)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "active_index_channel", scope: !523, file: !522, line: 177, baseType: !538, size: 32, offset: 1280)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !523, file: !522, line: 180, baseType: !445, size: 32, offset: 1312)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !523, file: !522, line: 183, baseType: !610, size: 32768, offset: 1344)
!610 = !DICompositeType(tag: DW_TAG_array_type, baseType: !611, size: 32768, elements: !612)
!611 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!612 = !{!613}
!613 = !DISubrange(count: 4096)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "cache_filename", scope: !523, file: !522, line: 184, baseType: !610, size: 32768, offset: 34112)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "methods", scope: !523, file: !522, line: 187, baseType: !616, size: 704, offset: 66880)
!616 = !DIDerivedType(tag: DW_TAG_typedef, name: "CacheMethods", file: !522, line: 101, baseType: !617)
!617 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_CacheMethods", file: !522, line: 67, size: 704, elements: !618)
!618 = !{!619, !815, !820, !827, !832, !838, !843, !848, !853, !855, !860}
!619 = !DIDerivedType(tag: DW_TAG_member, name: "get_virtual_pixel_handler", scope: !617, file: !522, line: 70, baseType: !620, size: 64)
!620 = !DIDerivedType(tag: DW_TAG_typedef, name: "GetVirtualPixelHandler", file: !522, line: 49, baseType: !621)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 64)
!622 = !DISubroutineType(types: !623)
!623 = !{!624, !626, !811, !812, !812, !813, !813, !814}
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 64)
!625 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !590)
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 64)
!627 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !628)
!628 = !DIDerivedType(tag: DW_TAG_typedef, name: "Image", file: !6, line: 221, baseType: !629)
!629 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Image", file: !115, line: 150, size: 105920, elements: !630)
!630 = !{!631, !632, !633, !635, !636, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !663, !665, !667, !669, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !684, !686, !688, !690, !692, !694, !696, !697, !698, !699, !700, !701, !702, !710, !725, !735, !736, !737, !738, !742, !746, !747, !748, !749, !750, !751, !768, !769, !771, !772, !782, !783, !785, !786, !787, !788, !789, !790, !792, !793, !794, !795, !796, !797, !798, !800, !801, !802, !803, !804, !808, !810}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "storage_class", scope: !629, file: !115, line: 153, baseType: !526, size: 32)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !629, file: !115, line: 156, baseType: !528, size: 32, offset: 32)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !629, file: !115, line: 159, baseType: !634, size: 32, offset: 64)
!634 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompressionType", file: !90, line: 49, baseType: !89)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !629, file: !115, line: 162, baseType: !530, size: 64, offset: 128)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !629, file: !115, line: 165, baseType: !637, size: 32, offset: 192)
!637 = !DIDerivedType(tag: DW_TAG_typedef, name: "OrientationType", file: !115, line: 86, baseType: !114)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "taint", scope: !629, file: !115, line: 168, baseType: !538, size: 32, offset: 224)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "matte", scope: !629, file: !115, line: 169, baseType: !538, size: 32, offset: 256)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !629, file: !115, line: 172, baseType: !530, size: 64, offset: 320)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !629, file: !115, line: 173, baseType: !530, size: 64, offset: 384)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !629, file: !115, line: 174, baseType: !530, size: 64, offset: 448)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !629, file: !115, line: 175, baseType: !530, size: 64, offset: 512)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "colormap", scope: !629, file: !115, line: 178, baseType: !589, size: 64, offset: 576)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "background_color", scope: !629, file: !115, line: 179, baseType: !590, size: 64, offset: 640)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !629, file: !115, line: 180, baseType: !590, size: 64, offset: 704)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "matte_color", scope: !629, file: !115, line: 181, baseType: !590, size: 64, offset: 768)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !629, file: !115, line: 184, baseType: !557, size: 64, offset: 832)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "chromaticity", scope: !629, file: !115, line: 187, baseType: !650, size: 768, offset: 896)
!650 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChromaticityInfo", file: !115, line: 128, baseType: !651)
!651 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ChromaticityInfo", file: !115, line: 121, size: 768, elements: !652)
!652 = !{!653, !660, !661, !662}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "red_primary", scope: !651, file: !115, line: 124, baseType: !654, size: 192)
!654 = !DIDerivedType(tag: DW_TAG_typedef, name: "PrimaryInfo", file: !115, line: 101, baseType: !655)
!655 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PrimaryInfo", file: !115, line: 95, size: 192, elements: !656)
!656 = !{!657, !658, !659}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !655, file: !115, line: 98, baseType: !557, size: 64)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !655, file: !115, line: 99, baseType: !557, size: 64, offset: 64)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !655, file: !115, line: 100, baseType: !557, size: 64, offset: 128)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "green_primary", scope: !651, file: !115, line: 125, baseType: !654, size: 192, offset: 192)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "blue_primary", scope: !651, file: !115, line: 126, baseType: !654, size: 192, offset: 384)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "white_point", scope: !651, file: !115, line: 127, baseType: !654, size: 192, offset: 576)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "rendering_intent", scope: !629, file: !115, line: 190, baseType: !664, size: 32, offset: 1664)
!664 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderingIntent", file: !127, line: 49, baseType: !126)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !629, file: !115, line: 193, baseType: !666, size: 64, offset: 1728)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !629, file: !115, line: 196, baseType: !668, size: 32, offset: 1792)
!668 = !DIDerivedType(tag: DW_TAG_typedef, name: "ResolutionType", file: !115, line: 93, baseType: !134)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "montage", scope: !629, file: !115, line: 199, baseType: !670, size: 64, offset: 1856)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "directory", scope: !629, file: !115, line: 200, baseType: !670, size: 64, offset: 1920)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "geometry", scope: !629, file: !115, line: 201, baseType: !670, size: 64, offset: 1984)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !629, file: !115, line: 204, baseType: !581, size: 64, offset: 2048)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "x_resolution", scope: !629, file: !115, line: 207, baseType: !557, size: 64, offset: 2112)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "y_resolution", scope: !629, file: !115, line: 208, baseType: !557, size: 64, offset: 2176)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !629, file: !115, line: 211, baseType: !575, size: 256, offset: 2240)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "extract_info", scope: !629, file: !115, line: 212, baseType: !575, size: 256, offset: 2496)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "tile_info", scope: !629, file: !115, line: 213, baseType: !575, size: 256, offset: 2752)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "bias", scope: !629, file: !115, line: 216, baseType: !557, size: 64, offset: 3008)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "blur", scope: !629, file: !115, line: 217, baseType: !557, size: 64, offset: 3072)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !629, file: !115, line: 218, baseType: !557, size: 64, offset: 3136)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !629, file: !115, line: 221, baseType: !683, size: 32, offset: 3200)
!683 = !DIDerivedType(tag: DW_TAG_typedef, name: "FilterTypes", file: !140, line: 66, baseType: !139)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "interlace", scope: !629, file: !115, line: 224, baseType: !685, size: 32, offset: 3232)
!685 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterlaceType", file: !115, line: 73, baseType: !174)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !629, file: !115, line: 227, baseType: !687, size: 32, offset: 3264)
!687 = !DIDerivedType(tag: DW_TAG_typedef, name: "EndianType", file: !185, line: 35, baseType: !184)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !629, file: !115, line: 230, baseType: !689, size: 32, offset: 3296)
!689 = !DIDerivedType(tag: DW_TAG_typedef, name: "GravityType", file: !191, line: 91, baseType: !190)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !629, file: !115, line: 233, baseType: !691, size: 32, offset: 3328)
!691 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompositeOperator", file: !206, line: 99, baseType: !205)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "dispose", scope: !629, file: !115, line: 236, baseType: !693, size: 32, offset: 3360)
!693 = !DIDerivedType(tag: DW_TAG_typedef, name: "DisposeType", file: !277, line: 32, baseType: !276)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "clip_mask", scope: !629, file: !115, line: 239, baseType: !695, size: 64, offset: 3392)
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 64)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !629, file: !115, line: 242, baseType: !530, size: 64, offset: 3456)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !629, file: !115, line: 243, baseType: !530, size: 64, offset: 3520)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_second", scope: !629, file: !115, line: 246, baseType: !581, size: 64, offset: 3584)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "iterations", scope: !629, file: !115, line: 249, baseType: !530, size: 64, offset: 3648)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "total_colors", scope: !629, file: !115, line: 250, baseType: !530, size: 64, offset: 3712)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "start_loop", scope: !629, file: !115, line: 253, baseType: !581, size: 64, offset: 3776)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !629, file: !115, line: 256, baseType: !703, size: 192, offset: 3840)
!703 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErrorInfo", file: !704, line: 68, baseType: !705)
!704 = !DIFile(filename: "./magick/color.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!705 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ErrorInfo", file: !704, line: 62, size: 192, elements: !706)
!706 = !{!707, !708, !709}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "mean_error_per_pixel", scope: !705, file: !704, line: 65, baseType: !557, size: 64)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_mean_error", scope: !705, file: !704, line: 66, baseType: !557, size: 64, offset: 64)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_maximum_error", scope: !705, file: !704, line: 67, baseType: !557, size: 64, offset: 128)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !629, file: !115, line: 259, baseType: !711, size: 512, offset: 4032)
!711 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerInfo", file: !285, line: 51, baseType: !712)
!712 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TimerInfo", file: !285, line: 40, size: 512, elements: !713)
!713 = !{!714, !721, !722, !724}
!714 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !712, file: !285, line: 43, baseType: !715, size: 192)
!715 = !DIDerivedType(tag: DW_TAG_typedef, name: "Timer", file: !285, line: 38, baseType: !716)
!716 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Timer", file: !285, line: 32, size: 192, elements: !717)
!717 = !{!718, !719, !720}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !716, file: !285, line: 35, baseType: !557, size: 64)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !716, file: !285, line: 36, baseType: !557, size: 64, offset: 64)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !716, file: !285, line: 37, baseType: !557, size: 64, offset: 128)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "elapsed", scope: !712, file: !285, line: 44, baseType: !715, size: 192, offset: 192)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !712, file: !285, line: 47, baseType: !723, size: 32, offset: 384)
!723 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerState", file: !285, line: 30, baseType: !284)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !712, file: !285, line: 50, baseType: !530, size: 64, offset: 448)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !629, file: !115, line: 262, baseType: !726, size: 64, offset: 4544)
!726 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickProgressMonitor", file: !727, line: 26, baseType: !728)
!727 = !DIFile(filename: "./magick/monitor.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 64)
!729 = !DISubroutineType(types: !730)
!730 = !{!538, !731, !733, !734, !666}
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !732, size: 64)
!732 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !611)
!733 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !542)
!734 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !545)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !629, file: !115, line: 265, baseType: !666, size: 64, offset: 4608)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !629, file: !115, line: 266, baseType: !666, size: 64, offset: 4672)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !629, file: !115, line: 267, baseType: !666, size: 64, offset: 4736)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "ascii85", scope: !629, file: !115, line: 270, baseType: !739, size: 64, offset: 4800)
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 64)
!740 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ascii85Info", file: !90, line: 52, baseType: !741)
!741 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Ascii85Info", file: !90, line: 51, flags: DIFlagFwdDecl)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !629, file: !115, line: 273, baseType: !743, size: 64, offset: 4864)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64)
!744 = !DIDerivedType(tag: DW_TAG_typedef, name: "BlobInfo", file: !6, line: 217, baseType: !745)
!745 = !DICompositeType(tag: DW_TAG_structure_type, name: "_BlobInfo", file: !6, line: 217, flags: DIFlagFwdDecl)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !629, file: !115, line: 276, baseType: !610, size: 32768, offset: 4928)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "magick_filename", scope: !629, file: !115, line: 277, baseType: !610, size: 32768, offset: 37696)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !629, file: !115, line: 278, baseType: !610, size: 32768, offset: 70464)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "magick_columns", scope: !629, file: !115, line: 281, baseType: !530, size: 64, offset: 103232)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "magick_rows", scope: !629, file: !115, line: 282, baseType: !530, size: 64, offset: 103296)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "exception", scope: !629, file: !115, line: 285, baseType: !752, size: 448, offset: 103360)
!752 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionInfo", file: !6, line: 219, baseType: !753)
!753 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ExceptionInfo", file: !291, line: 102, size: 448, elements: !754)
!754 = !{!755, !757, !758, !759, !760, !761, !762, !767}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "severity", scope: !753, file: !291, line: 105, baseType: !756, size: 32)
!756 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionType", file: !291, line: 100, baseType: !290)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "error_number", scope: !753, file: !291, line: 108, baseType: !445, size: 32, offset: 32)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !753, file: !291, line: 111, baseType: !670, size: 64, offset: 64)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !753, file: !291, line: 112, baseType: !670, size: 64, offset: 128)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "exceptions", scope: !753, file: !291, line: 115, baseType: !666, size: 64, offset: 192)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "relinquish", scope: !753, file: !291, line: 118, baseType: !538, size: 32, offset: 256)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !753, file: !291, line: 121, baseType: !763, size: 64, offset: 320)
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 64)
!764 = !DIDerivedType(tag: DW_TAG_typedef, name: "SemaphoreInfo", file: !765, line: 26, baseType: !766)
!765 = !DIFile(filename: "./magick/semaphore.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!766 = !DICompositeType(tag: DW_TAG_structure_type, name: "SemaphoreInfo", file: !765, line: 25, flags: DIFlagFwdDecl)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !753, file: !291, line: 124, baseType: !530, size: 64, offset: 384)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !629, file: !115, line: 288, baseType: !538, size: 32, offset: 103808)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !629, file: !115, line: 291, baseType: !770, size: 64, offset: 103872)
!770 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !581)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !629, file: !115, line: 294, baseType: !763, size: 64, offset: 103936)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "color_profile", scope: !629, file: !115, line: 297, baseType: !773, size: 256, offset: 104000)
!773 = !DIDerivedType(tag: DW_TAG_typedef, name: "ProfileInfo", file: !127, line: 40, baseType: !774)
!774 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ProfileInfo", file: !127, line: 27, size: 256, elements: !775)
!775 = !{!776, !777, !778, !781}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !774, file: !127, line: 30, baseType: !670, size: 64)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !774, file: !127, line: 33, baseType: !530, size: 64, offset: 64)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !774, file: !127, line: 36, baseType: !779, size: 64, offset: 128)
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !780, size: 64)
!780 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !774, file: !127, line: 39, baseType: !530, size: 64, offset: 192)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "iptc_profile", scope: !629, file: !115, line: 298, baseType: !773, size: 256, offset: 104256)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profile", scope: !629, file: !115, line: 299, baseType: !784, size: 64, offset: 104512)
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 64)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profiles", scope: !629, file: !115, line: 302, baseType: !530, size: 64, offset: 104576)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !629, file: !115, line: 305, baseType: !530, size: 64, offset: 104640)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !629, file: !115, line: 308, baseType: !695, size: 64, offset: 104704)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !629, file: !115, line: 309, baseType: !695, size: 64, offset: 104768)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !629, file: !115, line: 310, baseType: !695, size: 64, offset: 104832)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "interpolate", scope: !629, file: !115, line: 313, baseType: !791, size: 32, offset: 104896)
!791 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterpolatePixelMethod", file: !364, line: 47, baseType: !363)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "black_point_compensation", scope: !629, file: !115, line: 316, baseType: !538, size: 32, offset: 104928)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_color", scope: !629, file: !115, line: 319, baseType: !590, size: 64, offset: 104960)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !629, file: !115, line: 322, baseType: !695, size: 64, offset: 105024)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "tile_offset", scope: !629, file: !115, line: 325, baseType: !575, size: 256, offset: 105088)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !629, file: !115, line: 328, baseType: !666, size: 64, offset: 105344)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "artifacts", scope: !629, file: !115, line: 329, baseType: !666, size: 64, offset: 105408)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !629, file: !115, line: 332, baseType: !799, size: 32, offset: 105472)
!799 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageType", file: !115, line: 61, baseType: !380)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !629, file: !115, line: 335, baseType: !538, size: 32, offset: 105504)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !629, file: !115, line: 338, baseType: !545, size: 64, offset: 105536)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "ping", scope: !629, file: !115, line: 341, baseType: !538, size: 32, offset: 105600)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !629, file: !115, line: 344, baseType: !530, size: 64, offset: 105664)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !629, file: !115, line: 347, baseType: !805, size: 64, offset: 105728)
!805 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !806, line: 7, baseType: !807)
!806 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "")
!807 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !584, line: 160, baseType: !585)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "intensity", scope: !629, file: !115, line: 350, baseType: !809, size: 32, offset: 105792)
!809 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelIntensityMethod", file: !364, line: 79, baseType: !394)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !629, file: !115, line: 353, baseType: !530, size: 64, offset: 105856)
!811 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !548)
!812 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !581)
!813 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !530)
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "get_virtual_pixels_handler", scope: !617, file: !522, line: 73, baseType: !816, size: 64, offset: 64)
!816 = !DIDerivedType(tag: DW_TAG_typedef, name: "GetVirtualPixelsHandler", file: !522, line: 51, baseType: !817)
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !818, size: 64)
!818 = !DISubroutineType(types: !819)
!819 = !{!624, !626}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "get_virtual_indexes_from_handler", scope: !617, file: !522, line: 76, baseType: !821, size: 64, offset: 128)
!821 = !DIDerivedType(tag: DW_TAG_typedef, name: "GetVirtualIndexesFromHandler", file: !522, line: 36, baseType: !822)
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !823, size: 64)
!823 = !DISubroutineType(types: !824)
!824 = !{!825, !626}
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !826, size: 64)
!826 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !603)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "get_one_virtual_pixel_from_handler", scope: !617, file: !522, line: 79, baseType: !828, size: 64, offset: 192)
!828 = !DIDerivedType(tag: DW_TAG_typedef, name: "GetOneVirtualPixelFromHandler", file: !522, line: 44, baseType: !829)
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 64)
!830 = !DISubroutineType(types: !831)
!831 = !{!538, !626, !811, !812, !812, !589, !814}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "get_authentic_pixels_handler", scope: !617, file: !522, line: 82, baseType: !833, size: 64, offset: 256)
!833 = !DIDerivedType(tag: DW_TAG_typedef, name: "GetAuthenticPixelsHandler", file: !522, line: 54, baseType: !834)
!834 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !835, size: 64)
!835 = !DISubroutineType(types: !836)
!836 = !{!589, !837, !812, !812, !813, !813, !814}
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 64)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "get_authentic_indexes_from_handler", scope: !617, file: !522, line: 85, baseType: !839, size: 64, offset: 320)
!839 = !DIDerivedType(tag: DW_TAG_typedef, name: "GetAuthenticIndexesFromHandler", file: !522, line: 39, baseType: !840)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !841, size: 64)
!841 = !DISubroutineType(types: !842)
!842 = !{!602, !626}
!843 = !DIDerivedType(tag: DW_TAG_member, name: "get_one_authentic_pixel_from_handler", scope: !617, file: !522, line: 88, baseType: !844, size: 64, offset: 384)
!844 = !DIDerivedType(tag: DW_TAG_typedef, name: "GetOneAuthenticPixelFromHandler", file: !522, line: 42, baseType: !845)
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !846, size: 64)
!846 = !DISubroutineType(types: !847)
!847 = !{!538, !837, !812, !812, !589, !814}
!848 = !DIDerivedType(tag: DW_TAG_member, name: "get_authentic_pixels_from_handler", scope: !617, file: !522, line: 91, baseType: !849, size: 64, offset: 448)
!849 = !DIDerivedType(tag: DW_TAG_typedef, name: "GetAuthenticPixelsFromHandler", file: !522, line: 58, baseType: !850)
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !851, size: 64)
!851 = !DISubroutineType(types: !852)
!852 = !{!589, !626}
!853 = !DIDerivedType(tag: DW_TAG_member, name: "queue_authentic_pixels_handler", scope: !617, file: !522, line: 94, baseType: !854, size: 64, offset: 512)
!854 = !DIDerivedType(tag: DW_TAG_typedef, name: "QueueAuthenticPixelsHandler", file: !522, line: 61, baseType: !834)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "sync_authentic_pixels_handler", scope: !617, file: !522, line: 97, baseType: !856, size: 64, offset: 576)
!856 = !DIDerivedType(tag: DW_TAG_typedef, name: "SyncAuthenticPixelsHandler", file: !522, line: 46, baseType: !857)
!857 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !858, size: 64)
!858 = !DISubroutineType(types: !859)
!859 = !{!538, !837, !814}
!860 = !DIDerivedType(tag: DW_TAG_member, name: "destroy_pixel_handler", scope: !617, file: !522, line: 100, baseType: !861, size: 64, offset: 640)
!861 = !DIDerivedType(tag: DW_TAG_typedef, name: "DestroyPixelHandler", file: !522, line: 65, baseType: !862)
!862 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !863, size: 64)
!863 = !DISubroutineType(types: !864)
!864 = !{null, !837}
!865 = !DIDerivedType(tag: DW_TAG_member, name: "random_info", scope: !523, file: !522, line: 190, baseType: !866, size: 64, offset: 67584)
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !867, size: 64)
!867 = !DIDerivedType(tag: DW_TAG_typedef, name: "RandomInfo", file: !868, line: 31, baseType: !869)
!868 = !DIFile(filename: "./magick/random_.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!869 = !DICompositeType(tag: DW_TAG_structure_type, name: "_RandomInfo", file: !868, line: 30, flags: DIFlagFwdDecl)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "number_connections", scope: !523, file: !522, line: 193, baseType: !530, size: 64, offset: 67648)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "server_info", scope: !523, file: !522, line: 196, baseType: !666, size: 64, offset: 67712)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "synchronize", scope: !523, file: !522, line: 199, baseType: !538, size: 32, offset: 67776)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !523, file: !522, line: 200, baseType: !538, size: 32, offset: 67808)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !523, file: !522, line: 203, baseType: !875, size: 32, offset: 67840)
!875 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickThreadType", file: !876, line: 30, baseType: !877)
!876 = !DIFile(filename: "./magick/thread_.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!877 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !878, line: 97, baseType: !879)
!878 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "")
!879 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !584, line: 154, baseType: !445)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !523, file: !522, line: 206, baseType: !581, size: 64, offset: 67904)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !523, file: !522, line: 209, baseType: !763, size: 64, offset: 67968)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "file_semaphore", scope: !523, file: !522, line: 210, baseType: !763, size: 64, offset: 68032)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !523, file: !522, line: 213, baseType: !805, size: 64, offset: 68096)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !523, file: !522, line: 216, baseType: !530, size: 64, offset: 68160)
!885 = !DIDerivedType(tag: DW_TAG_typedef, name: "Cache", file: !522, line: 33, baseType: !666)
!886 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !887, size: 64)
!887 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 64)
!889 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !521)
!890 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !891, size: 64)
!891 = !DIDerivedType(tag: DW_TAG_typedef, name: "DistributeCacheInfo", file: !892, line: 47, baseType: !893)
!892 = !DIFile(filename: "./magick/distribute-cache-private.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!893 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DistributeCacheInfo", file: !892, line: 28, size: 33088, elements: !894)
!894 = !{!895, !896, !897, !898, !899, !900}
!895 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !893, file: !892, line: 31, baseType: !445, size: 32)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "session_key", scope: !893, file: !892, line: 34, baseType: !530, size: 64, offset: 64)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "hostname", scope: !893, file: !892, line: 37, baseType: !610, size: 32768, offset: 128)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !893, file: !892, line: 40, baseType: !445, size: 32, offset: 32896)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !893, file: !892, line: 43, baseType: !530, size: 64, offset: 32960)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !893, file: !892, line: 46, baseType: !538, size: 32, offset: 33024)
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !902, size: 64)
!902 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !780)
!903 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 64)
!904 = !{!0, !905, !908, !913, !920, !922, !924}
!905 = !DIGlobalVariableExpression(var: !906, expr: !DIExpression())
!906 = distinct !DIGlobalVariable(name: "instantiate_cache", scope: !2, file: !3, line: 147, type: !907, isLocal: true, isDefinition: true)
!907 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !538)
!908 = !DIGlobalVariableExpression(var: !909, expr: !DIExpression())
!909 = distinct !DIGlobalVariable(name: "DitherMatrix", scope: !2, file: !3, line: 2487, type: !910, isLocal: true, isDefinition: true)
!910 = !DICompositeType(tag: DW_TAG_array_type, baseType: !581, size: 4096, elements: !911)
!911 = !{!912}
!912 = !DISubrange(count: 64)
!913 = !DIGlobalVariableExpression(var: !914, expr: !DIExpression())
!914 = distinct !DIGlobalVariable(name: "cpu_throttle", scope: !915, file: !3, line: 1499, type: !545, isLocal: true, isDefinition: true)
!915 = distinct !DISubprogram(name: "GetImagePixelCache", scope: !3, file: !3, line: 1488, type: !916, scopeLine: 1490, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !919)
!916 = !DISubroutineType(types: !917)
!917 = !{!885, !837, !918, !814}
!918 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !538)
!919 = !{}
!920 = !DIGlobalVariableExpression(var: !921, expr: !DIExpression())
!921 = distinct !DIGlobalVariable(name: "cycles", scope: !915, file: !3, line: 1500, type: !545, isLocal: true, isDefinition: true)
!922 = !DIGlobalVariableExpression(var: !923, expr: !DIExpression())
!923 = distinct !DIGlobalVariable(name: "time_limit", scope: !915, file: !3, line: 1501, type: !545, isLocal: true, isDefinition: true)
!924 = !DIGlobalVariableExpression(var: !925, expr: !DIExpression())
!925 = distinct !DIGlobalVariable(name: "cache_timestamp", scope: !915, file: !3, line: 1504, type: !805, isLocal: true, isDefinition: true)
!926 = !{i32 7, !"Dwarf Version", i32 4}
!927 = !{i32 2, !"Debug Info Version", i32 3}
!928 = !{i32 1, !"wchar_size", i32 4}
!929 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!930 = distinct !DISubprogram(name: "AcquirePixelCache", scope: !3, file: !3, line: 174, type: !931, scopeLine: 175, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !919)
!931 = !DISubroutineType(types: !932)
!932 = !{!885, !813}
!933 = !DILocalVariable(name: "number_threads", arg: 1, scope: !930, file: !3, line: 174, type: !813)
!934 = !DILocation(line: 174, column: 51, scope: !930)
!935 = !DILocalVariable(name: "cache_info", scope: !930, file: !3, line: 177, type: !936)
!936 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !520)
!937 = !DILocation(line: 177, column: 15, scope: !930)
!938 = !DILocalVariable(name: "synchronize", scope: !930, file: !3, line: 180, type: !670)
!939 = !DILocation(line: 180, column: 6, scope: !930)
!940 = !DILocation(line: 182, column: 28, scope: !930)
!941 = !DILocation(line: 182, column: 14, scope: !930)
!942 = !DILocation(line: 182, column: 13, scope: !930)
!943 = !DILocation(line: 183, column: 7, scope: !944)
!944 = distinct !DILexicalBlock(scope: !930, file: !3, line: 183, column: 7)
!945 = !DILocation(line: 183, column: 18, scope: !944)
!946 = !DILocation(line: 183, column: 7, scope: !930)
!947 = !DILocalVariable(name: "message", scope: !948, file: !3, line: 184, type: !670)
!948 = distinct !DILexicalBlock(scope: !944, file: !3, line: 184, column: 5)
!949 = !DILocation(line: 184, column: 5, scope: !948)
!950 = !DILocalVariable(name: "exception", scope: !948, file: !3, line: 184, type: !752)
!951 = !DILocation(line: 185, column: 28, scope: !930)
!952 = !DILocation(line: 185, column: 10, scope: !930)
!953 = !DILocation(line: 186, column: 3, scope: !930)
!954 = !DILocation(line: 186, column: 15, scope: !930)
!955 = !DILocation(line: 186, column: 19, scope: !930)
!956 = !DILocation(line: 187, column: 3, scope: !930)
!957 = !DILocation(line: 187, column: 15, scope: !930)
!958 = !DILocation(line: 187, column: 19, scope: !930)
!959 = !DILocation(line: 188, column: 3, scope: !930)
!960 = !DILocation(line: 188, column: 15, scope: !930)
!961 = !DILocation(line: 188, column: 25, scope: !930)
!962 = !DILocation(line: 189, column: 3, scope: !930)
!963 = !DILocation(line: 189, column: 15, scope: !930)
!964 = !DILocation(line: 189, column: 23, scope: !930)
!965 = !DILocation(line: 190, column: 3, scope: !930)
!966 = !DILocation(line: 190, column: 15, scope: !930)
!967 = !DILocation(line: 190, column: 19, scope: !930)
!968 = !DILocation(line: 191, column: 18, scope: !930)
!969 = !DILocation(line: 191, column: 3, scope: !930)
!970 = !DILocation(line: 191, column: 15, scope: !930)
!971 = !DILocation(line: 191, column: 17, scope: !930)
!972 = !DILocation(line: 192, column: 30, scope: !930)
!973 = !DILocation(line: 192, column: 3, scope: !930)
!974 = !DILocation(line: 192, column: 15, scope: !930)
!975 = !DILocation(line: 192, column: 29, scope: !930)
!976 = !DILocation(line: 193, column: 7, scope: !977)
!977 = distinct !DILexicalBlock(scope: !930, file: !3, line: 193, column: 7)
!978 = !DILocation(line: 193, column: 35, scope: !977)
!979 = !DILocation(line: 193, column: 47, scope: !977)
!980 = !DILocation(line: 193, column: 33, scope: !977)
!981 = !DILocation(line: 193, column: 7, scope: !930)
!982 = !DILocation(line: 194, column: 32, scope: !977)
!983 = !DILocation(line: 194, column: 5, scope: !977)
!984 = !DILocation(line: 194, column: 17, scope: !977)
!985 = !DILocation(line: 194, column: 31, scope: !977)
!986 = !DILocation(line: 195, column: 7, scope: !987)
!987 = distinct !DILexicalBlock(scope: !930, file: !3, line: 195, column: 7)
!988 = !DILocation(line: 195, column: 48, scope: !987)
!989 = !DILocation(line: 195, column: 60, scope: !987)
!990 = !DILocation(line: 195, column: 46, scope: !987)
!991 = !DILocation(line: 195, column: 7, scope: !930)
!992 = !DILocation(line: 196, column: 41, scope: !987)
!993 = !DILocation(line: 196, column: 5, scope: !987)
!994 = !DILocation(line: 196, column: 17, scope: !987)
!995 = !DILocation(line: 196, column: 31, scope: !987)
!996 = !DILocation(line: 197, column: 7, scope: !997)
!997 = distinct !DILexicalBlock(scope: !930, file: !3, line: 197, column: 7)
!998 = !DILocation(line: 197, column: 19, scope: !997)
!999 = !DILocation(line: 197, column: 34, scope: !997)
!1000 = !DILocation(line: 197, column: 7, scope: !930)
!1001 = !DILocation(line: 198, column: 5, scope: !997)
!1002 = !DILocation(line: 198, column: 17, scope: !997)
!1003 = !DILocation(line: 198, column: 31, scope: !997)
!1004 = !DILocation(line: 199, column: 49, scope: !930)
!1005 = !DILocation(line: 199, column: 61, scope: !930)
!1006 = !DILocation(line: 199, column: 26, scope: !930)
!1007 = !DILocation(line: 199, column: 3, scope: !930)
!1008 = !DILocation(line: 199, column: 15, scope: !930)
!1009 = !DILocation(line: 199, column: 25, scope: !930)
!1010 = !DILocation(line: 200, column: 7, scope: !1011)
!1011 = distinct !DILexicalBlock(scope: !930, file: !3, line: 200, column: 7)
!1012 = !DILocation(line: 200, column: 19, scope: !1011)
!1013 = !DILocation(line: 200, column: 30, scope: !1011)
!1014 = !DILocation(line: 200, column: 7, scope: !930)
!1015 = !DILocalVariable(name: "message", scope: !1016, file: !3, line: 201, type: !670)
!1016 = distinct !DILexicalBlock(scope: !1011, file: !3, line: 201, column: 5)
!1017 = !DILocation(line: 201, column: 5, scope: !1016)
!1018 = !DILocalVariable(name: "exception", scope: !1016, file: !3, line: 201, type: !752)
!1019 = !DILocation(line: 202, column: 15, scope: !930)
!1020 = !DILocation(line: 202, column: 14, scope: !930)
!1021 = !DILocation(line: 203, column: 7, scope: !1022)
!1022 = distinct !DILexicalBlock(scope: !930, file: !3, line: 203, column: 7)
!1023 = !DILocation(line: 203, column: 19, scope: !1022)
!1024 = !DILocation(line: 203, column: 7, scope: !930)
!1025 = !DILocation(line: 205, column: 44, scope: !1026)
!1026 = distinct !DILexicalBlock(scope: !1022, file: !3, line: 204, column: 5)
!1027 = !DILocation(line: 205, column: 31, scope: !1026)
!1028 = !DILocation(line: 205, column: 7, scope: !1026)
!1029 = !DILocation(line: 205, column: 19, scope: !1026)
!1030 = !DILocation(line: 205, column: 30, scope: !1026)
!1031 = !DILocation(line: 206, column: 33, scope: !1026)
!1032 = !DILocation(line: 206, column: 19, scope: !1026)
!1033 = !DILocation(line: 206, column: 18, scope: !1026)
!1034 = !DILocation(line: 207, column: 5, scope: !1026)
!1035 = !DILocation(line: 208, column: 25, scope: !930)
!1036 = !DILocation(line: 208, column: 3, scope: !930)
!1037 = !DILocation(line: 208, column: 15, scope: !930)
!1038 = !DILocation(line: 208, column: 24, scope: !930)
!1039 = !DILocation(line: 209, column: 3, scope: !930)
!1040 = !DILocation(line: 209, column: 15, scope: !930)
!1041 = !DILocation(line: 209, column: 30, scope: !930)
!1042 = !DILocation(line: 210, column: 30, scope: !930)
!1043 = !DILocation(line: 210, column: 3, scope: !930)
!1044 = !DILocation(line: 210, column: 15, scope: !930)
!1045 = !DILocation(line: 210, column: 29, scope: !930)
!1046 = !DILocation(line: 211, column: 21, scope: !930)
!1047 = !DILocation(line: 211, column: 3, scope: !930)
!1048 = !DILocation(line: 211, column: 15, scope: !930)
!1049 = !DILocation(line: 211, column: 20, scope: !930)
!1050 = !DILocation(line: 212, column: 3, scope: !930)
!1051 = !DILocation(line: 212, column: 15, scope: !930)
!1052 = !DILocation(line: 212, column: 24, scope: !930)
!1053 = !DILocation(line: 213, column: 19, scope: !930)
!1054 = !DILocation(line: 213, column: 10, scope: !930)
!1055 = !DILocation(line: 213, column: 3, scope: !930)
!1056 = distinct !DISubprogram(name: "GetMagickThreadId", scope: !1057, file: !1057, line: 55, type: !1058, scopeLine: 56, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !919)
!1057 = !DIFile(filename: "./magick/thread-private.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!1058 = !DISubroutineType(types: !1059)
!1059 = !{!875}
!1060 = !DILocation(line: 62, column: 10, scope: !1056)
!1061 = !DILocation(line: 62, column: 3, scope: !1056)
!1062 = distinct !DISubprogram(name: "GetOpenMPMaximumThreads", scope: !1057, file: !1057, line: 108, type: !1063, scopeLine: 109, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !919)
!1063 = !DISubroutineType(types: !1064)
!1064 = !{!530}
!1065 = !DILocation(line: 113, column: 3, scope: !1062)
!1066 = distinct !DISubprogram(name: "AcquirePixelCacheNexus", scope: !3, file: !3, line: 238, type: !1067, scopeLine: 239, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !919)
!1067 = !DISubroutineType(types: !1068)
!1068 = !{!568, !813}
!1069 = !DILocalVariable(name: "number_threads", arg: 1, scope: !1066, file: !3, line: 238, type: !813)
!1070 = !DILocation(line: 238, column: 62, scope: !1066)
!1071 = !DILocalVariable(name: "nexus_info", scope: !1066, file: !3, line: 241, type: !1072)
!1072 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !568)
!1073 = !DILocation(line: 241, column: 16, scope: !1066)
!1074 = !DILocalVariable(name: "i", scope: !1066, file: !3, line: 244, type: !581)
!1075 = !DILocation(line: 244, column: 5, scope: !1066)
!1076 = !DILocation(line: 246, column: 29, scope: !1066)
!1077 = !DILocation(line: 246, column: 14, scope: !1066)
!1078 = !DILocation(line: 246, column: 13, scope: !1066)
!1079 = !DILocation(line: 248, column: 7, scope: !1080)
!1080 = distinct !DILexicalBlock(scope: !1066, file: !3, line: 248, column: 7)
!1081 = !DILocation(line: 248, column: 18, scope: !1080)
!1082 = !DILocation(line: 248, column: 7, scope: !1066)
!1083 = !DILocalVariable(name: "message", scope: !1084, file: !3, line: 249, type: !670)
!1084 = distinct !DILexicalBlock(scope: !1080, file: !3, line: 249, column: 5)
!1085 = !DILocation(line: 249, column: 5, scope: !1084)
!1086 = !DILocalVariable(name: "exception", scope: !1084, file: !3, line: 249, type: !752)
!1087 = !DILocation(line: 250, column: 52, scope: !1066)
!1088 = !DILocation(line: 250, column: 31, scope: !1066)
!1089 = !DILocation(line: 250, column: 17, scope: !1066)
!1090 = !DILocation(line: 250, column: 3, scope: !1066)
!1091 = !DILocation(line: 250, column: 16, scope: !1066)
!1092 = !DILocation(line: 252, column: 7, scope: !1093)
!1093 = distinct !DILexicalBlock(scope: !1066, file: !3, line: 252, column: 7)
!1094 = !DILocation(line: 252, column: 21, scope: !1093)
!1095 = !DILocation(line: 252, column: 7, scope: !1066)
!1096 = !DILocalVariable(name: "message", scope: !1097, file: !3, line: 253, type: !670)
!1097 = distinct !DILexicalBlock(scope: !1093, file: !3, line: 253, column: 5)
!1098 = !DILocation(line: 253, column: 5, scope: !1097)
!1099 = !DILocalVariable(name: "exception", scope: !1097, file: !3, line: 253, type: !752)
!1100 = !DILocation(line: 254, column: 28, scope: !1066)
!1101 = !DILocation(line: 254, column: 44, scope: !1066)
!1102 = !DILocation(line: 254, column: 58, scope: !1066)
!1103 = !DILocation(line: 254, column: 10, scope: !1066)
!1104 = !DILocation(line: 255, column: 9, scope: !1105)
!1105 = distinct !DILexicalBlock(scope: !1066, file: !3, line: 255, column: 3)
!1106 = !DILocation(line: 255, column: 8, scope: !1105)
!1107 = !DILocation(line: 255, column: 13, scope: !1108)
!1108 = distinct !DILexicalBlock(scope: !1105, file: !3, line: 255, column: 3)
!1109 = !DILocation(line: 255, column: 27, scope: !1108)
!1110 = !DILocation(line: 255, column: 15, scope: !1108)
!1111 = !DILocation(line: 255, column: 3, scope: !1105)
!1112 = !DILocation(line: 257, column: 21, scope: !1113)
!1113 = distinct !DILexicalBlock(scope: !1108, file: !3, line: 256, column: 3)
!1114 = !DILocation(line: 257, column: 35, scope: !1113)
!1115 = !DILocation(line: 257, column: 5, scope: !1113)
!1116 = !DILocation(line: 257, column: 16, scope: !1113)
!1117 = !DILocation(line: 257, column: 18, scope: !1113)
!1118 = !DILocation(line: 258, column: 5, scope: !1113)
!1119 = !DILocation(line: 258, column: 16, scope: !1113)
!1120 = !DILocation(line: 258, column: 20, scope: !1113)
!1121 = !DILocation(line: 258, column: 29, scope: !1113)
!1122 = !DILocation(line: 259, column: 3, scope: !1113)
!1123 = !DILocation(line: 255, column: 44, scope: !1108)
!1124 = !DILocation(line: 255, column: 3, scope: !1108)
!1125 = distinct !{!1125, !1111, !1126}
!1126 = !DILocation(line: 259, column: 3, scope: !1105)
!1127 = !DILocation(line: 260, column: 10, scope: !1066)
!1128 = !DILocation(line: 260, column: 3, scope: !1066)
!1129 = distinct !DISubprogram(name: "AcquirePixelCachePixels", scope: !3, file: !3, line: 291, type: !1130, scopeLine: 293, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !919)
!1130 = !DISubroutineType(types: !1131)
!1131 = !{!886, !626, !1132, !814}
!1132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64)
!1133 = !DILocalVariable(name: "image", arg: 1, scope: !1129, file: !3, line: 291, type: !626)
!1134 = !DILocation(line: 291, column: 63, scope: !1129)
!1135 = !DILocalVariable(name: "length", arg: 2, scope: !1129, file: !3, line: 292, type: !1132)
!1136 = !DILocation(line: 292, column: 19, scope: !1129)
!1137 = !DILocalVariable(name: "exception", arg: 3, scope: !1129, file: !3, line: 292, type: !814)
!1138 = !DILocation(line: 292, column: 41, scope: !1129)
!1139 = !DILocalVariable(name: "cache_info", scope: !1129, file: !3, line: 295, type: !936)
!1140 = !DILocation(line: 295, column: 15, scope: !1129)
!1141 = !DILocation(line: 302, column: 28, scope: !1129)
!1142 = !DILocation(line: 302, column: 35, scope: !1129)
!1143 = !DILocation(line: 302, column: 14, scope: !1129)
!1144 = !DILocation(line: 302, column: 13, scope: !1129)
!1145 = !DILocation(line: 304, column: 10, scope: !1129)
!1146 = !DILocation(line: 305, column: 4, scope: !1129)
!1147 = !DILocation(line: 305, column: 10, scope: !1129)
!1148 = !DILocation(line: 306, column: 8, scope: !1149)
!1149 = distinct !DILexicalBlock(scope: !1129, file: !3, line: 306, column: 7)
!1150 = !DILocation(line: 306, column: 20, scope: !1149)
!1151 = !DILocation(line: 306, column: 25, scope: !1149)
!1152 = !DILocation(line: 306, column: 41, scope: !1149)
!1153 = !DILocation(line: 306, column: 45, scope: !1149)
!1154 = !DILocation(line: 306, column: 57, scope: !1149)
!1155 = !DILocation(line: 306, column: 62, scope: !1149)
!1156 = !DILocation(line: 306, column: 7, scope: !1129)
!1157 = !DILocation(line: 307, column: 5, scope: !1149)
!1158 = !DILocation(line: 308, column: 11, scope: !1129)
!1159 = !DILocation(line: 308, column: 23, scope: !1129)
!1160 = !DILocation(line: 308, column: 4, scope: !1129)
!1161 = !DILocation(line: 308, column: 10, scope: !1129)
!1162 = !DILocation(line: 309, column: 25, scope: !1129)
!1163 = !DILocation(line: 309, column: 37, scope: !1129)
!1164 = !DILocation(line: 309, column: 10, scope: !1129)
!1165 = !DILocation(line: 309, column: 3, scope: !1129)
!1166 = !DILocation(line: 310, column: 1, scope: !1129)
!1167 = distinct !DISubprogram(name: "CacheComponentGenesis", scope: !3, file: !3, line: 330, type: !1168, scopeLine: 331, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !919)
!1168 = !DISubroutineType(types: !1169)
!1169 = !{!538}
!1170 = !DILocation(line: 332, column: 7, scope: !1171)
!1171 = distinct !DILexicalBlock(scope: !1167, file: !3, line: 332, column: 7)
!1172 = !DILocation(line: 332, column: 23, scope: !1171)
!1173 = !DILocation(line: 332, column: 7, scope: !1167)
!1174 = !DILocation(line: 333, column: 21, scope: !1171)
!1175 = !DILocation(line: 333, column: 20, scope: !1171)
!1176 = !DILocation(line: 333, column: 5, scope: !1171)
!1177 = !DILocation(line: 334, column: 3, scope: !1167)
!1178 = distinct !DISubprogram(name: "CacheComponentTerminus", scope: !3, file: !3, line: 355, type: !1179, scopeLine: 356, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !919)
!1179 = !DISubroutineType(types: !1180)
!1180 = !{null}
!1181 = !DILocation(line: 357, column: 7, scope: !1182)
!1182 = distinct !DILexicalBlock(scope: !1178, file: !3, line: 357, column: 7)
!1183 = !DILocation(line: 357, column: 23, scope: !1182)
!1184 = !DILocation(line: 357, column: 7, scope: !1178)
!1185 = !DILocation(line: 358, column: 5, scope: !1182)
!1186 = !DILocation(line: 359, column: 21, scope: !1178)
!1187 = !DILocation(line: 359, column: 3, scope: !1178)
!1188 = !DILocation(line: 360, column: 20, scope: !1178)
!1189 = !DILocation(line: 361, column: 23, scope: !1178)
!1190 = !DILocation(line: 361, column: 3, scope: !1178)
!1191 = !DILocation(line: 362, column: 3, scope: !1178)
!1192 = !DILocation(line: 363, column: 1, scope: !1178)
!1193 = distinct !DISubprogram(name: "ClonePixelCache", scope: !3, file: !3, line: 493, type: !1194, scopeLine: 494, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !919)
!1194 = !DISubroutineType(types: !1195)
!1195 = !{!885, !1196}
!1196 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !885)
!1197 = !DILocalVariable(name: "cache", arg: 1, scope: !1193, file: !3, line: 493, type: !1196)
!1198 = !DILocation(line: 493, column: 48, scope: !1193)
!1199 = !DILocalVariable(name: "clone_info", scope: !1193, file: !3, line: 496, type: !936)
!1200 = !DILocation(line: 496, column: 15, scope: !1193)
!1201 = !DILocalVariable(name: "cache_info", scope: !1193, file: !3, line: 499, type: !1202)
!1202 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !888)
!1203 = !DILocation(line: 499, column: 15, scope: !1193)
!1204 = !DILocation(line: 502, column: 34, scope: !1193)
!1205 = !DILocation(line: 502, column: 14, scope: !1193)
!1206 = !DILocation(line: 502, column: 13, scope: !1193)
!1207 = !DILocation(line: 504, column: 7, scope: !1208)
!1208 = distinct !DILexicalBlock(scope: !1193, file: !3, line: 504, column: 7)
!1209 = !DILocation(line: 504, column: 19, scope: !1208)
!1210 = !DILocation(line: 504, column: 25, scope: !1208)
!1211 = !DILocation(line: 504, column: 7, scope: !1193)
!1212 = !DILocation(line: 506, column: 7, scope: !1208)
!1213 = !DILocation(line: 506, column: 19, scope: !1208)
!1214 = !DILocation(line: 505, column: 12, scope: !1208)
!1215 = !DILocation(line: 505, column: 5, scope: !1208)
!1216 = !DILocation(line: 507, column: 46, scope: !1193)
!1217 = !DILocation(line: 507, column: 58, scope: !1193)
!1218 = !DILocation(line: 507, column: 28, scope: !1193)
!1219 = !DILocation(line: 507, column: 14, scope: !1193)
!1220 = !DILocation(line: 507, column: 13, scope: !1193)
!1221 = !DILocation(line: 508, column: 7, scope: !1222)
!1222 = distinct !DILexicalBlock(scope: !1193, file: !3, line: 508, column: 7)
!1223 = !DILocation(line: 508, column: 18, scope: !1222)
!1224 = !DILocation(line: 508, column: 7, scope: !1193)
!1225 = !DILocation(line: 509, column: 5, scope: !1222)
!1226 = !DILocation(line: 510, column: 36, scope: !1193)
!1227 = !DILocation(line: 510, column: 48, scope: !1193)
!1228 = !DILocation(line: 510, column: 3, scope: !1193)
!1229 = !DILocation(line: 510, column: 15, scope: !1193)
!1230 = !DILocation(line: 510, column: 35, scope: !1193)
!1231 = !DILocation(line: 511, column: 19, scope: !1193)
!1232 = !DILocation(line: 511, column: 10, scope: !1193)
!1233 = !DILocation(line: 511, column: 3, scope: !1193)
!1234 = !DILocation(line: 512, column: 1, scope: !1193)
!1235 = distinct !DISubprogram(name: "ClonePixelCacheMethods", scope: !3, file: !3, line: 539, type: !1236, scopeLine: 540, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !919)
!1236 = !DISubroutineType(types: !1237)
!1237 = !{null, !885, !1196}
!1238 = !DILocalVariable(name: "clone", arg: 1, scope: !1235, file: !3, line: 539, type: !885)
!1239 = !DILocation(line: 539, column: 48, scope: !1235)
!1240 = !DILocalVariable(name: "cache", arg: 2, scope: !1235, file: !3, line: 539, type: !1196)
!1241 = !DILocation(line: 539, column: 66, scope: !1235)
!1242 = !DILocalVariable(name: "cache_info", scope: !1235, file: !3, line: 542, type: !936)
!1243 = !DILocation(line: 542, column: 15, scope: !1235)
!1244 = !DILocalVariable(name: "source_info", scope: !1235, file: !3, line: 543, type: !936)
!1245 = !DILocation(line: 543, column: 15, scope: !1235)
!1246 = !DILocation(line: 546, column: 29, scope: !1235)
!1247 = !DILocation(line: 546, column: 15, scope: !1235)
!1248 = !DILocation(line: 546, column: 14, scope: !1235)
!1249 = !DILocation(line: 548, column: 7, scope: !1250)
!1250 = distinct !DILexicalBlock(scope: !1235, file: !3, line: 548, column: 7)
!1251 = !DILocation(line: 548, column: 20, scope: !1250)
!1252 = !DILocation(line: 548, column: 26, scope: !1250)
!1253 = !DILocation(line: 548, column: 7, scope: !1235)
!1254 = !DILocation(line: 550, column: 7, scope: !1250)
!1255 = !DILocation(line: 550, column: 20, scope: !1250)
!1256 = !DILocation(line: 549, column: 12, scope: !1250)
!1257 = !DILocation(line: 549, column: 5, scope: !1250)
!1258 = !DILocation(line: 552, column: 28, scope: !1235)
!1259 = !DILocation(line: 552, column: 14, scope: !1235)
!1260 = !DILocation(line: 552, column: 13, scope: !1235)
!1261 = !DILocation(line: 554, column: 3, scope: !1235)
!1262 = !DILocation(line: 554, column: 16, scope: !1235)
!1263 = !DILocation(line: 554, column: 24, scope: !1235)
!1264 = !DILocation(line: 554, column: 36, scope: !1235)
!1265 = !DILocation(line: 555, column: 1, scope: !1235)
!1266 = distinct !DISubprogram(name: "DestroyImagePixels", scope: !3, file: !3, line: 827, type: !863, scopeLine: 828, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !919)
!1267 = !DILocalVariable(name: "image", arg: 1, scope: !1266, file: !3, line: 827, type: !837)
!1268 = !DILocation(line: 827, column: 45, scope: !1266)
!1269 = !DILocalVariable(name: "cache_info", scope: !1266, file: !3, line: 830, type: !936)
!1270 = !DILocation(line: 830, column: 15, scope: !1266)
!1271 = !DILocation(line: 834, column: 7, scope: !1272)
!1272 = distinct !DILexicalBlock(scope: !1266, file: !3, line: 834, column: 7)
!1273 = !DILocation(line: 834, column: 14, scope: !1272)
!1274 = !DILocation(line: 834, column: 20, scope: !1272)
!1275 = !DILocation(line: 834, column: 7, scope: !1266)
!1276 = !DILocation(line: 835, column: 61, scope: !1272)
!1277 = !DILocation(line: 835, column: 68, scope: !1272)
!1278 = !DILocation(line: 835, column: 12, scope: !1272)
!1279 = !DILocation(line: 835, column: 5, scope: !1272)
!1280 = !DILocation(line: 837, column: 28, scope: !1266)
!1281 = !DILocation(line: 837, column: 35, scope: !1266)
!1282 = !DILocation(line: 837, column: 14, scope: !1266)
!1283 = !DILocation(line: 837, column: 13, scope: !1266)
!1284 = !DILocation(line: 839, column: 7, scope: !1285)
!1285 = distinct !DILexicalBlock(scope: !1266, file: !3, line: 839, column: 7)
!1286 = !DILocation(line: 839, column: 19, scope: !1285)
!1287 = !DILocation(line: 839, column: 27, scope: !1285)
!1288 = !DILocation(line: 839, column: 49, scope: !1285)
!1289 = !DILocation(line: 839, column: 7, scope: !1266)
!1290 = !DILocation(line: 841, column: 7, scope: !1291)
!1291 = distinct !DILexicalBlock(scope: !1285, file: !3, line: 840, column: 5)
!1292 = !DILocation(line: 841, column: 19, scope: !1291)
!1293 = !DILocation(line: 841, column: 27, scope: !1291)
!1294 = !DILocation(line: 841, column: 49, scope: !1291)
!1295 = !DILocation(line: 842, column: 7, scope: !1291)
!1296 = !DILocation(line: 844, column: 34, scope: !1266)
!1297 = !DILocation(line: 844, column: 41, scope: !1266)
!1298 = !DILocation(line: 844, column: 16, scope: !1266)
!1299 = !DILocation(line: 844, column: 3, scope: !1266)
!1300 = !DILocation(line: 844, column: 10, scope: !1266)
!1301 = !DILocation(line: 844, column: 15, scope: !1266)
!1302 = !DILocation(line: 845, column: 1, scope: !1266)
!1303 = distinct !DISubprogram(name: "DestroyPixelCache", scope: !3, file: !3, line: 936, type: !1304, scopeLine: 937, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !919)
!1304 = !DISubroutineType(types: !1305)
!1305 = !{!885, !885}
!1306 = !DILocalVariable(name: "cache", arg: 1, scope: !1303, file: !3, line: 936, type: !885)
!1307 = !DILocation(line: 936, column: 44, scope: !1303)
!1308 = !DILocalVariable(name: "cache_info", scope: !1303, file: !3, line: 939, type: !936)
!1309 = !DILocation(line: 939, column: 15, scope: !1303)
!1310 = !DILocation(line: 942, column: 28, scope: !1303)
!1311 = !DILocation(line: 942, column: 14, scope: !1303)
!1312 = !DILocation(line: 942, column: 13, scope: !1303)
!1313 = !DILocation(line: 944, column: 7, scope: !1314)
!1314 = distinct !DILexicalBlock(scope: !1303, file: !3, line: 944, column: 7)
!1315 = !DILocation(line: 944, column: 19, scope: !1314)
!1316 = !DILocation(line: 944, column: 25, scope: !1314)
!1317 = !DILocation(line: 944, column: 7, scope: !1303)
!1318 = !DILocation(line: 946, column: 7, scope: !1314)
!1319 = !DILocation(line: 946, column: 19, scope: !1314)
!1320 = !DILocation(line: 945, column: 12, scope: !1314)
!1321 = !DILocation(line: 945, column: 5, scope: !1314)
!1322 = !DILocation(line: 947, column: 21, scope: !1303)
!1323 = !DILocation(line: 947, column: 33, scope: !1303)
!1324 = !DILocation(line: 947, column: 3, scope: !1303)
!1325 = !DILocation(line: 948, column: 3, scope: !1303)
!1326 = !DILocation(line: 948, column: 15, scope: !1303)
!1327 = !DILocation(line: 948, column: 30, scope: !1303)
!1328 = !DILocation(line: 949, column: 7, scope: !1329)
!1329 = distinct !DILexicalBlock(scope: !1303, file: !3, line: 949, column: 7)
!1330 = !DILocation(line: 949, column: 19, scope: !1329)
!1331 = !DILocation(line: 949, column: 35, scope: !1329)
!1332 = !DILocation(line: 949, column: 7, scope: !1303)
!1333 = !DILocation(line: 951, column: 27, scope: !1334)
!1334 = distinct !DILexicalBlock(scope: !1329, file: !3, line: 950, column: 5)
!1335 = !DILocation(line: 951, column: 39, scope: !1334)
!1336 = !DILocation(line: 951, column: 7, scope: !1334)
!1337 = !DILocation(line: 952, column: 7, scope: !1334)
!1338 = !DILocation(line: 954, column: 23, scope: !1303)
!1339 = !DILocation(line: 954, column: 35, scope: !1303)
!1340 = !DILocation(line: 954, column: 3, scope: !1303)
!1341 = !DILocation(line: 955, column: 7, scope: !1342)
!1342 = distinct !DILexicalBlock(scope: !1303, file: !3, line: 955, column: 7)
!1343 = !DILocation(line: 955, column: 19, scope: !1342)
!1344 = !DILocation(line: 955, column: 25, scope: !1342)
!1345 = !DILocation(line: 955, column: 7, scope: !1303)
!1346 = !DILocalVariable(name: "message", scope: !1347, file: !3, line: 958, type: !610)
!1347 = distinct !DILexicalBlock(scope: !1342, file: !3, line: 956, column: 5)
!1348 = !DILocation(line: 958, column: 9, scope: !1347)
!1349 = !DILocation(line: 960, column: 33, scope: !1347)
!1350 = !DILocation(line: 961, column: 9, scope: !1347)
!1351 = !DILocation(line: 961, column: 21, scope: !1347)
!1352 = !DILocation(line: 960, column: 14, scope: !1347)
!1353 = !DILocation(line: 962, column: 63, scope: !1347)
!1354 = !DILocation(line: 962, column: 14, scope: !1347)
!1355 = !DILocation(line: 963, column: 5, scope: !1347)
!1356 = !DILocation(line: 964, column: 30, scope: !1303)
!1357 = !DILocation(line: 964, column: 3, scope: !1303)
!1358 = !DILocation(line: 965, column: 7, scope: !1359)
!1359 = distinct !DILexicalBlock(scope: !1303, file: !3, line: 965, column: 7)
!1360 = !DILocation(line: 965, column: 19, scope: !1359)
!1361 = !DILocation(line: 965, column: 31, scope: !1359)
!1362 = !DILocation(line: 965, column: 7, scope: !1303)
!1363 = !DILocation(line: 967, column: 7, scope: !1359)
!1364 = !DILocation(line: 967, column: 19, scope: !1359)
!1365 = !DILocation(line: 966, column: 56, scope: !1359)
!1366 = !DILocation(line: 966, column: 29, scope: !1359)
!1367 = !DILocation(line: 966, column: 5, scope: !1359)
!1368 = !DILocation(line: 966, column: 17, scope: !1359)
!1369 = !DILocation(line: 966, column: 28, scope: !1359)
!1370 = !DILocation(line: 968, column: 7, scope: !1371)
!1371 = distinct !DILexicalBlock(scope: !1303, file: !3, line: 968, column: 7)
!1372 = !DILocation(line: 968, column: 19, scope: !1371)
!1373 = !DILocation(line: 968, column: 30, scope: !1371)
!1374 = !DILocation(line: 968, column: 7, scope: !1303)
!1375 = !DILocation(line: 969, column: 51, scope: !1371)
!1376 = !DILocation(line: 969, column: 63, scope: !1371)
!1377 = !DILocation(line: 970, column: 7, scope: !1371)
!1378 = !DILocation(line: 970, column: 19, scope: !1371)
!1379 = !DILocation(line: 969, column: 28, scope: !1371)
!1380 = !DILocation(line: 969, column: 5, scope: !1371)
!1381 = !DILocation(line: 969, column: 17, scope: !1371)
!1382 = !DILocation(line: 969, column: 27, scope: !1371)
!1383 = !DILocation(line: 971, column: 7, scope: !1384)
!1384 = distinct !DILexicalBlock(scope: !1303, file: !3, line: 971, column: 7)
!1385 = !DILocation(line: 971, column: 19, scope: !1384)
!1386 = !DILocation(line: 971, column: 31, scope: !1384)
!1387 = !DILocation(line: 971, column: 7, scope: !1303)
!1388 = !DILocation(line: 972, column: 47, scope: !1384)
!1389 = !DILocation(line: 972, column: 59, scope: !1384)
!1390 = !DILocation(line: 972, column: 29, scope: !1384)
!1391 = !DILocation(line: 972, column: 5, scope: !1384)
!1392 = !DILocation(line: 972, column: 17, scope: !1384)
!1393 = !DILocation(line: 972, column: 28, scope: !1384)
!1394 = !DILocation(line: 973, column: 7, scope: !1395)
!1395 = distinct !DILexicalBlock(scope: !1303, file: !3, line: 973, column: 7)
!1396 = !DILocation(line: 973, column: 19, scope: !1395)
!1397 = !DILocation(line: 973, column: 34, scope: !1395)
!1398 = !DILocation(line: 973, column: 7, scope: !1303)
!1399 = !DILocation(line: 974, column: 27, scope: !1395)
!1400 = !DILocation(line: 974, column: 39, scope: !1395)
!1401 = !DILocation(line: 974, column: 5, scope: !1395)
!1402 = !DILocation(line: 975, column: 7, scope: !1403)
!1403 = distinct !DILexicalBlock(scope: !1303, file: !3, line: 975, column: 7)
!1404 = !DILocation(line: 975, column: 19, scope: !1403)
!1405 = !DILocation(line: 975, column: 29, scope: !1403)
!1406 = !DILocation(line: 975, column: 7, scope: !1303)
!1407 = !DILocation(line: 976, column: 27, scope: !1403)
!1408 = !DILocation(line: 976, column: 39, scope: !1403)
!1409 = !DILocation(line: 976, column: 5, scope: !1403)
!1410 = !DILocation(line: 977, column: 3, scope: !1303)
!1411 = !DILocation(line: 977, column: 15, scope: !1303)
!1412 = !DILocation(line: 977, column: 24, scope: !1303)
!1413 = !DILocation(line: 978, column: 51, scope: !1303)
!1414 = !DILocation(line: 978, column: 28, scope: !1303)
!1415 = !DILocation(line: 978, column: 14, scope: !1303)
!1416 = !DILocation(line: 978, column: 13, scope: !1303)
!1417 = !DILocation(line: 979, column: 8, scope: !1303)
!1418 = !DILocation(line: 980, column: 10, scope: !1303)
!1419 = !DILocation(line: 980, column: 3, scope: !1303)
!1420 = !DILocation(line: 981, column: 1, scope: !1303)
!1421 = distinct !DISubprogram(name: "RelinquishPixelCachePixels", scope: !3, file: !3, line: 885, type: !1422, scopeLine: 886, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !919)
!1422 = !DISubroutineType(types: !1423)
!1423 = !{null, !520}
!1424 = !DILocalVariable(name: "cache_info", arg: 1, scope: !1421, file: !3, line: 885, type: !520)
!1425 = !DILocation(line: 885, column: 58, scope: !1421)
!1426 = !DILocation(line: 887, column: 11, scope: !1421)
!1427 = !DILocation(line: 887, column: 23, scope: !1421)
!1428 = !DILocation(line: 887, column: 3, scope: !1421)
!1429 = !DILocation(line: 891, column: 11, scope: !1430)
!1430 = distinct !DILexicalBlock(scope: !1431, file: !3, line: 891, column: 11)
!1431 = distinct !DILexicalBlock(scope: !1432, file: !3, line: 890, column: 5)
!1432 = distinct !DILexicalBlock(scope: !1421, file: !3, line: 888, column: 3)
!1433 = !DILocation(line: 891, column: 23, scope: !1430)
!1434 = !DILocation(line: 891, column: 30, scope: !1430)
!1435 = !DILocation(line: 891, column: 11, scope: !1431)
!1436 = !DILocation(line: 893, column: 11, scope: !1430)
!1437 = !DILocation(line: 893, column: 23, scope: !1430)
!1438 = !DILocation(line: 892, column: 44, scope: !1430)
!1439 = !DILocation(line: 892, column: 28, scope: !1430)
!1440 = !DILocation(line: 892, column: 9, scope: !1430)
!1441 = !DILocation(line: 892, column: 21, scope: !1430)
!1442 = !DILocation(line: 892, column: 27, scope: !1430)
!1443 = !DILocation(line: 896, column: 28, scope: !1444)
!1444 = distinct !DILexicalBlock(scope: !1430, file: !3, line: 895, column: 9)
!1445 = !DILocation(line: 896, column: 40, scope: !1444)
!1446 = !DILocation(line: 896, column: 56, scope: !1444)
!1447 = !DILocation(line: 896, column: 68, scope: !1444)
!1448 = !DILocation(line: 896, column: 18, scope: !1444)
!1449 = !DILocation(line: 897, column: 11, scope: !1444)
!1450 = !DILocation(line: 897, column: 23, scope: !1444)
!1451 = !DILocation(line: 897, column: 29, scope: !1444)
!1452 = !DILocation(line: 899, column: 47, scope: !1431)
!1453 = !DILocation(line: 899, column: 59, scope: !1431)
!1454 = !DILocation(line: 899, column: 7, scope: !1431)
!1455 = !DILocation(line: 900, column: 7, scope: !1431)
!1456 = !DILocation(line: 904, column: 24, scope: !1457)
!1457 = distinct !DILexicalBlock(scope: !1432, file: !3, line: 903, column: 5)
!1458 = !DILocation(line: 904, column: 36, scope: !1457)
!1459 = !DILocation(line: 904, column: 52, scope: !1457)
!1460 = !DILocation(line: 904, column: 64, scope: !1457)
!1461 = !DILocation(line: 904, column: 14, scope: !1457)
!1462 = !DILocation(line: 905, column: 7, scope: !1457)
!1463 = !DILocation(line: 905, column: 19, scope: !1457)
!1464 = !DILocation(line: 905, column: 25, scope: !1457)
!1465 = !DILocation(line: 906, column: 11, scope: !1466)
!1466 = distinct !DILexicalBlock(scope: !1457, file: !3, line: 906, column: 11)
!1467 = !DILocation(line: 906, column: 23, scope: !1466)
!1468 = !DILocation(line: 906, column: 28, scope: !1466)
!1469 = !DILocation(line: 906, column: 11, scope: !1457)
!1470 = !DILocation(line: 907, column: 45, scope: !1466)
!1471 = !DILocation(line: 907, column: 57, scope: !1466)
!1472 = !DILocation(line: 907, column: 16, scope: !1466)
!1473 = !DILocation(line: 907, column: 9, scope: !1466)
!1474 = !DILocation(line: 908, column: 8, scope: !1457)
!1475 = !DILocation(line: 908, column: 20, scope: !1457)
!1476 = !DILocation(line: 908, column: 7, scope: !1457)
!1477 = !DILocation(line: 908, column: 34, scope: !1457)
!1478 = !DILocation(line: 909, column: 44, scope: !1457)
!1479 = !DILocation(line: 909, column: 56, scope: !1457)
!1480 = !DILocation(line: 909, column: 7, scope: !1457)
!1481 = !DILocation(line: 910, column: 5, scope: !1457)
!1482 = !DILocation(line: 913, column: 11, scope: !1483)
!1483 = distinct !DILexicalBlock(scope: !1484, file: !3, line: 913, column: 11)
!1484 = distinct !DILexicalBlock(scope: !1432, file: !3, line: 912, column: 5)
!1485 = !DILocation(line: 913, column: 23, scope: !1483)
!1486 = !DILocation(line: 913, column: 28, scope: !1483)
!1487 = !DILocation(line: 913, column: 11, scope: !1484)
!1488 = !DILocation(line: 914, column: 38, scope: !1483)
!1489 = !DILocation(line: 914, column: 16, scope: !1483)
!1490 = !DILocation(line: 914, column: 9, scope: !1483)
!1491 = !DILocation(line: 915, column: 11, scope: !1492)
!1492 = distinct !DILexicalBlock(scope: !1484, file: !3, line: 915, column: 11)
!1493 = !DILocation(line: 915, column: 23, scope: !1492)
!1494 = !DILocation(line: 915, column: 28, scope: !1492)
!1495 = !DILocation(line: 915, column: 11, scope: !1484)
!1496 = !DILocation(line: 916, column: 45, scope: !1492)
!1497 = !DILocation(line: 916, column: 57, scope: !1492)
!1498 = !DILocation(line: 916, column: 16, scope: !1492)
!1499 = !DILocation(line: 916, column: 9, scope: !1492)
!1500 = !DILocation(line: 917, column: 8, scope: !1484)
!1501 = !DILocation(line: 917, column: 20, scope: !1484)
!1502 = !DILocation(line: 917, column: 7, scope: !1484)
!1503 = !DILocation(line: 917, column: 34, scope: !1484)
!1504 = !DILocation(line: 918, column: 45, scope: !1484)
!1505 = !DILocation(line: 918, column: 57, scope: !1484)
!1506 = !DILocation(line: 918, column: 7, scope: !1484)
!1507 = !DILocation(line: 919, column: 7, scope: !1484)
!1508 = !DILocation(line: 923, column: 8, scope: !1509)
!1509 = distinct !DILexicalBlock(scope: !1432, file: !3, line: 922, column: 5)
!1510 = !DILocation(line: 923, column: 20, scope: !1509)
!1511 = !DILocation(line: 923, column: 7, scope: !1509)
!1512 = !DILocation(line: 923, column: 34, scope: !1509)
!1513 = !DILocation(line: 925, column: 9, scope: !1509)
!1514 = !DILocation(line: 925, column: 21, scope: !1509)
!1515 = !DILocation(line: 924, column: 45, scope: !1509)
!1516 = !DILocation(line: 924, column: 14, scope: !1509)
!1517 = !DILocation(line: 926, column: 7, scope: !1509)
!1518 = !DILocation(line: 929, column: 7, scope: !1432)
!1519 = !DILocation(line: 931, column: 3, scope: !1421)
!1520 = !DILocation(line: 931, column: 15, scope: !1421)
!1521 = !DILocation(line: 931, column: 19, scope: !1421)
!1522 = !DILocation(line: 932, column: 3, scope: !1421)
!1523 = !DILocation(line: 932, column: 15, scope: !1421)
!1524 = !DILocation(line: 932, column: 21, scope: !1421)
!1525 = !DILocation(line: 933, column: 3, scope: !1421)
!1526 = !DILocation(line: 933, column: 15, scope: !1421)
!1527 = !DILocation(line: 933, column: 22, scope: !1421)
!1528 = !DILocation(line: 934, column: 1, scope: !1421)
!1529 = distinct !DISubprogram(name: "DestroyPixelCacheNexus", scope: !3, file: !3, line: 1022, type: !1530, scopeLine: 1024, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !919)
!1530 = !DISubroutineType(types: !1531)
!1531 = !{!568, !568, !813}
!1532 = !DILocalVariable(name: "nexus_info", arg: 1, scope: !1529, file: !3, line: 1022, type: !568)
!1533 = !DILocation(line: 1022, column: 61, scope: !1529)
!1534 = !DILocalVariable(name: "number_threads", arg: 2, scope: !1529, file: !3, line: 1023, type: !813)
!1535 = !DILocation(line: 1023, column: 16, scope: !1529)
!1536 = !DILocalVariable(name: "i", scope: !1529, file: !3, line: 1026, type: !581)
!1537 = !DILocation(line: 1026, column: 5, scope: !1529)
!1538 = !DILocation(line: 1029, column: 9, scope: !1539)
!1539 = distinct !DILexicalBlock(scope: !1529, file: !3, line: 1029, column: 3)
!1540 = !DILocation(line: 1029, column: 8, scope: !1539)
!1541 = !DILocation(line: 1029, column: 13, scope: !1542)
!1542 = distinct !DILexicalBlock(scope: !1539, file: !3, line: 1029, column: 3)
!1543 = !DILocation(line: 1029, column: 27, scope: !1542)
!1544 = !DILocation(line: 1029, column: 15, scope: !1542)
!1545 = !DILocation(line: 1029, column: 3, scope: !1539)
!1546 = !DILocation(line: 1031, column: 9, scope: !1547)
!1547 = distinct !DILexicalBlock(scope: !1548, file: !3, line: 1031, column: 9)
!1548 = distinct !DILexicalBlock(scope: !1542, file: !3, line: 1030, column: 3)
!1549 = !DILocation(line: 1031, column: 20, scope: !1547)
!1550 = !DILocation(line: 1031, column: 24, scope: !1547)
!1551 = !DILocation(line: 1031, column: 30, scope: !1547)
!1552 = !DILocation(line: 1031, column: 9, scope: !1548)
!1553 = !DILocation(line: 1032, column: 34, scope: !1547)
!1554 = !DILocation(line: 1032, column: 45, scope: !1547)
!1555 = !DILocation(line: 1032, column: 7, scope: !1547)
!1556 = !DILocation(line: 1033, column: 5, scope: !1548)
!1557 = !DILocation(line: 1033, column: 16, scope: !1548)
!1558 = !DILocation(line: 1033, column: 20, scope: !1548)
!1559 = !DILocation(line: 1033, column: 29, scope: !1548)
!1560 = !DILocation(line: 1034, column: 3, scope: !1548)
!1561 = !DILocation(line: 1029, column: 44, scope: !1542)
!1562 = !DILocation(line: 1029, column: 3, scope: !1542)
!1563 = distinct !{!1563, !1545, !1564}
!1564 = !DILocation(line: 1034, column: 3, scope: !1539)
!1565 = !DILocation(line: 1035, column: 54, scope: !1529)
!1566 = !DILocation(line: 1035, column: 31, scope: !1529)
!1567 = !DILocation(line: 1035, column: 17, scope: !1529)
!1568 = !DILocation(line: 1035, column: 3, scope: !1529)
!1569 = !DILocation(line: 1035, column: 16, scope: !1529)
!1570 = !DILocation(line: 1036, column: 53, scope: !1529)
!1571 = !DILocation(line: 1036, column: 29, scope: !1529)
!1572 = !DILocation(line: 1036, column: 14, scope: !1529)
!1573 = !DILocation(line: 1036, column: 13, scope: !1529)
!1574 = !DILocation(line: 1037, column: 10, scope: !1529)
!1575 = !DILocation(line: 1037, column: 3, scope: !1529)
!1576 = distinct !DISubprogram(name: "RelinquishCacheNexusPixels", scope: !3, file: !3, line: 1009, type: !1577, scopeLine: 1010, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !919)
!1577 = !DISubroutineType(types: !1578)
!1578 = !{null, !569}
!1579 = !DILocalVariable(name: "nexus_info", arg: 1, scope: !1576, file: !3, line: 1009, type: !569)
!1580 = !DILocation(line: 1009, column: 58, scope: !1576)
!1581 = !DILocation(line: 1011, column: 7, scope: !1582)
!1582 = distinct !DILexicalBlock(scope: !1576, file: !3, line: 1011, column: 7)
!1583 = !DILocation(line: 1011, column: 19, scope: !1582)
!1584 = !DILocation(line: 1011, column: 26, scope: !1582)
!1585 = !DILocation(line: 1011, column: 7, scope: !1576)
!1586 = !DILocation(line: 1012, column: 36, scope: !1582)
!1587 = !DILocation(line: 1012, column: 48, scope: !1582)
!1588 = !DILocation(line: 1012, column: 12, scope: !1582)
!1589 = !DILocation(line: 1012, column: 5, scope: !1582)
!1590 = !DILocation(line: 1014, column: 22, scope: !1582)
!1591 = !DILocation(line: 1014, column: 34, scope: !1582)
!1592 = !DILocation(line: 1014, column: 49, scope: !1582)
!1593 = !DILocation(line: 1014, column: 61, scope: !1582)
!1594 = !DILocation(line: 1014, column: 12, scope: !1582)
!1595 = !DILocation(line: 1015, column: 3, scope: !1576)
!1596 = !DILocation(line: 1015, column: 15, scope: !1576)
!1597 = !DILocation(line: 1015, column: 20, scope: !1576)
!1598 = !DILocation(line: 1016, column: 3, scope: !1576)
!1599 = !DILocation(line: 1016, column: 15, scope: !1576)
!1600 = !DILocation(line: 1016, column: 21, scope: !1576)
!1601 = !DILocation(line: 1017, column: 3, scope: !1576)
!1602 = !DILocation(line: 1017, column: 15, scope: !1576)
!1603 = !DILocation(line: 1017, column: 22, scope: !1576)
!1604 = !DILocation(line: 1018, column: 3, scope: !1576)
!1605 = !DILocation(line: 1018, column: 15, scope: !1576)
!1606 = !DILocation(line: 1018, column: 21, scope: !1576)
!1607 = !DILocation(line: 1019, column: 3, scope: !1576)
!1608 = !DILocation(line: 1019, column: 15, scope: !1576)
!1609 = !DILocation(line: 1019, column: 21, scope: !1576)
!1610 = !DILocation(line: 1020, column: 1, scope: !1576)
!1611 = distinct !DISubprogram(name: "GetAuthenticIndexQueue", scope: !3, file: !3, line: 1105, type: !841, scopeLine: 1106, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !919)
!1612 = !DILocalVariable(name: "image", arg: 1, scope: !1611, file: !3, line: 1105, type: !626)
!1613 = !DILocation(line: 1105, column: 63, scope: !1611)
!1614 = !DILocalVariable(name: "cache_info", scope: !1611, file: !3, line: 1108, type: !936)
!1615 = !DILocation(line: 1108, column: 15, scope: !1611)
!1616 = !DILocalVariable(name: "id", scope: !1611, file: !3, line: 1111, type: !1617)
!1617 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !445)
!1618 = !DILocation(line: 1111, column: 5, scope: !1611)
!1619 = !DILocation(line: 1111, column: 10, scope: !1611)
!1620 = !DILocation(line: 1116, column: 28, scope: !1611)
!1621 = !DILocation(line: 1116, column: 35, scope: !1611)
!1622 = !DILocation(line: 1116, column: 14, scope: !1611)
!1623 = !DILocation(line: 1116, column: 13, scope: !1611)
!1624 = !DILocation(line: 1118, column: 7, scope: !1625)
!1625 = distinct !DILexicalBlock(scope: !1611, file: !3, line: 1118, column: 7)
!1626 = !DILocation(line: 1118, column: 19, scope: !1625)
!1627 = !DILocation(line: 1118, column: 27, scope: !1625)
!1628 = !DILocation(line: 1118, column: 62, scope: !1625)
!1629 = !DILocation(line: 1118, column: 7, scope: !1611)
!1630 = !DILocation(line: 1120, column: 12, scope: !1625)
!1631 = !DILocation(line: 1120, column: 24, scope: !1625)
!1632 = !DILocation(line: 1120, column: 32, scope: !1625)
!1633 = !DILocation(line: 1120, column: 67, scope: !1625)
!1634 = !DILocation(line: 1120, column: 5, scope: !1625)
!1635 = !DILocation(line: 1122, column: 10, scope: !1611)
!1636 = !DILocation(line: 1122, column: 22, scope: !1611)
!1637 = !DILocation(line: 1122, column: 33, scope: !1611)
!1638 = !DILocation(line: 1122, column: 38, scope: !1611)
!1639 = !DILocation(line: 1122, column: 3, scope: !1611)
!1640 = !DILocation(line: 1123, column: 1, scope: !1611)
!1641 = distinct !DISubprogram(name: "GetOpenMPThreadId", scope: !1057, file: !1057, line: 117, type: !1642, scopeLine: 118, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !919)
!1642 = !DISubroutineType(types: !1643)
!1643 = !{!445}
!1644 = !DILocation(line: 122, column: 3, scope: !1641)
!1645 = distinct !DISubprogram(name: "GetAuthenticPixelCacheNexus", scope: !3, file: !3, line: 1160, type: !1646, scopeLine: 1163, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !919)
!1646 = !DISubroutineType(types: !1647)
!1647 = !{!589, !837, !812, !812, !813, !813, !569, !814}
!1648 = !DILocalVariable(name: "image", arg: 1, scope: !1645, file: !3, line: 1160, type: !837)
!1649 = !DILocation(line: 1160, column: 62, scope: !1645)
!1650 = !DILocalVariable(name: "x", arg: 2, scope: !1645, file: !3, line: 1161, type: !812)
!1651 = !DILocation(line: 1161, column: 17, scope: !1645)
!1652 = !DILocalVariable(name: "y", arg: 3, scope: !1645, file: !3, line: 1161, type: !812)
!1653 = !DILocation(line: 1161, column: 33, scope: !1645)
!1654 = !DILocalVariable(name: "columns", arg: 4, scope: !1645, file: !3, line: 1161, type: !813)
!1655 = !DILocation(line: 1161, column: 48, scope: !1645)
!1656 = !DILocalVariable(name: "rows", arg: 5, scope: !1645, file: !3, line: 1161, type: !813)
!1657 = !DILocation(line: 1161, column: 69, scope: !1645)
!1658 = !DILocalVariable(name: "nexus_info", arg: 6, scope: !1645, file: !3, line: 1162, type: !569)
!1659 = !DILocation(line: 1162, column: 14, scope: !1645)
!1660 = !DILocalVariable(name: "exception", arg: 7, scope: !1645, file: !3, line: 1162, type: !814)
!1661 = !DILocation(line: 1162, column: 40, scope: !1645)
!1662 = !DILocalVariable(name: "cache_info", scope: !1645, file: !3, line: 1165, type: !936)
!1663 = !DILocation(line: 1165, column: 15, scope: !1645)
!1664 = !DILocalVariable(name: "pixels", scope: !1645, file: !3, line: 1168, type: !1665)
!1665 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !589)
!1666 = !DILocation(line: 1168, column: 15, scope: !1645)
!1667 = !DILocation(line: 1175, column: 40, scope: !1645)
!1668 = !DILocation(line: 1175, column: 46, scope: !1645)
!1669 = !DILocation(line: 1175, column: 48, scope: !1645)
!1670 = !DILocation(line: 1175, column: 50, scope: !1645)
!1671 = !DILocation(line: 1175, column: 58, scope: !1645)
!1672 = !DILocation(line: 1176, column: 5, scope: !1645)
!1673 = !DILocation(line: 1176, column: 16, scope: !1645)
!1674 = !DILocation(line: 1175, column: 10, scope: !1645)
!1675 = !DILocation(line: 1175, column: 9, scope: !1645)
!1676 = !DILocation(line: 1177, column: 7, scope: !1677)
!1677 = distinct !DILexicalBlock(scope: !1645, file: !3, line: 1177, column: 7)
!1678 = !DILocation(line: 1177, column: 14, scope: !1677)
!1679 = !DILocation(line: 1177, column: 7, scope: !1645)
!1680 = !DILocation(line: 1178, column: 5, scope: !1677)
!1681 = !DILocation(line: 1179, column: 28, scope: !1645)
!1682 = !DILocation(line: 1179, column: 35, scope: !1645)
!1683 = !DILocation(line: 1179, column: 14, scope: !1645)
!1684 = !DILocation(line: 1179, column: 13, scope: !1645)
!1685 = !DILocation(line: 1181, column: 7, scope: !1686)
!1686 = distinct !DILexicalBlock(scope: !1645, file: !3, line: 1181, column: 7)
!1687 = !DILocation(line: 1181, column: 19, scope: !1686)
!1688 = !DILocation(line: 1181, column: 41, scope: !1686)
!1689 = !DILocation(line: 1181, column: 7, scope: !1645)
!1690 = !DILocation(line: 1182, column: 12, scope: !1686)
!1691 = !DILocation(line: 1182, column: 5, scope: !1686)
!1692 = !DILocation(line: 1183, column: 28, scope: !1693)
!1693 = distinct !DILexicalBlock(scope: !1645, file: !3, line: 1183, column: 7)
!1694 = !DILocation(line: 1183, column: 39, scope: !1693)
!1695 = !DILocation(line: 1183, column: 50, scope: !1693)
