; ModuleID = 'magick/artifact.c'
source_filename = "magick/artifact.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._Image = type { i32, i32, i32, i64, i32, i32, i32, i64, i64, i64, i64, %struct._PixelPacket*, %struct._PixelPacket, %struct._PixelPacket, %struct._PixelPacket, double, %struct._ChromaticityInfo, i32, i8*, i32, i8*, i8*, i8*, i64, double, double, %struct._RectangleInfo, %struct._RectangleInfo, %struct._RectangleInfo, double, double, double, i32, i32, i32, i32, i32, i32, %struct._Image*, i64, i64, i64, i64, i64, i64, %struct._ErrorInfo, %struct._TimerInfo, i32 (i8*, i64, i64, i8*)*, i8*, i8*, i8*, %struct._Ascii85Info*, %struct._BlobInfo*, [4096 x i8], [4096 x i8], [4096 x i8], i64, i64, %struct._ExceptionInfo, i32, i64, %struct.SemaphoreInfo*, %struct._ProfileInfo, %struct._ProfileInfo, %struct._ProfileInfo*, i64, i64, %struct._Image*, %struct._Image*, %struct._Image*, i32, i32, %struct._PixelPacket, %struct._Image*, %struct._RectangleInfo, i8*, i8*, i32, i32, i64, i32, i64, i64, i32, i64 }
%struct._ChromaticityInfo = type { %struct._PrimaryInfo, %struct._PrimaryInfo, %struct._PrimaryInfo, %struct._PrimaryInfo }
%struct._PrimaryInfo = type { double, double, double }
%struct._ErrorInfo = type { double, double, double }
%struct._TimerInfo = type { %struct._Timer, %struct._Timer, i32, i64 }
%struct._Timer = type { double, double, double }

!354 = !DIEnumerator(name: "OptimizeType", value: 10, isUnsigned: true)
!355 = !DIEnumerator(name: "PaletteBilevelMatteType", value: 11, isUnsigned: true)
!356 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !326, line: 67, baseType: !5, size: 32, elements: !357)
!357 = !{!358, !359, !360, !361, !362, !363, !364, !365, !366, !367}
!358 = !DIEnumerator(name: "UndefinedPixelIntensityMethod", value: 0, isUnsigned: true)
!359 = !DIEnumerator(name: "AveragePixelIntensityMethod", value: 1, isUnsigned: true)
!360 = !DIEnumerator(name: "BrightnessPixelIntensityMethod", value: 2, isUnsigned: true)
!361 = !DIEnumerator(name: "LightnessPixelIntensityMethod", value: 3, isUnsigned: true)
!362 = !DIEnumerator(name: "Rec601LumaPixelIntensityMethod", value: 4, isUnsigned: true)
!363 = !DIEnumerator(name: "Rec601LuminancePixelIntensityMethod", value: 5, isUnsigned: true)
!364 = !DIEnumerator(name: "Rec709LumaPixelIntensityMethod", value: 6, isUnsigned: true)
!365 = !DIEnumerator(name: "Rec709LuminancePixelIntensityMethod", value: 7, isUnsigned: true)
!366 = !DIEnumerator(name: "RMSPixelIntensityMethod", value: 8, isUnsigned: true)
!367 = !DIEnumerator(name: "MSPixelIntensityMethod", value: 9, isUnsigned: true)
!368 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !369, line: 34, baseType: !5, size: 32, elements: !370)
!369 = !DIFile(filename: "./magick/log.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!370 = !{!371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392}
!371 = !DIEnumerator(name: "UndefinedEvents", value: 0, isUnsigned: true)
!372 = !DIEnumerator(name: "NoEvents", value: 0, isUnsigned: true)
!373 = !DIEnumerator(name: "TraceEvent", value: 1, isUnsigned: true)
!374 = !DIEnumerator(name: "AnnotateEvent", value: 2, isUnsigned: true)
!375 = !DIEnumerator(name: "BlobEvent", value: 4, isUnsigned: true)
!376 = !DIEnumerator(name: "CacheEvent", value: 8, isUnsigned: true)
!377 = !DIEnumerator(name: "CoderEvent", value: 16, isUnsigned: true)
!378 = !DIEnumerator(name: "ConfigureEvent", value: 32, isUnsigned: true)
!379 = !DIEnumerator(name: "DeprecateEvent", value: 64, isUnsigned: true)
!380 = !DIEnumerator(name: "DrawEvent", value: 128, isUnsigned: true)
!381 = !DIEnumerator(name: "ExceptionEvent", value: 256, isUnsigned: true)
!382 = !DIEnumerator(name: "ImageEvent", value: 512, isUnsigned: true)
!383 = !DIEnumerator(name: "LocaleEvent", value: 1024, isUnsigned: true)
!384 = !DIEnumerator(name: "ModuleEvent", value: 2048, isUnsigned: true)
!385 = !DIEnumerator(name: "PolicyEvent", value: 4096, isUnsigned: true)
!386 = !DIEnumerator(name: "ResourceEvent", value: 8192, isUnsigned: true)
!387 = !DIEnumerator(name: "TransformEvent", value: 16384, isUnsigned: true)
!388 = !DIEnumerator(name: "UserEvent", value: 36864, isUnsigned: true)
!389 = !DIEnumerator(name: "WandEvent", value: 65536, isUnsigned: true)
!390 = !DIEnumerator(name: "X11Event", value: 131072, isUnsigned: true)
!391 = !DIEnumerator(name: "AccelerateEvent", value: 262144, isUnsigned: true)
!392 = !DIEnumerator(name: "AllEvents", value: 2147483647, isUnsigned: true)
!393 = !{!394, !395, !396, !400, !403, !406}
!394 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "SplayTreeInfo", file: !398, line: 26, baseType: !399)
!398 = !DIFile(filename: "./magick/splay-tree.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!399 = !DICompositeType(tag: DW_TAG_structure_type, name: "_SplayTreeInfo", file: !398, line: 25, flags: DIFlagFwdDecl)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64)
!401 = !DISubroutineType(types: !402)
!402 = !{!395, !395}
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!404 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !405)
!405 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64)
!407 = !{i32 7, !"Dwarf Version", i32 4}
!408 = !{i32 2, !"Debug Info Version", i32 3}
!409 = !{i32 1, !"wchar_size", i32 4}
!410 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!411 = distinct !DISubprogram(name: "CloneImageArtifacts", scope: !1, file: !1, line: 100, type: !412, scopeLine: 102, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !632)
!412 = !DISubroutineType(types: !413)
!413 = !{!414, !415, !630}
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickBooleanType", file: !4, line: 215, baseType: !3)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "Image", file: !4, line: 221, baseType: !417)
!417 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Image", file: !77, line: 150, size: 105920, elements: !418)
!418 = !{!419, !421, !423, !425, !428, !430, !431, !432, !433, !434, !435, !436, !447, !448, !449, !450, !452, !466, !468, !469, !471, !472, !473, !474, !480, !481, !482, !490, !491, !492, !493, !494, !495, !497, !499, !501, !503, !505, !507, !509, !510, !511, !512, !513, !514, !515, !523, !538, !550, !551, !552, !553, !557, !561, !565, !566, !567, !568, !569, !587, !588, !590, !591, !601, !602, !604, !605, !606, !607, !608, !609, !611, !612, !613, !614, !615, !616, !617, !619, !620, !621, !622, !623, !627, !629}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "storage_class", scope: !417, file: !77, line: 153, baseType: !420, size: 32)
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "ClassType", file: !4, line: 209, baseType: !9)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !417, file: !77, line: 156, baseType: !422, size: 32, offset: 32)
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorspaceType", file: !15, line: 61, baseType: !14)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !417, file: !77, line: 159, baseType: !424, size: 32, offset: 64)
!424 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompressionType", file: !52, line: 49, baseType: !51)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !417, file: !77, line: 162, baseType: !426, size: 64, offset: 128)
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !427, line: 46, baseType: !394)
!427 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!428 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !417, file: !77, line: 165, baseType: !429, size: 32, offset: 192)
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "OrientationType", file: !77, line: 86, baseType: !76)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "taint", scope: !417, file: !77, line: 168, baseType: !414, size: 32, offset: 224)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "matte", scope: !417, file: !77, line: 169, baseType: !414, size: 32, offset: 256)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !417, file: !77, line: 172, baseType: !426, size: 64, offset: 320)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !417, file: !77, line: 173, baseType: !426, size: 64, offset: 384)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !417, file: !77, line: 174, baseType: !426, size: 64, offset: 448)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !417, file: !77, line: 175, baseType: !426, size: 64, offset: 512)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "colormap", scope: !417, file: !77, line: 178, baseType: !437, size: 64, offset: 576)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelPacket", file: !326, line: 148, baseType: !439)
!439 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PixelPacket", file: !326, line: 131, size: 64, elements: !440)
!440 = !{!441, !444, !445, !446}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !439, file: !326, line: 143, baseType: !442, size: 16)
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "Quantum", file: !4, line: 93, baseType: !443)
!443 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !439, file: !326, line: 144, baseType: !442, size: 16, offset: 16)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !439, file: !326, line: 145, baseType: !442, size: 16, offset: 32)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !439, file: !326, line: 146, baseType: !442, size: 16, offset: 48)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "background_color", scope: !417, file: !77, line: 179, baseType: !438, size: 64, offset: 640)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !417, file: !77, line: 180, baseType: !438, size: 64, offset: 704)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "matte_color", scope: !417, file: !77, line: 181, baseType: !438, size: 64, offset: 768)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !417, file: !77, line: 184, baseType: !451, size: 64, offset: 832)
!451 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "chromaticity", scope: !417, file: !77, line: 187, baseType: !453, size: 768, offset: 896)
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChromaticityInfo", file: !77, line: 128, baseType: !454)
!454 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ChromaticityInfo", file: !77, line: 121, size: 768, elements: !455)
!455 = !{!456, !463, !464, !465}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "red_primary", scope: !454, file: !77, line: 124, baseType: !457, size: 192)
!457 = !DIDerivedType(tag: DW_TAG_typedef, name: "PrimaryInfo", file: !77, line: 101, baseType: !458)
!458 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PrimaryInfo", file: !77, line: 95, size: 192, elements: !459)
!459 = !{!460, !461, !462}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !458, file: !77, line: 98, baseType: !451, size: 64)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !458, file: !77, line: 99, baseType: !451, size: 64, offset: 64)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !458, file: !77, line: 100, baseType: !451, size: 64, offset: 128)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "green_primary", scope: !454, file: !77, line: 125, baseType: !457, size: 192, offset: 192)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "blue_primary", scope: !454, file: !77, line: 126, baseType: !457, size: 192, offset: 384)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "white_point", scope: !454, file: !77, line: 127, baseType: !457, size: 192, offset: 576)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "rendering_intent", scope: !417, file: !77, line: 190, baseType: !467, size: 32, offset: 1664)
!467 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderingIntent", file: !89, line: 49, baseType: !88)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !417, file: !77, line: 193, baseType: !395, size: 64, offset: 1728)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !417, file: !77, line: 196, baseType: !470, size: 32, offset: 1792)
!470 = !DIDerivedType(tag: DW_TAG_typedef, name: "ResolutionType", file: !77, line: 93, baseType: !96)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "montage", scope: !417, file: !77, line: 199, baseType: !406, size: 64, offset: 1856)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "directory", scope: !417, file: !77, line: 200, baseType: !406, size: 64, offset: 1920)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "geometry", scope: !417, file: !77, line: 201, baseType: !406, size: 64, offset: 1984)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !417, file: !77, line: 204, baseType: !475, size: 64, offset: 2048)
!475 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !476, line: 77, baseType: !477)
!476 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!477 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !478, line: 193, baseType: !479)
!478 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!479 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "x_resolution", scope: !417, file: !77, line: 207, baseType: !451, size: 64, offset: 2112)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "y_resolution", scope: !417, file: !77, line: 208, baseType: !451, size: 64, offset: 2176)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !417, file: !77, line: 211, baseType: !483, size: 256, offset: 2240)
!483 = !DIDerivedType(tag: DW_TAG_typedef, name: "RectangleInfo", file: !153, line: 130, baseType: !484)
!484 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_RectangleInfo", file: !153, line: 121, size: 256, elements: !485)
!485 = !{!486, !487, !488, !489}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !484, file: !153, line: 124, baseType: !426, size: 64)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !484, file: !153, line: 125, baseType: !426, size: 64, offset: 64)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !484, file: !153, line: 128, baseType: !475, size: 64, offset: 128)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !484, file: !153, line: 129, baseType: !475, size: 64, offset: 192)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "extract_info", scope: !417, file: !77, line: 212, baseType: !483, size: 256, offset: 2496)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "tile_info", scope: !417, file: !77, line: 213, baseType: !483, size: 256, offset: 2752)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "bias", scope: !417, file: !77, line: 216, baseType: !451, size: 64, offset: 3008)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "blur", scope: !417, file: !77, line: 217, baseType: !451, size: 64, offset: 3072)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !417, file: !77, line: 218, baseType: !451, size: 64, offset: 3136)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !417, file: !77, line: 221, baseType: !496, size: 32, offset: 3200)
!496 = !DIDerivedType(tag: DW_TAG_typedef, name: "FilterTypes", file: !102, line: 66, baseType: !101)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "interlace", scope: !417, file: !77, line: 224, baseType: !498, size: 32, offset: 3232)
!498 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterlaceType", file: !77, line: 73, baseType: !136)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !417, file: !77, line: 227, baseType: !500, size: 32, offset: 3264)
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "EndianType", file: !147, line: 35, baseType: !146)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !417, file: !77, line: 230, baseType: !502, size: 32, offset: 3296)
!502 = !DIDerivedType(tag: DW_TAG_typedef, name: "GravityType", file: !153, line: 91, baseType: !152)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !417, file: !77, line: 233, baseType: !504, size: 32, offset: 3328)
!504 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompositeOperator", file: !168, line: 99, baseType: !167)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "dispose", scope: !417, file: !77, line: 236, baseType: !506, size: 32, offset: 3360)
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "DisposeType", file: !239, line: 32, baseType: !238)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "clip_mask", scope: !417, file: !77, line: 239, baseType: !508, size: 64, offset: 3392)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !417, file: !77, line: 242, baseType: !426, size: 64, offset: 3456)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !417, file: !77, line: 243, baseType: !426, size: 64, offset: 3520)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_second", scope: !417, file: !77, line: 246, baseType: !475, size: 64, offset: 3584)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "iterations", scope: !417, file: !77, line: 249, baseType: !426, size: 64, offset: 3648)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "total_colors", scope: !417, file: !77, line: 250, baseType: !426, size: 64, offset: 3712)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "start_loop", scope: !417, file: !77, line: 253, baseType: !475, size: 64, offset: 3776)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !417, file: !77, line: 256, baseType: !516, size: 192, offset: 3840)
!516 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErrorInfo", file: !517, line: 68, baseType: !518)
!517 = !DIFile(filename: "./magick/color.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!518 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ErrorInfo", file: !517, line: 62, size: 192, elements: !519)
!519 = !{!520, !521, !522}
!520 = !DIDerivedType(tag: DW_TAG_member, name: "mean_error_per_pixel", scope: !518, file: !517, line: 65, baseType: !451, size: 64)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_mean_error", scope: !518, file: !517, line: 66, baseType: !451, size: 64, offset: 64)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_maximum_error", scope: !518, file: !517, line: 67, baseType: !451, size: 64, offset: 128)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !417, file: !77, line: 259, baseType: !524, size: 512, offset: 4032)
!524 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerInfo", file: !247, line: 51, baseType: !525)
!525 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TimerInfo", file: !247, line: 40, size: 512, elements: !526)
!526 = !{!527, !534, !535, !537}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !525, file: !247, line: 43, baseType: !528, size: 192)
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "Timer", file: !247, line: 38, baseType: !529)
!529 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Timer", file: !247, line: 32, size: 192, elements: !530)
!530 = !{!531, !532, !533}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !529, file: !247, line: 35, baseType: !451, size: 64)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !529, file: !247, line: 36, baseType: !451, size: 64, offset: 64)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !529, file: !247, line: 37, baseType: !451, size: 64, offset: 128)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "elapsed", scope: !525, file: !247, line: 44, baseType: !528, size: 192, offset: 192)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !525, file: !247, line: 47, baseType: !536, size: 32, offset: 384)
!536 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerState", file: !247, line: 30, baseType: !246)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !525, file: !247, line: 50, baseType: !426, size: 64, offset: 448)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !417, file: !77, line: 262, baseType: !539, size: 64, offset: 4544)
!539 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickProgressMonitor", file: !540, line: 26, baseType: !541)
!540 = !DIFile(filename: "./magick/monitor.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64)
!542 = !DISubroutineType(types: !543)
!543 = !{!414, !403, !544, !547, !395}
!544 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !545)
!545 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickOffsetType", file: !4, line: 150, baseType: !546)
!546 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!547 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !548)
!548 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickSizeType", file: !4, line: 151, baseType: !549)
!549 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !417, file: !77, line: 265, baseType: !395, size: 64, offset: 4608)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !417, file: !77, line: 266, baseType: !395, size: 64, offset: 4672)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !417, file: !77, line: 267, baseType: !395, size: 64, offset: 4736)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "ascii85", scope: !417, file: !77, line: 270, baseType: !554, size: 64, offset: 4800)
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 64)
!555 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ascii85Info", file: !52, line: 52, baseType: !556)
!556 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Ascii85Info", file: !52, line: 51, flags: DIFlagFwdDecl)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !417, file: !77, line: 273, baseType: !558, size: 64, offset: 4864)
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 64)
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "BlobInfo", file: !4, line: 217, baseType: !560)
!560 = !DICompositeType(tag: DW_TAG_structure_type, name: "_BlobInfo", file: !4, line: 217, flags: DIFlagFwdDecl)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !417, file: !77, line: 276, baseType: !562, size: 32768, offset: 4928)
!562 = !DICompositeType(tag: DW_TAG_array_type, baseType: !405, size: 32768, elements: !563)
!563 = !{!564}
!564 = !DISubrange(count: 4096)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "magick_filename", scope: !417, file: !77, line: 277, baseType: !562, size: 32768, offset: 37696)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !417, file: !77, line: 278, baseType: !562, size: 32768, offset: 70464)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "magick_columns", scope: !417, file: !77, line: 281, baseType: !426, size: 64, offset: 103232)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "magick_rows", scope: !417, file: !77, line: 282, baseType: !426, size: 64, offset: 103296)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "exception", scope: !417, file: !77, line: 285, baseType: !570, size: 448, offset: 103360)
!570 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionInfo", file: !4, line: 219, baseType: !571)
!571 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ExceptionInfo", file: !253, line: 102, size: 448, elements: !572)
!572 = !{!573, !575, !577, !578, !579, !580, !581, !586}
!573 = !DIDerivedType(tag: DW_TAG_member, name: "severity", scope: !571, file: !253, line: 105, baseType: !574, size: 32)
!574 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionType", file: !253, line: 100, baseType: !252)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "error_number", scope: !571, file: !253, line: 108, baseType: !576, size: 32, offset: 32)
!576 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !571, file: !253, line: 111, baseType: !406, size: 64, offset: 64)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !571, file: !253, line: 112, baseType: !406, size: 64, offset: 128)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "exceptions", scope: !571, file: !253, line: 115, baseType: !395, size: 64, offset: 192)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "relinquish", scope: !571, file: !253, line: 118, baseType: !414, size: 32, offset: 256)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !571, file: !253, line: 121, baseType: !582, size: 64, offset: 320)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!583 = !DIDerivedType(tag: DW_TAG_typedef, name: "SemaphoreInfo", file: !584, line: 26, baseType: !585)
!584 = !DIFile(filename: "./magick/semaphore.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!585 = !DICompositeType(tag: DW_TAG_structure_type, name: "SemaphoreInfo", file: !584, line: 25, flags: DIFlagFwdDecl)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !571, file: !253, line: 124, baseType: !426, size: 64, offset: 384)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !417, file: !77, line: 288, baseType: !414, size: 32, offset: 103808)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !417, file: !77, line: 291, baseType: !589, size: 64, offset: 103872)
!589 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !475)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !417, file: !77, line: 294, baseType: !582, size: 64, offset: 103936)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "color_profile", scope: !417, file: !77, line: 297, baseType: !592, size: 256, offset: 104000)
!592 = !DIDerivedType(tag: DW_TAG_typedef, name: "ProfileInfo", file: !89, line: 40, baseType: !593)
!593 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ProfileInfo", file: !89, line: 27, size: 256, elements: !594)
!594 = !{!595, !596, !597, !600}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !593, file: !89, line: 30, baseType: !406, size: 64)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !593, file: !89, line: 33, baseType: !426, size: 64, offset: 64)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !593, file: !89, line: 36, baseType: !598, size: 64, offset: 128)
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !599, size: 64)
!599 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !593, file: !89, line: 39, baseType: !426, size: 64, offset: 192)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "iptc_profile", scope: !417, file: !77, line: 298, baseType: !592, size: 256, offset: 104256)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profile", scope: !417, file: !77, line: 299, baseType: !603, size: 64, offset: 104512)
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profiles", scope: !417, file: !77, line: 302, baseType: !426, size: 64, offset: 104576)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !417, file: !77, line: 305, baseType: !426, size: 64, offset: 104640)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !417, file: !77, line: 308, baseType: !508, size: 64, offset: 104704)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !417, file: !77, line: 309, baseType: !508, size: 64, offset: 104768)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !417, file: !77, line: 310, baseType: !508, size: 64, offset: 104832)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "interpolate", scope: !417, file: !77, line: 313, baseType: !610, size: 32, offset: 104896)
!610 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterpolatePixelMethod", file: !326, line: 47, baseType: !325)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "black_point_compensation", scope: !417, file: !77, line: 316, baseType: !414, size: 32, offset: 104928)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_color", scope: !417, file: !77, line: 319, baseType: !438, size: 64, offset: 104960)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !417, file: !77, line: 322, baseType: !508, size: 64, offset: 105024)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "tile_offset", scope: !417, file: !77, line: 325, baseType: !483, size: 256, offset: 105088)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !417, file: !77, line: 328, baseType: !395, size: 64, offset: 105344)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "artifacts", scope: !417, file: !77, line: 329, baseType: !395, size: 64, offset: 105408)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !417, file: !77, line: 332, baseType: !618, size: 32, offset: 105472)
!618 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageType", file: !77, line: 61, baseType: !342)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !417, file: !77, line: 335, baseType: !414, size: 32, offset: 105504)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !417, file: !77, line: 338, baseType: !548, size: 64, offset: 105536)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "ping", scope: !417, file: !77, line: 341, baseType: !414, size: 32, offset: 105600)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !417, file: !77, line: 344, baseType: !426, size: 64, offset: 105664)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !417, file: !77, line: 347, baseType: !624, size: 64, offset: 105728)
!624 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !625, line: 7, baseType: !626)
!625 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "")
!626 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !478, line: 160, baseType: !479)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "intensity", scope: !417, file: !77, line: 350, baseType: !628, size: 32, offset: 105792)
!628 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelIntensityMethod", file: !326, line: 79, baseType: !356)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !417, file: !77, line: 353, baseType: !426, size: 64, offset: 105856)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64)
!631 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !416)
!632 = !{}
!633 = !DILocalVariable(name: "image", arg: 1, scope: !411, file: !1, line: 100, type: !415)
!634 = !DILocation(line: 100, column: 59, scope: !411)
!635 = !DILocalVariable(name: "clone_image", arg: 2, scope: !411, file: !1, line: 101, type: !630)
!636 = !DILocation(line: 101, column: 16, scope: !411)
!637 = !DILocation(line: 105, column: 7, scope: !638)
!638 = distinct !DILexicalBlock(scope: !411, file: !1, line: 105, column: 7)
!639 = !DILocation(line: 105, column: 14, scope: !638)
!640 = !DILocation(line: 105, column: 20, scope: !638)
!641 = !DILocation(line: 105, column: 7, scope: !411)
!642 = !DILocation(line: 106, column: 61, scope: !638)
!643 = !DILocation(line: 106, column: 68, scope: !638)
!644 = !DILocation(line: 106, column: 12, scope: !638)
!645 = !DILocation(line: 106, column: 5, scope: !638)
!646 = !DILocation(line: 109, column: 7, scope: !647)
!647 = distinct !DILexicalBlock(scope: !411, file: !1, line: 109, column: 7)
!648 = !DILocation(line: 109, column: 20, scope: !647)
!649 = !DILocation(line: 109, column: 26, scope: !647)
!650 = !DILocation(line: 109, column: 7, scope: !411)
!651 = !DILocation(line: 111, column: 7, scope: !647)
!652 = !DILocation(line: 111, column: 20, scope: !647)
!653 = !DILocation(line: 110, column: 12, scope: !647)
!654 = !DILocation(line: 110, column: 5, scope: !647)
!655 = !DILocation(line: 112, column: 7, scope: !656)
!656 = distinct !DILexicalBlock(scope: !411, file: !1, line: 112, column: 7)
!657 = !DILocation(line: 112, column: 20, scope: !656)
!658 = !DILocation(line: 112, column: 30, scope: !656)
!659 = !DILocation(line: 112, column: 7, scope: !411)
!660 = !DILocation(line: 114, column: 11, scope: !661)
!661 = distinct !DILexicalBlock(scope: !662, file: !1, line: 114, column: 11)
!662 = distinct !DILexicalBlock(scope: !656, file: !1, line: 113, column: 5)
!663 = !DILocation(line: 114, column: 18, scope: !661)
!664 = !DILocation(line: 114, column: 28, scope: !661)
!665 = !DILocation(line: 114, column: 11, scope: !662)
!666 = !DILocation(line: 115, column: 31, scope: !661)
!667 = !DILocation(line: 115, column: 9, scope: !661)
!668 = !DILocation(line: 116, column: 57, scope: !662)
!669 = !DILocation(line: 116, column: 70, scope: !662)
!670 = !DILocation(line: 116, column: 39, scope: !662)
!671 = !DILocation(line: 116, column: 24, scope: !662)
!672 = !DILocation(line: 116, column: 7, scope: !662)
!673 = !DILocation(line: 116, column: 14, scope: !662)
!674 = !DILocation(line: 116, column: 23, scope: !662)
!675 = !DILocation(line: 118, column: 5, scope: !662)
!676 = !DILocation(line: 119, column: 3, scope: !411)
!677 = distinct !DISubprogram(name: "DestroyImageArtifacts", scope: !1, file: !1, line: 229, type: !678, scopeLine: 230, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !632)
!678 = !DISubroutineType(types: !679)
!679 = !{null, !415}
!680 = !DILocalVariable(name: "image", arg: 1, scope: !677, file: !1, line: 229, type: !415)
!681 = !DILocation(line: 229, column: 48, scope: !677)
!682 = !DILocation(line: 233, column: 7, scope: !683)
!683 = distinct !DILexicalBlock(scope: !677, file: !1, line: 233, column: 7)
!684 = !DILocation(line: 233, column: 14, scope: !683)
!685 = !DILocation(line: 233, column: 20, scope: !683)
!686 = !DILocation(line: 233, column: 7, scope: !677)
!687 = !DILocation(line: 234, column: 61, scope: !683)
!688 = !DILocation(line: 234, column: 68, scope: !683)
!689 = !DILocation(line: 234, column: 12, scope: !683)
!690 = !DILocation(line: 234, column: 5, scope: !683)
!691 = !DILocation(line: 235, column: 7, scope: !692)
!692 = distinct !DILexicalBlock(scope: !677, file: !1, line: 235, column: 7)
!693 = !DILocation(line: 235, column: 14, scope: !692)
