; ModuleID = 'magick/token.c'
source_filename = "magick/token.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.UTFInfo = type { i32, i32, i32, i32 }
%struct._TokenInfo = type { i32, i32, i64, i8, i64 }
%struct._ExceptionInfo = type { i32, i32, i8*, i8*, i8*, i32, %struct.SemaphoreInfo*, i64 }
%struct.SemaphoreInfo = type opaque
%struct._ImageInfo = type { i32, i32, i32, i32, i32, i32, i8*, i8*, i8*, i8*, i64, i64, i64, i32, i32, i32, i64, i8*, i8*, i8*, i8*, i8*, double, double, %struct._PixelPacket, %struct._PixelPacket, %struct._PixelPacket, i32, i32, i64, i32, i32, i32, i64, i32, i32, i8*, i8*, i32, %struct._Image*, i8*, i32 (i8*, i64, i64, i8*)*, i8*, i8*, i64 (%struct._Image*, i8*, i64)*, %struct._IO_FILE*, i8*, i64, [4096 x i8], [4096 x i8], [4096 x i8], [4096 x i8], i32, i8*, i64, i64, %struct._PixelPacket, i64, i32, %struct._PixelPacket, i8*, i32 }

!428 = !DIEnumerator(name: "BackgroundDispose", value: 2, isUnsigned: true)
!429 = !DIEnumerator(name: "PreviousDispose", value: 3, isUnsigned: true)
!430 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !431, line: 25, baseType: !7, size: 32, elements: !432)
!431 = !DIFile(filename: "./magick/timer.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!432 = !{!433, !434, !435}
!433 = !DIEnumerator(name: "UndefinedTimerState", value: 0, isUnsigned: true)
!434 = !DIEnumerator(name: "StoppedTimerState", value: 1, isUnsigned: true)
!435 = !DIEnumerator(name: "RunningTimerState", value: 2, isUnsigned: true)
!436 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !437, line: 31, baseType: !7, size: 32, elements: !438)
!437 = !DIFile(filename: "./magick/pixel.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!438 = !{!439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452}
!439 = !DIEnumerator(name: "UndefinedInterpolatePixel", value: 0, isUnsigned: true)
!440 = !DIEnumerator(name: "AverageInterpolatePixel", value: 1, isUnsigned: true)
!441 = !DIEnumerator(name: "BicubicInterpolatePixel", value: 2, isUnsigned: true)
!442 = !DIEnumerator(name: "BilinearInterpolatePixel", value: 3, isUnsigned: true)
!443 = !DIEnumerator(name: "FilterInterpolatePixel", value: 4, isUnsigned: true)
!444 = !DIEnumerator(name: "IntegerInterpolatePixel", value: 5, isUnsigned: true)
!445 = !DIEnumerator(name: "MeshInterpolatePixel", value: 6, isUnsigned: true)
!446 = !DIEnumerator(name: "NearestNeighborInterpolatePixel", value: 7, isUnsigned: true)
!447 = !DIEnumerator(name: "SplineInterpolatePixel", value: 8, isUnsigned: true)
!448 = !DIEnumerator(name: "Average9InterpolatePixel", value: 9, isUnsigned: true)
!449 = !DIEnumerator(name: "Average16InterpolatePixel", value: 10, isUnsigned: true)
!450 = !DIEnumerator(name: "BlendInterpolatePixel", value: 11, isUnsigned: true)
!451 = !DIEnumerator(name: "BackgroundInterpolatePixel", value: 12, isUnsigned: true)
!452 = !DIEnumerator(name: "CatromInterpolatePixel", value: 13, isUnsigned: true)
!453 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !437, line: 67, baseType: !7, size: 32, elements: !454)
!454 = !{!455, !456, !457, !458, !459, !460, !461, !462, !463, !464}
!455 = !DIEnumerator(name: "UndefinedPixelIntensityMethod", value: 0, isUnsigned: true)
!456 = !DIEnumerator(name: "AveragePixelIntensityMethod", value: 1, isUnsigned: true)
!457 = !DIEnumerator(name: "BrightnessPixelIntensityMethod", value: 2, isUnsigned: true)
!458 = !DIEnumerator(name: "LightnessPixelIntensityMethod", value: 3, isUnsigned: true)
!459 = !DIEnumerator(name: "Rec601LumaPixelIntensityMethod", value: 4, isUnsigned: true)
!460 = !DIEnumerator(name: "Rec601LuminancePixelIntensityMethod", value: 5, isUnsigned: true)
!461 = !DIEnumerator(name: "Rec709LumaPixelIntensityMethod", value: 6, isUnsigned: true)
!462 = !DIEnumerator(name: "Rec709LuminancePixelIntensityMethod", value: 7, isUnsigned: true)
!463 = !DIEnumerator(name: "RMSPixelIntensityMethod", value: 8, isUnsigned: true)
!464 = !DIEnumerator(name: "MSPixelIntensityMethod", value: 9, isUnsigned: true)
!465 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !466, line: 27, baseType: !7, size: 32, elements: !467)
!466 = !DIFile(filename: "./magick/cache-view.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!467 = !{!468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485}
!468 = !DIEnumerator(name: "UndefinedVirtualPixelMethod", value: 0, isUnsigned: true)
!469 = !DIEnumerator(name: "BackgroundVirtualPixelMethod", value: 1, isUnsigned: true)
!470 = !DIEnumerator(name: "ConstantVirtualPixelMethod", value: 2, isUnsigned: true)
!471 = !DIEnumerator(name: "DitherVirtualPixelMethod", value: 3, isUnsigned: true)
!472 = !DIEnumerator(name: "EdgeVirtualPixelMethod", value: 4, isUnsigned: true)
!473 = !DIEnumerator(name: "MirrorVirtualPixelMethod", value: 5, isUnsigned: true)
!474 = !DIEnumerator(name: "RandomVirtualPixelMethod", value: 6, isUnsigned: true)
!475 = !DIEnumerator(name: "TileVirtualPixelMethod", value: 7, isUnsigned: true)
!476 = !DIEnumerator(name: "TransparentVirtualPixelMethod", value: 8, isUnsigned: true)
!477 = !DIEnumerator(name: "MaskVirtualPixelMethod", value: 9, isUnsigned: true)
!478 = !DIEnumerator(name: "BlackVirtualPixelMethod", value: 10, isUnsigned: true)
!479 = !DIEnumerator(name: "GrayVirtualPixelMethod", value: 11, isUnsigned: true)
!480 = !DIEnumerator(name: "WhiteVirtualPixelMethod", value: 12, isUnsigned: true)
!481 = !DIEnumerator(name: "HorizontalTileVirtualPixelMethod", value: 13, isUnsigned: true)
!482 = !DIEnumerator(name: "VerticalTileVirtualPixelMethod", value: 14, isUnsigned: true)
!483 = !DIEnumerator(name: "HorizontalTileEdgeVirtualPixelMethod", value: 15, isUnsigned: true)
!484 = !DIEnumerator(name: "VerticalTileEdgeVirtualPixelMethod", value: 16, isUnsigned: true)
!485 = !DIEnumerator(name: "CheckerTileVirtualPixelMethod", value: 17, isUnsigned: true)
!486 = !{!487, !508, !507, !493, !509, !510, !497, !511, !512, !514, !503, !7, !505}
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "TokenInfo", file: !489, line: 29, baseType: !490)
!489 = !DIFile(filename: "./magick/token.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!490 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TokenInfo", file: !3, line: 57, size: 256, elements: !491)
!491 = !{!492, !494, !496, !502, !504}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !490, file: !3, line: 60, baseType: !493, size: 32)
!493 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !490, file: !3, line: 63, baseType: !495, size: 32, offset: 32)
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickStatusType", file: !80, line: 147, baseType: !7)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !490, file: !3, line: 66, baseType: !497, size: 64, offset: 64)
!497 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !498, line: 77, baseType: !499)
!498 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!499 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !500, line: 193, baseType: !501)
!500 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!501 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "quote", scope: !490, file: !3, line: 69, baseType: !503, size: 8, offset: 128)
!503 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !490, file: !3, line: 72, baseType: !505, size: 64, offset: 192)
!505 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !506, line: 46, baseType: !507)
!506 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!507 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!509 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!510 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 64)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64)
!513 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !503)
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64)
!515 = !{!0}
!516 = !DIFile(filename: "./magick/token-private.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!517 = !DICompositeType(tag: DW_TAG_array_type, baseType: !518, size: 768, elements: !525)
!518 = !DIDerivedType(tag: DW_TAG_typedef, name: "UTFInfo", file: !516, line: 38, baseType: !519)
!519 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !516, line: 31, size: 128, elements: !520)
!520 = !{!521, !522, !523, !524}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "code_mask", scope: !519, file: !516, line: 34, baseType: !493, size: 32)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "code_value", scope: !519, file: !516, line: 35, baseType: !493, size: 32, offset: 32)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "utf_mask", scope: !519, file: !516, line: 36, baseType: !493, size: 32, offset: 64)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "utf_value", scope: !519, file: !516, line: 37, baseType: !493, size: 32, offset: 96)
!525 = !{!526}
!526 = !DISubrange(count: 6)
!527 = !{i32 7, !"Dwarf Version", i32 4}
!528 = !{i32 2, !"Debug Info Version", i32 3}
!529 = !{i32 1, !"wchar_size", i32 4}
!530 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!531 = distinct !DISubprogram(name: "AcquireTokenInfo", scope: !3, file: !3, line: 93, type: !532, scopeLine: 94, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !534)
!532 = !DISubroutineType(types: !533)
!533 = !{!487}
!534 = !{}
!535 = !DILocalVariable(name: "token_info", scope: !531, file: !3, line: 96, type: !487)
!536 = !DILocation(line: 96, column: 6, scope: !531)
!537 = !DILocation(line: 98, column: 28, scope: !531)
!538 = !DILocation(line: 98, column: 14, scope: !531)
!539 = !DILocation(line: 98, column: 13, scope: !531)
!540 = !DILocation(line: 99, column: 7, scope: !541)
!541 = distinct !DILexicalBlock(scope: !531, file: !3, line: 99, column: 7)
!542 = !DILocation(line: 99, column: 18, scope: !541)
!543 = !DILocation(line: 99, column: 7, scope: !531)
!544 = !DILocalVariable(name: "message", scope: !545, file: !3, line: 100, type: !514)
!545 = distinct !DILexicalBlock(scope: !541, file: !3, line: 100, column: 5)
!546 = !DILocation(line: 100, column: 5, scope: !545)
!547 = !DILocalVariable(name: "exception", scope: !545, file: !3, line: 100, type: !548)
!548 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionInfo", file: !80, line: 219, baseType: !549)
!549 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ExceptionInfo", file: !6, line: 102, size: 448, elements: !550)
!550 = !{!551, !553, !554, !555, !556, !557, !559, !564}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "severity", scope: !549, file: !6, line: 105, baseType: !552, size: 32)
!552 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionType", file: !6, line: 100, baseType: !5)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "error_number", scope: !549, file: !6, line: 108, baseType: !493, size: 32, offset: 32)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !549, file: !6, line: 111, baseType: !514, size: 64, offset: 64)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !549, file: !6, line: 112, baseType: !514, size: 64, offset: 128)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "exceptions", scope: !549, file: !6, line: 115, baseType: !508, size: 64, offset: 192)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "relinquish", scope: !549, file: !6, line: 118, baseType: !558, size: 32, offset: 256)
!558 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickBooleanType", file: !80, line: 215, baseType: !79)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !549, file: !6, line: 121, baseType: !560, size: 64, offset: 320)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64)
!561 = !DIDerivedType(tag: DW_TAG_typedef, name: "SemaphoreInfo", file: !562, line: 26, baseType: !563)
!562 = !DIFile(filename: "./magick/semaphore.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!563 = !DICompositeType(tag: DW_TAG_structure_type, name: "SemaphoreInfo", file: !562, line: 25, flags: DIFlagFwdDecl)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !549, file: !6, line: 124, baseType: !505, size: 64, offset: 384)
!565 = !DILocation(line: 101, column: 3, scope: !531)
!566 = !DILocation(line: 101, column: 15, scope: !531)
!567 = !DILocation(line: 101, column: 24, scope: !531)
!568 = !DILocation(line: 102, column: 10, scope: !531)
!569 = !DILocation(line: 102, column: 3, scope: !531)
!570 = distinct !DISubprogram(name: "DestroyTokenInfo", scope: !3, file: !3, line: 128, type: !571, scopeLine: 129, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !534)
!571 = !DISubroutineType(types: !572)
!572 = !{!487, !487}
!573 = !DILocalVariable(name: "token_info", arg: 1, scope: !570, file: !3, line: 128, type: !487)
!574 = !DILocation(line: 128, column: 53, scope: !570)
!575 = !DILocation(line: 130, column: 10, scope: !570)
!576 = !DILocation(line: 133, column: 3, scope: !570)
!577 = !DILocation(line: 133, column: 15, scope: !570)
!578 = !DILocation(line: 133, column: 24, scope: !570)
!579 = !DILocation(line: 134, column: 51, scope: !570)
!580 = !DILocation(line: 134, column: 28, scope: !570)
!581 = !DILocation(line: 134, column: 14, scope: !570)
!582 = !DILocation(line: 134, column: 13, scope: !570)
!583 = !DILocation(line: 135, column: 10, scope: !570)
!584 = !DILocation(line: 135, column: 3, scope: !570)
!585 = distinct !DISubprogram(name: "GetMagickToken", scope: !3, file: !3, line: 168, type: !586, scopeLine: 169, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !534)
!586 = !DISubroutineType(types: !587)
!587 = !{null, !512, !511, !514}
!588 = !DILocalVariable(name: "start", arg: 1, scope: !585, file: !3, line: 168, type: !512)
!589 = !DILocation(line: 168, column: 46, scope: !585)
!590 = !DILocalVariable(name: "end", arg: 2, scope: !585, file: !3, line: 168, type: !511)
!591 = !DILocation(line: 168, column: 65, scope: !585)
!592 = !DILocalVariable(name: "token", arg: 3, scope: !585, file: !3, line: 168, type: !514)
!593 = !DILocation(line: 168, column: 75, scope: !585)
!594 = !DILocalVariable(name: "value", scope: !585, file: !3, line: 171, type: !595)
!595 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!596 = !DILocation(line: 171, column: 5, scope: !585)
!597 = !DILocalVariable(name: "p", scope: !585, file: !3, line: 174, type: !512)
!598 = !DILocation(line: 174, column: 6, scope: !585)
!599 = !DILocalVariable(name: "i", scope: !585, file: !3, line: 177, type: !497)
!600 = !DILocation(line: 177, column: 5, scope: !585)
!601 = !DILocation(line: 181, column: 4, scope: !585)
!602 = !DILocation(line: 182, column: 5, scope: !585)
!603 = !DILocation(line: 182, column: 4, scope: !585)
!604 = !DILocation(line: 183, column: 3, scope: !585)
!605 = !DILocation(line: 183, column: 11, scope: !585)
!606 = !DILocation(line: 183, column: 47, scope: !585)
!607 = !DILocation(line: 183, column: 53, scope: !585)
!608 = !DILocation(line: 183, column: 58, scope: !585)
!609 = !DILocation(line: 183, column: 57, scope: !585)
!610 = !DILocation(line: 183, column: 60, scope: !585)
!611 = !DILocation(line: 0, scope: !585)
!612 = !DILocation(line: 184, column: 6, scope: !585)
!613 = distinct !{!613, !604, !612}
!614 = !DILocation(line: 185, column: 12, scope: !585)
!615 = !DILocation(line: 185, column: 11, scope: !585)
!616 = !DILocation(line: 185, column: 3, scope: !585)
!617 = !DILocation(line: 188, column: 7, scope: !618)
!618 = distinct !DILexicalBlock(scope: !585, file: !3, line: 186, column: 3)
!619 = !DILocalVariable(name: "escape", scope: !620, file: !3, line: 195, type: !503)
!620 = distinct !DILexicalBlock(scope: !618, file: !3, line: 193, column: 5)
!621 = !DILocation(line: 195, column: 9, scope: !620)
!622 = !DILocation(line: 197, column: 16, scope: !620)
!623 = !DILocation(line: 197, column: 15, scope: !620)
!624 = !DILocation(line: 197, column: 7, scope: !620)
!625 = !DILocation(line: 199, column: 25, scope: !626)
!626 = distinct !DILexicalBlock(scope: !620, file: !3, line: 198, column: 7)
!627 = !DILocation(line: 199, column: 31, scope: !626)
!628 = !DILocation(line: 200, column: 26, scope: !626)
!629 = !DILocation(line: 200, column: 33, scope: !626)
!630 = !DILocation(line: 201, column: 25, scope: !626)
!631 = !DILocation(line: 201, column: 32, scope: !626)
!632 = !DILocation(line: 202, column: 25, scope: !626)
!633 = !DILocation(line: 202, column: 31, scope: !626)
!634 = !DILocation(line: 203, column: 27, scope: !626)
!635 = !DILocation(line: 203, column: 26, scope: !626)
!636 = !DILocation(line: 203, column: 24, scope: !626)
!637 = !DILocation(line: 203, column: 31, scope: !626)
!638 = !DILocation(line: 205, column: 13, scope: !639)
!639 = distinct !DILexicalBlock(scope: !620, file: !3, line: 205, column: 7)
!640 = !DILocation(line: 205, column: 12, scope: !639)
!641 = !DILocation(line: 205, column: 18, scope: !642)
!642 = distinct !DILexicalBlock(scope: !639, file: !3, line: 205, column: 7)
!643 = !DILocation(line: 205, column: 17, scope: !642)
!644 = !DILocation(line: 205, column: 20, scope: !642)
!645 = !DILocation(line: 205, column: 7, scope: !639)
!646 = !DILocation(line: 207, column: 15, scope: !647)
!647 = distinct !DILexicalBlock(scope: !648, file: !3, line: 207, column: 13)
!648 = distinct !DILexicalBlock(scope: !642, file: !3, line: 206, column: 7)
!649 = !DILocation(line: 207, column: 14, scope: !647)
!650 = !DILocation(line: 207, column: 17, scope: !647)
!651 = !DILocation(line: 207, column: 26, scope: !647)
!652 = !DILocation(line: 207, column: 33, scope: !647)
!653 = !DILocation(line: 207, column: 34, scope: !647)
!654 = !DILocation(line: 207, column: 31, scope: !647)
!655 = !DILocation(line: 207, column: 41, scope: !647)
!656 = !DILocation(line: 207, column: 38, scope: !647)
!657 = !DILocation(line: 207, column: 49, scope: !647)
!658 = !DILocation(line: 207, column: 55, scope: !647)
!659 = !DILocation(line: 207, column: 56, scope: !647)
!660 = !DILocation(line: 207, column: 53, scope: !647)
!661 = !DILocation(line: 207, column: 60, scope: !647)
!662 = !DILocation(line: 207, column: 13, scope: !648)
!663 = !DILocation(line: 208, column: 12, scope: !647)
!664 = !DILocation(line: 208, column: 11, scope: !647)
!665 = !DILocation(line: 210, column: 16, scope: !666)
!666 = distinct !DILexicalBlock(scope: !647, file: !3, line: 210, column: 15)
!667 = !DILocation(line: 210, column: 15, scope: !666)
!668 = !DILocation(line: 210, column: 21, scope: !666)
!669 = !DILocation(line: 210, column: 18, scope: !666)
!670 = !DILocation(line: 210, column: 15, scope: !647)
!671 = !DILocation(line: 212, column: 16, scope: !672)
!672 = distinct !DILexicalBlock(scope: !666, file: !3, line: 211, column: 13)
!673 = !DILocation(line: 213, column: 15, scope: !672)
!674 = !DILocation(line: 215, column: 22, scope: !648)
!675 = !DILocation(line: 215, column: 21, scope: !648)
!676 = !DILocation(line: 215, column: 9, scope: !648)
!677 = !DILocation(line: 215, column: 16, scope: !648)
!678 = !DILocation(line: 215, column: 19, scope: !648)
!679 = !DILocation(line: 216, column: 7, scope: !648)
!680 = !DILocation(line: 205, column: 30, scope: !642)
!681 = !DILocation(line: 205, column: 7, scope: !642)
!682 = distinct !{!682, !645, !683}
!683 = !DILocation(line: 216, column: 7, scope: !639)
!684 = !DILocation(line: 217, column: 7, scope: !620)
!685 = !DILocation(line: 221, column: 21, scope: !686)
!686 = distinct !DILexicalBlock(scope: !618, file: !3, line: 220, column: 5)
!687 = !DILocation(line: 221, column: 19, scope: !686)
!688 = !DILocation(line: 221, column: 7, scope: !686)
!689 = !DILocation(line: 221, column: 14, scope: !686)
!690 = !DILocation(line: 221, column: 17, scope: !686)
!691 = !DILocation(line: 222, column: 13, scope: !692)
!692 = distinct !DILexicalBlock(scope: !686, file: !3, line: 222, column: 11)
!693 = !DILocation(line: 222, column: 12, scope: !692)
!694 = !DILocation(line: 222, column: 15, scope: !692)
!695 = !DILocation(line: 222, column: 23, scope: !692)
!696 = !DILocation(line: 222, column: 28, scope: !692)
!697 = !DILocation(line: 222, column: 27, scope: !692)
!698 = !DILocation(line: 222, column: 30, scope: !692)
!699 = !DILocation(line: 222, column: 11, scope: !686)
!700 = !DILocation(line: 223, column: 23, scope: !692)
!701 = !DILocation(line: 223, column: 21, scope: !692)
!702 = !DILocation(line: 223, column: 9, scope: !692)
!703 = !DILocation(line: 223, column: 16, scope: !692)
!704 = !DILocation(line: 223, column: 19, scope: !692)
!705 = !DILocation(line: 224, column: 7, scope: !686)
!706 = !DILocalVariable(name: "q", scope: !707, file: !3, line: 229, type: !514)
!707 = distinct !DILexicalBlock(scope: !618, file: !3, line: 227, column: 5)
!708 = !DILocation(line: 229, column: 10, scope: !707)
!709 = !DILocation(line: 231, column: 28, scope: !707)
!710 = !DILocation(line: 231, column: 13, scope: !707)
!711 = !DILocation(line: 231, column: 12, scope: !707)
!712 = !DILocation(line: 232, column: 14, scope: !707)
!713 = !DILocation(line: 233, column: 12, scope: !714)
!714 = distinct !DILexicalBlock(scope: !707, file: !3, line: 233, column: 11)
!715 = !DILocation(line: 233, column: 17, scope: !714)
!716 = !DILocation(line: 233, column: 14, scope: !714)
!717 = !DILocation(line: 233, column: 20, scope: !714)
!718 = !DILocation(line: 233, column: 25, scope: !714)
!719 = !DILocation(line: 233, column: 24, scope: !714)
!720 = !DILocation(line: 233, column: 27, scope: !714)
!721 = !DILocation(line: 233, column: 11, scope: !707)
!722 = !DILocation(line: 235, column: 11, scope: !723)
!723 = distinct !DILexicalBlock(scope: !714, file: !3, line: 234, column: 9)
!724 = !DILocation(line: 235, column: 20, scope: !725)
!725 = distinct !DILexicalBlock(scope: !726, file: !3, line: 235, column: 11)
!726 = distinct !DILexicalBlock(scope: !723, file: !3, line: 235, column: 11)
!727 = !DILocation(line: 235, column: 24, scope: !725)
!728 = !DILocation(line: 235, column: 22, scope: !725)
!729 = !DILocation(line: 235, column: 27, scope: !725)
!730 = !DILocation(line: 235, column: 32, scope: !725)
!731 = !DILocation(line: 235, column: 31, scope: !725)
!732 = !DILocation(line: 235, column: 34, scope: !725)
!733 = !DILocation(line: 0, scope: !725)
!734 = !DILocation(line: 235, column: 11, scope: !726)
!735 = !DILocation(line: 236, column: 26, scope: !725)
!736 = !DILocation(line: 236, column: 25, scope: !725)
!737 = !DILocation(line: 236, column: 13, scope: !725)
!738 = !DILocation(line: 236, column: 20, scope: !725)
!739 = !DILocation(line: 236, column: 23, scope: !725)
!740 = !DILocation(line: 235, column: 44, scope: !725)
!741 = !DILocation(line: 235, column: 11, scope: !725)
!742 = distinct !{!742, !734, !743}
!743 = !DILocation(line: 236, column: 27, scope: !726)
!744 = !DILocation(line: 237, column: 16, scope: !745)
!745 = distinct !DILexicalBlock(scope: !723, file: !3, line: 237, column: 15)
!746 = !DILocation(line: 237, column: 15, scope: !745)
!747 = !DILocation(line: 237, column: 18, scope: !745)
!748 = !DILocation(line: 237, column: 15, scope: !723)
!749 = !DILocation(line: 238, column: 27, scope: !745)
!750 = !DILocation(line: 238, column: 25, scope: !745)
!751 = !DILocation(line: 238, column: 13, scope: !745)
!752 = !DILocation(line: 238, column: 20, scope: !745)
!753 = !DILocation(line: 238, column: 23, scope: !745)
!754 = !DILocation(line: 239, column: 11, scope: !723)
!755 = !DILocation(line: 241, column: 13, scope: !756)
!756 = distinct !DILexicalBlock(scope: !707, file: !3, line: 241, column: 11)
!757 = !DILocation(line: 241, column: 12, scope: !756)
!758 = !DILocation(line: 241, column: 15, scope: !756)
!759 = !DILocation(line: 241, column: 24, scope: !756)
!760 = !DILocation(line: 241, column: 28, scope: !756)
!761 = !DILocation(line: 241, column: 64, scope: !756)
!762 = !DILocation(line: 241, column: 70, scope: !756)
!763 = !DILocation(line: 242, column: 13, scope: !756)
!764 = !DILocation(line: 242, column: 12, scope: !756)
!765 = !DILocation(line: 242, column: 18, scope: !756)
!766 = !DILocation(line: 242, column: 15, scope: !756)
!767 = !DILocation(line: 242, column: 39, scope: !756)
!768 = !DILocation(line: 242, column: 44, scope: !756)
!769 = !DILocation(line: 242, column: 43, scope: !756)
!770 = !DILocation(line: 242, column: 46, scope: !756)
!771 = !DILocation(line: 242, column: 54, scope: !756)
!772 = !DILocation(line: 242, column: 59, scope: !756)
!773 = !DILocation(line: 242, column: 58, scope: !756)
!774 = !DILocation(line: 242, column: 61, scope: !756)
!775 = !DILocation(line: 241, column: 11, scope: !707)
!776 = !DILocation(line: 244, column: 25, scope: !777)
!777 = distinct !DILexicalBlock(scope: !756, file: !3, line: 243, column: 9)
!778 = !DILocation(line: 244, column: 23, scope: !777)
!779 = !DILocation(line: 244, column: 11, scope: !777)
!780 = !DILocation(line: 244, column: 18, scope: !777)
!781 = !DILocation(line: 244, column: 21, scope: !777)
!782 = !DILocation(line: 245, column: 11, scope: !777)
!783 = !DILocation(line: 247, column: 7, scope: !707)
!784 = !DILocation(line: 247, column: 16, scope: !785)
!785 = distinct !DILexicalBlock(scope: !786, file: !3, line: 247, column: 7)
!786 = distinct !DILexicalBlock(scope: !707, file: !3, line: 247, column: 7)
!787 = !DILocation(line: 247, column: 15, scope: !785)
!788 = !DILocation(line: 247, column: 18, scope: !785)
!789 = !DILocation(line: 247, column: 7, scope: !786)
!790 = !DILocation(line: 249, column: 15, scope: !791)
!791 = distinct !DILexicalBlock(scope: !792, file: !3, line: 249, column: 13)
!792 = distinct !DILexicalBlock(scope: !785, file: !3, line: 248, column: 7)
!793 = !DILocation(line: 249, column: 51, scope: !791)
!794 = !DILocation(line: 249, column: 57, scope: !791)
!795 = !DILocation(line: 249, column: 62, scope: !791)
!796 = !DILocation(line: 249, column: 61, scope: !791)
!797 = !DILocation(line: 249, column: 64, scope: !791)
!798 = !DILocation(line: 249, column: 72, scope: !791)
!799 = !DILocation(line: 250, column: 15, scope: !791)
!800 = !DILocation(line: 250, column: 14, scope: !791)
!801 = !DILocation(line: 250, column: 17, scope: !791)
!802 = !DILocation(line: 250, column: 25, scope: !791)
!803 = !DILocation(line: 250, column: 30, scope: !791)
!804 = !DILocation(line: 250, column: 29, scope: !791)
!805 = !DILocation(line: 250, column: 32, scope: !791)
!806 = !DILocation(line: 250, column: 40, scope: !791)
!807 = !DILocation(line: 250, column: 45, scope: !791)
!808 = !DILocation(line: 250, column: 44, scope: !791)
!809 = !DILocation(line: 250, column: 47, scope: !791)
!810 = !DILocation(line: 250, column: 56, scope: !791)
!811 = !DILocation(line: 250, column: 62, scope: !791)
!812 = !DILocation(line: 250, column: 63, scope: !791)
!813 = !DILocation(line: 250, column: 60, scope: !791)
!814 = !DILocation(line: 250, column: 67, scope: !791)
!815 = !DILocation(line: 249, column: 13, scope: !792)
!816 = !DILocation(line: 251, column: 11, scope: !791)
!817 = !DILocation(line: 252, column: 14, scope: !818)
!818 = distinct !DILexicalBlock(scope: !792, file: !3, line: 252, column: 13)
!819 = !DILocation(line: 252, column: 16, scope: !818)
!820 = !DILocation(line: 252, column: 21, scope: !818)
!821 = !DILocation(line: 252, column: 26, scope: !818)
!822 = !DILocation(line: 252, column: 25, scope: !818)
!823 = !DILocation(line: 252, column: 28, scope: !818)
!824 = !DILocation(line: 252, column: 13, scope: !792)
!825 = !DILocation(line: 253, column: 11, scope: !818)
!826 = !DILocation(line: 254, column: 22, scope: !792)
!827 = !DILocation(line: 254, column: 21, scope: !792)
!828 = !DILocation(line: 254, column: 9, scope: !792)
!829 = !DILocation(line: 254, column: 16, scope: !792)
!830 = !DILocation(line: 254, column: 19, scope: !792)
!831 = !DILocation(line: 255, column: 14, scope: !832)
!832 = distinct !DILexicalBlock(scope: !792, file: !3, line: 255, column: 13)
!833 = !DILocation(line: 255, column: 13, scope: !832)
!834 = !DILocation(line: 255, column: 16, scope: !832)
!835 = !DILocation(line: 255, column: 13, scope: !792)
!836 = !DILocation(line: 256, column: 11, scope: !832)
!837 = !DILocation(line: 257, column: 14, scope: !838)
!838 = distinct !DILexicalBlock(scope: !792, file: !3, line: 257, column: 13)
!839 = !DILocation(line: 257, column: 13, scope: !838)
!840 = !DILocation(line: 257, column: 16, scope: !838)
!841 = !DILocation(line: 257, column: 13, scope: !792)
!842 = !DILocation(line: 258, column: 17, scope: !843)
!843 = distinct !DILexicalBlock(scope: !838, file: !3, line: 258, column: 11)
!844 = !DILocation(line: 258, column: 16, scope: !843)
!845 = !DILocation(line: 258, column: 22, scope: !846)
!846 = distinct !DILexicalBlock(scope: !843, file: !3, line: 258, column: 11)
!847 = !DILocation(line: 258, column: 21, scope: !846)
!848 = !DILocation(line: 258, column: 24, scope: !846)
!849 = !DILocation(line: 258, column: 11, scope: !843)
!850 = !DILocation(line: 260, column: 26, scope: !851)
!851 = distinct !DILexicalBlock(scope: !846, file: !3, line: 259, column: 11)
!852 = !DILocation(line: 260, column: 25, scope: !851)
!853 = !DILocation(line: 260, column: 13, scope: !851)
!854 = !DILocation(line: 260, column: 20, scope: !851)
!855 = !DILocation(line: 260, column: 23, scope: !851)
!856 = !DILocation(line: 261, column: 19, scope: !857)
!857 = distinct !DILexicalBlock(scope: !851, file: !3, line: 261, column: 17)
!858 = !DILocation(line: 261, column: 18, scope: !857)
!859 = !DILocation(line: 261, column: 21, scope: !857)
!860 = !DILocation(line: 261, column: 29, scope: !857)
!861 = !DILocation(line: 261, column: 35, scope: !857)
!862 = !DILocation(line: 261, column: 36, scope: !857)
!863 = !DILocation(line: 261, column: 33, scope: !857)
!864 = !DILocation(line: 261, column: 40, scope: !857)
!865 = !DILocation(line: 261, column: 17, scope: !851)
!866 = !DILocation(line: 262, column: 15, scope: !857)
!867 = !DILocation(line: 263, column: 11, scope: !851)
!868 = !DILocation(line: 258, column: 34, scope: !846)
!869 = !DILocation(line: 258, column: 11, scope: !846)
!870 = distinct !{!870, !849, !871}
!871 = !DILocation(line: 263, column: 11, scope: !843)
!872 = !DILocation(line: 264, column: 7, scope: !792)
!873 = !DILocation(line: 247, column: 28, scope: !785)
!874 = !DILocation(line: 247, column: 7, scope: !785)
!875 = distinct !{!875, !789, !876}
!876 = !DILocation(line: 264, column: 7, scope: !786)
!877 = !DILocation(line: 265, column: 7, scope: !707)
!878 = !DILocation(line: 268, column: 3, scope: !585)
!879 = !DILocation(line: 268, column: 9, scope: !585)
!880 = !DILocation(line: 268, column: 11, scope: !585)
!881 = !DILocation(line: 269, column: 22, scope: !882)
!882 = distinct !DILexicalBlock(scope: !585, file: !3, line: 269, column: 7)
!883 = !DILocation(line: 269, column: 7, scope: !882)
!884 = !DILocation(line: 269, column: 38, scope: !882)
!885 = !DILocation(line: 269, column: 7, scope: !585)
!886 = !DILocalVariable(name: "offset", scope: !887, file: !3, line: 272, type: !497)
!887 = distinct !DILexicalBlock(scope: !882, file: !3, line: 270, column: 5)
!888 = !DILocation(line: 272, column: 9, scope: !887)
!889 = !DILocation(line: 274, column: 13, scope: !887)
!890 = !DILocation(line: 275, column: 11, scope: !891)
!891 = distinct !DILexicalBlock(scope: !887, file: !3, line: 275, column: 11)
!892 = !DILocation(line: 275, column: 17, scope: !891)
!893 = !DILocation(line: 275, column: 25, scope: !891)
!894 = !DILocation(line: 275, column: 11, scope: !887)
!895 = !DILocation(line: 276, column: 15, scope: !891)
!896 = !DILocation(line: 276, column: 9, scope: !891)
!897 = !DILocation(line: 277, column: 26, scope: !887)
!898 = !DILocation(line: 277, column: 19, scope: !887)
!899 = !DILocation(line: 277, column: 8, scope: !887)
!900 = !DILocation(line: 278, column: 31, scope: !887)
!901 = !DILocation(line: 278, column: 37, scope: !887)
!902 = !DILocation(line: 278, column: 43, scope: !887)
!903 = !DILocation(line: 278, column: 42, scope: !887)
!904 = !DILocation(line: 278, column: 14, scope: !887)
!905 = !DILocation(line: 279, column: 7, scope: !887)
!906 = !DILocation(line: 279, column: 13, scope: !887)
!907 = !DILocation(line: 279, column: 15, scope: !887)
!908 = !DILocation(line: 279, column: 14, scope: !887)
!909 = !DILocation(line: 279, column: 21, scope: !887)
!910 = !DILocation(line: 279, column: 24, scope: !887)
!911 = !DILocation(line: 280, column: 5, scope: !887)
!912 = !DILocation(line: 281, column: 3, scope: !585)
!913 = !DILocation(line: 281, column: 10, scope: !585)
!914 = !DILocation(line: 281, column: 46, scope: !585)
!915 = !DILocation(line: 282, column: 6, scope: !585)
!916 = distinct !{!916, !912, !915}
!917 = !DILocation(line: 283, column: 7, scope: !918)
!918 = distinct !DILexicalBlock(scope: !585, file: !3, line: 283, column: 7)
!919 = !DILocation(line: 283, column: 11, scope: !918)
!920 = !DILocation(line: 283, column: 7, scope: !585)
!921 = !DILocation(line: 284, column: 25, scope: !918)
!922 = !DILocation(line: 284, column: 6, scope: !918)
!923 = !DILocation(line: 284, column: 9, scope: !918)
!924 = !DILocation(line: 284, column: 5, scope: !918)
!925 = !DILocation(line: 285, column: 1, scope: !585)
!926 = distinct !DISubprogram(name: "StringToDouble", scope: !927, file: !927, line: 42, type: !928, scopeLine: 44, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !534)
!927 = !DIFile(filename: "./magick/string-private.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!928 = !DISubroutineType(types: !929)
!929 = !{!595, !930, !931}
!930 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !512)
!931 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !932)
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64)
!933 = !DILocalVariable(name: "string", arg: 1, scope: !926, file: !927, line: 42, type: !930)
!934 = !DILocation(line: 42, column: 58, scope: !926)
!935 = !DILocalVariable(name: "sentinal", arg: 2, scope: !926, file: !927, line: 43, type: !931)
!936 = !DILocation(line: 43, column: 19, scope: !926)
!937 = !DILocation(line: 45, column: 31, scope: !926)
!938 = !DILocation(line: 45, column: 38, scope: !926)
!939 = !DILocation(line: 45, column: 10, scope: !926)
!940 = !DILocation(line: 45, column: 3, scope: !926)
!941 = distinct !DISubprogram(name: "GlobExpression", scope: !3, file: !3, line: 315, type: !942, scopeLine: 317, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !534)
!942 = !DISubroutineType(types: !943)
!943 = !{!558, !512, !512, !944}
!944 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !558)
!945 = !DILocalVariable(name: "expression", arg: 1, scope: !941, file: !3, line: 315, type: !512)
!946 = !DILocation(line: 315, column: 59, scope: !941)
!947 = !DILocalVariable(name: "pattern", arg: 2, scope: !941, file: !3, line: 316, type: !512)
!948 = !DILocation(line: 316, column: 15, scope: !941)
!949 = !DILocalVariable(name: "case_insensitive", arg: 3, scope: !941, file: !3, line: 316, type: !944)
!950 = !DILocation(line: 316, column: 47, scope: !941)
!951 = !DILocalVariable(name: "done", scope: !941, file: !3, line: 319, type: !558)
!952 = !DILocation(line: 319, column: 5, scope: !941)
!953 = !DILocalVariable(name: "match", scope: !941, file: !3, line: 320, type: !558)
!954 = !DILocation(line: 320, column: 5, scope: !941)
!955 = !DILocalVariable(name: "p", scope: !941, file: !3, line: 323, type: !512)
!956 = !DILocation(line: 323, column: 6, scope: !941)
!957 = !DILocation(line: 328, column: 7, scope: !958)
!958 = distinct !DILexicalBlock(scope: !941, file: !3, line: 328, column: 7)
!959 = !DILocation(line: 328, column: 15, scope: !958)
!960 = !DILocation(line: 328, column: 7, scope: !941)
!961 = !DILocation(line: 329, column: 5, scope: !958)
!962 = !DILocation(line: 330, column: 18, scope: !963)
!963 = distinct !DILexicalBlock(scope: !941, file: !3, line: 330, column: 7)
!964 = !DILocation(line: 330, column: 7, scope: !963)
!965 = !DILocation(line: 330, column: 27, scope: !963)
!966 = !DILocation(line: 330, column: 7, scope: !941)
!967 = !DILocation(line: 331, column: 5, scope: !963)
!968 = !DILocation(line: 332, column: 21, scope: !969)
!969 = distinct !DILexicalBlock(scope: !941, file: !3, line: 332, column: 7)
!970 = !DILocation(line: 332, column: 7, scope: !969)
!971 = !DILocation(line: 332, column: 34, scope: !969)
!972 = !DILocation(line: 332, column: 7, scope: !941)
!973 = !DILocation(line: 333, column: 5, scope: !969)
!974 = !DILocation(line: 334, column: 5, scope: !941)
!975 = !DILocation(line: 334, column: 20, scope: !941)
!976 = !DILocation(line: 334, column: 13, scope: !941)
!977 = !DILocation(line: 334, column: 12, scope: !941)
!978 = !DILocation(line: 334, column: 28, scope: !941)
!979 = !DILocation(line: 334, column: 4, scope: !941)
!980 = !DILocation(line: 335, column: 19, scope: !981)
!981 = distinct !DILexicalBlock(scope: !941, file: !3, line: 335, column: 7)
!982 = !DILocation(line: 335, column: 8, scope: !981)
!983 = !DILocation(line: 335, column: 22, scope: !981)
!984 = !DILocation(line: 335, column: 30, scope: !981)
!985 = !DILocation(line: 335, column: 41, scope: !981)
!986 = !DILocation(line: 335, column: 34, scope: !981)
!987 = !DILocation(line: 335, column: 54, scope: !981)
!988 = !DILocation(line: 335, column: 7, scope: !941)
!989 = !DILocalVariable(name: "exception", scope: !990, file: !3, line: 338, type: !991)
!990 = distinct !DILexicalBlock(scope: !981, file: !3, line: 336, column: 5)
!991 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64)
!992 = !DILocation(line: 338, column: 10, scope: !990)
!993 = !DILocalVariable(name: "image_info", scope: !990, file: !3, line: 341, type: !994)
!994 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !995, size: 64)
!995 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageInfo", file: !80, line: 223, baseType: !996)
!996 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ImageInfo", file: !150, line: 356, size: 134336, elements: !997)
!997 = !{!998, !1000, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1015, !1017, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1036, !1037, !1038, !1039, !1040, !1041, !1043, !1045, !1047, !1048, !1049, !1050, !1051, !1052, !1054, !1228, !1229, !1230, !1231, !1232, !1243, !1297, !1298, !1299, !1300, !1301, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1309, !1311, !1312, !1313}
!998 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !996, file: !150, line: 359, baseType: !999, size: 32)
!999 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompressionType", file: !125, line: 49, baseType: !124)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !996, file: !150, line: 362, baseType: !1001, size: 32, offset: 32)
!1001 = !DIDerivedType(tag: DW_TAG_typedef, name: "OrientationType", file: !150, line: 86, baseType: !149)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "temporary", scope: !996, file: !150, line: 365, baseType: !558, size: 32, offset: 64)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "adjoin", scope: !996, file: !150, line: 366, baseType: !558, size: 32, offset: 96)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "affirm", scope: !996, file: !150, line: 367, baseType: !558, size: 32, offset: 128)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "antialias", scope: !996, file: !150, line: 368, baseType: !558, size: 32, offset: 160)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !996, file: !150, line: 371, baseType: !514, size: 64, offset: 192)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "extract", scope: !996, file: !150, line: 372, baseType: !514, size: 64, offset: 256)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !996, file: !150, line: 373, baseType: !514, size: 64, offset: 320)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "scenes", scope: !996, file: !150, line: 374, baseType: !514, size: 64, offset: 384)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !996, file: !150, line: 377, baseType: !505, size: 64, offset: 448)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "number_scenes", scope: !996, file: !150, line: 378, baseType: !505, size: 64, offset: 512)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !996, file: !150, line: 379, baseType: !505, size: 64, offset: 576)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "interlace", scope: !996, file: !150, line: 382, baseType: !1014, size: 32, offset: 640)
!1014 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterlaceType", file: !150, line: 73, baseType: !161)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !996, file: !150, line: 385, baseType: !1016, size: 32, offset: 672)
!1016 = !DIDerivedType(tag: DW_TAG_typedef, name: "EndianType", file: !172, line: 35, baseType: !171)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !996, file: !150, line: 388, baseType: !1018, size: 32, offset: 704)
!1018 = !DIDerivedType(tag: DW_TAG_typedef, name: "ResolutionType", file: !150, line: 93, baseType: !177)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !996, file: !150, line: 391, baseType: !505, size: 64, offset: 768)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "sampling_factor", scope: !996, file: !150, line: 394, baseType: !514, size: 64, offset: 832)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "server_name", scope: !996, file: !150, line: 395, baseType: !514, size: 64, offset: 896)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "font", scope: !996, file: !150, line: 396, baseType: !514, size: 64, offset: 960)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "texture", scope: !996, file: !150, line: 397, baseType: !514, size: 64, offset: 1024)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "density", scope: !996, file: !150, line: 398, baseType: !514, size: 64, offset: 1088)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "pointsize", scope: !996, file: !150, line: 401, baseType: !595, size: 64, offset: 1152)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !996, file: !150, line: 402, baseType: !595, size: 64, offset: 1216)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "background_color", scope: !996, file: !150, line: 405, baseType: !1028, size: 64, offset: 1280)
!1028 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelPacket", file: !437, line: 148, baseType: !1029)
!1029 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PixelPacket", file: !437, line: 131, size: 64, elements: !1030)
!1030 = !{!1031, !1033, !1034, !1035}
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !1029, file: !437, line: 143, baseType: !1032, size: 16)
!1032 = !DIDerivedType(tag: DW_TAG_typedef, name: "Quantum", file: !80, line: 93, baseType: !510)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !1029, file: !437, line: 144, baseType: !1032, size: 16, offset: 16)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !1029, file: !437, line: 145, baseType: !1032, size: 16, offset: 32)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !1029, file: !437, line: 146, baseType: !1032, size: 16, offset: 48)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !996, file: !150, line: 406, baseType: !1028, size: 64, offset: 1344)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "matte_color", scope: !996, file: !150, line: 407, baseType: !1028, size: 64, offset: 1408)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !996, file: !150, line: 410, baseType: !558, size: 32, offset: 1472)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "monochrome", scope: !996, file: !150, line: 411, baseType: !558, size: 32, offset: 1504)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !996, file: !150, line: 414, baseType: !505, size: 64, offset: 1536)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !996, file: !150, line: 417, baseType: !1042, size: 32, offset: 1600)
!1042 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorspaceType", file: !183, line: 61, baseType: !182)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !996, file: !150, line: 420, baseType: !1044, size: 32, offset: 1632)
!1044 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageType", file: !150, line: 61, baseType: !219)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "preview_type", scope: !996, file: !150, line: 423, baseType: !1046, size: 32, offset: 1664)
!1046 = !DIDerivedType(tag: DW_TAG_typedef, name: "PreviewType", file: !234, line: 59, baseType: !233)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !996, file: !150, line: 426, baseType: !497, size: 64, offset: 1728)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "ping", scope: !996, file: !150, line: 429, baseType: !558, size: 32, offset: 1792)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !996, file: !150, line: 430, baseType: !558, size: 32, offset: 1824)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !996, file: !150, line: 433, baseType: !514, size: 64, offset: 1856)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "authenticate", scope: !996, file: !150, line: 434, baseType: !514, size: 64, offset: 1920)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !996, file: !150, line: 437, baseType: !1053, size: 32, offset: 1984)
!1053 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChannelType", file: !80, line: 202, baseType: !266)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !996, file: !150, line: 440, baseType: !1055, size: 64, offset: 2048)
!1055 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1056, size: 64)
!1056 = !DIDerivedType(tag: DW_TAG_typedef, name: "Image", file: !80, line: 221, baseType: !1057)
!1057 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Image", file: !150, line: 150, size: 105920, elements: !1058)
!1058 = !{!1059, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1073, !1074, !1075, !1076, !1077, !1091, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1109, !1110, !1111, !1112, !1113, !1114, !1116, !1117, !1118, !1120, !1122, !1124, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1140, !1155, !1167, !1168, !1169, !1170, !1174, !1178, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1190, !1191, !1200, !1201, !1203, !1204, !1205, !1206, !1207, !1208, !1210, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1218, !1219, !1220, !1221, !1225, !1227}
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "storage_class", scope: !1057, file: !150, line: 153, baseType: !1060, size: 32)
!1060 = !DIDerivedType(tag: DW_TAG_typedef, name: "ClassType", file: !80, line: 209, baseType: !288)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1057, file: !150, line: 156, baseType: !1042, size: 32, offset: 32)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !1057, file: !150, line: 159, baseType: !999, size: 32, offset: 64)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1057, file: !150, line: 162, baseType: !505, size: 64, offset: 128)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !1057, file: !150, line: 165, baseType: !1001, size: 32, offset: 192)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "taint", scope: !1057, file: !150, line: 168, baseType: !558, size: 32, offset: 224)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "matte", scope: !1057, file: !150, line: 169, baseType: !558, size: 32, offset: 256)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !1057, file: !150, line: 172, baseType: !505, size: 64, offset: 320)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !1057, file: !150, line: 173, baseType: !505, size: 64, offset: 384)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !1057, file: !150, line: 174, baseType: !505, size: 64, offset: 448)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !1057, file: !150, line: 175, baseType: !505, size: 64, offset: 512)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "colormap", scope: !1057, file: !150, line: 178, baseType: !1072, size: 64, offset: 576)
!1072 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1028, size: 64)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "background_color", scope: !1057, file: !150, line: 179, baseType: !1028, size: 64, offset: 640)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !1057, file: !150, line: 180, baseType: !1028, size: 64, offset: 704)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "matte_color", scope: !1057, file: !150, line: 181, baseType: !1028, size: 64, offset: 768)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !1057, file: !150, line: 184, baseType: !595, size: 64, offset: 832)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "chromaticity", scope: !1057, file: !150, line: 187, baseType: !1078, size: 768, offset: 896)
!1078 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChromaticityInfo", file: !150, line: 128, baseType: !1079)
!1079 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ChromaticityInfo", file: !150, line: 121, size: 768, elements: !1080)
!1080 = !{!1081, !1088, !1089, !1090}
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "red_primary", scope: !1079, file: !150, line: 124, baseType: !1082, size: 192)
!1082 = !DIDerivedType(tag: DW_TAG_typedef, name: "PrimaryInfo", file: !150, line: 101, baseType: !1083)
!1083 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PrimaryInfo", file: !150, line: 95, size: 192, elements: !1084)
!1084 = !{!1085, !1086, !1087}
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1083, file: !150, line: 98, baseType: !595, size: 64)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1083, file: !150, line: 99, baseType: !595, size: 64, offset: 64)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !1083, file: !150, line: 100, baseType: !595, size: 64, offset: 128)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "green_primary", scope: !1079, file: !150, line: 125, baseType: !1082, size: 192, offset: 192)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "blue_primary", scope: !1079, file: !150, line: 126, baseType: !1082, size: 192, offset: 384)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "white_point", scope: !1079, file: !150, line: 127, baseType: !1082, size: 192, offset: 576)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "rendering_intent", scope: !1057, file: !150, line: 190, baseType: !1092, size: 32, offset: 1664)
!1092 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderingIntent", file: !294, line: 49, baseType: !293)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1057, file: !150, line: 193, baseType: !508, size: 64, offset: 1728)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !1057, file: !150, line: 196, baseType: !1018, size: 32, offset: 1792)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "montage", scope: !1057, file: !150, line: 199, baseType: !514, size: 64, offset: 1856)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "directory", scope: !1057, file: !150, line: 200, baseType: !514, size: 64, offset: 1920)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "geometry", scope: !1057, file: !150, line: 201, baseType: !514, size: 64, offset: 1984)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1057, file: !150, line: 204, baseType: !497, size: 64, offset: 2048)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "x_resolution", scope: !1057, file: !150, line: 207, baseType: !595, size: 64, offset: 2112)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "y_resolution", scope: !1057, file: !150, line: 208, baseType: !595, size: 64, offset: 2176)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !1057, file: !150, line: 211, baseType: !1102, size: 256, offset: 2240)
!1102 = !DIDerivedType(tag: DW_TAG_typedef, name: "RectangleInfo", file: !337, line: 130, baseType: !1103)
!1103 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_RectangleInfo", file: !337, line: 121, size: 256, elements: !1104)
!1104 = !{!1105, !1106, !1107, !1108}
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1103, file: !337, line: 124, baseType: !505, size: 64)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1103, file: !337, line: 125, baseType: !505, size: 64, offset: 64)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1103, file: !337, line: 128, baseType: !497, size: 64, offset: 128)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1103, file: !337, line: 129, baseType: !497, size: 64, offset: 192)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "extract_info", scope: !1057, file: !150, line: 212, baseType: !1102, size: 256, offset: 2496)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "tile_info", scope: !1057, file: !150, line: 213, baseType: !1102, size: 256, offset: 2752)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "bias", scope: !1057, file: !150, line: 216, baseType: !595, size: 64, offset: 3008)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "blur", scope: !1057, file: !150, line: 217, baseType: !595, size: 64, offset: 3072)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !1057, file: !150, line: 218, baseType: !595, size: 64, offset: 3136)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1057, file: !150, line: 221, baseType: !1115, size: 32, offset: 3200)
!1115 = !DIDerivedType(tag: DW_TAG_typedef, name: "FilterTypes", file: !302, line: 66, baseType: !301)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "interlace", scope: !1057, file: !150, line: 224, baseType: !1014, size: 32, offset: 3232)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !1057, file: !150, line: 227, baseType: !1016, size: 32, offset: 3264)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !1057, file: !150, line: 230, baseType: !1119, size: 32, offset: 3296)
!1119 = !DIDerivedType(tag: DW_TAG_typedef, name: "GravityType", file: !337, line: 91, baseType: !336)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !1057, file: !150, line: 233, baseType: !1121, size: 32, offset: 3328)
!1121 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompositeOperator", file: !352, line: 99, baseType: !351)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "dispose", scope: !1057, file: !150, line: 236, baseType: !1123, size: 32, offset: 3360)
!1123 = !DIDerivedType(tag: DW_TAG_typedef, name: "DisposeType", file: !423, line: 32, baseType: !422)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "clip_mask", scope: !1057, file: !150, line: 239, baseType: !1125, size: 64, offset: 3392)
!1125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1057, size: 64)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !1057, file: !150, line: 242, baseType: !505, size: 64, offset: 3456)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1057, file: !150, line: 243, baseType: !505, size: 64, offset: 3520)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_second", scope: !1057, file: !150, line: 246, baseType: !497, size: 64, offset: 3584)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "iterations", scope: !1057, file: !150, line: 249, baseType: !505, size: 64, offset: 3648)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "total_colors", scope: !1057, file: !150, line: 250, baseType: !505, size: 64, offset: 3712)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "start_loop", scope: !1057, file: !150, line: 253, baseType: !497, size: 64, offset: 3776)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1057, file: !150, line: 256, baseType: !1133, size: 192, offset: 3840)
!1133 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErrorInfo", file: !1134, line: 68, baseType: !1135)
!1134 = !DIFile(filename: "./magick/color.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!1135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ErrorInfo", file: !1134, line: 62, size: 192, elements: !1136)
!1136 = !{!1137, !1138, !1139}
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "mean_error_per_pixel", scope: !1135, file: !1134, line: 65, baseType: !595, size: 64)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_mean_error", scope: !1135, file: !1134, line: 66, baseType: !595, size: 64, offset: 64)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_maximum_error", scope: !1135, file: !1134, line: 67, baseType: !595, size: 64, offset: 128)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !1057, file: !150, line: 259, baseType: !1141, size: 512, offset: 4032)
!1141 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerInfo", file: !431, line: 51, baseType: !1142)
!1142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TimerInfo", file: !431, line: 40, size: 512, elements: !1143)
!1143 = !{!1144, !1151, !1152, !1154}
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !1142, file: !431, line: 43, baseType: !1145, size: 192)
!1145 = !DIDerivedType(tag: DW_TAG_typedef, name: "Timer", file: !431, line: 38, baseType: !1146)
!1146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Timer", file: !431, line: 32, size: 192, elements: !1147)
!1147 = !{!1148, !1149, !1150}
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !1146, file: !431, line: 35, baseType: !595, size: 64)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !1146, file: !431, line: 36, baseType: !595, size: 64, offset: 64)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !1146, file: !431, line: 37, baseType: !595, size: 64, offset: 128)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "elapsed", scope: !1142, file: !431, line: 44, baseType: !1145, size: 192, offset: 192)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1142, file: !431, line: 47, baseType: !1153, size: 32, offset: 384)
!1153 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerState", file: !431, line: 30, baseType: !430)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !1142, file: !431, line: 50, baseType: !505, size: 64, offset: 448)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !1057, file: !150, line: 262, baseType: !1156, size: 64, offset: 4544)
!1156 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickProgressMonitor", file: !1157, line: 26, baseType: !1158)
!1157 = !DIFile(filename: "./magick/monitor.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!1158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1159, size: 64)
!1159 = !DISubroutineType(types: !1160)
!1160 = !{!558, !512, !1161, !1164, !508}
!1161 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1162)
!1162 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickOffsetType", file: !80, line: 150, baseType: !1163)
!1163 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!1164 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1165)
!1165 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickSizeType", file: !80, line: 151, baseType: !1166)
!1166 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !1057, file: !150, line: 265, baseType: !508, size: 64, offset: 4608)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !1057, file: !150, line: 266, baseType: !508, size: 64, offset: 4672)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1057, file: !150, line: 267, baseType: !508, size: 64, offset: 4736)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "ascii85", scope: !1057, file: !150, line: 270, baseType: !1171, size: 64, offset: 4800)
!1171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1172, size: 64)
!1172 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ascii85Info", file: !125, line: 52, baseType: !1173)
!1173 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Ascii85Info", file: !125, line: 51, flags: DIFlagFwdDecl)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !1057, file: !150, line: 273, baseType: !1175, size: 64, offset: 4864)
!1175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1176, size: 64)
!1176 = !DIDerivedType(tag: DW_TAG_typedef, name: "BlobInfo", file: !80, line: 217, baseType: !1177)
!1177 = !DICompositeType(tag: DW_TAG_structure_type, name: "_BlobInfo", file: !80, line: 217, flags: DIFlagFwdDecl)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !1057, file: !150, line: 276, baseType: !1179, size: 32768, offset: 4928)
!1179 = !DICompositeType(tag: DW_TAG_array_type, baseType: !503, size: 32768, elements: !1180)
!1180 = !{!1181}
!1181 = !DISubrange(count: 4096)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "magick_filename", scope: !1057, file: !150, line: 277, baseType: !1179, size: 32768, offset: 37696)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !1057, file: !150, line: 278, baseType: !1179, size: 32768, offset: 70464)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "magick_columns", scope: !1057, file: !150, line: 281, baseType: !505, size: 64, offset: 103232)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "magick_rows", scope: !1057, file: !150, line: 282, baseType: !505, size: 64, offset: 103296)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "exception", scope: !1057, file: !150, line: 285, baseType: !548, size: 448, offset: 103360)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1057, file: !150, line: 288, baseType: !558, size: 32, offset: 103808)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !1057, file: !150, line: 291, baseType: !1189, size: 64, offset: 103872)
!1189 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !497)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !1057, file: !150, line: 294, baseType: !560, size: 64, offset: 103936)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "color_profile", scope: !1057, file: !150, line: 297, baseType: !1192, size: 256, offset: 104000)
!1192 = !DIDerivedType(tag: DW_TAG_typedef, name: "ProfileInfo", file: !294, line: 40, baseType: !1193)
!1193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ProfileInfo", file: !294, line: 27, size: 256, elements: !1194)
!1194 = !{!1195, !1196, !1197, !1199}
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1193, file: !294, line: 30, baseType: !514, size: 64)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1193, file: !294, line: 33, baseType: !505, size: 64, offset: 64)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !1193, file: !294, line: 36, baseType: !1198, size: 64, offset: 128)
!1198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !1193, file: !294, line: 39, baseType: !505, size: 64, offset: 192)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "iptc_profile", scope: !1057, file: !150, line: 298, baseType: !1192, size: 256, offset: 104256)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profile", scope: !1057, file: !150, line: 299, baseType: !1202, size: 64, offset: 104512)
!1202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1192, size: 64)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profiles", scope: !1057, file: !150, line: 302, baseType: !505, size: 64, offset: 104576)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !1057, file: !150, line: 305, baseType: !505, size: 64, offset: 104640)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !1057, file: !150, line: 308, baseType: !1125, size: 64, offset: 104704)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !1057, file: !150, line: 309, baseType: !1125, size: 64, offset: 104768)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1057, file: !150, line: 310, baseType: !1125, size: 64, offset: 104832)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "interpolate", scope: !1057, file: !150, line: 313, baseType: !1209, size: 32, offset: 104896)
!1209 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterpolatePixelMethod", file: !437, line: 47, baseType: !436)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "black_point_compensation", scope: !1057, file: !150, line: 316, baseType: !558, size: 32, offset: 104928)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_color", scope: !1057, file: !150, line: 319, baseType: !1028, size: 64, offset: 104960)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !1057, file: !150, line: 322, baseType: !1125, size: 64, offset: 105024)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "tile_offset", scope: !1057, file: !150, line: 325, baseType: !1102, size: 256, offset: 105088)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !1057, file: !150, line: 328, baseType: !508, size: 64, offset: 105344)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "artifacts", scope: !1057, file: !150, line: 329, baseType: !508, size: 64, offset: 105408)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1057, file: !150, line: 332, baseType: !1044, size: 32, offset: 105472)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !1057, file: !150, line: 335, baseType: !558, size: 32, offset: 105504)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !1057, file: !150, line: 338, baseType: !1165, size: 64, offset: 105536)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "ping", scope: !1057, file: !150, line: 341, baseType: !558, size: 32, offset: 105600)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1057, file: !150, line: 344, baseType: !505, size: 64, offset: 105664)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !1057, file: !150, line: 347, baseType: !1222, size: 64, offset: 105728)
!1222 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !1223, line: 7, baseType: !1224)
!1223 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "")
!1224 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !500, line: 160, baseType: !501)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "intensity", scope: !1057, file: !150, line: 350, baseType: !1226, size: 32, offset: 105792)
!1226 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelIntensityMethod", file: !437, line: 79, baseType: !453)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1057, file: !150, line: 353, baseType: !505, size: 64, offset: 105856)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !996, file: !150, line: 443, baseType: !508, size: 64, offset: 2112)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !996, file: !150, line: 446, baseType: !1156, size: 64, offset: 2176)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !996, file: !150, line: 449, baseType: !508, size: 64, offset: 2240)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !996, file: !150, line: 450, baseType: !508, size: 64, offset: 2304)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !996, file: !150, line: 453, baseType: !1233, size: 64, offset: 2368)
!1233 = !DIDerivedType(tag: DW_TAG_typedef, name: "StreamHandler", file: !1234, line: 26, baseType: !1235)
!1234 = !DIFile(filename: "./magick/stream.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!1235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1236, size: 64)
!1236 = !DISubroutineType(types: !1237)
!1237 = !{!505, !1238, !1240, !1242}
!1238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1239, size: 64)
!1239 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1056)
!1240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1241, size: 64)
!1241 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1242 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !505)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !996, file: !150, line: 456, baseType: !1244, size: 64, offset: 2432)
!1244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1245, size: 64)
!1245 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !1246, line: 7, baseType: !1247)
!1246 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!1247 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !1248, line: 49, size: 1728, elements: !1249)
!1248 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!1249 = !{!1250, !1251, !1252, !1253, !1254, !1255, !1256, !1257, !1258, !1259, !1260, !1261, !1262, !1265, !1267, !1268, !1269, !1271, !1272, !1274, !1278, !1281, !1283, !1286, !1289, !1290, !1291, !1292, !1293}
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1247, file: !1248, line: 51, baseType: !493, size: 32)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1247, file: !1248, line: 54, baseType: !514, size: 64, offset: 64)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1247, file: !1248, line: 55, baseType: !514, size: 64, offset: 128)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1247, file: !1248, line: 56, baseType: !514, size: 64, offset: 192)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1247, file: !1248, line: 57, baseType: !514, size: 64, offset: 256)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1247, file: !1248, line: 58, baseType: !514, size: 64, offset: 320)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1247, file: !1248, line: 59, baseType: !514, size: 64, offset: 384)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1247, file: !1248, line: 60, baseType: !514, size: 64, offset: 448)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !1247, file: !1248, line: 61, baseType: !514, size: 64, offset: 512)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !1247, file: !1248, line: 64, baseType: !514, size: 64, offset: 576)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !1247, file: !1248, line: 65, baseType: !514, size: 64, offset: 640)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !1247, file: !1248, line: 66, baseType: !514, size: 64, offset: 704)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !1247, file: !1248, line: 68, baseType: !1263, size: 64, offset: 768)
!1263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1264, size: 64)
!1264 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !1248, line: 36, flags: DIFlagFwdDecl)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !1247, file: !1248, line: 70, baseType: !1266, size: 64, offset: 832)
!1266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1247, size: 64)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !1247, file: !1248, line: 72, baseType: !493, size: 32, offset: 896)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !1247, file: !1248, line: 73, baseType: !493, size: 32, offset: 928)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !1247, file: !1248, line: 74, baseType: !1270, size: 64, offset: 960)
!1270 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !500, line: 152, baseType: !501)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !1247, file: !1248, line: 77, baseType: !510, size: 16, offset: 1024)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !1247, file: !1248, line: 78, baseType: !1273, size: 8, offset: 1040)
!1273 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !1247, file: !1248, line: 79, baseType: !1275, size: 8, offset: 1048)
!1275 = !DICompositeType(tag: DW_TAG_array_type, baseType: !503, size: 8, elements: !1276)
!1276 = !{!1277}
!1277 = !DISubrange(count: 1)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !1247, file: !1248, line: 81, baseType: !1279, size: 64, offset: 1088)
!1279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1280, size: 64)
!1280 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !1248, line: 43, baseType: null)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !1247, file: !1248, line: 89, baseType: !1282, size: 64, offset: 1152)
!1282 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !500, line: 153, baseType: !501)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !1247, file: !1248, line: 91, baseType: !1284, size: 64, offset: 1216)
!1284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1285, size: 64)
!1285 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !1248, line: 37, flags: DIFlagFwdDecl)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !1247, file: !1248, line: 92, baseType: !1287, size: 64, offset: 1280)
!1287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1288, size: 64)
!1288 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !1248, line: 38, flags: DIFlagFwdDecl)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !1247, file: !1248, line: 93, baseType: !1266, size: 64, offset: 1344)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !1247, file: !1248, line: 94, baseType: !508, size: 64, offset: 1408)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !1247, file: !1248, line: 95, baseType: !505, size: 64, offset: 1472)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !1247, file: !1248, line: 96, baseType: !493, size: 32, offset: 1536)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !1247, file: !1248, line: 98, baseType: !1294, size: 160, offset: 1568)
!1294 = !DICompositeType(tag: DW_TAG_array_type, baseType: !503, size: 160, elements: !1295)
!1295 = !{!1296}
!1296 = !DISubrange(count: 20)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !996, file: !150, line: 459, baseType: !508, size: 64, offset: 2496)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !996, file: !150, line: 462, baseType: !505, size: 64, offset: 2560)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !996, file: !150, line: 465, baseType: !1179, size: 32768, offset: 2624)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "unique", scope: !996, file: !150, line: 466, baseType: !1179, size: 32768, offset: 35392)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "zero", scope: !996, file: !150, line: 467, baseType: !1179, size: 32768, offset: 68160)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !996, file: !150, line: 468, baseType: !1179, size: 32768, offset: 100928)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !996, file: !150, line: 471, baseType: !558, size: 32, offset: 133696)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "tile", scope: !996, file: !150, line: 474, baseType: !514, size: 64, offset: 133760)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "subimage", scope: !996, file: !150, line: 477, baseType: !505, size: 64, offset: 133824)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "subrange", scope: !996, file: !150, line: 478, baseType: !505, size: 64, offset: 133888)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "pen", scope: !996, file: !150, line: 481, baseType: !1028, size: 64, offset: 133952)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !996, file: !150, line: 484, baseType: !505, size: 64, offset: 134016)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_pixel_method", scope: !996, file: !150, line: 487, baseType: !1310, size: 32, offset: 134080)
!1310 = !DIDerivedType(tag: DW_TAG_typedef, name: "VirtualPixelMethod", file: !466, line: 47, baseType: !465)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_color", scope: !996, file: !150, line: 490, baseType: !1028, size: 64, offset: 134112)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !996, file: !150, line: 493, baseType: !508, size: 64, offset: 134208)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "synchronize", scope: !996, file: !150, line: 496, baseType: !558, size: 32, offset: 134272)
!1314 = !DILocation(line: 341, column: 10, scope: !990)
!1315 = !DILocation(line: 346, column: 18, scope: !990)
!1316 = !DILocation(line: 346, column: 17, scope: !990)
!1317 = !DILocation(line: 347, column: 31, scope: !990)
!1318 = !DILocation(line: 347, column: 43, scope: !990)
!1319 = !DILocation(line: 347, column: 52, scope: !990)
!1320 = !DILocation(line: 347, column: 14, scope: !990)
!1321 = !DILocation(line: 348, column: 17, scope: !990)
!1322 = !DILocation(line: 348, column: 16, scope: !990)
!1323 = !DILocation(line: 349, column: 27, scope: !990)
!1324 = !DILocation(line: 349, column: 40, scope: !990)
!1325 = !DILocation(line: 349, column: 14, scope: !990)
!1326 = !DILocation(line: 350, column: 38, scope: !990)
!1327 = !DILocation(line: 350, column: 17, scope: !990)
!1328 = !DILocation(line: 350, column: 16, scope: !990)
!1329 = !DILocation(line: 351, column: 25, scope: !1330)
!1330 = distinct !DILexicalBlock(scope: !990, file: !3, line: 351, column: 11)
!1331 = !DILocation(line: 351, column: 37, scope: !1330)
!1332 = !DILocation(line: 351, column: 46, scope: !1330)
!1333 = !DILocation(line: 351, column: 11, scope: !1330)
!1334 = !DILocation(line: 351, column: 55, scope: !1330)
!1335 = !DILocation(line: 351, column: 11, scope: !990)
!1336 = !DILocation(line: 353, column: 39, scope: !1337)
!1337 = distinct !DILexicalBlock(scope: !1330, file: !3, line: 352, column: 9)
!1338 = !DILocation(line: 353, column: 22, scope: !1337)
!1339 = !DILocation(line: 353, column: 21, scope: !1337)
!1340 = !DILocation(line: 354, column: 11, scope: !1337)
!1341 = !DILocation(line: 356, column: 35, scope: !990)
!1342 = !DILocation(line: 356, column: 18, scope: !990)
!1343 = !DILocation(line: 356, column: 17, scope: !990)
!1344 = !DILocation(line: 357, column: 5, scope: !990)
!1345 = !DILocation(line: 361, column: 7, scope: !941)
!1346 = !DILocation(line: 362, column: 3, scope: !941)
!1347 = !DILocation(line: 362, column: 22, scope: !941)
!1348 = !DILocation(line: 362, column: 11, scope: !941)
!1349 = !DILocation(line: 362, column: 31, scope: !941)
!1350 = !DILocation(line: 362, column: 37, scope: !941)
!1351 = !DILocation(line: 362, column: 41, scope: !941)
!1352 = !DILocation(line: 362, column: 46, scope: !941)
!1353 = !DILocation(line: 0, scope: !941)
!1354 = !DILocation(line: 364, column: 20, scope: !1355)
!1355 = distinct !DILexicalBlock(scope: !1356, file: !3, line: 364, column: 9)
!1356 = distinct !DILexicalBlock(scope: !941, file: !3, line: 363, column: 3)
!1357 = !DILocation(line: 364, column: 9, scope: !1355)
!1358 = !DILocation(line: 364, column: 32, scope: !1355)
!1359 = !DILocation(line: 364, column: 9, scope: !1356)
!1360 = !DILocation(line: 365, column: 23, scope: !1361)
!1361 = distinct !DILexicalBlock(scope: !1355, file: !3, line: 365, column: 11)
!1362 = !DILocation(line: 365, column: 12, scope: !1361)
!1363 = !DILocation(line: 365, column: 32, scope: !1361)
!1364 = !DILocation(line: 365, column: 40, scope: !1361)
!1365 = !DILocation(line: 365, column: 55, scope: !1361)
!1366 = !DILocation(line: 365, column: 44, scope: !1361)
!1367 = !DILocation(line: 365, column: 64, scope: !1361)
!1368 = !DILocation(line: 365, column: 11, scope: !1355)
!1369 = !DILocation(line: 366, column: 9, scope: !1361)
!1370 = !DILocation(line: 365, column: 70, scope: !1361)
!1371 = !DILocation(line: 367, column: 24, scope: !1356)
!1372 = !DILocation(line: 367, column: 13, scope: !1356)
!1373 = !DILocation(line: 367, column: 5, scope: !1356)
!1374 = !DILocalVariable(name: "status", scope: !1375, file: !3, line: 372, type: !558)
!1375 = distinct !DILexicalBlock(scope: !1376, file: !3, line: 370, column: 7)
!1376 = distinct !DILexicalBlock(scope: !1356, file: !3, line: 368, column: 5)
!1377 = !DILocation(line: 372, column: 11, scope: !1375)
!1378 = !DILocation(line: 374, column: 15, scope: !1375)
