; ModuleID = 'magick/random.c'
source_filename = "magick/random.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.SemaphoreInfo = type opaque
%struct._RandomInfo = type { %struct._SignatureInfo*, %struct._StringInfo*, %struct._StringInfo*, i64, [4 x i64], double, i64, i16, i16, %struct.SemaphoreInfo*, i64, i64 }
%struct._SignatureInfo = type opaque
%struct._StringInfo = type { [4096 x i8], i8*, i64, i64 }
%struct._ExceptionInfo = type { i32, i32, i8*, i8*, i8*, i32, %struct.SemaphoreInfo*, i64 }

@.str = private unnamed_addr constant [16 x i8] c"magick/random.c\00", align 1
@.str.1 = private unnamed_addr constant [1 x i8] zeroinitializer, align 1
@.str.2 = private unnamed_addr constant [23 x i8] c"MemoryAllocationFailed\00", align 1
@.str.3 = private unnamed_addr constant [5 x i8] c"`%s'\00", align 1
@secret_key = internal global i64 -1, align 8, !dbg !0
@.str.4 = private unnamed_addr constant [4 x i8] c"...\00", align 1
@random_semaphore = internal global %struct.SemaphoreInfo* null, align 8, !dbg !172
@gather_true_random = internal global i32 0, align 4, !dbg !174
@environ = external dso_local global i8**, align 8
@.str.5 = private unnamed_addr constant [13 x i8] c"/dev/urandom\00", align 1
@.str.6 = private unnamed_addr constant [12 x i8] c"/dev/random\00", align 1
@.str.7 = private unnamed_addr constant [13 x i8] c"/dev/srandom\00", align 1

!48 = !DIEnumerator(name: "ImageError", value: 465, isUnsigned: true)
!49 = !DIEnumerator(name: "WandError", value: 470, isUnsigned: true)
!50 = !DIEnumerator(name: "RandomError", value: 475, isUnsigned: true)
!51 = !DIEnumerator(name: "XServerError", value: 480, isUnsigned: true)
!52 = !DIEnumerator(name: "MonitorError", value: 485, isUnsigned: true)
!53 = !DIEnumerator(name: "RegistryError", value: 490, isUnsigned: true)
!54 = !DIEnumerator(name: "ConfigureError", value: 495, isUnsigned: true)
!55 = !DIEnumerator(name: "PolicyError", value: 499, isUnsigned: true)
!56 = !DIEnumerator(name: "FatalErrorException", value: 700, isUnsigned: true)
!57 = !DIEnumerator(name: "ResourceLimitFatalError", value: 700, isUnsigned: true)
!58 = !DIEnumerator(name: "TypeFatalError", value: 705, isUnsigned: true)
!59 = !DIEnumerator(name: "OptionFatalError", value: 710, isUnsigned: true)
!60 = !DIEnumerator(name: "DelegateFatalError", value: 715, isUnsigned: true)
!61 = !DIEnumerator(name: "MissingDelegateFatalError", value: 720, isUnsigned: true)
!62 = !DIEnumerator(name: "CorruptImageFatalError", value: 725, isUnsigned: true)
!63 = !DIEnumerator(name: "FileOpenFatalError", value: 730, isUnsigned: true)
!64 = !DIEnumerator(name: "BlobFatalError", value: 735, isUnsigned: true)
!65 = !DIEnumerator(name: "StreamFatalError", value: 740, isUnsigned: true)
!66 = !DIEnumerator(name: "CacheFatalError", value: 745, isUnsigned: true)
!67 = !DIEnumerator(name: "CoderFatalError", value: 750, isUnsigned: true)
!68 = !DIEnumerator(name: "FilterFatalError", value: 752, isUnsigned: true)
!69 = !DIEnumerator(name: "ModuleFatalError", value: 755, isUnsigned: true)
!70 = !DIEnumerator(name: "DrawFatalError", value: 760, isUnsigned: true)
!71 = !DIEnumerator(name: "ImageFatalError", value: 765, isUnsigned: true)
!72 = !DIEnumerator(name: "WandFatalError", value: 770, isUnsigned: true)
!73 = !DIEnumerator(name: "RandomFatalError", value: 775, isUnsigned: true)
!74 = !DIEnumerator(name: "XServerFatalError", value: 780, isUnsigned: true)
!75 = !DIEnumerator(name: "MonitorFatalError", value: 785, isUnsigned: true)
!76 = !DIEnumerator(name: "RegistryFatalError", value: 790, isUnsigned: true)
!77 = !DIEnumerator(name: "ConfigureFatalError", value: 795, isUnsigned: true)
!78 = !DIEnumerator(name: "PolicyFatalError", value: 799, isUnsigned: true)
!79 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !80, line: 211, baseType: !7, size: 32, elements: !81)
!80 = !DIFile(filename: "./magick/magick-type.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!81 = !{!82, !83}
!82 = !DIEnumerator(name: "MagickFalse", value: 0, isUnsigned: true)
!83 = !DIEnumerator(name: "MagickTrue", value: 1, isUnsigned: true)
!84 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !85, line: 34, baseType: !7, size: 32, elements: !86)
!85 = !DIFile(filename: "./magick/log.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!86 = !{!87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108}
!87 = !DIEnumerator(name: "UndefinedEvents", value: 0, isUnsigned: true)
!88 = !DIEnumerator(name: "NoEvents", value: 0, isUnsigned: true)
!89 = !DIEnumerator(name: "TraceEvent", value: 1, isUnsigned: true)
!90 = !DIEnumerator(name: "AnnotateEvent", value: 2, isUnsigned: true)
!91 = !DIEnumerator(name: "BlobEvent", value: 4, isUnsigned: true)
!92 = !DIEnumerator(name: "CacheEvent", value: 8, isUnsigned: true)
!93 = !DIEnumerator(name: "CoderEvent", value: 16, isUnsigned: true)
!94 = !DIEnumerator(name: "ConfigureEvent", value: 32, isUnsigned: true)
!95 = !DIEnumerator(name: "DeprecateEvent", value: 64, isUnsigned: true)
!96 = !DIEnumerator(name: "DrawEvent", value: 128, isUnsigned: true)
!97 = !DIEnumerator(name: "ExceptionEvent", value: 256, isUnsigned: true)
!98 = !DIEnumerator(name: "ImageEvent", value: 512, isUnsigned: true)
!99 = !DIEnumerator(name: "LocaleEvent", value: 1024, isUnsigned: true)
!100 = !DIEnumerator(name: "ModuleEvent", value: 2048, isUnsigned: true)
!101 = !DIEnumerator(name: "PolicyEvent", value: 4096, isUnsigned: true)
!102 = !DIEnumerator(name: "ResourceEvent", value: 8192, isUnsigned: true)
!103 = !DIEnumerator(name: "TransformEvent", value: 16384, isUnsigned: true)
!104 = !DIEnumerator(name: "UserEvent", value: 36864, isUnsigned: true)
!105 = !DIEnumerator(name: "WandEvent", value: 65536, isUnsigned: true)
!106 = !DIEnumerator(name: "X11Event", value: 131072, isUnsigned: true)
!107 = !DIEnumerator(name: "AccelerateEvent", value: 262144, isUnsigned: true)
!108 = !DIEnumerator(name: "AllEvents", value: 2147483647, isUnsigned: true)
!109 = !{!110, !163, !137, !164, !157, !121, !132, !116, !146, !152, !165, !169, !170, !135}
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "RandomInfo", file: !112, line: 31, baseType: !113)
!112 = !DIFile(filename: "./magick/random_.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_RandomInfo", file: !3, line: 77, size: 896, elements: !114)
!114 = !{!115, !120, !139, !140, !141, !145, !147, !148, !150, !151, !156, !162}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "signature_info", scope: !113, file: !3, line: 80, baseType: !116, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "SignatureInfo", file: !118, line: 30, baseType: !119)
!118 = !DIFile(filename: "./magick/signature-private.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!119 = !DICompositeType(tag: DW_TAG_structure_type, name: "_SignatureInfo", file: !118, line: 29, flags: DIFlagFwdDecl)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "nonce", scope: !113, file: !3, line: 83, baseType: !121, size: 64, offset: 64)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "StringInfo", file: !123, line: 40, baseType: !124)
!123 = !DIFile(filename: "./magick/string_.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!124 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_StringInfo", file: !123, line: 29, size: 32960, elements: !125)
!125 = !{!126, !131, !134, !138}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !124, file: !123, line: 32, baseType: !127, size: 32768)
!127 = !DICompositeType(tag: DW_TAG_array_type, baseType: !128, size: 32768, elements: !129)
!128 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!129 = !{!130}
!130 = !DISubrange(count: 4096)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "datum", scope: !124, file: !123, line: 35, baseType: !132, size: 64, offset: 32768)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !124, file: !123, line: 38, baseType: !135, size: 64, offset: 32832)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !136, line: 46, baseType: !137)
!136 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!137 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !124, file: !123, line: 39, baseType: !135, size: 64, offset: 32896)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "reservoir", scope: !113, file: !3, line: 84, baseType: !121, size: 64, offset: 128)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !113, file: !3, line: 87, baseType: !135, size: 64, offset: 192)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "seed", scope: !113, file: !3, line: 90, baseType: !142, size: 256, offset: 256)
!142 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 256, elements: !143)
!143 = !{!144}
!144 = !DISubrange(count: 4)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "normalize", scope: !113, file: !3, line: 93, baseType: !146, size: 64, offset: 512)
!146 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "secret_key", scope: !113, file: !3, line: 96, baseType: !137, size: 64, offset: 576)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_major", scope: !113, file: !3, line: 99, baseType: !149, size: 16, offset: 640)
!149 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_minor", scope: !113, file: !3, line: 100, baseType: !149, size: 16, offset: 656)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !113, file: !3, line: 103, baseType: !152, size: 64, offset: 704)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "SemaphoreInfo", file: !154, line: 26, baseType: !155)
!154 = !DIFile(filename: "./magick/semaphore.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!155 = !DICompositeType(tag: DW_TAG_structure_type, name: "SemaphoreInfo", file: !154, line: 25, flags: DIFlagFwdDecl)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !113, file: !3, line: 106, baseType: !157, size: 64, offset: 768)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !158, line: 77, baseType: !159)
!158 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !160, line: 193, baseType: !161)
!160 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!161 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !113, file: !3, line: 109, baseType: !135, size: 64, offset: 832)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!164 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !167, line: 7, baseType: !168)
!167 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "")
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !160, line: 160, baseType: !161)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!171 = !{!0, !172, !174}
!172 = !DIGlobalVariableExpression(var: !173, expr: !DIExpression())
!173 = distinct !DIGlobalVariable(name: "random_semaphore", scope: !2, file: !3, line: 131, type: !152, isLocal: true, isDefinition: true)
!174 = !DIGlobalVariableExpression(var: !175, expr: !DIExpression())
!175 = distinct !DIGlobalVariable(name: "gather_true_random", scope: !2, file: !3, line: 137, type: !176, isLocal: true, isDefinition: true)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickBooleanType", file: !80, line: 215, baseType: !79)
!177 = !{i32 7, !"Dwarf Version", i32 4}
!178 = !{i32 2, !"Debug Info Version", i32 3}
!179 = !{i32 1, !"wchar_size", i32 4}
!180 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!181 = distinct !DISubprogram(name: "AcquireRandomInfo", scope: !3, file: !3, line: 173, type: !182, scopeLine: 174, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !184)
!182 = !DISubroutineType(types: !183)
!183 = !{!110}
!184 = !{}
!185 = !DILocalVariable(name: "digest", scope: !181, file: !3, line: 176, type: !186)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!187 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !122)
!188 = !DILocation(line: 176, column: 6, scope: !181)
!189 = !DILocalVariable(name: "random_info", scope: !181, file: !3, line: 179, type: !110)
!190 = !DILocation(line: 179, column: 6, scope: !181)
!191 = !DILocalVariable(name: "entropy", scope: !181, file: !3, line: 182, type: !121)
!192 = !DILocation(line: 182, column: 6, scope: !181)
!193 = !DILocalVariable(name: "key", scope: !181, file: !3, line: 183, type: !121)
!194 = !DILocation(line: 183, column: 6, scope: !181)
!195 = !DILocalVariable(name: "nonce", scope: !181, file: !3, line: 184, type: !121)
!196 = !DILocation(line: 184, column: 6, scope: !181)
!197 = !DILocation(line: 186, column: 30, scope: !181)
!198 = !DILocation(line: 186, column: 15, scope: !181)
!199 = !DILocation(line: 186, column: 14, scope: !181)
!200 = !DILocation(line: 187, column: 7, scope: !201)
!201 = distinct !DILexicalBlock(scope: !181, file: !3, line: 187, column: 7)
!202 = !DILocation(line: 187, column: 19, scope: !201)
!203 = !DILocation(line: 187, column: 7, scope: !181)
!204 = !DILocalVariable(name: "message", scope: !205, file: !3, line: 188, type: !170)
!205 = distinct !DILexicalBlock(scope: !201, file: !3, line: 188, column: 5)
!206 = !DILocation(line: 188, column: 5, scope: !205)
!207 = !DILocalVariable(name: "exception", scope: !205, file: !3, line: 188, type: !208)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionInfo", file: !80, line: 219, baseType: !209)
!209 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ExceptionInfo", file: !6, line: 102, size: 448, elements: !210)
!210 = !{!211, !213, !214, !215, !216, !217, !218, !219}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "severity", scope: !209, file: !6, line: 105, baseType: !212, size: 32)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionType", file: !6, line: 100, baseType: !5)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "error_number", scope: !209, file: !6, line: 108, baseType: !164, size: 32, offset: 32)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !209, file: !6, line: 111, baseType: !170, size: 64, offset: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !209, file: !6, line: 112, baseType: !170, size: 64, offset: 128)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "exceptions", scope: !209, file: !6, line: 115, baseType: !163, size: 64, offset: 192)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "relinquish", scope: !209, file: !6, line: 118, baseType: !176, size: 32, offset: 256)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !209, file: !6, line: 121, baseType: !152, size: 64, offset: 320)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !209, file: !6, line: 124, baseType: !135, size: 64, offset: 384)
!220 = !DILocation(line: 189, column: 28, scope: !181)
!221 = !DILocation(line: 189, column: 10, scope: !181)
!222 = !DILocation(line: 190, column: 31, scope: !181)
!223 = !DILocation(line: 190, column: 3, scope: !181)
!224 = !DILocation(line: 190, column: 16, scope: !181)
!225 = !DILocation(line: 190, column: 30, scope: !181)
!226 = !DILocation(line: 192, column: 5, scope: !181)
!227 = !DILocation(line: 192, column: 18, scope: !181)
!228 = !DILocation(line: 191, column: 42, scope: !181)
!229 = !DILocation(line: 191, column: 41, scope: !181)
!230 = !DILocation(line: 191, column: 40, scope: !181)
!231 = !DILocation(line: 191, column: 22, scope: !181)
!232 = !DILocation(line: 191, column: 3, scope: !181)
!233 = !DILocation(line: 191, column: 16, scope: !181)
!234 = !DILocation(line: 191, column: 21, scope: !181)
!235 = !DILocation(line: 193, column: 19, scope: !181)
!236 = !DILocation(line: 193, column: 32, scope: !181)
!237 = !DILocation(line: 193, column: 3, scope: !181)
!238 = !DILocation(line: 195, column: 5, scope: !181)
!239 = !DILocation(line: 195, column: 18, scope: !181)
!240 = !DILocation(line: 194, column: 44, scope: !181)
!241 = !DILocation(line: 194, column: 26, scope: !181)
!242 = !DILocation(line: 194, column: 3, scope: !181)
!243 = !DILocation(line: 194, column: 16, scope: !181)
!244 = !DILocation(line: 194, column: 25, scope: !181)
!245 = !DILocation(line: 196, column: 19, scope: !181)
!246 = !DILocation(line: 196, column: 32, scope: !181)
!247 = !DILocation(line: 196, column: 3, scope: !181)
!248 = !DILocation(line: 197, column: 3, scope: !181)
!249 = !DILocation(line: 197, column: 16, scope: !181)
!250 = !DILocation(line: 197, column: 25, scope: !181)
!251 = !DILocation(line: 198, column: 27, scope: !181)
!252 = !DILocation(line: 198, column: 3, scope: !181)
!253 = !DILocation(line: 198, column: 16, scope: !181)
!254 = !DILocation(line: 198, column: 26, scope: !181)
!255 = !DILocation(line: 199, column: 3, scope: !181)
!256 = !DILocation(line: 199, column: 16, scope: !181)
!257 = !DILocation(line: 199, column: 30, scope: !181)
!258 = !DILocation(line: 200, column: 3, scope: !181)
!259 = !DILocation(line: 200, column: 16, scope: !181)
!260 = !DILocation(line: 200, column: 30, scope: !181)
!261 = !DILocation(line: 201, column: 26, scope: !181)
!262 = !DILocation(line: 201, column: 3, scope: !181)
!263 = !DILocation(line: 201, column: 16, scope: !181)
!264 = !DILocation(line: 201, column: 25, scope: !181)
!265 = !DILocation(line: 202, column: 36, scope: !181)
!266 = !DILocation(line: 202, column: 3, scope: !181)
!267 = !DILocation(line: 202, column: 16, scope: !181)
!268 = !DILocation(line: 202, column: 25, scope: !181)
!269 = !DILocation(line: 203, column: 3, scope: !181)
!270 = !DILocation(line: 203, column: 16, scope: !181)
!271 = !DILocation(line: 203, column: 25, scope: !181)
!272 = !DILocation(line: 207, column: 31, scope: !181)
!273 = !DILocation(line: 207, column: 9, scope: !181)
!274 = !DILocation(line: 207, column: 8, scope: !181)
!275 = !DILocation(line: 208, column: 7, scope: !276)
!276 = distinct !DILexicalBlock(scope: !181, file: !3, line: 208, column: 7)
!277 = !DILocation(line: 208, column: 13, scope: !276)
!278 = !DILocation(line: 208, column: 7, scope: !181)
!279 = !DILocalVariable(name: "message", scope: !280, file: !3, line: 209, type: !170)
!280 = distinct !DILexicalBlock(scope: !276, file: !3, line: 209, column: 5)
!281 = !DILocation(line: 209, column: 5, scope: !280)
!282 = !DILocalVariable(name: "exception", scope: !280, file: !3, line: 209, type: !208)
!283 = !DILocation(line: 210, column: 23, scope: !181)
!284 = !DILocation(line: 210, column: 36, scope: !181)
!285 = !DILocation(line: 210, column: 3, scope: !181)
!286 = !DILocation(line: 211, column: 19, scope: !181)
!287 = !DILocation(line: 211, column: 32, scope: !181)
!288 = !DILocation(line: 211, column: 47, scope: !181)
