; ModuleID = 'wand/magick-property.c'
source_filename = "wand/magick-property.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._MagickWand = type { i64, [4096 x i8], %struct._ExceptionInfo*, %struct._ImageInfo*, %struct._QuantizeInfo*, %struct._Image*, i32, i32, i32, i64 }
%struct._ExceptionInfo = type { i32, i32, i8*, i8*, i8*, i32, %struct.SemaphoreInfo*, i64 }
%struct.SemaphoreInfo = type opaque
%struct._ImageInfo = type { i32, i32, i32, i32, i32, i32, i8*, i8*, i8*, i8*, i64, i64, i64, i32, i32, i32, i64, i8*, i8*, i8*, i8*, i8*, double, double, %struct._PixelPacket, %struct._PixelPacket, %struct._PixelPacket, i32, i32, i64, i32, i32, i32, i64, i32, i32, i8*, i8*, i32, %struct._Image*, i8*, i32 (i8*, i64, i64, i8*)*, i8*, i8*, i64 (%struct._Image*, i8*, i64)*, %struct._IO_FILE*, i8*, i64, [4096 x i8], [4096 x i8], [4096 x i8], [4096 x i8], i32, i8*, i64, i64, %struct._PixelPacket, i64, i32, %struct._PixelPacket, i8*, i32 }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct._PixelPacket = type { i16, i16, i16, i16 }

!552 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !295, line: 25, baseType: !5, size: 32, elements: !553)
!553 = !{!554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579}
!554 = !DIEnumerator(name: "NoValue", value: 0, isUnsigned: true)
!555 = !DIEnumerator(name: "XValue", value: 1, isUnsigned: true)
!556 = !DIEnumerator(name: "XiValue", value: 1, isUnsigned: true)
!557 = !DIEnumerator(name: "YValue", value: 2, isUnsigned: true)
!558 = !DIEnumerator(name: "PsiValue", value: 2, isUnsigned: true)
!559 = !DIEnumerator(name: "WidthValue", value: 4, isUnsigned: true)
!560 = !DIEnumerator(name: "RhoValue", value: 4, isUnsigned: true)
!561 = !DIEnumerator(name: "HeightValue", value: 8, isUnsigned: true)
!562 = !DIEnumerator(name: "SigmaValue", value: 8, isUnsigned: true)
!563 = !DIEnumerator(name: "ChiValue", value: 16, isUnsigned: true)
!564 = !DIEnumerator(name: "XiNegative", value: 32, isUnsigned: true)
!565 = !DIEnumerator(name: "XNegative", value: 32, isUnsigned: true)
!566 = !DIEnumerator(name: "PsiNegative", value: 64, isUnsigned: true)
!567 = !DIEnumerator(name: "YNegative", value: 64, isUnsigned: true)
!568 = !DIEnumerator(name: "ChiNegative", value: 128, isUnsigned: true)
!569 = !DIEnumerator(name: "PercentValue", value: 4096, isUnsigned: true)
!570 = !DIEnumerator(name: "AspectValue", value: 8192, isUnsigned: true)
!571 = !DIEnumerator(name: "NormalizeValue", value: 8192, isUnsigned: true)
!572 = !DIEnumerator(name: "LessValue", value: 16384, isUnsigned: true)
!573 = !DIEnumerator(name: "GreaterValue", value: 32768, isUnsigned: true)
!574 = !DIEnumerator(name: "MinimumValue", value: 65536, isUnsigned: true)
!575 = !DIEnumerator(name: "CorrelateNormalizeValue", value: 65536, isUnsigned: true)
!576 = !DIEnumerator(name: "AreaValue", value: 131072, isUnsigned: true)
!577 = !DIEnumerator(name: "DecimalValue", value: 262144, isUnsigned: true)
!578 = !DIEnumerator(name: "SeparatorValue", value: 524288, isUnsigned: true)
!579 = !DIEnumerator(name: "AllValues", value: 2147483647, isUnsigned: true)
!580 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !581, line: 25, baseType: !5, size: 32, elements: !582)
!581 = !DIFile(filename: "./magick/resource_.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!582 = !{!583, !584, !585, !586, !587, !588, !589, !590, !591}
!583 = !DIEnumerator(name: "UndefinedResource", value: 0, isUnsigned: true)
!584 = !DIEnumerator(name: "AreaResource", value: 1, isUnsigned: true)
!585 = !DIEnumerator(name: "DiskResource", value: 2, isUnsigned: true)
!586 = !DIEnumerator(name: "FileResource", value: 3, isUnsigned: true)
!587 = !DIEnumerator(name: "MapResource", value: 4, isUnsigned: true)
!588 = !DIEnumerator(name: "MemoryResource", value: 5, isUnsigned: true)
!589 = !DIEnumerator(name: "ThreadResource", value: 6, isUnsigned: true)
!590 = !DIEnumerator(name: "TimeResource", value: 7, isUnsigned: true)
!591 = !DIEnumerator(name: "ThrottleResource", value: 8, isUnsigned: true)
!592 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !593, line: 46, baseType: !5, size: 32, elements: !594)
!593 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!594 = !{!595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606}
!595 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!596 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!597 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!598 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!599 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!600 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!601 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!602 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!603 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!604 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!605 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!606 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!607 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !608, line: 28, baseType: !5, size: 32, elements: !609)
!608 = !DIFile(filename: "./magick/magick.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!609 = !{!610, !611, !612}
!610 = !DIEnumerator(name: "UndefinedFormatType", value: 0, isUnsigned: true)
!611 = !DIEnumerator(name: "ImplicitFormatType", value: 1, isUnsigned: true)
!612 = !DIEnumerator(name: "ExplicitFormatType", value: 2, isUnsigned: true)
!613 = !{!614, !615, !670, !674, !748, !706, !835, !679, !626, !803, !836, !840, !815, !849, !478, !804, !644, !850, !652}
!614 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 64)
!616 = !DIDerivedType(tag: DW_TAG_typedef, name: "Image", file: !4, line: 221, baseType: !617)
!617 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Image", file: !108, line: 150, size: 105920, elements: !618)
!618 = !{!619, !621, !623, !625, !628, !630, !632, !633, !634, !635, !636, !637, !648, !649, !650, !651, !653, !667, !669, !671, !673, !676, !677, !678, !684, !685, !686, !694, !695, !696, !697, !698, !699, !701, !703, !705, !707, !709, !711, !713, !714, !715, !716, !717, !718, !719, !727, !742, !756, !757, !758, !759, !763, !767, !771, !772, !773, !774, !775, !792, !793, !795, !796, !806, !807, !809, !810, !811, !812, !813, !814, !816, !817, !818, !819, !820, !821, !822, !824, !825, !826, !827, !828, !832, !834}
!619 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !617, file: !108, line: 153, baseType: !620, size: 32)
!620 = !DIDerivedType(tag: DW_TAG_typedef, name: "ClassType", file: !4, line: 209, baseType: !246)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !617, file: !108, line: 156, baseType: !622, size: 32, offset: 32)
!622 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorspaceType", file: !141, line: 61, baseType: !140)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !617, file: !108, line: 159, baseType: !624, size: 32, offset: 64)
!624 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompressionType", file: !83, line: 49, baseType: !82)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !617, file: !108, line: 162, baseType: !626, size: 64, offset: 128)
!626 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !627, line: 46, baseType: !614)
!627 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!628 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !617, file: !108, line: 165, baseType: !629, size: 32, offset: 192)
!629 = !DIDerivedType(tag: DW_TAG_typedef, name: "OrientationType", file: !108, line: 86, baseType: !107)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "taint", scope: !617, file: !108, line: 168, baseType: !631, size: 32, offset: 224)
!631 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickBooleanType", file: !4, line: 215, baseType: !3)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "matte", scope: !617, file: !108, line: 169, baseType: !631, size: 32, offset: 256)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !617, file: !108, line: 172, baseType: !626, size: 64, offset: 320)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !617, file: !108, line: 173, baseType: !626, size: 64, offset: 384)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !617, file: !108, line: 174, baseType: !626, size: 64, offset: 448)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !617, file: !108, line: 175, baseType: !626, size: 64, offset: 512)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "colormap", scope: !617, file: !108, line: 178, baseType: !638, size: 64, offset: 576)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 64)
!639 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelPacket", file: !395, line: 148, baseType: !640)
!640 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PixelPacket", file: !395, line: 131, size: 64, elements: !641)
!641 = !{!642, !645, !646, !647}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !640, file: !395, line: 143, baseType: !643, size: 16)
!643 = !DIDerivedType(tag: DW_TAG_typedef, name: "Quantum", file: !4, line: 93, baseType: !644)
!644 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !640, file: !395, line: 144, baseType: !643, size: 16, offset: 16)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !640, file: !395, line: 145, baseType: !643, size: 16, offset: 32)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !640, file: !395, line: 146, baseType: !643, size: 16, offset: 48)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "background_color", scope: !617, file: !108, line: 179, baseType: !639, size: 64, offset: 640)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !617, file: !108, line: 180, baseType: !639, size: 64, offset: 704)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "matte_color", scope: !617, file: !108, line: 181, baseType: !639, size: 64, offset: 768)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !617, file: !108, line: 184, baseType: !652, size: 64, offset: 832)
!652 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "chromaticity", scope: !617, file: !108, line: 187, baseType: !654, size: 768, offset: 896)
!654 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChromaticityInfo", file: !108, line: 128, baseType: !655)
!655 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ChromaticityInfo", file: !108, line: 121, size: 768, elements: !656)
!656 = !{!657, !664, !665, !666}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "red_primary", scope: !655, file: !108, line: 124, baseType: !658, size: 192)
!658 = !DIDerivedType(tag: DW_TAG_typedef, name: "PrimaryInfo", file: !108, line: 101, baseType: !659)
!659 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PrimaryInfo", file: !108, line: 95, size: 192, elements: !660)
!660 = !{!661, !662, !663}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !659, file: !108, line: 98, baseType: !652, size: 64)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !659, file: !108, line: 99, baseType: !652, size: 64, offset: 64)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !659, file: !108, line: 100, baseType: !652, size: 64, offset: 128)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "green_primary", scope: !655, file: !108, line: 125, baseType: !658, size: 192, offset: 192)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "blue_primary", scope: !655, file: !108, line: 126, baseType: !658, size: 192, offset: 384)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "white_point", scope: !655, file: !108, line: 127, baseType: !658, size: 192, offset: 576)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "rendering_intent", scope: !617, file: !108, line: 190, baseType: !668, size: 32, offset: 1664)
!668 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderingIntent", file: !252, line: 49, baseType: !251)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !617, file: !108, line: 193, baseType: !670, size: 64, offset: 1728)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !617, file: !108, line: 196, baseType: !672, size: 32, offset: 1792)
!672 = !DIDerivedType(tag: DW_TAG_typedef, name: "ResolutionType", file: !108, line: 93, baseType: !135)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "montage", scope: !617, file: !108, line: 199, baseType: !674, size: 64, offset: 1856)
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 64)
!675 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "directory", scope: !617, file: !108, line: 200, baseType: !674, size: 64, offset: 1920)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "geometry", scope: !617, file: !108, line: 201, baseType: !674, size: 64, offset: 1984)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !617, file: !108, line: 204, baseType: !679, size: 64, offset: 2048)
!679 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !680, line: 77, baseType: !681)
!680 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!681 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !682, line: 193, baseType: !683)
!682 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!683 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "x_resolution", scope: !617, file: !108, line: 207, baseType: !652, size: 64, offset: 2112)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "y_resolution", scope: !617, file: !108, line: 208, baseType: !652, size: 64, offset: 2176)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !617, file: !108, line: 211, baseType: !687, size: 256, offset: 2240)
!687 = !DIDerivedType(tag: DW_TAG_typedef, name: "RectangleInfo", file: !295, line: 130, baseType: !688)
!688 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_RectangleInfo", file: !295, line: 121, size: 256, elements: !689)
!689 = !{!690, !691, !692, !693}
!690 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !688, file: !295, line: 124, baseType: !626, size: 64)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !688, file: !295, line: 125, baseType: !626, size: 64, offset: 64)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !688, file: !295, line: 128, baseType: !679, size: 64, offset: 128)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !688, file: !295, line: 129, baseType: !679, size: 64, offset: 192)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "extract_info", scope: !617, file: !108, line: 212, baseType: !687, size: 256, offset: 2496)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "tile_info", scope: !617, file: !108, line: 213, baseType: !687, size: 256, offset: 2752)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "bias", scope: !617, file: !108, line: 216, baseType: !652, size: 64, offset: 3008)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "blur", scope: !617, file: !108, line: 217, baseType: !652, size: 64, offset: 3072)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !617, file: !108, line: 218, baseType: !652, size: 64, offset: 3136)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !617, file: !108, line: 221, baseType: !700, size: 32, offset: 3200)
!700 = !DIDerivedType(tag: DW_TAG_typedef, name: "FilterTypes", file: !260, line: 66, baseType: !259)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "interlace", scope: !617, file: !108, line: 224, baseType: !702, size: 32, offset: 3232)
!702 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterlaceType", file: !108, line: 73, baseType: !119)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !617, file: !108, line: 227, baseType: !704, size: 32, offset: 3264)
!704 = !DIDerivedType(tag: DW_TAG_typedef, name: "EndianType", file: !130, line: 35, baseType: !129)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !617, file: !108, line: 230, baseType: !706, size: 32, offset: 3296)
!706 = !DIDerivedType(tag: DW_TAG_typedef, name: "GravityType", file: !295, line: 91, baseType: !294)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !617, file: !108, line: 233, baseType: !708, size: 32, offset: 3328)
!708 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompositeOperator", file: !310, line: 99, baseType: !309)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "dispose", scope: !617, file: !108, line: 236, baseType: !710, size: 32, offset: 3360)
!710 = !DIDerivedType(tag: DW_TAG_typedef, name: "DisposeType", file: !381, line: 32, baseType: !380)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "clip_mask", scope: !617, file: !108, line: 239, baseType: !712, size: 64, offset: 3392)
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !617, size: 64)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !617, file: !108, line: 242, baseType: !626, size: 64, offset: 3456)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !617, file: !108, line: 243, baseType: !626, size: 64, offset: 3520)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_second", scope: !617, file: !108, line: 246, baseType: !679, size: 64, offset: 3584)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "iterations", scope: !617, file: !108, line: 249, baseType: !626, size: 64, offset: 3648)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "total_colors", scope: !617, file: !108, line: 250, baseType: !626, size: 64, offset: 3712)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "start_loop", scope: !617, file: !108, line: 253, baseType: !679, size: 64, offset: 3776)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !617, file: !108, line: 256, baseType: !720, size: 192, offset: 3840)
!720 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErrorInfo", file: !721, line: 68, baseType: !722)
!721 = !DIFile(filename: "./magick/color.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!722 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ErrorInfo", file: !721, line: 62, size: 192, elements: !723)
!723 = !{!724, !725, !726}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "mean_error_per_pixel", scope: !722, file: !721, line: 65, baseType: !652, size: 64)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_mean_error", scope: !722, file: !721, line: 66, baseType: !652, size: 64, offset: 64)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_maximum_error", scope: !722, file: !721, line: 67, baseType: !652, size: 64, offset: 128)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !617, file: !108, line: 259, baseType: !728, size: 512, offset: 4032)
!728 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerInfo", file: !389, line: 51, baseType: !729)
!729 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TimerInfo", file: !389, line: 40, size: 512, elements: !730)
!730 = !{!731, !738, !739, !741}
!731 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !729, file: !389, line: 43, baseType: !732, size: 192)
!732 = !DIDerivedType(tag: DW_TAG_typedef, name: "Timer", file: !389, line: 38, baseType: !733)
!733 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Timer", file: !389, line: 32, size: 192, elements: !734)
!734 = !{!735, !736, !737}
!735 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !733, file: !389, line: 35, baseType: !652, size: 64)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !733, file: !389, line: 36, baseType: !652, size: 64, offset: 64)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !733, file: !389, line: 37, baseType: !652, size: 64, offset: 128)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "elapsed", scope: !729, file: !389, line: 44, baseType: !732, size: 192, offset: 192)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !729, file: !389, line: 47, baseType: !740, size: 32, offset: 384)
!740 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerState", file: !389, line: 30, baseType: !388)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !729, file: !389, line: 50, baseType: !626, size: 64, offset: 448)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !617, file: !108, line: 262, baseType: !743, size: 64, offset: 4544)
!743 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickProgressMonitor", file: !744, line: 26, baseType: !745)
!744 = !DIFile(filename: "./magick/monitor.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 64)
!746 = !DISubroutineType(types: !747)
!747 = !{!631, !748, !750, !753, !670}
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 64)
!749 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !675)
!750 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !751)
!751 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickOffsetType", file: !4, line: 150, baseType: !752)
!752 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!753 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !754)
!754 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickSizeType", file: !4, line: 151, baseType: !755)
!755 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !617, file: !108, line: 265, baseType: !670, size: 64, offset: 4608)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !617, file: !108, line: 266, baseType: !670, size: 64, offset: 4672)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !617, file: !108, line: 267, baseType: !670, size: 64, offset: 4736)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "ascii85", scope: !617, file: !108, line: 270, baseType: !760, size: 64, offset: 4800)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64)
!761 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ascii85Info", file: !83, line: 52, baseType: !762)
!762 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Ascii85Info", file: !83, line: 51, flags: DIFlagFwdDecl)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !617, file: !108, line: 273, baseType: !764, size: 64, offset: 4864)
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 64)
!765 = !DIDerivedType(tag: DW_TAG_typedef, name: "BlobInfo", file: !4, line: 217, baseType: !766)
!766 = !DICompositeType(tag: DW_TAG_structure_type, name: "_BlobInfo", file: !4, line: 217, flags: DIFlagFwdDecl)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !617, file: !108, line: 276, baseType: !768, size: 32768, offset: 4928)
!768 = !DICompositeType(tag: DW_TAG_array_type, baseType: !675, size: 32768, elements: !769)
!769 = !{!770}
!770 = !DISubrange(count: 4096)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "magick_filename", scope: !617, file: !108, line: 277, baseType: !768, size: 32768, offset: 37696)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !617, file: !108, line: 278, baseType: !768, size: 32768, offset: 70464)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "magick_columns", scope: !617, file: !108, line: 281, baseType: !626, size: 64, offset: 103232)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "magick_rows", scope: !617, file: !108, line: 282, baseType: !626, size: 64, offset: 103296)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "exception", scope: !617, file: !108, line: 285, baseType: !776, size: 448, offset: 103360)
!776 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionInfo", file: !4, line: 219, baseType: !777)
!777 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ExceptionInfo", file: !10, line: 102, size: 448, elements: !778)
!778 = !{!779, !781, !782, !783, !784, !785, !786, !791}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "severity", scope: !777, file: !10, line: 105, baseType: !780, size: 32)
!780 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionType", file: !10, line: 100, baseType: !9)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "error_number", scope: !777, file: !10, line: 108, baseType: !478, size: 32, offset: 32)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !777, file: !10, line: 111, baseType: !674, size: 64, offset: 64)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !777, file: !10, line: 112, baseType: !674, size: 64, offset: 128)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "exceptions", scope: !777, file: !10, line: 115, baseType: !670, size: 64, offset: 192)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "relinquish", scope: !777, file: !10, line: 118, baseType: !631, size: 32, offset: 256)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !777, file: !10, line: 121, baseType: !787, size: 64, offset: 320)
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 64)
!788 = !DIDerivedType(tag: DW_TAG_typedef, name: "SemaphoreInfo", file: !789, line: 26, baseType: !790)
!789 = !DIFile(filename: "./magick/semaphore.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!790 = !DICompositeType(tag: DW_TAG_structure_type, name: "SemaphoreInfo", file: !789, line: 25, flags: DIFlagFwdDecl)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !777, file: !10, line: 124, baseType: !626, size: 64, offset: 384)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !617, file: !108, line: 288, baseType: !631, size: 32, offset: 103808)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !617, file: !108, line: 291, baseType: !794, size: 64, offset: 103872)
!794 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !679)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !617, file: !108, line: 294, baseType: !787, size: 64, offset: 103936)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "color_profile", scope: !617, file: !108, line: 297, baseType: !797, size: 256, offset: 104000)
!797 = !DIDerivedType(tag: DW_TAG_typedef, name: "ProfileInfo", file: !252, line: 40, baseType: !798)
!798 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ProfileInfo", file: !252, line: 27, size: 256, elements: !799)
!799 = !{!800, !801, !802, !805}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !798, file: !252, line: 30, baseType: !674, size: 64)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !798, file: !252, line: 33, baseType: !626, size: 64, offset: 64)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !798, file: !252, line: 36, baseType: !803, size: 64, offset: 128)
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !804, size: 64)
!804 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !798, file: !252, line: 39, baseType: !626, size: 64, offset: 192)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "iptc_profile", scope: !617, file: !108, line: 298, baseType: !797, size: 256, offset: 104256)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profile", scope: !617, file: !108, line: 299, baseType: !808, size: 64, offset: 104512)
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !797, size: 64)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profiles", scope: !617, file: !108, line: 302, baseType: !626, size: 64, offset: 104576)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !617, file: !108, line: 305, baseType: !626, size: 64, offset: 104640)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !617, file: !108, line: 308, baseType: !712, size: 64, offset: 104704)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !617, file: !108, line: 309, baseType: !712, size: 64, offset: 104768)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !617, file: !108, line: 310, baseType: !712, size: 64, offset: 104832)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "interpolate", scope: !617, file: !108, line: 313, baseType: !815, size: 32, offset: 104896)
!815 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterpolatePixelMethod", file: !395, line: 47, baseType: !394)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "black_point_compensation", scope: !617, file: !108, line: 316, baseType: !631, size: 32, offset: 104928)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_color", scope: !617, file: !108, line: 319, baseType: !639, size: 64, offset: 104960)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !617, file: !108, line: 322, baseType: !712, size: 64, offset: 105024)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "tile_offset", scope: !617, file: !108, line: 325, baseType: !687, size: 256, offset: 105088)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !617, file: !108, line: 328, baseType: !670, size: 64, offset: 105344)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "artifacts", scope: !617, file: !108, line: 329, baseType: !670, size: 64, offset: 105408)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !617, file: !108, line: 332, baseType: !823, size: 32, offset: 105472)
!823 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageType", file: !108, line: 61, baseType: !177)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !617, file: !108, line: 335, baseType: !631, size: 32, offset: 105504)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !617, file: !108, line: 338, baseType: !754, size: 64, offset: 105536)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "ping", scope: !617, file: !108, line: 341, baseType: !631, size: 32, offset: 105600)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !617, file: !108, line: 344, baseType: !626, size: 64, offset: 105664)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !617, file: !108, line: 347, baseType: !829, size: 64, offset: 105728)
!829 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !830, line: 7, baseType: !831)
!830 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "")
!831 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !682, line: 160, baseType: !683)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "intensity", scope: !617, file: !108, line: 350, baseType: !833, size: 32, offset: 105792)
!833 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelIntensityMethod", file: !395, line: 79, baseType: !411)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !617, file: !108, line: 353, baseType: !626, size: 64, offset: 105856)
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64)
!836 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !837, size: 64)
!837 = !DIDerivedType(tag: DW_TAG_typedef, name: "SplayTreeInfo", file: !838, line: 26, baseType: !839)
!838 = !DIFile(filename: "./magick/splay-tree.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!839 = !DICompositeType(tag: DW_TAG_structure_type, name: "_SplayTreeInfo", file: !838, line: 25, flags: DIFlagFwdDecl)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !841, size: 64)
!841 = !DIDerivedType(tag: DW_TAG_typedef, name: "StringInfo", file: !842, line: 40, baseType: !843)
!842 = !DIFile(filename: "./magick/string_.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!843 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_StringInfo", file: !842, line: 29, size: 32960, elements: !844)
!844 = !{!845, !846, !847, !848}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !843, file: !842, line: 32, baseType: !768, size: 32768)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "datum", scope: !843, file: !842, line: 35, baseType: !803, size: 64, offset: 32768)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !843, file: !842, line: 38, baseType: !626, size: 64, offset: 32832)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !843, file: !842, line: 39, baseType: !626, size: 64, offset: 32896)
!849 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64)
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !851, size: 64)
!851 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !852)
!852 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickInfo", file: !608, line: 103, baseType: !853)
!853 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MagickInfo", file: !608, line: 51, size: 1216, elements: !854)
!854 = !{!855, !856, !857, !858, !859, !860, !993, !1001, !1006, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1021, !1023, !1024, !1026, !1027, !1028, !1029}
!855 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !853, file: !608, line: 54, baseType: !674, size: 64)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !853, file: !608, line: 55, baseType: !674, size: 64, offset: 64)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !853, file: !608, line: 56, baseType: !674, size: 64, offset: 128)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "note", scope: !853, file: !608, line: 57, baseType: !674, size: 64, offset: 192)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "module", scope: !853, file: !608, line: 58, baseType: !674, size: 64, offset: 256)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "image_info", scope: !853, file: !608, line: 61, baseType: !861, size: 64, offset: 320)
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !862, size: 64)
!862 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageInfo", file: !4, line: 223, baseType: !863)
!863 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ImageInfo", file: !108, line: 356, size: 134336, elements: !864)
!864 = !{!865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !899, !900, !901, !902, !903, !904, !906, !907, !908, !909, !910, !911, !922, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !990, !991, !992}
!865 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !863, file: !108, line: 359, baseType: !624, size: 32)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !863, file: !108, line: 362, baseType: !629, size: 32, offset: 32)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "temporary", scope: !863, file: !108, line: 365, baseType: !631, size: 32, offset: 64)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "adjoin", scope: !863, file: !108, line: 366, baseType: !631, size: 32, offset: 96)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "affirm", scope: !863, file: !108, line: 367, baseType: !631, size: 32, offset: 128)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "antialias", scope: !863, file: !108, line: 368, baseType: !631, size: 32, offset: 160)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !863, file: !108, line: 371, baseType: !674, size: 64, offset: 192)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "extract", scope: !863, file: !108, line: 372, baseType: !674, size: 64, offset: 256)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !863, file: !108, line: 373, baseType: !674, size: 64, offset: 320)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "scenes", scope: !863, file: !108, line: 374, baseType: !674, size: 64, offset: 384)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !863, file: !108, line: 377, baseType: !626, size: 64, offset: 448)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "number_scenes", scope: !863, file: !108, line: 378, baseType: !626, size: 64, offset: 512)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !863, file: !108, line: 379, baseType: !626, size: 64, offset: 576)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "interlace", scope: !863, file: !108, line: 382, baseType: !702, size: 32, offset: 640)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !863, file: !108, line: 385, baseType: !704, size: 32, offset: 672)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !863, file: !108, line: 388, baseType: !672, size: 32, offset: 704)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !863, file: !108, line: 391, baseType: !626, size: 64, offset: 768)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "sampling_factor", scope: !863, file: !108, line: 394, baseType: !674, size: 64, offset: 832)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "server_name", scope: !863, file: !108, line: 395, baseType: !674, size: 64, offset: 896)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "font", scope: !863, file: !108, line: 396, baseType: !674, size: 64, offset: 960)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "texture", scope: !863, file: !108, line: 397, baseType: !674, size: 64, offset: 1024)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "density", scope: !863, file: !108, line: 398, baseType: !674, size: 64, offset: 1088)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "pointsize", scope: !863, file: !108, line: 401, baseType: !652, size: 64, offset: 1152)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !863, file: !108, line: 402, baseType: !652, size: 64, offset: 1216)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "background_color", scope: !863, file: !108, line: 405, baseType: !639, size: 64, offset: 1280)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !863, file: !108, line: 406, baseType: !639, size: 64, offset: 1344)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "matte_color", scope: !863, file: !108, line: 407, baseType: !639, size: 64, offset: 1408)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !863, file: !108, line: 410, baseType: !631, size: 32, offset: 1472)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "monochrome", scope: !863, file: !108, line: 411, baseType: !631, size: 32, offset: 1504)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !863, file: !108, line: 414, baseType: !626, size: 64, offset: 1536)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !863, file: !108, line: 417, baseType: !622, size: 32, offset: 1600)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !863, file: !108, line: 420, baseType: !823, size: 32, offset: 1632)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "preview_type", scope: !863, file: !108, line: 423, baseType: !898, size: 32, offset: 1664)
!898 = !DIDerivedType(tag: DW_TAG_typedef, name: "PreviewType", file: !192, line: 59, baseType: !191)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !863, file: !108, line: 426, baseType: !679, size: 64, offset: 1728)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "ping", scope: !863, file: !108, line: 429, baseType: !631, size: 32, offset: 1792)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !863, file: !108, line: 430, baseType: !631, size: 32, offset: 1824)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !863, file: !108, line: 433, baseType: !674, size: 64, offset: 1856)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "authenticate", scope: !863, file: !108, line: 434, baseType: !674, size: 64, offset: 1920)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !863, file: !108, line: 437, baseType: !905, size: 32, offset: 1984)
!905 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChannelType", file: !4, line: 202, baseType: !224)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !863, file: !108, line: 440, baseType: !615, size: 64, offset: 2048)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !863, file: !108, line: 443, baseType: !670, size: 64, offset: 2112)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !863, file: !108, line: 446, baseType: !743, size: 64, offset: 2176)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !863, file: !108, line: 449, baseType: !670, size: 64, offset: 2240)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !863, file: !108, line: 450, baseType: !670, size: 64, offset: 2304)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !863, file: !108, line: 453, baseType: !912, size: 64, offset: 2368)
!912 = !DIDerivedType(tag: DW_TAG_typedef, name: "StreamHandler", file: !913, line: 26, baseType: !914)
!913 = !DIFile(filename: "./magick/stream.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !915, size: 64)
!915 = !DISubroutineType(types: !916)
!916 = !{!626, !917, !919, !921}
!917 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 64)
!918 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !616)
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 64)
!920 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!921 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !626)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !863, file: !108, line: 456, baseType: !923, size: 64, offset: 2432)
!923 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !924, size: 64)
!924 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !925, line: 7, baseType: !926)
!925 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!926 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !927, line: 49, size: 1728, elements: !928)
!927 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!928 = !{!929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !944, !946, !947, !948, !950, !951, !953, !957, !960, !962, !965, !968, !969, !970, !971, !972}
!929 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !926, file: !927, line: 51, baseType: !478, size: 32)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !926, file: !927, line: 54, baseType: !674, size: 64, offset: 64)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !926, file: !927, line: 55, baseType: !674, size: 64, offset: 128)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !926, file: !927, line: 56, baseType: !674, size: 64, offset: 192)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !926, file: !927, line: 57, baseType: !674, size: 64, offset: 256)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !926, file: !927, line: 58, baseType: !674, size: 64, offset: 320)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !926, file: !927, line: 59, baseType: !674, size: 64, offset: 384)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !926, file: !927, line: 60, baseType: !674, size: 64, offset: 448)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !926, file: !927, line: 61, baseType: !674, size: 64, offset: 512)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !926, file: !927, line: 64, baseType: !674, size: 64, offset: 576)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !926, file: !927, line: 65, baseType: !674, size: 64, offset: 640)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !926, file: !927, line: 66, baseType: !674, size: 64, offset: 704)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !926, file: !927, line: 68, baseType: !942, size: 64, offset: 768)
!942 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 64)
!943 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !927, line: 36, flags: DIFlagFwdDecl)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !926, file: !927, line: 70, baseType: !945, size: 64, offset: 832)
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !926, file: !927, line: 72, baseType: !478, size: 32, offset: 896)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !926, file: !927, line: 73, baseType: !478, size: 32, offset: 928)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !926, file: !927, line: 74, baseType: !949, size: 64, offset: 960)
!949 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !682, line: 152, baseType: !683)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !926, file: !927, line: 77, baseType: !644, size: 16, offset: 1024)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !926, file: !927, line: 78, baseType: !952, size: 8, offset: 1040)
!952 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !926, file: !927, line: 79, baseType: !954, size: 8, offset: 1048)
!954 = !DICompositeType(tag: DW_TAG_array_type, baseType: !675, size: 8, elements: !955)
!955 = !{!956}
!956 = !DISubrange(count: 1)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !926, file: !927, line: 81, baseType: !958, size: 64, offset: 1088)
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64)
!959 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !927, line: 43, baseType: null)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !926, file: !927, line: 89, baseType: !961, size: 64, offset: 1152)
!961 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !682, line: 153, baseType: !683)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !926, file: !927, line: 91, baseType: !963, size: 64, offset: 1216)
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 64)
!964 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !927, line: 37, flags: DIFlagFwdDecl)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !926, file: !927, line: 92, baseType: !966, size: 64, offset: 1280)
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 64)
!967 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !927, line: 38, flags: DIFlagFwdDecl)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !926, file: !927, line: 93, baseType: !945, size: 64, offset: 1344)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !926, file: !927, line: 94, baseType: !670, size: 64, offset: 1408)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !926, file: !927, line: 95, baseType: !626, size: 64, offset: 1472)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !926, file: !927, line: 96, baseType: !478, size: 32, offset: 1536)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !926, file: !927, line: 98, baseType: !973, size: 160, offset: 1568)
!973 = !DICompositeType(tag: DW_TAG_array_type, baseType: !675, size: 160, elements: !974)
!974 = !{!975}
!975 = !DISubrange(count: 20)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !863, file: !108, line: 459, baseType: !670, size: 64, offset: 2496)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !863, file: !108, line: 462, baseType: !626, size: 64, offset: 2560)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !863, file: !108, line: 465, baseType: !768, size: 32768, offset: 2624)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "unique", scope: !863, file: !108, line: 466, baseType: !768, size: 32768, offset: 35392)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "zero", scope: !863, file: !108, line: 467, baseType: !768, size: 32768, offset: 68160)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !863, file: !108, line: 468, baseType: !768, size: 32768, offset: 100928)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !863, file: !108, line: 471, baseType: !631, size: 32, offset: 133696)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "tile", scope: !863, file: !108, line: 474, baseType: !674, size: 64, offset: 133760)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "subimage", scope: !863, file: !108, line: 477, baseType: !626, size: 64, offset: 133824)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "subrange", scope: !863, file: !108, line: 478, baseType: !626, size: 64, offset: 133888)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "pen", scope: !863, file: !108, line: 481, baseType: !639, size: 64, offset: 133952)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !863, file: !108, line: 484, baseType: !626, size: 64, offset: 134016)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_pixel_method", scope: !863, file: !108, line: 487, baseType: !989, size: 32, offset: 134080)
!989 = !DIDerivedType(tag: DW_TAG_typedef, name: "VirtualPixelMethod", file: !424, line: 47, baseType: !423)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_color", scope: !863, file: !108, line: 490, baseType: !639, size: 64, offset: 134112)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !863, file: !108, line: 493, baseType: !670, size: 64, offset: 134208)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "synchronize", scope: !863, file: !108, line: 496, baseType: !631, size: 32, offset: 134272)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "decoder", scope: !853, file: !608, line: 64, baseType: !994, size: 64, offset: 384)
!994 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !995, size: 64)
!995 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeImageHandler", file: !608, line: 43, baseType: !996)
!996 = !DISubroutineType(types: !997)
!997 = !{!615, !998, !1000}
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !999, size: 64)
!999 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !862)
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "encoder", scope: !853, file: !608, line: 67, baseType: !1002, size: 64, offset: 448)
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1003, size: 64)
!1003 = !DIDerivedType(tag: DW_TAG_typedef, name: "EncodeImageHandler", file: !608, line: 46, baseType: !1004)
!1004 = !DISubroutineType(types: !1005)
!1005 = !{!631, !998, !615}
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !853, file: !608, line: 70, baseType: !1007, size: 64, offset: 512)
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1008, size: 64)
!1008 = !DIDerivedType(tag: DW_TAG_typedef, name: "IsImageFormatHandler", file: !608, line: 49, baseType: !1009)
!1009 = !DISubroutineType(types: !1010)
!1010 = !{!631, !1011, !921}
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64)
!1012 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !804)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !853, file: !608, line: 73, baseType: !670, size: 64, offset: 576)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "adjoin", scope: !853, file: !608, line: 76, baseType: !631, size: 32, offset: 640)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !853, file: !608, line: 77, baseType: !631, size: 32, offset: 672)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "endian_support", scope: !853, file: !608, line: 78, baseType: !631, size: 32, offset: 704)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "blob_support", scope: !853, file: !608, line: 79, baseType: !631, size: 32, offset: 736)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "seekable_stream", scope: !853, file: !608, line: 80, baseType: !631, size: 32, offset: 768)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "format_type", scope: !853, file: !608, line: 83, baseType: !1020, size: 32, offset: 800)
!1020 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickFormatType", file: !608, line: 33, baseType: !607)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "thread_support", scope: !853, file: !608, line: 86, baseType: !1022, size: 32, offset: 832)
!1022 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickStatusType", file: !4, line: 147, baseType: !5)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "stealth", scope: !853, file: !608, line: 89, baseType: !631, size: 32, offset: 864)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !853, file: !608, line: 92, baseType: !1025, size: 64, offset: 896)
!1025 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !853, size: 64)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !853, file: !608, line: 93, baseType: !1025, size: 64, offset: 960)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !853, file: !608, line: 96, baseType: !626, size: 64, offset: 1024)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !853, file: !608, line: 99, baseType: !674, size: 64, offset: 1088)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !853, file: !608, line: 102, baseType: !787, size: 64, offset: 1152)
!1030 = !{i32 7, !"Dwarf Version", i32 4}
!1031 = !{i32 2, !"Debug Info Version", i32 3}
!1032 = !{i32 1, !"wchar_size", i32 4}
!1033 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!1034 = distinct !DISubprogram(name: "MagickDeleteImageArtifact", scope: !1, file: !1, line: 80, type: !1035, scopeLine: 82, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !1065)
!1035 = !DISubroutineType(types: !1036)
!1036 = !{!631, !1037, !748}
!1037 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1038, size: 64)
!1038 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickWand", file: !1039, line: 69, baseType: !1040)
!1039 = !DIFile(filename: "./wand/MagickWand.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!1040 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MagickWand", file: !1041, line: 50, size: 33280, elements: !1042)
!1041 = !DIFile(filename: "./wand/magick-wand-private.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!1042 = !{!1043, !1044, !1045, !1046, !1047, !1060, !1061, !1062, !1063, !1064}
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1040, file: !1041, line: 53, baseType: !626, size: 64)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1040, file: !1041, line: 56, baseType: !768, size: 32768, offset: 64)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "exception", scope: !1040, file: !1041, line: 59, baseType: !1000, size: 64, offset: 32832)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "image_info", scope: !1040, file: !1041, line: 62, baseType: !861, size: 64, offset: 32896)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "quantize_info", scope: !1040, file: !1041, line: 65, baseType: !1048, size: 64, offset: 32960)
!1048 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1049, size: 64)
!1049 = !DIDerivedType(tag: DW_TAG_typedef, name: "QuantizeInfo", file: !445, line: 57, baseType: !1050)
!1050 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QuantizeInfo", file: !445, line: 35, size: 384, elements: !1051)
!1051 = !{!1052, !1053, !1054, !1055, !1056, !1057, !1058}
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "number_colors", scope: !1050, file: !445, line: 38, baseType: !626, size: 64)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "tree_depth", scope: !1050, file: !445, line: 41, baseType: !626, size: 64, offset: 64)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !1050, file: !445, line: 44, baseType: !631, size: 32, offset: 128)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1050, file: !445, line: 47, baseType: !622, size: 32, offset: 160)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "measure_error", scope: !1050, file: !445, line: 50, baseType: !631, size: 32, offset: 192)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !1050, file: !445, line: 53, baseType: !626, size: 64, offset: 256)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "dither_method", scope: !1050, file: !445, line: 56, baseType: !1059, size: 32, offset: 320)
!1059 = !DIDerivedType(tag: DW_TAG_typedef, name: "DitherMethod", file: !445, line: 33, baseType: !444)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "images", scope: !1040, file: !1041, line: 68, baseType: !615, size: 64, offset: 33024)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "insert_before", scope: !1040, file: !1041, line: 71, baseType: !631, size: 32, offset: 33088)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "image_pending", scope: !1040, file: !1041, line: 72, baseType: !631, size: 32, offset: 33120)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1040, file: !1041, line: 73, baseType: !631, size: 32, offset: 33152)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !1040, file: !1041, line: 76, baseType: !626, size: 64, offset: 33216)
!1065 = !{}
!1066 = !DILocalVariable(name: "wand", arg: 1, scope: !1034, file: !1, line: 80, type: !1037)
!1067 = !DILocation(line: 80, column: 68, scope: !1034)
!1068 = !DILocalVariable(name: "artifact", arg: 2, scope: !1034, file: !1, line: 81, type: !748)
!1069 = !DILocation(line: 81, column: 15, scope: !1034)
!1070 = !DILocation(line: 85, column: 7, scope: !1071)
!1071 = distinct !DILexicalBlock(scope: !1034, file: !1, line: 85, column: 7)
!1072 = !DILocation(line: 85, column: 13, scope: !1071)
!1073 = !DILocation(line: 85, column: 19, scope: !1071)
!1074 = !DILocation(line: 85, column: 7, scope: !1034)
!1075 = !DILocation(line: 86, column: 60, scope: !1071)
!1076 = !DILocation(line: 86, column: 66, scope: !1071)
!1077 = !DILocation(line: 86, column: 12, scope: !1071)
!1078 = !DILocation(line: 86, column: 5, scope: !1071)
!1079 = !DILocation(line: 87, column: 7, scope: !1080)
!1080 = distinct !DILexicalBlock(scope: !1034, file: !1, line: 87, column: 7)
!1081 = !DILocation(line: 87, column: 13, scope: !1080)
!1082 = !DILocation(line: 87, column: 20, scope: !1080)
!1083 = !DILocation(line: 87, column: 7, scope: !1034)
!1084 = !DILocation(line: 89, column: 35, scope: !1085)
!1085 = distinct !DILexicalBlock(scope: !1080, file: !1, line: 88, column: 5)
!1086 = !DILocation(line: 89, column: 41, scope: !1085)
!1087 = !DILocation(line: 90, column: 35, scope: !1085)
!1088 = !DILocation(line: 90, column: 41, scope: !1085)
!1089 = !DILocation(line: 89, column: 14, scope: !1085)
!1090 = !DILocation(line: 91, column: 7, scope: !1085)
!1091 = !DILocation(line: 93, column: 30, scope: !1034)
!1092 = !DILocation(line: 93, column: 36, scope: !1034)
!1093 = !DILocation(line: 93, column: 43, scope: !1034)
!1094 = !DILocation(line: 93, column: 10, scope: !1034)
!1095 = !DILocation(line: 93, column: 3, scope: !1034)
!1096 = !DILocation(line: 94, column: 1, scope: !1034)
!1097 = distinct !DISubprogram(name: "MagickDeleteImageProperty", scope: !1, file: !1, line: 121, type: !1035, scopeLine: 123, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !1065)
!1098 = !DILocalVariable(name: "wand", arg: 1, scope: !1097, file: !1, line: 121, type: !1037)
!1099 = !DILocation(line: 121, column: 68, scope: !1097)
!1100 = !DILocalVariable(name: "property", arg: 2, scope: !1097, file: !1, line: 122, type: !748)
!1101 = !DILocation(line: 122, column: 15, scope: !1097)
!1102 = !DILocation(line: 126, column: 7, scope: !1103)
!1103 = distinct !DILexicalBlock(scope: !1097, file: !1, line: 126, column: 7)
!1104 = !DILocation(line: 126, column: 13, scope: !1103)
!1105 = !DILocation(line: 126, column: 19, scope: !1103)
!1106 = !DILocation(line: 126, column: 7, scope: !1097)
!1107 = !DILocation(line: 127, column: 60, scope: !1103)
!1108 = !DILocation(line: 127, column: 66, scope: !1103)
!1109 = !DILocation(line: 127, column: 12, scope: !1103)
!1110 = !DILocation(line: 127, column: 5, scope: !1103)
!1111 = !DILocation(line: 128, column: 7, scope: !1112)
!1112 = distinct !DILexicalBlock(scope: !1097, file: !1, line: 128, column: 7)
!1113 = !DILocation(line: 128, column: 13, scope: !1112)
!1114 = !DILocation(line: 128, column: 20, scope: !1112)
!1115 = !DILocation(line: 128, column: 7, scope: !1097)
!1116 = !DILocation(line: 130, column: 35, scope: !1117)
!1117 = distinct !DILexicalBlock(scope: !1112, file: !1, line: 129, column: 5)
!1118 = !DILocation(line: 130, column: 41, scope: !1117)
!1119 = !DILocation(line: 131, column: 35, scope: !1117)
!1120 = !DILocation(line: 131, column: 41, scope: !1117)
!1121 = !DILocation(line: 130, column: 14, scope: !1117)
!1122 = !DILocation(line: 132, column: 7, scope: !1117)
!1123 = !DILocation(line: 134, column: 30, scope: !1097)
!1124 = !DILocation(line: 134, column: 36, scope: !1097)
!1125 = !DILocation(line: 134, column: 43, scope: !1097)
!1126 = !DILocation(line: 134, column: 10, scope: !1097)
!1127 = !DILocation(line: 134, column: 3, scope: !1097)
!1128 = !DILocation(line: 135, column: 1, scope: !1097)
!1129 = distinct !DISubprogram(name: "MagickDeleteOption", scope: !1, file: !1, line: 162, type: !1035, scopeLine: 164, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !1065)
!1130 = !DILocalVariable(name: "wand", arg: 1, scope: !1129, file: !1, line: 162, type: !1037)
!1131 = !DILocation(line: 162, column: 61, scope: !1129)
!1132 = !DILocalVariable(name: "option", arg: 2, scope: !1129, file: !1, line: 163, type: !748)
!1133 = !DILocation(line: 163, column: 15, scope: !1129)
!1134 = !DILocation(line: 167, column: 7, scope: !1135)
!1135 = distinct !DILexicalBlock(scope: !1129, file: !1, line: 167, column: 7)
!1136 = !DILocation(line: 167, column: 13, scope: !1135)
!1137 = !DILocation(line: 167, column: 19, scope: !1135)
!1138 = !DILocation(line: 167, column: 7, scope: !1129)
!1139 = !DILocation(line: 168, column: 60, scope: !1135)
!1140 = !DILocation(line: 168, column: 66, scope: !1135)
!1141 = !DILocation(line: 168, column: 12, scope: !1135)
!1142 = !DILocation(line: 168, column: 5, scope: !1135)
!1143 = !DILocation(line: 169, column: 28, scope: !1129)
!1144 = !DILocation(line: 169, column: 34, scope: !1129)
!1145 = !DILocation(line: 169, column: 45, scope: !1129)
!1146 = !DILocation(line: 169, column: 10, scope: !1129)
!1147 = !DILocation(line: 169, column: 3, scope: !1129)
!1148 = distinct !DISubprogram(name: "MagickGetAntialias", scope: !1, file: !1, line: 195, type: !1149, scopeLine: 196, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !1065)
!1149 = !DISubroutineType(types: !1150)
!1150 = !{!631, !1151}
!1151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1152, size: 64)
!1152 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1038)
!1153 = !DILocalVariable(name: "wand", arg: 1, scope: !1148, file: !1, line: 195, type: !1151)
!1154 = !DILocation(line: 195, column: 67, scope: !1148)
!1155 = !DILocation(line: 199, column: 7, scope: !1156)
!1156 = distinct !DILexicalBlock(scope: !1148, file: !1, line: 199, column: 7)
!1157 = !DILocation(line: 199, column: 13, scope: !1156)
!1158 = !DILocation(line: 199, column: 19, scope: !1156)
!1159 = !DILocation(line: 199, column: 7, scope: !1148)
!1160 = !DILocation(line: 200, column: 60, scope: !1156)
!1161 = !DILocation(line: 200, column: 66, scope: !1156)
!1162 = !DILocation(line: 200, column: 12, scope: !1156)
!1163 = !DILocation(line: 200, column: 5, scope: !1156)
!1164 = !DILocation(line: 201, column: 10, scope: !1148)
!1165 = !DILocation(line: 201, column: 16, scope: !1148)
!1166 = !DILocation(line: 201, column: 28, scope: !1148)
!1167 = !DILocation(line: 201, column: 3, scope: !1148)
!1168 = distinct !DISubprogram(name: "MagickGetBackgroundColor", scope: !1, file: !1, line: 226, type: !1169, scopeLine: 227, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !1065)
!1169 = !DISubroutineType(types: !1170)
!1170 = !{!1171, !1037}
!1171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1172, size: 64)
!1172 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelWand", file: !1173, line: 26, baseType: !1174)
!1173 = !DIFile(filename: "./wand/pixel-wand.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!1174 = !DICompositeType(tag: DW_TAG_structure_type, name: "_PixelWand", file: !1173, line: 25, flags: DIFlagFwdDecl)
!1175 = !DILocalVariable(name: "wand", arg: 1, scope: !1168, file: !1, line: 226, type: !1037)
!1176 = !DILocation(line: 226, column: 60, scope: !1168)
!1177 = !DILocalVariable(name: "background_color", scope: !1168, file: !1, line: 229, type: !1171)
!1178 = !DILocation(line: 229, column: 6, scope: !1168)
!1179 = !DILocation(line: 233, column: 7, scope: !1180)
!1180 = distinct !DILexicalBlock(scope: !1168, file: !1, line: 233, column: 7)
!1181 = !DILocation(line: 233, column: 13, scope: !1180)
!1182 = !DILocation(line: 233, column: 19, scope: !1180)
!1183 = !DILocation(line: 233, column: 7, scope: !1168)
!1184 = !DILocation(line: 234, column: 60, scope: !1180)
!1185 = !DILocation(line: 234, column: 66, scope: !1180)
!1186 = !DILocation(line: 234, column: 12, scope: !1180)
!1187 = !DILocation(line: 234, column: 5, scope: !1180)
!1188 = !DILocation(line: 235, column: 20, scope: !1168)
!1189 = !DILocation(line: 235, column: 19, scope: !1168)
!1190 = !DILocation(line: 236, column: 24, scope: !1168)
!1191 = !DILocation(line: 236, column: 42, scope: !1168)
!1192 = !DILocation(line: 236, column: 48, scope: !1168)
!1193 = !DILocation(line: 236, column: 60, scope: !1168)
!1194 = !DILocation(line: 236, column: 3, scope: !1168)
!1195 = !DILocation(line: 237, column: 10, scope: !1168)
!1196 = !DILocation(line: 237, column: 3, scope: !1168)
!1197 = distinct !DISubprogram(name: "MagickGetColorspace", scope: !1, file: !1, line: 262, type: !1198, scopeLine: 263, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !1065)
!1198 = !DISubroutineType(types: !1199)
!1199 = !{!622, !1037}
!1200 = !DILocalVariable(name: "wand", arg: 1, scope: !1197, file: !1, line: 262, type: !1037)
!1201 = !DILocation(line: 262, column: 59, scope: !1197)
!1202 = !DILocation(line: 266, column: 7, scope: !1203)
!1203 = distinct !DILexicalBlock(scope: !1197, file: !1, line: 266, column: 7)
!1204 = !DILocation(line: 266, column: 13, scope: !1203)
!1205 = !DILocation(line: 266, column: 19, scope: !1203)
!1206 = !DILocation(line: 266, column: 7, scope: !1197)
!1207 = !DILocation(line: 267, column: 60, scope: !1203)
!1208 = !DILocation(line: 267, column: 66, scope: !1203)
!1209 = !DILocation(line: 267, column: 12, scope: !1203)
!1210 = !DILocation(line: 267, column: 5, scope: !1203)
!1211 = !DILocation(line: 268, column: 10, scope: !1197)
!1212 = !DILocation(line: 268, column: 16, scope: !1197)
!1213 = !DILocation(line: 268, column: 28, scope: !1197)
!1214 = !DILocation(line: 268, column: 3, scope: !1197)
!1215 = distinct !DISubprogram(name: "MagickGetCompression", scope: !1, file: !1, line: 293, type: !1216, scopeLine: 294, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !1065)
!1216 = !DISubroutineType(types: !1217)
!1217 = !{!624, !1037}
!1218 = !DILocalVariable(name: "wand", arg: 1, scope: !1215, file: !1, line: 293, type: !1037)
!1219 = !DILocation(line: 293, column: 61, scope: !1215)
!1220 = !DILocation(line: 297, column: 7, scope: !1221)
!1221 = distinct !DILexicalBlock(scope: !1215, file: !1, line: 297, column: 7)
!1222 = !DILocation(line: 297, column: 13, scope: !1221)
!1223 = !DILocation(line: 297, column: 19, scope: !1221)
!1224 = !DILocation(line: 297, column: 7, scope: !1215)
!1225 = !DILocation(line: 298, column: 60, scope: !1221)
!1226 = !DILocation(line: 298, column: 66, scope: !1221)
!1227 = !DILocation(line: 298, column: 12, scope: !1221)
!1228 = !DILocation(line: 298, column: 5, scope: !1221)
!1229 = !DILocation(line: 299, column: 10, scope: !1215)
!1230 = !DILocation(line: 299, column: 16, scope: !1215)
!1231 = !DILocation(line: 299, column: 28, scope: !1215)
!1232 = !DILocation(line: 299, column: 3, scope: !1215)
!1233 = distinct !DISubprogram(name: "MagickGetCompressionQuality", scope: !1, file: !1, line: 324, type: !1234, scopeLine: 325, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !1065)
!1234 = !DISubroutineType(types: !1235)
!1235 = !{!626, !1037}
!1236 = !DILocalVariable(name: "wand", arg: 1, scope: !1233, file: !1, line: 324, type: !1037)
!1237 = !DILocation(line: 324, column: 59, scope: !1233)
!1238 = !DILocation(line: 328, column: 7, scope: !1239)
!1239 = distinct !DILexicalBlock(scope: !1233, file: !1, line: 328, column: 7)
!1240 = !DILocation(line: 328, column: 13, scope: !1239)
!1241 = !DILocation(line: 328, column: 19, scope: !1239)
!1242 = !DILocation(line: 328, column: 7, scope: !1233)
!1243 = !DILocation(line: 329, column: 60, scope: !1239)
!1244 = !DILocation(line: 329, column: 66, scope: !1239)
!1245 = !DILocation(line: 329, column: 12, scope: !1239)
!1246 = !DILocation(line: 329, column: 5, scope: !1239)
!1247 = !DILocation(line: 330, column: 10, scope: !1233)
!1248 = !DILocation(line: 330, column: 16, scope: !1233)
!1249 = !DILocation(line: 330, column: 28, scope: !1233)
!1250 = !DILocation(line: 330, column: 3, scope: !1233)
!1251 = distinct !DISubprogram(name: "MagickGetCopyright", scope: !1, file: !1, line: 352, type: !1252, scopeLine: 353, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !1065)
!1252 = !DISubroutineType(types: !1253)
!1253 = !{!748}
!1254 = !DILocation(line: 354, column: 10, scope: !1251)
!1255 = !DILocation(line: 354, column: 3, scope: !1251)
!1256 = distinct !DISubprogram(name: "MagickGetFilename", scope: !1, file: !1, line: 379, type: !1257, scopeLine: 380, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !1065)
!1257 = !DISubroutineType(types: !1258)
!1258 = !{!674, !1151}
!1259 = !DILocalVariable(name: "wand", arg: 1, scope: !1256, file: !1, line: 379, type: !1151)
!1260 = !DILocation(line: 379, column: 54, scope: !1256)
!1261 = !DILocation(line: 383, column: 7, scope: !1262)
!1262 = distinct !DILexicalBlock(scope: !1256, file: !1, line: 383, column: 7)
!1263 = !DILocation(line: 383, column: 13, scope: !1262)
!1264 = !DILocation(line: 383, column: 19, scope: !1262)
!1265 = !DILocation(line: 383, column: 7, scope: !1256)
!1266 = !DILocation(line: 384, column: 60, scope: !1262)
!1267 = !DILocation(line: 384, column: 66, scope: !1262)
!1268 = !DILocation(line: 384, column: 12, scope: !1262)
!1269 = !DILocation(line: 384, column: 5, scope: !1262)
!1270 = !DILocation(line: 385, column: 24, scope: !1256)
!1271 = !DILocation(line: 385, column: 30, scope: !1256)
!1272 = !DILocation(line: 385, column: 42, scope: !1256)
!1273 = !DILocation(line: 385, column: 10, scope: !1256)
!1274 = !DILocation(line: 385, column: 3, scope: !1256)
!1275 = distinct !DISubprogram(name: "MagickGetFont", scope: !1, file: !1, line: 410, type: !1276, scopeLine: 411, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !1065)
!1276 = !DISubroutineType(types: !1277)
!1277 = !{!674, !1037}
!1278 = !DILocalVariable(name: "wand", arg: 1, scope: !1275, file: !1, line: 410, type: !1037)
!1279 = !DILocation(line: 410, column: 44, scope: !1275)
!1280 = !DILocation(line: 414, column: 7, scope: !1281)
!1281 = distinct !DILexicalBlock(scope: !1275, file: !1, line: 414, column: 7)
!1282 = !DILocation(line: 414, column: 13, scope: !1281)
!1283 = !DILocation(line: 414, column: 19, scope: !1281)
!1284 = !DILocation(line: 414, column: 7, scope: !1275)
!1285 = !DILocation(line: 415, column: 60, scope: !1281)
!1286 = !DILocation(line: 415, column: 66, scope: !1281)
!1287 = !DILocation(line: 415, column: 12, scope: !1281)
!1288 = !DILocation(line: 415, column: 5, scope: !1281)
!1289 = !DILocation(line: 416, column: 7, scope: !1290)
!1290 = distinct !DILexicalBlock(scope: !1275, file: !1, line: 416, column: 7)
!1291 = !DILocation(line: 416, column: 13, scope: !1290)
!1292 = !DILocation(line: 416, column: 25, scope: !1290)
!1293 = !DILocation(line: 416, column: 30, scope: !1290)
!1294 = !DILocation(line: 416, column: 7, scope: !1275)
!1295 = !DILocation(line: 417, column: 5, scope: !1290)
!1296 = !DILocation(line: 418, column: 24, scope: !1275)
!1297 = !DILocation(line: 418, column: 30, scope: !1275)
!1298 = !DILocation(line: 418, column: 42, scope: !1275)
!1299 = !DILocation(line: 418, column: 10, scope: !1275)
!1300 = !DILocation(line: 418, column: 3, scope: !1275)
!1301 = !DILocation(line: 419, column: 1, scope: !1275)
!1302 = distinct !DISubprogram(name: "MagickGetFormat", scope: !1, file: !1, line: 443, type: !1276, scopeLine: 444, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !1065)
!1303 = !DILocalVariable(name: "wand", arg: 1, scope: !1302, file: !1, line: 443, type: !1037)
!1304 = !DILocation(line: 443, column: 46, scope: !1302)
!1305 = !DILocation(line: 447, column: 7, scope: !1306)
!1306 = distinct !DILexicalBlock(scope: !1302, file: !1, line: 447, column: 7)
!1307 = !DILocation(line: 447, column: 13, scope: !1306)
!1308 = !DILocation(line: 447, column: 19, scope: !1306)
!1309 = !DILocation(line: 447, column: 7, scope: !1302)
!1310 = !DILocation(line: 448, column: 60, scope: !1306)
!1311 = !DILocation(line: 448, column: 66, scope: !1306)
!1312 = !DILocation(line: 448, column: 12, scope: !1306)
!1313 = !DILocation(line: 448, column: 5, scope: !1306)
!1314 = !DILocation(line: 449, column: 24, scope: !1302)
!1315 = !DILocation(line: 449, column: 30, scope: !1302)
!1316 = !DILocation(line: 449, column: 42, scope: !1302)
!1317 = !DILocation(line: 449, column: 10, scope: !1302)
!1318 = !DILocation(line: 449, column: 3, scope: !1302)
!1319 = distinct !DISubprogram(name: "MagickGetGravity", scope: !1, file: !1, line: 474, type: !1320, scopeLine: 475, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !1065)
!1320 = !DISubroutineType(types: !1321)
!1321 = !{!706, !1037}
!1322 = !DILocalVariable(name: "wand", arg: 1, scope: !1319, file: !1, line: 474, type: !1037)
!1323 = !DILocation(line: 474, column: 53, scope: !1319)
!1324 = !DILocalVariable(name: "option", scope: !1319, file: !1, line: 477, type: !748)
!1325 = !DILocation(line: 477, column: 6, scope: !1319)
!1326 = !DILocalVariable(name: "type", scope: !1319, file: !1, line: 480, type: !706)
!1327 = !DILocation(line: 480, column: 5, scope: !1319)
!1328 = !DILocation(line: 484, column: 7, scope: !1329)
!1329 = distinct !DILexicalBlock(scope: !1319, file: !1, line: 484, column: 7)
!1330 = !DILocation(line: 484, column: 13, scope: !1329)
!1331 = !DILocation(line: 484, column: 19, scope: !1329)
!1332 = !DILocation(line: 484, column: 7, scope: !1319)
!1333 = !DILocation(line: 485, column: 60, scope: !1329)
!1334 = !DILocation(line: 485, column: 66, scope: !1329)
!1335 = !DILocation(line: 485, column: 12, scope: !1329)
!1336 = !DILocation(line: 485, column: 5, scope: !1329)
!1337 = !DILocation(line: 486, column: 25, scope: !1319)
!1338 = !DILocation(line: 486, column: 31, scope: !1319)
!1339 = !DILocation(line: 486, column: 10, scope: !1319)
!1340 = !DILocation(line: 486, column: 9, scope: !1319)
!1341 = !DILocation(line: 487, column: 7, scope: !1342)
!1342 = distinct !DILexicalBlock(scope: !1319, file: !1, line: 487, column: 7)
!1343 = !DILocation(line: 487, column: 14, scope: !1342)
!1344 = !DILocation(line: 487, column: 7, scope: !1319)
!1345 = !DILocation(line: 488, column: 5, scope: !1342)
!1346 = !DILocation(line: 489, column: 74, scope: !1319)
!1347 = !DILocation(line: 489, column: 22, scope: !1319)
!1348 = !DILocation(line: 489, column: 8, scope: !1319)
!1349 = !DILocation(line: 489, column: 7, scope: !1319)
!1350 = !DILocation(line: 490, column: 10, scope: !1319)
!1351 = !DILocation(line: 490, column: 3, scope: !1319)
!1352 = !DILocation(line: 491, column: 1, scope: !1319)
!1353 = distinct !DISubprogram(name: "MagickGetHomeURL", scope: !1, file: !1, line: 511, type: !1354, scopeLine: 512, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !1065)
!1354 = !DISubroutineType(types: !1355)
!1355 = !{!674}
!1356 = !DILocation(line: 513, column: 10, scope: !1353)
!1357 = !DILocation(line: 513, column: 3, scope: !1353)
!1358 = distinct !DISubprogram(name: "MagickGetImageArtifact", scope: !1, file: !1, line: 542, type: !1359, scopeLine: 543, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !1065)
!1359 = !DISubroutineType(types: !1360)
!1360 = !{!674, !1037, !748}
!1361 = !DILocalVariable(name: "wand", arg: 1, scope: !1358, file: !1, line: 542, type: !1037)
!1362 = !DILocation(line: 542, column: 53, scope: !1358)
!1363 = !DILocalVariable(name: "artifact", arg: 2, scope: !1358, file: !1, line: 542, type: !748)
!1364 = !DILocation(line: 542, column: 70, scope: !1358)
!1365 = !DILocalVariable(name: "value", scope: !1358, file: !1, line: 545, type: !748)
!1366 = !DILocation(line: 545, column: 6, scope: !1358)
!1367 = !DILocation(line: 549, column: 7, scope: !1368)
!1368 = distinct !DILexicalBlock(scope: !1358, file: !1, line: 549, column: 7)
!1369 = !DILocation(line: 549, column: 13, scope: !1368)
!1370 = !DILocation(line: 549, column: 19, scope: !1368)
!1371 = !DILocation(line: 549, column: 7, scope: !1358)
!1372 = !DILocation(line: 550, column: 60, scope: !1368)
!1373 = !DILocation(line: 550, column: 66, scope: !1368)
!1374 = !DILocation(line: 550, column: 12, scope: !1368)
!1375 = !DILocation(line: 550, column: 5, scope: !1368)
!1376 = !DILocation(line: 551, column: 7, scope: !1377)
!1377 = distinct !DILexicalBlock(scope: !1358, file: !1, line: 551, column: 7)
!1378 = !DILocation(line: 551, column: 13, scope: !1377)
!1379 = !DILocation(line: 551, column: 20, scope: !1377)
!1380 = !DILocation(line: 551, column: 7, scope: !1358)
!1381 = !DILocation(line: 553, column: 35, scope: !1382)
!1382 = distinct !DILexicalBlock(scope: !1377, file: !1, line: 552, column: 5)
!1383 = !DILocation(line: 553, column: 41, scope: !1382)
!1384 = !DILocation(line: 554, column: 35, scope: !1382)
!1385 = !DILocation(line: 554, column: 41, scope: !1382)
!1386 = !DILocation(line: 553, column: 14, scope: !1382)
!1387 = !DILocation(line: 555, column: 7, scope: !1382)
!1388 = !DILocation(line: 557, column: 26, scope: !1358)
!1389 = !DILocation(line: 557, column: 32, scope: !1358)
!1390 = !DILocation(line: 557, column: 39, scope: !1358)
!1391 = !DILocation(line: 557, column: 9, scope: !1358)
!1392 = !DILocation(line: 557, column: 8, scope: !1358)
!1393 = !DILocation(line: 558, column: 7, scope: !1394)
!1394 = distinct !DILexicalBlock(scope: !1358, file: !1, line: 558, column: 7)
!1395 = !DILocation(line: 558, column: 13, scope: !1394)
!1396 = !DILocation(line: 558, column: 7, scope: !1358)
!1397 = !DILocation(line: 559, column: 5, scope: !1394)
!1398 = !DILocation(line: 560, column: 25, scope: !1358)
!1399 = !DILocation(line: 560, column: 10, scope: !1358)
!1400 = !DILocation(line: 560, column: 3, scope: !1358)
!1401 = !DILocation(line: 561, column: 1, scope: !1358)
!1402 = distinct !DISubprogram(name: "MagickGetImageArtifacts", scope: !1, file: !1, line: 593, type: !1403, scopeLine: 595, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !1065)
!1403 = !DISubroutineType(types: !1404)
!1404 = !{!835, !1037, !748, !1405}
!1405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 64)
!1406 = !DILocalVariable(name: "wand", arg: 1, scope: !1402, file: !1, line: 593, type: !1037)
!1407 = !DILocation(line: 593, column: 55, scope: !1402)
!1408 = !DILocalVariable(name: "pattern", arg: 2, scope: !1402, file: !1, line: 594, type: !748)
!1409 = !DILocation(line: 594, column: 15, scope: !1402)
!1410 = !DILocalVariable(name: "number_artifacts", arg: 3, scope: !1402, file: !1, line: 594, type: !1405)
!1411 = !DILocation(line: 594, column: 31, scope: !1402)
!1412 = !DILocalVariable(name: "artifacts", scope: !1402, file: !1, line: 597, type: !835)
!1413 = !DILocation(line: 597, column: 7, scope: !1402)
!1414 = !DILocalVariable(name: "artifact", scope: !1402, file: !1, line: 600, type: !748)
!1415 = !DILocation(line: 600, column: 6, scope: !1402)
!1416 = !DILocalVariable(name: "i", scope: !1402, file: !1, line: 603, type: !679)
!1417 = !DILocation(line: 603, column: 5, scope: !1402)
!1418 = !DILocalVariable(name: "length", scope: !1402, file: !1, line: 606, type: !626)
!1419 = !DILocation(line: 606, column: 5, scope: !1402)
!1420 = !DILocation(line: 610, column: 7, scope: !1421)
!1421 = distinct !DILexicalBlock(scope: !1402, file: !1, line: 610, column: 7)
!1422 = !DILocation(line: 610, column: 13, scope: !1421)
!1423 = !DILocation(line: 610, column: 19, scope: !1421)
!1424 = !DILocation(line: 610, column: 7, scope: !1402)
!1425 = !DILocation(line: 611, column: 60, scope: !1421)
!1426 = !DILocation(line: 611, column: 66, scope: !1421)
!1427 = !DILocation(line: 611, column: 12, scope: !1421)
!1428 = !DILocation(line: 611, column: 5, scope: !1421)
!1429 = !DILocation(line: 612, column: 7, scope: !1430)
!1430 = distinct !DILexicalBlock(scope: !1402, file: !1, line: 612, column: 7)
!1431 = !DILocation(line: 612, column: 13, scope: !1430)
!1432 = !DILocation(line: 612, column: 20, scope: !1430)
!1433 = !DILocation(line: 612, column: 7, scope: !1402)
!1434 = !DILocation(line: 614, column: 35, scope: !1435)
!1435 = distinct !DILexicalBlock(scope: !1430, file: !1, line: 613, column: 5)
!1436 = !DILocation(line: 614, column: 41, scope: !1435)
!1437 = !DILocation(line: 615, column: 35, scope: !1435)
!1438 = !DILocation(line: 615, column: 41, scope: !1435)
!1439 = !DILocation(line: 614, column: 14, scope: !1435)
!1440 = !DILocation(line: 616, column: 7, scope: !1435)
!1441 = !DILocation(line: 618, column: 27, scope: !1402)
!1442 = !DILocation(line: 618, column: 33, scope: !1402)
!1443 = !DILocation(line: 618, column: 10, scope: !1402)
!1444 = !DILocation(line: 619, column: 9, scope: !1402)
!1445 = !DILocation(line: 620, column: 44, scope: !1402)
!1446 = !DILocation(line: 620, column: 23, scope: !1402)
!1447 = !DILocation(line: 620, column: 13, scope: !1402)
!1448 = !DILocation(line: 620, column: 12, scope: !1402)
!1449 = !DILocation(line: 621, column: 7, scope: !1450)
!1450 = distinct !DILexicalBlock(scope: !1402, file: !1, line: 621, column: 7)
!1451 = !DILocation(line: 621, column: 17, scope: !1450)
!1452 = !DILocation(line: 621, column: 7, scope: !1402)
!1453 = !DILocation(line: 622, column: 5, scope: !1450)
!1454 = !DILocation(line: 623, column: 30, scope: !1402)
!1455 = !DILocation(line: 623, column: 36, scope: !1402)
!1456 = !DILocation(line: 623, column: 3, scope: !1402)
!1457 = !DILocation(line: 624, column: 33, scope: !1402)
!1458 = !DILocation(line: 624, column: 39, scope: !1402)
!1459 = !DILocation(line: 624, column: 12, scope: !1402)
!1460 = !DILocation(line: 624, column: 11, scope: !1402)
!1461 = !DILocation(line: 625, column: 9, scope: !1462)
!1462 = distinct !DILexicalBlock(scope: !1402, file: !1, line: 625, column: 3)
!1463 = !DILocation(line: 625, column: 8, scope: !1462)
!1464 = !DILocation(line: 625, column: 13, scope: !1465)
!1465 = distinct !DILexicalBlock(scope: !1462, file: !1, line: 625, column: 3)
!1466 = !DILocation(line: 625, column: 22, scope: !1465)
!1467 = !DILocation(line: 625, column: 3, scope: !1462)
!1468 = !DILocation(line: 627, column: 11, scope: !1469)
!1469 = distinct !DILexicalBlock(scope: !1470, file: !1, line: 627, column: 9)
!1470 = distinct !DILexicalBlock(scope: !1465, file: !1, line: 626, column: 3)
!1471 = !DILocation(line: 627, column: 10, scope: !1469)
!1472 = !DILocation(line: 627, column: 20, scope: !1469)
!1473 = !DILocation(line: 627, column: 28, scope: !1469)
!1474 = !DILocation(line: 628, column: 25, scope: !1469)
!1475 = !DILocation(line: 628, column: 34, scope: !1469)
!1476 = !DILocation(line: 628, column: 10, scope: !1469)
!1477 = !DILocation(line: 628, column: 55, scope: !1469)
!1478 = !DILocation(line: 627, column: 9, scope: !1470)
!1479 = !DILocation(line: 630, column: 14, scope: !1480)
!1480 = distinct !DILexicalBlock(scope: !1481, file: !1, line: 630, column: 13)
!1481 = distinct !DILexicalBlock(scope: !1469, file: !1, line: 629, column: 7)
!1482 = !DILocation(line: 630, column: 15, scope: !1480)
!1483 = !DILocation(line: 630, column: 32, scope: !1480)
!1484 = !DILocation(line: 630, column: 19, scope: !1480)
!1485 = !DILocation(line: 630, column: 13, scope: !1481)
!1486 = !DILocation(line: 632, column: 19, scope: !1487)
!1487 = distinct !DILexicalBlock(scope: !1480, file: !1, line: 631, column: 11)
!1488 = !DILocation(line: 633, column: 53, scope: !1487)
!1489 = !DILocation(line: 633, column: 63, scope: !1487)
!1490 = !DILocation(line: 633, column: 33, scope: !1487)
!1491 = !DILocation(line: 633, column: 23, scope: !1487)
!1492 = !DILocation(line: 633, column: 22, scope: !1487)
!1493 = !DILocation(line: 635, column: 17, scope: !1494)
!1494 = distinct !DILexicalBlock(scope: !1487, file: !1, line: 635, column: 17)
!1495 = !DILocation(line: 635, column: 27, scope: !1494)
!1496 = !DILocation(line: 635, column: 17, scope: !1487)
!1497 = !DILocation(line: 637, column: 45, scope: !1498)
!1498 = distinct !DILexicalBlock(scope: !1494, file: !1, line: 636, column: 15)
!1499 = !DILocation(line: 637, column: 51, scope: !1498)
!1500 = !DILocation(line: 639, column: 19, scope: !1498)
!1501 = !DILocation(line: 639, column: 25, scope: !1498)
!1502 = !DILocation(line: 637, column: 24, scope: !1498)
!1503 = !DILocation(line: 640, column: 17, scope: !1498)
!1504 = !DILocation(line: 642, column: 11, scope: !1487)
!1505 = !DILocation(line: 643, column: 37, scope: !1481)
!1506 = !DILocation(line: 643, column: 22, scope: !1481)
!1507 = !DILocation(line: 643, column: 9, scope: !1481)
!1508 = !DILocation(line: 643, column: 19, scope: !1481)
!1509 = !DILocation(line: 643, column: 21, scope: !1481)
!1510 = !DILocation(line: 644, column: 10, scope: !1481)
!1511 = !DILocation(line: 645, column: 7, scope: !1481)
!1512 = !DILocation(line: 646, column: 35, scope: !1470)
!1513 = !DILocation(line: 646, column: 41, scope: !1470)
!1514 = !DILocation(line: 646, column: 14, scope: !1470)
!1515 = !DILocation(line: 646, column: 13, scope: !1470)
!1516 = !DILocation(line: 625, column: 3, scope: !1465)
!1517 = distinct !{!1517, !1467, !1518}
!1518 = !DILocation(line: 647, column: 3, scope: !1462)
!1519 = !DILocation(line: 648, column: 3, scope: !1402)
!1520 = !DILocation(line: 648, column: 13, scope: !1402)
!1521 = !DILocation(line: 648, column: 15, scope: !1402)
!1522 = !DILocation(line: 649, column: 30, scope: !1402)
!1523 = !DILocation(line: 649, column: 4, scope: !1402)
!1524 = !DILocation(line: 649, column: 20, scope: !1402)
!1525 = !DILocation(line: 650, column: 10, scope: !1402)
!1526 = !DILocation(line: 650, column: 3, scope: !1402)
!1527 = !DILocation(line: 651, column: 1, scope: !1402)
!1528 = distinct !DISubprogram(name: "MagickGetImageProfile", scope: !1, file: !1, line: 680, type: !1529, scopeLine: 682, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !1065)
!1529 = !DISubroutineType(types: !1530)
!1530 = !{!803, !1037, !748, !1405}
!1531 = !DILocalVariable(name: "wand", arg: 1, scope: !1528, file: !1, line: 680, type: !1037)
!1532 = !DILocation(line: 680, column: 61, scope: !1528)
!1533 = !DILocalVariable(name: "name", arg: 2, scope: !1528, file: !1, line: 681, type: !748)
!1534 = !DILocation(line: 681, column: 15, scope: !1528)
!1535 = !DILocalVariable(name: "length", arg: 3, scope: !1528, file: !1, line: 681, type: !1405)
!1536 = !DILocation(line: 681, column: 28, scope: !1528)
!1537 = !DILocalVariable(name: "profile", scope: !1528, file: !1, line: 684, type: !1538)
!1538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1539, size: 64)
!1539 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !841)
!1540 = !DILocation(line: 684, column: 6, scope: !1528)
!1541 = !DILocalVariable(name: "datum", scope: !1528, file: !1, line: 687, type: !803)
!1542 = !DILocation(line: 687, column: 6, scope: !1528)
!1543 = !DILocation(line: 691, column: 7, scope: !1544)
!1544 = distinct !DILexicalBlock(scope: !1528, file: !1, line: 691, column: 7)
!1545 = !DILocation(line: 691, column: 13, scope: !1544)
!1546 = !DILocation(line: 691, column: 19, scope: !1544)
!1547 = !DILocation(line: 691, column: 7, scope: !1528)
!1548 = !DILocation(line: 692, column: 60, scope: !1544)
!1549 = !DILocation(line: 692, column: 66, scope: !1544)
!1550 = !DILocation(line: 692, column: 12, scope: !1544)
!1551 = !DILocation(line: 692, column: 5, scope: !1544)
!1552 = !DILocation(line: 693, column: 7, scope: !1553)
!1553 = distinct !DILexicalBlock(scope: !1528, file: !1, line: 693, column: 7)
!1554 = !DILocation(line: 693, column: 13, scope: !1553)
!1555 = !DILocation(line: 693, column: 20, scope: !1553)
!1556 = !DILocation(line: 693, column: 7, scope: !1528)
!1557 = !DILocation(line: 695, column: 35, scope: !1558)
!1558 = distinct !DILexicalBlock(scope: !1553, file: !1, line: 694, column: 5)
!1559 = !DILocation(line: 695, column: 41, scope: !1558)
!1560 = !DILocation(line: 696, column: 35, scope: !1558)
!1561 = !DILocation(line: 696, column: 41, scope: !1558)
!1562 = !DILocation(line: 695, column: 14, scope: !1558)
!1563 = !DILocation(line: 697, column: 7, scope: !1558)
!1564 = !DILocation(line: 699, column: 4, scope: !1528)
!1565 = !DILocation(line: 699, column: 10, scope: !1528)
!1566 = !DILocation(line: 700, column: 7, scope: !1567)
!1567 = distinct !DILexicalBlock(scope: !1528, file: !1, line: 700, column: 7)
!1568 = !DILocation(line: 700, column: 13, scope: !1567)
!1569 = !DILocation(line: 700, column: 21, scope: !1567)
!1570 = !DILocation(line: 700, column: 30, scope: !1567)
!1571 = !DILocation(line: 700, column: 7, scope: !1528)
!1572 = !DILocation(line: 701, column: 5, scope: !1567)
!1573 = !DILocation(line: 702, column: 27, scope: !1528)
!1574 = !DILocation(line: 702, column: 33, scope: !1528)
!1575 = !DILocation(line: 702, column: 40, scope: !1528)
!1576 = !DILocation(line: 702, column: 11, scope: !1528)
!1577 = !DILocation(line: 702, column: 10, scope: !1528)
!1578 = !DILocation(line: 703, column: 7, scope: !1579)
!1579 = distinct !DILexicalBlock(scope: !1528, file: !1, line: 703, column: 7)
!1580 = !DILocation(line: 703, column: 15, scope: !1579)
!1581 = !DILocation(line: 703, column: 7, scope: !1528)
!1582 = !DILocation(line: 704, column: 5, scope: !1579)
!1583 = !DILocation(line: 705, column: 68, scope: !1528)
!1584 = !DILocation(line: 705, column: 48, scope: !1528)
!1585 = !DILocation(line: 705, column: 27, scope: !1528)
!1586 = !DILocation(line: 705, column: 8, scope: !1528)
!1587 = !DILocation(line: 707, column: 7, scope: !1588)
!1588 = distinct !DILexicalBlock(scope: !1528, file: !1, line: 707, column: 7)
!1589 = !DILocation(line: 707, column: 13, scope: !1588)
!1590 = !DILocation(line: 707, column: 7, scope: !1528)
!1591 = !DILocation(line: 708, column: 5, scope: !1588)
!1592 = !DILocation(line: 709, column: 27, scope: !1528)
!1593 = !DILocation(line: 709, column: 52, scope: !1528)
!1594 = !DILocation(line: 709, column: 33, scope: !1528)
!1595 = !DILocation(line: 710, column: 25, scope: !1528)
!1596 = !DILocation(line: 710, column: 5, scope: !1528)
!1597 = !DILocation(line: 709, column: 10, scope: !1528)
!1598 = !DILocation(line: 711, column: 40, scope: !1528)
!1599 = !DILocation(line: 711, column: 20, scope: !1528)
!1600 = !DILocation(line: 711, column: 4, scope: !1528)
!1601 = !DILocation(line: 711, column: 10, scope: !1528)
!1602 = !DILocation(line: 712, column: 10, scope: !1528)
!1603 = !DILocation(line: 712, column: 3, scope: !1528)
!1604 = !DILocation(line: 713, column: 1, scope: !1528)
!1605 = distinct !DISubprogram(name: "MagickGetImageProfiles", scope: !1, file: !1, line: 745, type: !1403, scopeLine: 747, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !1065)
!1606 = !DILocalVariable(name: "wand", arg: 1, scope: !1605, file: !1, line: 745, type: !1037)
!1607 = !DILocation(line: 745, column: 54, scope: !1605)
!1608 = !DILocalVariable(name: "pattern", arg: 2, scope: !1605, file: !1, line: 745, type: !748)
!1609 = !DILocation(line: 745, column: 71, scope: !1605)
!1610 = !DILocalVariable(name: "number_profiles", arg: 3, scope: !1605, file: !1, line: 746, type: !1405)
!1611 = !DILocation(line: 746, column: 11, scope: !1605)
!1612 = !DILocalVariable(name: "profiles", scope: !1605, file: !1, line: 749, type: !835)
!1613 = !DILocation(line: 749, column: 7, scope: !1605)
!1614 = !DILocalVariable(name: "property", scope: !1605, file: !1, line: 752, type: !748)
!1615 = !DILocation(line: 752, column: 6, scope: !1605)
!1616 = !DILocalVariable(name: "i", scope: !1605, file: !1, line: 755, type: !679)
!1617 = !DILocation(line: 755, column: 5, scope: !1605)
!1618 = !DILocalVariable(name: "length", scope: !1605, file: !1, line: 758, type: !626)
!1619 = !DILocation(line: 758, column: 5, scope: !1605)
!1620 = !DILocation(line: 762, column: 7, scope: !1621)
!1621 = distinct !DILexicalBlock(scope: !1605, file: !1, line: 762, column: 7)
!1622 = !DILocation(line: 762, column: 13, scope: !1621)
!1623 = !DILocation(line: 762, column: 19, scope: !1621)
!1624 = !DILocation(line: 762, column: 7, scope: !1605)
!1625 = !DILocation(line: 763, column: 60, scope: !1621)
!1626 = !DILocation(line: 763, column: 66, scope: !1621)
!1627 = !DILocation(line: 763, column: 12, scope: !1621)
!1628 = !DILocation(line: 763, column: 5, scope: !1621)
!1629 = !DILocation(line: 764, column: 7, scope: !1630)
!1630 = distinct !DILexicalBlock(scope: !1605, file: !1, line: 764, column: 7)
!1631 = !DILocation(line: 764, column: 13, scope: !1630)
!1632 = !DILocation(line: 764, column: 20, scope: !1630)
!1633 = !DILocation(line: 764, column: 7, scope: !1605)
!1634 = !DILocation(line: 766, column: 35, scope: !1635)
!1635 = distinct !DILexicalBlock(scope: !1630, file: !1, line: 765, column: 5)
!1636 = !DILocation(line: 766, column: 41, scope: !1635)
!1637 = !DILocation(line: 767, column: 35, scope: !1635)
!1638 = !DILocation(line: 767, column: 41, scope: !1635)
!1639 = !DILocation(line: 766, column: 14, scope: !1635)
!1640 = !DILocation(line: 768, column: 7, scope: !1635)
!1641 = !DILocation(line: 770, column: 26, scope: !1605)
!1642 = !DILocation(line: 770, column: 32, scope: !1605)
!1643 = !DILocation(line: 770, column: 10, scope: !1605)
!1644 = !DILocation(line: 771, column: 9, scope: !1605)
!1645 = !DILocation(line: 772, column: 43, scope: !1605)
!1646 = !DILocation(line: 772, column: 22, scope: !1605)
!1647 = !DILocation(line: 772, column: 12, scope: !1605)
!1648 = !DILocation(line: 772, column: 11, scope: !1605)
!1649 = !DILocation(line: 773, column: 7, scope: !1650)
!1650 = distinct !DILexicalBlock(scope: !1605, file: !1, line: 773, column: 7)
!1651 = !DILocation(line: 773, column: 16, scope: !1650)
!1652 = !DILocation(line: 773, column: 7, scope: !1605)
!1653 = !DILocation(line: 774, column: 5, scope: !1650)
!1654 = !DILocation(line: 775, column: 29, scope: !1605)
!1655 = !DILocation(line: 775, column: 35, scope: !1605)
!1656 = !DILocation(line: 775, column: 3, scope: !1605)
!1657 = !DILocation(line: 776, column: 32, scope: !1605)
!1658 = !DILocation(line: 776, column: 38, scope: !1605)
!1659 = !DILocation(line: 776, column: 12, scope: !1605)
!1660 = !DILocation(line: 776, column: 11, scope: !1605)
!1661 = !DILocation(line: 777, column: 9, scope: !1662)
!1662 = distinct !DILexicalBlock(scope: !1605, file: !1, line: 777, column: 3)
!1663 = !DILocation(line: 777, column: 8, scope: !1662)
!1664 = !DILocation(line: 777, column: 13, scope: !1665)
!1665 = distinct !DILexicalBlock(scope: !1662, file: !1, line: 777, column: 3)
!1666 = !DILocation(line: 777, column: 22, scope: !1665)
!1667 = !DILocation(line: 777, column: 3, scope: !1662)
!1668 = !DILocation(line: 779, column: 11, scope: !1669)
!1669 = distinct !DILexicalBlock(scope: !1670, file: !1, line: 779, column: 9)
!1670 = distinct !DILexicalBlock(scope: !1665, file: !1, line: 778, column: 3)
!1671 = !DILocation(line: 779, column: 10, scope: !1669)
!1672 = !DILocation(line: 779, column: 20, scope: !1669)
!1673 = !DILocation(line: 779, column: 28, scope: !1669)
!1674 = !DILocation(line: 780, column: 25, scope: !1669)
!1675 = !DILocation(line: 780, column: 34, scope: !1669)
!1676 = !DILocation(line: 780, column: 10, scope: !1669)
!1677 = !DILocation(line: 780, column: 55, scope: !1669)
!1678 = !DILocation(line: 779, column: 9, scope: !1670)
!1679 = !DILocation(line: 782, column: 14, scope: !1680)
!1680 = distinct !DILexicalBlock(scope: !1681, file: !1, line: 782, column: 13)
!1681 = distinct !DILexicalBlock(scope: !1669, file: !1, line: 781, column: 7)
!1682 = !DILocation(line: 782, column: 15, scope: !1680)
!1683 = !DILocation(line: 782, column: 32, scope: !1680)
!1684 = !DILocation(line: 782, column: 19, scope: !1680)
!1685 = !DILocation(line: 782, column: 13, scope: !1681)
!1686 = !DILocation(line: 784, column: 19, scope: !1687)
!1687 = distinct !DILexicalBlock(scope: !1680, file: !1, line: 783, column: 11)
!1688 = !DILocation(line: 785, column: 52, scope: !1687)
!1689 = !DILocation(line: 785, column: 61, scope: !1687)
!1690 = !DILocation(line: 785, column: 32, scope: !1687)
!1691 = !DILocation(line: 785, column: 22, scope: !1687)
!1692 = !DILocation(line: 785, column: 21, scope: !1687)
!1693 = !DILocation(line: 787, column: 17, scope: !1694)
!1694 = distinct !DILexicalBlock(scope: !1687, file: !1, line: 787, column: 17)
!1695 = !DILocation(line: 787, column: 26, scope: !1694)
