; ModuleID = 'magick/resource.c'
source_filename = "magick/resource.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.SemaphoreInfo = type opaque
%struct._ResourceInfo = type { i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64 }
%struct._SplayTreeInfo = type opaque
%struct._RandomInfo = type opaque
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct._ExceptionInfo = type { i32, i32, i8*, i8*, i8*, i32, %struct.SemaphoreInfo*, i64 }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct._StringInfo = type { [4096 x i8], i8*, i64, i64 }

@resource_semaphore = internal global %struct.SemaphoreInfo* null, align 8, !dbg !0
@resource_info = internal global %struct._ResourceInfo { i64 0, i64 0, i64 0, i64 0, i64 0, i64 0, i64 0, i64 0, i64 -1, i64 -1, i64 -1, i64 -1, i64 -1, i64 -1, i64 -1, i64 -1 }, align 8, !dbg !305
@.str = private unnamed_addr constant [18 x i8] c"magick/resource.c\00", align 1

!179 = !DIEnumerator(name: "MissingDelegateFatalError", value: 720, isUnsigned: true)
!180 = !DIEnumerator(name: "CorruptImageFatalError", value: 725, isUnsigned: true)
!181 = !DIEnumerator(name: "FileOpenFatalError", value: 730, isUnsigned: true)
!182 = !DIEnumerator(name: "BlobFatalError", value: 735, isUnsigned: true)
!183 = !DIEnumerator(name: "StreamFatalError", value: 740, isUnsigned: true)
!184 = !DIEnumerator(name: "CacheFatalError", value: 745, isUnsigned: true)
!185 = !DIEnumerator(name: "CoderFatalError", value: 750, isUnsigned: true)
!186 = !DIEnumerator(name: "FilterFatalError", value: 752, isUnsigned: true)
!187 = !DIEnumerator(name: "ModuleFatalError", value: 755, isUnsigned: true)
!188 = !DIEnumerator(name: "DrawFatalError", value: 760, isUnsigned: true)
!189 = !DIEnumerator(name: "ImageFatalError", value: 765, isUnsigned: true)
!190 = !DIEnumerator(name: "WandFatalError", value: 770, isUnsigned: true)
!191 = !DIEnumerator(name: "RandomFatalError", value: 775, isUnsigned: true)
!192 = !DIEnumerator(name: "XServerFatalError", value: 780, isUnsigned: true)
!193 = !DIEnumerator(name: "MonitorFatalError", value: 785, isUnsigned: true)
!194 = !DIEnumerator(name: "RegistryFatalError", value: 790, isUnsigned: true)
!195 = !DIEnumerator(name: "ConfigureFatalError", value: 795, isUnsigned: true)
!196 = !DIEnumerator(name: "PolicyFatalError", value: 799, isUnsigned: true)
!197 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !198, line: 25, baseType: !7, size: 32, elements: !199)
!198 = !DIFile(filename: "./magick/registry.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!199 = !{!200, !201, !202, !203}
!200 = !DIEnumerator(name: "UndefinedRegistryType", value: 0, isUnsigned: true)
!201 = !DIEnumerator(name: "ImageRegistryType", value: 1, isUnsigned: true)
!202 = !DIEnumerator(name: "ImageInfoRegistryType", value: 2, isUnsigned: true)
!203 = !DIEnumerator(name: "StringRegistryType", value: 3, isUnsigned: true)
!204 = !{!205, !209, !210, !212, !214, !215, !220, !224, !227, !228, !229, !50, !233, !236, !238}
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "SemaphoreInfo", file: !207, line: 26, baseType: !208)
!207 = !DIFile(filename: "./magick/semaphore.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!208 = !DICompositeType(tag: DW_TAG_structure_type, name: "SemaphoreInfo", file: !207, line: 25, flags: DIFlagFwdDecl)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickOffsetType", file: !6, line: 150, baseType: !211)
!211 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickSizeType", file: !6, line: 151, baseType: !213)
!213 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!214 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !216, line: 77, baseType: !217)
!216 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !218, line: 193, baseType: !219)
!218 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!219 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "SplayTreeInfo", file: !222, line: 26, baseType: !223)
!222 = !DIFile(filename: "./magick/splay-tree.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!223 = !DICompositeType(tag: DW_TAG_structure_type, name: "_SplayTreeInfo", file: !222, line: 25, flags: DIFlagFwdDecl)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!225 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !226)
!226 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!227 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "RandomInfo", file: !231, line: 31, baseType: !232)
!231 = !DIFile(filename: "./magick/random_.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!232 = !DICompositeType(tag: DW_TAG_structure_type, name: "_RandomInfo", file: !231, line: 30, flags: DIFlagFwdDecl)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!234 = !DISubroutineType(types: !235)
!235 = !{!209, !209}
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!237 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !240)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !241, line: 7, baseType: !242)
!241 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!242 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !243, line: 49, size: 1728, elements: !244)
!243 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!244 = !{!245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !260, !262, !263, !264, !266, !268, !270, !274, !277, !279, !282, !285, !286, !287, !290, !291}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !242, file: !243, line: 51, baseType: !50, size: 32)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !242, file: !243, line: 54, baseType: !228, size: 64, offset: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !242, file: !243, line: 55, baseType: !228, size: 64, offset: 128)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !242, file: !243, line: 56, baseType: !228, size: 64, offset: 192)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !242, file: !243, line: 57, baseType: !228, size: 64, offset: 256)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !242, file: !243, line: 58, baseType: !228, size: 64, offset: 320)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !242, file: !243, line: 59, baseType: !228, size: 64, offset: 384)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !242, file: !243, line: 60, baseType: !228, size: 64, offset: 448)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !242, file: !243, line: 61, baseType: !228, size: 64, offset: 512)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !242, file: !243, line: 64, baseType: !228, size: 64, offset: 576)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !242, file: !243, line: 65, baseType: !228, size: 64, offset: 640)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !242, file: !243, line: 66, baseType: !228, size: 64, offset: 704)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !242, file: !243, line: 68, baseType: !258, size: 64, offset: 768)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!259 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !243, line: 36, flags: DIFlagFwdDecl)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !242, file: !243, line: 70, baseType: !261, size: 64, offset: 832)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !242, file: !243, line: 72, baseType: !50, size: 32, offset: 896)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !242, file: !243, line: 73, baseType: !50, size: 32, offset: 928)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !242, file: !243, line: 74, baseType: !265, size: 64, offset: 960)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !218, line: 152, baseType: !219)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !242, file: !243, line: 77, baseType: !267, size: 16, offset: 1024)
!267 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !242, file: !243, line: 78, baseType: !269, size: 8, offset: 1040)
!269 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !242, file: !243, line: 79, baseType: !271, size: 8, offset: 1048)
!271 = !DICompositeType(tag: DW_TAG_array_type, baseType: !226, size: 8, elements: !272)
!272 = !{!273}
!273 = !DISubrange(count: 1)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !242, file: !243, line: 81, baseType: !275, size: 64, offset: 1088)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !243, line: 43, baseType: null)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !242, file: !243, line: 89, baseType: !278, size: 64, offset: 1152)
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !218, line: 153, baseType: !219)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !242, file: !243, line: 91, baseType: !280, size: 64, offset: 1216)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64)
!281 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !243, line: 37, flags: DIFlagFwdDecl)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !242, file: !243, line: 92, baseType: !283, size: 64, offset: 1280)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64)
!284 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !243, line: 38, flags: DIFlagFwdDecl)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !242, file: !243, line: 93, baseType: !261, size: 64, offset: 1344)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !242, file: !243, line: 94, baseType: !209, size: 64, offset: 1408)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !242, file: !243, line: 95, baseType: !288, size: 64, offset: 1472)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !289, line: 46, baseType: !214)
!289 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!290 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !242, file: !243, line: 96, baseType: !50, size: 32, offset: 1536)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !242, file: !243, line: 98, baseType: !292, size: 160, offset: 1568)
!292 = !DICompositeType(tag: DW_TAG_array_type, baseType: !226, size: 160, elements: !293)
!293 = !{!294}
!294 = !DISubrange(count: 20)
!295 = !{!296, !0, !305, !326, !328}
!296 = !DIGlobalVariableExpression(var: !297, expr: !DIExpression())
!297 = distinct !DIGlobalVariable(name: "portable_filename", scope: !298, file: !3, line: 469, type: !302, isLocal: true, isDefinition: true)
!298 = distinct !DISubprogram(name: "AcquireUniqueFileResource", scope: !3, file: !3, line: 449, type: !299, scopeLine: 450, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !301)
!299 = !DISubroutineType(types: !300)
!300 = !{!50, !228}
!301 = !{}
!302 = !DICompositeType(tag: DW_TAG_array_type, baseType: !225, size: 520, elements: !303)
!303 = !{!304}
!304 = !DISubrange(count: 65)
!305 = !DIGlobalVariableExpression(var: !306, expr: !DIExpression())
!306 = distinct !DIGlobalVariable(name: "resource_info", scope: !2, file: !3, line: 100, type: !307, isLocal: true, isDefinition: true)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "ResourceInfo", file: !3, line: 91, baseType: !308)
!308 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ResourceInfo", file: !3, line: 70, size: 1024, elements: !309)
!309 = !{!310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "area", scope: !308, file: !3, line: 73, baseType: !210, size: 64)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !308, file: !3, line: 74, baseType: !210, size: 64, offset: 64)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !308, file: !3, line: 75, baseType: !210, size: 64, offset: 128)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "disk", scope: !308, file: !3, line: 76, baseType: !210, size: 64, offset: 192)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !308, file: !3, line: 77, baseType: !210, size: 64, offset: 256)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !308, file: !3, line: 78, baseType: !210, size: 64, offset: 320)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "throttle", scope: !308, file: !3, line: 79, baseType: !210, size: 64, offset: 384)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !308, file: !3, line: 80, baseType: !210, size: 64, offset: 448)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "area_limit", scope: !308, file: !3, line: 83, baseType: !212, size: 64, offset: 512)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "memory_limit", scope: !308, file: !3, line: 84, baseType: !212, size: 64, offset: 576)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "map_limit", scope: !308, file: !3, line: 85, baseType: !212, size: 64, offset: 640)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "disk_limit", scope: !308, file: !3, line: 86, baseType: !212, size: 64, offset: 704)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "file_limit", scope: !308, file: !3, line: 87, baseType: !212, size: 64, offset: 768)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "thread_limit", scope: !308, file: !3, line: 88, baseType: !212, size: 64, offset: 832)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "throttle_limit", scope: !308, file: !3, line: 89, baseType: !212, size: 64, offset: 896)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "time_limit", scope: !308, file: !3, line: 90, baseType: !212, size: 64, offset: 960)
!326 = !DIGlobalVariableExpression(var: !327, expr: !DIExpression())
!327 = distinct !DIGlobalVariable(name: "temporary_resources", scope: !2, file: !3, line: 135, type: !220, isLocal: true, isDefinition: true)
!328 = !DIGlobalVariableExpression(var: !329, expr: !DIExpression())
!329 = distinct !DIGlobalVariable(name: "random_info", scope: !2, file: !3, line: 97, type: !229, isLocal: true, isDefinition: true)
!330 = !{i32 7, !"Dwarf Version", i32 4}
!331 = !{i32 2, !"Debug Info Version", i32 3}
!332 = !{i32 1, !"wchar_size", i32 4}
!333 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!334 = distinct !DISubprogram(name: "AcquireMagickResource", scope: !3, file: !3, line: 164, type: !335, scopeLine: 166, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !301)
!335 = !DISubroutineType(types: !336)
!336 = !{!337, !338, !340}
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickBooleanType", file: !6, line: 215, baseType: !5)
!338 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !339)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "ResourceType", file: !12, line: 36, baseType: !11)
!340 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !212)
!341 = !DILocalVariable(name: "type", arg: 1, scope: !334, file: !3, line: 164, type: !338)
!342 = !DILocation(line: 164, column: 73, scope: !334)
!343 = !DILocalVariable(name: "size", arg: 2, scope: !334, file: !3, line: 165, type: !340)
!344 = !DILocation(line: 165, column: 24, scope: !334)
!345 = !DILocalVariable(name: "resource_current", scope: !334, file: !3, line: 168, type: !346)
!346 = !DICompositeType(tag: DW_TAG_array_type, baseType: !226, size: 32768, elements: !347)
!347 = !{!348}
!348 = !DISubrange(count: 4096)
!349 = !DILocation(line: 168, column: 5, scope: !334)
!350 = !DILocalVariable(name: "resource_limit", scope: !334, file: !3, line: 169, type: !346)
!351 = !DILocation(line: 169, column: 5, scope: !334)
!352 = !DILocalVariable(name: "resource_request", scope: !334, file: !3, line: 170, type: !346)
!353 = !DILocation(line: 170, column: 5, scope: !334)
!354 = !DILocalVariable(name: "status", scope: !334, file: !3, line: 173, type: !337)
!355 = !DILocation(line: 173, column: 5, scope: !334)
!356 = !DILocalVariable(name: "limit", scope: !334, file: !3, line: 176, type: !212)
!357 = !DILocation(line: 176, column: 5, scope: !334)
!358 = !DILocation(line: 178, column: 9, scope: !334)
!359 = !DILocation(line: 179, column: 27, scope: !334)
!360 = !DILocation(line: 179, column: 44, scope: !334)
!361 = !DILocation(line: 179, column: 10, scope: !334)
!362 = !DILocation(line: 180, column: 7, scope: !363)
!363 = distinct !DILexicalBlock(scope: !334, file: !3, line: 180, column: 7)
!364 = !DILocation(line: 180, column: 26, scope: !363)
!365 = !DILocation(line: 180, column: 7, scope: !334)
!366 = !DILocation(line: 181, column: 5, scope: !363)
!367 = !DILocation(line: 182, column: 21, scope: !334)
!368 = !DILocation(line: 182, column: 3, scope: !334)
!369 = !DILocation(line: 183, column: 11, scope: !334)
!370 = !DILocation(line: 183, column: 3, scope: !334)
!371 = !DILocation(line: 187, column: 45, scope: !372)
!372 = distinct !DILexicalBlock(scope: !373, file: !3, line: 186, column: 5)
!373 = distinct !DILexicalBlock(scope: !334, file: !3, line: 184, column: 3)
!374 = !DILocation(line: 187, column: 25, scope: !372)
!375 = !DILocation(line: 188, column: 27, scope: !372)
!376 = !DILocation(line: 188, column: 12, scope: !372)
!377 = !DILocation(line: 189, column: 29, scope: !372)
!378 = !DILocation(line: 189, column: 40, scope: !372)
!379 = !DILocation(line: 189, column: 67, scope: !372)
!380 = !DILocation(line: 190, column: 10, scope: !372)
!381 = !DILocation(line: 190, column: 17, scope: !372)
!382 = !DILocation(line: 190, column: 15, scope: !372)
!383 = !DILocation(line: 189, column: 14, scope: !372)
!384 = !DILocation(line: 189, column: 13, scope: !372)
!385 = !DILocation(line: 191, column: 62, scope: !372)
!386 = !DILocation(line: 192, column: 9, scope: !372)
!387 = !DILocation(line: 191, column: 14, scope: !372)
!388 = !DILocation(line: 193, column: 45, scope: !372)
!389 = !DILocation(line: 194, column: 9, scope: !372)
!390 = !DILocation(line: 193, column: 14, scope: !372)
!391 = !DILocation(line: 195, column: 7, scope: !372)
!392 = !DILocation(line: 199, column: 29, scope: !393)
!393 = distinct !DILexicalBlock(scope: !373, file: !3, line: 198, column: 5)
!394 = !DILocation(line: 199, column: 27, scope: !393)
!395 = !DILocation(line: 200, column: 27, scope: !393)
!396 = !DILocation(line: 200, column: 12, scope: !393)
!397 = !DILocation(line: 201, column: 29, scope: !393)
!398 = !DILocation(line: 201, column: 42, scope: !393)
!399 = !DILocation(line: 201, column: 69, scope: !393)
!400 = !DILocation(line: 202, column: 41, scope: !393)
!401 = !DILocation(line: 202, column: 50, scope: !393)
!402 = !DILocation(line: 202, column: 48, scope: !393)
!403 = !DILocation(line: 201, column: 14, scope: !393)
!404 = !DILocation(line: 201, column: 13, scope: !393)
!405 = !DILocation(line: 204, column: 62, scope: !393)
!406 = !DILocation(line: 205, column: 9, scope: !393)
!407 = !DILocation(line: 204, column: 14, scope: !393)
!408 = !DILocation(line: 206, column: 45, scope: !393)
!409 = !DILocation(line: 207, column: 9, scope: !393)
!410 = !DILocation(line: 206, column: 14, scope: !393)
!411 = !DILocation(line: 208, column: 7, scope: !393)
!412 = !DILocation(line: 212, column: 26, scope: !413)
!413 = distinct !DILexicalBlock(scope: !373, file: !3, line: 211, column: 5)
!414 = !DILocation(line: 212, column: 24, scope: !413)
!415 = !DILocation(line: 213, column: 27, scope: !413)
!416 = !DILocation(line: 213, column: 12, scope: !413)
!417 = !DILocation(line: 214, column: 29, scope: !413)
!418 = !DILocation(line: 214, column: 39, scope: !413)
!419 = !DILocation(line: 214, column: 66, scope: !413)
!420 = !DILocation(line: 215, column: 41, scope: !413)
!421 = !DILocation(line: 215, column: 47, scope: !413)
!422 = !DILocation(line: 215, column: 45, scope: !413)
!423 = !DILocation(line: 214, column: 14, scope: !413)
!424 = !DILocation(line: 214, column: 13, scope: !413)
!425 = !DILocation(line: 217, column: 62, scope: !413)
!426 = !DILocation(line: 218, column: 9, scope: !413)
!427 = !DILocation(line: 217, column: 14, scope: !413)
!428 = !DILocation(line: 219, column: 45, scope: !413)
!429 = !DILocation(line: 220, column: 9, scope: !413)
!430 = !DILocation(line: 219, column: 14, scope: !413)
!431 = !DILocation(line: 221, column: 7, scope: !413)
!432 = !DILocation(line: 225, column: 27, scope: !433)
!433 = distinct !DILexicalBlock(scope: !373, file: !3, line: 224, column: 5)
!434 = !DILocation(line: 225, column: 25, scope: !433)
!435 = !DILocation(line: 226, column: 27, scope: !433)
!436 = !DILocation(line: 226, column: 12, scope: !433)
!437 = !DILocation(line: 227, column: 29, scope: !433)
!438 = !DILocation(line: 227, column: 40, scope: !433)
!439 = !DILocation(line: 227, column: 67, scope: !433)
!440 = !DILocation(line: 228, column: 41, scope: !433)
!441 = !DILocation(line: 228, column: 48, scope: !433)
!442 = !DILocation(line: 228, column: 46, scope: !433)
!443 = !DILocation(line: 227, column: 14, scope: !433)
!444 = !DILocation(line: 227, column: 13, scope: !433)
!445 = !DILocation(line: 230, column: 62, scope: !433)
!446 = !DILocation(line: 231, column: 9, scope: !433)
!447 = !DILocation(line: 230, column: 14, scope: !433)
!448 = !DILocation(line: 232, column: 45, scope: !433)
!449 = !DILocation(line: 233, column: 9, scope: !433)
!450 = !DILocation(line: 232, column: 14, scope: !433)
!451 = !DILocation(line: 234, column: 7, scope: !433)
!452 = !DILocation(line: 238, column: 27, scope: !453)
!453 = distinct !DILexicalBlock(scope: !373, file: !3, line: 237, column: 5)
!454 = !DILocation(line: 238, column: 25, scope: !453)
!455 = !DILocation(line: 239, column: 27, scope: !453)
!456 = !DILocation(line: 239, column: 12, scope: !453)
!457 = !DILocation(line: 240, column: 29, scope: !453)
!458 = !DILocation(line: 240, column: 40, scope: !453)
!459 = !DILocation(line: 240, column: 67, scope: !453)
!460 = !DILocation(line: 241, column: 41, scope: !453)
!461 = !DILocation(line: 241, column: 48, scope: !453)
!462 = !DILocation(line: 241, column: 46, scope: !453)
!463 = !DILocation(line: 240, column: 14, scope: !453)
!464 = !DILocation(line: 240, column: 13, scope: !453)
!465 = !DILocation(line: 243, column: 62, scope: !453)
!466 = !DILocation(line: 244, column: 9, scope: !453)
!467 = !DILocation(line: 243, column: 14, scope: !453)
!468 = !DILocation(line: 245, column: 62, scope: !453)
!469 = !DILocation(line: 246, column: 21, scope: !453)
!470 = !DILocation(line: 245, column: 14, scope: !453)
!471 = !DILocation(line: 247, column: 7, scope: !453)
!472 = !DILocation(line: 251, column: 27, scope: !473)
!473 = distinct !DILexicalBlock(scope: !373, file: !3, line: 250, column: 5)
!474 = !DILocation(line: 251, column: 12, scope: !473)
!475 = !DILocation(line: 252, column: 29, scope: !473)
!476 = !DILocation(line: 252, column: 42, scope: !473)
!477 = !DILocation(line: 252, column: 69, scope: !473)
!478 = !DILocation(line: 253, column: 41, scope: !473)
!479 = !DILocation(line: 253, column: 50, scope: !473)
!480 = !DILocation(line: 253, column: 48, scope: !473)
!481 = !DILocation(line: 252, column: 14, scope: !473)
!482 = !DILocation(line: 252, column: 13, scope: !473)
!483 = !DILocation(line: 255, column: 62, scope: !473)
!484 = !DILocation(line: 256, column: 9, scope: !473)
!485 = !DILocation(line: 255, column: 14, scope: !473)
!486 = !DILocation(line: 257, column: 62, scope: !473)
!487 = !DILocation(line: 258, column: 21, scope: !473)
!488 = !DILocation(line: 257, column: 14, scope: !473)
!489 = !DILocation(line: 259, column: 7, scope: !473)
!490 = !DILocation(line: 263, column: 27, scope: !491)
!491 = distinct !DILexicalBlock(scope: !373, file: !3, line: 262, column: 5)
!492 = !DILocation(line: 263, column: 12, scope: !491)
!493 = !DILocation(line: 264, column: 29, scope: !491)
!494 = !DILocation(line: 264, column: 44, scope: !491)
!495 = !DILocation(line: 264, column: 71, scope: !491)
!496 = !DILocation(line: 265, column: 41, scope: !491)
!497 = !DILocation(line: 265, column: 52, scope: !491)
!498 = !DILocation(line: 265, column: 50, scope: !491)
!499 = !DILocation(line: 264, column: 14, scope: !491)
!500 = !DILocation(line: 264, column: 13, scope: !491)
!501 = !DILocation(line: 267, column: 62, scope: !491)
!502 = !DILocation(line: 268, column: 21, scope: !491)
!503 = !DILocation(line: 267, column: 14, scope: !491)
!504 = !DILocation(line: 269, column: 62, scope: !491)
!505 = !DILocation(line: 270, column: 21, scope: !491)
!506 = !DILocation(line: 269, column: 14, scope: !491)
!507 = !DILocation(line: 271, column: 7, scope: !491)
!508 = !DILocation(line: 275, column: 27, scope: !509)
!509 = distinct !DILexicalBlock(scope: !373, file: !3, line: 274, column: 5)
!510 = !DILocation(line: 275, column: 25, scope: !509)
!511 = !DILocation(line: 276, column: 27, scope: !509)
!512 = !DILocation(line: 276, column: 12, scope: !509)
!513 = !DILocation(line: 277, column: 29, scope: !509)
!514 = !DILocation(line: 277, column: 40, scope: !509)
!515 = !DILocation(line: 277, column: 67, scope: !509)
!516 = !DILocation(line: 278, column: 41, scope: !509)
!517 = !DILocation(line: 278, column: 48, scope: !509)
!518 = !DILocation(line: 278, column: 46, scope: !509)
!519 = !DILocation(line: 277, column: 14, scope: !509)
!520 = !DILocation(line: 277, column: 13, scope: !509)
!521 = !DILocation(line: 280, column: 62, scope: !509)
!522 = !DILocation(line: 281, column: 9, scope: !509)
!523 = !DILocation(line: 280, column: 14, scope: !509)
!524 = !DILocation(line: 282, column: 62, scope: !509)
!525 = !DILocation(line: 283, column: 21, scope: !509)
!526 = !DILocation(line: 282, column: 14, scope: !509)
!527 = !DILocation(line: 284, column: 7, scope: !509)
!528 = !DILocation(line: 287, column: 7, scope: !373)
!529 = !DILocation(line: 289, column: 23, scope: !334)
!530 = !DILocation(line: 289, column: 3, scope: !334)
!531 = !DILocation(line: 291, column: 61, scope: !334)
!532 = !DILocation(line: 291, column: 51, scope: !334)
!533 = !DILocation(line: 291, column: 5, scope: !334)
!534 = !DILocation(line: 292, column: 5, scope: !334)
!535 = !DILocation(line: 292, column: 22, scope: !334)
!536 = !DILocation(line: 292, column: 39, scope: !334)
!537 = !DILocation(line: 290, column: 10, scope: !334)
!538 = !DILocation(line: 293, column: 10, scope: !334)
!539 = !DILocation(line: 293, column: 3, scope: !334)
!540 = distinct !DISubprogram(name: "AsynchronousResourceComponentTerminus", scope: !3, file: !3, line: 316, type: !541, scopeLine: 317, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !301)
!541 = !DISubroutineType(types: !542)
!542 = !{null}
!543 = !DILocalVariable(name: "path", scope: !540, file: !3, line: 319, type: !224)
!544 = !DILocation(line: 319, column: 6, scope: !540)
!545 = !DILocation(line: 321, column: 7, scope: !546)
!546 = distinct !DILexicalBlock(scope: !540, file: !3, line: 321, column: 7)
!547 = !DILocation(line: 321, column: 27, scope: !546)
!548 = !DILocation(line: 321, column: 7, scope: !540)
!549 = !DILocation(line: 322, column: 5, scope: !546)
!550 = !DILocation(line: 326, column: 26, scope: !540)
!551 = !DILocation(line: 326, column: 3, scope: !540)
!552 = !DILocation(line: 327, column: 45, scope: !540)
!553 = !DILocation(line: 327, column: 23, scope: !540)
!554 = !DILocation(line: 327, column: 7, scope: !540)
!555 = !DILocation(line: 328, column: 3, scope: !540)
!556 = !DILocation(line: 328, column: 10, scope: !540)
!557 = !DILocation(line: 328, column: 15, scope: !540)
!558 = !DILocation(line: 330, column: 22, scope: !559)
!559 = distinct !DILexicalBlock(scope: !540, file: !3, line: 329, column: 3)
!560 = !DILocation(line: 330, column: 12, scope: !559)
!561 = !DILocation(line: 331, column: 47, scope: !559)
!562 = !DILocation(line: 331, column: 25, scope: !559)
!563 = !DILocation(line: 331, column: 9, scope: !559)
!564 = distinct !{!564, !555, !565}
!565 = !DILocation(line: 332, column: 3, scope: !540)
!566 = !DILocation(line: 333, column: 1, scope: !540)
!567 = distinct !DISubprogram(name: "GetPathTemplate", scope: !3, file: !3, line: 367, type: !568, scopeLine: 368, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !301)
!568 = !DISubroutineType(types: !569)
!569 = !{!337, !228}
!570 = !DILocalVariable(name: "path", arg: 1, scope: !567, file: !3, line: 367, type: !228)
!571 = !DILocation(line: 367, column: 54, scope: !567)
!572 = !DILocalVariable(name: "directory", scope: !567, file: !3, line: 370, type: !228)
!573 = !DILocation(line: 370, column: 6, scope: !567)
!574 = !DILocalVariable(name: "value", scope: !567, file: !3, line: 371, type: !228)
!575 = !DILocation(line: 371, column: 6, scope: !567)
!576 = !DILocalVariable(name: "exception", scope: !567, file: !3, line: 374, type: !577)
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 64)
!578 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionInfo", file: !6, line: 219, baseType: !579)
!579 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ExceptionInfo", file: !125, line: 102, size: 448, elements: !580)
!580 = !{!581, !583, !584, !585, !586, !587, !588, !589}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "severity", scope: !579, file: !125, line: 105, baseType: !582, size: 32)
!582 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionType", file: !125, line: 100, baseType: !124)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "error_number", scope: !579, file: !125, line: 108, baseType: !50, size: 32, offset: 32)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !579, file: !125, line: 111, baseType: !228, size: 64, offset: 64)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !579, file: !125, line: 112, baseType: !228, size: 64, offset: 128)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "exceptions", scope: !579, file: !125, line: 115, baseType: !209, size: 64, offset: 192)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "relinquish", scope: !579, file: !125, line: 118, baseType: !337, size: 32, offset: 256)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !579, file: !125, line: 121, baseType: !205, size: 64, offset: 320)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !579, file: !125, line: 124, baseType: !288, size: 64, offset: 384)
!590 = !DILocation(line: 374, column: 6, scope: !567)
!591 = !DILocalVariable(name: "status", scope: !567, file: !3, line: 377, type: !337)
!592 = !DILocation(line: 377, column: 5, scope: !567)
!593 = !DILocalVariable(name: "attributes", scope: !567, file: !3, line: 380, type: !594)
!594 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !595, line: 46, size: 1152, elements: !596)
!595 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "")
!596 = !{!597, !599, !601, !603, !605, !607, !609, !610, !611, !612, !614, !616, !624, !625, !626}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !594, file: !595, line: 48, baseType: !598, size: 64)
!598 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !218, line: 145, baseType: !214)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !594, file: !595, line: 53, baseType: !600, size: 64, offset: 64)
!600 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !218, line: 148, baseType: !214)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !594, file: !595, line: 61, baseType: !602, size: 64, offset: 128)
!602 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !218, line: 151, baseType: !214)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !594, file: !595, line: 62, baseType: !604, size: 32, offset: 192)
!604 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !218, line: 150, baseType: !7)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !594, file: !595, line: 64, baseType: !606, size: 32, offset: 224)
!606 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !218, line: 146, baseType: !7)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !594, file: !595, line: 65, baseType: !608, size: 32, offset: 256)
!608 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !218, line: 147, baseType: !7)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !594, file: !595, line: 67, baseType: !50, size: 32, offset: 288)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !594, file: !595, line: 69, baseType: !598, size: 64, offset: 320)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !594, file: !595, line: 74, baseType: !265, size: 64, offset: 384)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !594, file: !595, line: 78, baseType: !613, size: 64, offset: 448)
!613 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !218, line: 174, baseType: !219)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !594, file: !595, line: 80, baseType: !615, size: 64, offset: 512)
!615 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !218, line: 179, baseType: !219)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !594, file: !595, line: 91, baseType: !617, size: 128, offset: 576)
!617 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !618, line: 10, size: 128, elements: !619)
!618 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "")
!619 = !{!620, !622}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !617, file: !618, line: 12, baseType: !621, size: 64)
!621 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !218, line: 160, baseType: !219)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !617, file: !618, line: 16, baseType: !623, size: 64, offset: 64)
!623 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !218, line: 196, baseType: !219)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !594, file: !595, line: 92, baseType: !617, size: 128, offset: 704)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !594, file: !595, line: 93, baseType: !617, size: 128, offset: 832)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !594, file: !595, line: 106, baseType: !627, size: 192, offset: 960)
!627 = !DICompositeType(tag: DW_TAG_array_type, baseType: !623, size: 192, elements: !628)
!628 = !{!629}
!629 = !DISubrange(count: 3)
!630 = !DILocation(line: 380, column: 5, scope: !567)
!631 = !DILocation(line: 382, column: 29, scope: !567)
!632 = !DILocation(line: 383, column: 14, scope: !567)
!633 = !DILocation(line: 383, column: 5, scope: !567)
!634 = !DILocation(line: 382, column: 10, scope: !567)
!635 = !DILocation(line: 384, column: 13, scope: !567)
!636 = !DILocation(line: 384, column: 12, scope: !567)
!637 = !DILocation(line: 386, column: 5, scope: !567)
!638 = !DILocation(line: 385, column: 22, scope: !567)
!639 = !DILocation(line: 385, column: 12, scope: !567)
!640 = !DILocation(line: 387, column: 34, scope: !567)
!641 = !DILocation(line: 387, column: 13, scope: !567)
!642 = !DILocation(line: 387, column: 12, scope: !567)
!643 = !DILocation(line: 388, column: 7, scope: !644)
!644 = distinct !DILexicalBlock(scope: !567, file: !3, line: 388, column: 7)
!645 = !DILocation(line: 388, column: 17, scope: !644)
!646 = !DILocation(line: 388, column: 7, scope: !567)
!647 = !DILocation(line: 389, column: 15, scope: !644)
!648 = !DILocation(line: 389, column: 14, scope: !644)
!649 = !DILocation(line: 389, column: 5, scope: !644)
!650 = !DILocation(line: 390, column: 7, scope: !651)
!651 = distinct !DILexicalBlock(scope: !567, file: !3, line: 390, column: 7)
!652 = !DILocation(line: 390, column: 17, scope: !651)
!653 = !DILocation(line: 390, column: 7, scope: !567)
!654 = !DILocation(line: 391, column: 15, scope: !651)
!655 = !DILocation(line: 391, column: 14, scope: !651)
!656 = !DILocation(line: 391, column: 5, scope: !651)
!657 = !DILocation(line: 403, column: 7, scope: !658)
!658 = distinct !DILexicalBlock(scope: !567, file: !3, line: 403, column: 7)
!659 = !DILocation(line: 403, column: 17, scope: !658)
!660 = !DILocation(line: 403, column: 7, scope: !567)
!661 = !DILocation(line: 404, column: 15, scope: !658)
!662 = !DILocation(line: 404, column: 14, scope: !658)
!663 = !DILocation(line: 404, column: 5, scope: !658)
!664 = !DILocation(line: 406, column: 7, scope: !665)
!665 = distinct !DILexicalBlock(scope: !567, file: !3, line: 406, column: 7)
!666 = !DILocation(line: 406, column: 17, scope: !665)
!667 = !DILocation(line: 406, column: 7, scope: !567)
!668 = !DILocation(line: 407, column: 15, scope: !665)
!669 = !DILocation(line: 407, column: 14, scope: !665)
!670 = !DILocation(line: 407, column: 5, scope: !665)
!671 = !DILocation(line: 408, column: 7, scope: !672)
!672 = distinct !DILexicalBlock(scope: !567, file: !3, line: 408, column: 7)
!673 = !DILocation(line: 408, column: 17, scope: !672)
!674 = !DILocation(line: 408, column: 7, scope: !567)
!675 = !DILocation(line: 409, column: 5, scope: !672)
!676 = !DILocation(line: 410, column: 9, scope: !567)
!677 = !DILocation(line: 410, column: 8, scope: !567)
!678 = !DILocation(line: 411, column: 7, scope: !679)
!679 = distinct !DILexicalBlock(scope: !567, file: !3, line: 411, column: 7)
!680 = !DILocation(line: 411, column: 13, scope: !679)
!681 = !DILocation(line: 411, column: 7, scope: !567)
!682 = !DILocation(line: 412, column: 35, scope: !679)
!683 = !DILocation(line: 412, column: 12, scope: !679)
!684 = !DILocation(line: 412, column: 5, scope: !679)
!685 = !DILocation(line: 413, column: 14, scope: !686)
!686 = distinct !DILexicalBlock(scope: !567, file: !3, line: 413, column: 7)
!687 = !DILocation(line: 413, column: 7, scope: !686)
!688 = !DILocation(line: 413, column: 25, scope: !686)
!689 = !DILocation(line: 413, column: 7, scope: !567)
!690 = !DILocation(line: 415, column: 31, scope: !691)
!691 = distinct !DILexicalBlock(scope: !686, file: !3, line: 414, column: 5)
!692 = !DILocation(line: 415, column: 17, scope: !691)
!693 = !DILocation(line: 415, column: 16, scope: !691)
!694 = !DILocation(line: 416, column: 7, scope: !691)
!695 = !DILocation(line: 418, column: 28, scope: !567)
!696 = !DILocation(line: 418, column: 38, scope: !567)
!697 = !DILocation(line: 418, column: 10, scope: !567)
!698 = !DILocation(line: 418, column: 9, scope: !567)
!699 = !DILocation(line: 419, column: 8, scope: !700)
!700 = distinct !DILexicalBlock(scope: !567, file: !3, line: 419, column: 7)
!701 = !DILocation(line: 419, column: 15, scope: !700)
!702 = !DILocation(line: 419, column: 31, scope: !700)
!703 = !DILocation(line: 419, column: 35, scope: !700)
!704 = !DILocation(line: 419, column: 7, scope: !567)
!705 = !DILocation(line: 421, column: 31, scope: !706)
!706 = distinct !DILexicalBlock(scope: !700, file: !3, line: 420, column: 5)
!707 = !DILocation(line: 421, column: 17, scope: !706)
!708 = !DILocation(line: 421, column: 16, scope: !706)
!709 = !DILocation(line: 422, column: 7, scope: !706)
!710 = !DILocation(line: 424, column: 7, scope: !711)
!711 = distinct !DILexicalBlock(scope: !567, file: !3, line: 424, column: 7)
!712 = !DILocation(line: 424, column: 24, scope: !711)
!713 = !DILocation(line: 424, column: 17, scope: !711)
!714 = !DILocation(line: 424, column: 34, scope: !711)
!715 = !DILocation(line: 424, column: 41, scope: !711)
!716 = !DILocation(line: 424, column: 38, scope: !711)
!717 = !DILocation(line: 424, column: 7, scope: !567)
!718 = !DILocation(line: 425, column: 31, scope: !711)
!719 = !DILocation(line: 426, column: 7, scope: !711)
!720 = !DILocation(line: 426, column: 26, scope: !711)
!721 = !DILocation(line: 426, column: 17, scope: !711)
!722 = !DILocation(line: 425, column: 12, scope: !711)
!723 = !DILocation(line: 425, column: 5, scope: !711)
!724 = !DILocation(line: 428, column: 31, scope: !711)
!725 = !DILocation(line: 429, column: 38, scope: !711)
!726 = !DILocation(line: 430, column: 16, scope: !711)
!727 = !DILocation(line: 430, column: 7, scope: !711)
!728 = !DILocation(line: 428, column: 12, scope: !711)
!729 = !DILocation(line: 431, column: 27, scope: !567)
!730 = !DILocation(line: 431, column: 13, scope: !567)
!731 = !DILocation(line: 431, column: 12, scope: !567)
!732 = !DILocation(line: 446, column: 3, scope: !567)
!733 = !DILocation(line: 447, column: 1, scope: !567)
!734 = !DILocalVariable(name: "path", arg: 1, scope: !298, file: !3, line: 449, type: !228)
!735 = !DILocation(line: 449, column: 50, scope: !298)
!736 = !DILocalVariable(name: "c", scope: !298, file: !3, line: 459, type: !50)
!737 = !DILocation(line: 459, column: 5, scope: !298)
!738 = !DILocalVariable(name: "file", scope: !298, file: !3, line: 460, type: !50)
!739 = !DILocation(line: 460, column: 5, scope: !298)
!740 = !DILocalVariable(name: "p", scope: !298, file: !3, line: 463, type: !228)
!741 = !DILocation(line: 463, column: 6, scope: !298)
!742 = !DILocalVariable(name: "i", scope: !298, file: !3, line: 466, type: !215)
!743 = !DILocation(line: 466, column: 5, scope: !298)
!744 = !DILocalVariable(name: "key", scope: !298, file: !3, line: 473, type: !745)
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 64)
!746 = !DIDerivedType(tag: DW_TAG_typedef, name: "StringInfo", file: !747, line: 40, baseType: !748)
!747 = !DIFile(filename: "./magick/string_.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!748 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_StringInfo", file: !747, line: 29, size: 32960, elements: !749)
!749 = !{!750, !751, !754, !755}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !748, file: !747, line: 32, baseType: !346, size: 32768)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "datum", scope: !748, file: !747, line: 35, baseType: !752, size: 64, offset: 32768)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 64)
!753 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !748, file: !747, line: 38, baseType: !288, size: 64, offset: 32832)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !748, file: !747, line: 39, baseType: !288, size: 64, offset: 32896)
!756 = !DILocation(line: 473, column: 6, scope: !298)
!757 = !DILocalVariable(name: "datum", scope: !298, file: !3, line: 476, type: !752)
!758 = !DILocation(line: 476, column: 6, scope: !298)
!759 = !DILocation(line: 479, column: 10, scope: !298)
!760 = !DILocation(line: 480, column: 7, scope: !761)
!761 = distinct !DILexicalBlock(scope: !298, file: !3, line: 480, column: 7)
!762 = !DILocation(line: 480, column: 19, scope: !761)
!763 = !DILocation(line: 480, column: 7, scope: !298)
!764 = !DILocation(line: 481, column: 17, scope: !761)
!765 = !DILocation(line: 481, column: 16, scope: !761)
!766 = !DILocation(line: 481, column: 5, scope: !761)
!767 = !DILocation(line: 482, column: 7, scope: !298)
!768 = !DILocation(line: 483, column: 9, scope: !769)
!769 = distinct !DILexicalBlock(scope: !298, file: !3, line: 483, column: 3)
!770 = !DILocation(line: 483, column: 8, scope: !769)
!771 = !DILocation(line: 483, column: 13, scope: !772)
!772 = distinct !DILexicalBlock(scope: !769, file: !3, line: 483, column: 3)
!773 = !DILocation(line: 483, column: 15, scope: !772)
!774 = !DILocation(line: 483, column: 3, scope: !769)
!775 = !DILocation(line: 488, column: 28, scope: !776)
!776 = distinct !DILexicalBlock(scope: !772, file: !3, line: 484, column: 3)
!777 = !DILocation(line: 488, column: 12, scope: !776)
!778 = !DILocation(line: 489, column: 22, scope: !776)
!779 = !DILocation(line: 489, column: 9, scope: !776)
!780 = !DILocation(line: 489, column: 8, scope: !776)
!781 = !DILocation(line: 490, column: 7, scope: !776)
!782 = !DILocation(line: 490, column: 19, scope: !776)
!783 = !DILocation(line: 490, column: 12, scope: !776)
!784 = !DILocation(line: 490, column: 11, scope: !776)
!785 = !DILocation(line: 490, column: 24, scope: !776)
!786 = !DILocation(line: 490, column: 6, scope: !776)
!787 = !DILocation(line: 491, column: 30, scope: !776)
!788 = !DILocation(line: 491, column: 11, scope: !776)
!789 = !DILocation(line: 491, column: 10, scope: !776)
!790 = !DILocation(line: 492, column: 11, scope: !791)
!791 = distinct !DILexicalBlock(scope: !776, file: !3, line: 492, column: 5)
!792 = !DILocation(line: 492, column: 10, scope: !791)
!793 = !DILocation(line: 492, column: 15, scope: !794)
!794 = distinct !DILexicalBlock(scope: !791, file: !3, line: 492, column: 5)
!795 = !DILocation(line: 492, column: 49, scope: !794)
!796 = !DILocation(line: 492, column: 29, scope: !794)
!797 = !DILocation(line: 492, column: 17, scope: !794)
!798 = !DILocation(line: 492, column: 5, scope: !791)
!799 = !DILocation(line: 494, column: 16, scope: !800)
!800 = distinct !DILexicalBlock(scope: !794, file: !3, line: 493, column: 5)
!801 = !DILocation(line: 494, column: 22, scope: !800)
!802 = !DILocation(line: 494, column: 25, scope: !800)
!803 = !DILocation(line: 494, column: 8, scope: !800)
!804 = !DILocation(line: 495, column: 30, scope: !800)
!805 = !DILocation(line: 495, column: 12, scope: !800)
!806 = !DILocation(line: 495, column: 9, scope: !800)
!807 = !DILocation(line: 495, column: 11, scope: !800)
!808 = !DILocation(line: 496, column: 5, scope: !800)
!809 = !DILocation(line: 492, column: 56, scope: !794)
!810 = !DILocation(line: 492, column: 5, scope: !794)
!811 = distinct !{!811, !798, !812}
!812 = !DILocation(line: 496, column: 5, scope: !791)
!813 = !DILocation(line: 497, column: 27, scope: !776)
!814 = !DILocation(line: 497, column: 9, scope: !776)
!815 = !DILocation(line: 497, column: 8, scope: !776)
!816 = !DILocation(line: 506, column: 22, scope: !776)
!817 = !DILocation(line: 506, column: 9, scope: !776)
!818 = !DILocation(line: 506, column: 8, scope: !776)
!819 = !DILocation(line: 507, column: 7, scope: !776)
!820 = !DILocation(line: 507, column: 19, scope: !776)
!821 = !DILocation(line: 507, column: 12, scope: !776)
!822 = !DILocation(line: 507, column: 11, scope: !776)
!823 = !DILocation(line: 507, column: 24, scope: !776)
