; ModuleID = 'wand/pixel-iterator.c'
source_filename = "wand/pixel-iterator.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._PixelIterator = type { i64, [4096 x i8], %struct._ExceptionInfo*, %struct._CacheView*, %struct._RectangleInfo, i32, i64, %struct._PixelWand**, i32, i64 }
%struct._ExceptionInfo = type { i32, i32, i8*, i8*, i8*, i32, %struct.SemaphoreInfo*, i64 }
%struct.SemaphoreInfo = type opaque
%struct._CacheView = type opaque
%struct._RectangleInfo = type { i64, i64, i64, i64 }
%struct._PixelWand = type opaque
%struct._MagickWand = type { i64, [4096 x i8], %struct._ExceptionInfo*, %struct._ImageInfo*, %struct._QuantizeInfo*, %struct._Image*, i32, i32, i32, i64 }
%struct._ImageInfo = type { i32, i32, i32, i32, i32, i32, i8*, i8*, i8*, i8*, i64, i64, i64, i32, i32, i32, i64, i8*, i8*, i8*, i8*, i8*, double, double, %struct._PixelPacket, %struct._PixelPacket, %struct._PixelPacket, i32, i32, i64, i32, i32, i32, i64, i32, i32, i8*, i8*, i32, %struct._Image*, i8*, i32 (i8*, i64, i64, i8*)*, i8*, i8*, i64 (%struct._Image*, i8*, i64)*, %struct._IO_FILE*, i8*, i64, [4096 x i8], [4096 x i8], [4096 x i8], [4096 x i8], i32, i8*, i64, i64, %struct._PixelPacket, i64, i32, %struct._PixelPacket, i8*, i32 }

!421 = !{!422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435}
!422 = !DIEnumerator(name: "UndefinedInterpolatePixel", value: 0, isUnsigned: true)
!423 = !DIEnumerator(name: "AverageInterpolatePixel", value: 1, isUnsigned: true)
!424 = !DIEnumerator(name: "BicubicInterpolatePixel", value: 2, isUnsigned: true)
!425 = !DIEnumerator(name: "BilinearInterpolatePixel", value: 3, isUnsigned: true)
!426 = !DIEnumerator(name: "FilterInterpolatePixel", value: 4, isUnsigned: true)
!427 = !DIEnumerator(name: "IntegerInterpolatePixel", value: 5, isUnsigned: true)
!428 = !DIEnumerator(name: "MeshInterpolatePixel", value: 6, isUnsigned: true)
!429 = !DIEnumerator(name: "NearestNeighborInterpolatePixel", value: 7, isUnsigned: true)
!430 = !DIEnumerator(name: "SplineInterpolatePixel", value: 8, isUnsigned: true)
!431 = !DIEnumerator(name: "Average9InterpolatePixel", value: 9, isUnsigned: true)
!432 = !DIEnumerator(name: "Average16InterpolatePixel", value: 10, isUnsigned: true)
!433 = !DIEnumerator(name: "BlendInterpolatePixel", value: 11, isUnsigned: true)
!434 = !DIEnumerator(name: "BackgroundInterpolatePixel", value: 12, isUnsigned: true)
!435 = !DIEnumerator(name: "CatromInterpolatePixel", value: 13, isUnsigned: true)
!436 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !420, line: 67, baseType: !5, size: 32, elements: !437)
!437 = !{!438, !439, !440, !441, !442, !443, !444, !445, !446, !447}
!438 = !DIEnumerator(name: "UndefinedPixelIntensityMethod", value: 0, isUnsigned: true)
!439 = !DIEnumerator(name: "AveragePixelIntensityMethod", value: 1, isUnsigned: true)
!440 = !DIEnumerator(name: "BrightnessPixelIntensityMethod", value: 2, isUnsigned: true)
!441 = !DIEnumerator(name: "LightnessPixelIntensityMethod", value: 3, isUnsigned: true)
!442 = !DIEnumerator(name: "Rec601LumaPixelIntensityMethod", value: 4, isUnsigned: true)
!443 = !DIEnumerator(name: "Rec601LuminancePixelIntensityMethod", value: 5, isUnsigned: true)
!444 = !DIEnumerator(name: "Rec709LumaPixelIntensityMethod", value: 6, isUnsigned: true)
!445 = !DIEnumerator(name: "Rec709LuminancePixelIntensityMethod", value: 7, isUnsigned: true)
!446 = !DIEnumerator(name: "RMSPixelIntensityMethod", value: 8, isUnsigned: true)
!447 = !DIEnumerator(name: "MSPixelIntensityMethod", value: 9, isUnsigned: true)
!448 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !449, line: 27, baseType: !5, size: 32, elements: !450)
!449 = !DIFile(filename: "./magick/cache-view.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!450 = !{!451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468}
!451 = !DIEnumerator(name: "UndefinedVirtualPixelMethod", value: 0, isUnsigned: true)
!452 = !DIEnumerator(name: "BackgroundVirtualPixelMethod", value: 1, isUnsigned: true)
!453 = !DIEnumerator(name: "ConstantVirtualPixelMethod", value: 2, isUnsigned: true)
!454 = !DIEnumerator(name: "DitherVirtualPixelMethod", value: 3, isUnsigned: true)
!455 = !DIEnumerator(name: "EdgeVirtualPixelMethod", value: 4, isUnsigned: true)
!456 = !DIEnumerator(name: "MirrorVirtualPixelMethod", value: 5, isUnsigned: true)
!457 = !DIEnumerator(name: "RandomVirtualPixelMethod", value: 6, isUnsigned: true)
!458 = !DIEnumerator(name: "TileVirtualPixelMethod", value: 7, isUnsigned: true)
!459 = !DIEnumerator(name: "TransparentVirtualPixelMethod", value: 8, isUnsigned: true)
!460 = !DIEnumerator(name: "MaskVirtualPixelMethod", value: 9, isUnsigned: true)
!461 = !DIEnumerator(name: "BlackVirtualPixelMethod", value: 10, isUnsigned: true)
!462 = !DIEnumerator(name: "GrayVirtualPixelMethod", value: 11, isUnsigned: true)
!463 = !DIEnumerator(name: "WhiteVirtualPixelMethod", value: 12, isUnsigned: true)
!464 = !DIEnumerator(name: "HorizontalTileVirtualPixelMethod", value: 13, isUnsigned: true)
!465 = !DIEnumerator(name: "VerticalTileVirtualPixelMethod", value: 14, isUnsigned: true)
!466 = !DIEnumerator(name: "HorizontalTileEdgeVirtualPixelMethod", value: 15, isUnsigned: true)
!467 = !DIEnumerator(name: "VerticalTileEdgeVirtualPixelMethod", value: 16, isUnsigned: true)
!468 = !DIEnumerator(name: "CheckerTileVirtualPixelMethod", value: 17, isUnsigned: true)
!469 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !470, line: 27, baseType: !5, size: 32, elements: !471)
!470 = !DIFile(filename: "./magick/quantize.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!471 = !{!472, !473, !474, !475}
!472 = !DIEnumerator(name: "UndefinedDitherMethod", value: 0, isUnsigned: true)
!473 = !DIEnumerator(name: "NoDitherMethod", value: 1, isUnsigned: true)
!474 = !DIEnumerator(name: "RiemersmaDitherMethod", value: 2, isUnsigned: true)
!475 = !DIEnumerator(name: "FloydSteinbergDitherMethod", value: 3, isUnsigned: true)
!476 = !{!477, !478, !504, !499, !540, !541, !544, !546, !514, !728, !533, !524, !501, !730, !566, !571}
!477 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!479 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelIterator", file: !480, line: 29, baseType: !481)
!480 = !DIFile(filename: "./wand/pixel-iterator.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!481 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PixelIterator", file: !1, line: 64, size: 33536, elements: !482)
!482 = !{!483, !486, !491, !513, !517, !530, !531, !532, !538, !539}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !481, file: !1, line: 67, baseType: !484, size: 64)
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !485, line: 46, baseType: !477)
!485 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!486 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !481, file: !1, line: 70, baseType: !487, size: 32768, offset: 64)
!487 = !DICompositeType(tag: DW_TAG_array_type, baseType: !488, size: 32768, elements: !489)
!488 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!489 = !{!490}
!490 = !DISubrange(count: 4096)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "exception", scope: !481, file: !1, line: 73, baseType: !492, size: 64, offset: 32832)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64)
!493 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionInfo", file: !78, line: 219, baseType: !494)
!494 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ExceptionInfo", file: !4, line: 102, size: 448, elements: !495)
!495 = !{!496, !498, !500, !502, !503, !505, !507, !512}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "severity", scope: !494, file: !4, line: 105, baseType: !497, size: 32)
!497 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionType", file: !4, line: 100, baseType: !3)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "error_number", scope: !494, file: !4, line: 108, baseType: !499, size: 32, offset: 32)
!499 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !494, file: !4, line: 111, baseType: !501, size: 64, offset: 64)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !494, file: !4, line: 112, baseType: !501, size: 64, offset: 128)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "exceptions", scope: !494, file: !4, line: 115, baseType: !504, size: 64, offset: 192)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "relinquish", scope: !494, file: !4, line: 118, baseType: !506, size: 32, offset: 256)
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickBooleanType", file: !78, line: 215, baseType: !77)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !494, file: !4, line: 121, baseType: !508, size: 64, offset: 320)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64)
!509 = !DIDerivedType(tag: DW_TAG_typedef, name: "SemaphoreInfo", file: !510, line: 26, baseType: !511)
!510 = !DIFile(filename: "./magick/semaphore.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!511 = !DICompositeType(tag: DW_TAG_structure_type, name: "SemaphoreInfo", file: !510, line: 25, flags: DIFlagFwdDecl)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !494, file: !4, line: 124, baseType: !484, size: 64, offset: 384)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !481, file: !1, line: 76, baseType: !514, size: 64, offset: 32896)
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 64)
!515 = !DIDerivedType(tag: DW_TAG_typedef, name: "CacheView", file: !449, line: 50, baseType: !516)
!516 = !DICompositeType(tag: DW_TAG_structure_type, name: "_CacheView", file: !420, line: 160, flags: DIFlagFwdDecl)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !481, file: !1, line: 79, baseType: !518, size: 256, offset: 32960)
!518 = !DIDerivedType(tag: DW_TAG_typedef, name: "RectangleInfo", file: !320, line: 130, baseType: !519)
!519 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_RectangleInfo", file: !320, line: 121, size: 256, elements: !520)
!520 = !{!521, !522, !523, !529}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !519, file: !320, line: 124, baseType: !484, size: 64)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !519, file: !320, line: 125, baseType: !484, size: 64, offset: 64)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !519, file: !320, line: 128, baseType: !524, size: 64, offset: 128)
!524 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !525, line: 77, baseType: !526)
!525 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!526 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !527, line: 193, baseType: !528)
!527 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!528 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !519, file: !320, line: 129, baseType: !524, size: 64, offset: 192)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !481, file: !1, line: 82, baseType: !506, size: 32, offset: 33216)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !481, file: !1, line: 85, baseType: !524, size: 64, offset: 33280)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_wands", scope: !481, file: !1, line: 88, baseType: !533, size: 64, offset: 33344)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64)
!535 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelWand", file: !536, line: 26, baseType: !537)
!536 = !DIFile(filename: "./wand/pixel-wand.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!537 = !DICompositeType(tag: DW_TAG_structure_type, name: "_PixelWand", file: !536, line: 25, flags: DIFlagFwdDecl)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !481, file: !1, line: 91, baseType: !506, size: 32, offset: 33408)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !481, file: !1, line: 94, baseType: !484, size: 64, offset: 33472)
!540 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64)
!543 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !535)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64)
!545 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !479)
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64)
!547 = !DIDerivedType(tag: DW_TAG_typedef, name: "Image", file: !78, line: 221, baseType: !548)
!548 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Image", file: !133, line: 150, size: 105920, elements: !549)
!549 = !{!550, !552, !554, !556, !557, !559, !560, !561, !562, !563, !564, !565, !576, !577, !578, !579, !580, !594, !596, !597, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !613, !615, !617, !619, !621, !623, !625, !626, !627, !628, !629, !630, !631, !639, !654, !668, !669, !670, !671, !675, !679, !680, !681, !682, !683, !684, !685, !686, !688, !689, !699, !700, !702, !703, !704, !705, !706, !707, !709, !710, !711, !712, !713, !714, !715, !717, !718, !719, !720, !721, !725, !727}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !548, file: !133, line: 153, baseType: !551, size: 32)
!551 = !DIDerivedType(tag: DW_TAG_typedef, name: "ClassType", file: !78, line: 209, baseType: !271)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !548, file: !133, line: 156, baseType: !553, size: 32, offset: 32)
!553 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorspaceType", file: !166, line: 61, baseType: !165)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !548, file: !133, line: 159, baseType: !555, size: 32, offset: 64)
!555 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompressionType", file: !108, line: 49, baseType: !107)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !548, file: !133, line: 162, baseType: !484, size: 64, offset: 128)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !548, file: !133, line: 165, baseType: !558, size: 32, offset: 192)
!558 = !DIDerivedType(tag: DW_TAG_typedef, name: "OrientationType", file: !133, line: 86, baseType: !132)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "taint", scope: !548, file: !133, line: 168, baseType: !506, size: 32, offset: 224)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "matte", scope: !548, file: !133, line: 169, baseType: !506, size: 32, offset: 256)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !548, file: !133, line: 172, baseType: !484, size: 64, offset: 320)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !548, file: !133, line: 173, baseType: !484, size: 64, offset: 384)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !548, file: !133, line: 174, baseType: !484, size: 64, offset: 448)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !548, file: !133, line: 175, baseType: !484, size: 64, offset: 512)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "colormap", scope: !548, file: !133, line: 178, baseType: !566, size: 64, offset: 576)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64)
!567 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelPacket", file: !420, line: 148, baseType: !568)
!568 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PixelPacket", file: !420, line: 131, size: 64, elements: !569)
!569 = !{!570, !573, !574, !575}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !568, file: !420, line: 143, baseType: !571, size: 16)
!571 = !DIDerivedType(tag: DW_TAG_typedef, name: "Quantum", file: !78, line: 93, baseType: !572)
!572 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !568, file: !420, line: 144, baseType: !571, size: 16, offset: 16)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !568, file: !420, line: 145, baseType: !571, size: 16, offset: 32)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !568, file: !420, line: 146, baseType: !571, size: 16, offset: 48)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "background_color", scope: !548, file: !133, line: 179, baseType: !567, size: 64, offset: 640)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !548, file: !133, line: 180, baseType: !567, size: 64, offset: 704)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "matte_color", scope: !548, file: !133, line: 181, baseType: !567, size: 64, offset: 768)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !548, file: !133, line: 184, baseType: !540, size: 64, offset: 832)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "chromaticity", scope: !548, file: !133, line: 187, baseType: !581, size: 768, offset: 896)
!581 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChromaticityInfo", file: !133, line: 128, baseType: !582)
!582 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ChromaticityInfo", file: !133, line: 121, size: 768, elements: !583)
!583 = !{!584, !591, !592, !593}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "red_primary", scope: !582, file: !133, line: 124, baseType: !585, size: 192)
!585 = !DIDerivedType(tag: DW_TAG_typedef, name: "PrimaryInfo", file: !133, line: 101, baseType: !586)
!586 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PrimaryInfo", file: !133, line: 95, size: 192, elements: !587)
!587 = !{!588, !589, !590}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !586, file: !133, line: 98, baseType: !540, size: 64)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !586, file: !133, line: 99, baseType: !540, size: 64, offset: 64)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !586, file: !133, line: 100, baseType: !540, size: 64, offset: 128)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "green_primary", scope: !582, file: !133, line: 125, baseType: !585, size: 192, offset: 192)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "blue_primary", scope: !582, file: !133, line: 126, baseType: !585, size: 192, offset: 384)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "white_point", scope: !582, file: !133, line: 127, baseType: !585, size: 192, offset: 576)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "rendering_intent", scope: !548, file: !133, line: 190, baseType: !595, size: 32, offset: 1664)
!595 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderingIntent", file: !277, line: 49, baseType: !276)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !548, file: !133, line: 193, baseType: !504, size: 64, offset: 1728)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !548, file: !133, line: 196, baseType: !598, size: 32, offset: 1792)
!598 = !DIDerivedType(tag: DW_TAG_typedef, name: "ResolutionType", file: !133, line: 93, baseType: !160)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "montage", scope: !548, file: !133, line: 199, baseType: !501, size: 64, offset: 1856)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "directory", scope: !548, file: !133, line: 200, baseType: !501, size: 64, offset: 1920)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "geometry", scope: !548, file: !133, line: 201, baseType: !501, size: 64, offset: 1984)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !548, file: !133, line: 204, baseType: !524, size: 64, offset: 2048)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "x_resolution", scope: !548, file: !133, line: 207, baseType: !540, size: 64, offset: 2112)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "y_resolution", scope: !548, file: !133, line: 208, baseType: !540, size: 64, offset: 2176)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !548, file: !133, line: 211, baseType: !518, size: 256, offset: 2240)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "extract_info", scope: !548, file: !133, line: 212, baseType: !518, size: 256, offset: 2496)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "tile_info", scope: !548, file: !133, line: 213, baseType: !518, size: 256, offset: 2752)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "bias", scope: !548, file: !133, line: 216, baseType: !540, size: 64, offset: 3008)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "blur", scope: !548, file: !133, line: 217, baseType: !540, size: 64, offset: 3072)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !548, file: !133, line: 218, baseType: !540, size: 64, offset: 3136)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !548, file: !133, line: 221, baseType: !612, size: 32, offset: 3200)
!612 = !DIDerivedType(tag: DW_TAG_typedef, name: "FilterTypes", file: !285, line: 66, baseType: !284)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "interlace", scope: !548, file: !133, line: 224, baseType: !614, size: 32, offset: 3232)
!614 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterlaceType", file: !133, line: 73, baseType: !144)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !548, file: !133, line: 227, baseType: !616, size: 32, offset: 3264)
!616 = !DIDerivedType(tag: DW_TAG_typedef, name: "EndianType", file: !155, line: 35, baseType: !154)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !548, file: !133, line: 230, baseType: !618, size: 32, offset: 3296)
!618 = !DIDerivedType(tag: DW_TAG_typedef, name: "GravityType", file: !320, line: 91, baseType: !319)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !548, file: !133, line: 233, baseType: !620, size: 32, offset: 3328)
!620 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompositeOperator", file: !335, line: 99, baseType: !334)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "dispose", scope: !548, file: !133, line: 236, baseType: !622, size: 32, offset: 3360)
!622 = !DIDerivedType(tag: DW_TAG_typedef, name: "DisposeType", file: !406, line: 32, baseType: !405)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "clip_mask", scope: !548, file: !133, line: 239, baseType: !624, size: 64, offset: 3392)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !548, file: !133, line: 242, baseType: !484, size: 64, offset: 3456)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !548, file: !133, line: 243, baseType: !484, size: 64, offset: 3520)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_second", scope: !548, file: !133, line: 246, baseType: !524, size: 64, offset: 3584)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "iterations", scope: !548, file: !133, line: 249, baseType: !484, size: 64, offset: 3648)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "total_colors", scope: !548, file: !133, line: 250, baseType: !484, size: 64, offset: 3712)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "start_loop", scope: !548, file: !133, line: 253, baseType: !524, size: 64, offset: 3776)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !548, file: !133, line: 256, baseType: !632, size: 192, offset: 3840)
!632 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErrorInfo", file: !633, line: 68, baseType: !634)
!633 = !DIFile(filename: "./magick/color.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!634 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ErrorInfo", file: !633, line: 62, size: 192, elements: !635)
!635 = !{!636, !637, !638}
!636 = !DIDerivedType(tag: DW_TAG_member, name: "mean_error_per_pixel", scope: !634, file: !633, line: 65, baseType: !540, size: 64)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_mean_error", scope: !634, file: !633, line: 66, baseType: !540, size: 64, offset: 64)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_maximum_error", scope: !634, file: !633, line: 67, baseType: !540, size: 64, offset: 128)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !548, file: !133, line: 259, baseType: !640, size: 512, offset: 4032)
!640 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerInfo", file: !414, line: 51, baseType: !641)
!641 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TimerInfo", file: !414, line: 40, size: 512, elements: !642)
!642 = !{!643, !650, !651, !653}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !641, file: !414, line: 43, baseType: !644, size: 192)
!644 = !DIDerivedType(tag: DW_TAG_typedef, name: "Timer", file: !414, line: 38, baseType: !645)
!645 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Timer", file: !414, line: 32, size: 192, elements: !646)
!646 = !{!647, !648, !649}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !645, file: !414, line: 35, baseType: !540, size: 64)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !645, file: !414, line: 36, baseType: !540, size: 64, offset: 64)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !645, file: !414, line: 37, baseType: !540, size: 64, offset: 128)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "elapsed", scope: !641, file: !414, line: 44, baseType: !644, size: 192, offset: 192)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !641, file: !414, line: 47, baseType: !652, size: 32, offset: 384)
!652 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerState", file: !414, line: 30, baseType: !413)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !641, file: !414, line: 50, baseType: !484, size: 64, offset: 448)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !548, file: !133, line: 262, baseType: !655, size: 64, offset: 4544)
!655 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickProgressMonitor", file: !656, line: 26, baseType: !657)
!656 = !DIFile(filename: "./magick/monitor.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64)
!658 = !DISubroutineType(types: !659)
!659 = !{!506, !660, !662, !665, !504}
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 64)
!661 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !488)
!662 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !663)
!663 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickOffsetType", file: !78, line: 150, baseType: !664)
!664 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!665 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !666)
!666 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickSizeType", file: !78, line: 151, baseType: !667)
!667 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !548, file: !133, line: 265, baseType: !504, size: 64, offset: 4608)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !548, file: !133, line: 266, baseType: !504, size: 64, offset: 4672)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !548, file: !133, line: 267, baseType: !504, size: 64, offset: 4736)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "ascii85", scope: !548, file: !133, line: 270, baseType: !672, size: 64, offset: 4800)
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 64)
!673 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ascii85Info", file: !108, line: 52, baseType: !674)
!674 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Ascii85Info", file: !108, line: 51, flags: DIFlagFwdDecl)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !548, file: !133, line: 273, baseType: !676, size: 64, offset: 4864)
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 64)
!677 = !DIDerivedType(tag: DW_TAG_typedef, name: "BlobInfo", file: !78, line: 217, baseType: !678)
!678 = !DICompositeType(tag: DW_TAG_structure_type, name: "_BlobInfo", file: !78, line: 217, flags: DIFlagFwdDecl)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !548, file: !133, line: 276, baseType: !487, size: 32768, offset: 4928)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "magick_filename", scope: !548, file: !133, line: 277, baseType: !487, size: 32768, offset: 37696)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !548, file: !133, line: 278, baseType: !487, size: 32768, offset: 70464)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "magick_columns", scope: !548, file: !133, line: 281, baseType: !484, size: 64, offset: 103232)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "magick_rows", scope: !548, file: !133, line: 282, baseType: !484, size: 64, offset: 103296)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "exception", scope: !548, file: !133, line: 285, baseType: !493, size: 448, offset: 103360)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !548, file: !133, line: 288, baseType: !506, size: 32, offset: 103808)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !548, file: !133, line: 291, baseType: !687, size: 64, offset: 103872)
!687 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !524)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !548, file: !133, line: 294, baseType: !508, size: 64, offset: 103936)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "color_profile", scope: !548, file: !133, line: 297, baseType: !690, size: 256, offset: 104000)
!690 = !DIDerivedType(tag: DW_TAG_typedef, name: "ProfileInfo", file: !277, line: 40, baseType: !691)
!691 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ProfileInfo", file: !277, line: 27, size: 256, elements: !692)
!692 = !{!693, !694, !695, !698}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !691, file: !277, line: 30, baseType: !501, size: 64)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !691, file: !277, line: 33, baseType: !484, size: 64, offset: 64)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !691, file: !277, line: 36, baseType: !696, size: 64, offset: 128)
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 64)
!697 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !691, file: !277, line: 39, baseType: !484, size: 64, offset: 192)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "iptc_profile", scope: !548, file: !133, line: 298, baseType: !690, size: 256, offset: 104256)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profile", scope: !548, file: !133, line: 299, baseType: !701, size: 64, offset: 104512)
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 64)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profiles", scope: !548, file: !133, line: 302, baseType: !484, size: 64, offset: 104576)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !548, file: !133, line: 305, baseType: !484, size: 64, offset: 104640)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !548, file: !133, line: 308, baseType: !624, size: 64, offset: 104704)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !548, file: !133, line: 309, baseType: !624, size: 64, offset: 104768)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !548, file: !133, line: 310, baseType: !624, size: 64, offset: 104832)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "interpolate", scope: !548, file: !133, line: 313, baseType: !708, size: 32, offset: 104896)
!708 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterpolatePixelMethod", file: !420, line: 47, baseType: !419)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "black_point_compensation", scope: !548, file: !133, line: 316, baseType: !506, size: 32, offset: 104928)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_color", scope: !548, file: !133, line: 319, baseType: !567, size: 64, offset: 104960)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !548, file: !133, line: 322, baseType: !624, size: 64, offset: 105024)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "tile_offset", scope: !548, file: !133, line: 325, baseType: !518, size: 256, offset: 105088)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !548, file: !133, line: 328, baseType: !504, size: 64, offset: 105344)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "artifacts", scope: !548, file: !133, line: 329, baseType: !504, size: 64, offset: 105408)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !548, file: !133, line: 332, baseType: !716, size: 32, offset: 105472)
!716 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageType", file: !133, line: 61, baseType: !202)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !548, file: !133, line: 335, baseType: !506, size: 32, offset: 105504)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !548, file: !133, line: 338, baseType: !666, size: 64, offset: 105536)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "ping", scope: !548, file: !133, line: 341, baseType: !506, size: 32, offset: 105600)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !548, file: !133, line: 344, baseType: !484, size: 64, offset: 105664)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !548, file: !133, line: 347, baseType: !722, size: 64, offset: 105728)
!722 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !723, line: 7, baseType: !724)
!723 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "")
!724 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !527, line: 160, baseType: !528)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "intensity", scope: !548, file: !133, line: 350, baseType: !726, size: 32, offset: 105792)
!726 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelIntensityMethod", file: !420, line: 79, baseType: !436)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !548, file: !133, line: 353, baseType: !484, size: 64, offset: 105856)
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 64)
!729 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !567)
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 64)
!731 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !732)
!732 = !DIDerivedType(tag: DW_TAG_typedef, name: "IndexPacket", file: !420, line: 129, baseType: !571)
!733 = !{i32 7, !"Dwarf Version", i32 4}
!734 = !{i32 2, !"Debug Info Version", i32 3}
!735 = !{i32 1, !"wchar_size", i32 4}
!736 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!737 = distinct !DISubprogram(name: "ClearPixelIterator", scope: !1, file: !1, line: 119, type: !738, scopeLine: 120, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !740)
!738 = !DISubroutineType(types: !739)
!739 = !{null, !478}
!740 = !{}
!741 = !DILocalVariable(name: "iterator", arg: 1, scope: !737, file: !1, line: 119, type: !478)
!742 = !DILocation(line: 119, column: 51, scope: !737)
!743 = !DILocation(line: 123, column: 7, scope: !744)
!744 = distinct !DILexicalBlock(scope: !737, file: !1, line: 123, column: 7)
!745 = !DILocation(line: 123, column: 17, scope: !744)
!746 = !DILocation(line: 123, column: 23, scope: !744)
!747 = !DILocation(line: 123, column: 7, scope: !737)
!748 = !DILocation(line: 124, column: 60, scope: !744)
!749 = !DILocation(line: 124, column: 70, scope: !744)
!750 = !DILocation(line: 124, column: 12, scope: !744)
!751 = !DILocation(line: 124, column: 5, scope: !744)
!752 = !DILocation(line: 125, column: 43, scope: !737)
!753 = !DILocation(line: 125, column: 53, scope: !737)
!754 = !DILocation(line: 126, column: 5, scope: !737)
!755 = !DILocation(line: 126, column: 15, scope: !737)
!756 = !DILocation(line: 126, column: 22, scope: !737)
!757 = !DILocation(line: 125, column: 25, scope: !737)
!758 = !DILocation(line: 125, column: 3, scope: !737)
!759 = !DILocation(line: 125, column: 13, scope: !737)
!760 = !DILocation(line: 125, column: 24, scope: !737)
!761 = !DILocation(line: 127, column: 24, scope: !737)
!762 = !DILocation(line: 127, column: 34, scope: !737)
!763 = !DILocation(line: 127, column: 3, scope: !737)
!764 = !DILocation(line: 128, column: 39, scope: !737)
!765 = !DILocation(line: 128, column: 49, scope: !737)
!766 = !DILocation(line: 128, column: 56, scope: !737)
!767 = !DILocation(line: 128, column: 25, scope: !737)
!768 = !DILocation(line: 128, column: 3, scope: !737)
!769 = !DILocation(line: 128, column: 13, scope: !737)
!770 = !DILocation(line: 128, column: 24, scope: !737)
!771 = !DILocation(line: 129, column: 3, scope: !737)
!772 = !DILocation(line: 129, column: 13, scope: !737)
!773 = !DILocation(line: 129, column: 19, scope: !737)
!774 = !DILocation(line: 130, column: 3, scope: !737)
!775 = !DILocation(line: 130, column: 13, scope: !737)
!776 = !DILocation(line: 130, column: 14, scope: !737)
!777 = !DILocation(line: 131, column: 19, scope: !737)
!778 = !DILocation(line: 131, column: 3, scope: !737)
!779 = !DILocation(line: 131, column: 13, scope: !737)
!780 = !DILocation(line: 131, column: 18, scope: !737)
!781 = !DILocation(line: 132, column: 1, scope: !737)
!782 = distinct !DISubprogram(name: "ClonePixelIterator", scope: !1, file: !1, line: 156, type: !783, scopeLine: 157, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !740)
!783 = !DISubroutineType(types: !784)
!784 = !{!478, !544}
!785 = !DILocalVariable(name: "iterator", arg: 1, scope: !782, file: !1, line: 156, type: !544)
!786 = !DILocation(line: 156, column: 67, scope: !782)
!787 = !DILocalVariable(name: "clone_iterator", scope: !782, file: !1, line: 159, type: !478)
!788 = !DILocation(line: 159, column: 6, scope: !782)
!789 = !DILocation(line: 163, column: 7, scope: !790)
!790 = distinct !DILexicalBlock(scope: !782, file: !1, line: 163, column: 7)
!791 = !DILocation(line: 163, column: 17, scope: !790)
!792 = !DILocation(line: 163, column: 23, scope: !790)
!793 = !DILocation(line: 163, column: 7, scope: !782)
!794 = !DILocation(line: 164, column: 60, scope: !790)
!795 = !DILocation(line: 164, column: 70, scope: !790)
!796 = !DILocation(line: 164, column: 12, scope: !790)
!797 = !DILocation(line: 164, column: 5, scope: !790)
!798 = !DILocation(line: 165, column: 36, scope: !782)
!799 = !DILocation(line: 165, column: 18, scope: !782)
!800 = !DILocation(line: 165, column: 17, scope: !782)
!801 = !DILocation(line: 166, column: 7, scope: !802)
!802 = distinct !DILexicalBlock(scope: !782, file: !1, line: 166, column: 7)
!803 = !DILocation(line: 166, column: 22, scope: !802)
!804 = !DILocation(line: 166, column: 7, scope: !782)
!805 = !DILocalVariable(name: "exception", scope: !806, file: !1, line: 167, type: !493)
!806 = distinct !DILexicalBlock(scope: !802, file: !1, line: 167, column: 5)
!807 = !DILocation(line: 167, column: 5, scope: !806)
!808 = !DILocation(line: 169, column: 28, scope: !782)
!809 = !DILocation(line: 169, column: 10, scope: !782)
!810 = !DILocation(line: 170, column: 22, scope: !782)
!811 = !DILocation(line: 170, column: 3, scope: !782)
!812 = !DILocation(line: 170, column: 19, scope: !782)
!813 = !DILocation(line: 170, column: 21, scope: !782)
!814 = !DILocation(line: 171, column: 29, scope: !782)
!815 = !DILocation(line: 171, column: 45, scope: !782)
!816 = !DILocation(line: 172, column: 30, scope: !782)
!817 = !DILocation(line: 172, column: 46, scope: !782)
!818 = !DILocation(line: 172, column: 21, scope: !782)
!819 = !DILocation(line: 171, column: 10, scope: !782)
!820 = !DILocation(line: 173, column: 29, scope: !782)
!821 = !DILocation(line: 173, column: 3, scope: !782)
!822 = !DILocation(line: 173, column: 19, scope: !782)
!823 = !DILocation(line: 173, column: 28, scope: !782)
!824 = !DILocation(line: 174, column: 20, scope: !782)
!825 = !DILocation(line: 174, column: 36, scope: !782)
!826 = !DILocation(line: 174, column: 46, scope: !782)
!827 = !DILocation(line: 174, column: 56, scope: !782)
!828 = !DILocation(line: 174, column: 3, scope: !782)
!829 = !DILocation(line: 175, column: 39, scope: !782)
!830 = !DILocation(line: 175, column: 49, scope: !782)
!831 = !DILocation(line: 175, column: 24, scope: !782)
!832 = !DILocation(line: 175, column: 3, scope: !782)
!833 = !DILocation(line: 175, column: 19, scope: !782)
!834 = !DILocation(line: 175, column: 23, scope: !782)
!835 = !DILocation(line: 176, column: 3, scope: !782)
!836 = !DILocation(line: 176, column: 19, scope: !782)
!837 = !DILocation(line: 176, column: 26, scope: !782)
!838 = !DILocation(line: 176, column: 36, scope: !782)
!839 = !DILocation(line: 177, column: 26, scope: !782)
!840 = !DILocation(line: 177, column: 36, scope: !782)
!841 = !DILocation(line: 177, column: 3, scope: !782)
!842 = !DILocation(line: 177, column: 19, scope: !782)
!843 = !DILocation(line: 177, column: 25, scope: !782)
!844 = !DILocation(line: 178, column: 21, scope: !782)
!845 = !DILocation(line: 178, column: 31, scope: !782)
!846 = !DILocation(line: 178, column: 3, scope: !782)
!847 = !DILocation(line: 178, column: 19, scope: !782)
!848 = !DILocation(line: 178, column: 20, scope: !782)
!849 = !DILocation(line: 180, column: 5, scope: !782)
!850 = !DILocation(line: 180, column: 15, scope: !782)
!851 = !DILocation(line: 180, column: 27, scope: !782)
!852 = !DILocation(line: 180, column: 37, scope: !782)
!853 = !DILocation(line: 180, column: 44, scope: !782)
!854 = !DILocation(line: 179, column: 31, scope: !782)
!855 = !DILocation(line: 179, column: 3, scope: !782)
!856 = !DILocation(line: 179, column: 19, scope: !782)
!857 = !DILocation(line: 179, column: 30, scope: !782)
!858 = !DILocation(line: 181, column: 25, scope: !782)
!859 = !DILocation(line: 181, column: 35, scope: !782)
!860 = !DILocation(line: 181, column: 3, scope: !782)
!861 = !DILocation(line: 181, column: 19, scope: !782)
!862 = !DILocation(line: 181, column: 24, scope: !782)
!863 = !DILocation(line: 182, column: 7, scope: !864)
!864 = distinct !DILexicalBlock(scope: !782, file: !1, line: 182, column: 7)
!865 = !DILocation(line: 182, column: 23, scope: !864)
!866 = !DILocation(line: 182, column: 29, scope: !864)
!867 = !DILocation(line: 182, column: 7, scope: !782)
!868 = !DILocation(line: 184, column: 7, scope: !864)
!869 = !DILocation(line: 184, column: 23, scope: !864)
!870 = !DILocation(line: 183, column: 12, scope: !864)
!871 = !DILocation(line: 183, column: 5, scope: !864)
!872 = !DILocation(line: 185, column: 3, scope: !782)
!873 = !DILocation(line: 185, column: 19, scope: !782)
!874 = !DILocation(line: 185, column: 28, scope: !782)
!875 = !DILocation(line: 186, column: 10, scope: !782)
!876 = !DILocation(line: 186, column: 3, scope: !782)
!877 = distinct !DISubprogram(name: "DestroyPixelIterator", scope: !1, file: !1, line: 211, type: !878, scopeLine: 212, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !740)
!878 = !DISubroutineType(types: !879)
!879 = !{!478, !478}
!880 = !DILocalVariable(name: "iterator", arg: 1, scope: !877, file: !1, line: 211, type: !478)
!881 = !DILocation(line: 211, column: 63, scope: !877)
!882 = !DILocation(line: 215, column: 7, scope: !883)
!883 = distinct !DILexicalBlock(scope: !877, file: !1, line: 215, column: 7)
!884 = !DILocation(line: 215, column: 17, scope: !883)
!885 = !DILocation(line: 215, column: 23, scope: !883)
!886 = !DILocation(line: 215, column: 7, scope: !877)
!887 = !DILocation(line: 216, column: 60, scope: !883)
!888 = !DILocation(line: 216, column: 70, scope: !883)
!889 = !DILocation(line: 216, column: 12, scope: !883)
!890 = !DILocation(line: 216, column: 5, scope: !883)
!891 = !DILocation(line: 217, column: 35, scope: !877)
!892 = !DILocation(line: 217, column: 45, scope: !877)
!893 = !DILocation(line: 217, column: 18, scope: !877)
!894 = !DILocation(line: 217, column: 3, scope: !877)
!895 = !DILocation(line: 217, column: 13, scope: !877)
!896 = !DILocation(line: 217, column: 17, scope: !877)
!897 = !DILocation(line: 218, column: 43, scope: !877)
!898 = !DILocation(line: 218, column: 53, scope: !877)
!899 = !DILocation(line: 219, column: 5, scope: !877)
!900 = !DILocation(line: 219, column: 15, scope: !877)
!901 = !DILocation(line: 219, column: 22, scope: !877)
!902 = !DILocation(line: 218, column: 25, scope: !877)
!903 = !DILocation(line: 218, column: 3, scope: !877)
!904 = !DILocation(line: 218, column: 13, scope: !877)
!905 = !DILocation(line: 218, column: 24, scope: !877)
!906 = !DILocation(line: 220, column: 44, scope: !877)
!907 = !DILocation(line: 220, column: 54, scope: !877)
!908 = !DILocation(line: 220, column: 23, scope: !877)
!909 = !DILocation(line: 220, column: 3, scope: !877)
!910 = !DILocation(line: 220, column: 13, scope: !877)
!911 = !DILocation(line: 220, column: 22, scope: !877)
!912 = !DILocation(line: 221, column: 3, scope: !877)
!913 = !DILocation(line: 221, column: 13, scope: !877)
!914 = !DILocation(line: 221, column: 22, scope: !877)
!915 = !DILocation(line: 222, column: 20, scope: !877)
!916 = !DILocation(line: 222, column: 30, scope: !877)
!917 = !DILocation(line: 222, column: 3, scope: !877)
!918 = !DILocation(line: 223, column: 53, scope: !877)
!919 = !DILocation(line: 223, column: 30, scope: !877)
!920 = !DILocation(line: 223, column: 12, scope: !877)
!921 = !DILocation(line: 223, column: 11, scope: !877)
!922 = !DILocation(line: 224, column: 10, scope: !877)
!923 = !DILocation(line: 224, column: 3, scope: !877)
!924 = distinct !DISubprogram(name: "IsPixelIterator", scope: !1, file: !1, line: 250, type: !925, scopeLine: 251, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !740)
!925 = !DISubroutineType(types: !926)
!926 = !{!506, !544}
!927 = !DILocalVariable(name: "iterator", arg: 1, scope: !924, file: !1, line: 250, type: !544)
!928 = !DILocation(line: 250, column: 67, scope: !924)
!929 = !DILocalVariable(name: "length", scope: !924, file: !1, line: 253, type: !484)
!930 = !DILocation(line: 253, column: 5, scope: !924)
!931 = !DILocation(line: 255, column: 7, scope: !932)
!932 = distinct !DILexicalBlock(scope: !924, file: !1, line: 255, column: 7)
!933 = !DILocation(line: 255, column: 16, scope: !932)
!934 = !DILocation(line: 255, column: 7, scope: !924)
!935 = !DILocation(line: 256, column: 5, scope: !932)
!936 = !DILocation(line: 257, column: 7, scope: !937)
!937 = distinct !DILexicalBlock(scope: !924, file: !1, line: 257, column: 7)
!938 = !DILocation(line: 257, column: 17, scope: !937)
!939 = !DILocation(line: 257, column: 27, scope: !937)
!940 = !DILocation(line: 257, column: 7, scope: !924)
!941 = !DILocation(line: 258, column: 5, scope: !937)
!942 = !DILocation(line: 259, column: 9, scope: !924)
!943 = !DILocation(line: 260, column: 22, scope: !944)
!944 = distinct !DILexicalBlock(scope: !924, file: !1, line: 260, column: 7)
!945 = !DILocation(line: 260, column: 32, scope: !944)
!946 = !DILocation(line: 260, column: 53, scope: !944)
!947 = !DILocation(line: 260, column: 7, scope: !944)
!948 = !DILocation(line: 260, column: 61, scope: !944)
!949 = !DILocation(line: 260, column: 7, scope: !924)
!950 = !DILocation(line: 261, column: 5, scope: !944)
!951 = !DILocation(line: 262, column: 3, scope: !924)
!952 = !DILocation(line: 263, column: 1, scope: !924)
!953 = distinct !DISubprogram(name: "NewPixelIterator", scope: !1, file: !1, line: 287, type: !954, scopeLine: 288, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !740)
!954 = !DISubroutineType(types: !955)
!955 = !{!478, !956}
!956 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 64)
!957 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickWand", file: !958, line: 69, baseType: !959)
!958 = !DIFile(filename: "./wand/MagickWand.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!959 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MagickWand", file: !960, line: 50, size: 33280, elements: !961)
!960 = !DIFile(filename: "./wand/magick-wand-private.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!961 = !{!962, !963, !964, !965, !1098, !1111, !1112, !1113, !1114, !1115}
!962 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !959, file: !960, line: 53, baseType: !484, size: 64)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !959, file: !960, line: 56, baseType: !487, size: 32768, offset: 64)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "exception", scope: !959, file: !960, line: 59, baseType: !492, size: 64, offset: 32832)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "image_info", scope: !959, file: !960, line: 62, baseType: !966, size: 64, offset: 32896)
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 64)
!967 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageInfo", file: !78, line: 223, baseType: !968)
!968 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ImageInfo", file: !133, line: 356, size: 134336, elements: !969)
!969 = !{!970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1004, !1005, !1006, !1007, !1008, !1009, !1011, !1012, !1013, !1014, !1015, !1016, !1027, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1095, !1096, !1097}
!970 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !968, file: !133, line: 359, baseType: !555, size: 32)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !968, file: !133, line: 362, baseType: !558, size: 32, offset: 32)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "temporary", scope: !968, file: !133, line: 365, baseType: !506, size: 32, offset: 64)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "adjoin", scope: !968, file: !133, line: 366, baseType: !506, size: 32, offset: 96)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "affirm", scope: !968, file: !133, line: 367, baseType: !506, size: 32, offset: 128)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "antialias", scope: !968, file: !133, line: 368, baseType: !506, size: 32, offset: 160)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !968, file: !133, line: 371, baseType: !501, size: 64, offset: 192)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "extract", scope: !968, file: !133, line: 372, baseType: !501, size: 64, offset: 256)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !968, file: !133, line: 373, baseType: !501, size: 64, offset: 320)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "scenes", scope: !968, file: !133, line: 374, baseType: !501, size: 64, offset: 384)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !968, file: !133, line: 377, baseType: !484, size: 64, offset: 448)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "number_scenes", scope: !968, file: !133, line: 378, baseType: !484, size: 64, offset: 512)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !968, file: !133, line: 379, baseType: !484, size: 64, offset: 576)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "interlace", scope: !968, file: !133, line: 382, baseType: !614, size: 32, offset: 640)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !968, file: !133, line: 385, baseType: !616, size: 32, offset: 672)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !968, file: !133, line: 388, baseType: !598, size: 32, offset: 704)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !968, file: !133, line: 391, baseType: !484, size: 64, offset: 768)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "sampling_factor", scope: !968, file: !133, line: 394, baseType: !501, size: 64, offset: 832)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "server_name", scope: !968, file: !133, line: 395, baseType: !501, size: 64, offset: 896)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "font", scope: !968, file: !133, line: 396, baseType: !501, size: 64, offset: 960)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "texture", scope: !968, file: !133, line: 397, baseType: !501, size: 64, offset: 1024)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "density", scope: !968, file: !133, line: 398, baseType: !501, size: 64, offset: 1088)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "pointsize", scope: !968, file: !133, line: 401, baseType: !540, size: 64, offset: 1152)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !968, file: !133, line: 402, baseType: !540, size: 64, offset: 1216)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "background_color", scope: !968, file: !133, line: 405, baseType: !567, size: 64, offset: 1280)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !968, file: !133, line: 406, baseType: !567, size: 64, offset: 1344)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "matte_color", scope: !968, file: !133, line: 407, baseType: !567, size: 64, offset: 1408)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !968, file: !133, line: 410, baseType: !506, size: 32, offset: 1472)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "monochrome", scope: !968, file: !133, line: 411, baseType: !506, size: 32, offset: 1504)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !968, file: !133, line: 414, baseType: !484, size: 64, offset: 1536)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !968, file: !133, line: 417, baseType: !553, size: 32, offset: 1600)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !968, file: !133, line: 420, baseType: !716, size: 32, offset: 1632)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "preview_type", scope: !968, file: !133, line: 423, baseType: !1003, size: 32, offset: 1664)
!1003 = !DIDerivedType(tag: DW_TAG_typedef, name: "PreviewType", file: !217, line: 59, baseType: !216)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !968, file: !133, line: 426, baseType: !524, size: 64, offset: 1728)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "ping", scope: !968, file: !133, line: 429, baseType: !506, size: 32, offset: 1792)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !968, file: !133, line: 430, baseType: !506, size: 32, offset: 1824)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !968, file: !133, line: 433, baseType: !501, size: 64, offset: 1856)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "authenticate", scope: !968, file: !133, line: 434, baseType: !501, size: 64, offset: 1920)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !968, file: !133, line: 437, baseType: !1010, size: 32, offset: 1984)
!1010 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChannelType", file: !78, line: 202, baseType: !249)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !968, file: !133, line: 440, baseType: !546, size: 64, offset: 2048)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !968, file: !133, line: 443, baseType: !504, size: 64, offset: 2112)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !968, file: !133, line: 446, baseType: !655, size: 64, offset: 2176)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !968, file: !133, line: 449, baseType: !504, size: 64, offset: 2240)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !968, file: !133, line: 450, baseType: !504, size: 64, offset: 2304)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !968, file: !133, line: 453, baseType: !1017, size: 64, offset: 2368)
!1017 = !DIDerivedType(tag: DW_TAG_typedef, name: "StreamHandler", file: !1018, line: 26, baseType: !1019)
!1018 = !DIFile(filename: "./magick/stream.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!1019 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1020, size: 64)
!1020 = !DISubroutineType(types: !1021)
!1021 = !{!484, !1022, !1024, !1026}
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 64)
!1023 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !547)
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 64)
!1025 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1026 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !484)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !968, file: !133, line: 456, baseType: !1028, size: 64, offset: 2432)
!1028 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1029, size: 64)
!1029 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !1030, line: 7, baseType: !1031)
!1030 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!1031 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !1032, line: 49, size: 1728, elements: !1033)
!1032 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!1033 = !{!1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1049, !1051, !1052, !1053, !1055, !1056, !1058, !1062, !1065, !1067, !1070, !1073, !1074, !1075, !1076, !1077}
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1031, file: !1032, line: 51, baseType: !499, size: 32)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1031, file: !1032, line: 54, baseType: !501, size: 64, offset: 64)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1031, file: !1032, line: 55, baseType: !501, size: 64, offset: 128)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1031, file: !1032, line: 56, baseType: !501, size: 64, offset: 192)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1031, file: !1032, line: 57, baseType: !501, size: 64, offset: 256)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1031, file: !1032, line: 58, baseType: !501, size: 64, offset: 320)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1031, file: !1032, line: 59, baseType: !501, size: 64, offset: 384)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1031, file: !1032, line: 60, baseType: !501, size: 64, offset: 448)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !1031, file: !1032, line: 61, baseType: !501, size: 64, offset: 512)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !1031, file: !1032, line: 64, baseType: !501, size: 64, offset: 576)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !1031, file: !1032, line: 65, baseType: !501, size: 64, offset: 640)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !1031, file: !1032, line: 66, baseType: !501, size: 64, offset: 704)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !1031, file: !1032, line: 68, baseType: !1047, size: 64, offset: 768)
!1047 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1048, size: 64)
!1048 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !1032, line: 36, flags: DIFlagFwdDecl)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !1031, file: !1032, line: 70, baseType: !1050, size: 64, offset: 832)
!1050 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1031, size: 64)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !1031, file: !1032, line: 72, baseType: !499, size: 32, offset: 896)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !1031, file: !1032, line: 73, baseType: !499, size: 32, offset: 928)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !1031, file: !1032, line: 74, baseType: !1054, size: 64, offset: 960)
!1054 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !527, line: 152, baseType: !528)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !1031, file: !1032, line: 77, baseType: !572, size: 16, offset: 1024)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !1031, file: !1032, line: 78, baseType: !1057, size: 8, offset: 1040)
!1057 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !1031, file: !1032, line: 79, baseType: !1059, size: 8, offset: 1048)
!1059 = !DICompositeType(tag: DW_TAG_array_type, baseType: !488, size: 8, elements: !1060)
!1060 = !{!1061}
!1061 = !DISubrange(count: 1)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !1031, file: !1032, line: 81, baseType: !1063, size: 64, offset: 1088)
!1063 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1064, size: 64)
!1064 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !1032, line: 43, baseType: null)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !1031, file: !1032, line: 89, baseType: !1066, size: 64, offset: 1152)
!1066 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !527, line: 153, baseType: !528)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !1031, file: !1032, line: 91, baseType: !1068, size: 64, offset: 1216)
!1068 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1069, size: 64)
!1069 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !1032, line: 37, flags: DIFlagFwdDecl)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !1031, file: !1032, line: 92, baseType: !1071, size: 64, offset: 1280)
!1071 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1072, size: 64)
!1072 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !1032, line: 38, flags: DIFlagFwdDecl)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !1031, file: !1032, line: 93, baseType: !1050, size: 64, offset: 1344)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !1031, file: !1032, line: 94, baseType: !504, size: 64, offset: 1408)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !1031, file: !1032, line: 95, baseType: !484, size: 64, offset: 1472)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !1031, file: !1032, line: 96, baseType: !499, size: 32, offset: 1536)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !1031, file: !1032, line: 98, baseType: !1078, size: 160, offset: 1568)
!1078 = !DICompositeType(tag: DW_TAG_array_type, baseType: !488, size: 160, elements: !1079)
!1079 = !{!1080}
!1080 = !DISubrange(count: 20)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !968, file: !133, line: 459, baseType: !504, size: 64, offset: 2496)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !968, file: !133, line: 462, baseType: !484, size: 64, offset: 2560)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !968, file: !133, line: 465, baseType: !487, size: 32768, offset: 2624)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "unique", scope: !968, file: !133, line: 466, baseType: !487, size: 32768, offset: 35392)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "zero", scope: !968, file: !133, line: 467, baseType: !487, size: 32768, offset: 68160)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !968, file: !133, line: 468, baseType: !487, size: 32768, offset: 100928)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !968, file: !133, line: 471, baseType: !506, size: 32, offset: 133696)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "tile", scope: !968, file: !133, line: 474, baseType: !501, size: 64, offset: 133760)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "subimage", scope: !968, file: !133, line: 477, baseType: !484, size: 64, offset: 133824)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "subrange", scope: !968, file: !133, line: 478, baseType: !484, size: 64, offset: 133888)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "pen", scope: !968, file: !133, line: 481, baseType: !567, size: 64, offset: 133952)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !968, file: !133, line: 484, baseType: !484, size: 64, offset: 134016)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_pixel_method", scope: !968, file: !133, line: 487, baseType: !1094, size: 32, offset: 134080)
!1094 = !DIDerivedType(tag: DW_TAG_typedef, name: "VirtualPixelMethod", file: !449, line: 47, baseType: !448)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_color", scope: !968, file: !133, line: 490, baseType: !567, size: 64, offset: 134112)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !968, file: !133, line: 493, baseType: !504, size: 64, offset: 134208)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "synchronize", scope: !968, file: !133, line: 496, baseType: !506, size: 32, offset: 134272)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "quantize_info", scope: !959, file: !960, line: 65, baseType: !1099, size: 64, offset: 32960)
!1099 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1100, size: 64)
!1100 = !DIDerivedType(tag: DW_TAG_typedef, name: "QuantizeInfo", file: !470, line: 57, baseType: !1101)
!1101 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QuantizeInfo", file: !470, line: 35, size: 384, elements: !1102)
!1102 = !{!1103, !1104, !1105, !1106, !1107, !1108, !1109}
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "number_colors", scope: !1101, file: !470, line: 38, baseType: !484, size: 64)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "tree_depth", scope: !1101, file: !470, line: 41, baseType: !484, size: 64, offset: 64)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !1101, file: !470, line: 44, baseType: !506, size: 32, offset: 128)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1101, file: !470, line: 47, baseType: !553, size: 32, offset: 160)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "measure_error", scope: !1101, file: !470, line: 50, baseType: !506, size: 32, offset: 192)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !1101, file: !470, line: 53, baseType: !484, size: 64, offset: 256)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "dither_method", scope: !1101, file: !470, line: 56, baseType: !1110, size: 32, offset: 320)
!1110 = !DIDerivedType(tag: DW_TAG_typedef, name: "DitherMethod", file: !470, line: 33, baseType: !469)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "images", scope: !959, file: !960, line: 68, baseType: !546, size: 64, offset: 33024)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "insert_before", scope: !959, file: !960, line: 71, baseType: !506, size: 32, offset: 33088)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "image_pending", scope: !959, file: !960, line: 72, baseType: !506, size: 32, offset: 33120)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !959, file: !960, line: 73, baseType: !506, size: 32, offset: 33152)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !959, file: !960, line: 76, baseType: !484, size: 64, offset: 33216)
!1116 = !DILocalVariable(name: "wand", arg: 1, scope: !953, file: !1, line: 287, type: !956)
!1117 = !DILocation(line: 287, column: 56, scope: !953)
!1118 = !DILocalVariable(name: "quantum", scope: !953, file: !1, line: 290, type: !660)
!1119 = !DILocation(line: 290, column: 6, scope: !953)
!1120 = !DILocalVariable(name: "exception", scope: !953, file: !1, line: 293, type: !492)
!1121 = !DILocation(line: 293, column: 6, scope: !953)
!1122 = !DILocalVariable(name: "image", scope: !953, file: !1, line: 296, type: !546)
!1123 = !DILocation(line: 296, column: 6, scope: !953)
!1124 = !DILocalVariable(name: "iterator", scope: !953, file: !1, line: 299, type: !478)
!1125 = !DILocation(line: 299, column: 6, scope: !953)
!1126 = !DILocalVariable(name: "depth", scope: !953, file: !1, line: 302, type: !484)
!1127 = !DILocation(line: 302, column: 5, scope: !953)
!1128 = !DILocalVariable(name: "view", scope: !953, file: !1, line: 305, type: !514)
!1129 = !DILocation(line: 305, column: 6, scope: !953)
!1130 = !DILocation(line: 307, column: 8, scope: !953)
!1131 = !DILocation(line: 308, column: 11, scope: !953)
!1132 = !DILocation(line: 308, column: 10, scope: !953)
!1133 = !DILocation(line: 309, column: 7, scope: !1134)
!1134 = distinct !DILexicalBlock(scope: !953, file: !1, line: 309, column: 7)
!1135 = !DILocation(line: 309, column: 13, scope: !1134)
!1136 = !DILocation(line: 309, column: 7, scope: !953)
!1137 = !DILocalVariable(name: "exception", scope: !1138, file: !1, line: 310, type: !493)
!1138 = distinct !DILexicalBlock(scope: !1134, file: !1, line: 310, column: 5)
!1139 = !DILocation(line: 310, column: 5, scope: !1138)
!1140 = !DILocation(line: 312, column: 32, scope: !953)
!1141 = !DILocation(line: 312, column: 9, scope: !953)
!1142 = !DILocation(line: 312, column: 8, scope: !953)
!1143 = !DILocation(line: 313, column: 7, scope: !1144)
!1144 = distinct !DILexicalBlock(scope: !953, file: !1, line: 313, column: 7)
!1145 = !DILocation(line: 313, column: 13, scope: !1144)
!1146 = !DILocation(line: 313, column: 7, scope: !953)
!1147 = !DILocation(line: 314, column: 5, scope: !1144)
!1148 = !DILocation(line: 315, column: 13, scope: !953)
!1149 = !DILocation(line: 315, column: 12, scope: !953)
!1150 = !DILocation(line: 316, column: 32, scope: !953)
!1151 = !DILocation(line: 316, column: 38, scope: !953)
!1152 = !DILocation(line: 316, column: 8, scope: !953)
!1153 = !DILocation(line: 316, column: 7, scope: !953)
!1154 = !DILocation(line: 317, column: 7, scope: !1155)
!1155 = distinct !DILexicalBlock(scope: !953, file: !1, line: 317, column: 7)
!1156 = !DILocation(line: 317, column: 12, scope: !1155)
!1157 = !DILocation(line: 317, column: 7, scope: !953)
!1158 = !DILocation(line: 318, column: 5, scope: !1155)
!1159 = !DILocation(line: 319, column: 30, scope: !953)
!1160 = !DILocation(line: 319, column: 12, scope: !953)
!1161 = !DILocation(line: 319, column: 11, scope: !953)
!1162 = !DILocation(line: 320, column: 7, scope: !1163)
!1163 = distinct !DILexicalBlock(scope: !953, file: !1, line: 320, column: 7)
!1164 = !DILocation(line: 320, column: 16, scope: !1163)
!1165 = !DILocation(line: 320, column: 7, scope: !953)
!1166 = !DILocalVariable(name: "exception", scope: !1167, file: !1, line: 321, type: !493)
!1167 = distinct !DILexicalBlock(scope: !1163, file: !1, line: 321, column: 5)
!1168 = !DILocation(line: 321, column: 5, scope: !1167)
!1169 = !DILocation(line: 323, column: 28, scope: !953)
!1170 = !DILocation(line: 323, column: 10, scope: !953)
!1171 = !DILocation(line: 324, column: 16, scope: !953)
!1172 = !DILocation(line: 324, column: 3, scope: !953)
!1173 = !DILocation(line: 324, column: 13, scope: !953)
!1174 = !DILocation(line: 324, column: 15, scope: !953)
!1175 = !DILocation(line: 325, column: 29, scope: !953)
!1176 = !DILocation(line: 325, column: 39, scope: !953)
!1177 = !DILocation(line: 326, column: 30, scope: !953)
