; ModuleID = 'magick/constitute.c'
source_filename = "magick/constitute.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct._Image = type { i32, i32, i32, i64, i32, i32, i32, i64, i64, i64, i64, %struct._PixelPacket*, %struct._PixelPacket, %struct._PixelPacket, %struct._PixelPacket, double, %struct._ChromaticityInfo, i32, i8*, i32, i8*, i8*, i8*, i64, double, double, %struct._RectangleInfo, %struct._RectangleInfo, %struct._RectangleInfo, double, double, double, i32, i32, i32, i32, i32, i32, %struct._Image*, i64, i64, i64, i64, i64, i64, %struct._ErrorInfo, %struct._TimerInfo, i32 (i8*, i64, i64, i8*)*, i8*, i8*, i8*, %struct._Ascii85Info*, %struct._BlobInfo*, [4096 x i8], [4096 x i8], [4096 x i8], i64, i64, %struct._ExceptionInfo, i32, i64, %struct.SemaphoreInfo*, %struct._ProfileInfo, %struct._ProfileInfo, %struct._ProfileInfo*, i64, i64, %struct._Image*, %struct._Image*, %struct._Image*, i32, i32, %struct._PixelPacket, %struct._Image*, %struct._RectangleInfo, i8*, i8*, i32, i32, i64, i32, i64, i64, i32, i64 }

!561 = !{!562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633}
!562 = !DIEnumerator(name: "MagickUndefinedOptions", value: -1)
!563 = !DIEnumerator(name: "MagickAlignOptions", value: 0)
!564 = !DIEnumerator(name: "MagickAlphaOptions", value: 1)
!565 = !DIEnumerator(name: "MagickBooleanOptions", value: 2)
!566 = !DIEnumerator(name: "MagickCacheOptions", value: 3)
!567 = !DIEnumerator(name: "MagickChannelOptions", value: 4)
!568 = !DIEnumerator(name: "MagickClassOptions", value: 5)
!569 = !DIEnumerator(name: "MagickClipPathOptions", value: 6)
!570 = !DIEnumerator(name: "MagickCoderOptions", value: 7)
!571 = !DIEnumerator(name: "MagickColorOptions", value: 8)
!572 = !DIEnumerator(name: "MagickColorspaceOptions", value: 9)
!573 = !DIEnumerator(name: "MagickCommandOptions", value: 10)
!574 = !DIEnumerator(name: "MagickComposeOptions", value: 11)
!575 = !DIEnumerator(name: "MagickCompressOptions", value: 12)
!576 = !DIEnumerator(name: "MagickConfigureOptions", value: 13)
!577 = !DIEnumerator(name: "MagickDataTypeOptions", value: 14)
!578 = !DIEnumerator(name: "MagickDebugOptions", value: 15)
!579 = !DIEnumerator(name: "MagickDecorateOptions", value: 16)
!580 = !DIEnumerator(name: "MagickDelegateOptions", value: 17)
!581 = !DIEnumerator(name: "MagickDirectionOptions", value: 18)
!582 = !DIEnumerator(name: "MagickDisposeOptions", value: 19)
!583 = !DIEnumerator(name: "MagickDistortOptions", value: 20)
!584 = !DIEnumerator(name: "MagickDitherOptions", value: 21)
!585 = !DIEnumerator(name: "MagickEndianOptions", value: 22)
!586 = !DIEnumerator(name: "MagickEvaluateOptions", value: 23)
!587 = !DIEnumerator(name: "MagickFillRuleOptions", value: 24)
!588 = !DIEnumerator(name: "MagickFilterOptions", value: 25)
!589 = !DIEnumerator(name: "MagickFontOptions", value: 26)
!590 = !DIEnumerator(name: "MagickFontsOptions", value: 27)
!591 = !DIEnumerator(name: "MagickFormatOptions", value: 28)
!592 = !DIEnumerator(name: "MagickFunctionOptions", value: 29)
!593 = !DIEnumerator(name: "MagickGravityOptions", value: 30)
!594 = !DIEnumerator(name: "MagickIntentOptions", value: 31)
!595 = !DIEnumerator(name: "MagickInterlaceOptions", value: 32)
!596 = !DIEnumerator(name: "MagickInterpolateOptions", value: 33)
!597 = !DIEnumerator(name: "MagickKernelOptions", value: 34)
!598 = !DIEnumerator(name: "MagickLayerOptions", value: 35)
!599 = !DIEnumerator(name: "MagickLineCapOptions", value: 36)
!600 = !DIEnumerator(name: "MagickLineJoinOptions", value: 37)
!601 = !DIEnumerator(name: "MagickListOptions", value: 38)
!602 = !DIEnumerator(name: "MagickLocaleOptions", value: 39)
!603 = !DIEnumerator(name: "MagickLogEventOptions", value: 40)
!604 = !DIEnumerator(name: "MagickLogOptions", value: 41)
!605 = !DIEnumerator(name: "MagickMagicOptions", value: 42)
!606 = !DIEnumerator(name: "MagickMethodOptions", value: 43)
!607 = !DIEnumerator(name: "MagickMetricOptions", value: 44)
!608 = !DIEnumerator(name: "MagickMimeOptions", value: 45)
!609 = !DIEnumerator(name: "MagickModeOptions", value: 46)
!610 = !DIEnumerator(name: "MagickModuleOptions", value: 47)
!611 = !DIEnumerator(name: "MagickMorphologyOptions", value: 48)
!612 = !DIEnumerator(name: "MagickNoiseOptions", value: 49)
!613 = !DIEnumerator(name: "MagickOrientationOptions", value: 50)
!614 = !DIEnumerator(name: "MagickPixelIntensityOptions", value: 51)
!615 = !DIEnumerator(name: "MagickPolicyOptions", value: 52)
!616 = !DIEnumerator(name: "MagickPolicyDomainOptions", value: 53)
!617 = !DIEnumerator(name: "MagickPolicyRightsOptions", value: 54)
!618 = !DIEnumerator(name: "MagickPreviewOptions", value: 55)
!619 = !DIEnumerator(name: "MagickPrimitiveOptions", value: 56)
!620 = !DIEnumerator(name: "MagickQuantumFormatOptions", value: 57)
!621 = !DIEnumerator(name: "MagickResolutionOptions", value: 58)
!622 = !DIEnumerator(name: "MagickResourceOptions", value: 59)
!623 = !DIEnumerator(name: "MagickSparseColorOptions", value: 60)
!624 = !DIEnumerator(name: "MagickStatisticOptions", value: 61)
!625 = !DIEnumerator(name: "MagickStorageOptions", value: 62)
!626 = !DIEnumerator(name: "MagickStretchOptions", value: 63)
!627 = !DIEnumerator(name: "MagickStyleOptions", value: 64)
!628 = !DIEnumerator(name: "MagickThresholdOptions", value: 65)
!629 = !DIEnumerator(name: "MagickTypeOptions", value: 66)
!630 = !DIEnumerator(name: "MagickValidateOptions", value: 67)
!631 = !DIEnumerator(name: "MagickVirtualPixelOptions", value: 68)
!632 = !DIEnumerator(name: "MagickComplexOptions", value: 69)
!633 = !DIEnumerator(name: "MagickIntensityOptions", value: 70)
!634 = !{!635, !636, !748, !709, !560, !697, !988, !650, !1000, !1036, !643, !665, !816, !907, !1055, !656, !778, !811, !871, !1008, !1065, !5, !1066}
!635 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 64)
!637 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageInfo", file: !4, line: 223, baseType: !638)
!638 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ImageInfo", file: !73, line: 356, size: 134336, elements: !639)
!639 = !{!640, !642, !644, !646, !647, !648, !649, !652, !653, !654, !655, !658, !659, !660, !662, !664, !666, !667, !668, !669, !670, !671, !672, !674, !675, !685, !686, !687, !688, !689, !690, !692, !694, !696, !702, !703, !704, !705, !706, !708, !902, !903, !904, !905, !906, !917, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !985, !986, !987}
!640 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !638, file: !73, line: 359, baseType: !641, size: 32)
!641 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompressionType", file: !48, line: 49, baseType: !47)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !638, file: !73, line: 362, baseType: !643, size: 32, offset: 32)
!643 = !DIDerivedType(tag: DW_TAG_typedef, name: "OrientationType", file: !73, line: 86, baseType: !72)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "temporary", scope: !638, file: !73, line: 365, baseType: !645, size: 32, offset: 64)
!645 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickBooleanType", file: !4, line: 215, baseType: !84)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "adjoin", scope: !638, file: !73, line: 366, baseType: !645, size: 32, offset: 96)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "affirm", scope: !638, file: !73, line: 367, baseType: !645, size: 32, offset: 128)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "antialias", scope: !638, file: !73, line: 368, baseType: !645, size: 32, offset: 160)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !638, file: !73, line: 371, baseType: !650, size: 64, offset: 192)
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 64)
!651 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "extract", scope: !638, file: !73, line: 372, baseType: !650, size: 64, offset: 256)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !638, file: !73, line: 373, baseType: !650, size: 64, offset: 320)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "scenes", scope: !638, file: !73, line: 374, baseType: !650, size: 64, offset: 384)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !638, file: !73, line: 377, baseType: !656, size: 64, offset: 448)
!656 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !657, line: 46, baseType: !635)
!657 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!658 = !DIDerivedType(tag: DW_TAG_member, name: "number_scenes", scope: !638, file: !73, line: 378, baseType: !656, size: 64, offset: 512)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !638, file: !73, line: 379, baseType: !656, size: 64, offset: 576)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "interlace", scope: !638, file: !73, line: 382, baseType: !661, size: 32, offset: 640)
!661 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterlaceType", file: !73, line: 73, baseType: !136)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !638, file: !73, line: 385, baseType: !663, size: 32, offset: 672)
!663 = !DIDerivedType(tag: DW_TAG_typedef, name: "EndianType", file: !147, line: 35, baseType: !146)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !638, file: !73, line: 388, baseType: !665, size: 32, offset: 704)
!665 = !DIDerivedType(tag: DW_TAG_typedef, name: "ResolutionType", file: !73, line: 93, baseType: !96)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !638, file: !73, line: 391, baseType: !656, size: 64, offset: 768)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "sampling_factor", scope: !638, file: !73, line: 394, baseType: !650, size: 64, offset: 832)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "server_name", scope: !638, file: !73, line: 395, baseType: !650, size: 64, offset: 896)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "font", scope: !638, file: !73, line: 396, baseType: !650, size: 64, offset: 960)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "texture", scope: !638, file: !73, line: 397, baseType: !650, size: 64, offset: 1024)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "density", scope: !638, file: !73, line: 398, baseType: !650, size: 64, offset: 1088)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "pointsize", scope: !638, file: !73, line: 401, baseType: !673, size: 64, offset: 1152)
!673 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !638, file: !73, line: 402, baseType: !673, size: 64, offset: 1216)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "background_color", scope: !638, file: !73, line: 405, baseType: !676, size: 64, offset: 1280)
!676 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelPacket", file: !326, line: 148, baseType: !677)
!677 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PixelPacket", file: !326, line: 131, size: 64, elements: !678)
!678 = !{!679, !682, !683, !684}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !677, file: !326, line: 143, baseType: !680, size: 16)
!680 = !DIDerivedType(tag: DW_TAG_typedef, name: "Quantum", file: !4, line: 93, baseType: !681)
!681 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !677, file: !326, line: 144, baseType: !680, size: 16, offset: 16)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !677, file: !326, line: 145, baseType: !680, size: 16, offset: 32)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !677, file: !326, line: 146, baseType: !680, size: 16, offset: 48)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !638, file: !73, line: 406, baseType: !676, size: 64, offset: 1344)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "matte_color", scope: !638, file: !73, line: 407, baseType: !676, size: 64, offset: 1408)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !638, file: !73, line: 410, baseType: !645, size: 32, offset: 1472)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "monochrome", scope: !638, file: !73, line: 411, baseType: !645, size: 32, offset: 1504)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !638, file: !73, line: 414, baseType: !656, size: 64, offset: 1536)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !638, file: !73, line: 417, baseType: !691, size: 32, offset: 1600)
!691 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorspaceType", file: !11, line: 61, baseType: !10)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !638, file: !73, line: 420, baseType: !693, size: 32, offset: 1632)
!693 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageType", file: !73, line: 61, baseType: !342)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "preview_type", scope: !638, file: !73, line: 423, baseType: !695, size: 32, offset: 1664)
!695 = !DIDerivedType(tag: DW_TAG_typedef, name: "PreviewType", file: !405, line: 59, baseType: !404)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !638, file: !73, line: 426, baseType: !697, size: 64, offset: 1728)
!697 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !698, line: 77, baseType: !699)
!698 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!699 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !700, line: 193, baseType: !701)
!700 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!701 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "ping", scope: !638, file: !73, line: 429, baseType: !645, size: 32, offset: 1792)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !638, file: !73, line: 430, baseType: !645, size: 32, offset: 1824)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !638, file: !73, line: 433, baseType: !650, size: 64, offset: 1856)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "authenticate", scope: !638, file: !73, line: 434, baseType: !650, size: 64, offset: 1920)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !638, file: !73, line: 437, baseType: !707, size: 32, offset: 1984)
!707 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChannelType", file: !4, line: 202, baseType: !437)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !638, file: !73, line: 440, baseType: !709, size: 64, offset: 2048)
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 64)
!710 = !DIDerivedType(tag: DW_TAG_typedef, name: "Image", file: !4, line: 221, baseType: !711)
!711 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Image", file: !73, line: 150, size: 105920, elements: !712)
!712 = !{!713, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !727, !728, !729, !730, !731, !745, !747, !749, !750, !751, !752, !753, !754, !755, !756, !764, !765, !766, !767, !768, !769, !771, !772, !773, !775, !777, !779, !781, !782, !783, !784, !785, !786, !787, !795, !810, !824, !825, !826, !827, !831, !835, !839, !840, !841, !842, !843, !860, !861, !863, !864, !874, !875, !877, !878, !879, !880, !881, !882, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !899, !901}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "storage_class", scope: !711, file: !73, line: 153, baseType: !714, size: 32)
!714 = !DIDerivedType(tag: DW_TAG_typedef, name: "ClassType", file: !4, line: 209, baseType: !3)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !711, file: !73, line: 156, baseType: !691, size: 32, offset: 32)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !711, file: !73, line: 159, baseType: !641, size: 32, offset: 64)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !711, file: !73, line: 162, baseType: !656, size: 64, offset: 128)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !711, file: !73, line: 165, baseType: !643, size: 32, offset: 192)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "taint", scope: !711, file: !73, line: 168, baseType: !645, size: 32, offset: 224)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "matte", scope: !711, file: !73, line: 169, baseType: !645, size: 32, offset: 256)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !711, file: !73, line: 172, baseType: !656, size: 64, offset: 320)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !711, file: !73, line: 173, baseType: !656, size: 64, offset: 384)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !711, file: !73, line: 174, baseType: !656, size: 64, offset: 448)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !711, file: !73, line: 175, baseType: !656, size: 64, offset: 512)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "colormap", scope: !711, file: !73, line: 178, baseType: !726, size: 64, offset: 576)
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !676, size: 64)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "background_color", scope: !711, file: !73, line: 179, baseType: !676, size: 64, offset: 640)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !711, file: !73, line: 180, baseType: !676, size: 64, offset: 704)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "matte_color", scope: !711, file: !73, line: 181, baseType: !676, size: 64, offset: 768)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !711, file: !73, line: 184, baseType: !673, size: 64, offset: 832)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "chromaticity", scope: !711, file: !73, line: 187, baseType: !732, size: 768, offset: 896)
!732 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChromaticityInfo", file: !73, line: 128, baseType: !733)
!733 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ChromaticityInfo", file: !73, line: 121, size: 768, elements: !734)
!734 = !{!735, !742, !743, !744}
!735 = !DIDerivedType(tag: DW_TAG_member, name: "red_primary", scope: !733, file: !73, line: 124, baseType: !736, size: 192)
!736 = !DIDerivedType(tag: DW_TAG_typedef, name: "PrimaryInfo", file: !73, line: 101, baseType: !737)
!737 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PrimaryInfo", file: !73, line: 95, size: 192, elements: !738)
!738 = !{!739, !740, !741}
!739 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !737, file: !73, line: 98, baseType: !673, size: 64)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !737, file: !73, line: 99, baseType: !673, size: 64, offset: 64)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !737, file: !73, line: 100, baseType: !673, size: 64, offset: 128)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "green_primary", scope: !733, file: !73, line: 125, baseType: !736, size: 192, offset: 192)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "blue_primary", scope: !733, file: !73, line: 126, baseType: !736, size: 192, offset: 384)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "white_point", scope: !733, file: !73, line: 127, baseType: !736, size: 192, offset: 576)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "rendering_intent", scope: !711, file: !73, line: 190, baseType: !746, size: 32, offset: 1664)
!746 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderingIntent", file: !89, line: 49, baseType: !88)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !711, file: !73, line: 193, baseType: !748, size: 64, offset: 1728)
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !711, file: !73, line: 196, baseType: !665, size: 32, offset: 1792)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "montage", scope: !711, file: !73, line: 199, baseType: !650, size: 64, offset: 1856)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "directory", scope: !711, file: !73, line: 200, baseType: !650, size: 64, offset: 1920)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "geometry", scope: !711, file: !73, line: 201, baseType: !650, size: 64, offset: 1984)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !711, file: !73, line: 204, baseType: !697, size: 64, offset: 2048)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "x_resolution", scope: !711, file: !73, line: 207, baseType: !673, size: 64, offset: 2112)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "y_resolution", scope: !711, file: !73, line: 208, baseType: !673, size: 64, offset: 2176)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !711, file: !73, line: 211, baseType: !757, size: 256, offset: 2240)
!757 = !DIDerivedType(tag: DW_TAG_typedef, name: "RectangleInfo", file: !153, line: 130, baseType: !758)
!758 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_RectangleInfo", file: !153, line: 121, size: 256, elements: !759)
!759 = !{!760, !761, !762, !763}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !758, file: !153, line: 124, baseType: !656, size: 64)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !758, file: !153, line: 125, baseType: !656, size: 64, offset: 64)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !758, file: !153, line: 128, baseType: !697, size: 64, offset: 128)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !758, file: !153, line: 129, baseType: !697, size: 64, offset: 192)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "extract_info", scope: !711, file: !73, line: 212, baseType: !757, size: 256, offset: 2496)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "tile_info", scope: !711, file: !73, line: 213, baseType: !757, size: 256, offset: 2752)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "bias", scope: !711, file: !73, line: 216, baseType: !673, size: 64, offset: 3008)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "blur", scope: !711, file: !73, line: 217, baseType: !673, size: 64, offset: 3072)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !711, file: !73, line: 218, baseType: !673, size: 64, offset: 3136)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !711, file: !73, line: 221, baseType: !770, size: 32, offset: 3200)
!770 = !DIDerivedType(tag: DW_TAG_typedef, name: "FilterTypes", file: !102, line: 66, baseType: !101)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "interlace", scope: !711, file: !73, line: 224, baseType: !661, size: 32, offset: 3232)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !711, file: !73, line: 227, baseType: !663, size: 32, offset: 3264)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !711, file: !73, line: 230, baseType: !774, size: 32, offset: 3296)
!774 = !DIDerivedType(tag: DW_TAG_typedef, name: "GravityType", file: !153, line: 91, baseType: !152)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !711, file: !73, line: 233, baseType: !776, size: 32, offset: 3328)
!776 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompositeOperator", file: !168, line: 99, baseType: !167)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "dispose", scope: !711, file: !73, line: 236, baseType: !778, size: 32, offset: 3360)
!778 = !DIDerivedType(tag: DW_TAG_typedef, name: "DisposeType", file: !239, line: 32, baseType: !238)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "clip_mask", scope: !711, file: !73, line: 239, baseType: !780, size: 64, offset: 3392)
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 64)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !711, file: !73, line: 242, baseType: !656, size: 64, offset: 3456)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !711, file: !73, line: 243, baseType: !656, size: 64, offset: 3520)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_second", scope: !711, file: !73, line: 246, baseType: !697, size: 64, offset: 3584)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "iterations", scope: !711, file: !73, line: 249, baseType: !656, size: 64, offset: 3648)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "total_colors", scope: !711, file: !73, line: 250, baseType: !656, size: 64, offset: 3712)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "start_loop", scope: !711, file: !73, line: 253, baseType: !697, size: 64, offset: 3776)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !711, file: !73, line: 256, baseType: !788, size: 192, offset: 3840)
!788 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErrorInfo", file: !789, line: 68, baseType: !790)
!789 = !DIFile(filename: "./magick/color.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!790 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ErrorInfo", file: !789, line: 62, size: 192, elements: !791)
!791 = !{!792, !793, !794}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "mean_error_per_pixel", scope: !790, file: !789, line: 65, baseType: !673, size: 64)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_mean_error", scope: !790, file: !789, line: 66, baseType: !673, size: 64, offset: 64)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_maximum_error", scope: !790, file: !789, line: 67, baseType: !673, size: 64, offset: 128)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !711, file: !73, line: 259, baseType: !796, size: 512, offset: 4032)
!796 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerInfo", file: !247, line: 51, baseType: !797)
!797 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TimerInfo", file: !247, line: 40, size: 512, elements: !798)
!798 = !{!799, !806, !807, !809}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !797, file: !247, line: 43, baseType: !800, size: 192)
!800 = !DIDerivedType(tag: DW_TAG_typedef, name: "Timer", file: !247, line: 38, baseType: !801)
!801 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Timer", file: !247, line: 32, size: 192, elements: !802)
!802 = !{!803, !804, !805}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !801, file: !247, line: 35, baseType: !673, size: 64)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !801, file: !247, line: 36, baseType: !673, size: 64, offset: 64)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !801, file: !247, line: 37, baseType: !673, size: 64, offset: 128)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "elapsed", scope: !797, file: !247, line: 44, baseType: !800, size: 192, offset: 192)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !797, file: !247, line: 47, baseType: !808, size: 32, offset: 384)
!808 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerState", file: !247, line: 30, baseType: !246)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !797, file: !247, line: 50, baseType: !656, size: 64, offset: 448)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !711, file: !73, line: 262, baseType: !811, size: 64, offset: 4544)
!811 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickProgressMonitor", file: !812, line: 26, baseType: !813)
!812 = !DIFile(filename: "./magick/monitor.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 64)
!814 = !DISubroutineType(types: !815)
!815 = !{!645, !816, !818, !821, !748}
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 64)
!817 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !651)
!818 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !819)
!819 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickOffsetType", file: !4, line: 150, baseType: !820)
!820 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!821 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !822)
!822 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickSizeType", file: !4, line: 151, baseType: !823)
!823 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !711, file: !73, line: 265, baseType: !748, size: 64, offset: 4608)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !711, file: !73, line: 266, baseType: !748, size: 64, offset: 4672)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !711, file: !73, line: 267, baseType: !748, size: 64, offset: 4736)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "ascii85", scope: !711, file: !73, line: 270, baseType: !828, size: 64, offset: 4800)
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !829, size: 64)
!829 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ascii85Info", file: !48, line: 52, baseType: !830)
!830 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Ascii85Info", file: !48, line: 51, flags: DIFlagFwdDecl)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !711, file: !73, line: 273, baseType: !832, size: 64, offset: 4864)
!832 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !833, size: 64)
!833 = !DIDerivedType(tag: DW_TAG_typedef, name: "BlobInfo", file: !4, line: 217, baseType: !834)
!834 = !DICompositeType(tag: DW_TAG_structure_type, name: "_BlobInfo", file: !4, line: 217, flags: DIFlagFwdDecl)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !711, file: !73, line: 276, baseType: !836, size: 32768, offset: 4928)
!836 = !DICompositeType(tag: DW_TAG_array_type, baseType: !651, size: 32768, elements: !837)
!837 = !{!838}
!838 = !DISubrange(count: 4096)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "magick_filename", scope: !711, file: !73, line: 277, baseType: !836, size: 32768, offset: 37696)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !711, file: !73, line: 278, baseType: !836, size: 32768, offset: 70464)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "magick_columns", scope: !711, file: !73, line: 281, baseType: !656, size: 64, offset: 103232)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "magick_rows", scope: !711, file: !73, line: 282, baseType: !656, size: 64, offset: 103296)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "exception", scope: !711, file: !73, line: 285, baseType: !844, size: 448, offset: 103360)
!844 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionInfo", file: !4, line: 219, baseType: !845)
!845 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ExceptionInfo", file: !253, line: 102, size: 448, elements: !846)
!846 = !{!847, !849, !850, !851, !852, !853, !854, !859}
!847 = !DIDerivedType(tag: DW_TAG_member, name: "severity", scope: !845, file: !253, line: 105, baseType: !848, size: 32)
!848 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionType", file: !253, line: 100, baseType: !252)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "error_number", scope: !845, file: !253, line: 108, baseType: !560, size: 32, offset: 32)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !845, file: !253, line: 111, baseType: !650, size: 64, offset: 64)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !845, file: !253, line: 112, baseType: !650, size: 64, offset: 128)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "exceptions", scope: !845, file: !253, line: 115, baseType: !748, size: 64, offset: 192)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "relinquish", scope: !845, file: !253, line: 118, baseType: !645, size: 32, offset: 256)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !845, file: !253, line: 121, baseType: !855, size: 64, offset: 320)
!855 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !856, size: 64)
!856 = !DIDerivedType(tag: DW_TAG_typedef, name: "SemaphoreInfo", file: !857, line: 26, baseType: !858)
!857 = !DIFile(filename: "./magick/semaphore.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!858 = !DICompositeType(tag: DW_TAG_structure_type, name: "SemaphoreInfo", file: !857, line: 25, flags: DIFlagFwdDecl)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !845, file: !253, line: 124, baseType: !656, size: 64, offset: 384)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !711, file: !73, line: 288, baseType: !645, size: 32, offset: 103808)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !711, file: !73, line: 291, baseType: !862, size: 64, offset: 103872)
!862 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !697)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !711, file: !73, line: 294, baseType: !855, size: 64, offset: 103936)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "color_profile", scope: !711, file: !73, line: 297, baseType: !865, size: 256, offset: 104000)
!865 = !DIDerivedType(tag: DW_TAG_typedef, name: "ProfileInfo", file: !89, line: 40, baseType: !866)
!866 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ProfileInfo", file: !89, line: 27, size: 256, elements: !867)
!867 = !{!868, !869, !870, !873}
!868 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !866, file: !89, line: 30, baseType: !650, size: 64)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !866, file: !89, line: 33, baseType: !656, size: 64, offset: 64)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !866, file: !89, line: 36, baseType: !871, size: 64, offset: 128)
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 64)
!872 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !866, file: !89, line: 39, baseType: !656, size: 64, offset: 192)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "iptc_profile", scope: !711, file: !73, line: 298, baseType: !865, size: 256, offset: 104256)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profile", scope: !711, file: !73, line: 299, baseType: !876, size: 64, offset: 104512)
!876 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !865, size: 64)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profiles", scope: !711, file: !73, line: 302, baseType: !656, size: 64, offset: 104576)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !711, file: !73, line: 305, baseType: !656, size: 64, offset: 104640)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !711, file: !73, line: 308, baseType: !780, size: 64, offset: 104704)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !711, file: !73, line: 309, baseType: !780, size: 64, offset: 104768)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !711, file: !73, line: 310, baseType: !780, size: 64, offset: 104832)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "interpolate", scope: !711, file: !73, line: 313, baseType: !883, size: 32, offset: 104896)
!883 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterpolatePixelMethod", file: !326, line: 47, baseType: !325)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "black_point_compensation", scope: !711, file: !73, line: 316, baseType: !645, size: 32, offset: 104928)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_color", scope: !711, file: !73, line: 319, baseType: !676, size: 64, offset: 104960)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !711, file: !73, line: 322, baseType: !780, size: 64, offset: 105024)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "tile_offset", scope: !711, file: !73, line: 325, baseType: !757, size: 256, offset: 105088)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !711, file: !73, line: 328, baseType: !748, size: 64, offset: 105344)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "artifacts", scope: !711, file: !73, line: 329, baseType: !748, size: 64, offset: 105408)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !711, file: !73, line: 332, baseType: !693, size: 32, offset: 105472)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !711, file: !73, line: 335, baseType: !645, size: 32, offset: 105504)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !711, file: !73, line: 338, baseType: !822, size: 64, offset: 105536)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "ping", scope: !711, file: !73, line: 341, baseType: !645, size: 32, offset: 105600)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !711, file: !73, line: 344, baseType: !656, size: 64, offset: 105664)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !711, file: !73, line: 347, baseType: !896, size: 64, offset: 105728)
!896 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !897, line: 7, baseType: !898)
!897 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "")
!898 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !700, line: 160, baseType: !701)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "intensity", scope: !711, file: !73, line: 350, baseType: !900, size: 32, offset: 105792)
!900 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelIntensityMethod", file: !326, line: 79, baseType: !356)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !711, file: !73, line: 353, baseType: !656, size: 64, offset: 105856)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !638, file: !73, line: 443, baseType: !748, size: 64, offset: 2112)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !638, file: !73, line: 446, baseType: !811, size: 64, offset: 2176)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !638, file: !73, line: 449, baseType: !748, size: 64, offset: 2240)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !638, file: !73, line: 450, baseType: !748, size: 64, offset: 2304)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !638, file: !73, line: 453, baseType: !907, size: 64, offset: 2368)
!907 = !DIDerivedType(tag: DW_TAG_typedef, name: "StreamHandler", file: !908, line: 26, baseType: !909)
!908 = !DIFile(filename: "./magick/stream.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 64)
!910 = !DISubroutineType(types: !911)
!911 = !{!656, !912, !914, !916}
!912 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !913, size: 64)
!913 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !710)
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !915, size: 64)
!915 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!916 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !656)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !638, file: !73, line: 456, baseType: !918, size: 64, offset: 2432)
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !919, size: 64)
!919 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !920, line: 7, baseType: !921)
!920 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!921 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !922, line: 49, size: 1728, elements: !923)
!922 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!923 = !{!924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !939, !941, !942, !943, !945, !946, !948, !952, !955, !957, !960, !963, !964, !965, !966, !967}
!924 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !921, file: !922, line: 51, baseType: !560, size: 32)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !921, file: !922, line: 54, baseType: !650, size: 64, offset: 64)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !921, file: !922, line: 55, baseType: !650, size: 64, offset: 128)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !921, file: !922, line: 56, baseType: !650, size: 64, offset: 192)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !921, file: !922, line: 57, baseType: !650, size: 64, offset: 256)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !921, file: !922, line: 58, baseType: !650, size: 64, offset: 320)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !921, file: !922, line: 59, baseType: !650, size: 64, offset: 384)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !921, file: !922, line: 60, baseType: !650, size: 64, offset: 448)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !921, file: !922, line: 61, baseType: !650, size: 64, offset: 512)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !921, file: !922, line: 64, baseType: !650, size: 64, offset: 576)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !921, file: !922, line: 65, baseType: !650, size: 64, offset: 640)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !921, file: !922, line: 66, baseType: !650, size: 64, offset: 704)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !921, file: !922, line: 68, baseType: !937, size: 64, offset: 768)
!937 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !938, size: 64)
!938 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !922, line: 36, flags: DIFlagFwdDecl)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !921, file: !922, line: 70, baseType: !940, size: 64, offset: 832)
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !921, size: 64)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !921, file: !922, line: 72, baseType: !560, size: 32, offset: 896)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !921, file: !922, line: 73, baseType: !560, size: 32, offset: 928)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !921, file: !922, line: 74, baseType: !944, size: 64, offset: 960)
!944 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !700, line: 152, baseType: !701)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !921, file: !922, line: 77, baseType: !681, size: 16, offset: 1024)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !921, file: !922, line: 78, baseType: !947, size: 8, offset: 1040)
!947 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !921, file: !922, line: 79, baseType: !949, size: 8, offset: 1048)
!949 = !DICompositeType(tag: DW_TAG_array_type, baseType: !651, size: 8, elements: !950)
!950 = !{!951}
!951 = !DISubrange(count: 1)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !921, file: !922, line: 81, baseType: !953, size: 64, offset: 1088)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64)
!954 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !922, line: 43, baseType: null)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !921, file: !922, line: 89, baseType: !956, size: 64, offset: 1152)
!956 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !700, line: 153, baseType: !701)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !921, file: !922, line: 91, baseType: !958, size: 64, offset: 1216)
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64)
!959 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !922, line: 37, flags: DIFlagFwdDecl)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !921, file: !922, line: 92, baseType: !961, size: 64, offset: 1280)
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 64)
!962 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !922, line: 38, flags: DIFlagFwdDecl)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !921, file: !922, line: 93, baseType: !940, size: 64, offset: 1344)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !921, file: !922, line: 94, baseType: !748, size: 64, offset: 1408)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !921, file: !922, line: 95, baseType: !656, size: 64, offset: 1472)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !921, file: !922, line: 96, baseType: !560, size: 32, offset: 1536)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !921, file: !922, line: 98, baseType: !968, size: 160, offset: 1568)
!968 = !DICompositeType(tag: DW_TAG_array_type, baseType: !651, size: 160, elements: !969)
!969 = !{!970}
!970 = !DISubrange(count: 20)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !638, file: !73, line: 459, baseType: !748, size: 64, offset: 2496)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !638, file: !73, line: 462, baseType: !656, size: 64, offset: 2560)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !638, file: !73, line: 465, baseType: !836, size: 32768, offset: 2624)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "unique", scope: !638, file: !73, line: 466, baseType: !836, size: 32768, offset: 35392)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "zero", scope: !638, file: !73, line: 467, baseType: !836, size: 32768, offset: 68160)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !638, file: !73, line: 468, baseType: !836, size: 32768, offset: 100928)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !638, file: !73, line: 471, baseType: !645, size: 32, offset: 133696)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "tile", scope: !638, file: !73, line: 474, baseType: !650, size: 64, offset: 133760)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "subimage", scope: !638, file: !73, line: 477, baseType: !656, size: 64, offset: 133824)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "subrange", scope: !638, file: !73, line: 478, baseType: !656, size: 64, offset: 133888)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "pen", scope: !638, file: !73, line: 481, baseType: !676, size: 64, offset: 133952)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !638, file: !73, line: 484, baseType: !656, size: 64, offset: 134016)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_pixel_method", scope: !638, file: !73, line: 487, baseType: !984, size: 32, offset: 134080)
!984 = !DIDerivedType(tag: DW_TAG_typedef, name: "VirtualPixelMethod", file: !460, line: 47, baseType: !459)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_color", scope: !638, file: !73, line: 490, baseType: !676, size: 64, offset: 134112)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !638, file: !73, line: 493, baseType: !748, size: 64, offset: 134208)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "synchronize", scope: !638, file: !73, line: 496, baseType: !645, size: 32, offset: 134272)
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 64)
!989 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !990)
!990 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickInfo", file: !481, line: 103, baseType: !991)
!991 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MagickInfo", file: !481, line: 51, size: 1216, elements: !992)
!992 = !{!993, !994, !995, !996, !997, !998, !999, !1007, !1012, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1027, !1029, !1030, !1032, !1033, !1034, !1035}
!993 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !991, file: !481, line: 54, baseType: !650, size: 64)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !991, file: !481, line: 55, baseType: !650, size: 64, offset: 64)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !991, file: !481, line: 56, baseType: !650, size: 64, offset: 128)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "note", scope: !991, file: !481, line: 57, baseType: !650, size: 64, offset: 192)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "module", scope: !991, file: !481, line: 58, baseType: !650, size: 64, offset: 256)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "image_info", scope: !991, file: !481, line: 61, baseType: !636, size: 64, offset: 320)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "decoder", scope: !991, file: !481, line: 64, baseType: !1000, size: 64, offset: 384)
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1001, size: 64)
!1001 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeImageHandler", file: !481, line: 43, baseType: !1002)
!1002 = !DISubroutineType(types: !1003)
!1003 = !{!709, !1004, !1006}
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 64)
!1005 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !637)
!1006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !844, size: 64)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "encoder", scope: !991, file: !481, line: 67, baseType: !1008, size: 64, offset: 448)
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 64)
!1009 = !DIDerivedType(tag: DW_TAG_typedef, name: "EncodeImageHandler", file: !481, line: 46, baseType: !1010)
!1010 = !DISubroutineType(types: !1011)
!1011 = !{!645, !1004, !709}
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !991, file: !481, line: 70, baseType: !1013, size: 64, offset: 512)
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 64)
!1014 = !DIDerivedType(tag: DW_TAG_typedef, name: "IsImageFormatHandler", file: !481, line: 49, baseType: !1015)
!1015 = !DISubroutineType(types: !1016)
!1016 = !{!645, !1017, !916}
!1017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1018, size: 64)
!1018 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !872)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !991, file: !481, line: 73, baseType: !748, size: 64, offset: 576)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "adjoin", scope: !991, file: !481, line: 76, baseType: !645, size: 32, offset: 640)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !991, file: !481, line: 77, baseType: !645, size: 32, offset: 672)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "endian_support", scope: !991, file: !481, line: 78, baseType: !645, size: 32, offset: 704)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "blob_support", scope: !991, file: !481, line: 79, baseType: !645, size: 32, offset: 736)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "seekable_stream", scope: !991, file: !481, line: 80, baseType: !645, size: 32, offset: 768)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "format_type", scope: !991, file: !481, line: 83, baseType: !1026, size: 32, offset: 800)
!1026 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickFormatType", file: !481, line: 33, baseType: !480)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "thread_support", scope: !991, file: !481, line: 86, baseType: !1028, size: 32, offset: 832)
!1028 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickStatusType", file: !4, line: 147, baseType: !5)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "stealth", scope: !991, file: !481, line: 89, baseType: !645, size: 32, offset: 864)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !991, file: !481, line: 92, baseType: !1031, size: 64, offset: 896)
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !991, size: 64)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !991, file: !481, line: 93, baseType: !1031, size: 64, offset: 960)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !991, file: !481, line: 96, baseType: !656, size: 64, offset: 1024)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !991, file: !481, line: 99, baseType: !650, size: 64, offset: 1088)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !991, file: !481, line: 102, baseType: !855, size: 64, offset: 1152)
!1036 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1037, size: 64)
!1037 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1038)
!1038 = !DIDerivedType(tag: DW_TAG_typedef, name: "DelegateInfo", file: !1039, line: 53, baseType: !1040)
!1039 = !DIFile(filename: "./magick/delegate.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!1040 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DelegateInfo", file: !1039, line: 28, size: 704, elements: !1041)
!1041 = !{!1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1052, !1053, !1054}
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !1040, file: !1039, line: 31, baseType: !650, size: 64)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1040, file: !1039, line: 32, baseType: !650, size: 64, offset: 64)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "encode", scope: !1040, file: !1039, line: 33, baseType: !650, size: 64, offset: 128)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "commands", scope: !1040, file: !1039, line: 34, baseType: !650, size: 64, offset: 192)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1040, file: !1039, line: 37, baseType: !697, size: 64, offset: 256)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "thread_support", scope: !1040, file: !1039, line: 40, baseType: !645, size: 32, offset: 320)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "spawn", scope: !1040, file: !1039, line: 41, baseType: !645, size: 32, offset: 352)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "stealth", scope: !1040, file: !1039, line: 42, baseType: !645, size: 32, offset: 384)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !1040, file: !1039, line: 45, baseType: !1051, size: 64, offset: 448)
!1051 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1040, size: 64)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1040, file: !1039, line: 46, baseType: !1051, size: 64, offset: 512)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !1040, file: !1039, line: 49, baseType: !656, size: 64, offset: 576)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !1040, file: !1039, line: 52, baseType: !855, size: 64, offset: 640)
!1055 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1056, size: 64)
!1056 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1057)
!1057 = !DIDerivedType(tag: DW_TAG_typedef, name: "StringInfo", file: !1058, line: 40, baseType: !1059)
!1058 = !DIFile(filename: "./magick/string_.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!1059 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_StringInfo", file: !1058, line: 29, size: 32960, elements: !1060)
!1060 = !{!1061, !1062, !1063, !1064}
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !1059, file: !1058, line: 32, baseType: !836, size: 32768)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "datum", scope: !1059, file: !1058, line: 35, baseType: !871, size: 64, offset: 32768)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1059, file: !1058, line: 38, baseType: !656, size: 64, offset: 32832)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !1059, file: !1058, line: 39, baseType: !656, size: 64, offset: 32896)
!1065 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1038, size: 64)
!1066 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 64)
!1067 = !{i32 7, !"Dwarf Version", i32 4}
!1068 = !{i32 2, !"Debug Info Version", i32 3}
!1069 = !{i32 1, !"wchar_size", i32 4}
!1070 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!1071 = distinct !DISubprogram(name: "ConstituteImage", scope: !1, file: !1, line: 128, type: !1072, scopeLine: 131, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !1076)
!1072 = !DISubroutineType(types: !1073)
!1073 = !{!709, !916, !916, !816, !1074, !914, !1006}
!1074 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1075)
!1075 = !DIDerivedType(tag: DW_TAG_typedef, name: "StorageType", file: !369, line: 35, baseType: !368)
!1076 = !{}
!1077 = !DILocalVariable(name: "columns", arg: 1, scope: !1071, file: !1, line: 128, type: !916)
!1078 = !DILocation(line: 128, column: 50, scope: !1071)
!1079 = !DILocalVariable(name: "rows", arg: 2, scope: !1071, file: !1, line: 129, type: !916)
!1080 = !DILocation(line: 129, column: 16, scope: !1071)
!1081 = !DILocalVariable(name: "map", arg: 3, scope: !1071, file: !1, line: 129, type: !816)
!1082 = !DILocation(line: 129, column: 33, scope: !1071)
!1083 = !DILocalVariable(name: "storage", arg: 4, scope: !1071, file: !1, line: 129, type: !1074)
!1084 = !DILocation(line: 129, column: 55, scope: !1071)
!1085 = !DILocalVariable(name: "pixels", arg: 5, scope: !1071, file: !1, line: 130, type: !914)
!1086 = !DILocation(line: 130, column: 15, scope: !1071)
!1087 = !DILocalVariable(name: "exception", arg: 6, scope: !1071, file: !1, line: 130, type: !1006)
!1088 = !DILocation(line: 130, column: 37, scope: !1071)
!1089 = !DILocalVariable(name: "image", scope: !1071, file: !1, line: 133, type: !709)
!1090 = !DILocation(line: 133, column: 6, scope: !1071)
!1091 = !DILocalVariable(name: "status", scope: !1071, file: !1, line: 136, type: !645)
!1092 = !DILocation(line: 136, column: 5, scope: !1071)
!1093 = !DILocation(line: 142, column: 59, scope: !1071)
!1094 = !DILocation(line: 142, column: 10, scope: !1071)
!1095 = !DILocation(line: 146, column: 9, scope: !1071)
!1096 = !DILocation(line: 146, column: 8, scope: !1071)
!1097 = !DILocation(line: 147, column: 7, scope: !1098)
!1098 = distinct !DILexicalBlock(scope: !1071, file: !1, line: 147, column: 7)
!1099 = !DILocation(line: 147, column: 13, scope: !1098)
!1100 = !DILocation(line: 147, column: 7, scope: !1071)
!1101 = !DILocation(line: 148, column: 5, scope: !1098)
!1102 = !DILocation(line: 149, column: 8, scope: !1103)
!1103 = distinct !DILexicalBlock(scope: !1071, file: !1, line: 149, column: 7)
!1104 = !DILocation(line: 149, column: 16, scope: !1103)
!1105 = !DILocation(line: 149, column: 22, scope: !1103)
!1106 = !DILocation(line: 149, column: 26, scope: !1103)
!1107 = !DILocation(line: 149, column: 31, scope: !1103)
!1108 = !DILocation(line: 149, column: 7, scope: !1071)
!1109 = !DILocation(line: 150, column: 5, scope: !1110)
!1110 = distinct !DILexicalBlock(scope: !1103, file: !1, line: 150, column: 5)
!1111 = !DILocation(line: 151, column: 18, scope: !1071)
!1112 = !DILocation(line: 151, column: 3, scope: !1071)
!1113 = !DILocation(line: 151, column: 10, scope: !1071)
!1114 = !DILocation(line: 151, column: 17, scope: !1071)
!1115 = !DILocation(line: 152, column: 15, scope: !1071)
!1116 = !DILocation(line: 152, column: 3, scope: !1071)
!1117 = !DILocation(line: 152, column: 10, scope: !1071)
!1118 = !DILocation(line: 152, column: 14, scope: !1071)
!1119 = !DILocation(line: 153, column: 34, scope: !1071)
!1120 = !DILocation(line: 153, column: 10, scope: !1071)
!1121 = !DILocation(line: 154, column: 28, scope: !1071)
!1122 = !DILocation(line: 154, column: 38, scope: !1071)
!1123 = !DILocation(line: 154, column: 46, scope: !1071)
!1124 = !DILocation(line: 154, column: 51, scope: !1071)
!1125 = !DILocation(line: 154, column: 55, scope: !1071)
!1126 = !DILocation(line: 154, column: 63, scope: !1071)
!1127 = !DILocation(line: 154, column: 10, scope: !1071)
!1128 = !DILocation(line: 154, column: 9, scope: !1071)
!1129 = !DILocation(line: 155, column: 7, scope: !1130)
!1130 = distinct !DILexicalBlock(scope: !1071, file: !1, line: 155, column: 7)
!1131 = !DILocation(line: 155, column: 14, scope: !1130)
!1132 = !DILocation(line: 155, column: 7, scope: !1071)
!1133 = !DILocation(line: 157, column: 24, scope: !1134)
!1134 = distinct !DILexicalBlock(scope: !1130, file: !1, line: 156, column: 5)
!1135 = !DILocation(line: 157, column: 35, scope: !1134)
!1136 = !DILocation(line: 157, column: 42, scope: !1134)
!1137 = !DILocation(line: 157, column: 7, scope: !1134)
!1138 = !DILocation(line: 158, column: 26, scope: !1134)
!1139 = !DILocation(line: 158, column: 13, scope: !1134)
!1140 = !DILocation(line: 158, column: 12, scope: !1134)
!1141 = !DILocation(line: 159, column: 5, scope: !1134)
!1142 = !DILocation(line: 160, column: 10, scope: !1071)
!1143 = !DILocation(line: 160, column: 3, scope: !1071)
!1144 = !DILocation(line: 161, column: 1, scope: !1071)
!1145 = distinct !DISubprogram(name: "PingImage", scope: !1, file: !1, line: 209, type: !1002, scopeLine: 211, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !1076)
!1146 = !DILocalVariable(name: "image_info", arg: 1, scope: !1145, file: !1, line: 209, type: !1004)
!1147 = !DILocation(line: 209, column: 48, scope: !1145)
!1148 = !DILocalVariable(name: "exception", arg: 2, scope: !1145, file: !1, line: 210, type: !1006)
!1149 = !DILocation(line: 210, column: 18, scope: !1145)
!1150 = !DILocalVariable(name: "image", scope: !1145, file: !1, line: 213, type: !709)
!1151 = !DILocation(line: 213, column: 6, scope: !1145)
!1152 = !DILocalVariable(name: "ping_info", scope: !1145, file: !1, line: 216, type: !636)
!1153 = !DILocation(line: 216, column: 6, scope: !1145)
!1154 = !DILocation(line: 220, column: 7, scope: !1155)
!1155 = distinct !DILexicalBlock(scope: !1145, file: !1, line: 220, column: 7)
!1156 = !DILocation(line: 220, column: 19, scope: !1155)
!1157 = !DILocation(line: 220, column: 25, scope: !1155)
!1158 = !DILocation(line: 220, column: 7, scope: !1145)
!1159 = !DILocation(line: 222, column: 7, scope: !1155)
!1160 = !DILocation(line: 222, column: 19, scope: !1155)
!1161 = !DILocation(line: 221, column: 12, scope: !1155)
!1162 = !DILocation(line: 221, column: 5, scope: !1155)
!1163 = !DILocation(line: 224, column: 28, scope: !1145)
!1164 = !DILocation(line: 224, column: 13, scope: !1145)
!1165 = !DILocation(line: 224, column: 12, scope: !1145)
!1166 = !DILocation(line: 225, column: 3, scope: !1145)
!1167 = !DILocation(line: 225, column: 14, scope: !1145)
!1168 = !DILocation(line: 225, column: 18, scope: !1145)
!1169 = !DILocation(line: 226, column: 20, scope: !1145)
!1170 = !DILocation(line: 226, column: 42, scope: !1145)
!1171 = !DILocation(line: 226, column: 9, scope: !1145)
!1172 = !DILocation(line: 226, column: 8, scope: !1145)
!1173 = !DILocation(line: 227, column: 7, scope: !1174)
!1174 = distinct !DILexicalBlock(scope: !1145, file: !1, line: 227, column: 7)
!1175 = !DILocation(line: 227, column: 13, scope: !1174)
!1176 = !DILocation(line: 227, column: 7, scope: !1145)
!1177 = !DILocation(line: 229, column: 19, scope: !1178)
!1178 = distinct !DILexicalBlock(scope: !1174, file: !1, line: 228, column: 5)
!1179 = !DILocation(line: 229, column: 26, scope: !1178)
!1180 = !DILocation(line: 229, column: 7, scope: !1178)
!1181 = !DILocation(line: 230, column: 11, scope: !1182)
!1182 = distinct !DILexicalBlock(scope: !1178, file: !1, line: 230, column: 11)
!1183 = !DILocation(line: 230, column: 22, scope: !1182)
!1184 = !DILocation(line: 230, column: 30, scope: !1182)
!1185 = !DILocation(line: 230, column: 11, scope: !1178)
!1186 = !DILocation(line: 231, column: 30, scope: !1182)
!1187 = !DILocation(line: 231, column: 36, scope: !1182)
!1188 = !DILocation(line: 231, column: 16, scope: !1182)
!1189 = !DILocation(line: 231, column: 9, scope: !1182)
!1190 = !DILocation(line: 232, column: 5, scope: !1178)
!1191 = !DILocation(line: 233, column: 30, scope: !1145)
!1192 = !DILocation(line: 233, column: 13, scope: !1145)
!1193 = !DILocation(line: 233, column: 12, scope: !1145)
!1194 = !DILocation(line: 234, column: 10, scope: !1145)
!1195 = !DILocation(line: 234, column: 3, scope: !1145)
!1196 = distinct !DISubprogram(name: "PingStream", scope: !1, file: !1, line: 196, type: !910, scopeLine: 198, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !1076)
!1197 = !DILocalVariable(name: "image", arg: 1, scope: !1196, file: !1, line: 196, type: !912)
!1198 = !DILocation(line: 196, column: 39, scope: !1196)
!1199 = !DILocalVariable(name: "pixels", arg: 2, scope: !1196, file: !1, line: 197, type: !914)
!1200 = !DILocation(line: 197, column: 15, scope: !1196)
!1201 = !DILocalVariable(name: "columns", arg: 3, scope: !1196, file: !1, line: 197, type: !916)
!1202 = !DILocation(line: 197, column: 50, scope: !1196)
!1203 = !DILocation(line: 202, column: 10, scope: !1196)
!1204 = !DILocation(line: 202, column: 3, scope: !1196)
!1205 = distinct !DISubprogram(name: "PingImages", scope: !1, file: !1, line: 261, type: !1002, scopeLine: 263, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !1076)
!1206 = !DILocalVariable(name: "image_info", arg: 1, scope: !1205, file: !1, line: 261, type: !1004)
!1207 = !DILocation(line: 261, column: 49, scope: !1205)
!1208 = !DILocalVariable(name: "exception", arg: 2, scope: !1205, file: !1, line: 262, type: !1006)
!1209 = !DILocation(line: 262, column: 18, scope: !1205)
!1210 = !DILocalVariable(name: "filename", scope: !1205, file: !1, line: 265, type: !836)
!1211 = !DILocation(line: 265, column: 5, scope: !1205)
!1212 = !DILocalVariable(name: "image", scope: !1205, file: !1, line: 268, type: !709)
!1213 = !DILocation(line: 268, column: 6, scope: !1205)
!1214 = !DILocalVariable(name: "images", scope: !1205, file: !1, line: 269, type: !709)
!1215 = !DILocation(line: 269, column: 6, scope: !1205)
!1216 = !DILocalVariable(name: "read_info", scope: !1205, file: !1, line: 272, type: !636)
!1217 = !DILocation(line: 272, column: 6, scope: !1205)
!1218 = !DILocation(line: 279, column: 7, scope: !1219)
!1219 = distinct !DILexicalBlock(scope: !1205, file: !1, line: 279, column: 7)
!1220 = !DILocation(line: 279, column: 19, scope: !1219)
!1221 = !DILocation(line: 279, column: 25, scope: !1219)
!1222 = !DILocation(line: 279, column: 7, scope: !1205)
!1223 = !DILocation(line: 281, column: 7, scope: !1219)
!1224 = !DILocation(line: 281, column: 19, scope: !1219)
!1225 = !DILocation(line: 280, column: 12, scope: !1219)
!1226 = !DILocation(line: 280, column: 5, scope: !1219)
!1227 = !DILocation(line: 283, column: 33, scope: !1205)
!1228 = !DILocation(line: 283, column: 59, scope: !1205)
!1229 = !DILocation(line: 283, column: 71, scope: !1205)
!1230 = !DILocation(line: 284, column: 11, scope: !1205)
!1231 = !DILocation(line: 284, column: 23, scope: !1205)
!1232 = !DILocation(line: 284, column: 5, scope: !1205)
!1233 = !DILocation(line: 284, column: 29, scope: !1205)
!1234 = !DILocation(line: 283, column: 10, scope: !1205)
!1235 = !DILocation(line: 285, column: 21, scope: !1236)
!1236 = distinct !DILexicalBlock(scope: !1205, file: !1, line: 285, column: 7)
!1237 = !DILocation(line: 285, column: 30, scope: !1236)
!1238 = !DILocation(line: 285, column: 42, scope: !1236)
!1239 = !DILocation(line: 285, column: 7, scope: !1236)
!1240 = !DILocation(line: 285, column: 52, scope: !1236)
!1241 = !DILocation(line: 285, column: 7, scope: !1205)
!1242 = !DILocalVariable(name: "sans", scope: !1243, file: !1, line: 288, type: !1006)
!1243 = distinct !DILexicalBlock(scope: !1236, file: !1, line: 286, column: 5)
!1244 = !DILocation(line: 288, column: 10, scope: !1243)
!1245 = !DILocalVariable(name: "extent", scope: !1243, file: !1, line: 291, type: !697)
!1246 = !DILocation(line: 291, column: 9, scope: !1243)
!1247 = !DILocalVariable(name: "scene", scope: !1243, file: !1, line: 292, type: !697)
!1248 = !DILocation(line: 292, column: 9, scope: !1243)
!1249 = !DILocation(line: 297, column: 32, scope: !1243)
!1250 = !DILocation(line: 297, column: 17, scope: !1243)
!1251 = !DILocation(line: 297, column: 16, scope: !1243)
!1252 = !DILocation(line: 298, column: 12, scope: !1243)
!1253 = !DILocation(line: 298, column: 11, scope: !1243)
!1254 = !DILocation(line: 299, column: 27, scope: !1243)
!1255 = !DILocation(line: 299, column: 39, scope: !1243)
!1256 = !DILocation(line: 299, column: 14, scope: !1243)
!1257 = !DILocation(line: 300, column: 33, scope: !1243)
!1258 = !DILocation(line: 300, column: 12, scope: !1243)
!1259 = !DILocation(line: 300, column: 11, scope: !1243)
!1260 = !DILocation(line: 301, column: 11, scope: !1261)
!1261 = distinct !DILexicalBlock(scope: !1243, file: !1, line: 301, column: 11)
!1262 = !DILocation(line: 301, column: 22, scope: !1261)
!1263 = !DILocation(line: 301, column: 36, scope: !1261)
!1264 = !DILocation(line: 301, column: 11, scope: !1243)
!1265 = !DILocation(line: 303, column: 38, scope: !1266)
!1266 = distinct !DILexicalBlock(scope: !1261, file: !1, line: 302, column: 9)
!1267 = !DILocation(line: 303, column: 21, scope: !1266)
!1268 = !DILocation(line: 303, column: 20, scope: !1266)
!1269 = !DILocation(line: 304, column: 28, scope: !1266)
!1270 = !DILocation(line: 304, column: 39, scope: !1266)
!1271 = !DILocation(line: 304, column: 18, scope: !1266)
!1272 = !DILocation(line: 304, column: 11, scope: !1266)
!1273 = !DILocation(line: 306, column: 31, scope: !1243)
!1274 = !DILocation(line: 306, column: 40, scope: !1243)
!1275 = !DILocation(line: 306, column: 51, scope: !1243)
!1276 = !DILocation(line: 306, column: 14, scope: !1243)
!1277 = !DILocation(line: 307, column: 14, scope: !1243)
!1278 = !DILocation(line: 307, column: 13, scope: !1243)
!1279 = !DILocation(line: 308, column: 25, scope: !1243)
!1280 = !DILocation(line: 308, column: 36, scope: !1243)
!1281 = !DILocation(line: 308, column: 42, scope: !1243)
!1282 = !DILocation(line: 308, column: 53, scope: !1243)
!1283 = !DILocation(line: 308, column: 41, scope: !1243)
!1284 = !DILocation(line: 308, column: 13, scope: !1243)
!1285 = !DILocation(line: 309, column: 28, scope: !1286)
!1286 = distinct !DILexicalBlock(scope: !1243, file: !1, line: 309, column: 7)
!1287 = !DILocation(line: 309, column: 39, scope: !1286)
!1288 = !DILocation(line: 309, column: 17, scope: !1286)
!1289 = !DILocation(line: 309, column: 12, scope: !1286)
!1290 = !DILocation(line: 309, column: 46, scope: !1291)
!1291 = distinct !DILexicalBlock(scope: !1286, file: !1, line: 309, column: 7)
!1292 = !DILocation(line: 309, column: 64, scope: !1291)
!1293 = !DILocation(line: 309, column: 52, scope: !1291)
!1294 = !DILocation(line: 309, column: 7, scope: !1286)
!1295 = !DILocation(line: 311, column: 39, scope: !1296)
!1296 = distinct !DILexicalBlock(scope: !1291, file: !1, line: 310, column: 7)
!1297 = !DILocation(line: 311, column: 65, scope: !1296)
!1298 = !DILocation(line: 312, column: 11, scope: !1296)
!1299 = !DILocation(line: 311, column: 74, scope: !1296)
!1300 = !DILocation(line: 312, column: 17, scope: !1296)
!1301 = !DILocation(line: 312, column: 28, scope: !1296)
!1302 = !DILocation(line: 311, column: 16, scope: !1296)
!1303 = !DILocation(line: 313, column: 25, scope: !1296)
!1304 = !DILocation(line: 313, column: 35, scope: !1296)
!1305 = !DILocation(line: 313, column: 15, scope: !1296)
!1306 = !DILocation(line: 313, column: 14, scope: !1296)
!1307 = !DILocation(line: 314, column: 13, scope: !1308)
!1308 = distinct !DILexicalBlock(scope: !1296, file: !1, line: 314, column: 13)
!1309 = !DILocation(line: 314, column: 19, scope: !1308)
!1310 = !DILocation(line: 314, column: 13, scope: !1296)
!1311 = !DILocation(line: 315, column: 11, scope: !1308)
!1312 = !DILocation(line: 316, column: 35, scope: !1296)
!1313 = !DILocation(line: 316, column: 9, scope: !1296)
!1314 = !DILocation(line: 317, column: 7, scope: !1296)
!1315 = !DILocation(line: 309, column: 77, scope: !1291)
!1316 = !DILocation(line: 309, column: 7, scope: !1291)
!1317 = distinct !{!1317, !1294, !1318}
!1318 = !DILocation(line: 317, column: 7, scope: !1286)
!1319 = !DILocation(line: 318, column: 34, scope: !1243)
!1320 = !DILocation(line: 318, column: 17, scope: !1243)
!1321 = !DILocation(line: 318, column: 16, scope: !1243)
!1322 = !DILocation(line: 319, column: 14, scope: !1243)
!1323 = !DILocation(line: 319, column: 7, scope: !1243)
!1324 = !DILocation(line: 321, column: 20, scope: !1205)
!1325 = !DILocation(line: 321, column: 31, scope: !1205)
!1326 = !DILocation(line: 321, column: 10, scope: !1205)
!1327 = !DILocation(line: 321, column: 3, scope: !1205)
!1328 = !DILocation(line: 322, column: 1, scope: !1205)
!1329 = distinct !DISubprogram(name: "ReadImage", scope: !1, file: !1, line: 352, type: !1002, scopeLine: 354, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !1076)
!1330 = !DILocalVariable(name: "image_info", arg: 1, scope: !1329, file: !1, line: 352, type: !1004)
!1331 = !DILocation(line: 352, column: 48, scope: !1329)
!1332 = !DILocalVariable(name: "exception", arg: 2, scope: !1329, file: !1, line: 353, type: !1006)
!1333 = !DILocation(line: 353, column: 18, scope: !1329)
!1334 = !DILocalVariable(name: "filename", scope: !1329, file: !1, line: 356, type: !836)
!1335 = !DILocation(line: 356, column: 5, scope: !1329)
!1336 = !DILocalVariable(name: "magick", scope: !1329, file: !1, line: 357, type: !836)
!1337 = !DILocation(line: 357, column: 5, scope: !1329)
!1338 = !DILocalVariable(name: "magick_filename", scope: !1329, file: !1, line: 358, type: !836)
!1339 = !DILocation(line: 358, column: 5, scope: !1329)
!1340 = !DILocalVariable(name: "value", scope: !1329, file: !1, line: 361, type: !816)
!1341 = !DILocation(line: 361, column: 6, scope: !1329)
!1342 = !DILocalVariable(name: "delegate_info", scope: !1329, file: !1, line: 364, type: !1036)
!1343 = !DILocation(line: 364, column: 6, scope: !1329)
!1344 = !DILocalVariable(name: "magick_info", scope: !1329, file: !1, line: 367, type: !988)
!1345 = !DILocation(line: 367, column: 6, scope: !1329)
!1346 = !DILocalVariable(name: "sans_exception", scope: !1329, file: !1, line: 370, type: !1006)
!1347 = !DILocation(line: 370, column: 6, scope: !1329)
!1348 = !DILocalVariable(name: "geometry_info", scope: !1329, file: !1, line: 373, type: !1349)
!1349 = !DIDerivedType(tag: DW_TAG_typedef, name: "GeometryInfo", file: !153, line: 112, baseType: !1350)
!1350 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GeometryInfo", file: !153, line: 104, size: 320, elements: !1351)
!1351 = !{!1352, !1353, !1354, !1355, !1356}
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "rho", scope: !1350, file: !153, line: 107, baseType: !673, size: 64)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "sigma", scope: !1350, file: !153, line: 108, baseType: !673, size: 64, offset: 64)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "xi", scope: !1350, file: !153, line: 109, baseType: !673, size: 64, offset: 128)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "psi", scope: !1350, file: !153, line: 110, baseType: !673, size: 64, offset: 192)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "chi", scope: !1350, file: !153, line: 111, baseType: !673, size: 64, offset: 256)
!1357 = !DILocation(line: 373, column: 5, scope: !1329)
!1358 = !DILocalVariable(name: "image", scope: !1329, file: !1, line: 376, type: !709)
!1359 = !DILocation(line: 376, column: 6, scope: !1329)
!1360 = !DILocalVariable(name: "next", scope: !1329, file: !1, line: 377, type: !709)
!1361 = !DILocation(line: 377, column: 6, scope: !1329)
!1362 = !DILocalVariable(name: "read_info", scope: !1329, file: !1, line: 380, type: !636)
!1363 = !DILocation(line: 380, column: 6, scope: !1329)
!1364 = !DILocalVariable(name: "flags", scope: !1329, file: !1, line: 383, type: !1028)
!1365 = !DILocation(line: 383, column: 5, scope: !1329)
!1366 = !DILocalVariable(name: "thread_support", scope: !1329, file: !1, line: 384, type: !1028)
!1367 = !DILocation(line: 384, column: 5, scope: !1329)
!1368 = !DILocalVariable(name: "domain", scope: !1329, file: !1, line: 387, type: !1369)
!1369 = !DIDerivedType(tag: DW_TAG_typedef, name: "PolicyDomain", file: !487, line: 37, baseType: !486)
!1370 = !DILocation(line: 387, column: 5, scope: !1329)
!1371 = !DILocalVariable(name: "rights", scope: !1329, file: !1, line: 390, type: !1372)
!1372 = !DIDerivedType(tag: DW_TAG_typedef, name: "PolicyRights", file: !487, line: 46, baseType: !496)
!1373 = !DILocation(line: 390, column: 5, scope: !1329)
!1374 = !DILocation(line: 398, column: 7, scope: !1375)
!1375 = distinct !DILexicalBlock(scope: !1329, file: !1, line: 398, column: 7)
!1376 = !DILocation(line: 398, column: 19, scope: !1375)
!1377 = !DILocation(line: 398, column: 25, scope: !1375)
!1378 = !DILocation(line: 398, column: 7, scope: !1329)
!1379 = !DILocation(line: 400, column: 7, scope: !1375)
!1380 = !DILocation(line: 400, column: 19, scope: !1375)
!1381 = !DILocation(line: 399, column: 12, scope: !1375)
!1382 = !DILocation(line: 399, column: 5, scope: !1375)
!1383 = !DILocation(line: 402, column: 28, scope: !1329)
!1384 = !DILocation(line: 402, column: 13, scope: !1329)
!1385 = !DILocation(line: 402, column: 12, scope: !1329)
!1386 = !DILocation(line: 403, column: 27, scope: !1329)
!1387 = !DILocation(line: 403, column: 43, scope: !1329)
!1388 = !DILocation(line: 403, column: 54, scope: !1329)
!1389 = !DILocation(line: 403, column: 10, scope: !1329)
!1390 = !DILocation(line: 404, column: 23, scope: !1329)
!1391 = !DILocation(line: 404, column: 35, scope: !1329)
!1392 = !DILocation(line: 404, column: 10, scope: !1329)
!1393 = !DILocation(line: 405, column: 27, scope: !1329)
!1394 = !DILocation(line: 405, column: 36, scope: !1329)
!1395 = !DILocation(line: 405, column: 47, scope: !1329)
!1396 = !DILocation(line: 405, column: 10, scope: !1329)
!1397 = !DILocation(line: 406, column: 27, scope: !1329)
!1398 = !DILocation(line: 406, column: 34, scope: !1329)
!1399 = !DILocation(line: 406, column: 45, scope: !1329)
!1400 = !DILocation(line: 406, column: 10, scope: !1329)
!1401 = !DILocation(line: 407, column: 9, scope: !1329)
!1402 = !DILocation(line: 408, column: 9, scope: !1329)
!1403 = !DILocation(line: 409, column: 26, scope: !1404)
!1404 = distinct !DILexicalBlock(scope: !1329, file: !1, line: 409, column: 7)
!1405 = !DILocation(line: 409, column: 33, scope: !1404)
!1406 = !DILocation(line: 409, column: 40, scope: !1404)
!1407 = !DILocation(line: 409, column: 51, scope: !1404)
!1408 = !DILocation(line: 409, column: 7, scope: !1404)
!1409 = !DILocation(line: 409, column: 59, scope: !1404)
!1410 = !DILocation(line: 409, column: 7, scope: !1329)
!1411 = !DILocation(line: 411, column: 7, scope: !1412)
!1412 = distinct !DILexicalBlock(scope: !1404, file: !1, line: 410, column: 5)
!1413 = !DILocation(line: 411, column: 12, scope: !1412)
!1414 = !DILocation(line: 412, column: 35, scope: !1412)
!1415 = !DILocation(line: 413, column: 32, scope: !1412)
!1416 = !DILocation(line: 413, column: 43, scope: !1412)
!1417 = !DILocation(line: 412, column: 14, scope: !1412)
