; ModuleID = 'magick/fourier.c'
source_filename = "magick/fourier.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._Image = type { i32, i32, i32, i64, i32, i32, i32, i64, i64, i64, i64, %struct._PixelPacket*, %struct._PixelPacket, %struct._PixelPacket, %struct._PixelPacket, double, %struct._ChromaticityInfo, i32, i8*, i32, i8*, i8*, i8*, i64, double, double, %struct._RectangleInfo, %struct._RectangleInfo, %struct._RectangleInfo, double, double, double, i32, i32, i32, i32, i32, i32, %struct._Image*, i64, i64, i64, i64, i64, i64, %struct._ErrorInfo, %struct._TimerInfo, i32 (i8*, i64, i64, i8*)*, i8*, i8*, i8*, %struct._Ascii85Info*, %struct._BlobInfo*, [4096 x i8], [4096 x i8], [4096 x i8], i64, i64, %struct._ExceptionInfo, i32, i64, %struct.SemaphoreInfo*, %struct._ProfileInfo, %struct._ProfileInfo, %struct._ProfileInfo*, i64, i64, %struct._Image*, %struct._Image*, %struct._Image*, i32, i32, %struct._PixelPacket, %struct._Image*, %struct._RectangleInfo, i8*, i8*, i32, i32, i64, i32, i64, i64, i32, i64 }
%struct._ChromaticityInfo = type { %struct._PrimaryInfo, %struct._PrimaryInfo, %struct._PrimaryInfo, %struct._PrimaryInfo }
%struct._PrimaryInfo = type { double, double, double }
%struct._ErrorInfo = type { double, double, double }
%struct._TimerInfo = type { %struct._Timer, %struct._Timer, i32, i64 }
%struct._Timer = type { double, double, double }

!347 = !DIEnumerator(name: "GrayscaleMatteType", value: 3, isUnsigned: true)
!348 = !DIEnumerator(name: "PaletteType", value: 4, isUnsigned: true)
!349 = !DIEnumerator(name: "PaletteMatteType", value: 5, isUnsigned: true)
!350 = !DIEnumerator(name: "TrueColorType", value: 6, isUnsigned: true)
!351 = !DIEnumerator(name: "TrueColorMatteType", value: 7, isUnsigned: true)
!352 = !DIEnumerator(name: "ColorSeparationType", value: 8, isUnsigned: true)
!353 = !DIEnumerator(name: "ColorSeparationMatteType", value: 9, isUnsigned: true)
!354 = !DIEnumerator(name: "OptimizeType", value: 10, isUnsigned: true)
!355 = !DIEnumerator(name: "PaletteBilevelMatteType", value: 11, isUnsigned: true)
!356 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !326, line: 67, baseType: !5, size: 32, elements: !357)
!357 = !{!358, !359, !360, !361, !362, !363, !364, !365, !366, !367}
!358 = !DIEnumerator(name: "UndefinedPixelIntensityMethod", value: 0, isUnsigned: true)
!359 = !DIEnumerator(name: "AveragePixelIntensityMethod", value: 1, isUnsigned: true)
!360 = !DIEnumerator(name: "BrightnessPixelIntensityMethod", value: 2, isUnsigned: true)
!361 = !DIEnumerator(name: "LightnessPixelIntensityMethod", value: 3, isUnsigned: true)
!362 = !DIEnumerator(name: "Rec601LumaPixelIntensityMethod", value: 4, isUnsigned: true)
!363 = !DIEnumerator(name: "Rec601LuminancePixelIntensityMethod", value: 5, isUnsigned: true)
!364 = !DIEnumerator(name: "Rec709LumaPixelIntensityMethod", value: 6, isUnsigned: true)
!365 = !DIEnumerator(name: "Rec709LuminancePixelIntensityMethod", value: 7, isUnsigned: true)
!366 = !DIEnumerator(name: "RMSPixelIntensityMethod", value: 8, isUnsigned: true)
!367 = !DIEnumerator(name: "MSPixelIntensityMethod", value: 9, isUnsigned: true)
!368 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !369, line: 25, baseType: !5, size: 32, elements: !370)
!369 = !DIFile(filename: "./magick/fourier.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!370 = !{!371, !372, !373, !374, !375, !376, !377, !378}
!371 = !DIEnumerator(name: "UndefinedComplexOperator", value: 0, isUnsigned: true)
!372 = !DIEnumerator(name: "AddComplexOperator", value: 1, isUnsigned: true)
!373 = !DIEnumerator(name: "ConjugateComplexOperator", value: 2, isUnsigned: true)
!374 = !DIEnumerator(name: "DivideComplexOperator", value: 3, isUnsigned: true)
!375 = !DIEnumerator(name: "MagnitudePhaseComplexOperator", value: 4, isUnsigned: true)
!376 = !DIEnumerator(name: "MultiplyComplexOperator", value: 5, isUnsigned: true)
!377 = !DIEnumerator(name: "RealImaginaryComplexOperator", value: 6, isUnsigned: true)
!378 = !DIEnumerator(name: "SubtractComplexOperator", value: 7, isUnsigned: true)
!379 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !380, line: 34, baseType: !5, size: 32, elements: !381)
!380 = !DIFile(filename: "./magick/log.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!381 = !{!382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403}
!382 = !DIEnumerator(name: "UndefinedEvents", value: 0, isUnsigned: true)
!383 = !DIEnumerator(name: "NoEvents", value: 0, isUnsigned: true)
!384 = !DIEnumerator(name: "TraceEvent", value: 1, isUnsigned: true)
!385 = !DIEnumerator(name: "AnnotateEvent", value: 2, isUnsigned: true)
!386 = !DIEnumerator(name: "BlobEvent", value: 4, isUnsigned: true)
!387 = !DIEnumerator(name: "CacheEvent", value: 8, isUnsigned: true)
!388 = !DIEnumerator(name: "CoderEvent", value: 16, isUnsigned: true)
!389 = !DIEnumerator(name: "ConfigureEvent", value: 32, isUnsigned: true)
!390 = !DIEnumerator(name: "DeprecateEvent", value: 64, isUnsigned: true)
!391 = !DIEnumerator(name: "DrawEvent", value: 128, isUnsigned: true)
!392 = !DIEnumerator(name: "ExceptionEvent", value: 256, isUnsigned: true)
!393 = !DIEnumerator(name: "ImageEvent", value: 512, isUnsigned: true)
!394 = !DIEnumerator(name: "LocaleEvent", value: 1024, isUnsigned: true)
!395 = !DIEnumerator(name: "ModuleEvent", value: 2048, isUnsigned: true)
!396 = !DIEnumerator(name: "PolicyEvent", value: 4096, isUnsigned: true)
!397 = !DIEnumerator(name: "ResourceEvent", value: 8192, isUnsigned: true)
!398 = !DIEnumerator(name: "TransformEvent", value: 16384, isUnsigned: true)
!399 = !DIEnumerator(name: "UserEvent", value: 36864, isUnsigned: true)
!400 = !DIEnumerator(name: "WandEvent", value: 65536, isUnsigned: true)
!401 = !DIEnumerator(name: "X11Event", value: 131072, isUnsigned: true)
!402 = !DIEnumerator(name: "AccelerateEvent", value: 262144, isUnsigned: true)
!403 = !DIEnumerator(name: "AllEvents", value: 2147483647, isUnsigned: true)
!404 = !{!405, !406, !461, !539, !627, !470, !628, !429, !443, !434, !534}
!405 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "Image", file: !4, line: 221, baseType: !408)
!408 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Image", file: !73, line: 150, size: 105920, elements: !409)
!409 = !{!410, !412, !414, !416, !419, !421, !423, !424, !425, !426, !427, !428, !439, !440, !441, !442, !444, !458, !460, !462, !464, !467, !468, !469, !475, !476, !477, !485, !486, !487, !488, !489, !490, !492, !494, !496, !498, !500, !502, !504, !505, !506, !507, !508, !509, !510, !518, !533, !547, !548, !549, !550, !554, !558, !562, !563, !564, !565, !566, !584, !585, !587, !588, !598, !599, !601, !602, !603, !604, !605, !606, !608, !609, !610, !611, !612, !613, !614, !616, !617, !618, !619, !620, !624, !626}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "storage_class", scope: !408, file: !73, line: 153, baseType: !411, size: 32)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "ClassType", file: !4, line: 209, baseType: !3)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !408, file: !73, line: 156, baseType: !413, size: 32, offset: 32)
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorspaceType", file: !11, line: 61, baseType: !10)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !408, file: !73, line: 159, baseType: !415, size: 32, offset: 64)
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompressionType", file: !48, line: 49, baseType: !47)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !408, file: !73, line: 162, baseType: !417, size: 64, offset: 128)
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !418, line: 46, baseType: !405)
!418 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!419 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !408, file: !73, line: 165, baseType: !420, size: 32, offset: 192)
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "OrientationType", file: !73, line: 86, baseType: !72)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "taint", scope: !408, file: !73, line: 168, baseType: !422, size: 32, offset: 224)
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickBooleanType", file: !4, line: 215, baseType: !84)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "matte", scope: !408, file: !73, line: 169, baseType: !422, size: 32, offset: 256)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !408, file: !73, line: 172, baseType: !417, size: 64, offset: 320)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !408, file: !73, line: 173, baseType: !417, size: 64, offset: 384)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !408, file: !73, line: 174, baseType: !417, size: 64, offset: 448)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !408, file: !73, line: 175, baseType: !417, size: 64, offset: 512)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "colormap", scope: !408, file: !73, line: 178, baseType: !429, size: 64, offset: 576)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!430 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelPacket", file: !326, line: 148, baseType: !431)
!431 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PixelPacket", file: !326, line: 131, size: 64, elements: !432)
!432 = !{!433, !436, !437, !438}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !431, file: !326, line: 143, baseType: !434, size: 16)
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "Quantum", file: !4, line: 93, baseType: !435)
!435 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !431, file: !326, line: 144, baseType: !434, size: 16, offset: 16)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !431, file: !326, line: 145, baseType: !434, size: 16, offset: 32)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !431, file: !326, line: 146, baseType: !434, size: 16, offset: 48)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "background_color", scope: !408, file: !73, line: 179, baseType: !430, size: 64, offset: 640)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !408, file: !73, line: 180, baseType: !430, size: 64, offset: 704)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "matte_color", scope: !408, file: !73, line: 181, baseType: !430, size: 64, offset: 768)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !408, file: !73, line: 184, baseType: !443, size: 64, offset: 832)
!443 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "chromaticity", scope: !408, file: !73, line: 187, baseType: !445, size: 768, offset: 896)
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChromaticityInfo", file: !73, line: 128, baseType: !446)
!446 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ChromaticityInfo", file: !73, line: 121, size: 768, elements: !447)
!447 = !{!448, !455, !456, !457}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "red_primary", scope: !446, file: !73, line: 124, baseType: !449, size: 192)
!449 = !DIDerivedType(tag: DW_TAG_typedef, name: "PrimaryInfo", file: !73, line: 101, baseType: !450)
!450 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PrimaryInfo", file: !73, line: 95, size: 192, elements: !451)
!451 = !{!452, !453, !454}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !450, file: !73, line: 98, baseType: !443, size: 64)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !450, file: !73, line: 99, baseType: !443, size: 64, offset: 64)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !450, file: !73, line: 100, baseType: !443, size: 64, offset: 128)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "green_primary", scope: !446, file: !73, line: 125, baseType: !449, size: 192, offset: 192)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "blue_primary", scope: !446, file: !73, line: 126, baseType: !449, size: 192, offset: 384)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "white_point", scope: !446, file: !73, line: 127, baseType: !449, size: 192, offset: 576)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "rendering_intent", scope: !408, file: !73, line: 190, baseType: !459, size: 32, offset: 1664)
!459 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderingIntent", file: !89, line: 49, baseType: !88)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !408, file: !73, line: 193, baseType: !461, size: 64, offset: 1728)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !408, file: !73, line: 196, baseType: !463, size: 32, offset: 1792)
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "ResolutionType", file: !73, line: 93, baseType: !96)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "montage", scope: !408, file: !73, line: 199, baseType: !465, size: 64, offset: 1856)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64)
!466 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "directory", scope: !408, file: !73, line: 200, baseType: !465, size: 64, offset: 1920)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "geometry", scope: !408, file: !73, line: 201, baseType: !465, size: 64, offset: 1984)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !408, file: !73, line: 204, baseType: !470, size: 64, offset: 2048)
!470 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !471, line: 77, baseType: !472)
!471 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!472 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !473, line: 193, baseType: !474)
!473 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!474 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "x_resolution", scope: !408, file: !73, line: 207, baseType: !443, size: 64, offset: 2112)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "y_resolution", scope: !408, file: !73, line: 208, baseType: !443, size: 64, offset: 2176)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !408, file: !73, line: 211, baseType: !478, size: 256, offset: 2240)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "RectangleInfo", file: !153, line: 130, baseType: !479)
!479 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_RectangleInfo", file: !153, line: 121, size: 256, elements: !480)
!480 = !{!481, !482, !483, !484}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !479, file: !153, line: 124, baseType: !417, size: 64)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !479, file: !153, line: 125, baseType: !417, size: 64, offset: 64)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !479, file: !153, line: 128, baseType: !470, size: 64, offset: 128)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !479, file: !153, line: 129, baseType: !470, size: 64, offset: 192)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "extract_info", scope: !408, file: !73, line: 212, baseType: !478, size: 256, offset: 2496)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "tile_info", scope: !408, file: !73, line: 213, baseType: !478, size: 256, offset: 2752)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "bias", scope: !408, file: !73, line: 216, baseType: !443, size: 64, offset: 3008)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "blur", scope: !408, file: !73, line: 217, baseType: !443, size: 64, offset: 3072)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !408, file: !73, line: 218, baseType: !443, size: 64, offset: 3136)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !408, file: !73, line: 221, baseType: !491, size: 32, offset: 3200)
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "FilterTypes", file: !102, line: 66, baseType: !101)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "interlace", scope: !408, file: !73, line: 224, baseType: !493, size: 32, offset: 3232)
!493 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterlaceType", file: !73, line: 73, baseType: !136)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !408, file: !73, line: 227, baseType: !495, size: 32, offset: 3264)
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "EndianType", file: !147, line: 35, baseType: !146)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !408, file: !73, line: 230, baseType: !497, size: 32, offset: 3296)
!497 = !DIDerivedType(tag: DW_TAG_typedef, name: "GravityType", file: !153, line: 91, baseType: !152)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !408, file: !73, line: 233, baseType: !499, size: 32, offset: 3328)
!499 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompositeOperator", file: !168, line: 99, baseType: !167)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "dispose", scope: !408, file: !73, line: 236, baseType: !501, size: 32, offset: 3360)
!501 = !DIDerivedType(tag: DW_TAG_typedef, name: "DisposeType", file: !239, line: 32, baseType: !238)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "clip_mask", scope: !408, file: !73, line: 239, baseType: !503, size: 64, offset: 3392)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !408, file: !73, line: 242, baseType: !417, size: 64, offset: 3456)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !408, file: !73, line: 243, baseType: !417, size: 64, offset: 3520)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_second", scope: !408, file: !73, line: 246, baseType: !470, size: 64, offset: 3584)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "iterations", scope: !408, file: !73, line: 249, baseType: !417, size: 64, offset: 3648)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "total_colors", scope: !408, file: !73, line: 250, baseType: !417, size: 64, offset: 3712)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "start_loop", scope: !408, file: !73, line: 253, baseType: !470, size: 64, offset: 3776)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !408, file: !73, line: 256, baseType: !511, size: 192, offset: 3840)
!511 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErrorInfo", file: !512, line: 68, baseType: !513)
!512 = !DIFile(filename: "./magick/color.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!513 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ErrorInfo", file: !512, line: 62, size: 192, elements: !514)
!514 = !{!515, !516, !517}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "mean_error_per_pixel", scope: !513, file: !512, line: 65, baseType: !443, size: 64)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_mean_error", scope: !513, file: !512, line: 66, baseType: !443, size: 64, offset: 64)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_maximum_error", scope: !513, file: !512, line: 67, baseType: !443, size: 64, offset: 128)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !408, file: !73, line: 259, baseType: !519, size: 512, offset: 4032)
!519 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerInfo", file: !247, line: 51, baseType: !520)
!520 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TimerInfo", file: !247, line: 40, size: 512, elements: !521)
!521 = !{!522, !529, !530, !532}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !520, file: !247, line: 43, baseType: !523, size: 192)
!523 = !DIDerivedType(tag: DW_TAG_typedef, name: "Timer", file: !247, line: 38, baseType: !524)
!524 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Timer", file: !247, line: 32, size: 192, elements: !525)
!525 = !{!526, !527, !528}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !524, file: !247, line: 35, baseType: !443, size: 64)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !524, file: !247, line: 36, baseType: !443, size: 64, offset: 64)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !524, file: !247, line: 37, baseType: !443, size: 64, offset: 128)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "elapsed", scope: !520, file: !247, line: 44, baseType: !523, size: 192, offset: 192)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !520, file: !247, line: 47, baseType: !531, size: 32, offset: 384)
!531 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerState", file: !247, line: 30, baseType: !246)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !520, file: !247, line: 50, baseType: !417, size: 64, offset: 448)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !408, file: !73, line: 262, baseType: !534, size: 64, offset: 4544)
!534 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickProgressMonitor", file: !535, line: 26, baseType: !536)
!535 = !DIFile(filename: "./magick/monitor.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = !DISubroutineType(types: !538)
!538 = !{!422, !539, !541, !544, !461}
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64)
!540 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !466)
!541 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !542)
!542 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickOffsetType", file: !4, line: 150, baseType: !543)
!543 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!544 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !545)
!545 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickSizeType", file: !4, line: 151, baseType: !546)
!546 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !408, file: !73, line: 265, baseType: !461, size: 64, offset: 4608)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !408, file: !73, line: 266, baseType: !461, size: 64, offset: 4672)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !408, file: !73, line: 267, baseType: !461, size: 64, offset: 4736)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "ascii85", scope: !408, file: !73, line: 270, baseType: !551, size: 64, offset: 4800)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64)
!552 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ascii85Info", file: !48, line: 52, baseType: !553)
!553 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Ascii85Info", file: !48, line: 51, flags: DIFlagFwdDecl)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !408, file: !73, line: 273, baseType: !555, size: 64, offset: 4864)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64)
!556 = !DIDerivedType(tag: DW_TAG_typedef, name: "BlobInfo", file: !4, line: 217, baseType: !557)
!557 = !DICompositeType(tag: DW_TAG_structure_type, name: "_BlobInfo", file: !4, line: 217, flags: DIFlagFwdDecl)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !408, file: !73, line: 276, baseType: !559, size: 32768, offset: 4928)
!559 = !DICompositeType(tag: DW_TAG_array_type, baseType: !466, size: 32768, elements: !560)
!560 = !{!561}
!561 = !DISubrange(count: 4096)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "magick_filename", scope: !408, file: !73, line: 277, baseType: !559, size: 32768, offset: 37696)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !408, file: !73, line: 278, baseType: !559, size: 32768, offset: 70464)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "magick_columns", scope: !408, file: !73, line: 281, baseType: !417, size: 64, offset: 103232)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "magick_rows", scope: !408, file: !73, line: 282, baseType: !417, size: 64, offset: 103296)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "exception", scope: !408, file: !73, line: 285, baseType: !567, size: 448, offset: 103360)
!567 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionInfo", file: !4, line: 219, baseType: !568)
!568 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ExceptionInfo", file: !253, line: 102, size: 448, elements: !569)
!569 = !{!570, !572, !574, !575, !576, !577, !578, !583}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "severity", scope: !568, file: !253, line: 105, baseType: !571, size: 32)
!571 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionType", file: !253, line: 100, baseType: !252)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "error_number", scope: !568, file: !253, line: 108, baseType: !573, size: 32, offset: 32)
!573 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !568, file: !253, line: 111, baseType: !465, size: 64, offset: 64)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !568, file: !253, line: 112, baseType: !465, size: 64, offset: 128)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "exceptions", scope: !568, file: !253, line: 115, baseType: !461, size: 64, offset: 192)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "relinquish", scope: !568, file: !253, line: 118, baseType: !422, size: 32, offset: 256)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !568, file: !253, line: 121, baseType: !579, size: 64, offset: 320)
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64)
!580 = !DIDerivedType(tag: DW_TAG_typedef, name: "SemaphoreInfo", file: !581, line: 26, baseType: !582)
!581 = !DIFile(filename: "./magick/semaphore.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!582 = !DICompositeType(tag: DW_TAG_structure_type, name: "SemaphoreInfo", file: !581, line: 25, flags: DIFlagFwdDecl)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !568, file: !253, line: 124, baseType: !417, size: 64, offset: 384)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !408, file: !73, line: 288, baseType: !422, size: 32, offset: 103808)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !408, file: !73, line: 291, baseType: !586, size: 64, offset: 103872)
!586 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !470)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !408, file: !73, line: 294, baseType: !579, size: 64, offset: 103936)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "color_profile", scope: !408, file: !73, line: 297, baseType: !589, size: 256, offset: 104000)
!589 = !DIDerivedType(tag: DW_TAG_typedef, name: "ProfileInfo", file: !89, line: 40, baseType: !590)
!590 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ProfileInfo", file: !89, line: 27, size: 256, elements: !591)
!591 = !{!592, !593, !594, !597}
!592 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !590, file: !89, line: 30, baseType: !465, size: 64)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !590, file: !89, line: 33, baseType: !417, size: 64, offset: 64)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !590, file: !89, line: 36, baseType: !595, size: 64, offset: 128)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64)
!596 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !590, file: !89, line: 39, baseType: !417, size: 64, offset: 192)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "iptc_profile", scope: !408, file: !73, line: 298, baseType: !589, size: 256, offset: 104256)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profile", scope: !408, file: !73, line: 299, baseType: !600, size: 64, offset: 104512)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 64)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profiles", scope: !408, file: !73, line: 302, baseType: !417, size: 64, offset: 104576)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !408, file: !73, line: 305, baseType: !417, size: 64, offset: 104640)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !408, file: !73, line: 308, baseType: !503, size: 64, offset: 104704)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !408, file: !73, line: 309, baseType: !503, size: 64, offset: 104768)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !408, file: !73, line: 310, baseType: !503, size: 64, offset: 104832)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "interpolate", scope: !408, file: !73, line: 313, baseType: !607, size: 32, offset: 104896)
!607 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterpolatePixelMethod", file: !326, line: 47, baseType: !325)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "black_point_compensation", scope: !408, file: !73, line: 316, baseType: !422, size: 32, offset: 104928)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_color", scope: !408, file: !73, line: 319, baseType: !430, size: 64, offset: 104960)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !408, file: !73, line: 322, baseType: !503, size: 64, offset: 105024)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "tile_offset", scope: !408, file: !73, line: 325, baseType: !478, size: 256, offset: 105088)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !408, file: !73, line: 328, baseType: !461, size: 64, offset: 105344)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "artifacts", scope: !408, file: !73, line: 329, baseType: !461, size: 64, offset: 105408)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !408, file: !73, line: 332, baseType: !615, size: 32, offset: 105472)
!615 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageType", file: !73, line: 61, baseType: !342)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !408, file: !73, line: 335, baseType: !422, size: 32, offset: 105504)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !408, file: !73, line: 338, baseType: !545, size: 64, offset: 105536)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "ping", scope: !408, file: !73, line: 341, baseType: !422, size: 32, offset: 105600)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !408, file: !73, line: 344, baseType: !417, size: 64, offset: 105664)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !408, file: !73, line: 347, baseType: !621, size: 64, offset: 105728)
!621 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !622, line: 7, baseType: !623)
!622 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "")
!623 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !473, line: 160, baseType: !474)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "intensity", scope: !408, file: !73, line: 350, baseType: !625, size: 32, offset: 105792)
!625 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelIntensityMethod", file: !326, line: 79, baseType: !356)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !408, file: !73, line: 353, baseType: !417, size: 64, offset: 105856)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 64)
!629 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !430)
!630 = !{i32 7, !"Dwarf Version", i32 4}
!631 = !{i32 2, !"Debug Info Version", i32 3}
!632 = !{i32 1, !"wchar_size", i32 4}
!633 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!634 = distinct !DISubprogram(name: "ComplexImages", scope: !1, file: !1, line: 130, type: !635, scopeLine: 132, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !642)
!635 = !DISubroutineType(types: !636)
!636 = !{!406, !637, !639, !641}
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 64)
!638 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !407)
!639 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !640)
!640 = !DIDerivedType(tag: DW_TAG_typedef, name: "ComplexOperator", file: !369, line: 35, baseType: !368)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64)
!642 = !{}
!643 = !DILocalVariable(name: "images", arg: 1, scope: !634, file: !1, line: 130, type: !637)
!644 = !DILocation(line: 130, column: 48, scope: !634)
!645 = !DILocalVariable(name: "op", arg: 2, scope: !634, file: !1, line: 130, type: !639)
!646 = !DILocation(line: 130, column: 77, scope: !634)
!647 = !DILocalVariable(name: "exception", arg: 3, scope: !634, file: !1, line: 131, type: !641)
!648 = !DILocation(line: 131, column: 18, scope: !634)
!649 = !DILocalVariable(name: "Ai_view", scope: !634, file: !1, line: 136, type: !650)
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 64)
!651 = !DIDerivedType(tag: DW_TAG_typedef, name: "CacheView", file: !652, line: 50, baseType: !653)
!652 = !DIFile(filename: "./magick/cache-view.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!653 = !DICompositeType(tag: DW_TAG_structure_type, name: "_CacheView", file: !326, line: 160, flags: DIFlagFwdDecl)
!654 = !DILocation(line: 136, column: 6, scope: !634)
!655 = !DILocalVariable(name: "Ar_view", scope: !634, file: !1, line: 137, type: !650)
!656 = !DILocation(line: 137, column: 6, scope: !634)
!657 = !DILocalVariable(name: "Bi_view", scope: !634, file: !1, line: 138, type: !650)
!658 = !DILocation(line: 138, column: 6, scope: !634)
!659 = !DILocalVariable(name: "Br_view", scope: !634, file: !1, line: 139, type: !650)
!660 = !DILocation(line: 139, column: 6, scope: !634)
!661 = !DILocalVariable(name: "Ci_view", scope: !634, file: !1, line: 140, type: !650)
!662 = !DILocation(line: 140, column: 6, scope: !634)
!663 = !DILocalVariable(name: "Cr_view", scope: !634, file: !1, line: 141, type: !650)
!664 = !DILocation(line: 141, column: 6, scope: !634)
!665 = !DILocalVariable(name: "artifact", scope: !634, file: !1, line: 144, type: !539)
!666 = !DILocation(line: 144, column: 6, scope: !634)
!667 = !DILocalVariable(name: "Ai_image", scope: !634, file: !1, line: 147, type: !637)
!668 = !DILocation(line: 147, column: 6, scope: !634)
!669 = !DILocalVariable(name: "Ar_image", scope: !634, file: !1, line: 148, type: !637)
!670 = !DILocation(line: 148, column: 6, scope: !634)
!671 = !DILocalVariable(name: "Bi_image", scope: !634, file: !1, line: 149, type: !637)
!672 = !DILocation(line: 149, column: 6, scope: !634)
!673 = !DILocalVariable(name: "Br_image", scope: !634, file: !1, line: 150, type: !637)
!674 = !DILocation(line: 150, column: 6, scope: !634)
!675 = !DILocalVariable(name: "snr", scope: !634, file: !1, line: 153, type: !443)
!676 = !DILocation(line: 153, column: 5, scope: !634)
!677 = !DILocalVariable(name: "Ci_image", scope: !634, file: !1, line: 156, type: !406)
!678 = !DILocation(line: 156, column: 6, scope: !634)
