; ModuleID = 'wand/magick-image.c'
source_filename = "wand/magick-image.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._Image = type { i32, i32, i32, i64, i32, i32, i32, i64, i64, i64, i64, %struct._PixelPacket*, %struct._PixelPacket, %struct._PixelPacket, %struct._PixelPacket, double, %struct._ChromaticityInfo, i32, i8*, i32, i8*, i8*, i8*, i64, double, double, %struct._RectangleInfo, %struct._RectangleInfo, %struct._RectangleInfo, double, double, double, i32, i32, i32, i32, i32, i32, %struct._Image*, i64, i64, i64, i64, i64, i64, %struct._ErrorInfo, %struct._TimerInfo, i32 (i8*, i64, i64, i8*)*, i8*, i8*, i8*, %struct._Ascii85Info*, %struct._BlobInfo*, [4096 x i8], [4096 x i8], [4096 x i8], i64, i64, %struct._ExceptionInfo, i32, i64, %struct.SemaphoreInfo*, %struct._ProfileInfo, %struct._ProfileInfo, %struct._ProfileInfo*, i64, i64, %struct._Image*, %struct._Image*, %struct._Image*, i32, i32, %struct._PixelPacket, %struct._Image*, %struct._RectangleInfo, i8*, i8*, i32, i32, i64, i32, i64, i64, i32, i64 }
%struct._ChromaticityInfo = type { %struct._PrimaryInfo, %struct._PrimaryInfo, %struct._PrimaryInfo, %struct._PrimaryInfo }
%struct._PrimaryInfo = type { double, double, double }
%struct._ErrorInfo = type { double, double, double }
%struct._TimerInfo = type { %struct._Timer, %struct._Timer, i32, i64 }
%struct._Timer = type { double, double, double }

!731 = !DIEnumerator(name: "DilateIntensityMorphology", value: 6, isUnsigned: true)
!732 = !DIEnumerator(name: "DistanceMorphology", value: 7, isUnsigned: true)
!733 = !DIEnumerator(name: "OpenMorphology", value: 8, isUnsigned: true)
!734 = !DIEnumerator(name: "CloseMorphology", value: 9, isUnsigned: true)
!735 = !DIEnumerator(name: "OpenIntensityMorphology", value: 10, isUnsigned: true)
!736 = !DIEnumerator(name: "CloseIntensityMorphology", value: 11, isUnsigned: true)
!737 = !DIEnumerator(name: "SmoothMorphology", value: 12, isUnsigned: true)
!738 = !DIEnumerator(name: "EdgeInMorphology", value: 13, isUnsigned: true)
!739 = !DIEnumerator(name: "EdgeOutMorphology", value: 14, isUnsigned: true)
!740 = !DIEnumerator(name: "EdgeMorphology", value: 15, isUnsigned: true)
!741 = !DIEnumerator(name: "TopHatMorphology", value: 16, isUnsigned: true)
!742 = !DIEnumerator(name: "BottomHatMorphology", value: 17, isUnsigned: true)
!743 = !DIEnumerator(name: "HitAndMissMorphology", value: 18, isUnsigned: true)
!744 = !DIEnumerator(name: "ThinningMorphology", value: 19, isUnsigned: true)
!745 = !DIEnumerator(name: "ThickenMorphology", value: 20, isUnsigned: true)
!746 = !DIEnumerator(name: "VoronoiMorphology", value: 21, isUnsigned: true)
!747 = !DIEnumerator(name: "IterativeDistanceMorphology", value: 22, isUnsigned: true)
!748 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !73, line: 30, baseType: !5, size: 32, elements: !749)
!749 = !{!750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762}
!750 = !DIEnumerator(name: "UndefinedAlphaChannel", value: 0, isUnsigned: true)
!751 = !DIEnumerator(name: "ActivateAlphaChannel", value: 1, isUnsigned: true)
!752 = !DIEnumerator(name: "BackgroundAlphaChannel", value: 2, isUnsigned: true)
!753 = !DIEnumerator(name: "CopyAlphaChannel", value: 3, isUnsigned: true)
!754 = !DIEnumerator(name: "DeactivateAlphaChannel", value: 4, isUnsigned: true)
!755 = !DIEnumerator(name: "ExtractAlphaChannel", value: 5, isUnsigned: true)
!756 = !DIEnumerator(name: "OpaqueAlphaChannel", value: 6, isUnsigned: true)
!757 = !DIEnumerator(name: "ResetAlphaChannel", value: 7, isUnsigned: true)
!758 = !DIEnumerator(name: "SetAlphaChannel", value: 8, isUnsigned: true)
!759 = !DIEnumerator(name: "ShapeAlphaChannel", value: 9, isUnsigned: true)
!760 = !DIEnumerator(name: "TransparentAlphaChannel", value: 10, isUnsigned: true)
!761 = !DIEnumerator(name: "FlattenAlphaChannel", value: 11, isUnsigned: true)
!762 = !DIEnumerator(name: "RemoveAlphaChannel", value: 12, isUnsigned: true)
!763 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !764, line: 28, baseType: !5, size: 32, elements: !765)
!764 = !DIFile(filename: "./magick/magick.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!765 = !{!766, !767, !768}
!766 = !DIEnumerator(name: "UndefinedFormatType", value: 0, isUnsigned: true)
!767 = !DIEnumerator(name: "ImplicitFormatType", value: 1, isUnsigned: true)
!768 = !DIEnumerator(name: "ExplicitFormatType", value: 2, isUnsigned: true)
!769 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !652, line: 58, baseType: !5, size: 32, elements: !770)
!770 = !{!771, !772, !773, !774, !775, !776, !777}
!771 = !DIEnumerator(name: "UndefinedColorInterpolate", value: 0, isUnsigned: true)
!772 = !DIEnumerator(name: "BarycentricColorInterpolate", value: 1, isUnsigned: true)
!773 = !DIEnumerator(name: "BilinearColorInterpolate", value: 7, isUnsigned: true)
!774 = !DIEnumerator(name: "PolynomialColorInterpolate", value: 8, isUnsigned: true)
!775 = !DIEnumerator(name: "ShepardsColorInterpolate", value: 16, isUnsigned: true)
!776 = !DIEnumerator(name: "VoronoiColorInterpolate", value: 18, isUnsigned: true)
!777 = !DIEnumerator(name: "InverseColorInterpolate", value: 19, isUnsigned: true)
!778 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !675, line: 113, baseType: !5, size: 32, elements: !779)
!779 = !{!780, !781, !782, !783, !784, !785, !786, !787, !788}
!780 = !DIEnumerator(name: "UndefinedStatistic", value: 0, isUnsigned: true)
!781 = !DIEnumerator(name: "GradientStatistic", value: 1, isUnsigned: true)
!782 = !DIEnumerator(name: "MaximumStatistic", value: 2, isUnsigned: true)
!783 = !DIEnumerator(name: "MeanStatistic", value: 3, isUnsigned: true)
!784 = !DIEnumerator(name: "MedianStatistic", value: 4, isUnsigned: true)
!785 = !DIEnumerator(name: "MinimumStatistic", value: 5, isUnsigned: true)
!786 = !DIEnumerator(name: "ModeStatistic", value: 6, isUnsigned: true)
!787 = !DIEnumerator(name: "NonpeakStatistic", value: 7, isUnsigned: true)
!788 = !DIEnumerator(name: "StandardDeviationStatistic", value: 8, isUnsigned: true)
!789 = !{!790, !791, !846, !1012, !1143, !828, !819, !1304, !1324, !850, !1326, !855, !980, !1117, !1330, !1352, !814, !1216, !886, !1368, !1369, !802, !1378, !844, !924, !1380, !1287, !1402, !1063, !919, !958}
!790 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 64)
!792 = !DIDerivedType(tag: DW_TAG_typedef, name: "Image", file: !4, line: 221, baseType: !793)
!793 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Image", file: !73, line: 150, size: 105920, elements: !794)
!794 = !{!795, !797, !799, !801, !804, !806, !808, !809, !810, !811, !812, !813, !824, !825, !826, !827, !829, !843, !845, !847, !849, !852, !853, !854, !860, !861, !862, !870, !871, !872, !873, !874, !875, !877, !879, !881, !883, !885, !887, !889, !890, !891, !892, !893, !894, !895, !903, !918, !932, !933, !934, !935, !939, !943, !947, !948, !949, !950, !951, !969, !970, !972, !973, !983, !984, !986, !987, !988, !989, !990, !991, !993, !994, !995, !996, !997, !998, !999, !1001, !1002, !1003, !1004, !1005, !1009, !1011}
!795 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !793, file: !73, line: 153, baseType: !796, size: 32)
!796 = !DIDerivedType(tag: DW_TAG_typedef, name: "ClassType", file: !4, line: 209, baseType: !3)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !793, file: !73, line: 156, baseType: !798, size: 32, offset: 32)
!798 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorspaceType", file: !11, line: 61, baseType: !10)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !793, file: !73, line: 159, baseType: !800, size: 32, offset: 64)
!800 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompressionType", file: !48, line: 49, baseType: !47)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !793, file: !73, line: 162, baseType: !802, size: 64, offset: 128)
!802 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !803, line: 46, baseType: !790)
!803 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!804 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !793, file: !73, line: 165, baseType: !805, size: 32, offset: 192)
!805 = !DIDerivedType(tag: DW_TAG_typedef, name: "OrientationType", file: !73, line: 86, baseType: !72)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "taint", scope: !793, file: !73, line: 168, baseType: !807, size: 32, offset: 224)
!807 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickBooleanType", file: !4, line: 215, baseType: !84)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "matte", scope: !793, file: !73, line: 169, baseType: !807, size: 32, offset: 256)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !793, file: !73, line: 172, baseType: !802, size: 64, offset: 320)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !793, file: !73, line: 173, baseType: !802, size: 64, offset: 384)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !793, file: !73, line: 174, baseType: !802, size: 64, offset: 448)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !793, file: !73, line: 175, baseType: !802, size: 64, offset: 512)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "colormap", scope: !793, file: !73, line: 178, baseType: !814, size: 64, offset: 576)
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !815, size: 64)
!815 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelPacket", file: !326, line: 148, baseType: !816)
!816 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PixelPacket", file: !326, line: 131, size: 64, elements: !817)
!817 = !{!818, !821, !822, !823}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !816, file: !326, line: 143, baseType: !819, size: 16)
!819 = !DIDerivedType(tag: DW_TAG_typedef, name: "Quantum", file: !4, line: 93, baseType: !820)
!820 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !816, file: !326, line: 144, baseType: !819, size: 16, offset: 16)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !816, file: !326, line: 145, baseType: !819, size: 16, offset: 32)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !816, file: !326, line: 146, baseType: !819, size: 16, offset: 48)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "background_color", scope: !793, file: !73, line: 179, baseType: !815, size: 64, offset: 640)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !793, file: !73, line: 180, baseType: !815, size: 64, offset: 704)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "matte_color", scope: !793, file: !73, line: 181, baseType: !815, size: 64, offset: 768)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !793, file: !73, line: 184, baseType: !828, size: 64, offset: 832)
!828 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "chromaticity", scope: !793, file: !73, line: 187, baseType: !830, size: 768, offset: 896)
!830 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChromaticityInfo", file: !73, line: 128, baseType: !831)
!831 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ChromaticityInfo", file: !73, line: 121, size: 768, elements: !832)
!832 = !{!833, !840, !841, !842}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "red_primary", scope: !831, file: !73, line: 124, baseType: !834, size: 192)
!834 = !DIDerivedType(tag: DW_TAG_typedef, name: "PrimaryInfo", file: !73, line: 101, baseType: !835)
!835 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PrimaryInfo", file: !73, line: 95, size: 192, elements: !836)
!836 = !{!837, !838, !839}
!837 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !835, file: !73, line: 98, baseType: !828, size: 64)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !835, file: !73, line: 99, baseType: !828, size: 64, offset: 64)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !835, file: !73, line: 100, baseType: !828, size: 64, offset: 128)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "green_primary", scope: !831, file: !73, line: 125, baseType: !834, size: 192, offset: 192)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "blue_primary", scope: !831, file: !73, line: 126, baseType: !834, size: 192, offset: 384)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "white_point", scope: !831, file: !73, line: 127, baseType: !834, size: 192, offset: 576)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "rendering_intent", scope: !793, file: !73, line: 190, baseType: !844, size: 32, offset: 1664)
!844 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderingIntent", file: !89, line: 49, baseType: !88)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !793, file: !73, line: 193, baseType: !846, size: 64, offset: 1728)
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !793, file: !73, line: 196, baseType: !848, size: 32, offset: 1792)
!848 = !DIDerivedType(tag: DW_TAG_typedef, name: "ResolutionType", file: !73, line: 93, baseType: !96)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "montage", scope: !793, file: !73, line: 199, baseType: !850, size: 64, offset: 1856)
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !851, size: 64)
!851 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "directory", scope: !793, file: !73, line: 200, baseType: !850, size: 64, offset: 1920)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "geometry", scope: !793, file: !73, line: 201, baseType: !850, size: 64, offset: 1984)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !793, file: !73, line: 204, baseType: !855, size: 64, offset: 2048)
!855 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !856, line: 77, baseType: !857)
!856 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!857 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !858, line: 193, baseType: !859)
!858 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!859 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "x_resolution", scope: !793, file: !73, line: 207, baseType: !828, size: 64, offset: 2112)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "y_resolution", scope: !793, file: !73, line: 208, baseType: !828, size: 64, offset: 2176)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !793, file: !73, line: 211, baseType: !863, size: 256, offset: 2240)
!863 = !DIDerivedType(tag: DW_TAG_typedef, name: "RectangleInfo", file: !153, line: 130, baseType: !864)
!864 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_RectangleInfo", file: !153, line: 121, size: 256, elements: !865)
!865 = !{!866, !867, !868, !869}
!866 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !864, file: !153, line: 124, baseType: !802, size: 64)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !864, file: !153, line: 125, baseType: !802, size: 64, offset: 64)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !864, file: !153, line: 128, baseType: !855, size: 64, offset: 128)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !864, file: !153, line: 129, baseType: !855, size: 64, offset: 192)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "extract_info", scope: !793, file: !73, line: 212, baseType: !863, size: 256, offset: 2496)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "tile_info", scope: !793, file: !73, line: 213, baseType: !863, size: 256, offset: 2752)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "bias", scope: !793, file: !73, line: 216, baseType: !828, size: 64, offset: 3008)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "blur", scope: !793, file: !73, line: 217, baseType: !828, size: 64, offset: 3072)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !793, file: !73, line: 218, baseType: !828, size: 64, offset: 3136)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !793, file: !73, line: 221, baseType: !876, size: 32, offset: 3200)
!876 = !DIDerivedType(tag: DW_TAG_typedef, name: "FilterTypes", file: !102, line: 66, baseType: !101)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "interlace", scope: !793, file: !73, line: 224, baseType: !878, size: 32, offset: 3232)
!878 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterlaceType", file: !73, line: 73, baseType: !136)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !793, file: !73, line: 227, baseType: !880, size: 32, offset: 3264)
!880 = !DIDerivedType(tag: DW_TAG_typedef, name: "EndianType", file: !147, line: 35, baseType: !146)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !793, file: !73, line: 230, baseType: !882, size: 32, offset: 3296)
!882 = !DIDerivedType(tag: DW_TAG_typedef, name: "GravityType", file: !153, line: 91, baseType: !152)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !793, file: !73, line: 233, baseType: !884, size: 32, offset: 3328)
!884 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompositeOperator", file: !168, line: 99, baseType: !167)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "dispose", scope: !793, file: !73, line: 236, baseType: !886, size: 32, offset: 3360)
!886 = !DIDerivedType(tag: DW_TAG_typedef, name: "DisposeType", file: !239, line: 32, baseType: !238)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "clip_mask", scope: !793, file: !73, line: 239, baseType: !888, size: 64, offset: 3392)
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !793, size: 64)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !793, file: !73, line: 242, baseType: !802, size: 64, offset: 3456)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !793, file: !73, line: 243, baseType: !802, size: 64, offset: 3520)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_second", scope: !793, file: !73, line: 246, baseType: !855, size: 64, offset: 3584)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "iterations", scope: !793, file: !73, line: 249, baseType: !802, size: 64, offset: 3648)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "total_colors", scope: !793, file: !73, line: 250, baseType: !802, size: 64, offset: 3712)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "start_loop", scope: !793, file: !73, line: 253, baseType: !855, size: 64, offset: 3776)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !793, file: !73, line: 256, baseType: !896, size: 192, offset: 3840)
!896 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErrorInfo", file: !897, line: 68, baseType: !898)
!897 = !DIFile(filename: "./magick/color.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!898 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ErrorInfo", file: !897, line: 62, size: 192, elements: !899)
!899 = !{!900, !901, !902}
!900 = !DIDerivedType(tag: DW_TAG_member, name: "mean_error_per_pixel", scope: !898, file: !897, line: 65, baseType: !828, size: 64)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_mean_error", scope: !898, file: !897, line: 66, baseType: !828, size: 64, offset: 64)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_maximum_error", scope: !898, file: !897, line: 67, baseType: !828, size: 64, offset: 128)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !793, file: !73, line: 259, baseType: !904, size: 512, offset: 4032)
!904 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerInfo", file: !247, line: 51, baseType: !905)
!905 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TimerInfo", file: !247, line: 40, size: 512, elements: !906)
!906 = !{!907, !914, !915, !917}
!907 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !905, file: !247, line: 43, baseType: !908, size: 192)
!908 = !DIDerivedType(tag: DW_TAG_typedef, name: "Timer", file: !247, line: 38, baseType: !909)
!909 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Timer", file: !247, line: 32, size: 192, elements: !910)
!910 = !{!911, !912, !913}
!911 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !909, file: !247, line: 35, baseType: !828, size: 64)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !909, file: !247, line: 36, baseType: !828, size: 64, offset: 64)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !909, file: !247, line: 37, baseType: !828, size: 64, offset: 128)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "elapsed", scope: !905, file: !247, line: 44, baseType: !908, size: 192, offset: 192)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !905, file: !247, line: 47, baseType: !916, size: 32, offset: 384)
!916 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerState", file: !247, line: 30, baseType: !246)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !905, file: !247, line: 50, baseType: !802, size: 64, offset: 448)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !793, file: !73, line: 262, baseType: !919, size: 64, offset: 4544)
!919 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickProgressMonitor", file: !920, line: 26, baseType: !921)
!920 = !DIFile(filename: "./magick/monitor.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !922, size: 64)
!922 = !DISubroutineType(types: !923)
!923 = !{!807, !924, !926, !929, !846}
!924 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !925, size: 64)
!925 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !851)
!926 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !927)
!927 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickOffsetType", file: !4, line: 150, baseType: !928)
!928 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!929 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !930)
!930 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickSizeType", file: !4, line: 151, baseType: !931)
!931 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !793, file: !73, line: 265, baseType: !846, size: 64, offset: 4608)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !793, file: !73, line: 266, baseType: !846, size: 64, offset: 4672)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !793, file: !73, line: 267, baseType: !846, size: 64, offset: 4736)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "ascii85", scope: !793, file: !73, line: 270, baseType: !936, size: 64, offset: 4800)
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 64)
!937 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ascii85Info", file: !48, line: 52, baseType: !938)
!938 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Ascii85Info", file: !48, line: 51, flags: DIFlagFwdDecl)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !793, file: !73, line: 273, baseType: !940, size: 64, offset: 4864)
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 64)
!941 = !DIDerivedType(tag: DW_TAG_typedef, name: "BlobInfo", file: !4, line: 217, baseType: !942)
!942 = !DICompositeType(tag: DW_TAG_structure_type, name: "_BlobInfo", file: !4, line: 217, flags: DIFlagFwdDecl)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !793, file: !73, line: 276, baseType: !944, size: 32768, offset: 4928)
!944 = !DICompositeType(tag: DW_TAG_array_type, baseType: !851, size: 32768, elements: !945)
!945 = !{!946}
!946 = !DISubrange(count: 4096)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "magick_filename", scope: !793, file: !73, line: 277, baseType: !944, size: 32768, offset: 37696)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !793, file: !73, line: 278, baseType: !944, size: 32768, offset: 70464)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "magick_columns", scope: !793, file: !73, line: 281, baseType: !802, size: 64, offset: 103232)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "magick_rows", scope: !793, file: !73, line: 282, baseType: !802, size: 64, offset: 103296)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "exception", scope: !793, file: !73, line: 285, baseType: !952, size: 448, offset: 103360)
!952 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionInfo", file: !4, line: 219, baseType: !953)
!953 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ExceptionInfo", file: !253, line: 102, size: 448, elements: !954)
!954 = !{!955, !957, !959, !960, !961, !962, !963, !968}
!955 = !DIDerivedType(tag: DW_TAG_member, name: "severity", scope: !953, file: !253, line: 105, baseType: !956, size: 32)
!956 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionType", file: !253, line: 100, baseType: !252)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "error_number", scope: !953, file: !253, line: 108, baseType: !958, size: 32, offset: 32)
!958 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !953, file: !253, line: 111, baseType: !850, size: 64, offset: 64)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !953, file: !253, line: 112, baseType: !850, size: 64, offset: 128)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "exceptions", scope: !953, file: !253, line: 115, baseType: !846, size: 64, offset: 192)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "relinquish", scope: !953, file: !253, line: 118, baseType: !807, size: 32, offset: 256)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !953, file: !253, line: 121, baseType: !964, size: 64, offset: 320)
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !965, size: 64)
!965 = !DIDerivedType(tag: DW_TAG_typedef, name: "SemaphoreInfo", file: !966, line: 26, baseType: !967)
!966 = !DIFile(filename: "./magick/semaphore.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!967 = !DICompositeType(tag: DW_TAG_structure_type, name: "SemaphoreInfo", file: !966, line: 25, flags: DIFlagFwdDecl)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !953, file: !253, line: 124, baseType: !802, size: 64, offset: 384)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !793, file: !73, line: 288, baseType: !807, size: 32, offset: 103808)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !793, file: !73, line: 291, baseType: !971, size: 64, offset: 103872)
!971 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !855)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !793, file: !73, line: 294, baseType: !964, size: 64, offset: 103936)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "color_profile", scope: !793, file: !73, line: 297, baseType: !974, size: 256, offset: 104000)
!974 = !DIDerivedType(tag: DW_TAG_typedef, name: "ProfileInfo", file: !89, line: 40, baseType: !975)
!975 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ProfileInfo", file: !89, line: 27, size: 256, elements: !976)
!976 = !{!977, !978, !979, !982}
!977 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !975, file: !89, line: 30, baseType: !850, size: 64)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !975, file: !89, line: 33, baseType: !802, size: 64, offset: 64)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !975, file: !89, line: 36, baseType: !980, size: 64, offset: 128)
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 64)
!981 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !975, file: !89, line: 39, baseType: !802, size: 64, offset: 192)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "iptc_profile", scope: !793, file: !73, line: 298, baseType: !974, size: 256, offset: 104256)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profile", scope: !793, file: !73, line: 299, baseType: !985, size: 64, offset: 104512)
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profiles", scope: !793, file: !73, line: 302, baseType: !802, size: 64, offset: 104576)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !793, file: !73, line: 305, baseType: !802, size: 64, offset: 104640)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !793, file: !73, line: 308, baseType: !888, size: 64, offset: 104704)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !793, file: !73, line: 309, baseType: !888, size: 64, offset: 104768)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !793, file: !73, line: 310, baseType: !888, size: 64, offset: 104832)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "interpolate", scope: !793, file: !73, line: 313, baseType: !992, size: 32, offset: 104896)
!992 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterpolatePixelMethod", file: !326, line: 47, baseType: !325)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "black_point_compensation", scope: !793, file: !73, line: 316, baseType: !807, size: 32, offset: 104928)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_color", scope: !793, file: !73, line: 319, baseType: !815, size: 64, offset: 104960)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !793, file: !73, line: 322, baseType: !888, size: 64, offset: 105024)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "tile_offset", scope: !793, file: !73, line: 325, baseType: !863, size: 256, offset: 105088)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !793, file: !73, line: 328, baseType: !846, size: 64, offset: 105344)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "artifacts", scope: !793, file: !73, line: 329, baseType: !846, size: 64, offset: 105408)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !793, file: !73, line: 332, baseType: !1000, size: 32, offset: 105472)
!1000 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageType", file: !73, line: 61, baseType: !342)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !793, file: !73, line: 335, baseType: !807, size: 32, offset: 105504)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !793, file: !73, line: 338, baseType: !930, size: 64, offset: 105536)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "ping", scope: !793, file: !73, line: 341, baseType: !807, size: 32, offset: 105600)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !793, file: !73, line: 344, baseType: !802, size: 64, offset: 105664)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !793, file: !73, line: 347, baseType: !1006, size: 64, offset: 105728)
!1006 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !1007, line: 7, baseType: !1008)
!1007 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "")
!1008 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !858, line: 160, baseType: !859)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "intensity", scope: !793, file: !73, line: 350, baseType: !1010, size: 32, offset: 105792)
!1010 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelIntensityMethod", file: !326, line: 79, baseType: !356)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !793, file: !73, line: 353, baseType: !802, size: 64, offset: 105856)
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1013, size: 64)
!1013 = !DIDerivedType(tag: DW_TAG_typedef, name: "DrawInfo", file: !488, line: 333, baseType: !1014)
!1014 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DrawInfo", file: !488, line: 205, size: 5760, elements: !1015)
!1015 = !{!1016, !1017, !1018, !1019, !1029, !1030, !1031, !1032, !1033, !1082, !1083, !1084, !1085, !1086, !1087, !1089, !1091, !1093, !1094, !1095, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1105, !1107, !1108, !1109, !1110, !1111, !1113, !1114, !1115, !1116, !1118, !1119, !1120, !1122, !1123, !1124, !1136, !1137, !1138, !1139, !1140, !1141}
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "primitive", scope: !1014, file: !488, line: 208, baseType: !850, size: 64)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "geometry", scope: !1014, file: !488, line: 209, baseType: !850, size: 64, offset: 64)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "viewbox", scope: !1014, file: !488, line: 212, baseType: !863, size: 256, offset: 128)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "affine", scope: !1014, file: !488, line: 215, baseType: !1020, size: 384, offset: 384)
!1020 = !DIDerivedType(tag: DW_TAG_typedef, name: "AffineMatrix", file: !153, line: 102, baseType: !1021)
!1021 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_AffineMatrix", file: !153, line: 93, size: 384, elements: !1022)
!1022 = !{!1023, !1024, !1025, !1026, !1027, !1028}
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !1021, file: !153, line: 96, baseType: !828, size: 64)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "rx", scope: !1021, file: !153, line: 97, baseType: !828, size: 64, offset: 64)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "ry", scope: !1021, file: !153, line: 98, baseType: !828, size: 64, offset: 128)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !1021, file: !153, line: 99, baseType: !828, size: 64, offset: 192)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "tx", scope: !1021, file: !153, line: 100, baseType: !828, size: 64, offset: 256)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "ty", scope: !1021, file: !153, line: 101, baseType: !828, size: 64, offset: 320)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !1014, file: !488, line: 218, baseType: !882, size: 32, offset: 768)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !1014, file: !488, line: 221, baseType: !815, size: 64, offset: 800)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "stroke", scope: !1014, file: !488, line: 222, baseType: !815, size: 64, offset: 864)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "stroke_width", scope: !1014, file: !488, line: 225, baseType: !828, size: 64, offset: 960)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "gradient", scope: !1014, file: !488, line: 228, baseType: !1034, size: 1024, offset: 1024)
!1034 = !DIDerivedType(tag: DW_TAG_typedef, name: "GradientInfo", file: !488, line: 184, baseType: !1035)
!1035 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GradientInfo", file: !488, line: 153, size: 1024, elements: !1036)
!1036 = !{!1037, !1039, !1040, !1048, !1070, !1071, !1073, !1074, !1075, !1081}
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1035, file: !488, line: 156, baseType: !1038, size: 32)
!1038 = !DIDerivedType(tag: DW_TAG_typedef, name: "GradientType", file: !488, line: 75, baseType: !487)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "bounding_box", scope: !1035, file: !488, line: 159, baseType: !863, size: 256, offset: 64)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "gradient_vector", scope: !1035, file: !488, line: 162, baseType: !1041, size: 256, offset: 320)
!1041 = !DIDerivedType(tag: DW_TAG_typedef, name: "SegmentInfo", file: !73, line: 110, baseType: !1042)
!1042 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SegmentInfo", file: !73, line: 103, size: 256, elements: !1043)
!1043 = !{!1044, !1045, !1046, !1047}
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "x1", scope: !1042, file: !73, line: 106, baseType: !828, size: 64)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "y1", scope: !1042, file: !73, line: 107, baseType: !828, size: 64, offset: 64)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "x2", scope: !1042, file: !73, line: 108, baseType: !828, size: 64, offset: 128)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "y2", scope: !1042, file: !73, line: 109, baseType: !828, size: 64, offset: 192)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "stops", scope: !1035, file: !488, line: 165, baseType: !1049, size: 64, offset: 576)
!1049 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1050, size: 64)
!1050 = !DIDerivedType(tag: DW_TAG_typedef, name: "StopInfo", file: !488, line: 151, baseType: !1051)
!1051 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_StopInfo", file: !488, line: 144, size: 512, elements: !1052)
!1052 = !{!1053, !1069}
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !1051, file: !488, line: 147, baseType: !1054, size: 448)
!1054 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickPixelPacket", file: !326, line: 127, baseType: !1055)
!1055 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MagickPixelPacket", file: !326, line: 104, size: 448, elements: !1056)
!1056 = !{!1057, !1058, !1059, !1060, !1061, !1062, !1065, !1066, !1067, !1068}
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !1055, file: !326, line: 107, baseType: !796, size: 32)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1055, file: !326, line: 110, baseType: !798, size: 32, offset: 32)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "matte", scope: !1055, file: !326, line: 113, baseType: !807, size: 32, offset: 64)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !1055, file: !326, line: 116, baseType: !828, size: 64, offset: 128)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !1055, file: !326, line: 119, baseType: !802, size: 64, offset: 192)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !1055, file: !326, line: 122, baseType: !1063, size: 32, offset: 256)
!1063 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickRealType", file: !4, line: 78, baseType: !1064)
!1064 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !1055, file: !326, line: 123, baseType: !1063, size: 32, offset: 288)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !1055, file: !326, line: 124, baseType: !1063, size: 32, offset: 320)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !1055, file: !326, line: 125, baseType: !1063, size: 32, offset: 352)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1055, file: !326, line: 126, baseType: !1063, size: 32, offset: 384)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1051, file: !488, line: 150, baseType: !1063, size: 32, offset: 448)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "number_stops", scope: !1035, file: !488, line: 168, baseType: !802, size: 64, offset: 640)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "spread", scope: !1035, file: !488, line: 171, baseType: !1072, size: 32, offset: 704)
!1072 = !DIDerivedType(tag: DW_TAG_typedef, name: "SpreadMethod", file: !488, line: 135, baseType: !493)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1035, file: !488, line: 174, baseType: !807, size: 32, offset: 736)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !1035, file: !488, line: 177, baseType: !802, size: 64, offset: 768)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "center", scope: !1035, file: !488, line: 180, baseType: !1076, size: 128, offset: 832)
!1076 = !DIDerivedType(tag: DW_TAG_typedef, name: "PointInfo", file: !488, line: 142, baseType: !1077)
!1077 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PointInfo", file: !488, line: 137, size: 128, elements: !1078)
!1078 = !{!1079, !1080}
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1077, file: !488, line: 140, baseType: !828, size: 64)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1077, file: !488, line: 141, baseType: !828, size: 64, offset: 64)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "radius", scope: !1035, file: !488, line: 183, baseType: !1063, size: 32, offset: 960)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "fill_pattern", scope: !1014, file: !488, line: 231, baseType: !791, size: 64, offset: 2048)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "tile", scope: !1014, file: !488, line: 232, baseType: !791, size: 64, offset: 2112)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "stroke_pattern", scope: !1014, file: !488, line: 233, baseType: !791, size: 64, offset: 2176)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "stroke_antialias", scope: !1014, file: !488, line: 236, baseType: !807, size: 32, offset: 2240)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "text_antialias", scope: !1014, file: !488, line: 237, baseType: !807, size: 32, offset: 2272)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "fill_rule", scope: !1014, file: !488, line: 240, baseType: !1088, size: 32, offset: 2304)
!1088 = !DIDerivedType(tag: DW_TAG_typedef, name: "FillRule", file: !488, line: 68, baseType: !499)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "linecap", scope: !1014, file: !488, line: 243, baseType: !1090, size: 32, offset: 2336)
!1090 = !DIDerivedType(tag: DW_TAG_typedef, name: "LineCap", file: !488, line: 83, baseType: !504)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "linejoin", scope: !1014, file: !488, line: 246, baseType: !1092, size: 32, offset: 2368)
!1092 = !DIDerivedType(tag: DW_TAG_typedef, name: "LineJoin", file: !488, line: 91, baseType: !510)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "miterlimit", scope: !1014, file: !488, line: 249, baseType: !802, size: 64, offset: 2432)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "dash_offset", scope: !1014, file: !488, line: 252, baseType: !828, size: 64, offset: 2496)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "decorate", scope: !1014, file: !488, line: 255, baseType: !1096, size: 32, offset: 2560)
!1096 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecorationType", file: !488, line: 53, baseType: !516)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !1014, file: !488, line: 258, baseType: !884, size: 32, offset: 2592)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1014, file: !488, line: 261, baseType: !850, size: 64, offset: 2624)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "face", scope: !1014, file: !488, line: 264, baseType: !802, size: 64, offset: 2688)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "font", scope: !1014, file: !488, line: 267, baseType: !850, size: 64, offset: 2752)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "metrics", scope: !1014, file: !488, line: 268, baseType: !850, size: 64, offset: 2816)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !1014, file: !488, line: 269, baseType: !850, size: 64, offset: 2880)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !1014, file: !488, line: 272, baseType: !1104, size: 32, offset: 2944)
!1104 = !DIDerivedType(tag: DW_TAG_typedef, name: "StyleType", file: !524, line: 47, baseType: !523)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "stretch", scope: !1014, file: !488, line: 275, baseType: !1106, size: 32, offset: 2976)
!1106 = !DIDerivedType(tag: DW_TAG_typedef, name: "StretchType", file: !524, line: 38, baseType: !531)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !1014, file: !488, line: 278, baseType: !802, size: 64, offset: 3008)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !1014, file: !488, line: 281, baseType: !850, size: 64, offset: 3072)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "pointsize", scope: !1014, file: !488, line: 284, baseType: !828, size: 64, offset: 3136)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "density", scope: !1014, file: !488, line: 287, baseType: !850, size: 64, offset: 3200)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1014, file: !488, line: 290, baseType: !1112, size: 32, offset: 3264)
!1112 = !DIDerivedType(tag: DW_TAG_typedef, name: "AlignType", file: !488, line: 36, baseType: !544)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "undercolor", scope: !1014, file: !488, line: 293, baseType: !815, size: 64, offset: 3296)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !1014, file: !488, line: 294, baseType: !815, size: 64, offset: 3360)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "server_name", scope: !1014, file: !488, line: 297, baseType: !850, size: 64, offset: 3456)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "dash_pattern", scope: !1014, file: !488, line: 300, baseType: !1117, size: 64, offset: 3520)
!1117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !828, size: 64)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "clip_mask", scope: !1014, file: !488, line: 303, baseType: !850, size: 64, offset: 3584)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "bounds", scope: !1014, file: !488, line: 306, baseType: !1041, size: 256, offset: 3648)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "clip_units", scope: !1014, file: !488, line: 309, baseType: !1121, size: 32, offset: 3904)
!1121 = !DIDerivedType(tag: DW_TAG_typedef, name: "ClipPathUnits", file: !488, line: 44, baseType: !550)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !1014, file: !488, line: 312, baseType: !819, size: 16, offset: 3936)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "render", scope: !1014, file: !488, line: 315, baseType: !807, size: 32, offset: 3968)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "element_reference", scope: !1014, file: !488, line: 318, baseType: !1125, size: 1344, offset: 4032)
!1125 = !DIDerivedType(tag: DW_TAG_typedef, name: "ElementReference", file: !488, line: 203, baseType: !1126)
!1126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ElementReference", file: !488, line: 186, size: 1344, elements: !1127)
!1127 = !{!1128, !1129, !1131, !1132, !1133, !1135}
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1126, file: !488, line: 189, baseType: !850, size: 64)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1126, file: !488, line: 192, baseType: !1130, size: 32, offset: 64)
!1130 = !DIDerivedType(tag: DW_TAG_typedef, name: "ReferenceType", file: !488, line: 127, baseType: !556)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "gradient", scope: !1126, file: !488, line: 195, baseType: !1034, size: 1024, offset: 128)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !1126, file: !488, line: 198, baseType: !802, size: 64, offset: 1152)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !1126, file: !488, line: 201, baseType: !1134, size: 64, offset: 1216)
!1134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1126, size: 64)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1126, file: !488, line: 202, baseType: !1134, size: 64, offset: 1280)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1014, file: !488, line: 321, baseType: !807, size: 32, offset: 5376)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !1014, file: !488, line: 324, baseType: !802, size: 64, offset: 5440)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "kerning", scope: !1014, file: !488, line: 327, baseType: !828, size: 64, offset: 5504)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "interword_spacing", scope: !1014, file: !488, line: 328, baseType: !828, size: 64, offset: 5568)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "interline_spacing", scope: !1014, file: !488, line: 329, baseType: !828, size: 64, offset: 5632)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "direction", scope: !1014, file: !488, line: 332, baseType: !1142, size: 32, offset: 5696)
!1142 = !DIDerivedType(tag: DW_TAG_typedef, name: "DirectionType", file: !488, line: 60, baseType: !560)
!1143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1144, size: 64)
!1144 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickWand", file: !1145, line: 69, baseType: !1146)
!1145 = !DIFile(filename: "./wand/MagickWand.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!1146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MagickWand", file: !1147, line: 50, size: 33280, elements: !1148)
!1147 = !DIFile(filename: "./wand/magick-wand-private.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!1148 = !{!1149, !1150, !1151, !1153, !1286, !1299, !1300, !1301, !1302, !1303}
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1146, file: !1147, line: 53, baseType: !802, size: 64)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1146, file: !1147, line: 56, baseType: !944, size: 32768, offset: 64)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "exception", scope: !1146, file: !1147, line: 59, baseType: !1152, size: 64, offset: 32832)
!1152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "image_info", scope: !1146, file: !1147, line: 62, baseType: !1154, size: 64, offset: 32896)
!1154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1155, size: 64)
!1155 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageInfo", file: !4, line: 223, baseType: !1156)
!1156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ImageInfo", file: !73, line: 356, size: 134336, elements: !1157)
!1157 = !{!1158, !1159, !1160, !1161, !1162, !1163, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1192, !1193, !1194, !1195, !1196, !1197, !1199, !1200, !1201, !1202, !1203, !1204, !1215, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1278, !1279, !1280, !1281, !1283, !1284, !1285}
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !1156, file: !73, line: 359, baseType: !800, size: 32)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !1156, file: !73, line: 362, baseType: !805, size: 32, offset: 32)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "temporary", scope: !1156, file: !73, line: 365, baseType: !807, size: 32, offset: 64)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "adjoin", scope: !1156, file: !73, line: 366, baseType: !807, size: 32, offset: 96)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "affirm", scope: !1156, file: !73, line: 367, baseType: !807, size: 32, offset: 128)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "antialias", scope: !1156, file: !73, line: 368, baseType: !807, size: 32, offset: 160)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1156, file: !73, line: 371, baseType: !850, size: 64, offset: 192)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "extract", scope: !1156, file: !73, line: 372, baseType: !850, size: 64, offset: 256)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !1156, file: !73, line: 373, baseType: !850, size: 64, offset: 320)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "scenes", scope: !1156, file: !73, line: 374, baseType: !850, size: 64, offset: 384)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !1156, file: !73, line: 377, baseType: !802, size: 64, offset: 448)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "number_scenes", scope: !1156, file: !73, line: 378, baseType: !802, size: 64, offset: 512)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !1156, file: !73, line: 379, baseType: !802, size: 64, offset: 576)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "interlace", scope: !1156, file: !73, line: 382, baseType: !878, size: 32, offset: 640)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !1156, file: !73, line: 385, baseType: !880, size: 32, offset: 672)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !1156, file: !73, line: 388, baseType: !848, size: 32, offset: 704)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1156, file: !73, line: 391, baseType: !802, size: 64, offset: 768)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "sampling_factor", scope: !1156, file: !73, line: 394, baseType: !850, size: 64, offset: 832)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "server_name", scope: !1156, file: !73, line: 395, baseType: !850, size: 64, offset: 896)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "font", scope: !1156, file: !73, line: 396, baseType: !850, size: 64, offset: 960)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "texture", scope: !1156, file: !73, line: 397, baseType: !850, size: 64, offset: 1024)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "density", scope: !1156, file: !73, line: 398, baseType: !850, size: 64, offset: 1088)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "pointsize", scope: !1156, file: !73, line: 401, baseType: !828, size: 64, offset: 1152)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !1156, file: !73, line: 402, baseType: !828, size: 64, offset: 1216)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "background_color", scope: !1156, file: !73, line: 405, baseType: !815, size: 64, offset: 1280)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !1156, file: !73, line: 406, baseType: !815, size: 64, offset: 1344)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "matte_color", scope: !1156, file: !73, line: 407, baseType: !815, size: 64, offset: 1408)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !1156, file: !73, line: 410, baseType: !807, size: 32, offset: 1472)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "monochrome", scope: !1156, file: !73, line: 411, baseType: !807, size: 32, offset: 1504)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !1156, file: !73, line: 414, baseType: !802, size: 64, offset: 1536)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1156, file: !73, line: 417, baseType: !798, size: 32, offset: 1600)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1156, file: !73, line: 420, baseType: !1000, size: 32, offset: 1632)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "preview_type", scope: !1156, file: !73, line: 423, baseType: !1191, size: 32, offset: 1664)
!1191 = !DIDerivedType(tag: DW_TAG_typedef, name: "PreviewType", file: !369, line: 59, baseType: !368)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !1156, file: !73, line: 426, baseType: !855, size: 64, offset: 1728)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "ping", scope: !1156, file: !73, line: 429, baseType: !807, size: 32, offset: 1792)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !1156, file: !73, line: 430, baseType: !807, size: 32, offset: 1824)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !1156, file: !73, line: 433, baseType: !850, size: 64, offset: 1856)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "authenticate", scope: !1156, file: !73, line: 434, baseType: !850, size: 64, offset: 1920)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !1156, file: !73, line: 437, baseType: !1198, size: 32, offset: 1984)
!1198 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChannelType", file: !4, line: 202, baseType: !401)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1156, file: !73, line: 440, baseType: !791, size: 64, offset: 2048)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !1156, file: !73, line: 443, baseType: !846, size: 64, offset: 2112)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !1156, file: !73, line: 446, baseType: !919, size: 64, offset: 2176)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !1156, file: !73, line: 449, baseType: !846, size: 64, offset: 2240)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !1156, file: !73, line: 450, baseType: !846, size: 64, offset: 2304)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !1156, file: !73, line: 453, baseType: !1205, size: 64, offset: 2368)
!1205 = !DIDerivedType(tag: DW_TAG_typedef, name: "StreamHandler", file: !1206, line: 26, baseType: !1207)
!1206 = !DIFile(filename: "./magick/stream.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!1207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1208, size: 64)
!1208 = !DISubroutineType(types: !1209)
!1209 = !{!802, !1210, !1212, !1214}
!1210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1211, size: 64)
!1211 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !792)
!1212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1213, size: 64)
!1213 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1214 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !802)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !1156, file: !73, line: 456, baseType: !1216, size: 64, offset: 2432)
!1216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1217, size: 64)
!1217 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !1218, line: 7, baseType: !1219)
!1218 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!1219 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !1220, line: 49, size: 1728, elements: !1221)
!1220 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!1221 = !{!1222, !1223, !1224, !1225, !1226, !1227, !1228, !1229, !1230, !1231, !1232, !1233, !1234, !1237, !1239, !1240, !1241, !1243, !1244, !1246, !1250, !1253, !1255, !1258, !1261, !1262, !1263, !1264, !1265}
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1219, file: !1220, line: 51, baseType: !958, size: 32)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1219, file: !1220, line: 54, baseType: !850, size: 64, offset: 64)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1219, file: !1220, line: 55, baseType: !850, size: 64, offset: 128)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1219, file: !1220, line: 56, baseType: !850, size: 64, offset: 192)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1219, file: !1220, line: 57, baseType: !850, size: 64, offset: 256)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1219, file: !1220, line: 58, baseType: !850, size: 64, offset: 320)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1219, file: !1220, line: 59, baseType: !850, size: 64, offset: 384)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1219, file: !1220, line: 60, baseType: !850, size: 64, offset: 448)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !1219, file: !1220, line: 61, baseType: !850, size: 64, offset: 512)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !1219, file: !1220, line: 64, baseType: !850, size: 64, offset: 576)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !1219, file: !1220, line: 65, baseType: !850, size: 64, offset: 640)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !1219, file: !1220, line: 66, baseType: !850, size: 64, offset: 704)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !1219, file: !1220, line: 68, baseType: !1235, size: 64, offset: 768)
!1235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1236, size: 64)
!1236 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !1220, line: 36, flags: DIFlagFwdDecl)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !1219, file: !1220, line: 70, baseType: !1238, size: 64, offset: 832)
!1238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1219, size: 64)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !1219, file: !1220, line: 72, baseType: !958, size: 32, offset: 896)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !1219, file: !1220, line: 73, baseType: !958, size: 32, offset: 928)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !1219, file: !1220, line: 74, baseType: !1242, size: 64, offset: 960)
!1242 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !858, line: 152, baseType: !859)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !1219, file: !1220, line: 77, baseType: !820, size: 16, offset: 1024)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !1219, file: !1220, line: 78, baseType: !1245, size: 8, offset: 1040)
!1245 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !1219, file: !1220, line: 79, baseType: !1247, size: 8, offset: 1048)
!1247 = !DICompositeType(tag: DW_TAG_array_type, baseType: !851, size: 8, elements: !1248)
!1248 = !{!1249}
!1249 = !DISubrange(count: 1)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !1219, file: !1220, line: 81, baseType: !1251, size: 64, offset: 1088)
!1251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1252, size: 64)
!1252 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !1220, line: 43, baseType: null)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !1219, file: !1220, line: 89, baseType: !1254, size: 64, offset: 1152)
!1254 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !858, line: 153, baseType: !859)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !1219, file: !1220, line: 91, baseType: !1256, size: 64, offset: 1216)
!1256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1257, size: 64)
!1257 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !1220, line: 37, flags: DIFlagFwdDecl)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !1219, file: !1220, line: 92, baseType: !1259, size: 64, offset: 1280)
!1259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1260, size: 64)
!1260 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !1220, line: 38, flags: DIFlagFwdDecl)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !1219, file: !1220, line: 93, baseType: !1238, size: 64, offset: 1344)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !1219, file: !1220, line: 94, baseType: !846, size: 64, offset: 1408)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !1219, file: !1220, line: 95, baseType: !802, size: 64, offset: 1472)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !1219, file: !1220, line: 96, baseType: !958, size: 32, offset: 1536)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !1219, file: !1220, line: 98, baseType: !1266, size: 160, offset: 1568)
!1266 = !DICompositeType(tag: DW_TAG_array_type, baseType: !851, size: 160, elements: !1267)
!1267 = !{!1268}
!1268 = !DISubrange(count: 20)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !1156, file: !73, line: 459, baseType: !846, size: 64, offset: 2496)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1156, file: !73, line: 462, baseType: !802, size: 64, offset: 2560)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !1156, file: !73, line: 465, baseType: !944, size: 32768, offset: 2624)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "unique", scope: !1156, file: !73, line: 466, baseType: !944, size: 32768, offset: 35392)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "zero", scope: !1156, file: !73, line: 467, baseType: !944, size: 32768, offset: 68160)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !1156, file: !73, line: 468, baseType: !944, size: 32768, offset: 100928)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1156, file: !73, line: 471, baseType: !807, size: 32, offset: 133696)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "tile", scope: !1156, file: !73, line: 474, baseType: !850, size: 64, offset: 133760)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "subimage", scope: !1156, file: !73, line: 477, baseType: !802, size: 64, offset: 133824)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "subrange", scope: !1156, file: !73, line: 478, baseType: !802, size: 64, offset: 133888)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "pen", scope: !1156, file: !73, line: 481, baseType: !815, size: 64, offset: 133952)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !1156, file: !73, line: 484, baseType: !802, size: 64, offset: 134016)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_pixel_method", scope: !1156, file: !73, line: 487, baseType: !1282, size: 32, offset: 134080)
!1282 = !DIDerivedType(tag: DW_TAG_typedef, name: "VirtualPixelMethod", file: !424, line: 47, baseType: !423)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_color", scope: !1156, file: !73, line: 490, baseType: !815, size: 64, offset: 134112)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1156, file: !73, line: 493, baseType: !846, size: 64, offset: 134208)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "synchronize", scope: !1156, file: !73, line: 496, baseType: !807, size: 32, offset: 134272)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "quantize_info", scope: !1146, file: !1147, line: 65, baseType: !1287, size: 64, offset: 32960)
!1287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1288, size: 64)
!1288 = !DIDerivedType(tag: DW_TAG_typedef, name: "QuantizeInfo", file: !445, line: 57, baseType: !1289)
!1289 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QuantizeInfo", file: !445, line: 35, size: 384, elements: !1290)
!1290 = !{!1291, !1292, !1293, !1294, !1295, !1296, !1297}
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "number_colors", scope: !1289, file: !445, line: 38, baseType: !802, size: 64)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "tree_depth", scope: !1289, file: !445, line: 41, baseType: !802, size: 64, offset: 64)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !1289, file: !445, line: 44, baseType: !807, size: 32, offset: 128)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1289, file: !445, line: 47, baseType: !798, size: 32, offset: 160)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "measure_error", scope: !1289, file: !445, line: 50, baseType: !807, size: 32, offset: 192)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !1289, file: !445, line: 53, baseType: !802, size: 64, offset: 256)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "dither_method", scope: !1289, file: !445, line: 56, baseType: !1298, size: 32, offset: 320)
!1298 = !DIDerivedType(tag: DW_TAG_typedef, name: "DitherMethod", file: !445, line: 33, baseType: !444)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "images", scope: !1146, file: !1147, line: 68, baseType: !791, size: 64, offset: 33024)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "insert_before", scope: !1146, file: !1147, line: 71, baseType: !807, size: 32, offset: 33088)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "image_pending", scope: !1146, file: !1147, line: 72, baseType: !807, size: 32, offset: 33120)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1146, file: !1147, line: 73, baseType: !807, size: 32, offset: 33152)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !1146, file: !1147, line: 76, baseType: !802, size: 64, offset: 33216)
!1304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1305, size: 64)
!1305 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1306)
!1306 = !DIDerivedType(tag: DW_TAG_typedef, name: "KernelInfo", file: !566, line: 128, baseType: !1307)
!1307 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "KernelInfo", file: !566, line: 102, size: 832, elements: !1308)
!1308 = !{!1309, !1311, !1312, !1313, !1314, !1315, !1316, !1317, !1318, !1319, !1320, !1321, !1323}
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1307, file: !566, line: 105, baseType: !1310, size: 32)
!1310 = !DIDerivedType(tag: DW_TAG_typedef, name: "KernelInfoType", file: !566, line: 67, baseType: !565)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1307, file: !566, line: 108, baseType: !802, size: 64, offset: 64)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1307, file: !566, line: 109, baseType: !802, size: 64, offset: 128)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1307, file: !566, line: 112, baseType: !855, size: 64, offset: 192)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1307, file: !566, line: 113, baseType: !855, size: 64, offset: 256)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !1307, file: !566, line: 116, baseType: !1117, size: 64, offset: 320)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "minimum", scope: !1307, file: !566, line: 117, baseType: !828, size: 64, offset: 384)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "maximum", scope: !1307, file: !566, line: 118, baseType: !828, size: 64, offset: 448)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "negative_range", scope: !1307, file: !566, line: 119, baseType: !828, size: 64, offset: 512)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "positive_range", scope: !1307, file: !566, line: 120, baseType: !828, size: 64, offset: 576)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "angle", scope: !1307, file: !566, line: 121, baseType: !828, size: 64, offset: 640)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1307, file: !566, line: 124, baseType: !1322, size: 64, offset: 704)
!1322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1307, size: 64)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !1307, file: !566, line: 127, baseType: !802, size: 64, offset: 768)
!1324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1325, size: 64)
!1325 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !828)
!1326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1327, size: 64)
!1327 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelWand", file: !1328, line: 26, baseType: !1329)
!1328 = !DIFile(filename: "./wand/pixel-wand.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!1329 = !DICompositeType(tag: DW_TAG_structure_type, name: "_PixelWand", file: !1328, line: 25, flags: DIFlagFwdDecl)
!1330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1331, size: 64)
!1331 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChannelFeatures", file: !1332, line: 45, baseType: !1333)
!1332 = !DIFile(filename: "./magick/feature.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!1333 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ChannelFeatures", file: !1332, line: 28, size: 3584, elements: !1334)
!1334 = !{!1335, !1339, !1340, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1351}
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "angular_second_moment", scope: !1333, file: !1332, line: 31, baseType: !1336, size: 256)
!1336 = !DICompositeType(tag: DW_TAG_array_type, baseType: !828, size: 256, elements: !1337)
!1337 = !{!1338}
!1338 = !DISubrange(count: 4)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "contrast", scope: !1333, file: !1332, line: 32, baseType: !1336, size: 256, offset: 256)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "correlation", scope: !1333, file: !1332, line: 33, baseType: !1336, size: 256, offset: 512)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "variance_sum_of_squares", scope: !1333, file: !1332, line: 34, baseType: !1336, size: 256, offset: 768)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "inverse_difference_moment", scope: !1333, file: !1332, line: 35, baseType: !1336, size: 256, offset: 1024)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "sum_average", scope: !1333, file: !1332, line: 36, baseType: !1336, size: 256, offset: 1280)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "sum_variance", scope: !1333, file: !1332, line: 37, baseType: !1336, size: 256, offset: 1536)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "sum_entropy", scope: !1333, file: !1332, line: 38, baseType: !1336, size: 256, offset: 1792)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "entropy", scope: !1333, file: !1332, line: 39, baseType: !1336, size: 256, offset: 2048)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "difference_variance", scope: !1333, file: !1332, line: 40, baseType: !1336, size: 256, offset: 2304)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "difference_entropy", scope: !1333, file: !1332, line: 41, baseType: !1336, size: 256, offset: 2560)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "measure_of_correlation_1", scope: !1333, file: !1332, line: 42, baseType: !1336, size: 256, offset: 2816)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "measure_of_correlation_2", scope: !1333, file: !1332, line: 43, baseType: !1336, size: 256, offset: 3072)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "maximum_correlation_coefficient", scope: !1333, file: !1332, line: 44, baseType: !1336, size: 256, offset: 3328)
!1352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1353, size: 64)
!1353 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChannelStatistics", file: !675, line: 44, baseType: !1354)
!1354 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ChannelStatistics", file: !675, line: 27, size: 768, elements: !1355)
!1355 = !{!1356, !1357, !1358, !1359, !1360, !1361, !1362, !1363, !1364, !1365, !1366, !1367}
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !1354, file: !675, line: 30, baseType: !802, size: 64)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "minima", scope: !1354, file: !675, line: 33, baseType: !828, size: 64, offset: 64)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "maxima", scope: !1354, file: !675, line: 34, baseType: !828, size: 64, offset: 128)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "sum", scope: !1354, file: !675, line: 35, baseType: !828, size: 64, offset: 192)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "sum_squared", scope: !1354, file: !675, line: 36, baseType: !828, size: 64, offset: 256)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "sum_cubed", scope: !1354, file: !675, line: 37, baseType: !828, size: 64, offset: 320)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "sum_fourth_power", scope: !1354, file: !675, line: 38, baseType: !828, size: 64, offset: 384)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "mean", scope: !1354, file: !675, line: 39, baseType: !828, size: 64, offset: 448)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "variance", scope: !1354, file: !675, line: 40, baseType: !828, size: 64, offset: 512)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "standard_deviation", scope: !1354, file: !675, line: 41, baseType: !828, size: 64, offset: 576)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "kurtosis", scope: !1354, file: !675, line: 42, baseType: !828, size: 64, offset: 640)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "skewness", scope: !1354, file: !675, line: 43, baseType: !828, size: 64, offset: 704)
!1368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1326, size: 64)
!1369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1370, size: 64)
!1370 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorPacket", file: !1371, line: 35, baseType: !1372)
!1371 = !DIFile(filename: "./magick/histogram.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!1372 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ColorPacket", file: !1371, line: 25, size: 192, elements: !1373)
!1373 = !{!1374, !1375, !1377}
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "pixel", scope: !1372, file: !1371, line: 28, baseType: !815, size: 64)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1372, file: !1371, line: 31, baseType: !1376, size: 16, offset: 64)
!1376 = !DIDerivedType(tag: DW_TAG_typedef, name: "IndexPacket", file: !326, line: 129, baseType: !819)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1372, file: !1371, line: 34, baseType: !930, size: 64, offset: 128)
!1378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1379, size: 64)
!1379 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !815)
!1380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1381, size: 64)
!1381 = !DIDerivedType(tag: DW_TAG_typedef, name: "MontageInfo", file: !717, line: 70, baseType: !1382)
!1382 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MontageInfo", file: !717, line: 33, size: 33792, elements: !1383)
!1383 = !{!1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401}
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "geometry", scope: !1382, file: !717, line: 36, baseType: !850, size: 64)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "tile", scope: !1382, file: !717, line: 37, baseType: !850, size: 64, offset: 64)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "title", scope: !1382, file: !717, line: 38, baseType: !850, size: 64, offset: 128)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !1382, file: !717, line: 39, baseType: !850, size: 64, offset: 192)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "texture", scope: !1382, file: !717, line: 40, baseType: !850, size: 64, offset: 256)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "font", scope: !1382, file: !717, line: 41, baseType: !850, size: 64, offset: 320)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "pointsize", scope: !1382, file: !717, line: 44, baseType: !828, size: 64, offset: 384)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "border_width", scope: !1382, file: !717, line: 47, baseType: !802, size: 64, offset: 448)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "shadow", scope: !1382, file: !717, line: 50, baseType: !807, size: 32, offset: 512)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !1382, file: !717, line: 53, baseType: !815, size: 64, offset: 544)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "stroke", scope: !1382, file: !717, line: 54, baseType: !815, size: 64, offset: 608)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "background_color", scope: !1382, file: !717, line: 55, baseType: !815, size: 64, offset: 672)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !1382, file: !717, line: 56, baseType: !815, size: 64, offset: 736)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "matte_color", scope: !1382, file: !717, line: 57, baseType: !815, size: 64, offset: 800)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !1382, file: !717, line: 60, baseType: !882, size: 32, offset: 864)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !1382, file: !717, line: 63, baseType: !944, size: 32768, offset: 896)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1382, file: !717, line: 66, baseType: !807, size: 32, offset: 33664)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !1382, file: !717, line: 69, baseType: !802, size: 64, offset: 33728)
!1402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1403, size: 64)
!1403 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1404)
!1404 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickInfo", file: !764, line: 103, baseType: !1405)
!1405 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MagickInfo", file: !764, line: 51, size: 1216, elements: !1406)
!1406 = !{!1407, !1408, !1409, !1410, !1411, !1412, !1413, !1420, !1425, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1440, !1442, !1443, !1445, !1446, !1447, !1448}
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1405, file: !764, line: 54, baseType: !850, size: 64)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !1405, file: !764, line: 55, baseType: !850, size: 64, offset: 64)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1405, file: !764, line: 56, baseType: !850, size: 64, offset: 128)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "note", scope: !1405, file: !764, line: 57, baseType: !850, size: 64, offset: 192)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "module", scope: !1405, file: !764, line: 58, baseType: !850, size: 64, offset: 256)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "image_info", scope: !1405, file: !764, line: 61, baseType: !1154, size: 64, offset: 320)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "decoder", scope: !1405, file: !764, line: 64, baseType: !1414, size: 64, offset: 384)
!1414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1415, size: 64)
!1415 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeImageHandler", file: !764, line: 43, baseType: !1416)
!1416 = !DISubroutineType(types: !1417)
!1417 = !{!791, !1418, !1152}
!1418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1419, size: 64)
!1419 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1155)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "encoder", scope: !1405, file: !764, line: 67, baseType: !1421, size: 64, offset: 448)
!1421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1422, size: 64)
!1422 = !DIDerivedType(tag: DW_TAG_typedef, name: "EncodeImageHandler", file: !764, line: 46, baseType: !1423)
!1423 = !DISubroutineType(types: !1424)
!1424 = !{!807, !1418, !791}
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !1405, file: !764, line: 70, baseType: !1426, size: 64, offset: 512)
!1426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1427, size: 64)
!1427 = !DIDerivedType(tag: DW_TAG_typedef, name: "IsImageFormatHandler", file: !764, line: 49, baseType: !1428)
!1428 = !DISubroutineType(types: !1429)
!1429 = !{!807, !1430, !1214}
!1430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1431, size: 64)
!1431 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !981)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !1405, file: !764, line: 73, baseType: !846, size: 64, offset: 576)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "adjoin", scope: !1405, file: !764, line: 76, baseType: !807, size: 32, offset: 640)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !1405, file: !764, line: 77, baseType: !807, size: 32, offset: 672)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "endian_support", scope: !1405, file: !764, line: 78, baseType: !807, size: 32, offset: 704)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "blob_support", scope: !1405, file: !764, line: 79, baseType: !807, size: 32, offset: 736)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "seekable_stream", scope: !1405, file: !764, line: 80, baseType: !807, size: 32, offset: 768)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "format_type", scope: !1405, file: !764, line: 83, baseType: !1439, size: 32, offset: 800)
!1439 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickFormatType", file: !764, line: 33, baseType: !763)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "thread_support", scope: !1405, file: !764, line: 86, baseType: !1441, size: 32, offset: 832)
!1441 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickStatusType", file: !4, line: 147, baseType: !5)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "stealth", scope: !1405, file: !764, line: 89, baseType: !807, size: 32, offset: 864)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !1405, file: !764, line: 92, baseType: !1444, size: 64, offset: 896)
!1444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1405, size: 64)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1405, file: !764, line: 93, baseType: !1444, size: 64, offset: 960)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !1405, file: !764, line: 96, baseType: !802, size: 64, offset: 1024)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1405, file: !764, line: 99, baseType: !850, size: 64, offset: 1088)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !1405, file: !764, line: 102, baseType: !964, size: 64, offset: 1152)
!1449 = !{i32 7, !"Dwarf Version", i32 4}
!1450 = !{i32 2, !"Debug Info Version", i32 3}
!1451 = !{i32 1, !"wchar_size", i32 4}
!1452 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!1453 = distinct !DISubprogram(name: "GetImageFromMagickWand", scope: !1, file: !1, line: 139, type: !1454, scopeLine: 140, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !1458)
!1454 = !DISubroutineType(types: !1455)
!1455 = !{!791, !1456}
!1456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1457, size: 64)
!1457 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1144)
!1458 = !{}
!1459 = !DILocalVariable(name: "wand", arg: 1, scope: !1453, file: !1, line: 139, type: !1456)
!1460 = !DILocation(line: 139, column: 60, scope: !1453)
!1461 = !DILocation(line: 143, column: 7, scope: !1462)
!1462 = distinct !DILexicalBlock(scope: !1453, file: !1, line: 143, column: 7)
!1463 = !DILocation(line: 143, column: 13, scope: !1462)
!1464 = !DILocation(line: 143, column: 19, scope: !1462)
!1465 = !DILocation(line: 143, column: 7, scope: !1453)
!1466 = !DILocation(line: 144, column: 60, scope: !1462)
!1467 = !DILocation(line: 144, column: 66, scope: !1462)
!1468 = !DILocation(line: 144, column: 12, scope: !1462)
!1469 = !DILocation(line: 144, column: 5, scope: !1462)
!1470 = !DILocation(line: 145, column: 7, scope: !1471)
!1471 = distinct !DILexicalBlock(scope: !1453, file: !1, line: 145, column: 7)
!1472 = !DILocation(line: 145, column: 13, scope: !1471)
!1473 = !DILocation(line: 145, column: 20, scope: !1471)
!1474 = !DILocation(line: 145, column: 7, scope: !1453)
!1475 = !DILocation(line: 147, column: 35, scope: !1476)
!1476 = distinct !DILexicalBlock(scope: !1471, file: !1, line: 146, column: 5)
!1477 = !DILocation(line: 147, column: 41, scope: !1476)
!1478 = !DILocation(line: 148, column: 35, scope: !1476)
!1479 = !DILocation(line: 148, column: 41, scope: !1476)
!1480 = !DILocation(line: 147, column: 14, scope: !1476)
!1481 = !DILocation(line: 149, column: 7, scope: !1476)
!1482 = !DILocation(line: 151, column: 10, scope: !1453)
!1483 = !DILocation(line: 151, column: 16, scope: !1453)
!1484 = !DILocation(line: 151, column: 3, scope: !1453)
!1485 = !DILocation(line: 152, column: 1, scope: !1453)
!1486 = distinct !DISubprogram(name: "MagickAdaptiveBlurImage", scope: !1, file: !1, line: 192, type: !1487, scopeLine: 194, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !1458)
!1487 = !DISubroutineType(types: !1488)
!1488 = !{!807, !1143, !1325, !1325}
!1489 = !DILocalVariable(name: "wand", arg: 1, scope: !1486, file: !1, line: 192, type: !1143)
!1490 = !DILocation(line: 192, column: 66, scope: !1486)
!1491 = !DILocalVariable(name: "radius", arg: 2, scope: !1486, file: !1, line: 193, type: !1325)
!1492 = !DILocation(line: 193, column: 16, scope: !1486)
!1493 = !DILocalVariable(name: "sigma", arg: 3, scope: !1486, file: !1, line: 193, type: !1325)
!1494 = !DILocation(line: 193, column: 36, scope: !1486)
!1495 = !DILocalVariable(name: "status", scope: !1486, file: !1, line: 196, type: !807)
!1496 = !DILocation(line: 196, column: 5, scope: !1486)
!1497 = !DILocation(line: 198, column: 41, scope: !1486)
!1498 = !DILocation(line: 198, column: 62, scope: !1486)
!1499 = !DILocation(line: 198, column: 69, scope: !1486)
!1500 = !DILocation(line: 198, column: 10, scope: !1486)
!1501 = !DILocation(line: 198, column: 9, scope: !1486)
!1502 = !DILocation(line: 199, column: 10, scope: !1486)
!1503 = !DILocation(line: 199, column: 3, scope: !1486)
!1504 = distinct !DISubprogram(name: "MagickAdaptiveBlurImageChannel", scope: !1, file: !1, line: 202, type: !1505, scopeLine: 204, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !1458)
!1505 = !DISubroutineType(types: !1506)
!1506 = !{!807, !1143, !1507, !1325, !1325}
!1507 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1198)
!1508 = !DILocalVariable(name: "wand", arg: 1, scope: !1504, file: !1, line: 202, type: !1143)
!1509 = !DILocation(line: 202, column: 73, scope: !1504)
!1510 = !DILocalVariable(name: "channel", arg: 2, scope: !1504, file: !1, line: 203, type: !1507)
!1511 = !DILocation(line: 203, column: 21, scope: !1504)
!1512 = !DILocalVariable(name: "radius", arg: 3, scope: !1504, file: !1, line: 203, type: !1325)
!1513 = !DILocation(line: 203, column: 42, scope: !1504)
!1514 = !DILocalVariable(name: "sigma", arg: 4, scope: !1504, file: !1, line: 203, type: !1325)
!1515 = !DILocation(line: 203, column: 62, scope: !1504)
!1516 = !DILocalVariable(name: "sharp_image", scope: !1504, file: !1, line: 206, type: !791)
!1517 = !DILocation(line: 206, column: 6, scope: !1504)
!1518 = !DILocation(line: 210, column: 7, scope: !1519)
!1519 = distinct !DILexicalBlock(scope: !1504, file: !1, line: 210, column: 7)
!1520 = !DILocation(line: 210, column: 13, scope: !1519)
!1521 = !DILocation(line: 210, column: 19, scope: !1519)
!1522 = !DILocation(line: 210, column: 7, scope: !1504)
!1523 = !DILocation(line: 211, column: 60, scope: !1519)
!1524 = !DILocation(line: 211, column: 66, scope: !1519)
!1525 = !DILocation(line: 211, column: 12, scope: !1519)
!1526 = !DILocation(line: 211, column: 5, scope: !1519)
!1527 = !DILocation(line: 212, column: 7, scope: !1528)
!1528 = distinct !DILexicalBlock(scope: !1504, file: !1, line: 212, column: 7)
!1529 = !DILocation(line: 212, column: 13, scope: !1528)
!1530 = !DILocation(line: 212, column: 20, scope: !1528)
!1531 = !DILocation(line: 212, column: 7, scope: !1504)
!1532 = !DILocation(line: 213, column: 5, scope: !1533)
!1533 = distinct !DILexicalBlock(scope: !1528, file: !1, line: 213, column: 5)
!1534 = !DILocation(line: 214, column: 40, scope: !1504)
!1535 = !DILocation(line: 214, column: 46, scope: !1504)
!1536 = !DILocation(line: 214, column: 53, scope: !1504)
!1537 = !DILocation(line: 214, column: 61, scope: !1504)
!1538 = !DILocation(line: 214, column: 68, scope: !1504)
!1539 = !DILocation(line: 215, column: 5, scope: !1504)
!1540 = !DILocation(line: 215, column: 11, scope: !1504)
!1541 = !DILocation(line: 214, column: 15, scope: !1504)
!1542 = !DILocation(line: 214, column: 14, scope: !1504)
!1543 = !DILocation(line: 216, column: 7, scope: !1544)
!1544 = distinct !DILexicalBlock(scope: !1504, file: !1, line: 216, column: 7)
!1545 = !DILocation(line: 216, column: 19, scope: !1544)
!1546 = !DILocation(line: 216, column: 7, scope: !1504)
!1547 = !DILocation(line: 217, column: 5, scope: !1544)
!1548 = !DILocation(line: 218, column: 23, scope: !1504)
!1549 = !DILocation(line: 218, column: 29, scope: !1504)
!1550 = !DILocation(line: 218, column: 36, scope: !1504)
!1551 = !DILocation(line: 218, column: 3, scope: !1504)
!1552 = !DILocation(line: 219, column: 3, scope: !1504)
!1553 = !DILocation(line: 220, column: 1, scope: !1504)
!1554 = distinct !DISubprogram(name: "MagickAdaptiveResizeImage", scope: !1, file: !1, line: 248, type: !1555, scopeLine: 250, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !1458)
!1555 = !DISubroutineType(types: !1556)
!1556 = !{!807, !1143, !1214, !1214}
!1557 = !DILocalVariable(name: "wand", arg: 1, scope: !1554, file: !1, line: 248, type: !1143)
!1558 = !DILocation(line: 248, column: 68, scope: !1554)
!1559 = !DILocalVariable(name: "columns", arg: 2, scope: !1554, file: !1, line: 249, type: !1214)
!1560 = !DILocation(line: 249, column: 16, scope: !1554)
!1561 = !DILocalVariable(name: "rows", arg: 3, scope: !1554, file: !1, line: 249, type: !1214)
!1562 = !DILocation(line: 249, column: 37, scope: !1554)
!1563 = !DILocalVariable(name: "resize_image", scope: !1554, file: !1, line: 252, type: !791)
!1564 = !DILocation(line: 252, column: 6, scope: !1554)
!1565 = !DILocation(line: 256, column: 7, scope: !1566)
!1566 = distinct !DILexicalBlock(scope: !1554, file: !1, line: 256, column: 7)
!1567 = !DILocation(line: 256, column: 13, scope: !1566)
!1568 = !DILocation(line: 256, column: 19, scope: !1566)
!1569 = !DILocation(line: 256, column: 7, scope: !1554)
!1570 = !DILocation(line: 257, column: 60, scope: !1566)
!1571 = !DILocation(line: 257, column: 66, scope: !1566)
!1572 = !DILocation(line: 257, column: 12, scope: !1566)
!1573 = !DILocation(line: 257, column: 5, scope: !1566)
!1574 = !DILocation(line: 258, column: 7, scope: !1575)
!1575 = distinct !DILexicalBlock(scope: !1554, file: !1, line: 258, column: 7)
!1576 = !DILocation(line: 258, column: 13, scope: !1575)
!1577 = !DILocation(line: 258, column: 20, scope: !1575)
!1578 = !DILocation(line: 258, column: 7, scope: !1554)
!1579 = !DILocation(line: 259, column: 5, scope: !1580)
!1580 = distinct !DILexicalBlock(scope: !1575, file: !1, line: 259, column: 5)
!1581 = !DILocation(line: 260, column: 36, scope: !1554)
!1582 = !DILocation(line: 260, column: 42, scope: !1554)
!1583 = !DILocation(line: 260, column: 49, scope: !1554)
!1584 = !DILocation(line: 260, column: 57, scope: !1554)
!1585 = !DILocation(line: 260, column: 62, scope: !1554)
!1586 = !DILocation(line: 260, column: 68, scope: !1554)
!1587 = !DILocation(line: 260, column: 16, scope: !1554)
!1588 = !DILocation(line: 260, column: 15, scope: !1554)
!1589 = !DILocation(line: 261, column: 7, scope: !1590)
!1590 = distinct !DILexicalBlock(scope: !1554, file: !1, line: 261, column: 7)
!1591 = !DILocation(line: 261, column: 20, scope: !1590)
!1592 = !DILocation(line: 261, column: 7, scope: !1554)
!1593 = !DILocation(line: 262, column: 5, scope: !1590)
!1594 = !DILocation(line: 263, column: 23, scope: !1554)
!1595 = !DILocation(line: 263, column: 29, scope: !1554)
!1596 = !DILocation(line: 263, column: 36, scope: !1554)
!1597 = !DILocation(line: 263, column: 3, scope: !1554)
!1598 = !DILocation(line: 264, column: 3, scope: !1554)
!1599 = !DILocation(line: 265, column: 1, scope: !1554)
!1600 = distinct !DISubprogram(name: "MagickAdaptiveSharpenImage", scope: !1, file: !1, line: 305, type: !1487, scopeLine: 307, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !1458)
!1601 = !DILocalVariable(name: "wand", arg: 1, scope: !1600, file: !1, line: 305, type: !1143)
!1602 = !DILocation(line: 305, column: 69, scope: !1600)
!1603 = !DILocalVariable(name: "radius", arg: 2, scope: !1600, file: !1, line: 306, type: !1325)
!1604 = !DILocation(line: 306, column: 16, scope: !1600)
!1605 = !DILocalVariable(name: "sigma", arg: 3, scope: !1600, file: !1, line: 306, type: !1325)
!1606 = !DILocation(line: 306, column: 36, scope: !1600)
!1607 = !DILocalVariable(name: "status", scope: !1600, file: !1, line: 309, type: !807)
!1608 = !DILocation(line: 309, column: 5, scope: !1600)
!1609 = !DILocation(line: 311, column: 44, scope: !1600)
!1610 = !DILocation(line: 311, column: 65, scope: !1600)
!1611 = !DILocation(line: 311, column: 72, scope: !1600)
!1612 = !DILocation(line: 311, column: 10, scope: !1600)
!1613 = !DILocation(line: 311, column: 9, scope: !1600)
!1614 = !DILocation(line: 312, column: 10, scope: !1600)
!1615 = !DILocation(line: 312, column: 3, scope: !1600)
!1616 = distinct !DISubprogram(name: "MagickAdaptiveSharpenImageChannel", scope: !1, file: !1, line: 315, type: !1505, scopeLine: 317, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !1458)
!1617 = !DILocalVariable(name: "wand", arg: 1, scope: !1616, file: !1, line: 315, type: !1143)
!1618 = !DILocation(line: 315, column: 76, scope: !1616)
!1619 = !DILocalVariable(name: "channel", arg: 2, scope: !1616, file: !1, line: 316, type: !1507)
!1620 = !DILocation(line: 316, column: 21, scope: !1616)
!1621 = !DILocalVariable(name: "radius", arg: 3, scope: !1616, file: !1, line: 316, type: !1325)
!1622 = !DILocation(line: 316, column: 42, scope: !1616)
!1623 = !DILocalVariable(name: "sigma", arg: 4, scope: !1616, file: !1, line: 316, type: !1325)
!1624 = !DILocation(line: 316, column: 62, scope: !1616)
!1625 = !DILocalVariable(name: "sharp_image", scope: !1616, file: !1, line: 319, type: !791)
!1626 = !DILocation(line: 319, column: 6, scope: !1616)
!1627 = !DILocation(line: 323, column: 7, scope: !1628)
!1628 = distinct !DILexicalBlock(scope: !1616, file: !1, line: 323, column: 7)
!1629 = !DILocation(line: 323, column: 13, scope: !1628)
!1630 = !DILocation(line: 323, column: 19, scope: !1628)
!1631 = !DILocation(line: 323, column: 7, scope: !1616)
!1632 = !DILocation(line: 324, column: 60, scope: !1628)
!1633 = !DILocation(line: 324, column: 66, scope: !1628)
!1634 = !DILocation(line: 324, column: 12, scope: !1628)
!1635 = !DILocation(line: 324, column: 5, scope: !1628)
!1636 = !DILocation(line: 325, column: 7, scope: !1637)
!1637 = distinct !DILexicalBlock(scope: !1616, file: !1, line: 325, column: 7)
!1638 = !DILocation(line: 325, column: 13, scope: !1637)
!1639 = !DILocation(line: 325, column: 20, scope: !1637)
!1640 = !DILocation(line: 325, column: 7, scope: !1616)
!1641 = !DILocation(line: 326, column: 5, scope: !1642)
!1642 = distinct !DILexicalBlock(scope: !1637, file: !1, line: 326, column: 5)
!1643 = !DILocation(line: 327, column: 43, scope: !1616)
!1644 = !DILocation(line: 327, column: 49, scope: !1616)
!1645 = !DILocation(line: 327, column: 56, scope: !1616)
!1646 = !DILocation(line: 327, column: 64, scope: !1616)
!1647 = !DILocation(line: 327, column: 71, scope: !1616)
!1648 = !DILocation(line: 328, column: 5, scope: !1616)
!1649 = !DILocation(line: 328, column: 11, scope: !1616)
!1650 = !DILocation(line: 327, column: 15, scope: !1616)
!1651 = !DILocation(line: 327, column: 14, scope: !1616)
!1652 = !DILocation(line: 329, column: 7, scope: !1653)
!1653 = distinct !DILexicalBlock(scope: !1616, file: !1, line: 329, column: 7)
!1654 = !DILocation(line: 329, column: 19, scope: !1653)
!1655 = !DILocation(line: 329, column: 7, scope: !1616)
!1656 = !DILocation(line: 330, column: 5, scope: !1653)
!1657 = !DILocation(line: 331, column: 23, scope: !1616)
!1658 = !DILocation(line: 331, column: 29, scope: !1616)
