; ModuleID = 'magick/identify.c'
source_filename = "magick/identify.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct._Image = type { i32, i32, i32, i64, i32, i32, i32, i64, i64, i64, i64, %struct._PixelPacket*, %struct._PixelPacket, %struct._PixelPacket, %struct._PixelPacket, double, %struct._ChromaticityInfo, i32, i8*, i32, i8*, i8*, i8*, i64, double, double, %struct._RectangleInfo, %struct._RectangleInfo, %struct._RectangleInfo, double, double, double, i32, i32, i32, i32, i32, i32, %struct._Image*, i64, i64, i64, i64, i64, i64, %struct._ErrorInfo, %struct._TimerInfo, i32 (i8*, i64, i64, i8*)*, i8*, i8*, i8*, %struct._Ascii85Info*, %struct._BlobInfo*, [4096 x i8], [4096 x i8], [4096 x i8], i64, i64, %struct._ExceptionInfo, i32, i64, %struct.SemaphoreInfo*, %struct._ProfileInfo, %struct._ProfileInfo, %struct._ProfileInfo*, i64, i64, %struct._Image*, %struct._Image*, %struct._Image*, i32, i32, %struct._PixelPacket, %struct._Image*, %struct._RectangleInfo, i8*, i8*, i32, i32, i64, i32, i64, i64, i32, i64 }

!522 = !DIEnumerator(name: "MagickGravityOptions", value: 30)
!523 = !DIEnumerator(name: "MagickIntentOptions", value: 31)
!524 = !DIEnumerator(name: "MagickInterlaceOptions", value: 32)
!525 = !DIEnumerator(name: "MagickInterpolateOptions", value: 33)
!526 = !DIEnumerator(name: "MagickKernelOptions", value: 34)
!527 = !DIEnumerator(name: "MagickLayerOptions", value: 35)
!528 = !DIEnumerator(name: "MagickLineCapOptions", value: 36)
!529 = !DIEnumerator(name: "MagickLineJoinOptions", value: 37)
!530 = !DIEnumerator(name: "MagickListOptions", value: 38)
!531 = !DIEnumerator(name: "MagickLocaleOptions", value: 39)
!532 = !DIEnumerator(name: "MagickLogEventOptions", value: 40)
!533 = !DIEnumerator(name: "MagickLogOptions", value: 41)
!534 = !DIEnumerator(name: "MagickMagicOptions", value: 42)
!535 = !DIEnumerator(name: "MagickMethodOptions", value: 43)
!536 = !DIEnumerator(name: "MagickMetricOptions", value: 44)
!537 = !DIEnumerator(name: "MagickMimeOptions", value: 45)
!538 = !DIEnumerator(name: "MagickModeOptions", value: 46)
!539 = !DIEnumerator(name: "MagickModuleOptions", value: 47)
!540 = !DIEnumerator(name: "MagickMorphologyOptions", value: 48)
!541 = !DIEnumerator(name: "MagickNoiseOptions", value: 49)
!542 = !DIEnumerator(name: "MagickOrientationOptions", value: 50)
!543 = !DIEnumerator(name: "MagickPixelIntensityOptions", value: 51)
!544 = !DIEnumerator(name: "MagickPolicyOptions", value: 52)
!545 = !DIEnumerator(name: "MagickPolicyDomainOptions", value: 53)
!546 = !DIEnumerator(name: "MagickPolicyRightsOptions", value: 54)
!547 = !DIEnumerator(name: "MagickPreviewOptions", value: 55)
!548 = !DIEnumerator(name: "MagickPrimitiveOptions", value: 56)
!549 = !DIEnumerator(name: "MagickQuantumFormatOptions", value: 57)
!550 = !DIEnumerator(name: "MagickResolutionOptions", value: 58)
!551 = !DIEnumerator(name: "MagickResourceOptions", value: 59)
!552 = !DIEnumerator(name: "MagickSparseColorOptions", value: 60)
!553 = !DIEnumerator(name: "MagickStatisticOptions", value: 61)
!554 = !DIEnumerator(name: "MagickStorageOptions", value: 62)
!555 = !DIEnumerator(name: "MagickStretchOptions", value: 63)
!556 = !DIEnumerator(name: "MagickStyleOptions", value: 64)
!557 = !DIEnumerator(name: "MagickThresholdOptions", value: 65)
!558 = !DIEnumerator(name: "MagickTypeOptions", value: 66)
!559 = !DIEnumerator(name: "MagickValidateOptions", value: 67)
!560 = !DIEnumerator(name: "MagickVirtualPixelOptions", value: 68)
!561 = !DIEnumerator(name: "MagickComplexOptions", value: 69)
!562 = !DIEnumerator(name: "MagickIntensityOptions", value: 70)
!563 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !564, line: 25, baseType: !5, size: 32, elements: !565)
!564 = !DIFile(filename: "./magick/utility.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!565 = !{!566, !567, !568, !569, !570, !571, !572, !573, !574}
!566 = !DIEnumerator(name: "UndefinedPath", value: 0, isUnsigned: true)
!567 = !DIEnumerator(name: "MagickPath", value: 1, isUnsigned: true)
!568 = !DIEnumerator(name: "RootPath", value: 2, isUnsigned: true)
!569 = !DIEnumerator(name: "HeadPath", value: 3, isUnsigned: true)
!570 = !DIEnumerator(name: "TailPath", value: 4, isUnsigned: true)
!571 = !DIEnumerator(name: "BasePath", value: 5, isUnsigned: true)
!572 = !DIEnumerator(name: "ExtensionPath", value: 6, isUnsigned: true)
!573 = !DIEnumerator(name: "SubimagePath", value: 7, isUnsigned: true)
!574 = !DIEnumerator(name: "CanonicalPath", value: 8, isUnsigned: true)
!575 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !576, line: 28, baseType: !5, size: 32, elements: !577)
!576 = !DIFile(filename: "./magick/color.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!577 = !{!578, !579, !580, !581, !582, !583}
!578 = !DIEnumerator(name: "UndefinedCompliance", value: 0, isUnsigned: true)
!579 = !DIEnumerator(name: "NoCompliance", value: 0, isUnsigned: true)
!580 = !DIEnumerator(name: "SVGCompliance", value: 1, isUnsigned: true)
!581 = !DIEnumerator(name: "X11Compliance", value: 2, isUnsigned: true)
!582 = !DIEnumerator(name: "XPMCompliance", value: 4, isUnsigned: true)
!583 = !DIEnumerator(name: "AllCompliance", value: 2147483647, isUnsigned: true)
!584 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !585, line: 25, baseType: !5, size: 32, elements: !586)
!585 = !DIFile(filename: "./magick/registry.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!586 = !{!587, !588, !589, !590}
!587 = !DIEnumerator(name: "UndefinedRegistryType", value: 0, isUnsigned: true)
!588 = !DIEnumerator(name: "ImageRegistryType", value: 1, isUnsigned: true)
!589 = !DIEnumerator(name: "ImageInfoRegistryType", value: 2, isUnsigned: true)
!590 = !DIEnumerator(name: "StringRegistryType", value: 3, isUnsigned: true)
!591 = !{!592, !593, !645, !654, !656, !657, !674, !663, !731, !882, !884, !1011, !1030, !1036, !700, !647, !695, !1058, !623, !601, !1060, !1065, !1074, !801, !1075, !489, !1076, !1078}
!592 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64)
!594 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !595, line: 7, baseType: !596)
!595 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!596 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !597, line: 49, size: 1728, elements: !598)
!597 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!598 = !{!599, !600, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !616, !618, !619, !620, !624, !626, !628, !632, !635, !637, !640, !643, !644, !646, !649, !650}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !596, file: !597, line: 51, baseType: !489, size: 32)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !596, file: !597, line: 54, baseType: !601, size: 64, offset: 64)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64)
!602 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !596, file: !597, line: 55, baseType: !601, size: 64, offset: 128)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !596, file: !597, line: 56, baseType: !601, size: 64, offset: 192)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !596, file: !597, line: 57, baseType: !601, size: 64, offset: 256)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !596, file: !597, line: 58, baseType: !601, size: 64, offset: 320)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !596, file: !597, line: 59, baseType: !601, size: 64, offset: 384)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !596, file: !597, line: 60, baseType: !601, size: 64, offset: 448)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !596, file: !597, line: 61, baseType: !601, size: 64, offset: 512)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !596, file: !597, line: 64, baseType: !601, size: 64, offset: 576)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !596, file: !597, line: 65, baseType: !601, size: 64, offset: 640)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !596, file: !597, line: 66, baseType: !601, size: 64, offset: 704)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !596, file: !597, line: 68, baseType: !614, size: 64, offset: 768)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!615 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !597, line: 36, flags: DIFlagFwdDecl)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !596, file: !597, line: 70, baseType: !617, size: 64, offset: 832)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !596, file: !597, line: 72, baseType: !489, size: 32, offset: 896)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !596, file: !597, line: 73, baseType: !489, size: 32, offset: 928)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !596, file: !597, line: 74, baseType: !621, size: 64, offset: 960)
!621 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !622, line: 152, baseType: !623)
!622 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!623 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !596, file: !597, line: 77, baseType: !625, size: 16, offset: 1024)
!625 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !596, file: !597, line: 78, baseType: !627, size: 8, offset: 1040)
!627 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !596, file: !597, line: 79, baseType: !629, size: 8, offset: 1048)
!629 = !DICompositeType(tag: DW_TAG_array_type, baseType: !602, size: 8, elements: !630)
!630 = !{!631}
!631 = !DISubrange(count: 1)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !596, file: !597, line: 81, baseType: !633, size: 64, offset: 1088)
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 64)
!634 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !597, line: 43, baseType: null)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !596, file: !597, line: 89, baseType: !636, size: 64, offset: 1152)
!636 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !622, line: 153, baseType: !623)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !596, file: !597, line: 91, baseType: !638, size: 64, offset: 1216)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 64)
!639 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !597, line: 37, flags: DIFlagFwdDecl)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !596, file: !597, line: 92, baseType: !641, size: 64, offset: 1280)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64)
!642 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !597, line: 38, flags: DIFlagFwdDecl)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !596, file: !597, line: 93, baseType: !617, size: 64, offset: 1344)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !596, file: !597, line: 94, baseType: !645, size: 64, offset: 1408)
!645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !596, file: !597, line: 95, baseType: !647, size: 64, offset: 1472)
!647 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !648, line: 46, baseType: !592)
!648 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!649 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !596, file: !597, line: 96, baseType: !489, size: 32, offset: 1536)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !596, file: !597, line: 98, baseType: !651, size: 160, offset: 1568)
!651 = !DICompositeType(tag: DW_TAG_array_type, baseType: !602, size: 160, elements: !652)
!652 = !{!653}
!653 = !DISubrange(count: 20)
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 64)
!655 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !602)
!656 = !DIDerivedType(tag: DW_TAG_typedef, name: "StatisticType", file: !476, line: 124, baseType: !475)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64)
!658 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChannelStatistics", file: !476, line: 44, baseType: !659)
!659 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ChannelStatistics", file: !476, line: 27, size: 768, elements: !660)
!660 = !{!661, !662, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !659, file: !476, line: 30, baseType: !647, size: 64)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "minima", scope: !659, file: !476, line: 33, baseType: !663, size: 64, offset: 64)
!663 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "maxima", scope: !659, file: !476, line: 34, baseType: !663, size: 64, offset: 128)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "sum", scope: !659, file: !476, line: 35, baseType: !663, size: 64, offset: 192)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "sum_squared", scope: !659, file: !476, line: 36, baseType: !663, size: 64, offset: 256)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "sum_cubed", scope: !659, file: !476, line: 37, baseType: !663, size: 64, offset: 320)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "sum_fourth_power", scope: !659, file: !476, line: 38, baseType: !663, size: 64, offset: 384)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "mean", scope: !659, file: !476, line: 39, baseType: !663, size: 64, offset: 448)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "variance", scope: !659, file: !476, line: 40, baseType: !663, size: 64, offset: 512)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "standard_deviation", scope: !659, file: !476, line: 41, baseType: !663, size: 64, offset: 576)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "kurtosis", scope: !659, file: !476, line: 42, baseType: !663, size: 64, offset: 640)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "skewness", scope: !659, file: !476, line: 43, baseType: !663, size: 64, offset: 704)
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 64)
!675 = !DIDerivedType(tag: DW_TAG_typedef, name: "Image", file: !4, line: 221, baseType: !676)
!676 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Image", file: !77, line: 150, size: 105920, elements: !677)
!677 = !{!678, !680, !682, !684, !685, !687, !689, !690, !691, !692, !693, !694, !704, !705, !706, !707, !708, !722, !724, !725, !727, !728, !729, !730, !734, !735, !736, !744, !745, !746, !747, !748, !749, !751, !753, !755, !757, !759, !761, !763, !764, !765, !766, !767, !768, !769, !776, !791, !803, !804, !805, !806, !810, !814, !818, !819, !820, !821, !822, !839, !840, !842, !843, !853, !854, !856, !857, !858, !859, !860, !861, !863, !864, !865, !866, !867, !868, !869, !871, !872, !873, !874, !875, !879, !881}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "storage_class", scope: !676, file: !77, line: 153, baseType: !679, size: 32)
!679 = !DIDerivedType(tag: DW_TAG_typedef, name: "ClassType", file: !4, line: 209, baseType: !9)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !676, file: !77, line: 156, baseType: !681, size: 32, offset: 32)
!681 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorspaceType", file: !15, line: 61, baseType: !14)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !676, file: !77, line: 159, baseType: !683, size: 32, offset: 64)
!683 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompressionType", file: !52, line: 49, baseType: !51)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !676, file: !77, line: 162, baseType: !647, size: 64, offset: 128)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !676, file: !77, line: 165, baseType: !686, size: 32, offset: 192)
!686 = !DIDerivedType(tag: DW_TAG_typedef, name: "OrientationType", file: !77, line: 86, baseType: !76)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "taint", scope: !676, file: !77, line: 168, baseType: !688, size: 32, offset: 224)
!688 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickBooleanType", file: !4, line: 215, baseType: !3)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "matte", scope: !676, file: !77, line: 169, baseType: !688, size: 32, offset: 256)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !676, file: !77, line: 172, baseType: !647, size: 64, offset: 320)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !676, file: !77, line: 173, baseType: !647, size: 64, offset: 384)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !676, file: !77, line: 174, baseType: !647, size: 64, offset: 448)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !676, file: !77, line: 175, baseType: !647, size: 64, offset: 512)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "colormap", scope: !676, file: !77, line: 178, baseType: !695, size: 64, offset: 576)
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 64)
!696 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelPacket", file: !326, line: 148, baseType: !697)
!697 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PixelPacket", file: !326, line: 131, size: 64, elements: !698)
!698 = !{!699, !701, !702, !703}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !697, file: !326, line: 143, baseType: !700, size: 16)
!700 = !DIDerivedType(tag: DW_TAG_typedef, name: "Quantum", file: !4, line: 93, baseType: !625)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !697, file: !326, line: 144, baseType: !700, size: 16, offset: 16)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !697, file: !326, line: 145, baseType: !700, size: 16, offset: 32)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !697, file: !326, line: 146, baseType: !700, size: 16, offset: 48)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "background_color", scope: !676, file: !77, line: 179, baseType: !696, size: 64, offset: 640)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !676, file: !77, line: 180, baseType: !696, size: 64, offset: 704)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "matte_color", scope: !676, file: !77, line: 181, baseType: !696, size: 64, offset: 768)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !676, file: !77, line: 184, baseType: !663, size: 64, offset: 832)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "chromaticity", scope: !676, file: !77, line: 187, baseType: !709, size: 768, offset: 896)
!709 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChromaticityInfo", file: !77, line: 128, baseType: !710)
!710 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ChromaticityInfo", file: !77, line: 121, size: 768, elements: !711)
!711 = !{!712, !719, !720, !721}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "red_primary", scope: !710, file: !77, line: 124, baseType: !713, size: 192)
!713 = !DIDerivedType(tag: DW_TAG_typedef, name: "PrimaryInfo", file: !77, line: 101, baseType: !714)
!714 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PrimaryInfo", file: !77, line: 95, size: 192, elements: !715)
!715 = !{!716, !717, !718}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !714, file: !77, line: 98, baseType: !663, size: 64)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !714, file: !77, line: 99, baseType: !663, size: 64, offset: 64)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !714, file: !77, line: 100, baseType: !663, size: 64, offset: 128)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "green_primary", scope: !710, file: !77, line: 125, baseType: !713, size: 192, offset: 192)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "blue_primary", scope: !710, file: !77, line: 126, baseType: !713, size: 192, offset: 384)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "white_point", scope: !710, file: !77, line: 127, baseType: !713, size: 192, offset: 576)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "rendering_intent", scope: !676, file: !77, line: 190, baseType: !723, size: 32, offset: 1664)
!723 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderingIntent", file: !89, line: 49, baseType: !88)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !676, file: !77, line: 193, baseType: !645, size: 64, offset: 1728)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !676, file: !77, line: 196, baseType: !726, size: 32, offset: 1792)
!726 = !DIDerivedType(tag: DW_TAG_typedef, name: "ResolutionType", file: !77, line: 93, baseType: !96)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "montage", scope: !676, file: !77, line: 199, baseType: !601, size: 64, offset: 1856)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "directory", scope: !676, file: !77, line: 200, baseType: !601, size: 64, offset: 1920)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "geometry", scope: !676, file: !77, line: 201, baseType: !601, size: 64, offset: 1984)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !676, file: !77, line: 204, baseType: !731, size: 64, offset: 2048)
!731 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !732, line: 77, baseType: !733)
!732 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!733 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !622, line: 193, baseType: !623)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "x_resolution", scope: !676, file: !77, line: 207, baseType: !663, size: 64, offset: 2112)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "y_resolution", scope: !676, file: !77, line: 208, baseType: !663, size: 64, offset: 2176)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !676, file: !77, line: 211, baseType: !737, size: 256, offset: 2240)
!737 = !DIDerivedType(tag: DW_TAG_typedef, name: "RectangleInfo", file: !153, line: 130, baseType: !738)
!738 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_RectangleInfo", file: !153, line: 121, size: 256, elements: !739)
!739 = !{!740, !741, !742, !743}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !738, file: !153, line: 124, baseType: !647, size: 64)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !738, file: !153, line: 125, baseType: !647, size: 64, offset: 64)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !738, file: !153, line: 128, baseType: !731, size: 64, offset: 128)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !738, file: !153, line: 129, baseType: !731, size: 64, offset: 192)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "extract_info", scope: !676, file: !77, line: 212, baseType: !737, size: 256, offset: 2496)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "tile_info", scope: !676, file: !77, line: 213, baseType: !737, size: 256, offset: 2752)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "bias", scope: !676, file: !77, line: 216, baseType: !663, size: 64, offset: 3008)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "blur", scope: !676, file: !77, line: 217, baseType: !663, size: 64, offset: 3072)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !676, file: !77, line: 218, baseType: !663, size: 64, offset: 3136)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !676, file: !77, line: 221, baseType: !750, size: 32, offset: 3200)
!750 = !DIDerivedType(tag: DW_TAG_typedef, name: "FilterTypes", file: !102, line: 66, baseType: !101)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "interlace", scope: !676, file: !77, line: 224, baseType: !752, size: 32, offset: 3232)
!752 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterlaceType", file: !77, line: 73, baseType: !136)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !676, file: !77, line: 227, baseType: !754, size: 32, offset: 3264)
!754 = !DIDerivedType(tag: DW_TAG_typedef, name: "EndianType", file: !147, line: 35, baseType: !146)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !676, file: !77, line: 230, baseType: !756, size: 32, offset: 3296)
!756 = !DIDerivedType(tag: DW_TAG_typedef, name: "GravityType", file: !153, line: 91, baseType: !152)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !676, file: !77, line: 233, baseType: !758, size: 32, offset: 3328)
!758 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompositeOperator", file: !168, line: 99, baseType: !167)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "dispose", scope: !676, file: !77, line: 236, baseType: !760, size: 32, offset: 3360)
!760 = !DIDerivedType(tag: DW_TAG_typedef, name: "DisposeType", file: !239, line: 32, baseType: !238)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "clip_mask", scope: !676, file: !77, line: 239, baseType: !762, size: 64, offset: 3392)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !676, size: 64)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !676, file: !77, line: 242, baseType: !647, size: 64, offset: 3456)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !676, file: !77, line: 243, baseType: !647, size: 64, offset: 3520)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_second", scope: !676, file: !77, line: 246, baseType: !731, size: 64, offset: 3584)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "iterations", scope: !676, file: !77, line: 249, baseType: !647, size: 64, offset: 3648)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "total_colors", scope: !676, file: !77, line: 250, baseType: !647, size: 64, offset: 3712)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "start_loop", scope: !676, file: !77, line: 253, baseType: !731, size: 64, offset: 3776)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !676, file: !77, line: 256, baseType: !770, size: 192, offset: 3840)
!770 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErrorInfo", file: !576, line: 68, baseType: !771)
!771 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ErrorInfo", file: !576, line: 62, size: 192, elements: !772)
!772 = !{!773, !774, !775}
!773 = !DIDerivedType(tag: DW_TAG_member, name: "mean_error_per_pixel", scope: !771, file: !576, line: 65, baseType: !663, size: 64)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_mean_error", scope: !771, file: !576, line: 66, baseType: !663, size: 64, offset: 64)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_maximum_error", scope: !771, file: !576, line: 67, baseType: !663, size: 64, offset: 128)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !676, file: !77, line: 259, baseType: !777, size: 512, offset: 4032)
!777 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerInfo", file: !247, line: 51, baseType: !778)
!778 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TimerInfo", file: !247, line: 40, size: 512, elements: !779)
!779 = !{!780, !787, !788, !790}
!780 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !778, file: !247, line: 43, baseType: !781, size: 192)
!781 = !DIDerivedType(tag: DW_TAG_typedef, name: "Timer", file: !247, line: 38, baseType: !782)
!782 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Timer", file: !247, line: 32, size: 192, elements: !783)
!783 = !{!784, !785, !786}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !782, file: !247, line: 35, baseType: !663, size: 64)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !782, file: !247, line: 36, baseType: !663, size: 64, offset: 64)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !782, file: !247, line: 37, baseType: !663, size: 64, offset: 128)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "elapsed", scope: !778, file: !247, line: 44, baseType: !781, size: 192, offset: 192)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !778, file: !247, line: 47, baseType: !789, size: 32, offset: 384)
!789 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerState", file: !247, line: 30, baseType: !246)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !778, file: !247, line: 50, baseType: !647, size: 64, offset: 448)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !676, file: !77, line: 262, baseType: !792, size: 64, offset: 4544)
!792 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickProgressMonitor", file: !793, line: 26, baseType: !794)
!793 = !DIFile(filename: "./magick/monitor.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !795, size: 64)
!795 = !DISubroutineType(types: !796)
!796 = !{!688, !654, !797, !800, !645}
!797 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !798)
!798 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickOffsetType", file: !4, line: 150, baseType: !799)
!799 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!800 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !801)
!801 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickSizeType", file: !4, line: 151, baseType: !802)
!802 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !676, file: !77, line: 265, baseType: !645, size: 64, offset: 4608)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !676, file: !77, line: 266, baseType: !645, size: 64, offset: 4672)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !676, file: !77, line: 267, baseType: !645, size: 64, offset: 4736)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "ascii85", scope: !676, file: !77, line: 270, baseType: !807, size: 64, offset: 4800)
!807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !808, size: 64)
!808 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ascii85Info", file: !52, line: 52, baseType: !809)
!809 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Ascii85Info", file: !52, line: 51, flags: DIFlagFwdDecl)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !676, file: !77, line: 273, baseType: !811, size: 64, offset: 4864)
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !812, size: 64)
!812 = !DIDerivedType(tag: DW_TAG_typedef, name: "BlobInfo", file: !4, line: 217, baseType: !813)
!813 = !DICompositeType(tag: DW_TAG_structure_type, name: "_BlobInfo", file: !4, line: 217, flags: DIFlagFwdDecl)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !676, file: !77, line: 276, baseType: !815, size: 32768, offset: 4928)
!815 = !DICompositeType(tag: DW_TAG_array_type, baseType: !602, size: 32768, elements: !816)
!816 = !{!817}
!817 = !DISubrange(count: 4096)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "magick_filename", scope: !676, file: !77, line: 277, baseType: !815, size: 32768, offset: 37696)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !676, file: !77, line: 278, baseType: !815, size: 32768, offset: 70464)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "magick_columns", scope: !676, file: !77, line: 281, baseType: !647, size: 64, offset: 103232)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "magick_rows", scope: !676, file: !77, line: 282, baseType: !647, size: 64, offset: 103296)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "exception", scope: !676, file: !77, line: 285, baseType: !823, size: 448, offset: 103360)
!823 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionInfo", file: !4, line: 219, baseType: !824)
!824 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ExceptionInfo", file: !253, line: 102, size: 448, elements: !825)
!825 = !{!826, !828, !829, !830, !831, !832, !833, !838}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "severity", scope: !824, file: !253, line: 105, baseType: !827, size: 32)
!827 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionType", file: !253, line: 100, baseType: !252)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "error_number", scope: !824, file: !253, line: 108, baseType: !489, size: 32, offset: 32)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !824, file: !253, line: 111, baseType: !601, size: 64, offset: 64)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !824, file: !253, line: 112, baseType: !601, size: 64, offset: 128)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "exceptions", scope: !824, file: !253, line: 115, baseType: !645, size: 64, offset: 192)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "relinquish", scope: !824, file: !253, line: 118, baseType: !688, size: 32, offset: 256)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !824, file: !253, line: 121, baseType: !834, size: 64, offset: 320)
!834 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !835, size: 64)
!835 = !DIDerivedType(tag: DW_TAG_typedef, name: "SemaphoreInfo", file: !836, line: 26, baseType: !837)
!836 = !DIFile(filename: "./magick/semaphore.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!837 = !DICompositeType(tag: DW_TAG_structure_type, name: "SemaphoreInfo", file: !836, line: 25, flags: DIFlagFwdDecl)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !824, file: !253, line: 124, baseType: !647, size: 64, offset: 384)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !676, file: !77, line: 288, baseType: !688, size: 32, offset: 103808)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !676, file: !77, line: 291, baseType: !841, size: 64, offset: 103872)
!841 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !731)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !676, file: !77, line: 294, baseType: !834, size: 64, offset: 103936)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "color_profile", scope: !676, file: !77, line: 297, baseType: !844, size: 256, offset: 104000)
!844 = !DIDerivedType(tag: DW_TAG_typedef, name: "ProfileInfo", file: !89, line: 40, baseType: !845)
!845 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ProfileInfo", file: !89, line: 27, size: 256, elements: !846)
!846 = !{!847, !848, !849, !852}
!847 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !845, file: !89, line: 30, baseType: !601, size: 64)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !845, file: !89, line: 33, baseType: !647, size: 64, offset: 64)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !845, file: !89, line: 36, baseType: !850, size: 64, offset: 128)
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !851, size: 64)
!851 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !845, file: !89, line: 39, baseType: !647, size: 64, offset: 192)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "iptc_profile", scope: !676, file: !77, line: 298, baseType: !844, size: 256, offset: 104256)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profile", scope: !676, file: !77, line: 299, baseType: !855, size: 64, offset: 104512)
!855 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !844, size: 64)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profiles", scope: !676, file: !77, line: 302, baseType: !647, size: 64, offset: 104576)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !676, file: !77, line: 305, baseType: !647, size: 64, offset: 104640)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !676, file: !77, line: 308, baseType: !762, size: 64, offset: 104704)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !676, file: !77, line: 309, baseType: !762, size: 64, offset: 104768)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !676, file: !77, line: 310, baseType: !762, size: 64, offset: 104832)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "interpolate", scope: !676, file: !77, line: 313, baseType: !862, size: 32, offset: 104896)
!862 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterpolatePixelMethod", file: !326, line: 47, baseType: !325)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "black_point_compensation", scope: !676, file: !77, line: 316, baseType: !688, size: 32, offset: 104928)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_color", scope: !676, file: !77, line: 319, baseType: !696, size: 64, offset: 104960)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !676, file: !77, line: 322, baseType: !762, size: 64, offset: 105024)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "tile_offset", scope: !676, file: !77, line: 325, baseType: !737, size: 256, offset: 105088)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !676, file: !77, line: 328, baseType: !645, size: 64, offset: 105344)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "artifacts", scope: !676, file: !77, line: 329, baseType: !645, size: 64, offset: 105408)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !676, file: !77, line: 332, baseType: !870, size: 32, offset: 105472)
!870 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageType", file: !77, line: 61, baseType: !342)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !676, file: !77, line: 335, baseType: !688, size: 32, offset: 105504)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !676, file: !77, line: 338, baseType: !801, size: 64, offset: 105536)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "ping", scope: !676, file: !77, line: 341, baseType: !688, size: 32, offset: 105600)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !676, file: !77, line: 344, baseType: !647, size: 64, offset: 105664)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !676, file: !77, line: 347, baseType: !876, size: 64, offset: 105728)
!876 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !877, line: 7, baseType: !878)
!877 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "")
!878 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !622, line: 160, baseType: !623)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "intensity", scope: !676, file: !77, line: 350, baseType: !880, size: 32, offset: 105792)
!880 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelIntensityMethod", file: !326, line: 79, baseType: !356)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !676, file: !77, line: 353, baseType: !647, size: 64, offset: 105856)
!882 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !883, size: 64)
!883 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !696)
!884 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !885, size: 64)
!885 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !886)
!886 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickInfo", file: !445, line: 103, baseType: !887)
!887 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MagickInfo", file: !445, line: 51, size: 1216, elements: !888)
!888 = !{!889, !890, !891, !892, !893, !894, !974, !982, !987, !994, !995, !996, !997, !998, !999, !1000, !1002, !1004, !1005, !1007, !1008, !1009, !1010}
!889 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !887, file: !445, line: 54, baseType: !601, size: 64)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !887, file: !445, line: 55, baseType: !601, size: 64, offset: 64)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !887, file: !445, line: 56, baseType: !601, size: 64, offset: 128)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "note", scope: !887, file: !445, line: 57, baseType: !601, size: 64, offset: 192)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "module", scope: !887, file: !445, line: 58, baseType: !601, size: 64, offset: 256)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "image_info", scope: !887, file: !445, line: 61, baseType: !895, size: 64, offset: 320)
!895 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !896, size: 64)
!896 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageInfo", file: !4, line: 223, baseType: !897)
!897 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ImageInfo", file: !77, line: 356, size: 134336, elements: !898)
!898 = !{!899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !933, !934, !935, !936, !937, !938, !940, !941, !942, !943, !944, !945, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !971, !972, !973}
!899 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !897, file: !77, line: 359, baseType: !683, size: 32)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !897, file: !77, line: 362, baseType: !686, size: 32, offset: 32)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "temporary", scope: !897, file: !77, line: 365, baseType: !688, size: 32, offset: 64)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "adjoin", scope: !897, file: !77, line: 366, baseType: !688, size: 32, offset: 96)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "affirm", scope: !897, file: !77, line: 367, baseType: !688, size: 32, offset: 128)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "antialias", scope: !897, file: !77, line: 368, baseType: !688, size: 32, offset: 160)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !897, file: !77, line: 371, baseType: !601, size: 64, offset: 192)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "extract", scope: !897, file: !77, line: 372, baseType: !601, size: 64, offset: 256)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !897, file: !77, line: 373, baseType: !601, size: 64, offset: 320)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "scenes", scope: !897, file: !77, line: 374, baseType: !601, size: 64, offset: 384)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !897, file: !77, line: 377, baseType: !647, size: 64, offset: 448)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "number_scenes", scope: !897, file: !77, line: 378, baseType: !647, size: 64, offset: 512)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !897, file: !77, line: 379, baseType: !647, size: 64, offset: 576)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "interlace", scope: !897, file: !77, line: 382, baseType: !752, size: 32, offset: 640)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !897, file: !77, line: 385, baseType: !754, size: 32, offset: 672)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !897, file: !77, line: 388, baseType: !726, size: 32, offset: 704)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !897, file: !77, line: 391, baseType: !647, size: 64, offset: 768)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "sampling_factor", scope: !897, file: !77, line: 394, baseType: !601, size: 64, offset: 832)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "server_name", scope: !897, file: !77, line: 395, baseType: !601, size: 64, offset: 896)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "font", scope: !897, file: !77, line: 396, baseType: !601, size: 64, offset: 960)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "texture", scope: !897, file: !77, line: 397, baseType: !601, size: 64, offset: 1024)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "density", scope: !897, file: !77, line: 398, baseType: !601, size: 64, offset: 1088)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "pointsize", scope: !897, file: !77, line: 401, baseType: !663, size: 64, offset: 1152)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !897, file: !77, line: 402, baseType: !663, size: 64, offset: 1216)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "background_color", scope: !897, file: !77, line: 405, baseType: !696, size: 64, offset: 1280)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !897, file: !77, line: 406, baseType: !696, size: 64, offset: 1344)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "matte_color", scope: !897, file: !77, line: 407, baseType: !696, size: 64, offset: 1408)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !897, file: !77, line: 410, baseType: !688, size: 32, offset: 1472)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "monochrome", scope: !897, file: !77, line: 411, baseType: !688, size: 32, offset: 1504)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !897, file: !77, line: 414, baseType: !647, size: 64, offset: 1536)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !897, file: !77, line: 417, baseType: !681, size: 32, offset: 1600)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !897, file: !77, line: 420, baseType: !870, size: 32, offset: 1632)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "preview_type", scope: !897, file: !77, line: 423, baseType: !932, size: 32, offset: 1664)
!932 = !DIDerivedType(tag: DW_TAG_typedef, name: "PreviewType", file: !369, line: 59, baseType: !368)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !897, file: !77, line: 426, baseType: !731, size: 64, offset: 1728)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "ping", scope: !897, file: !77, line: 429, baseType: !688, size: 32, offset: 1792)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !897, file: !77, line: 430, baseType: !688, size: 32, offset: 1824)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !897, file: !77, line: 433, baseType: !601, size: 64, offset: 1856)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "authenticate", scope: !897, file: !77, line: 434, baseType: !601, size: 64, offset: 1920)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !897, file: !77, line: 437, baseType: !939, size: 32, offset: 1984)
!939 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChannelType", file: !4, line: 202, baseType: !401)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !897, file: !77, line: 440, baseType: !674, size: 64, offset: 2048)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !897, file: !77, line: 443, baseType: !645, size: 64, offset: 2112)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !897, file: !77, line: 446, baseType: !792, size: 64, offset: 2176)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !897, file: !77, line: 449, baseType: !645, size: 64, offset: 2240)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !897, file: !77, line: 450, baseType: !645, size: 64, offset: 2304)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !897, file: !77, line: 453, baseType: !946, size: 64, offset: 2368)
!946 = !DIDerivedType(tag: DW_TAG_typedef, name: "StreamHandler", file: !947, line: 26, baseType: !948)
!947 = !DIFile(filename: "./magick/stream.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!948 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 64)
!949 = !DISubroutineType(types: !950)
!950 = !{!647, !951, !953, !955}
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64)
!952 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !675)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64)
!954 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!955 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !647)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !897, file: !77, line: 456, baseType: !593, size: 64, offset: 2432)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !897, file: !77, line: 459, baseType: !645, size: 64, offset: 2496)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !897, file: !77, line: 462, baseType: !647, size: 64, offset: 2560)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !897, file: !77, line: 465, baseType: !815, size: 32768, offset: 2624)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "unique", scope: !897, file: !77, line: 466, baseType: !815, size: 32768, offset: 35392)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "zero", scope: !897, file: !77, line: 467, baseType: !815, size: 32768, offset: 68160)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !897, file: !77, line: 468, baseType: !815, size: 32768, offset: 100928)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !897, file: !77, line: 471, baseType: !688, size: 32, offset: 133696)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "tile", scope: !897, file: !77, line: 474, baseType: !601, size: 64, offset: 133760)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "subimage", scope: !897, file: !77, line: 477, baseType: !647, size: 64, offset: 133824)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "subrange", scope: !897, file: !77, line: 478, baseType: !647, size: 64, offset: 133888)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "pen", scope: !897, file: !77, line: 481, baseType: !696, size: 64, offset: 133952)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !897, file: !77, line: 484, baseType: !647, size: 64, offset: 134016)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_pixel_method", scope: !897, file: !77, line: 487, baseType: !970, size: 32, offset: 134080)
!970 = !DIDerivedType(tag: DW_TAG_typedef, name: "VirtualPixelMethod", file: !424, line: 47, baseType: !423)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_color", scope: !897, file: !77, line: 490, baseType: !696, size: 64, offset: 134112)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !897, file: !77, line: 493, baseType: !645, size: 64, offset: 134208)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "synchronize", scope: !897, file: !77, line: 496, baseType: !688, size: 32, offset: 134272)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "decoder", scope: !887, file: !445, line: 64, baseType: !975, size: 64, offset: 384)
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 64)
!976 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeImageHandler", file: !445, line: 43, baseType: !977)
!977 = !DISubroutineType(types: !978)
!978 = !{!674, !979, !981}
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 64)
!980 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !896)
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !823, size: 64)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "encoder", scope: !887, file: !445, line: 67, baseType: !983, size: 64, offset: 448)
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64)
!984 = !DIDerivedType(tag: DW_TAG_typedef, name: "EncodeImageHandler", file: !445, line: 46, baseType: !985)
!985 = !DISubroutineType(types: !986)
!986 = !{!688, !979, !674}
!987 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !887, file: !445, line: 70, baseType: !988, size: 64, offset: 512)
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 64)
!989 = !DIDerivedType(tag: DW_TAG_typedef, name: "IsImageFormatHandler", file: !445, line: 49, baseType: !990)
!990 = !DISubroutineType(types: !991)
!991 = !{!688, !992, !955}
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 64)
!993 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !851)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !887, file: !445, line: 73, baseType: !645, size: 64, offset: 576)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "adjoin", scope: !887, file: !445, line: 76, baseType: !688, size: 32, offset: 640)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !887, file: !445, line: 77, baseType: !688, size: 32, offset: 672)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "endian_support", scope: !887, file: !445, line: 78, baseType: !688, size: 32, offset: 704)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "blob_support", scope: !887, file: !445, line: 79, baseType: !688, size: 32, offset: 736)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "seekable_stream", scope: !887, file: !445, line: 80, baseType: !688, size: 32, offset: 768)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "format_type", scope: !887, file: !445, line: 83, baseType: !1001, size: 32, offset: 800)
!1001 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickFormatType", file: !445, line: 33, baseType: !444)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "thread_support", scope: !887, file: !445, line: 86, baseType: !1003, size: 32, offset: 832)
!1003 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickStatusType", file: !4, line: 147, baseType: !5)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "stealth", scope: !887, file: !445, line: 89, baseType: !688, size: 32, offset: 864)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !887, file: !445, line: 92, baseType: !1006, size: 64, offset: 896)
!1006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !887, size: 64)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !887, file: !445, line: 93, baseType: !1006, size: 64, offset: 960)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !887, file: !445, line: 96, baseType: !647, size: 64, offset: 1024)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !887, file: !445, line: 99, baseType: !601, size: 64, offset: 1088)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !887, file: !445, line: 102, baseType: !834, size: 64, offset: 1152)
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64)
!1012 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChannelMoments", file: !476, line: 59, baseType: !1013)
!1013 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ChannelMoments", file: !476, line: 46, size: 2496, elements: !1014)
!1014 = !{!1015, !1019, !1026, !1027, !1028, !1029}
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "I", scope: !1013, file: !476, line: 49, baseType: !1016, size: 2048)
!1016 = !DICompositeType(tag: DW_TAG_array_type, baseType: !663, size: 2048, elements: !1017)
!1017 = !{!1018}
!1018 = !DISubrange(count: 32)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "centroid", scope: !1013, file: !476, line: 52, baseType: !1020, size: 128, offset: 2048)
!1020 = !DIDerivedType(tag: DW_TAG_typedef, name: "PointInfo", file: !1021, line: 142, baseType: !1022)
!1021 = !DIFile(filename: "./magick/draw.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!1022 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PointInfo", file: !1021, line: 137, size: 128, elements: !1023)
!1023 = !{!1024, !1025}
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1022, file: !1021, line: 140, baseType: !663, size: 64)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1022, file: !1021, line: 141, baseType: !663, size: 64, offset: 64)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "ellipse_axis", scope: !1013, file: !476, line: 53, baseType: !1020, size: 128, offset: 2176)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "ellipse_angle", scope: !1013, file: !476, line: 56, baseType: !663, size: 64, offset: 2304)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "ellipse_eccentricity", scope: !1013, file: !476, line: 57, baseType: !663, size: 64, offset: 2368)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "ellipse_intensity", scope: !1013, file: !476, line: 58, baseType: !663, size: 64, offset: 2432)
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1031, size: 64)
!1031 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChannelPerceptualHash", file: !476, line: 66, baseType: !1032)
!1032 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ChannelPerceptualHash", file: !476, line: 61, size: 4096, elements: !1033)
!1033 = !{!1034, !1035}
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "P", scope: !1032, file: !476, line: 64, baseType: !1016, size: 2048)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "Q", scope: !1032, file: !476, line: 65, baseType: !1016, size: 2048, offset: 2048)
!1036 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1037, size: 64)
!1037 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChannelFeatures", file: !1038, line: 45, baseType: !1039)
!1038 = !DIFile(filename: "./magick/feature.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!1039 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ChannelFeatures", file: !1038, line: 28, size: 3584, elements: !1040)
!1040 = !{!1041, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057}
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "angular_second_moment", scope: !1039, file: !1038, line: 31, baseType: !1042, size: 256)
!1042 = !DICompositeType(tag: DW_TAG_array_type, baseType: !663, size: 256, elements: !1043)
!1043 = !{!1044}
!1044 = !DISubrange(count: 4)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "contrast", scope: !1039, file: !1038, line: 32, baseType: !1042, size: 256, offset: 256)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "correlation", scope: !1039, file: !1038, line: 33, baseType: !1042, size: 256, offset: 512)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "variance_sum_of_squares", scope: !1039, file: !1038, line: 34, baseType: !1042, size: 256, offset: 768)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "inverse_difference_moment", scope: !1039, file: !1038, line: 35, baseType: !1042, size: 256, offset: 1024)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "sum_average", scope: !1039, file: !1038, line: 36, baseType: !1042, size: 256, offset: 1280)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "sum_variance", scope: !1039, file: !1038, line: 37, baseType: !1042, size: 256, offset: 1536)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "sum_entropy", scope: !1039, file: !1038, line: 38, baseType: !1042, size: 256, offset: 1792)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "entropy", scope: !1039, file: !1038, line: 39, baseType: !1042, size: 256, offset: 2048)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "difference_variance", scope: !1039, file: !1038, line: 40, baseType: !1042, size: 256, offset: 2304)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "difference_entropy", scope: !1039, file: !1038, line: 41, baseType: !1042, size: 256, offset: 2560)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "measure_of_correlation_1", scope: !1039, file: !1038, line: 42, baseType: !1042, size: 256, offset: 2816)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "measure_of_correlation_2", scope: !1039, file: !1038, line: 43, baseType: !1042, size: 256, offset: 3072)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "maximum_correlation_coefficient", scope: !1039, file: !1038, line: 44, baseType: !1042, size: 256, offset: 3328)
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1059, size: 64)
!1059 = !DIDerivedType(tag: DW_TAG_typedef, name: "IndexPacket", file: !326, line: 129, baseType: !700)
!1060 = !DIDerivedType(tag: DW_TAG_typedef, name: "WarningHandler", file: !253, line: 134, baseType: !1061)
!1061 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1062, size: 64)
!1062 = !DISubroutineType(types: !1063)
!1063 = !{null, !1064, !654, !654}
!1064 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !827)
!1065 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1066, size: 64)
!1066 = !DIDerivedType(tag: DW_TAG_typedef, name: "StringInfo", file: !1067, line: 40, baseType: !1068)
!1067 = !DIFile(filename: "./magick/string_.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!1068 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_StringInfo", file: !1067, line: 29, size: 32960, elements: !1069)
!1069 = !{!1070, !1071, !1072, !1073}
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !1068, file: !1067, line: 32, baseType: !815, size: 32768)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "datum", scope: !1068, file: !1067, line: 35, baseType: !850, size: 64, offset: 32768)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1068, file: !1067, line: 38, baseType: !647, size: 64, offset: 32832)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !1068, file: !1067, line: 39, baseType: !647, size: 64, offset: 32896)
!1074 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64)
!1075 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64)
!1076 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1077, size: 64)
!1077 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1059)
!1078 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickRealType", file: !4, line: 78, baseType: !1079)
!1079 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!1080 = !{i32 7, !"Dwarf Version", i32 4}
!1081 = !{i32 2, !"Debug Info Version", i32 3}
!1082 = !{i32 1, !"wchar_size", i32 4}
!1083 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!1084 = distinct !DISubprogram(name: "IdentifyImage", scope: !1, file: !1, line: 482, type: !1085, scopeLine: 484, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !1088)
!1085 = !DISubroutineType(types: !1086)
!1086 = !{!688, !674, !593, !1087}
!1087 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !688)
!1088 = !{}
!1089 = !DILocalVariable(name: "image", arg: 1, scope: !1084, file: !1, line: 482, type: !674)
!1090 = !DILocation(line: 482, column: 53, scope: !1084)
!1091 = !DILocalVariable(name: "file", arg: 2, scope: !1084, file: !1, line: 482, type: !593)
!1092 = !DILocation(line: 482, column: 65, scope: !1084)
!1093 = !DILocalVariable(name: "verbose", arg: 3, scope: !1084, file: !1, line: 483, type: !1087)
!1094 = !DILocation(line: 483, column: 27, scope: !1084)
!1095 = !DILocalVariable(name: "color", scope: !1084, file: !1, line: 486, type: !815)
!1096 = !DILocation(line: 486, column: 5, scope: !1084)
!1097 = !DILocalVariable(name: "format", scope: !1084, file: !1, line: 487, type: !815)
!1098 = !DILocation(line: 487, column: 5, scope: !1084)
!1099 = !DILocalVariable(name: "key", scope: !1084, file: !1, line: 488, type: !815)
!1100 = !DILocation(line: 488, column: 5, scope: !1084)
!1101 = !DILocalVariable(name: "channel_features", scope: !1084, file: !1, line: 491, type: !1036)
!1102 = !DILocation(line: 491, column: 6, scope: !1084)
!1103 = !DILocalVariable(name: "channel_moments", scope: !1084, file: !1, line: 494, type: !1011)
!1104 = !DILocation(line: 494, column: 6, scope: !1084)
!1105 = !DILocalVariable(name: "channel_phash", scope: !1084, file: !1, line: 497, type: !1030)
!1106 = !DILocation(line: 497, column: 6, scope: !1084)
!1107 = !DILocalVariable(name: "channel_statistics", scope: !1084, file: !1, line: 500, type: !657)
!1108 = !DILocation(line: 500, column: 6, scope: !1084)
!1109 = !DILocalVariable(name: "colorspace", scope: !1084, file: !1, line: 503, type: !681)
!1110 = !DILocation(line: 503, column: 5, scope: !1084)
!1111 = !DILocalVariable(name: "artifact", scope: !1084, file: !1, line: 506, type: !654)
!1112 = !DILocation(line: 506, column: 6, scope: !1084)
!1113 = !DILocalVariable(name: "locate", scope: !1084, file: !1, line: 507, type: !654)
!1114 = !DILocation(line: 507, column: 6, scope: !1084)
!1115 = !DILocalVariable(name: "name", scope: !1084, file: !1, line: 508, type: !654)
!1116 = !DILocation(line: 508, column: 6, scope: !1084)
!1117 = !DILocalVariable(name: "property", scope: !1084, file: !1, line: 509, type: !654)
!1118 = !DILocation(line: 509, column: 6, scope: !1084)
!1119 = !DILocalVariable(name: "registry", scope: !1084, file: !1, line: 510, type: !654)
!1120 = !DILocation(line: 510, column: 6, scope: !1084)
!1121 = !DILocalVariable(name: "value", scope: !1084, file: !1, line: 511, type: !654)
!1122 = !DILocation(line: 511, column: 6, scope: !1084)
!1123 = !DILocalVariable(name: "magick_info", scope: !1084, file: !1, line: 514, type: !884)
!1124 = !DILocation(line: 514, column: 6, scope: !1084)
!1125 = !DILocalVariable(name: "pixels", scope: !1084, file: !1, line: 517, type: !882)
!1126 = !DILocation(line: 517, column: 6, scope: !1084)
!1127 = !DILocalVariable(name: "elapsed_time", scope: !1084, file: !1, line: 520, type: !663)
!1128 = !DILocation(line: 520, column: 5, scope: !1084)
!1129 = !DILocalVariable(name: "scale", scope: !1084, file: !1, line: 521, type: !663)
!1130 = !DILocation(line: 521, column: 5, scope: !1084)
!1131 = !DILocalVariable(name: "user_time", scope: !1084, file: !1, line: 522, type: !663)
!1132 = !DILocation(line: 522, column: 5, scope: !1084)
!1133 = !DILocalVariable(name: "exception", scope: !1084, file: !1, line: 525, type: !981)
!1134 = !DILocation(line: 525, column: 6, scope: !1084)
!1135 = !DILocalVariable(name: "type", scope: !1084, file: !1, line: 528, type: !870)
!1136 = !DILocation(line: 528, column: 5, scope: !1084)
!1137 = !DILocalVariable(name: "ping", scope: !1084, file: !1, line: 531, type: !688)
!1138 = !DILocation(line: 531, column: 5, scope: !1084)
!1139 = !DILocalVariable(name: "i", scope: !1084, file: !1, line: 534, type: !731)
!1140 = !DILocation(line: 534, column: 5, scope: !1084)
!1141 = !DILocalVariable(name: "x", scope: !1084, file: !1, line: 535, type: !731)
!1142 = !DILocation(line: 535, column: 5, scope: !1084)
!1143 = !DILocalVariable(name: "distance", scope: !1084, file: !1, line: 538, type: !647)
!1144 = !DILocation(line: 538, column: 5, scope: !1084)
!1145 = !DILocalVariable(name: "y", scope: !1084, file: !1, line: 541, type: !731)
!1146 = !DILocation(line: 541, column: 5, scope: !1084)
!1147 = !DILocation(line: 545, column: 7, scope: !1148)
!1148 = distinct !DILexicalBlock(scope: !1084, file: !1, line: 545, column: 7)
!1149 = !DILocation(line: 545, column: 14, scope: !1148)
!1150 = !DILocation(line: 545, column: 20, scope: !1148)
!1151 = !DILocation(line: 545, column: 7, scope: !1084)
!1152 = !DILocation(line: 546, column: 61, scope: !1148)
!1153 = !DILocation(line: 546, column: 68, scope: !1148)
!1154 = !DILocation(line: 546, column: 12, scope: !1148)
!1155 = !DILocation(line: 546, column: 5, scope: !1148)
!1156 = !DILocation(line: 547, column: 7, scope: !1157)
!1157 = distinct !DILexicalBlock(scope: !1084, file: !1, line: 547, column: 7)
!1158 = !DILocation(line: 547, column: 12, scope: !1157)
!1159 = !DILocation(line: 547, column: 7, scope: !1084)
!1160 = !DILocation(line: 548, column: 10, scope: !1157)
!1161 = !DILocation(line: 548, column: 9, scope: !1157)
!1162 = !DILocation(line: 548, column: 5, scope: !1157)
!1163 = !DILocation(line: 549, column: 13, scope: !1084)
!1164 = !DILocation(line: 549, column: 12, scope: !1084)
!1165 = !DILocation(line: 550, column: 27, scope: !1084)
!1166 = !DILocation(line: 550, column: 10, scope: !1084)
!1167 = !DILocation(line: 550, column: 9, scope: !1084)
!1168 = !DILocation(line: 551, column: 7, scope: !1169)
!1169 = distinct !DILexicalBlock(scope: !1084, file: !1, line: 551, column: 7)
!1170 = !DILocation(line: 551, column: 14, scope: !1169)
!1171 = !DILocation(line: 551, column: 7, scope: !1084)
!1172 = !DILocalVariable(name: "limit", scope: !1173, file: !1, line: 554, type: !654)
!1173 = distinct !DILexicalBlock(scope: !1169, file: !1, line: 552, column: 5)
!1174 = !DILocation(line: 554, column: 10, scope: !1173)
!1175 = !DILocalVariable(name: "max_locations", scope: !1173, file: !1, line: 557, type: !647)
!1176 = !DILocation(line: 557, column: 9, scope: !1173)
!1177 = !DILocalVariable(name: "type", scope: !1173, file: !1, line: 560, type: !656)
!1178 = !DILocation(line: 560, column: 9, scope: !1173)
!1179 = !DILocation(line: 566, column: 21, scope: !1173)
!1180 = !DILocation(line: 565, column: 28, scope: !1173)
!1181 = !DILocation(line: 565, column: 12, scope: !1173)
!1182 = !DILocation(line: 565, column: 11, scope: !1173)
!1183 = !DILocation(line: 567, column: 30, scope: !1173)
!1184 = !DILocation(line: 567, column: 13, scope: !1173)
!1185 = !DILocation(line: 567, column: 12, scope: !1173)
!1186 = !DILocation(line: 568, column: 20, scope: !1173)
!1187 = !DILocation(line: 569, column: 11, scope: !1188)
!1188 = distinct !DILexicalBlock(scope: !1173, file: !1, line: 569, column: 11)
!1189 = !DILocation(line: 569, column: 17, scope: !1188)
!1190 = !DILocation(line: 569, column: 11, scope: !1173)
!1191 = !DILocation(line: 570, column: 44, scope: !1188)
!1192 = !DILocation(line: 570, column: 23, scope: !1188)
!1193 = !DILocation(line: 570, column: 22, scope: !1188)
!1194 = !DILocation(line: 570, column: 9, scope: !1188)
!1195 = !DILocation(line: 571, column: 48, scope: !1173)
!1196 = !DILocation(line: 571, column: 54, scope: !1173)
!1197 = !DILocation(line: 571, column: 59, scope: !1173)
!1198 = !DILocation(line: 571, column: 26, scope: !1173)
!1199 = !DILocation(line: 571, column: 25, scope: !1173)
!1200 = !DILocation(line: 572, column: 11, scope: !1201)
!1201 = distinct !DILexicalBlock(scope: !1173, file: !1, line: 572, column: 11)
!1202 = !DILocation(line: 572, column: 30, scope: !1201)
!1203 = !DILocation(line: 572, column: 11, scope: !1173)
!1204 = !DILocation(line: 573, column: 9, scope: !1201)
!1205 = !DILocation(line: 574, column: 18, scope: !1173)
!1206 = !DILocation(line: 574, column: 25, scope: !1173)
!1207 = !DILocation(line: 574, column: 17, scope: !1173)
!1208 = !DILocation(line: 575, column: 23, scope: !1209)
!1209 = distinct !DILexicalBlock(scope: !1173, file: !1, line: 575, column: 11)
!1210 = !DILocation(line: 575, column: 29, scope: !1209)
!1211 = !DILocation(line: 575, column: 11, scope: !1209)
!1212 = !DILocation(line: 575, column: 40, scope: !1209)
!1213 = !DILocation(line: 575, column: 11, scope: !1173)
!1214 = !DILocation(line: 576, column: 19, scope: !1209)
!1215 = !DILocation(line: 576, column: 9, scope: !1209)
!1216 = !DILocation(line: 577, column: 31, scope: !1173)
!1217 = !DILocation(line: 577, column: 64, scope: !1173)
!1218 = !DILocation(line: 577, column: 14, scope: !1173)
!1219 = !DILocation(line: 578, column: 15, scope: !1173)
!1220 = !DILocation(line: 578, column: 7, scope: !1173)
!1221 = !DILocation(line: 579, column: 7, scope: !1173)
!1222 = !DILocation(line: 583, column: 40, scope: !1223)
!1223 = distinct !DILexicalBlock(scope: !1224, file: !1, line: 582, column: 9)
!1224 = distinct !DILexicalBlock(scope: !1173, file: !1, line: 579, column: 7)
!1225 = !DILocation(line: 583, column: 45, scope: !1223)
!1226 = !DILocation(line: 583, column: 68, scope: !1223)
!1227 = !DILocation(line: 584, column: 13, scope: !1223)
!1228 = !DILocation(line: 584, column: 27, scope: !1223)
!1229 = !DILocation(line: 583, column: 18, scope: !1223)
!1230 = !DILocation(line: 585, column: 40, scope: !1223)
!1231 = !DILocation(line: 585, column: 45, scope: !1223)
!1232 = !DILocation(line: 585, column: 72, scope: !1223)
!1233 = !DILocation(line: 586, column: 13, scope: !1223)
!1234 = !DILocation(line: 586, column: 27, scope: !1223)
!1235 = !DILocation(line: 585, column: 18, scope: !1223)
!1236 = !DILocation(line: 587, column: 40, scope: !1223)
!1237 = !DILocation(line: 587, column: 45, scope: !1223)
!1238 = !DILocation(line: 587, column: 70, scope: !1223)
!1239 = !DILocation(line: 588, column: 13, scope: !1223)
!1240 = !DILocation(line: 588, column: 27, scope: !1223)
!1241 = !DILocation(line: 587, column: 18, scope: !1223)
!1242 = !DILocation(line: 589, column: 11, scope: !1223)
!1243 = !DILocation(line: 593, column: 40, scope: !1244)
!1244 = distinct !DILexicalBlock(scope: !1224, file: !1, line: 592, column: 9)
!1245 = !DILocation(line: 593, column: 45, scope: !1244)
!1246 = !DILocation(line: 593, column: 70, scope: !1244)
!1247 = !DILocation(line: 594, column: 13, scope: !1244)
!1248 = !DILocation(line: 594, column: 27, scope: !1244)
!1249 = !DILocation(line: 593, column: 18, scope: !1244)
!1250 = !DILocation(line: 595, column: 40, scope: !1244)
!1251 = !DILocation(line: 595, column: 45, scope: !1244)
!1252 = !DILocation(line: 595, column: 76, scope: !1244)
!1253 = !DILocation(line: 596, column: 13, scope: !1244)
!1254 = !DILocation(line: 596, column: 27, scope: !1244)
!1255 = !DILocation(line: 595, column: 18, scope: !1244)
!1256 = !DILocation(line: 597, column: 40, scope: !1244)
!1257 = !DILocation(line: 597, column: 45, scope: !1244)
!1258 = !DILocation(line: 597, column: 74, scope: !1244)
!1259 = !DILocation(line: 598, column: 13, scope: !1244)
!1260 = !DILocation(line: 598, column: 27, scope: !1244)
!1261 = !DILocation(line: 597, column: 18, scope: !1244)
!1262 = !DILocation(line: 599, column: 40, scope: !1244)
!1263 = !DILocation(line: 599, column: 45, scope: !1244)
!1264 = !DILocation(line: 599, column: 72, scope: !1244)
!1265 = !DILocation(line: 600, column: 13, scope: !1244)
!1266 = !DILocation(line: 600, column: 27, scope: !1244)
!1267 = !DILocation(line: 599, column: 18, scope: !1244)
!1268 = !DILocation(line: 601, column: 11, scope: !1244)
!1269 = !DILocation(line: 605, column: 40, scope: !1270)
!1270 = distinct !DILexicalBlock(scope: !1224, file: !1, line: 604, column: 9)
!1271 = !DILocation(line: 605, column: 45, scope: !1270)
!1272 = !DILocation(line: 605, column: 70, scope: !1270)
!1273 = !DILocation(line: 606, column: 13, scope: !1270)
!1274 = !DILocation(line: 606, column: 27, scope: !1270)
!1275 = !DILocation(line: 605, column: 18, scope: !1270)
!1276 = !DILocation(line: 607, column: 11, scope: !1270)
!1277 = !DILocation(line: 610, column: 11, scope: !1278)
!1278 = distinct !DILexicalBlock(scope: !1173, file: !1, line: 610, column: 11)
!1279 = !DILocation(line: 610, column: 18, scope: !1278)
!1280 = !DILocation(line: 610, column: 24, scope: !1278)
!1281 = !DILocation(line: 610, column: 11, scope: !1173)
!1282 = !DILocation(line: 611, column: 38, scope: !1278)
!1283 = !DILocation(line: 611, column: 43, scope: !1278)
!1284 = !DILocation(line: 611, column: 70, scope: !1278)
!1285 = !DILocation(line: 612, column: 11, scope: !1278)
!1286 = !DILocation(line: 612, column: 25, scope: !1278)
!1287 = !DILocation(line: 611, column: 16, scope: !1278)
!1288 = !DILocation(line: 611, column: 9, scope: !1278)
!1289 = !DILocation(line: 614, column: 9, scope: !1173)
!1290 = !DILocation(line: 613, column: 48, scope: !1173)
!1291 = !DILocation(line: 613, column: 26, scope: !1173)
!1292 = !DILocation(line: 613, column: 25, scope: !1173)
!1293 = !DILocation(line: 615, column: 21, scope: !1173)
!1294 = !DILocation(line: 615, column: 14, scope: !1173)
!1295 = !DILocation(line: 615, column: 27, scope: !1173)
!1296 = !DILocation(line: 615, column: 7, scope: !1173)
!1297 = !DILocation(line: 617, column: 3, scope: !1084)
!1298 = !DILocation(line: 617, column: 10, scope: !1084)
!1299 = !DILocation(line: 618, column: 32, scope: !1084)
!1300 = !DILocation(line: 618, column: 39, scope: !1084)
!1301 = !DILocation(line: 618, column: 16, scope: !1084)
!1302 = !DILocation(line: 618, column: 15, scope: !1084)
!1303 = !DILocation(line: 619, column: 26, scope: !1084)
!1304 = !DILocation(line: 619, column: 33, scope: !1084)
!1305 = !DILocation(line: 619, column: 13, scope: !1084)
!1306 = !DILocation(line: 619, column: 12, scope: !1084)
!1307 = !DILocation(line: 620, column: 17, scope: !1084)
!1308 = !DILocation(line: 620, column: 24, scope: !1084)
!1309 = !DILocation(line: 620, column: 3, scope: !1084)
!1310 = !DILocation(line: 621, column: 7, scope: !1311)
!1311 = distinct !DILexicalBlock(scope: !1084, file: !1, line: 621, column: 7)
!1312 = !DILocation(line: 621, column: 15, scope: !1311)
!1313 = !DILocation(line: 621, column: 7, scope: !1084)
!1314 = !DILocation(line: 626, column: 12, scope: !1315)
!1315 = distinct !DILexicalBlock(scope: !1316, file: !1, line: 626, column: 11)
!1316 = distinct !DILexicalBlock(scope: !1311, file: !1, line: 622, column: 5)
!1317 = !DILocation(line: 626, column: 19, scope: !1315)
!1318 = !DILocation(line: 626, column: 11, scope: !1315)
!1319 = !DILocation(line: 626, column: 35, scope: !1315)
!1320 = !DILocation(line: 626, column: 11, scope: !1316)
!1321 = !DILocation(line: 627, column: 27, scope: !1322)
!1322 = distinct !DILexicalBlock(scope: !1315, file: !1, line: 627, column: 13)
!1323 = !DILocation(line: 627, column: 34, scope: !1322)
!1324 = !DILocation(line: 627, column: 50, scope: !1322)
!1325 = !DILocation(line: 627, column: 57, scope: !1322)
!1326 = !DILocation(line: 627, column: 13, scope: !1322)
!1327 = !DILocation(line: 627, column: 67, scope: !1322)
!1328 = !DILocation(line: 627, column: 13, scope: !1315)
!1329 = !DILocation(line: 628, column: 35, scope: !1322)
!1330 = !DILocation(line: 628, column: 47, scope: !1322)
!1331 = !DILocation(line: 628, column: 54, scope: !1322)
!1332 = !DILocation(line: 628, column: 18, scope: !1322)
!1333 = !DILocation(line: 628, column: 11, scope: !1322)
!1334 = !DILocation(line: 627, column: 70, scope: !1322)
!1335 = !DILocation(line: 629, column: 35, scope: !1336)
!1336 = distinct !DILexicalBlock(scope: !1316, file: !1, line: 629, column: 11)
!1337 = !DILocation(line: 629, column: 12, scope: !1336)
!1338 = !DILocation(line: 629, column: 42, scope: !1336)
!1339 = !DILocation(line: 629, column: 61, scope: !1336)
!1340 = !DILocation(line: 630, column: 31, scope: !1336)
!1341 = !DILocation(line: 630, column: 12, scope: !1336)
!1342 = !DILocation(line: 630, column: 38, scope: !1336)
!1343 = !DILocation(line: 630, column: 57, scope: !1336)
!1344 = !DILocation(line: 630, column: 61, scope: !1336)
!1345 = !DILocation(line: 630, column: 68, scope: !1336)
!1346 = !DILocation(line: 630, column: 74, scope: !1336)
!1347 = !DILocation(line: 629, column: 11, scope: !1316)
!1348 = !DILocation(line: 631, column: 33, scope: !1336)
!1349 = !DILocation(line: 631, column: 44, scope: !1336)
!1350 = !DILocation(line: 631, column: 51, scope: !1336)
!1351 = !DILocation(line: 631, column: 16, scope: !1336)
!1352 = !DILocation(line: 631, column: 9, scope: !1336)
!1353 = !DILocation(line: 633, column: 33, scope: !1336)
!1354 = !DILocation(line: 633, column: 51, scope: !1336)
!1355 = !DILocation(line: 633, column: 58, scope: !1336)
!1356 = !DILocation(line: 634, column: 11, scope: !1336)
!1357 = !DILocation(line: 634, column: 18, scope: !1336)
!1358 = !DILocation(line: 633, column: 67, scope: !1336)
!1359 = !DILocation(line: 633, column: 16, scope: !1336)
!1360 = !DILocation(line: 635, column: 31, scope: !1316)
!1361 = !DILocation(line: 635, column: 42, scope: !1316)
!1362 = !DILocation(line: 635, column: 49, scope: !1316)
!1363 = !DILocation(line: 635, column: 14, scope: !1316)
!1364 = !DILocation(line: 636, column: 12, scope: !1365)
!1365 = distinct !DILexicalBlock(scope: !1316, file: !1, line: 636, column: 11)
!1366 = !DILocation(line: 636, column: 19, scope: !1365)
!1367 = !DILocation(line: 636, column: 34, scope: !1365)
!1368 = !DILocation(line: 636, column: 40, scope: !1365)
!1369 = !DILocation(line: 636, column: 44, scope: !1365)
!1370 = !DILocation(line: 636, column: 51, scope: !1365)
!1371 = !DILocation(line: 636, column: 63, scope: !1365)
!1372 = !DILocation(line: 636, column: 11, scope: !1316)
!1373 = !DILocation(line: 637, column: 14, scope: !1374)
!1374 = distinct !DILexicalBlock(scope: !1365, file: !1, line: 637, column: 13)
!1375 = !DILocation(line: 637, column: 21, scope: !1374)
!1376 = !DILocation(line: 637, column: 39, scope: !1374)
!1377 = !DILocation(line: 637, column: 46, scope: !1374)
!1378 = !DILocation(line: 637, column: 36, scope: !1374)
!1379 = !DILocation(line: 637, column: 55, scope: !1374)
!1380 = !DILocation(line: 638, column: 14, scope: !1374)
!1381 = !DILocation(line: 638, column: 21, scope: !1374)
!1382 = !DILocation(line: 638, column: 36, scope: !1374)
!1383 = !DILocation(line: 638, column: 43, scope: !1374)
!1384 = !DILocation(line: 638, column: 33, scope: !1374)
!1385 = !DILocation(line: 637, column: 13, scope: !1365)
!1386 = !DILocation(line: 639, column: 35, scope: !1374)
!1387 = !DILocation(line: 640, column: 13, scope: !1374)
!1388 = !DILocation(line: 640, column: 20, scope: !1374)
!1389 = !DILocation(line: 639, column: 56, scope: !1374)
!1390 = !DILocation(line: 640, column: 44, scope: !1374)
!1391 = !DILocation(line: 640, column: 51, scope: !1374)
!1392 = !DILocation(line: 640, column: 35, scope: !1374)
!1393 = !DILocation(line: 639, column: 18, scope: !1374)
!1394 = !DILocation(line: 639, column: 11, scope: !1374)
!1395 = !DILocation(line: 638, column: 47, scope: !1374)
!1396 = !DILocation(line: 641, column: 31, scope: !1316)
!1397 = !DILocation(line: 641, column: 60, scope: !1316)
!1398 = !DILocation(line: 641, column: 67, scope: !1316)
!1399 = !DILocation(line: 641, column: 51, scope: !1316)
!1400 = !DILocation(line: 642, column: 18, scope: !1316)
!1401 = !DILocation(line: 642, column: 25, scope: !1316)
!1402 = !DILocation(line: 642, column: 9, scope: !1316)
!1403 = !DILocation(line: 641, column: 14, scope: !1316)
!1404 = !DILocation(line: 643, column: 12, scope: !1405)
!1405 = distinct !DILexicalBlock(scope: !1316, file: !1, line: 643, column: 11)
!1406 = !DILocation(line: 643, column: 19, scope: !1405)
!1407 = !DILocation(line: 643, column: 24, scope: !1405)
!1408 = !DILocation(line: 643, column: 30, scope: !1405)
!1409 = !DILocation(line: 643, column: 36, scope: !1405)
!1410 = !DILocation(line: 643, column: 40, scope: !1405)
!1411 = !DILocation(line: 643, column: 47, scope: !1405)
!1412 = !DILocation(line: 643, column: 52, scope: !1405)
!1413 = !DILocation(line: 643, column: 59, scope: !1405)
!1414 = !DILocation(line: 643, column: 65, scope: !1405)
!1415 = !DILocation(line: 644, column: 12, scope: !1405)
!1416 = !DILocation(line: 644, column: 19, scope: !1405)
!1417 = !DILocation(line: 644, column: 24, scope: !1405)
!1418 = !DILocation(line: 644, column: 26, scope: !1405)
!1419 = !DILocation(line: 644, column: 32, scope: !1405)
!1420 = !DILocation(line: 644, column: 36, scope: !1405)
!1421 = !DILocation(line: 644, column: 43, scope: !1405)
!1422 = !DILocation(line: 644, column: 48, scope: !1405)
!1423 = !DILocation(line: 644, column: 50, scope: !1405)
!1424 = !DILocation(line: 643, column: 11, scope: !1316)
!1425 = !DILocation(line: 645, column: 33, scope: !1405)
!1426 = !DILocation(line: 646, column: 11, scope: !1405)
!1427 = !DILocation(line: 646, column: 18, scope: !1405)
!1428 = !DILocation(line: 646, column: 23, scope: !1405)
!1429 = !DILocation(line: 645, column: 65, scope: !1405)
!1430 = !DILocation(line: 646, column: 38, scope: !1405)
!1431 = !DILocation(line: 646, column: 45, scope: !1405)
!1432 = !DILocation(line: 646, column: 50, scope: !1405)
!1433 = !DILocation(line: 646, column: 29, scope: !1405)
!1434 = !DILocation(line: 646, column: 66, scope: !1405)
!1435 = !DILocation(line: 646, column: 73, scope: !1405)
!1436 = !DILocation(line: 646, column: 78, scope: !1405)
!1437 = !DILocation(line: 646, column: 57, scope: !1405)
!1438 = !DILocation(line: 647, column: 20, scope: !1405)
!1439 = !DILocation(line: 647, column: 27, scope: !1405)
!1440 = !DILocation(line: 647, column: 32, scope: !1405)
!1441 = !DILocation(line: 647, column: 11, scope: !1405)
!1442 = !DILocation(line: 645, column: 16, scope: !1405)
!1443 = !DILocation(line: 645, column: 9, scope: !1405)
!1444 = !DILocation(line: 648, column: 31, scope: !1316)
!1445 = !DILocation(line: 648, column: 58, scope: !1316)
!1446 = !DILocation(line: 648, column: 65, scope: !1316)
!1447 = !DILocation(line: 648, column: 49, scope: !1316)
!1448 = !DILocation(line: 648, column: 14, scope: !1316)
!1449 = !DILocation(line: 649, column: 11, scope: !1450)
!1450 = distinct !DILexicalBlock(scope: !1316, file: !1, line: 649, column: 11)
!1451 = !DILocation(line: 649, column: 18, scope: !1450)
!1452 = !DILocation(line: 649, column: 23, scope: !1450)
!1453 = !DILocation(line: 649, column: 11, scope: !1316)
!1454 = !DILocation(line: 650, column: 33, scope: !1450)
!1455 = !DILocation(line: 651, column: 39, scope: !1450)
!1456 = !DILocation(line: 651, column: 46, scope: !1450)
!1457 = !DILocation(line: 651, column: 29, scope: !1450)
!1458 = !DILocation(line: 650, column: 44, scope: !1450)
!1459 = !DILocation(line: 650, column: 16, scope: !1450)
!1460 = !DILocation(line: 650, column: 9, scope: !1450)
!1461 = !DILocation(line: 652, column: 11, scope: !1462)
!1462 = distinct !DILexicalBlock(scope: !1316, file: !1, line: 652, column: 11)
!1463 = !DILocation(line: 652, column: 18, scope: !1462)
!1464 = !DILocation(line: 652, column: 29, scope: !1462)
!1465 = !DILocation(line: 652, column: 11, scope: !1316)
!1466 = !DILocation(line: 653, column: 33, scope: !1462)
!1467 = !DILocation(line: 654, column: 45, scope: !1462)
!1468 = !DILocation(line: 654, column: 52, scope: !1462)
!1469 = !DILocation(line: 654, column: 35, scope: !1462)
!1470 = !DILocation(line: 653, column: 44, scope: !1462)
!1471 = !DILocation(line: 653, column: 16, scope: !1462)
!1472 = !DILocation(line: 653, column: 9, scope: !1462)
!1473 = !DILocation(line: 655, column: 11, scope: !1474)
!1474 = distinct !DILexicalBlock(scope: !1316, file: !1, line: 655, column: 11)
!1475 = !DILocation(line: 655, column: 18, scope: !1474)
!1476 = !DILocation(line: 655, column: 32, scope: !1474)
!1477 = !DILocation(line: 655, column: 11, scope: !1316)
!1478 = !DILocation(line: 657, column: 15, scope: !1479)
!1479 = distinct !DILexicalBlock(scope: !1480, file: !1, line: 657, column: 15)
!1480 = distinct !DILexicalBlock(scope: !1474, file: !1, line: 656, column: 9)
!1481 = !DILocation(line: 657, column: 22, scope: !1479)
!1482 = !DILocation(line: 657, column: 35, scope: !1479)
!1483 = !DILocation(line: 657, column: 15, scope: !1480)
!1484 = !DILocation(line: 659, column: 39, scope: !1485)
!1485 = distinct !DILexicalBlock(scope: !1479, file: !1, line: 658, column: 13)
!1486 = !DILocation(line: 659, column: 46, scope: !1485)
!1487 = !DILocation(line: 659, column: 71, scope: !1485)
!1488 = !DILocation(line: 659, column: 22, scope: !1485)
!1489 = !DILocation(line: 660, column: 39, scope: !1485)
!1490 = !DILocation(line: 660, column: 50, scope: !1485)
!1491 = !DILocation(line: 660, column: 22, scope: !1485)
!1492 = !DILocation(line: 661, column: 13, scope: !1485)
!1493 = !DILocation(line: 662, column: 9, scope: !1480)
!1494 = !DILocation(line: 664, column: 13, scope: !1495)
!1495 = distinct !DILexicalBlock(scope: !1474, file: !1, line: 664, column: 13)
!1496 = !DILocation(line: 664, column: 20, scope: !1495)
!1497 = !DILocation(line: 664, column: 36, scope: !1495)
!1498 = !DILocation(line: 664, column: 43, scope: !1495)
!1499 = !DILocation(line: 664, column: 33, scope: !1495)
!1500 = !DILocation(line: 664, column: 13, scope: !1474)
!1501 = !DILocation(line: 665, column: 35, scope: !1495)
!1502 = !DILocation(line: 665, column: 59, scope: !1495)
!1503 = !DILocation(line: 665, column: 66, scope: !1495)
!1504 = !DILocation(line: 665, column: 50, scope: !1495)
!1505 = !DILocation(line: 665, column: 18, scope: !1495)
!1506 = !DILocation(line: 665, column: 11, scope: !1495)
!1507 = !DILocation(line: 667, column: 35, scope: !1495)
!1508 = !DILocation(line: 668, column: 13, scope: !1495)
!1509 = !DILocation(line: 668, column: 20, scope: !1495)
!1510 = !DILocation(line: 667, column: 57, scope: !1495)
!1511 = !DILocation(line: 668, column: 42, scope: !1495)
!1512 = !DILocation(line: 668, column: 49, scope: !1495)
!1513 = !DILocation(line: 668, column: 33, scope: !1495)
!1514 = !DILocation(line: 667, column: 18, scope: !1495)
!1515 = !DILocation(line: 669, column: 11, scope: !1516)
!1516 = distinct !DILexicalBlock(scope: !1316, file: !1, line: 669, column: 11)
!1517 = !DILocation(line: 669, column: 18, scope: !1516)
!1518 = !DILocation(line: 669, column: 24, scope: !1516)
!1519 = !DILocation(line: 669, column: 45, scope: !1516)
!1520 = !DILocation(line: 669, column: 11, scope: !1316)
!1521 = !DILocation(line: 670, column: 33, scope: !1516)
!1522 = !DILocation(line: 671, column: 12, scope: !1516)
!1523 = !DILocation(line: 671, column: 19, scope: !1516)
!1524 = !DILocation(line: 671, column: 25, scope: !1516)
!1525 = !DILocation(line: 671, column: 45, scope: !1516)
!1526 = !DILocation(line: 672, column: 11, scope: !1516)
!1527 = !DILocation(line: 672, column: 18, scope: !1516)
!1528 = !DILocation(line: 672, column: 24, scope: !1516)
!1529 = !DILocation(line: 673, column: 11, scope: !1516)
!1530 = !DILocation(line: 673, column: 18, scope: !1516)
!1531 = !DILocation(line: 673, column: 24, scope: !1516)
!1532 = !DILocation(line: 670, column: 16, scope: !1516)
!1533 = !DILocation(line: 670, column: 9, scope: !1516)
!1534 = !DILocation(line: 674, column: 23, scope: !1535)
!1535 = distinct !DILexicalBlock(scope: !1316, file: !1, line: 674, column: 11)
!1536 = !DILocation(line: 674, column: 11, scope: !1535)
!1537 = !DILocation(line: 674, column: 30, scope: !1535)
!1538 = !DILocation(line: 674, column: 11, scope: !1316)
!1539 = !DILocation(line: 676, column: 47, scope: !1540)
!1540 = distinct !DILexicalBlock(scope: !1535, file: !1, line: 675, column: 9)
!1541 = !DILocation(line: 676, column: 35, scope: !1540)
!1542 = !DILocation(line: 676, column: 66, scope: !1540)
!1543 = !DILocation(line: 676, column: 18, scope: !1540)
!1544 = !DILocation(line: 677, column: 35, scope: !1540)
!1545 = !DILocation(line: 677, column: 46, scope: !1540)
!1546 = !DILocation(line: 677, column: 18, scope: !1540)
!1547 = !DILocation(line: 678, column: 9, scope: !1540)
!1548 = !DILocation(line: 679, column: 31, scope: !1316)
!1549 = !DILocation(line: 679, column: 61, scope: !1316)
!1550 = !DILocation(line: 680, column: 26, scope: !1316)
!1551 = !DILocation(line: 680, column: 38, scope: !1316)
!1552 = !DILocation(line: 680, column: 9, scope: !1316)
!1553 = !DILocation(line: 681, column: 9, scope: !1316)
!1554 = !DILocation(line: 680, column: 67, scope: !1316)
!1555 = !DILocation(line: 680, column: 61, scope: !1316)
!1556 = !DILocation(line: 680, column: 45, scope: !1316)
!1557 = !DILocation(line: 681, column: 54, scope: !1316)
!1558 = !DILocation(line: 682, column: 15, scope: !1316)
!1559 = !DILocation(line: 682, column: 9, scope: !1316)
!1560 = !DILocation(line: 681, column: 66, scope: !1316)
!1561 = !DILocation(line: 681, column: 52, scope: !1316)
!1562 = !DILocation(line: 681, column: 29, scope: !1316)
!1563 = !DILocation(line: 679, column: 14, scope: !1316)
!1564 = !DILocation(line: 683, column: 31, scope: !1316)
!1565 = !DILocation(line: 683, column: 14, scope: !1316)
!1566 = !DILocation(line: 684, column: 21, scope: !1316)
!1567 = !DILocation(line: 684, column: 14, scope: !1316)
!1568 = !DILocation(line: 685, column: 21, scope: !1316)
!1569 = !DILocation(line: 685, column: 14, scope: !1316)
!1570 = !DILocation(line: 685, column: 27, scope: !1316)
!1571 = !DILocation(line: 685, column: 7, scope: !1316)
!1572 = !DILocation(line: 690, column: 27, scope: !1084)
!1573 = !DILocation(line: 690, column: 41, scope: !1084)
!1574 = !DILocation(line: 690, column: 10, scope: !1084)
!1575 = !DILocation(line: 690, column: 9, scope: !1084)
!1576 = !DILocation(line: 691, column: 34, scope: !1084)
!1577 = !DILocation(line: 691, column: 13, scope: !1084)
!1578 = !DILocation(line: 691, column: 12, scope: !1084)
!1579 = !DILocation(line: 692, column: 8, scope: !1084)
!1580 = !DILocation(line: 692, column: 15, scope: !1084)
!1581 = !DILocation(line: 692, column: 7, scope: !1084)
!1582 = !DILocation(line: 693, column: 15, scope: !1084)
!1583 = !DILocation(line: 693, column: 22, scope: !1084)
!1584 = !DILocation(line: 693, column: 12, scope: !1084)
!1585 = !DILocation(line: 694, column: 21, scope: !1084)
!1586 = !DILocation(line: 694, column: 27, scope: !1084)
!1587 = !DILocation(line: 694, column: 8, scope: !1084)
!1588 = !DILocation(line: 694, column: 7, scope: !1084)
!1589 = !DILocation(line: 695, column: 25, scope: !1084)
!1590 = !DILocation(line: 695, column: 10, scope: !1084)
!1591 = !DILocation(line: 696, column: 27, scope: !1084)
!1592 = !DILocation(line: 696, column: 46, scope: !1084)
!1593 = !DILocation(line: 696, column: 53, scope: !1084)
!1594 = !DILocation(line: 696, column: 10, scope: !1084)
!1595 = !DILocation(line: 697, column: 8, scope: !1596)
!1596 = distinct !DILexicalBlock(scope: !1084, file: !1, line: 697, column: 7)
!1597 = !DILocation(line: 697, column: 15, scope: !1596)
!1598 = !DILocation(line: 697, column: 7, scope: !1596)
!1599 = !DILocation(line: 697, column: 31, scope: !1596)
!1600 = !DILocation(line: 697, column: 7, scope: !1084)
!1601 = !DILocation(line: 698, column: 23, scope: !1602)
!1602 = distinct !DILexicalBlock(scope: !1596, file: !1, line: 698, column: 9)
!1603 = !DILocation(line: 698, column: 30, scope: !1602)
!1604 = !DILocation(line: 698, column: 46, scope: !1602)
!1605 = !DILocation(line: 698, column: 53, scope: !1602)
!1606 = !DILocation(line: 698, column: 9, scope: !1602)
!1607 = !DILocation(line: 698, column: 63, scope: !1602)
!1608 = !DILocation(line: 698, column: 9, scope: !1596)
!1609 = !DILocalVariable(name: "filename", scope: !1610, file: !1, line: 701, type: !815)
!1610 = distinct !DILexicalBlock(scope: !1602, file: !1, line: 699, column: 7)
!1611 = !DILocation(line: 701, column: 11, scope: !1610)
!1612 = !DILocation(line: 703, column: 26, scope: !1610)
!1613 = !DILocation(line: 703, column: 33, scope: !1610)
!1614 = !DILocation(line: 703, column: 58, scope: !1610)
!1615 = !DILocation(line: 703, column: 9, scope: !1610)
!1616 = !DILocation(line: 704, column: 33, scope: !1610)
!1617 = !DILocation(line: 704, column: 62, scope: !1610)
!1618 = !DILocation(line: 704, column: 16, scope: !1610)
!1619 = !DILocation(line: 705, column: 7, scope: !1610)
!1620 = !DILocation(line: 698, column: 66, scope: !1602)
!1621 = !DILocation(line: 706, column: 29, scope: !1084)
!1622 = !DILocation(line: 706, column: 36, scope: !1084)
!1623 = !DILocation(line: 706, column: 43, scope: !1084)
!1624 = !DILocation(line: 706, column: 15, scope: !1084)
!1625 = !DILocation(line: 706, column: 14, scope: !1084)
!1626 = !DILocation(line: 707, column: 8, scope: !1627)
!1627 = distinct !DILexicalBlock(scope: !1084, file: !1, line: 707, column: 7)
!1628 = !DILocation(line: 707, column: 20, scope: !1627)
!1629 = !DILocation(line: 707, column: 50, scope: !1627)
!1630 = !DILocation(line: 708, column: 29, scope: !1627)
!1631 = !DILocation(line: 708, column: 8, scope: !1627)
!1632 = !DILocation(line: 708, column: 42, scope: !1627)
!1633 = !DILocation(line: 707, column: 7, scope: !1084)
!1634 = !DILocation(line: 709, column: 29, scope: !1627)
!1635 = !DILocation(line: 709, column: 51, scope: !1627)
!1636 = !DILocation(line: 709, column: 58, scope: !1627)
!1637 = !DILocation(line: 709, column: 12, scope: !1627)
!1638 = !DILocation(line: 709, column: 5, scope: !1627)
!1639 = !DILocation(line: 711, column: 29, scope: !1627)
!1640 = !DILocation(line: 711, column: 56, scope: !1627)
!1641 = !DILocation(line: 711, column: 63, scope: !1627)
!1642 = !DILocation(line: 712, column: 28, scope: !1627)
!1643 = !DILocation(line: 712, column: 7, scope: !1627)
!1644 = !DILocation(line: 711, column: 12, scope: !1627)
!1645 = !DILocation(line: 713, column: 8, scope: !1646)
!1646 = distinct !DILexicalBlock(scope: !1084, file: !1, line: 713, column: 7)
!1647 = !DILocation(line: 713, column: 20, scope: !1646)
!1648 = !DILocation(line: 713, column: 50, scope: !1646)
!1649 = !DILocation(line: 714, column: 26, scope: !1646)
!1650 = !DILocation(line: 714, column: 8, scope: !1646)
!1651 = !DILocation(line: 714, column: 39, scope: !1646)
!1652 = !DILocation(line: 713, column: 7, scope: !1084)
!1653 = !DILocation(line: 715, column: 29, scope: !1646)
!1654 = !DILocation(line: 716, column: 7, scope: !1646)
!1655 = !DILocation(line: 715, column: 54, scope: !1646)
!1656 = !DILocation(line: 715, column: 12, scope: !1646)
!1657 = !DILocation(line: 715, column: 5, scope: !1646)
!1658 = !DILocation(line: 717, column: 27, scope: !1084)
!1659 = !DILocation(line: 718, column: 34, scope: !1084)
!1660 = !DILocation(line: 718, column: 41, scope: !1084)
!1661 = !DILocation(line: 718, column: 24, scope: !1084)
!1662 = !DILocation(line: 717, column: 48, scope: !1084)
!1663 = !DILocation(line: 717, column: 10, scope: !1084)
!1664 = !DILocation(line: 719, column: 27, scope: !1084)
!1665 = !DILocation(line: 720, column: 5, scope: !1084)
!1666 = !DILocation(line: 720, column: 12, scope: !1084)
!1667 = !DILocation(line: 719, column: 72, scope: !1084)
!1668 = !DILocation(line: 720, column: 29, scope: !1084)
!1669 = !DILocation(line: 720, column: 36, scope: !1084)
!1670 = !DILocation(line: 720, column: 20, scope: !1084)
!1671 = !DILocation(line: 720, column: 50, scope: !1084)
!1672 = !DILocation(line: 720, column: 57, scope: !1084)
!1673 = !DILocation(line: 720, column: 69, scope: !1084)
!1674 = !DILocation(line: 720, column: 41, scope: !1084)
!1675 = !DILocation(line: 721, column: 5, scope: !1084)
!1676 = !DILocation(line: 721, column: 12, scope: !1084)
!1677 = !DILocation(line: 721, column: 24, scope: !1084)
!1678 = !DILocation(line: 720, column: 71, scope: !1084)
!1679 = !DILocation(line: 719, column: 10, scope: !1084)
!1680 = !DILocation(line: 722, column: 8, scope: !1681)
!1681 = distinct !DILexicalBlock(scope: !1084, file: !1, line: 722, column: 7)
!1682 = !DILocation(line: 722, column: 15, scope: !1681)
!1683 = !DILocation(line: 722, column: 30, scope: !1681)
!1684 = !DILocation(line: 722, column: 36, scope: !1681)
!1685 = !DILocation(line: 722, column: 40, scope: !1681)
!1686 = !DILocation(line: 722, column: 47, scope: !1681)
!1687 = !DILocation(line: 722, column: 59, scope: !1681)
!1688 = !DILocation(line: 722, column: 7, scope: !1084)
!1689 = !DILocation(line: 723, column: 10, scope: !1690)
