; ModuleID = 'magick/decorate.c'
source_filename = "magick/decorate.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._Image = type { i32, i32, i32, i64, i32, i32, i32, i64, i64, i64, i64, %struct._PixelPacket*, %struct._PixelPacket, %struct._PixelPacket, %struct._PixelPacket, double, %struct._ChromaticityInfo, i32, i8*, i32, i8*, i8*, i8*, i64, double, double, %struct._RectangleInfo, %struct._RectangleInfo, %struct._RectangleInfo, double, double, double, i32, i32, i32, i32, i32, i32, %struct._Image*, i64, i64, i64, i64, i64, i64, %struct._ErrorInfo, %struct._TimerInfo, i32 (i8*, i64, i64, i8*)*, i8*, i8*, i8*, %struct._Ascii85Info*, %struct._BlobInfo*, [4096 x i8], [4096 x i8], [4096 x i8], i64, i64, %struct._ExceptionInfo, i32, i64, %struct.SemaphoreInfo*, %struct._ProfileInfo, %struct._ProfileInfo, %struct._ProfileInfo*, i64, i64, %struct._Image*, %struct._Image*, %struct._Image*, i32, i32, %struct._PixelPacket, %struct._Image*, %struct._RectangleInfo, i8*, i8*, i32, i32, i64, i32, i64, i64, i32, i64 }
%struct._ChromaticityInfo = type { %struct._PrimaryInfo, %struct._PrimaryInfo, %struct._PrimaryInfo, %struct._PrimaryInfo }
%struct._PrimaryInfo = type { double, double, double }
%struct._ErrorInfo = type { double, double, double }
%struct._TimerInfo = type { %struct._Timer, %struct._Timer, i32, i64 }
%struct._Timer = type { double, double, double }

!355 = !DIEnumerator(name: "PaletteBilevelMatteType", value: 11, isUnsigned: true)
!356 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !326, line: 67, baseType: !5, size: 32, elements: !357)
!357 = !{!358, !359, !360, !361, !362, !363, !364, !365, !366, !367}
!358 = !DIEnumerator(name: "UndefinedPixelIntensityMethod", value: 0, isUnsigned: true)
!359 = !DIEnumerator(name: "AveragePixelIntensityMethod", value: 1, isUnsigned: true)
!360 = !DIEnumerator(name: "BrightnessPixelIntensityMethod", value: 2, isUnsigned: true)
!361 = !DIEnumerator(name: "LightnessPixelIntensityMethod", value: 3, isUnsigned: true)
!362 = !DIEnumerator(name: "Rec601LumaPixelIntensityMethod", value: 4, isUnsigned: true)
!363 = !DIEnumerator(name: "Rec601LuminancePixelIntensityMethod", value: 5, isUnsigned: true)
!364 = !DIEnumerator(name: "Rec709LumaPixelIntensityMethod", value: 6, isUnsigned: true)
!365 = !DIEnumerator(name: "Rec709LuminancePixelIntensityMethod", value: 7, isUnsigned: true)
!366 = !DIEnumerator(name: "RMSPixelIntensityMethod", value: 8, isUnsigned: true)
!367 = !DIEnumerator(name: "MSPixelIntensityMethod", value: 9, isUnsigned: true)
!368 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !369, line: 34, baseType: !5, size: 32, elements: !370)
!369 = !DIFile(filename: "./magick/log.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!370 = !{!371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392}
!371 = !DIEnumerator(name: "UndefinedEvents", value: 0, isUnsigned: true)
!372 = !DIEnumerator(name: "NoEvents", value: 0, isUnsigned: true)
!373 = !DIEnumerator(name: "TraceEvent", value: 1, isUnsigned: true)
!374 = !DIEnumerator(name: "AnnotateEvent", value: 2, isUnsigned: true)
!375 = !DIEnumerator(name: "BlobEvent", value: 4, isUnsigned: true)
!376 = !DIEnumerator(name: "CacheEvent", value: 8, isUnsigned: true)
!377 = !DIEnumerator(name: "CoderEvent", value: 16, isUnsigned: true)
!378 = !DIEnumerator(name: "ConfigureEvent", value: 32, isUnsigned: true)
!379 = !DIEnumerator(name: "DeprecateEvent", value: 64, isUnsigned: true)
!380 = !DIEnumerator(name: "DrawEvent", value: 128, isUnsigned: true)
!381 = !DIEnumerator(name: "ExceptionEvent", value: 256, isUnsigned: true)
!382 = !DIEnumerator(name: "ImageEvent", value: 512, isUnsigned: true)
!383 = !DIEnumerator(name: "LocaleEvent", value: 1024, isUnsigned: true)
!384 = !DIEnumerator(name: "ModuleEvent", value: 2048, isUnsigned: true)
!385 = !DIEnumerator(name: "PolicyEvent", value: 4096, isUnsigned: true)
!386 = !DIEnumerator(name: "ResourceEvent", value: 8192, isUnsigned: true)
!387 = !DIEnumerator(name: "TransformEvent", value: 16384, isUnsigned: true)
!388 = !DIEnumerator(name: "UserEvent", value: 36864, isUnsigned: true)
!389 = !DIEnumerator(name: "WandEvent", value: 65536, isUnsigned: true)
!390 = !DIEnumerator(name: "X11Event", value: 131072, isUnsigned: true)
!391 = !DIEnumerator(name: "AccelerateEvent", value: 262144, isUnsigned: true)
!392 = !DIEnumerator(name: "AllEvents", value: 2147483647, isUnsigned: true)
!393 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !73, line: 30, baseType: !5, size: 32, elements: !394)
!394 = !{!395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407}
!395 = !DIEnumerator(name: "UndefinedAlphaChannel", value: 0, isUnsigned: true)
!396 = !DIEnumerator(name: "ActivateAlphaChannel", value: 1, isUnsigned: true)
!397 = !DIEnumerator(name: "BackgroundAlphaChannel", value: 2, isUnsigned: true)
!398 = !DIEnumerator(name: "CopyAlphaChannel", value: 3, isUnsigned: true)
!399 = !DIEnumerator(name: "DeactivateAlphaChannel", value: 4, isUnsigned: true)
!400 = !DIEnumerator(name: "ExtractAlphaChannel", value: 5, isUnsigned: true)
!401 = !DIEnumerator(name: "OpaqueAlphaChannel", value: 6, isUnsigned: true)
!402 = !DIEnumerator(name: "ResetAlphaChannel", value: 7, isUnsigned: true)
!403 = !DIEnumerator(name: "SetAlphaChannel", value: 8, isUnsigned: true)
!404 = !DIEnumerator(name: "ShapeAlphaChannel", value: 9, isUnsigned: true)
!405 = !DIEnumerator(name: "TransparentAlphaChannel", value: 10, isUnsigned: true)
!406 = !DIEnumerator(name: "FlattenAlphaChannel", value: 11, isUnsigned: true)
!407 = !DIEnumerator(name: "RemoveAlphaChannel", value: 12, isUnsigned: true)
!408 = !{!409, !410, !415, !470, !426, !443, !631, !633, !452, !438, !635, !538, !637, !632}
!409 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !411, line: 77, baseType: !412)
!411 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !413, line: 193, baseType: !414)
!413 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!414 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "Image", file: !4, line: 221, baseType: !417)
!417 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Image", file: !73, line: 150, size: 105920, elements: !418)
!418 = !{!419, !421, !423, !425, !428, !430, !432, !433, !434, !435, !436, !437, !448, !449, !450, !451, !453, !467, !469, !471, !473, !476, !477, !478, !479, !480, !481, !489, !490, !491, !492, !493, !494, !496, !498, !500, !502, !504, !506, !508, !509, !510, !511, !512, !513, !514, !522, !537, !551, !552, !553, !554, !558, !562, !566, !567, !568, !569, !570, !588, !589, !591, !592, !602, !603, !605, !606, !607, !608, !609, !610, !612, !613, !614, !615, !616, !617, !618, !620, !621, !622, !623, !624, !628, !630}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "storage_class", scope: !417, file: !73, line: 153, baseType: !420, size: 32)
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "ClassType", file: !4, line: 209, baseType: !3)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !417, file: !73, line: 156, baseType: !422, size: 32, offset: 32)
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorspaceType", file: !11, line: 61, baseType: !10)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !417, file: !73, line: 159, baseType: !424, size: 32, offset: 64)
!424 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompressionType", file: !48, line: 49, baseType: !47)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !417, file: !73, line: 162, baseType: !426, size: 64, offset: 128)
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !427, line: 46, baseType: !409)
!427 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!428 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !417, file: !73, line: 165, baseType: !429, size: 32, offset: 192)
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "OrientationType", file: !73, line: 86, baseType: !72)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "taint", scope: !417, file: !73, line: 168, baseType: !431, size: 32, offset: 224)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickBooleanType", file: !4, line: 215, baseType: !84)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "matte", scope: !417, file: !73, line: 169, baseType: !431, size: 32, offset: 256)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !417, file: !73, line: 172, baseType: !426, size: 64, offset: 320)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !417, file: !73, line: 173, baseType: !426, size: 64, offset: 384)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !417, file: !73, line: 174, baseType: !426, size: 64, offset: 448)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !417, file: !73, line: 175, baseType: !426, size: 64, offset: 512)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "colormap", scope: !417, file: !73, line: 178, baseType: !438, size: 64, offset: 576)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelPacket", file: !326, line: 148, baseType: !440)
!440 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PixelPacket", file: !326, line: 131, size: 64, elements: !441)
!441 = !{!442, !445, !446, !447}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !440, file: !326, line: 143, baseType: !443, size: 16)
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "Quantum", file: !4, line: 93, baseType: !444)
!444 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !440, file: !326, line: 144, baseType: !443, size: 16, offset: 16)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !440, file: !326, line: 145, baseType: !443, size: 16, offset: 32)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !440, file: !326, line: 146, baseType: !443, size: 16, offset: 48)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "background_color", scope: !417, file: !73, line: 179, baseType: !439, size: 64, offset: 640)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !417, file: !73, line: 180, baseType: !439, size: 64, offset: 704)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "matte_color", scope: !417, file: !73, line: 181, baseType: !439, size: 64, offset: 768)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !417, file: !73, line: 184, baseType: !452, size: 64, offset: 832)
!452 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "chromaticity", scope: !417, file: !73, line: 187, baseType: !454, size: 768, offset: 896)
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChromaticityInfo", file: !73, line: 128, baseType: !455)
!455 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ChromaticityInfo", file: !73, line: 121, size: 768, elements: !456)
!456 = !{!457, !464, !465, !466}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "red_primary", scope: !455, file: !73, line: 124, baseType: !458, size: 192)
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "PrimaryInfo", file: !73, line: 101, baseType: !459)
!459 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PrimaryInfo", file: !73, line: 95, size: 192, elements: !460)
!460 = !{!461, !462, !463}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !459, file: !73, line: 98, baseType: !452, size: 64)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !459, file: !73, line: 99, baseType: !452, size: 64, offset: 64)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !459, file: !73, line: 100, baseType: !452, size: 64, offset: 128)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "green_primary", scope: !455, file: !73, line: 125, baseType: !458, size: 192, offset: 192)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "blue_primary", scope: !455, file: !73, line: 126, baseType: !458, size: 192, offset: 384)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "white_point", scope: !455, file: !73, line: 127, baseType: !458, size: 192, offset: 576)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "rendering_intent", scope: !417, file: !73, line: 190, baseType: !468, size: 32, offset: 1664)
!468 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderingIntent", file: !89, line: 49, baseType: !88)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !417, file: !73, line: 193, baseType: !470, size: 64, offset: 1728)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !417, file: !73, line: 196, baseType: !472, size: 32, offset: 1792)
!472 = !DIDerivedType(tag: DW_TAG_typedef, name: "ResolutionType", file: !73, line: 93, baseType: !96)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "montage", scope: !417, file: !73, line: 199, baseType: !474, size: 64, offset: 1856)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64)
!475 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "directory", scope: !417, file: !73, line: 200, baseType: !474, size: 64, offset: 1920)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "geometry", scope: !417, file: !73, line: 201, baseType: !474, size: 64, offset: 1984)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !417, file: !73, line: 204, baseType: !410, size: 64, offset: 2048)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "x_resolution", scope: !417, file: !73, line: 207, baseType: !452, size: 64, offset: 2112)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "y_resolution", scope: !417, file: !73, line: 208, baseType: !452, size: 64, offset: 2176)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !417, file: !73, line: 211, baseType: !482, size: 256, offset: 2240)
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "RectangleInfo", file: !153, line: 130, baseType: !483)
!483 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_RectangleInfo", file: !153, line: 121, size: 256, elements: !484)
!484 = !{!485, !486, !487, !488}
!485 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !483, file: !153, line: 124, baseType: !426, size: 64)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !483, file: !153, line: 125, baseType: !426, size: 64, offset: 64)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !483, file: !153, line: 128, baseType: !410, size: 64, offset: 128)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !483, file: !153, line: 129, baseType: !410, size: 64, offset: 192)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "extract_info", scope: !417, file: !73, line: 212, baseType: !482, size: 256, offset: 2496)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "tile_info", scope: !417, file: !73, line: 213, baseType: !482, size: 256, offset: 2752)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "bias", scope: !417, file: !73, line: 216, baseType: !452, size: 64, offset: 3008)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "blur", scope: !417, file: !73, line: 217, baseType: !452, size: 64, offset: 3072)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !417, file: !73, line: 218, baseType: !452, size: 64, offset: 3136)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !417, file: !73, line: 221, baseType: !495, size: 32, offset: 3200)
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "FilterTypes", file: !102, line: 66, baseType: !101)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "interlace", scope: !417, file: !73, line: 224, baseType: !497, size: 32, offset: 3232)
!497 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterlaceType", file: !73, line: 73, baseType: !136)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !417, file: !73, line: 227, baseType: !499, size: 32, offset: 3264)
!499 = !DIDerivedType(tag: DW_TAG_typedef, name: "EndianType", file: !147, line: 35, baseType: !146)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !417, file: !73, line: 230, baseType: !501, size: 32, offset: 3296)
!501 = !DIDerivedType(tag: DW_TAG_typedef, name: "GravityType", file: !153, line: 91, baseType: !152)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !417, file: !73, line: 233, baseType: !503, size: 32, offset: 3328)
!503 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompositeOperator", file: !168, line: 99, baseType: !167)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "dispose", scope: !417, file: !73, line: 236, baseType: !505, size: 32, offset: 3360)
!505 = !DIDerivedType(tag: DW_TAG_typedef, name: "DisposeType", file: !239, line: 32, baseType: !238)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "clip_mask", scope: !417, file: !73, line: 239, baseType: !507, size: 64, offset: 3392)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !417, file: !73, line: 242, baseType: !426, size: 64, offset: 3456)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !417, file: !73, line: 243, baseType: !426, size: 64, offset: 3520)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_second", scope: !417, file: !73, line: 246, baseType: !410, size: 64, offset: 3584)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "iterations", scope: !417, file: !73, line: 249, baseType: !426, size: 64, offset: 3648)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "total_colors", scope: !417, file: !73, line: 250, baseType: !426, size: 64, offset: 3712)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "start_loop", scope: !417, file: !73, line: 253, baseType: !410, size: 64, offset: 3776)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !417, file: !73, line: 256, baseType: !515, size: 192, offset: 3840)
!515 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErrorInfo", file: !516, line: 68, baseType: !517)
!516 = !DIFile(filename: "./magick/color.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!517 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ErrorInfo", file: !516, line: 62, size: 192, elements: !518)
!518 = !{!519, !520, !521}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "mean_error_per_pixel", scope: !517, file: !516, line: 65, baseType: !452, size: 64)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_mean_error", scope: !517, file: !516, line: 66, baseType: !452, size: 64, offset: 64)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_maximum_error", scope: !517, file: !516, line: 67, baseType: !452, size: 64, offset: 128)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !417, file: !73, line: 259, baseType: !523, size: 512, offset: 4032)
!523 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerInfo", file: !247, line: 51, baseType: !524)
!524 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TimerInfo", file: !247, line: 40, size: 512, elements: !525)
!525 = !{!526, !533, !534, !536}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !524, file: !247, line: 43, baseType: !527, size: 192)
!527 = !DIDerivedType(tag: DW_TAG_typedef, name: "Timer", file: !247, line: 38, baseType: !528)
!528 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Timer", file: !247, line: 32, size: 192, elements: !529)
!529 = !{!530, !531, !532}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !528, file: !247, line: 35, baseType: !452, size: 64)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !528, file: !247, line: 36, baseType: !452, size: 64, offset: 64)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !528, file: !247, line: 37, baseType: !452, size: 64, offset: 128)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "elapsed", scope: !524, file: !247, line: 44, baseType: !527, size: 192, offset: 192)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !524, file: !247, line: 47, baseType: !535, size: 32, offset: 384)
!535 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerState", file: !247, line: 30, baseType: !246)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !524, file: !247, line: 50, baseType: !426, size: 64, offset: 448)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !417, file: !73, line: 262, baseType: !538, size: 64, offset: 4544)
!538 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickProgressMonitor", file: !539, line: 26, baseType: !540)
!539 = !DIFile(filename: "./magick/monitor.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64)
!541 = !DISubroutineType(types: !542)
!542 = !{!431, !543, !545, !548, !470}
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64)
!544 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !475)
!545 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !546)
!546 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickOffsetType", file: !4, line: 150, baseType: !547)
!547 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!548 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !549)
!549 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickSizeType", file: !4, line: 151, baseType: !550)
!550 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !417, file: !73, line: 265, baseType: !470, size: 64, offset: 4608)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !417, file: !73, line: 266, baseType: !470, size: 64, offset: 4672)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !417, file: !73, line: 267, baseType: !470, size: 64, offset: 4736)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "ascii85", scope: !417, file: !73, line: 270, baseType: !555, size: 64, offset: 4800)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64)
!556 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ascii85Info", file: !48, line: 52, baseType: !557)
!557 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Ascii85Info", file: !48, line: 51, flags: DIFlagFwdDecl)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !417, file: !73, line: 273, baseType: !559, size: 64, offset: 4864)
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 64)
!560 = !DIDerivedType(tag: DW_TAG_typedef, name: "BlobInfo", file: !4, line: 217, baseType: !561)
!561 = !DICompositeType(tag: DW_TAG_structure_type, name: "_BlobInfo", file: !4, line: 217, flags: DIFlagFwdDecl)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !417, file: !73, line: 276, baseType: !563, size: 32768, offset: 4928)
!563 = !DICompositeType(tag: DW_TAG_array_type, baseType: !475, size: 32768, elements: !564)
!564 = !{!565}
!565 = !DISubrange(count: 4096)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "magick_filename", scope: !417, file: !73, line: 277, baseType: !563, size: 32768, offset: 37696)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !417, file: !73, line: 278, baseType: !563, size: 32768, offset: 70464)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "magick_columns", scope: !417, file: !73, line: 281, baseType: !426, size: 64, offset: 103232)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "magick_rows", scope: !417, file: !73, line: 282, baseType: !426, size: 64, offset: 103296)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "exception", scope: !417, file: !73, line: 285, baseType: !571, size: 448, offset: 103360)
!571 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionInfo", file: !4, line: 219, baseType: !572)
!572 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ExceptionInfo", file: !253, line: 102, size: 448, elements: !573)
!573 = !{!574, !576, !578, !579, !580, !581, !582, !587}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "severity", scope: !572, file: !253, line: 105, baseType: !575, size: 32)
!575 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionType", file: !253, line: 100, baseType: !252)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "error_number", scope: !572, file: !253, line: 108, baseType: !577, size: 32, offset: 32)
!577 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !572, file: !253, line: 111, baseType: !474, size: 64, offset: 64)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !572, file: !253, line: 112, baseType: !474, size: 64, offset: 128)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "exceptions", scope: !572, file: !253, line: 115, baseType: !470, size: 64, offset: 192)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "relinquish", scope: !572, file: !253, line: 118, baseType: !431, size: 32, offset: 256)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !572, file: !253, line: 121, baseType: !583, size: 64, offset: 320)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64)
!584 = !DIDerivedType(tag: DW_TAG_typedef, name: "SemaphoreInfo", file: !585, line: 26, baseType: !586)
!585 = !DIFile(filename: "./magick/semaphore.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!586 = !DICompositeType(tag: DW_TAG_structure_type, name: "SemaphoreInfo", file: !585, line: 25, flags: DIFlagFwdDecl)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !572, file: !253, line: 124, baseType: !426, size: 64, offset: 384)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !417, file: !73, line: 288, baseType: !431, size: 32, offset: 103808)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !417, file: !73, line: 291, baseType: !590, size: 64, offset: 103872)
!590 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !410)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !417, file: !73, line: 294, baseType: !583, size: 64, offset: 103936)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "color_profile", scope: !417, file: !73, line: 297, baseType: !593, size: 256, offset: 104000)
!593 = !DIDerivedType(tag: DW_TAG_typedef, name: "ProfileInfo", file: !89, line: 40, baseType: !594)
!594 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ProfileInfo", file: !89, line: 27, size: 256, elements: !595)
!595 = !{!596, !597, !598, !601}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !594, file: !89, line: 30, baseType: !474, size: 64)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !594, file: !89, line: 33, baseType: !426, size: 64, offset: 64)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !594, file: !89, line: 36, baseType: !599, size: 64, offset: 128)
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64)
!600 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !594, file: !89, line: 39, baseType: !426, size: 64, offset: 192)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "iptc_profile", scope: !417, file: !73, line: 298, baseType: !593, size: 256, offset: 104256)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profile", scope: !417, file: !73, line: 299, baseType: !604, size: 64, offset: 104512)
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 64)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profiles", scope: !417, file: !73, line: 302, baseType: !426, size: 64, offset: 104576)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !417, file: !73, line: 305, baseType: !426, size: 64, offset: 104640)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !417, file: !73, line: 308, baseType: !507, size: 64, offset: 104704)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !417, file: !73, line: 309, baseType: !507, size: 64, offset: 104768)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !417, file: !73, line: 310, baseType: !507, size: 64, offset: 104832)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "interpolate", scope: !417, file: !73, line: 313, baseType: !611, size: 32, offset: 104896)
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterpolatePixelMethod", file: !326, line: 47, baseType: !325)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "black_point_compensation", scope: !417, file: !73, line: 316, baseType: !431, size: 32, offset: 104928)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_color", scope: !417, file: !73, line: 319, baseType: !439, size: 64, offset: 104960)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !417, file: !73, line: 322, baseType: !507, size: 64, offset: 105024)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "tile_offset", scope: !417, file: !73, line: 325, baseType: !482, size: 256, offset: 105088)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !417, file: !73, line: 328, baseType: !470, size: 64, offset: 105344)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "artifacts", scope: !417, file: !73, line: 329, baseType: !470, size: 64, offset: 105408)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !417, file: !73, line: 332, baseType: !619, size: 32, offset: 105472)
!619 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageType", file: !73, line: 61, baseType: !342)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !417, file: !73, line: 335, baseType: !431, size: 32, offset: 105504)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !417, file: !73, line: 338, baseType: !549, size: 64, offset: 105536)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "ping", scope: !417, file: !73, line: 341, baseType: !431, size: 32, offset: 105600)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !417, file: !73, line: 344, baseType: !426, size: 64, offset: 105664)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !417, file: !73, line: 347, baseType: !625, size: 64, offset: 105728)
!625 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !626, line: 7, baseType: !627)
!626 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "")
!627 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !413, line: 160, baseType: !414)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "intensity", scope: !417, file: !73, line: 350, baseType: !629, size: 32, offset: 105792)
!629 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelIntensityMethod", file: !326, line: 79, baseType: !356)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !417, file: !73, line: 353, baseType: !426, size: 64, offset: 105856)
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64)
!632 = !DIDerivedType(tag: DW_TAG_typedef, name: "IndexPacket", file: !326, line: 129, baseType: !443)
!633 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickRealType", file: !4, line: 78, baseType: !634)
!634 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 64)
!636 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !439)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 64)
!638 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !632)
!639 = !{i32 7, !"Dwarf Version", i32 4}
!640 = !{i32 2, !"Debug Info Version", i32 3}
!641 = !{i32 1, !"wchar_size", i32 4}
!642 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!643 = distinct !DISubprogram(name: "BorderImage", scope: !1, file: !1, line: 102, type: !644, scopeLine: 104, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !651)
!644 = !DISubroutineType(types: !645)
!645 = !{!415, !646, !648, !650}
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64)
!647 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !416)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 64)
!649 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !482)
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64)
!651 = !{}
!652 = !DILocalVariable(name: "image", arg: 1, scope: !643, file: !1, line: 102, type: !646)
!653 = !DILocation(line: 102, column: 46, scope: !643)
!654 = !DILocalVariable(name: "border_info", arg: 2, scope: !643, file: !1, line: 103, type: !648)
!655 = !DILocation(line: 103, column: 24, scope: !643)
!656 = !DILocalVariable(name: "exception", arg: 3, scope: !643, file: !1, line: 103, type: !650)
!657 = !DILocation(line: 103, column: 51, scope: !643)
!658 = !DILocalVariable(name: "border_image", scope: !643, file: !1, line: 106, type: !415)
!659 = !DILocation(line: 106, column: 6, scope: !643)
!660 = !DILocalVariable(name: "clone_image", scope: !643, file: !1, line: 107, type: !415)
!661 = !DILocation(line: 107, column: 6, scope: !643)
!662 = !DILocalVariable(name: "frame_info", scope: !643, file: !1, line: 110, type: !663)
!663 = !DIDerivedType(tag: DW_TAG_typedef, name: "FrameInfo", file: !664, line: 36, baseType: !665)
!664 = !DIFile(filename: "./magick/decorate.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!665 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_FrameInfo", file: !664, line: 25, size: 384, elements: !666)
!666 = !{!667, !668, !669, !670, !671, !672}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !665, file: !664, line: 28, baseType: !426, size: 64)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !665, file: !664, line: 29, baseType: !426, size: 64, offset: 64)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !665, file: !664, line: 32, baseType: !410, size: 64, offset: 128)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !665, file: !664, line: 33, baseType: !410, size: 64, offset: 192)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "inner_bevel", scope: !665, file: !664, line: 34, baseType: !410, size: 64, offset: 256)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "outer_bevel", scope: !665, file: !664, line: 35, baseType: !410, size: 64, offset: 320)
!673 = !DILocation(line: 110, column: 5, scope: !643)
!674 = !DILocation(line: 114, column: 7, scope: !675)
!675 = distinct !DILexicalBlock(scope: !643, file: !1, line: 114, column: 7)
!676 = !DILocation(line: 114, column: 14, scope: !675)
!677 = !DILocation(line: 114, column: 20, scope: !675)
!678 = !DILocation(line: 114, column: 7, scope: !643)
!679 = !DILocation(line: 115, column: 61, scope: !675)
!680 = !DILocation(line: 115, column: 68, scope: !675)
!681 = !DILocation(line: 115, column: 12, scope: !675)
!682 = !DILocation(line: 115, column: 5, scope: !675)
!683 = !DILocation(line: 117, column: 20, scope: !643)
!684 = !DILocation(line: 117, column: 27, scope: !643)
!685 = !DILocation(line: 117, column: 36, scope: !643)
!686 = !DILocation(line: 117, column: 49, scope: !643)
!687 = !DILocation(line: 117, column: 55, scope: !643)
!688 = !DILocation(line: 117, column: 34, scope: !643)
!689 = !DILocation(line: 117, column: 14, scope: !643)
!690 = !DILocation(line: 117, column: 19, scope: !643)
!691 = !DILocation(line: 118, column: 21, scope: !643)
!692 = !DILocation(line: 118, column: 28, scope: !643)
!693 = !DILocation(line: 118, column: 34, scope: !643)
!694 = !DILocation(line: 118, column: 47, scope: !643)
!695 = !DILocation(line: 118, column: 54, scope: !643)
!696 = !DILocation(line: 118, column: 32, scope: !643)
!697 = !DILocation(line: 118, column: 14, scope: !643)
!698 = !DILocation(line: 118, column: 20, scope: !643)
!699 = !DILocation(line: 119, column: 26, scope: !643)
!700 = !DILocation(line: 119, column: 39, scope: !643)
!701 = !DILocation(line: 119, column: 14, scope: !643)
!702 = !DILocation(line: 119, column: 15, scope: !643)
!703 = !DILocation(line: 120, column: 26, scope: !643)
!704 = !DILocation(line: 120, column: 39, scope: !643)
!705 = !DILocation(line: 120, column: 14, scope: !643)
!706 = !DILocation(line: 120, column: 15, scope: !643)
!707 = !DILocation(line: 121, column: 14, scope: !643)
!708 = !DILocation(line: 121, column: 25, scope: !643)
!709 = !DILocation(line: 122, column: 14, scope: !643)
!710 = !DILocation(line: 122, column: 25, scope: !643)
!711 = !DILocation(line: 123, column: 26, scope: !643)
!712 = !DILocation(line: 123, column: 47, scope: !643)
!713 = !DILocation(line: 123, column: 15, scope: !643)
!714 = !DILocation(line: 123, column: 14, scope: !643)
!715 = !DILocation(line: 124, column: 7, scope: !716)
!716 = distinct !DILexicalBlock(scope: !643, file: !1, line: 124, column: 7)
!717 = !DILocation(line: 124, column: 19, scope: !716)
!718 = !DILocation(line: 124, column: 7, scope: !643)
!719 = !DILocation(line: 125, column: 5, scope: !716)
!720 = !DILocation(line: 126, column: 3, scope: !643)
!721 = !DILocation(line: 126, column: 16, scope: !643)
!722 = !DILocation(line: 126, column: 28, scope: !643)
!723 = !DILocation(line: 126, column: 35, scope: !643)
!724 = !DILocation(line: 127, column: 27, scope: !643)
!725 = !DILocation(line: 127, column: 51, scope: !643)
!726 = !DILocation(line: 127, column: 16, scope: !643)
!727 = !DILocation(line: 127, column: 15, scope: !643)
!728 = !DILocation(line: 128, column: 28, scope: !643)
!729 = !DILocation(line: 128, column: 15, scope: !643)
!730 = !DILocation(line: 128, column: 14, scope: !643)
!731 = !DILocation(line: 129, column: 7, scope: !732)
!732 = distinct !DILexicalBlock(scope: !643, file: !1, line: 129, column: 7)
!733 = !DILocation(line: 129, column: 20, scope: !732)
!734 = !DILocation(line: 129, column: 7, scope: !643)
!735 = !DILocation(line: 130, column: 5, scope: !732)
!736 = !DILocation(line: 130, column: 19, scope: !732)
!737 = !DILocation(line: 130, column: 31, scope: !732)
!738 = !DILocation(line: 130, column: 38, scope: !732)
!739 = !DILocation(line: 131, column: 10, scope: !643)
!740 = !DILocation(line: 131, column: 3, scope: !643)
!741 = !DILocation(line: 132, column: 1, scope: !643)
!742 = distinct !DISubprogram(name: "FrameImage", scope: !1, file: !1, line: 165, type: !743, scopeLine: 167, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !651)
!743 = !DISubroutineType(types: !744)
!744 = !{!415, !646, !745, !650}
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 64)
!746 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !663)
!747 = !DILocalVariable(name: "image", arg: 1, scope: !742, file: !1, line: 165, type: !646)
!748 = !DILocation(line: 165, column: 45, scope: !742)
!749 = !DILocalVariable(name: "frame_info", arg: 2, scope: !742, file: !1, line: 165, type: !745)
!750 = !DILocation(line: 165, column: 68, scope: !742)
!751 = !DILocalVariable(name: "exception", arg: 3, scope: !742, file: !1, line: 166, type: !650)
!752 = !DILocation(line: 166, column: 18, scope: !742)
!753 = !DILocalVariable(name: "image_view", scope: !742, file: !1, line: 171, type: !754)
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 64)
!755 = !DIDerivedType(tag: DW_TAG_typedef, name: "CacheView", file: !756, line: 50, baseType: !757)
!756 = !DIFile(filename: "./magick/cache-view.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!757 = !DICompositeType(tag: DW_TAG_structure_type, name: "_CacheView", file: !326, line: 160, flags: DIFlagFwdDecl)
!758 = !DILocation(line: 171, column: 6, scope: !742)
!759 = !DILocalVariable(name: "frame_view", scope: !742, file: !1, line: 172, type: !754)
!760 = !DILocation(line: 172, column: 6, scope: !742)
!761 = !DILocalVariable(name: "frame_image", scope: !742, file: !1, line: 175, type: !415)
!762 = !DILocation(line: 175, column: 6, scope: !742)
!763 = !DILocalVariable(name: "status", scope: !742, file: !1, line: 178, type: !431)
!764 = !DILocation(line: 178, column: 5, scope: !742)
!765 = !DILocalVariable(name: "progress", scope: !742, file: !1, line: 181, type: !546)
!766 = !DILocation(line: 181, column: 5, scope: !742)
!767 = !DILocalVariable(name: "accentuate", scope: !742, file: !1, line: 184, type: !768)
!768 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickPixelPacket", file: !326, line: 127, baseType: !769)
!769 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MagickPixelPacket", file: !326, line: 104, size: 448, elements: !770)
!770 = !{!771, !772, !773, !774, !775, !776, !777, !778, !779, !780}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "storage_class", scope: !769, file: !326, line: 107, baseType: !420, size: 32)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !769, file: !326, line: 110, baseType: !422, size: 32, offset: 32)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "matte", scope: !769, file: !326, line: 113, baseType: !431, size: 32, offset: 64)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !769, file: !326, line: 116, baseType: !452, size: 64, offset: 128)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !769, file: !326, line: 119, baseType: !426, size: 64, offset: 192)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !769, file: !326, line: 122, baseType: !633, size: 32, offset: 256)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !769, file: !326, line: 123, baseType: !633, size: 32, offset: 288)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !769, file: !326, line: 124, baseType: !633, size: 32, offset: 320)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !769, file: !326, line: 125, baseType: !633, size: 32, offset: 352)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !769, file: !326, line: 126, baseType: !633, size: 32, offset: 384)
!781 = !DILocation(line: 184, column: 5, scope: !742)
!782 = !DILocalVariable(name: "border", scope: !742, file: !1, line: 185, type: !768)
!783 = !DILocation(line: 185, column: 5, scope: !742)
!784 = !DILocalVariable(name: "highlight", scope: !742, file: !1, line: 186, type: !768)
!785 = !DILocation(line: 186, column: 5, scope: !742)
!786 = !DILocalVariable(name: "interior", scope: !742, file: !1, line: 187, type: !768)
!787 = !DILocation(line: 187, column: 5, scope: !742)
!788 = !DILocalVariable(name: "matte", scope: !742, file: !1, line: 188, type: !768)
!789 = !DILocation(line: 188, column: 5, scope: !742)
!790 = !DILocalVariable(name: "shadow", scope: !742, file: !1, line: 189, type: !768)
!791 = !DILocation(line: 189, column: 5, scope: !742)
!792 = !DILocalVariable(name: "trough", scope: !742, file: !1, line: 190, type: !768)
!793 = !DILocation(line: 190, column: 5, scope: !742)
!794 = !DILocalVariable(name: "x", scope: !742, file: !1, line: 193, type: !410)
!795 = !DILocation(line: 193, column: 5, scope: !742)
!796 = !DILocalVariable(name: "bevel_width", scope: !742, file: !1, line: 196, type: !426)
!797 = !DILocation(line: 196, column: 5, scope: !742)
!798 = !DILocalVariable(name: "height", scope: !742, file: !1, line: 197, type: !426)
!799 = !DILocation(line: 197, column: 5, scope: !742)
!800 = !DILocalVariable(name: "width", scope: !742, file: !1, line: 198, type: !426)
!801 = !DILocation(line: 198, column: 5, scope: !742)
!802 = !DILocalVariable(name: "y", scope: !742, file: !1, line: 201, type: !410)
!803 = !DILocation(line: 201, column: 5, scope: !742)
!804 = !DILocation(line: 208, column: 7, scope: !805)
!805 = distinct !DILexicalBlock(scope: !742, file: !1, line: 208, column: 7)
!806 = !DILocation(line: 208, column: 14, scope: !805)
!807 = !DILocation(line: 208, column: 20, scope: !805)
!808 = !DILocation(line: 208, column: 7, scope: !742)
!809 = !DILocation(line: 209, column: 61, scope: !805)
!810 = !DILocation(line: 209, column: 68, scope: !805)
!811 = !DILocation(line: 209, column: 12, scope: !805)
!812 = !DILocation(line: 209, column: 5, scope: !805)
!813 = !DILocation(line: 211, column: 8, scope: !814)
!814 = distinct !DILexicalBlock(scope: !742, file: !1, line: 211, column: 7)
!815 = !DILocation(line: 211, column: 20, scope: !814)
!816 = !DILocation(line: 211, column: 32, scope: !814)
!817 = !DILocation(line: 211, column: 37, scope: !814)
!818 = !DILocation(line: 211, column: 41, scope: !814)
!819 = !DILocation(line: 211, column: 53, scope: !814)
!820 = !DILocation(line: 211, column: 65, scope: !814)
!821 = !DILocation(line: 211, column: 7, scope: !742)
!822 = !DILocation(line: 212, column: 5, scope: !823)
!823 = distinct !DILexicalBlock(scope: !814, file: !1, line: 212, column: 5)
!824 = !DILocation(line: 213, column: 25, scope: !742)
!825 = !DILocation(line: 213, column: 37, scope: !742)
!826 = !DILocation(line: 213, column: 49, scope: !742)
!827 = !DILocation(line: 213, column: 61, scope: !742)
!828 = !DILocation(line: 213, column: 48, scope: !742)
!829 = !DILocation(line: 213, column: 14, scope: !742)
!830 = !DILocation(line: 214, column: 9, scope: !742)
!831 = !DILocation(line: 214, column: 21, scope: !742)
!832 = !DILocation(line: 214, column: 27, scope: !742)
!833 = !DILocation(line: 214, column: 39, scope: !742)
!834 = !DILocation(line: 214, column: 26, scope: !742)
!835 = !DILocation(line: 214, column: 41, scope: !742)
!836 = !DILocation(line: 214, column: 40, scope: !742)
!837 = !DILocation(line: 214, column: 8, scope: !742)
!838 = !DILocation(line: 215, column: 10, scope: !742)
!839 = !DILocation(line: 215, column: 22, scope: !742)
!840 = !DILocation(line: 215, column: 29, scope: !742)
!841 = !DILocation(line: 215, column: 41, scope: !742)
!842 = !DILocation(line: 215, column: 28, scope: !742)
!843 = !DILocation(line: 215, column: 43, scope: !742)
