; ModuleID = 'magick/matrix.c'
source_filename = "magick/matrix.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._MatrixInfo = type { i32, i64, i64, i64, i64, i32, i32, [4096 x i8], i32, i8*, %struct.SemaphoreInfo*, i64 }
%struct.SemaphoreInfo = type opaque
%struct._ExceptionInfo = type { i32, i32, i8*, i8*, i8*, i32, %struct.SemaphoreInfo*, i64 }
%struct._Image = type { i32, i32, i32, i64, i32, i32, i32, i64, i64, i64, i64, %struct._PixelPacket*, %struct._PixelPacket, %struct._PixelPacket, %struct._PixelPacket, double, %struct._ChromaticityInfo, i32, i8*, i32, i8*, i8*, i8*, i64, double, double, %struct._RectangleInfo, %struct._RectangleInfo, %struct._RectangleInfo, double, double, double, i32, i32, i32, i32, i32, i32, %struct._Image*, i64, i64, i64, i64, i64, i64, %struct._ErrorInfo, %struct._TimerInfo, i32 (i8*, i64, i64, i8*)*, i8*, i8*, i8*, %struct._Ascii85Info*, %struct._BlobInfo*, [4096 x i8], [4096 x i8], [4096 x i8], i64, i64, %struct._ExceptionInfo, i32, i64, %struct.SemaphoreInfo*, %struct._ProfileInfo, %struct._ProfileInfo, %struct._ProfileInfo*, i64, i64, %struct._Image*, %struct._Image*, %struct._Image*, i32, i32, %struct._PixelPacket, %struct._Image*, %struct._RectangleInfo, i8*, i8*, i32, i32, i64, i32, i64, i64, i32, i64 }
%struct._ChromaticityInfo = type { %struct._PrimaryInfo, %struct._PrimaryInfo, %struct._PrimaryInfo, %struct._PrimaryInfo }

!409 = !DIEnumerator(name: "QuantizePreview", value: 11, isUnsigned: true)
!410 = !DIEnumerator(name: "DespecklePreview", value: 12, isUnsigned: true)
!411 = !DIEnumerator(name: "ReduceNoisePreview", value: 13, isUnsigned: true)
!412 = !DIEnumerator(name: "AddNoisePreview", value: 14, isUnsigned: true)
!413 = !DIEnumerator(name: "SharpenPreview", value: 15, isUnsigned: true)
!414 = !DIEnumerator(name: "BlurPreview", value: 16, isUnsigned: true)
!415 = !DIEnumerator(name: "ThresholdPreview", value: 17, isUnsigned: true)
!416 = !DIEnumerator(name: "EdgeDetectPreview", value: 18, isUnsigned: true)
!417 = !DIEnumerator(name: "SpreadPreview", value: 19, isUnsigned: true)
!418 = !DIEnumerator(name: "SolarizePreview", value: 20, isUnsigned: true)
!419 = !DIEnumerator(name: "ShadePreview", value: 21, isUnsigned: true)
!420 = !DIEnumerator(name: "RaisePreview", value: 22, isUnsigned: true)
!421 = !DIEnumerator(name: "SegmentPreview", value: 23, isUnsigned: true)
!422 = !DIEnumerator(name: "SwirlPreview", value: 24, isUnsigned: true)
!423 = !DIEnumerator(name: "ImplodePreview", value: 25, isUnsigned: true)
!424 = !DIEnumerator(name: "WavePreview", value: 26, isUnsigned: true)
!425 = !DIEnumerator(name: "OilPaintPreview", value: 27, isUnsigned: true)
!426 = !DIEnumerator(name: "CharcoalDrawingPreview", value: 28, isUnsigned: true)
!427 = !DIEnumerator(name: "JPEGPreview", value: 29, isUnsigned: true)
!428 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !14, line: 177, baseType: !5, size: 32, elements: !429)
!429 = !{!430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449}
!430 = !DIEnumerator(name: "UndefinedChannel", value: 0, isUnsigned: true)
!431 = !DIEnumerator(name: "RedChannel", value: 1, isUnsigned: true)
!432 = !DIEnumerator(name: "GrayChannel", value: 1, isUnsigned: true)
!433 = !DIEnumerator(name: "CyanChannel", value: 1, isUnsigned: true)
!434 = !DIEnumerator(name: "GreenChannel", value: 2, isUnsigned: true)
!435 = !DIEnumerator(name: "MagentaChannel", value: 2, isUnsigned: true)
!436 = !DIEnumerator(name: "BlueChannel", value: 4, isUnsigned: true)
!437 = !DIEnumerator(name: "YellowChannel", value: 4, isUnsigned: true)
!438 = !DIEnumerator(name: "AlphaChannel", value: 8, isUnsigned: true)
!439 = !DIEnumerator(name: "OpacityChannel", value: 8, isUnsigned: true)
!440 = !DIEnumerator(name: "MatteChannel", value: 8, isUnsigned: true)
!441 = !DIEnumerator(name: "BlackChannel", value: 32, isUnsigned: true)
!442 = !DIEnumerator(name: "IndexChannel", value: 32, isUnsigned: true)
!443 = !DIEnumerator(name: "CompositeChannels", value: 47, isUnsigned: true)
!444 = !DIEnumerator(name: "AllChannels", value: 134217727, isUnsigned: true)
!445 = !DIEnumerator(name: "TrueAlphaChannel", value: 64, isUnsigned: true)
!446 = !DIEnumerator(name: "RGBChannels", value: 128, isUnsigned: true)
!447 = !DIEnumerator(name: "GrayChannels", value: 128, isUnsigned: true)
!448 = !DIEnumerator(name: "SyncChannels", value: 256, isUnsigned: true)
!449 = !DIEnumerator(name: "DefaultChannels", value: 134217719, isUnsigned: true)
!450 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !451, line: 27, baseType: !5, size: 32, elements: !452)
!451 = !DIFile(filename: "./magick/cache-view.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!452 = !{!453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470}
!453 = !DIEnumerator(name: "UndefinedVirtualPixelMethod", value: 0, isUnsigned: true)
!454 = !DIEnumerator(name: "BackgroundVirtualPixelMethod", value: 1, isUnsigned: true)
!455 = !DIEnumerator(name: "ConstantVirtualPixelMethod", value: 2, isUnsigned: true)
!456 = !DIEnumerator(name: "DitherVirtualPixelMethod", value: 3, isUnsigned: true)
!457 = !DIEnumerator(name: "EdgeVirtualPixelMethod", value: 4, isUnsigned: true)
!458 = !DIEnumerator(name: "MirrorVirtualPixelMethod", value: 5, isUnsigned: true)
!459 = !DIEnumerator(name: "RandomVirtualPixelMethod", value: 6, isUnsigned: true)
!460 = !DIEnumerator(name: "TileVirtualPixelMethod", value: 7, isUnsigned: true)
!461 = !DIEnumerator(name: "TransparentVirtualPixelMethod", value: 8, isUnsigned: true)
!462 = !DIEnumerator(name: "MaskVirtualPixelMethod", value: 9, isUnsigned: true)
!463 = !DIEnumerator(name: "BlackVirtualPixelMethod", value: 10, isUnsigned: true)
!464 = !DIEnumerator(name: "GrayVirtualPixelMethod", value: 11, isUnsigned: true)
!465 = !DIEnumerator(name: "WhiteVirtualPixelMethod", value: 12, isUnsigned: true)
!466 = !DIEnumerator(name: "HorizontalTileVirtualPixelMethod", value: 13, isUnsigned: true)
!467 = !DIEnumerator(name: "VerticalTileVirtualPixelMethod", value: 14, isUnsigned: true)
!468 = !DIEnumerator(name: "HorizontalTileEdgeVirtualPixelMethod", value: 15, isUnsigned: true)
!469 = !DIEnumerator(name: "VerticalTileEdgeVirtualPixelMethod", value: 16, isUnsigned: true)
!470 = !DIEnumerator(name: "CheckerTileVirtualPixelMethod", value: 17, isUnsigned: true)
!471 = !{!472, !499, !506, !486, !480, !482, !508, !510, !513, !511, !518, !519, !521, !523, !512, !548, !716, !543, !848, !497, !850}
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "MatrixInfo", file: !474, line: 26, baseType: !475)
!474 = !DIFile(filename: "./magick/matrix.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!475 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MatrixInfo", file: !1, line: 58, size: 33408, elements: !476)
!476 = !{!477, !479, !483, !484, !485, !488, !490, !491, !496, !498, !500, !505}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !475, file: !1, line: 61, baseType: !478, size: 32)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "CacheType", file: !4, line: 35, baseType: !3)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !475, file: !1, line: 64, baseType: !480, size: 64, offset: 64)
!480 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !481, line: 46, baseType: !482)
!481 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!482 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !475, file: !1, line: 65, baseType: !480, size: 64, offset: 128)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "stride", scope: !475, file: !1, line: 66, baseType: !480, size: 64, offset: 192)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !475, file: !1, line: 69, baseType: !486, size: 64, offset: 256)
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickSizeType", file: !14, line: 151, baseType: !487)
!487 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "mapped", scope: !475, file: !1, line: 72, baseType: !489, size: 32, offset: 320)
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickBooleanType", file: !14, line: 215, baseType: !13)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "synchronize", scope: !475, file: !1, line: 73, baseType: !489, size: 32, offset: 352)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !475, file: !1, line: 76, baseType: !492, size: 32768, offset: 384)
!492 = !DICompositeType(tag: DW_TAG_array_type, baseType: !493, size: 32768, elements: !494)
!493 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!494 = !{!495}
!495 = !DISubrange(count: 4096)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !475, file: !1, line: 79, baseType: !497, size: 32, offset: 33152)
!497 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !475, file: !1, line: 82, baseType: !499, size: 64, offset: 33216)
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !475, file: !1, line: 85, baseType: !501, size: 64, offset: 33280)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64)
!502 = !DIDerivedType(tag: DW_TAG_typedef, name: "SemaphoreInfo", file: !503, line: 26, baseType: !504)
!503 = !DIFile(filename: "./magick/semaphore.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!504 = !DICompositeType(tag: DW_TAG_structure_type, name: "SemaphoreInfo", file: !503, line: 25, flags: DIFlagFwdDecl)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !475, file: !1, line: 88, baseType: !480, size: 64, offset: 33344)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!507 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !493)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64)
!509 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 64)
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 64)
!512 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!513 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !514, line: 77, baseType: !515)
!514 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!515 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !516, line: 193, baseType: !517)
!516 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!517 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64)
!519 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickOffsetType", file: !14, line: 150, baseType: !520)
!520 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64)
!522 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 64)
!524 = !DIDerivedType(tag: DW_TAG_typedef, name: "Image", file: !14, line: 221, baseType: !525)
!525 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Image", file: !177, line: 150, size: 105920, elements: !526)
!526 = !{!527, !529, !531, !533, !534, !536, !537, !538, !539, !540, !541, !542, !552, !553, !554, !555, !556, !570, !572, !573, !575, !577, !578, !579, !580, !581, !582, !590, !591, !592, !593, !594, !595, !597, !599, !601, !603, !605, !607, !609, !610, !611, !612, !613, !614, !615, !623, !638, !646, !647, !648, !649, !653, !657, !658, !659, !660, !661, !662, !675, !676, !678, !679, !687, !688, !690, !691, !692, !693, !694, !695, !697, !698, !699, !700, !701, !702, !703, !705, !706, !707, !708, !709, !713, !715}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "storage_class", scope: !525, file: !177, line: 153, baseType: !528, size: 32)
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "ClassType", file: !14, line: 209, baseType: !109)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !525, file: !177, line: 156, baseType: !530, size: 32, offset: 32)
!530 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorspaceType", file: !115, line: 61, baseType: !114)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !525, file: !177, line: 159, baseType: !532, size: 32, offset: 64)
!532 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompressionType", file: !152, line: 49, baseType: !151)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !525, file: !177, line: 162, baseType: !480, size: 64, offset: 128)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !525, file: !177, line: 165, baseType: !535, size: 32, offset: 192)
!535 = !DIDerivedType(tag: DW_TAG_typedef, name: "OrientationType", file: !177, line: 86, baseType: !176)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "taint", scope: !525, file: !177, line: 168, baseType: !489, size: 32, offset: 224)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "matte", scope: !525, file: !177, line: 169, baseType: !489, size: 32, offset: 256)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !525, file: !177, line: 172, baseType: !480, size: 64, offset: 320)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !525, file: !177, line: 173, baseType: !480, size: 64, offset: 384)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !525, file: !177, line: 174, baseType: !480, size: 64, offset: 448)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !525, file: !177, line: 175, baseType: !480, size: 64, offset: 512)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "colormap", scope: !525, file: !177, line: 178, baseType: !543, size: 64, offset: 576)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64)
!544 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelPacket", file: !353, line: 148, baseType: !545)
!545 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PixelPacket", file: !353, line: 131, size: 64, elements: !546)
!546 = !{!547, !549, !550, !551}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !545, file: !353, line: 143, baseType: !548, size: 16)
!548 = !DIDerivedType(tag: DW_TAG_typedef, name: "Quantum", file: !14, line: 93, baseType: !509)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !545, file: !353, line: 144, baseType: !548, size: 16, offset: 16)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !545, file: !353, line: 145, baseType: !548, size: 16, offset: 32)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !545, file: !353, line: 146, baseType: !548, size: 16, offset: 48)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "background_color", scope: !525, file: !177, line: 179, baseType: !544, size: 64, offset: 640)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !525, file: !177, line: 180, baseType: !544, size: 64, offset: 704)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "matte_color", scope: !525, file: !177, line: 181, baseType: !544, size: 64, offset: 768)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !525, file: !177, line: 184, baseType: !512, size: 64, offset: 832)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "chromaticity", scope: !525, file: !177, line: 187, baseType: !557, size: 768, offset: 896)
!557 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChromaticityInfo", file: !177, line: 128, baseType: !558)
!558 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ChromaticityInfo", file: !177, line: 121, size: 768, elements: !559)
!559 = !{!560, !567, !568, !569}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "red_primary", scope: !558, file: !177, line: 124, baseType: !561, size: 192)
!561 = !DIDerivedType(tag: DW_TAG_typedef, name: "PrimaryInfo", file: !177, line: 101, baseType: !562)
!562 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PrimaryInfo", file: !177, line: 95, size: 192, elements: !563)
!563 = !{!564, !565, !566}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !562, file: !177, line: 98, baseType: !512, size: 64)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !562, file: !177, line: 99, baseType: !512, size: 64, offset: 64)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !562, file: !177, line: 100, baseType: !512, size: 64, offset: 128)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "green_primary", scope: !558, file: !177, line: 125, baseType: !561, size: 192, offset: 192)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "blue_primary", scope: !558, file: !177, line: 126, baseType: !561, size: 192, offset: 384)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "white_point", scope: !558, file: !177, line: 127, baseType: !561, size: 192, offset: 576)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "rendering_intent", scope: !525, file: !177, line: 190, baseType: !571, size: 32, offset: 1664)
!571 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderingIntent", file: !189, line: 49, baseType: !188)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !525, file: !177, line: 193, baseType: !499, size: 64, offset: 1728)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !525, file: !177, line: 196, baseType: !574, size: 32, offset: 1792)
!574 = !DIDerivedType(tag: DW_TAG_typedef, name: "ResolutionType", file: !177, line: 93, baseType: !196)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "montage", scope: !525, file: !177, line: 199, baseType: !576, size: 64, offset: 1856)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "directory", scope: !525, file: !177, line: 200, baseType: !576, size: 64, offset: 1920)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "geometry", scope: !525, file: !177, line: 201, baseType: !576, size: 64, offset: 1984)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !525, file: !177, line: 204, baseType: !513, size: 64, offset: 2048)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "x_resolution", scope: !525, file: !177, line: 207, baseType: !512, size: 64, offset: 2112)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "y_resolution", scope: !525, file: !177, line: 208, baseType: !512, size: 64, offset: 2176)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !525, file: !177, line: 211, baseType: !583, size: 256, offset: 2240)
!583 = !DIDerivedType(tag: DW_TAG_typedef, name: "RectangleInfo", file: !253, line: 130, baseType: !584)
!584 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_RectangleInfo", file: !253, line: 121, size: 256, elements: !585)
!585 = !{!586, !587, !588, !589}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !584, file: !253, line: 124, baseType: !480, size: 64)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !584, file: !253, line: 125, baseType: !480, size: 64, offset: 64)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !584, file: !253, line: 128, baseType: !513, size: 64, offset: 128)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !584, file: !253, line: 129, baseType: !513, size: 64, offset: 192)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "extract_info", scope: !525, file: !177, line: 212, baseType: !583, size: 256, offset: 2496)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "tile_info", scope: !525, file: !177, line: 213, baseType: !583, size: 256, offset: 2752)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "bias", scope: !525, file: !177, line: 216, baseType: !512, size: 64, offset: 3008)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "blur", scope: !525, file: !177, line: 217, baseType: !512, size: 64, offset: 3072)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !525, file: !177, line: 218, baseType: !512, size: 64, offset: 3136)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !525, file: !177, line: 221, baseType: !596, size: 32, offset: 3200)
!596 = !DIDerivedType(tag: DW_TAG_typedef, name: "FilterTypes", file: !202, line: 66, baseType: !201)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "interlace", scope: !525, file: !177, line: 224, baseType: !598, size: 32, offset: 3232)
!598 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterlaceType", file: !177, line: 73, baseType: !236)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !525, file: !177, line: 227, baseType: !600, size: 32, offset: 3264)
!600 = !DIDerivedType(tag: DW_TAG_typedef, name: "EndianType", file: !247, line: 35, baseType: !246)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !525, file: !177, line: 230, baseType: !602, size: 32, offset: 3296)
!602 = !DIDerivedType(tag: DW_TAG_typedef, name: "GravityType", file: !253, line: 91, baseType: !252)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !525, file: !177, line: 233, baseType: !604, size: 32, offset: 3328)
!604 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompositeOperator", file: !268, line: 99, baseType: !267)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "dispose", scope: !525, file: !177, line: 236, baseType: !606, size: 32, offset: 3360)
!606 = !DIDerivedType(tag: DW_TAG_typedef, name: "DisposeType", file: !339, line: 32, baseType: !338)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "clip_mask", scope: !525, file: !177, line: 239, baseType: !608, size: 64, offset: 3392)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !525, file: !177, line: 242, baseType: !480, size: 64, offset: 3456)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !525, file: !177, line: 243, baseType: !480, size: 64, offset: 3520)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_second", scope: !525, file: !177, line: 246, baseType: !513, size: 64, offset: 3584)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "iterations", scope: !525, file: !177, line: 249, baseType: !480, size: 64, offset: 3648)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "total_colors", scope: !525, file: !177, line: 250, baseType: !480, size: 64, offset: 3712)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "start_loop", scope: !525, file: !177, line: 253, baseType: !513, size: 64, offset: 3776)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !525, file: !177, line: 256, baseType: !616, size: 192, offset: 3840)
!616 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErrorInfo", file: !617, line: 68, baseType: !618)
!617 = !DIFile(filename: "./magick/color.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!618 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ErrorInfo", file: !617, line: 62, size: 192, elements: !619)
!619 = !{!620, !621, !622}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "mean_error_per_pixel", scope: !618, file: !617, line: 65, baseType: !512, size: 64)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_mean_error", scope: !618, file: !617, line: 66, baseType: !512, size: 64, offset: 64)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_maximum_error", scope: !618, file: !617, line: 67, baseType: !512, size: 64, offset: 128)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !525, file: !177, line: 259, baseType: !624, size: 512, offset: 4032)
!624 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerInfo", file: !347, line: 51, baseType: !625)
!625 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TimerInfo", file: !347, line: 40, size: 512, elements: !626)
!626 = !{!627, !634, !635, !637}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !625, file: !347, line: 43, baseType: !628, size: 192)
!628 = !DIDerivedType(tag: DW_TAG_typedef, name: "Timer", file: !347, line: 38, baseType: !629)
!629 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Timer", file: !347, line: 32, size: 192, elements: !630)
!630 = !{!631, !632, !633}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !629, file: !347, line: 35, baseType: !512, size: 64)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !629, file: !347, line: 36, baseType: !512, size: 64, offset: 64)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !629, file: !347, line: 37, baseType: !512, size: 64, offset: 128)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "elapsed", scope: !625, file: !347, line: 44, baseType: !628, size: 192, offset: 192)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !625, file: !347, line: 47, baseType: !636, size: 32, offset: 384)
!636 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerState", file: !347, line: 30, baseType: !346)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !625, file: !347, line: 50, baseType: !480, size: 64, offset: 448)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !525, file: !177, line: 262, baseType: !639, size: 64, offset: 4544)
!639 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickProgressMonitor", file: !640, line: 26, baseType: !641)
!640 = !DIFile(filename: "./magick/monitor.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64)
!642 = !DISubroutineType(types: !643)
!643 = !{!489, !506, !644, !645, !499}
!644 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !519)
!645 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !486)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !525, file: !177, line: 265, baseType: !499, size: 64, offset: 4608)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !525, file: !177, line: 266, baseType: !499, size: 64, offset: 4672)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !525, file: !177, line: 267, baseType: !499, size: 64, offset: 4736)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "ascii85", scope: !525, file: !177, line: 270, baseType: !650, size: 64, offset: 4800)
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 64)
!651 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ascii85Info", file: !152, line: 52, baseType: !652)
!652 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Ascii85Info", file: !152, line: 51, flags: DIFlagFwdDecl)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !525, file: !177, line: 273, baseType: !654, size: 64, offset: 4864)
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 64)
!655 = !DIDerivedType(tag: DW_TAG_typedef, name: "BlobInfo", file: !14, line: 217, baseType: !656)
!656 = !DICompositeType(tag: DW_TAG_structure_type, name: "_BlobInfo", file: !14, line: 217, flags: DIFlagFwdDecl)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !525, file: !177, line: 276, baseType: !492, size: 32768, offset: 4928)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "magick_filename", scope: !525, file: !177, line: 277, baseType: !492, size: 32768, offset: 37696)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !525, file: !177, line: 278, baseType: !492, size: 32768, offset: 70464)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "magick_columns", scope: !525, file: !177, line: 281, baseType: !480, size: 64, offset: 103232)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "magick_rows", scope: !525, file: !177, line: 282, baseType: !480, size: 64, offset: 103296)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "exception", scope: !525, file: !177, line: 285, baseType: !663, size: 448, offset: 103360)
!663 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionInfo", file: !14, line: 219, baseType: !664)
!664 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ExceptionInfo", file: !19, line: 102, size: 448, elements: !665)
!665 = !{!666, !668, !669, !670, !671, !672, !673, !674}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "severity", scope: !664, file: !19, line: 105, baseType: !667, size: 32)
!667 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionType", file: !19, line: 100, baseType: !18)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "error_number", scope: !664, file: !19, line: 108, baseType: !497, size: 32, offset: 32)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !664, file: !19, line: 111, baseType: !576, size: 64, offset: 64)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !664, file: !19, line: 112, baseType: !576, size: 64, offset: 128)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "exceptions", scope: !664, file: !19, line: 115, baseType: !499, size: 64, offset: 192)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "relinquish", scope: !664, file: !19, line: 118, baseType: !489, size: 32, offset: 256)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !664, file: !19, line: 121, baseType: !501, size: 64, offset: 320)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !664, file: !19, line: 124, baseType: !480, size: 64, offset: 384)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !525, file: !177, line: 288, baseType: !489, size: 32, offset: 103808)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !525, file: !177, line: 291, baseType: !677, size: 64, offset: 103872)
!677 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !513)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !525, file: !177, line: 294, baseType: !501, size: 64, offset: 103936)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "color_profile", scope: !525, file: !177, line: 297, baseType: !680, size: 256, offset: 104000)
!680 = !DIDerivedType(tag: DW_TAG_typedef, name: "ProfileInfo", file: !189, line: 40, baseType: !681)
!681 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ProfileInfo", file: !189, line: 27, size: 256, elements: !682)
!682 = !{!683, !684, !685, !686}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !681, file: !189, line: 30, baseType: !576, size: 64)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !681, file: !189, line: 33, baseType: !480, size: 64, offset: 64)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !681, file: !189, line: 36, baseType: !521, size: 64, offset: 128)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !681, file: !189, line: 39, baseType: !480, size: 64, offset: 192)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "iptc_profile", scope: !525, file: !177, line: 298, baseType: !680, size: 256, offset: 104256)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profile", scope: !525, file: !177, line: 299, baseType: !689, size: 64, offset: 104512)
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 64)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profiles", scope: !525, file: !177, line: 302, baseType: !480, size: 64, offset: 104576)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !525, file: !177, line: 305, baseType: !480, size: 64, offset: 104640)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !525, file: !177, line: 308, baseType: !608, size: 64, offset: 104704)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !525, file: !177, line: 309, baseType: !608, size: 64, offset: 104768)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !525, file: !177, line: 310, baseType: !608, size: 64, offset: 104832)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "interpolate", scope: !525, file: !177, line: 313, baseType: !696, size: 32, offset: 104896)
!696 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterpolatePixelMethod", file: !353, line: 47, baseType: !352)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "black_point_compensation", scope: !525, file: !177, line: 316, baseType: !489, size: 32, offset: 104928)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_color", scope: !525, file: !177, line: 319, baseType: !544, size: 64, offset: 104960)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !525, file: !177, line: 322, baseType: !608, size: 64, offset: 105024)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "tile_offset", scope: !525, file: !177, line: 325, baseType: !583, size: 256, offset: 105088)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !525, file: !177, line: 328, baseType: !499, size: 64, offset: 105344)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "artifacts", scope: !525, file: !177, line: 329, baseType: !499, size: 64, offset: 105408)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !525, file: !177, line: 332, baseType: !704, size: 32, offset: 105472)
!704 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageType", file: !177, line: 61, baseType: !369)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !525, file: !177, line: 335, baseType: !489, size: 32, offset: 105504)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !525, file: !177, line: 338, baseType: !486, size: 64, offset: 105536)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "ping", scope: !525, file: !177, line: 341, baseType: !489, size: 32, offset: 105600)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !525, file: !177, line: 344, baseType: !480, size: 64, offset: 105664)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !525, file: !177, line: 347, baseType: !710, size: 64, offset: 105728)
!710 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !711, line: 7, baseType: !712)
!711 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "")
!712 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !516, line: 160, baseType: !517)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "intensity", scope: !525, file: !177, line: 350, baseType: !714, size: 32, offset: 105792)
!714 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelIntensityMethod", file: !353, line: 79, baseType: !383)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !525, file: !177, line: 353, baseType: !480, size: 64, offset: 105856)
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 64)
!717 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageInfo", file: !14, line: 223, baseType: !718)
!718 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ImageInfo", file: !177, line: 356, size: 134336, elements: !719)
!719 = !{!720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !754, !755, !756, !757, !758, !759, !761, !762, !763, !764, !765, !766, !777, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !845, !846, !847}
!720 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !718, file: !177, line: 359, baseType: !532, size: 32)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !718, file: !177, line: 362, baseType: !535, size: 32, offset: 32)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "temporary", scope: !718, file: !177, line: 365, baseType: !489, size: 32, offset: 64)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "adjoin", scope: !718, file: !177, line: 366, baseType: !489, size: 32, offset: 96)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "affirm", scope: !718, file: !177, line: 367, baseType: !489, size: 32, offset: 128)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "antialias", scope: !718, file: !177, line: 368, baseType: !489, size: 32, offset: 160)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !718, file: !177, line: 371, baseType: !576, size: 64, offset: 192)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "extract", scope: !718, file: !177, line: 372, baseType: !576, size: 64, offset: 256)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !718, file: !177, line: 373, baseType: !576, size: 64, offset: 320)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "scenes", scope: !718, file: !177, line: 374, baseType: !576, size: 64, offset: 384)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !718, file: !177, line: 377, baseType: !480, size: 64, offset: 448)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "number_scenes", scope: !718, file: !177, line: 378, baseType: !480, size: 64, offset: 512)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !718, file: !177, line: 379, baseType: !480, size: 64, offset: 576)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "interlace", scope: !718, file: !177, line: 382, baseType: !598, size: 32, offset: 640)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !718, file: !177, line: 385, baseType: !600, size: 32, offset: 672)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !718, file: !177, line: 388, baseType: !574, size: 32, offset: 704)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !718, file: !177, line: 391, baseType: !480, size: 64, offset: 768)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "sampling_factor", scope: !718, file: !177, line: 394, baseType: !576, size: 64, offset: 832)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "server_name", scope: !718, file: !177, line: 395, baseType: !576, size: 64, offset: 896)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "font", scope: !718, file: !177, line: 396, baseType: !576, size: 64, offset: 960)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "texture", scope: !718, file: !177, line: 397, baseType: !576, size: 64, offset: 1024)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "density", scope: !718, file: !177, line: 398, baseType: !576, size: 64, offset: 1088)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "pointsize", scope: !718, file: !177, line: 401, baseType: !512, size: 64, offset: 1152)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !718, file: !177, line: 402, baseType: !512, size: 64, offset: 1216)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "background_color", scope: !718, file: !177, line: 405, baseType: !544, size: 64, offset: 1280)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !718, file: !177, line: 406, baseType: !544, size: 64, offset: 1344)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "matte_color", scope: !718, file: !177, line: 407, baseType: !544, size: 64, offset: 1408)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !718, file: !177, line: 410, baseType: !489, size: 32, offset: 1472)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "monochrome", scope: !718, file: !177, line: 411, baseType: !489, size: 32, offset: 1504)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !718, file: !177, line: 414, baseType: !480, size: 64, offset: 1536)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !718, file: !177, line: 417, baseType: !530, size: 32, offset: 1600)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !718, file: !177, line: 420, baseType: !704, size: 32, offset: 1632)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "preview_type", scope: !718, file: !177, line: 423, baseType: !753, size: 32, offset: 1664)
!753 = !DIDerivedType(tag: DW_TAG_typedef, name: "PreviewType", file: !396, line: 59, baseType: !395)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !718, file: !177, line: 426, baseType: !513, size: 64, offset: 1728)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "ping", scope: !718, file: !177, line: 429, baseType: !489, size: 32, offset: 1792)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !718, file: !177, line: 430, baseType: !489, size: 32, offset: 1824)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !718, file: !177, line: 433, baseType: !576, size: 64, offset: 1856)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "authenticate", scope: !718, file: !177, line: 434, baseType: !576, size: 64, offset: 1920)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !718, file: !177, line: 437, baseType: !760, size: 32, offset: 1984)
!760 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChannelType", file: !14, line: 202, baseType: !428)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !718, file: !177, line: 440, baseType: !523, size: 64, offset: 2048)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !718, file: !177, line: 443, baseType: !499, size: 64, offset: 2112)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !718, file: !177, line: 446, baseType: !639, size: 64, offset: 2176)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !718, file: !177, line: 449, baseType: !499, size: 64, offset: 2240)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !718, file: !177, line: 450, baseType: !499, size: 64, offset: 2304)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !718, file: !177, line: 453, baseType: !767, size: 64, offset: 2368)
!767 = !DIDerivedType(tag: DW_TAG_typedef, name: "StreamHandler", file: !768, line: 26, baseType: !769)
!768 = !DIFile(filename: "./magick/stream.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 64)
!770 = !DISubroutineType(types: !771)
!771 = !{!480, !772, !774, !776}
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 64)
!773 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !524)
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 64)
!775 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!776 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !480)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !718, file: !177, line: 456, baseType: !778, size: 64, offset: 2432)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 64)
!779 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !780, line: 7, baseType: !781)
!780 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!781 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !782, line: 49, size: 1728, elements: !783)
!782 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!783 = !{!784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !799, !801, !802, !803, !805, !806, !808, !812, !815, !817, !820, !823, !824, !825, !826, !827}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !781, file: !782, line: 51, baseType: !497, size: 32)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !781, file: !782, line: 54, baseType: !576, size: 64, offset: 64)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !781, file: !782, line: 55, baseType: !576, size: 64, offset: 128)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !781, file: !782, line: 56, baseType: !576, size: 64, offset: 192)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !781, file: !782, line: 57, baseType: !576, size: 64, offset: 256)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !781, file: !782, line: 58, baseType: !576, size: 64, offset: 320)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !781, file: !782, line: 59, baseType: !576, size: 64, offset: 384)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !781, file: !782, line: 60, baseType: !576, size: 64, offset: 448)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !781, file: !782, line: 61, baseType: !576, size: 64, offset: 512)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !781, file: !782, line: 64, baseType: !576, size: 64, offset: 576)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !781, file: !782, line: 65, baseType: !576, size: 64, offset: 640)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !781, file: !782, line: 66, baseType: !576, size: 64, offset: 704)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !781, file: !782, line: 68, baseType: !797, size: 64, offset: 768)
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !798, size: 64)
!798 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !782, line: 36, flags: DIFlagFwdDecl)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !781, file: !782, line: 70, baseType: !800, size: 64, offset: 832)
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 64)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !781, file: !782, line: 72, baseType: !497, size: 32, offset: 896)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !781, file: !782, line: 73, baseType: !497, size: 32, offset: 928)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !781, file: !782, line: 74, baseType: !804, size: 64, offset: 960)
!804 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !516, line: 152, baseType: !517)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !781, file: !782, line: 77, baseType: !509, size: 16, offset: 1024)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !781, file: !782, line: 78, baseType: !807, size: 8, offset: 1040)
!807 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !781, file: !782, line: 79, baseType: !809, size: 8, offset: 1048)
!809 = !DICompositeType(tag: DW_TAG_array_type, baseType: !493, size: 8, elements: !810)
!810 = !{!811}
!811 = !DISubrange(count: 1)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !781, file: !782, line: 81, baseType: !813, size: 64, offset: 1088)
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 64)
!814 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !782, line: 43, baseType: null)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !781, file: !782, line: 89, baseType: !816, size: 64, offset: 1152)
!816 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !516, line: 153, baseType: !517)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !781, file: !782, line: 91, baseType: !818, size: 64, offset: 1216)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 64)
!819 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !782, line: 37, flags: DIFlagFwdDecl)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !781, file: !782, line: 92, baseType: !821, size: 64, offset: 1280)
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !822, size: 64)
!822 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !782, line: 38, flags: DIFlagFwdDecl)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !781, file: !782, line: 93, baseType: !800, size: 64, offset: 1344)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !781, file: !782, line: 94, baseType: !499, size: 64, offset: 1408)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !781, file: !782, line: 95, baseType: !480, size: 64, offset: 1472)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !781, file: !782, line: 96, baseType: !497, size: 32, offset: 1536)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !781, file: !782, line: 98, baseType: !828, size: 160, offset: 1568)
!828 = !DICompositeType(tag: DW_TAG_array_type, baseType: !493, size: 160, elements: !829)
!829 = !{!830}
!830 = !DISubrange(count: 20)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !718, file: !177, line: 459, baseType: !499, size: 64, offset: 2496)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !718, file: !177, line: 462, baseType: !480, size: 64, offset: 2560)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !718, file: !177, line: 465, baseType: !492, size: 32768, offset: 2624)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "unique", scope: !718, file: !177, line: 466, baseType: !492, size: 32768, offset: 35392)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "zero", scope: !718, file: !177, line: 467, baseType: !492, size: 32768, offset: 68160)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !718, file: !177, line: 468, baseType: !492, size: 32768, offset: 100928)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !718, file: !177, line: 471, baseType: !489, size: 32, offset: 133696)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "tile", scope: !718, file: !177, line: 474, baseType: !576, size: 64, offset: 133760)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "subimage", scope: !718, file: !177, line: 477, baseType: !480, size: 64, offset: 133824)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "subrange", scope: !718, file: !177, line: 478, baseType: !480, size: 64, offset: 133888)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "pen", scope: !718, file: !177, line: 481, baseType: !544, size: 64, offset: 133952)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !718, file: !177, line: 484, baseType: !480, size: 64, offset: 134016)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_pixel_method", scope: !718, file: !177, line: 487, baseType: !844, size: 32, offset: 134080)
!844 = !DIDerivedType(tag: DW_TAG_typedef, name: "VirtualPixelMethod", file: !451, line: 47, baseType: !450)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_color", scope: !718, file: !177, line: 490, baseType: !544, size: 64, offset: 134112)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !718, file: !177, line: 493, baseType: !499, size: 64, offset: 134208)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "synchronize", scope: !718, file: !177, line: 496, baseType: !489, size: 32, offset: 134272)
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !849, size: 64)
!849 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !522)
!850 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickRealType", file: !14, line: 78, baseType: !851)
!851 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!852 = !{i32 7, !"Dwarf Version", i32 4}
!853 = !{i32 2, !"Debug Info Version", i32 3}
!854 = !{i32 1, !"wchar_size", i32 4}
!855 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!856 = distinct !DISubprogram(name: "AcquireMatrixInfo", scope: !1, file: !1, line: 211, type: !857, scopeLine: 213, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !860)
!857 = !DISubroutineType(types: !858)
!858 = !{!472, !776, !776, !776, !859}
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !663, size: 64)
!860 = !{}
!861 = !DILocalVariable(name: "columns", arg: 1, scope: !856, file: !1, line: 211, type: !776)
!862 = !DILocation(line: 211, column: 57, scope: !856)
!863 = !DILocalVariable(name: "rows", arg: 2, scope: !856, file: !1, line: 212, type: !776)
!864 = !DILocation(line: 212, column: 16, scope: !856)
!865 = !DILocalVariable(name: "stride", arg: 3, scope: !856, file: !1, line: 212, type: !776)
!866 = !DILocation(line: 212, column: 34, scope: !856)
!867 = !DILocalVariable(name: "exception", arg: 4, scope: !856, file: !1, line: 212, type: !859)
!868 = !DILocation(line: 212, column: 56, scope: !856)
!869 = !DILocalVariable(name: "synchronize", scope: !856, file: !1, line: 215, type: !576)
!870 = !DILocation(line: 215, column: 6, scope: !856)
!871 = !DILocalVariable(name: "status", scope: !856, file: !1, line: 218, type: !489)
!872 = !DILocation(line: 218, column: 5, scope: !856)
!873 = !DILocalVariable(name: "matrix_info", scope: !856, file: !1, line: 221, type: !472)
!874 = !DILocation(line: 221, column: 6, scope: !856)
!875 = !DILocation(line: 223, column: 30, scope: !856)
!876 = !DILocation(line: 223, column: 15, scope: !856)
!877 = !DILocation(line: 223, column: 14, scope: !856)
!878 = !DILocation(line: 224, column: 7, scope: !879)
!879 = distinct !DILexicalBlock(scope: !856, file: !1, line: 224, column: 7)
!880 = !DILocation(line: 224, column: 19, scope: !879)
!881 = !DILocation(line: 224, column: 7, scope: !856)
!882 = !DILocation(line: 225, column: 5, scope: !879)
!883 = !DILocation(line: 226, column: 28, scope: !856)
!884 = !DILocation(line: 226, column: 10, scope: !856)
!885 = !DILocation(line: 227, column: 3, scope: !856)
!886 = !DILocation(line: 227, column: 16, scope: !856)
!887 = !DILocation(line: 227, column: 25, scope: !856)
!888 = !DILocation(line: 228, column: 24, scope: !856)
!889 = !DILocation(line: 228, column: 3, scope: !856)
!890 = !DILocation(line: 228, column: 16, scope: !856)
!891 = !DILocation(line: 228, column: 23, scope: !856)
!892 = !DILocation(line: 229, column: 21, scope: !856)
!893 = !DILocation(line: 229, column: 3, scope: !856)
!894 = !DILocation(line: 229, column: 16, scope: !856)
!895 = !DILocation(line: 229, column: 20, scope: !856)
!896 = !DILocation(line: 230, column: 23, scope: !856)
!897 = !DILocation(line: 230, column: 3, scope: !856)
!898 = !DILocation(line: 230, column: 16, scope: !856)
!899 = !DILocation(line: 230, column: 22, scope: !856)
!900 = !DILocation(line: 231, column: 26, scope: !856)
!901 = !DILocation(line: 231, column: 3, scope: !856)
!902 = !DILocation(line: 231, column: 16, scope: !856)
!903 = !DILocation(line: 231, column: 25, scope: !856)
!904 = !DILocation(line: 232, column: 15, scope: !856)
!905 = !DILocation(line: 232, column: 14, scope: !856)
!906 = !DILocation(line: 233, column: 7, scope: !907)
!907 = distinct !DILexicalBlock(scope: !856, file: !1, line: 233, column: 7)
!908 = !DILocation(line: 233, column: 19, scope: !907)
