; ModuleID = 'magick/policy.c'
source_filename = "magick/policy.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._LinkedListInfo = type opaque
%struct.SemaphoreInfo = type opaque
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct._PolicyMapInfo = type { i32, i32, i8*, i8*, i8* }
%struct._PolicyInfo = type { i8*, i32, i32, i8*, i8*, i8*, i32, i32, i32, %struct.SemaphoreInfo*, i64 }
%struct._ExceptionInfo = type { i32, i32, i8*, i8*, i8*, i32, %struct.SemaphoreInfo*, i64 }
%struct._StringInfo = type { [4096 x i8], i8*, i64, i64 }

@.str = private unnamed_addr constant [16 x i8] c"magick/policy.c\00", align 1
@.str.1 = private unnamed_addr constant [1 x i8] zeroinitializer, align 1
@.str.2 = private unnamed_addr constant [3 x i8] c"%s\00", align 1
@.str.3 = private unnamed_addr constant [2 x i8] c"*\00", align 1
@policy_cache = internal global %struct._LinkedListInfo* null, align 8, !dbg !0
@policy_semaphore = internal global %struct.SemaphoreInfo* null, align 8, !dbg !359

!154 = !DIEnumerator(name: "MagickEvaluateOptions", value: 23)
!155 = !DIEnumerator(name: "MagickFillRuleOptions", value: 24)
!156 = !DIEnumerator(name: "MagickFilterOptions", value: 25)
!157 = !DIEnumerator(name: "MagickFontOptions", value: 26)
!158 = !DIEnumerator(name: "MagickFontsOptions", value: 27)
!159 = !DIEnumerator(name: "MagickFormatOptions", value: 28)
!160 = !DIEnumerator(name: "MagickFunctionOptions", value: 29)
!161 = !DIEnumerator(name: "MagickGravityOptions", value: 30)
!162 = !DIEnumerator(name: "MagickIntentOptions", value: 31)
!163 = !DIEnumerator(name: "MagickInterlaceOptions", value: 32)
!164 = !DIEnumerator(name: "MagickInterpolateOptions", value: 33)
!165 = !DIEnumerator(name: "MagickKernelOptions", value: 34)
!166 = !DIEnumerator(name: "MagickLayerOptions", value: 35)
!167 = !DIEnumerator(name: "MagickLineCapOptions", value: 36)
!168 = !DIEnumerator(name: "MagickLineJoinOptions", value: 37)
!169 = !DIEnumerator(name: "MagickListOptions", value: 38)
!170 = !DIEnumerator(name: "MagickLocaleOptions", value: 39)
!171 = !DIEnumerator(name: "MagickLogEventOptions", value: 40)
!172 = !DIEnumerator(name: "MagickLogOptions", value: 41)
!173 = !DIEnumerator(name: "MagickMagicOptions", value: 42)
!174 = !DIEnumerator(name: "MagickMethodOptions", value: 43)
!175 = !DIEnumerator(name: "MagickMetricOptions", value: 44)
!176 = !DIEnumerator(name: "MagickMimeOptions", value: 45)
!177 = !DIEnumerator(name: "MagickModeOptions", value: 46)
!178 = !DIEnumerator(name: "MagickModuleOptions", value: 47)
!179 = !DIEnumerator(name: "MagickMorphologyOptions", value: 48)
!180 = !DIEnumerator(name: "MagickNoiseOptions", value: 49)
!181 = !DIEnumerator(name: "MagickOrientationOptions", value: 50)
!182 = !DIEnumerator(name: "MagickPixelIntensityOptions", value: 51)
!183 = !DIEnumerator(name: "MagickPolicyOptions", value: 52)
!184 = !DIEnumerator(name: "MagickPolicyDomainOptions", value: 53)
!185 = !DIEnumerator(name: "MagickPolicyRightsOptions", value: 54)
!186 = !DIEnumerator(name: "MagickPreviewOptions", value: 55)
!187 = !DIEnumerator(name: "MagickPrimitiveOptions", value: 56)
!188 = !DIEnumerator(name: "MagickQuantumFormatOptions", value: 57)
!189 = !DIEnumerator(name: "MagickResolutionOptions", value: 58)
!190 = !DIEnumerator(name: "MagickResourceOptions", value: 59)
!191 = !DIEnumerator(name: "MagickSparseColorOptions", value: 60)
!192 = !DIEnumerator(name: "MagickStatisticOptions", value: 61)
!193 = !DIEnumerator(name: "MagickStorageOptions", value: 62)
!194 = !DIEnumerator(name: "MagickStretchOptions", value: 63)
!195 = !DIEnumerator(name: "MagickStyleOptions", value: 64)
!196 = !DIEnumerator(name: "MagickThresholdOptions", value: 65)
!197 = !DIEnumerator(name: "MagickTypeOptions", value: 66)
!198 = !DIEnumerator(name: "MagickValidateOptions", value: 67)
!199 = !DIEnumerator(name: "MagickVirtualPixelOptions", value: 68)
!200 = !DIEnumerator(name: "MagickComplexOptions", value: 69)
!201 = !DIEnumerator(name: "MagickIntensityOptions", value: 70)
!202 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !203, line: 46, baseType: !7, size: 32, elements: !204)
!203 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!204 = !{!205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216}
!205 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!206 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!207 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!208 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!209 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!210 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!211 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!212 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!213 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!214 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!215 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!216 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!217 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !218, line: 25, baseType: !7, size: 32, elements: !219)
!218 = !DIFile(filename: "./magick/utility.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!219 = !{!220, !221, !222, !223, !224, !225, !226, !227, !228}
!220 = !DIEnumerator(name: "UndefinedPath", value: 0, isUnsigned: true)
!221 = !DIEnumerator(name: "MagickPath", value: 1, isUnsigned: true)
!222 = !DIEnumerator(name: "RootPath", value: 2, isUnsigned: true)
!223 = !DIEnumerator(name: "HeadPath", value: 3, isUnsigned: true)
!224 = !DIEnumerator(name: "TailPath", value: 4, isUnsigned: true)
!225 = !DIEnumerator(name: "BasePath", value: 5, isUnsigned: true)
!226 = !DIEnumerator(name: "ExtensionPath", value: 6, isUnsigned: true)
!227 = !DIEnumerator(name: "SubimagePath", value: 7, isUnsigned: true)
!228 = !DIEnumerator(name: "CanonicalPath", value: 8, isUnsigned: true)
!229 = !{!230, !231, !258, !259, !256, !260, !261, !237, !262, !264, !321, !251, !324, !128, !328, !295, !329, !343, !240, !242}
!230 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !233)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "PolicyInfo", file: !6, line: 49, baseType: !234)
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PolicyInfo", file: !3, line: 68, size: 576, elements: !235)
!235 = !{!236, !239, !241, !243, !244, !245, !246, !248, !249, !250, !255}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !234, file: !3, line: 71, baseType: !237, size: 64)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!238 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !234, file: !3, line: 74, baseType: !240, size: 32, offset: 64)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "PolicyDomain", file: !6, line: 37, baseType: !5)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "rights", scope: !234, file: !3, line: 77, baseType: !242, size: 32, offset: 96)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "PolicyRights", file: !6, line: 46, baseType: !16)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !234, file: !3, line: 80, baseType: !237, size: 64, offset: 128)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "pattern", scope: !234, file: !3, line: 81, baseType: !237, size: 64, offset: 192)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !234, file: !3, line: 82, baseType: !237, size: 64, offset: 256)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "exempt", scope: !234, file: !3, line: 85, baseType: !247, size: 32, offset: 320)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickBooleanType", file: !24, line: 215, baseType: !23)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "stealth", scope: !234, file: !3, line: 86, baseType: !247, size: 32, offset: 352)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !234, file: !3, line: 87, baseType: !247, size: 32, offset: 384)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !234, file: !3, line: 90, baseType: !251, size: 64, offset: 448)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "SemaphoreInfo", file: !253, line: 26, baseType: !254)
!253 = !DIFile(filename: "./magick/semaphore.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!254 = !DICompositeType(tag: DW_TAG_structure_type, name: "SemaphoreInfo", file: !253, line: 25, flags: DIFlagFwdDecl)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !234, file: !3, line: 93, baseType: !256, size: 64, offset: 512)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !257, line: 46, baseType: !230)
!257 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!263 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !238)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !266)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !267, line: 7, baseType: !268)
!267 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !269, line: 49, size: 1728, elements: !270)
!269 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!270 = !{!271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !286, !288, !289, !290, !294, !296, !298, !302, !305, !307, !310, !313, !314, !315, !316, !317}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !268, file: !269, line: 51, baseType: !128, size: 32)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !268, file: !269, line: 54, baseType: !237, size: 64, offset: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !268, file: !269, line: 55, baseType: !237, size: 64, offset: 128)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !268, file: !269, line: 56, baseType: !237, size: 64, offset: 192)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !268, file: !269, line: 57, baseType: !237, size: 64, offset: 256)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !268, file: !269, line: 58, baseType: !237, size: 64, offset: 320)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !268, file: !269, line: 59, baseType: !237, size: 64, offset: 384)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !268, file: !269, line: 60, baseType: !237, size: 64, offset: 448)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !268, file: !269, line: 61, baseType: !237, size: 64, offset: 512)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !268, file: !269, line: 64, baseType: !237, size: 64, offset: 576)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !268, file: !269, line: 65, baseType: !237, size: 64, offset: 640)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !268, file: !269, line: 66, baseType: !237, size: 64, offset: 704)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !268, file: !269, line: 68, baseType: !284, size: 64, offset: 768)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64)
!285 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !269, line: 36, flags: DIFlagFwdDecl)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !268, file: !269, line: 70, baseType: !287, size: 64, offset: 832)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !268, file: !269, line: 72, baseType: !128, size: 32, offset: 896)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !268, file: !269, line: 73, baseType: !128, size: 32, offset: 928)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !268, file: !269, line: 74, baseType: !291, size: 64, offset: 960)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !292, line: 152, baseType: !293)
!292 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!293 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !268, file: !269, line: 77, baseType: !295, size: 16, offset: 1024)
!295 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !268, file: !269, line: 78, baseType: !297, size: 8, offset: 1040)
!297 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !268, file: !269, line: 79, baseType: !299, size: 8, offset: 1048)
!299 = !DICompositeType(tag: DW_TAG_array_type, baseType: !238, size: 8, elements: !300)
!300 = !{!301}
!301 = !DISubrange(count: 1)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !268, file: !269, line: 81, baseType: !303, size: 64, offset: 1088)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !269, line: 43, baseType: null)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !268, file: !269, line: 89, baseType: !306, size: 64, offset: 1152)
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !292, line: 153, baseType: !293)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !268, file: !269, line: 91, baseType: !308, size: 64, offset: 1216)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64)
!309 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !269, line: 37, flags: DIFlagFwdDecl)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !268, file: !269, line: 92, baseType: !311, size: 64, offset: 1280)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!312 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !269, line: 38, flags: DIFlagFwdDecl)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !268, file: !269, line: 93, baseType: !287, size: 64, offset: 1344)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !268, file: !269, line: 94, baseType: !258, size: 64, offset: 1408)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !268, file: !269, line: 95, baseType: !256, size: 64, offset: 1472)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !268, file: !269, line: 96, baseType: !128, size: 32, offset: 1536)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !268, file: !269, line: 98, baseType: !318, size: 160, offset: 1568)
!318 = !DICompositeType(tag: DW_TAG_array_type, baseType: !238, size: 160, elements: !319)
!319 = !{!320}
!320 = !DISubrange(count: 20)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !322, line: 77, baseType: !323)
!322 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !292, line: 193, baseType: !293)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "LinkedListInfo", file: !326, line: 34, baseType: !327)
!326 = !DIFile(filename: "./magick/hashmap.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!327 = !DICompositeType(tag: DW_TAG_structure_type, name: "_LinkedListInfo", file: !326, line: 33, flags: DIFlagFwdDecl)
!328 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!330 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !331)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "StringInfo", file: !332, line: 40, baseType: !333)
!332 = !DIFile(filename: "./magick/string_.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!333 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_StringInfo", file: !332, line: 29, size: 32960, elements: !334)
!334 = !{!335, !339, !341, !342}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !333, file: !332, line: 32, baseType: !336, size: 32768)
!336 = !DICompositeType(tag: DW_TAG_array_type, baseType: !238, size: 32768, elements: !337)
!337 = !{!338}
!338 = !DISubrange(count: 4096)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "datum", scope: !333, file: !332, line: 35, baseType: !340, size: 64, offset: 32768)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !333, file: !332, line: 38, baseType: !256, size: 64, offset: 32832)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !333, file: !332, line: 39, baseType: !256, size: 64, offset: 32896)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!344 = !{!345, !0, !359}
!345 = !DIGlobalVariableExpression(var: !346, expr: !DIExpression())
!346 = distinct !DIGlobalVariable(name: "PolicyMap", scope: !2, file: !3, line: 114, type: !347, isLocal: true, isDefinition: true)
!347 = !DICompositeType(tag: DW_TAG_array_type, baseType: !348, size: 256, elements: !300)
!348 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !349)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "PolicyMapInfo", file: !3, line: 108, baseType: !350)
!350 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PolicyMapInfo", file: !3, line: 96, size: 256, elements: !351)
!351 = !{!352, !354, !356, !357, !358}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !350, file: !3, line: 99, baseType: !353, size: 32)
!353 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !240)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "rights", scope: !350, file: !3, line: 102, baseType: !355, size: 32, offset: 32)
!355 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !242)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !350, file: !3, line: 105, baseType: !262, size: 64, offset: 64)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "pattern", scope: !350, file: !3, line: 106, baseType: !262, size: 64, offset: 128)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !350, file: !3, line: 107, baseType: !262, size: 64, offset: 192)
!359 = !DIGlobalVariableExpression(var: !360, expr: !DIExpression())
!360 = distinct !DIGlobalVariable(name: "policy_semaphore", scope: !2, file: !3, line: 124, type: !251, isLocal: true, isDefinition: true)
!361 = !{i32 7, !"Dwarf Version", i32 4}
!362 = !{i32 2, !"Debug Info Version", i32 3}
!363 = !{i32 1, !"wchar_size", i32 4}
!364 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!365 = distinct !DISubprogram(name: "GetPolicyInfoList", scope: !3, file: !3, line: 331, type: !366, scopeLine: 333, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !382)
!366 = !DISubroutineType(types: !367)
!367 = !{!259, !262, !368, !369}
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionInfo", file: !24, line: 219, baseType: !371)
!371 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ExceptionInfo", file: !29, line: 102, size: 448, elements: !372)
!372 = !{!373, !375, !376, !377, !378, !379, !380, !381}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "severity", scope: !371, file: !29, line: 105, baseType: !374, size: 32)
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionType", file: !29, line: 100, baseType: !28)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "error_number", scope: !371, file: !29, line: 108, baseType: !128, size: 32, offset: 32)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !371, file: !29, line: 111, baseType: !237, size: 64, offset: 64)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !371, file: !29, line: 112, baseType: !237, size: 64, offset: 128)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "exceptions", scope: !371, file: !29, line: 115, baseType: !258, size: 64, offset: 192)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "relinquish", scope: !371, file: !29, line: 118, baseType: !247, size: 32, offset: 256)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !371, file: !29, line: 121, baseType: !251, size: 64, offset: 320)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !371, file: !29, line: 124, baseType: !256, size: 64, offset: 384)
!382 = !{}
!383 = !DILocalVariable(name: "pattern", arg: 1, scope: !365, file: !3, line: 331, type: !262)
!384 = !DILocation(line: 331, column: 63, scope: !365)
!385 = !DILocalVariable(name: "number_policies", arg: 2, scope: !365, file: !3, line: 332, type: !368)
!386 = !DILocation(line: 332, column: 11, scope: !365)
!387 = !DILocalVariable(name: "exception", arg: 3, scope: !365, file: !3, line: 332, type: !369)
!388 = !DILocation(line: 332, column: 42, scope: !365)
!389 = !DILocalVariable(name: "policies", scope: !365, file: !3, line: 335, type: !259)
!390 = !DILocation(line: 335, column: 7, scope: !365)
!391 = !DILocalVariable(name: "p", scope: !365, file: !3, line: 338, type: !231)
!392 = !DILocation(line: 338, column: 6, scope: !365)
!393 = !DILocalVariable(name: "i", scope: !365, file: !3, line: 341, type: !321)
!394 = !DILocation(line: 341, column: 5, scope: !365)
!395 = !DILocation(line: 347, column: 59, scope: !365)
!396 = !DILocation(line: 347, column: 10, scope: !365)
!397 = !DILocation(line: 349, column: 4, scope: !365)
!398 = !DILocation(line: 349, column: 19, scope: !365)
!399 = !DILocation(line: 350, column: 23, scope: !365)
!400 = !DILocation(line: 350, column: 5, scope: !365)
!401 = !DILocation(line: 350, column: 4, scope: !365)
!402 = !DILocation(line: 351, column: 7, scope: !403)
!403 = distinct !DILexicalBlock(scope: !365, file: !3, line: 351, column: 7)
!404 = !DILocation(line: 351, column: 9, scope: !403)
!405 = !DILocation(line: 351, column: 7, scope: !365)
!406 = !DILocation(line: 352, column: 5, scope: !403)
!407 = !DILocation(line: 354, column: 37, scope: !365)
!408 = !DILocation(line: 354, column: 5, scope: !365)
!409 = !DILocation(line: 354, column: 50, scope: !365)
!410 = !DILocation(line: 353, column: 34, scope: !365)
!411 = !DILocation(line: 353, column: 12, scope: !365)
!412 = !DILocation(line: 353, column: 11, scope: !365)
!413 = !DILocation(line: 355, column: 7, scope: !414)
!414 = distinct !DILexicalBlock(scope: !365, file: !3, line: 355, column: 7)
!415 = !DILocation(line: 355, column: 16, scope: !414)
!416 = !DILocation(line: 355, column: 7, scope: !365)
!417 = !DILocation(line: 356, column: 5, scope: !414)
!418 = !DILocation(line: 360, column: 21, scope: !365)
!419 = !DILocation(line: 360, column: 3, scope: !365)
!420 = !DILocation(line: 361, column: 27, scope: !365)
!421 = !DILocation(line: 361, column: 3, scope: !365)
!422 = !DILocation(line: 362, column: 51, scope: !365)
!423 = !DILocation(line: 362, column: 26, scope: !365)
!424 = !DILocation(line: 362, column: 5, scope: !365)
!425 = !DILocation(line: 362, column: 4, scope: !365)
!426 = !DILocation(line: 363, column: 9, scope: !427)
!427 = distinct !DILexicalBlock(scope: !365, file: !3, line: 363, column: 3)
!428 = !DILocation(line: 363, column: 8, scope: !427)
!429 = !DILocation(line: 363, column: 13, scope: !430)
!430 = distinct !DILexicalBlock(scope: !427, file: !3, line: 363, column: 3)
!431 = !DILocation(line: 363, column: 15, scope: !430)
!432 = !DILocation(line: 363, column: 3, scope: !427)
!433 = !DILocation(line: 365, column: 10, scope: !434)
!434 = distinct !DILexicalBlock(scope: !435, file: !3, line: 365, column: 9)
!435 = distinct !DILexicalBlock(scope: !430, file: !3, line: 364, column: 3)
!436 = !DILocation(line: 365, column: 13, scope: !434)
!437 = !DILocation(line: 365, column: 21, scope: !434)
!438 = !DILocation(line: 365, column: 37, scope: !434)
!439 = !DILocation(line: 366, column: 25, scope: !434)
!440 = !DILocation(line: 366, column: 28, scope: !434)
!441 = !DILocation(line: 366, column: 33, scope: !434)
!442 = !DILocation(line: 366, column: 10, scope: !434)
!443 = !DILocation(line: 366, column: 54, scope: !434)
!444 = !DILocation(line: 365, column: 9, scope: !435)
!445 = !DILocation(line: 367, column: 21, scope: !434)
!446 = !DILocation(line: 367, column: 7, scope: !434)
