; ModuleID = 'magick/stream.c'
source_filename = "magick/stream.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._StreamInfo = type { %struct._ImageInfo*, %struct._Image*, %struct._Image*, %struct._QuantumInfo*, i8*, i32, i8*, %struct._RectangleInfo, i64, %struct._ExceptionInfo*, i8*, i64 }
%struct._Image = type { i32, i32, i32, i64, i32, i32, i32, i64, i64, i64, i64, %struct._PixelPacket*, %struct._PixelPacket, %struct._PixelPacket, %struct._PixelPacket, double, %struct._ChromaticityInfo, i32, i8*, i32, i8*, i8*, i8*, i64, double, double, %struct._RectangleInfo, %struct._RectangleInfo, %struct._RectangleInfo, double, double, double, i32, i32, i32, i32, i32, i32, %struct._Image*, i64, i64, i64, i64, i64, i64, %struct._ErrorInfo, %struct._TimerInfo, i32 (i8*, i64, i64, i8*)*, i8*, i8*, i8*, %struct._Ascii85Info*, %struct._BlobInfo*, [4096 x i8], [4096 x i8], [4096 x i8], i64, i64, %struct._ExceptionInfo, i32, i64, %struct.SemaphoreInfo*, %struct._ProfileInfo, %struct._ProfileInfo, %struct._ProfileInfo*, i64, i64, %struct._Image*, %struct._Image*, %struct._Image*, i32, i32, %struct._PixelPacket, %struct._Image*, %struct._RectangleInfo, i8*, i8*, i32, i32, i64, i32, i64, i64, i32, i64 }
%struct._ChromaticityInfo = type { %struct._PrimaryInfo, %struct._PrimaryInfo, %struct._PrimaryInfo, %struct._PrimaryInfo }
%struct._PrimaryInfo = type { double, double, double }

!494 = !DIEnumerator(name: "UndefinedBlobMode", value: 0, isUnsigned: true)
!495 = !DIEnumerator(name: "ReadBlobMode", value: 1, isUnsigned: true)
!496 = !DIEnumerator(name: "ReadBinaryBlobMode", value: 2, isUnsigned: true)
!497 = !DIEnumerator(name: "WriteBlobMode", value: 3, isUnsigned: true)
!498 = !DIEnumerator(name: "WriteBinaryBlobMode", value: 4, isUnsigned: true)
!499 = !DIEnumerator(name: "AppendBlobMode", value: 5, isUnsigned: true)
!500 = !DIEnumerator(name: "AppendBinaryBlobMode", value: 6, isUnsigned: true)
!501 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !502, line: 27, baseType: !5, size: 32, elements: !503)
!502 = !DIFile(filename: "./magick/cache.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!503 = !{!504, !505, !506, !507, !508, !509}
!504 = !DIEnumerator(name: "UndefinedCache", value: 0, isUnsigned: true)
!505 = !DIEnumerator(name: "MemoryCache", value: 1, isUnsigned: true)
!506 = !DIEnumerator(name: "MapCache", value: 2, isUnsigned: true)
!507 = !DIEnumerator(name: "DiskCache", value: 3, isUnsigned: true)
!508 = !DIEnumerator(name: "PingCache", value: 4, isUnsigned: true)
!509 = !DIEnumerator(name: "DistributedCache", value: 5, isUnsigned: true)
!510 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !511, line: 30, baseType: !5, size: 32, elements: !512)
!511 = !DIFile(filename: "./magick/blob.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!512 = !{!513, !514, !515}
!513 = !DIEnumerator(name: "ReadMode", value: 0, isUnsigned: true)
!514 = !DIEnumerator(name: "WriteMode", value: 1, isUnsigned: true)
!515 = !DIEnumerator(name: "IOMode", value: 2, isUnsigned: true)
!516 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !57, line: 52, baseType: !5, size: 32, elements: !517)
!517 = !{!518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545}
!518 = !DIEnumerator(name: "UndefinedQuantum", value: 0, isUnsigned: true)
!519 = !DIEnumerator(name: "AlphaQuantum", value: 1, isUnsigned: true)
!520 = !DIEnumerator(name: "BlackQuantum", value: 2, isUnsigned: true)
!521 = !DIEnumerator(name: "BlueQuantum", value: 3, isUnsigned: true)
!522 = !DIEnumerator(name: "CMYKAQuantum", value: 4, isUnsigned: true)
!523 = !DIEnumerator(name: "CMYKQuantum", value: 5, isUnsigned: true)
!524 = !DIEnumerator(name: "CyanQuantum", value: 6, isUnsigned: true)
!525 = !DIEnumerator(name: "GrayAlphaQuantum", value: 7, isUnsigned: true)
!526 = !DIEnumerator(name: "GrayQuantum", value: 8, isUnsigned: true)
!527 = !DIEnumerator(name: "GreenQuantum", value: 9, isUnsigned: true)
!528 = !DIEnumerator(name: "IndexAlphaQuantum", value: 10, isUnsigned: true)
!529 = !DIEnumerator(name: "IndexQuantum", value: 11, isUnsigned: true)
!530 = !DIEnumerator(name: "MagentaQuantum", value: 12, isUnsigned: true)
!531 = !DIEnumerator(name: "OpacityQuantum", value: 13, isUnsigned: true)
!532 = !DIEnumerator(name: "RedQuantum", value: 14, isUnsigned: true)
!533 = !DIEnumerator(name: "RGBAQuantum", value: 15, isUnsigned: true)
!534 = !DIEnumerator(name: "BGRAQuantum", value: 16, isUnsigned: true)
!535 = !DIEnumerator(name: "RGBOQuantum", value: 17, isUnsigned: true)
!536 = !DIEnumerator(name: "RGBQuantum", value: 18, isUnsigned: true)
!537 = !DIEnumerator(name: "YellowQuantum", value: 19, isUnsigned: true)
!538 = !DIEnumerator(name: "GrayPadQuantum", value: 20, isUnsigned: true)
!539 = !DIEnumerator(name: "RGBPadQuantum", value: 21, isUnsigned: true)
!540 = !DIEnumerator(name: "CbYCrYQuantum", value: 22, isUnsigned: true)
!541 = !DIEnumerator(name: "CbYCrQuantum", value: 23, isUnsigned: true)
!542 = !DIEnumerator(name: "CbYCrAQuantum", value: 24, isUnsigned: true)
!543 = !DIEnumerator(name: "CMYKOQuantum", value: 25, isUnsigned: true)
!544 = !DIEnumerator(name: "BGRQuantum", value: 26, isUnsigned: true)
!545 = !DIEnumerator(name: "BGROQuantum", value: 27, isUnsigned: true)
!546 = !{!547, !667, !576, !769, !791, !568, !628, !911, !616, !645, !955, !741, !574, !1003, !827, !834, !1021, !991, !775, !1094, !599, !1035, !1096, !592, !1097, !984, !1098, !5, !1099, !1100, !1101, !792, !983, !600}
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64)
!548 = !DIDerivedType(tag: DW_TAG_typedef, name: "StreamInfo", file: !549, line: 26, baseType: !550)
!549 = !DIFile(filename: "./magick/stream-private.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!550 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_StreamInfo", file: !1, line: 67, size: 960, elements: !551)
!551 = !{!552, !908, !909, !910, !945, !946, !948, !949, !950, !951, !953, !954}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "image_info", scope: !550, file: !1, line: 70, baseType: !553, size: 64)
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64)
!554 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !555)
!555 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageInfo", file: !42, line: 223, baseType: !556)
!556 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ImageInfo", file: !30, line: 356, size: 134336, elements: !557)
!557 = !{!558, !560, !562, !564, !565, !566, !567, !570, !571, !572, !573, !577, !578, !579, !581, !583, !585, !586, !587, !588, !589, !590, !591, !593, !594, !604, !605, !606, !607, !608, !609, !611, !613, !615, !621, !622, !623, !624, !625, !627, !822, !823, !824, !825, !826, !837, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !905, !906, !907}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !556, file: !30, line: 359, baseType: !559, size: 32)
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompressionType", file: !4, line: 49, baseType: !3)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !556, file: !30, line: 362, baseType: !561, size: 32, offset: 32)
!561 = !DIDerivedType(tag: DW_TAG_typedef, name: "OrientationType", file: !30, line: 86, baseType: !29)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "temporary", scope: !556, file: !30, line: 365, baseType: !563, size: 32, offset: 64)
!563 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickBooleanType", file: !42, line: 215, baseType: !41)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "adjoin", scope: !556, file: !30, line: 366, baseType: !563, size: 32, offset: 96)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "affirm", scope: !556, file: !30, line: 367, baseType: !563, size: 32, offset: 128)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "antialias", scope: !556, file: !30, line: 368, baseType: !563, size: 32, offset: 160)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !556, file: !30, line: 371, baseType: !568, size: 64, offset: 192)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64)
!569 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "extract", scope: !556, file: !30, line: 372, baseType: !568, size: 64, offset: 256)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !556, file: !30, line: 373, baseType: !568, size: 64, offset: 320)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "scenes", scope: !556, file: !30, line: 374, baseType: !568, size: 64, offset: 384)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !556, file: !30, line: 377, baseType: !574, size: 64, offset: 448)
!574 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !575, line: 46, baseType: !576)
!575 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!576 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "number_scenes", scope: !556, file: !30, line: 378, baseType: !574, size: 64, offset: 512)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !556, file: !30, line: 379, baseType: !574, size: 64, offset: 576)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "interlace", scope: !556, file: !30, line: 382, baseType: !580, size: 32, offset: 640)
!580 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterlaceType", file: !30, line: 73, baseType: !46)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !556, file: !30, line: 385, baseType: !582, size: 32, offset: 672)
!582 = !DIDerivedType(tag: DW_TAG_typedef, name: "EndianType", file: !57, line: 35, baseType: !56)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !556, file: !30, line: 388, baseType: !584, size: 32, offset: 704)
!584 = !DIDerivedType(tag: DW_TAG_typedef, name: "ResolutionType", file: !30, line: 93, baseType: !62)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !556, file: !30, line: 391, baseType: !574, size: 64, offset: 768)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "sampling_factor", scope: !556, file: !30, line: 394, baseType: !568, size: 64, offset: 832)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "server_name", scope: !556, file: !30, line: 395, baseType: !568, size: 64, offset: 896)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "font", scope: !556, file: !30, line: 396, baseType: !568, size: 64, offset: 960)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "texture", scope: !556, file: !30, line: 397, baseType: !568, size: 64, offset: 1024)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "density", scope: !556, file: !30, line: 398, baseType: !568, size: 64, offset: 1088)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "pointsize", scope: !556, file: !30, line: 401, baseType: !592, size: 64, offset: 1152)
!592 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !556, file: !30, line: 402, baseType: !592, size: 64, offset: 1216)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "background_color", scope: !556, file: !30, line: 405, baseType: !595, size: 64, offset: 1280)
!595 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelPacket", file: !395, line: 148, baseType: !596)
!596 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PixelPacket", file: !395, line: 131, size: 64, elements: !597)
!597 = !{!598, !601, !602, !603}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !596, file: !395, line: 143, baseType: !599, size: 16)
!599 = !DIDerivedType(tag: DW_TAG_typedef, name: "Quantum", file: !42, line: 93, baseType: !600)
!600 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !596, file: !395, line: 144, baseType: !599, size: 16, offset: 16)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !596, file: !395, line: 145, baseType: !599, size: 16, offset: 32)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !596, file: !395, line: 146, baseType: !599, size: 16, offset: 48)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !556, file: !30, line: 406, baseType: !595, size: 64, offset: 1344)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "matte_color", scope: !556, file: !30, line: 407, baseType: !595, size: 64, offset: 1408)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !556, file: !30, line: 410, baseType: !563, size: 32, offset: 1472)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "monochrome", scope: !556, file: !30, line: 411, baseType: !563, size: 32, offset: 1504)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !556, file: !30, line: 414, baseType: !574, size: 64, offset: 1536)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !556, file: !30, line: 417, baseType: !610, size: 32, offset: 1600)
!610 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorspaceType", file: !68, line: 61, baseType: !67)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !556, file: !30, line: 420, baseType: !612, size: 32, offset: 1632)
!612 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageType", file: !30, line: 61, baseType: !104)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "preview_type", scope: !556, file: !30, line: 423, baseType: !614, size: 32, offset: 1664)
!614 = !DIDerivedType(tag: DW_TAG_typedef, name: "PreviewType", file: !119, line: 59, baseType: !118)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !556, file: !30, line: 426, baseType: !616, size: 64, offset: 1728)
!616 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !617, line: 77, baseType: !618)
!617 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!618 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !619, line: 193, baseType: !620)
!619 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!620 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "ping", scope: !556, file: !30, line: 429, baseType: !563, size: 32, offset: 1792)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !556, file: !30, line: 430, baseType: !563, size: 32, offset: 1824)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !556, file: !30, line: 433, baseType: !568, size: 64, offset: 1856)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "authenticate", scope: !556, file: !30, line: 434, baseType: !568, size: 64, offset: 1920)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !556, file: !30, line: 437, baseType: !626, size: 32, offset: 1984)
!626 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChannelType", file: !42, line: 202, baseType: !151)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !556, file: !30, line: 440, baseType: !628, size: 64, offset: 2048)
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 64)
!629 = !DIDerivedType(tag: DW_TAG_typedef, name: "Image", file: !42, line: 221, baseType: !630)
!630 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Image", file: !30, line: 150, size: 105920, elements: !631)
!631 = !{!632, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !646, !647, !648, !649, !650, !664, !666, !668, !669, !670, !671, !672, !673, !674, !675, !683, !684, !685, !686, !687, !688, !690, !691, !692, !694, !696, !698, !700, !701, !702, !703, !704, !705, !706, !714, !729, !743, !744, !745, !746, !750, !754, !758, !759, !760, !761, !762, !780, !781, !783, !784, !794, !795, !797, !798, !799, !800, !801, !802, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !819, !821}
!632 = !DIDerivedType(tag: DW_TAG_member, name: "storage_class", scope: !630, file: !30, line: 153, baseType: !633, size: 32)
!633 = !DIDerivedType(tag: DW_TAG_typedef, name: "ClassType", file: !42, line: 209, baseType: !173)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !630, file: !30, line: 156, baseType: !610, size: 32, offset: 32)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !630, file: !30, line: 159, baseType: !559, size: 32, offset: 64)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !630, file: !30, line: 162, baseType: !574, size: 64, offset: 128)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !630, file: !30, line: 165, baseType: !561, size: 32, offset: 192)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "taint", scope: !630, file: !30, line: 168, baseType: !563, size: 32, offset: 224)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "matte", scope: !630, file: !30, line: 169, baseType: !563, size: 32, offset: 256)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !630, file: !30, line: 172, baseType: !574, size: 64, offset: 320)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !630, file: !30, line: 173, baseType: !574, size: 64, offset: 384)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !630, file: !30, line: 174, baseType: !574, size: 64, offset: 448)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !630, file: !30, line: 175, baseType: !574, size: 64, offset: 512)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "colormap", scope: !630, file: !30, line: 178, baseType: !645, size: 64, offset: 576)
!645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 64)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "background_color", scope: !630, file: !30, line: 179, baseType: !595, size: 64, offset: 640)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !630, file: !30, line: 180, baseType: !595, size: 64, offset: 704)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "matte_color", scope: !630, file: !30, line: 181, baseType: !595, size: 64, offset: 768)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !630, file: !30, line: 184, baseType: !592, size: 64, offset: 832)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "chromaticity", scope: !630, file: !30, line: 187, baseType: !651, size: 768, offset: 896)
!651 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChromaticityInfo", file: !30, line: 128, baseType: !652)
!652 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ChromaticityInfo", file: !30, line: 121, size: 768, elements: !653)
!653 = !{!654, !661, !662, !663}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "red_primary", scope: !652, file: !30, line: 124, baseType: !655, size: 192)
!655 = !DIDerivedType(tag: DW_TAG_typedef, name: "PrimaryInfo", file: !30, line: 101, baseType: !656)
!656 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PrimaryInfo", file: !30, line: 95, size: 192, elements: !657)
!657 = !{!658, !659, !660}
!658 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !656, file: !30, line: 98, baseType: !592, size: 64)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !656, file: !30, line: 99, baseType: !592, size: 64, offset: 64)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !656, file: !30, line: 100, baseType: !592, size: 64, offset: 128)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "green_primary", scope: !652, file: !30, line: 125, baseType: !655, size: 192, offset: 192)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "blue_primary", scope: !652, file: !30, line: 126, baseType: !655, size: 192, offset: 384)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "white_point", scope: !652, file: !30, line: 127, baseType: !655, size: 192, offset: 576)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "rendering_intent", scope: !630, file: !30, line: 190, baseType: !665, size: 32, offset: 1664)
!665 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderingIntent", file: !179, line: 49, baseType: !178)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !630, file: !30, line: 193, baseType: !667, size: 64, offset: 1728)
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !630, file: !30, line: 196, baseType: !584, size: 32, offset: 1792)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "montage", scope: !630, file: !30, line: 199, baseType: !568, size: 64, offset: 1856)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "directory", scope: !630, file: !30, line: 200, baseType: !568, size: 64, offset: 1920)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "geometry", scope: !630, file: !30, line: 201, baseType: !568, size: 64, offset: 1984)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !630, file: !30, line: 204, baseType: !616, size: 64, offset: 2048)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "x_resolution", scope: !630, file: !30, line: 207, baseType: !592, size: 64, offset: 2112)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "y_resolution", scope: !630, file: !30, line: 208, baseType: !592, size: 64, offset: 2176)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !630, file: !30, line: 211, baseType: !676, size: 256, offset: 2240)
!676 = !DIDerivedType(tag: DW_TAG_typedef, name: "RectangleInfo", file: !222, line: 130, baseType: !677)
!677 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_RectangleInfo", file: !222, line: 121, size: 256, elements: !678)
!678 = !{!679, !680, !681, !682}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !677, file: !222, line: 124, baseType: !574, size: 64)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !677, file: !222, line: 125, baseType: !574, size: 64, offset: 64)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !677, file: !222, line: 128, baseType: !616, size: 64, offset: 128)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !677, file: !222, line: 129, baseType: !616, size: 64, offset: 192)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "extract_info", scope: !630, file: !30, line: 212, baseType: !676, size: 256, offset: 2496)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "tile_info", scope: !630, file: !30, line: 213, baseType: !676, size: 256, offset: 2752)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "bias", scope: !630, file: !30, line: 216, baseType: !592, size: 64, offset: 3008)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "blur", scope: !630, file: !30, line: 217, baseType: !592, size: 64, offset: 3072)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !630, file: !30, line: 218, baseType: !592, size: 64, offset: 3136)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !630, file: !30, line: 221, baseType: !689, size: 32, offset: 3200)
!689 = !DIDerivedType(tag: DW_TAG_typedef, name: "FilterTypes", file: !187, line: 66, baseType: !186)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "interlace", scope: !630, file: !30, line: 224, baseType: !580, size: 32, offset: 3232)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !630, file: !30, line: 227, baseType: !582, size: 32, offset: 3264)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !630, file: !30, line: 230, baseType: !693, size: 32, offset: 3296)
!693 = !DIDerivedType(tag: DW_TAG_typedef, name: "GravityType", file: !222, line: 91, baseType: !221)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !630, file: !30, line: 233, baseType: !695, size: 32, offset: 3328)
!695 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompositeOperator", file: !237, line: 99, baseType: !236)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "dispose", scope: !630, file: !30, line: 236, baseType: !697, size: 32, offset: 3360)
!697 = !DIDerivedType(tag: DW_TAG_typedef, name: "DisposeType", file: !308, line: 32, baseType: !307)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "clip_mask", scope: !630, file: !30, line: 239, baseType: !699, size: 64, offset: 3392)
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 64)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !630, file: !30, line: 242, baseType: !574, size: 64, offset: 3456)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !630, file: !30, line: 243, baseType: !574, size: 64, offset: 3520)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_second", scope: !630, file: !30, line: 246, baseType: !616, size: 64, offset: 3584)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "iterations", scope: !630, file: !30, line: 249, baseType: !574, size: 64, offset: 3648)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "total_colors", scope: !630, file: !30, line: 250, baseType: !574, size: 64, offset: 3712)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "start_loop", scope: !630, file: !30, line: 253, baseType: !616, size: 64, offset: 3776)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !630, file: !30, line: 256, baseType: !707, size: 192, offset: 3840)
!707 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErrorInfo", file: !708, line: 68, baseType: !709)
!708 = !DIFile(filename: "./magick/color.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!709 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ErrorInfo", file: !708, line: 62, size: 192, elements: !710)
!710 = !{!711, !712, !713}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "mean_error_per_pixel", scope: !709, file: !708, line: 65, baseType: !592, size: 64)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_mean_error", scope: !709, file: !708, line: 66, baseType: !592, size: 64, offset: 64)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_maximum_error", scope: !709, file: !708, line: 67, baseType: !592, size: 64, offset: 128)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !630, file: !30, line: 259, baseType: !715, size: 512, offset: 4032)
!715 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerInfo", file: !316, line: 51, baseType: !716)
!716 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TimerInfo", file: !316, line: 40, size: 512, elements: !717)
!717 = !{!718, !725, !726, !728}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !716, file: !316, line: 43, baseType: !719, size: 192)
!719 = !DIDerivedType(tag: DW_TAG_typedef, name: "Timer", file: !316, line: 38, baseType: !720)
!720 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Timer", file: !316, line: 32, size: 192, elements: !721)
!721 = !{!722, !723, !724}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !720, file: !316, line: 35, baseType: !592, size: 64)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !720, file: !316, line: 36, baseType: !592, size: 64, offset: 64)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !720, file: !316, line: 37, baseType: !592, size: 64, offset: 128)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "elapsed", scope: !716, file: !316, line: 44, baseType: !719, size: 192, offset: 192)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !716, file: !316, line: 47, baseType: !727, size: 32, offset: 384)
!727 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerState", file: !316, line: 30, baseType: !315)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !716, file: !316, line: 50, baseType: !574, size: 64, offset: 448)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !630, file: !30, line: 262, baseType: !730, size: 64, offset: 4544)
!730 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickProgressMonitor", file: !731, line: 26, baseType: !732)
!731 = !DIFile(filename: "./magick/monitor.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 64)
!733 = !DISubroutineType(types: !734)
!734 = !{!563, !735, !737, !740, !667}
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !736, size: 64)
!736 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !569)
!737 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !738)
!738 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickOffsetType", file: !42, line: 150, baseType: !739)
!739 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!740 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !741)
!741 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickSizeType", file: !42, line: 151, baseType: !742)
!742 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !630, file: !30, line: 265, baseType: !667, size: 64, offset: 4608)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !630, file: !30, line: 266, baseType: !667, size: 64, offset: 4672)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !630, file: !30, line: 267, baseType: !667, size: 64, offset: 4736)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "ascii85", scope: !630, file: !30, line: 270, baseType: !747, size: 64, offset: 4800)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64)
!748 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ascii85Info", file: !4, line: 52, baseType: !749)
!749 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Ascii85Info", file: !4, line: 51, flags: DIFlagFwdDecl)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !630, file: !30, line: 273, baseType: !751, size: 64, offset: 4864)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64)
!752 = !DIDerivedType(tag: DW_TAG_typedef, name: "BlobInfo", file: !42, line: 217, baseType: !753)
!753 = !DICompositeType(tag: DW_TAG_structure_type, name: "_BlobInfo", file: !42, line: 217, flags: DIFlagFwdDecl)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !630, file: !30, line: 276, baseType: !755, size: 32768, offset: 4928)
!755 = !DICompositeType(tag: DW_TAG_array_type, baseType: !569, size: 32768, elements: !756)
!756 = !{!757}
!757 = !DISubrange(count: 4096)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "magick_filename", scope: !630, file: !30, line: 277, baseType: !755, size: 32768, offset: 37696)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !630, file: !30, line: 278, baseType: !755, size: 32768, offset: 70464)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "magick_columns", scope: !630, file: !30, line: 281, baseType: !574, size: 64, offset: 103232)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "magick_rows", scope: !630, file: !30, line: 282, baseType: !574, size: 64, offset: 103296)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "exception", scope: !630, file: !30, line: 285, baseType: !763, size: 448, offset: 103360)
!763 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionInfo", file: !42, line: 219, baseType: !764)
!764 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ExceptionInfo", file: !322, line: 102, size: 448, elements: !765)
!765 = !{!766, !768, !770, !771, !772, !773, !774, !779}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "severity", scope: !764, file: !322, line: 105, baseType: !767, size: 32)
!767 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionType", file: !322, line: 100, baseType: !321)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "error_number", scope: !764, file: !322, line: 108, baseType: !769, size: 32, offset: 32)
!769 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !764, file: !322, line: 111, baseType: !568, size: 64, offset: 64)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !764, file: !322, line: 112, baseType: !568, size: 64, offset: 128)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "exceptions", scope: !764, file: !322, line: 115, baseType: !667, size: 64, offset: 192)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "relinquish", scope: !764, file: !322, line: 118, baseType: !563, size: 32, offset: 256)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !764, file: !322, line: 121, baseType: !775, size: 64, offset: 320)
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64)
!776 = !DIDerivedType(tag: DW_TAG_typedef, name: "SemaphoreInfo", file: !777, line: 26, baseType: !778)
!777 = !DIFile(filename: "./magick/semaphore.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!778 = !DICompositeType(tag: DW_TAG_structure_type, name: "SemaphoreInfo", file: !777, line: 25, flags: DIFlagFwdDecl)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !764, file: !322, line: 124, baseType: !574, size: 64, offset: 384)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !630, file: !30, line: 288, baseType: !563, size: 32, offset: 103808)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !630, file: !30, line: 291, baseType: !782, size: 64, offset: 103872)
!782 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !616)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !630, file: !30, line: 294, baseType: !775, size: 64, offset: 103936)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "color_profile", scope: !630, file: !30, line: 297, baseType: !785, size: 256, offset: 104000)
!785 = !DIDerivedType(tag: DW_TAG_typedef, name: "ProfileInfo", file: !179, line: 40, baseType: !786)
!786 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ProfileInfo", file: !179, line: 27, size: 256, elements: !787)
!787 = !{!788, !789, !790, !793}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !786, file: !179, line: 30, baseType: !568, size: 64)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !786, file: !179, line: 33, baseType: !574, size: 64, offset: 64)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !786, file: !179, line: 36, baseType: !791, size: 64, offset: 128)
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 64)
!792 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !786, file: !179, line: 39, baseType: !574, size: 64, offset: 192)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "iptc_profile", scope: !630, file: !30, line: 298, baseType: !785, size: 256, offset: 104256)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profile", scope: !630, file: !30, line: 299, baseType: !796, size: 64, offset: 104512)
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !785, size: 64)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profiles", scope: !630, file: !30, line: 302, baseType: !574, size: 64, offset: 104576)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !630, file: !30, line: 305, baseType: !574, size: 64, offset: 104640)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !630, file: !30, line: 308, baseType: !699, size: 64, offset: 104704)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !630, file: !30, line: 309, baseType: !699, size: 64, offset: 104768)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !630, file: !30, line: 310, baseType: !699, size: 64, offset: 104832)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "interpolate", scope: !630, file: !30, line: 313, baseType: !803, size: 32, offset: 104896)
!803 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterpolatePixelMethod", file: !395, line: 47, baseType: !394)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "black_point_compensation", scope: !630, file: !30, line: 316, baseType: !563, size: 32, offset: 104928)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_color", scope: !630, file: !30, line: 319, baseType: !595, size: 64, offset: 104960)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !630, file: !30, line: 322, baseType: !699, size: 64, offset: 105024)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "tile_offset", scope: !630, file: !30, line: 325, baseType: !676, size: 256, offset: 105088)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !630, file: !30, line: 328, baseType: !667, size: 64, offset: 105344)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "artifacts", scope: !630, file: !30, line: 329, baseType: !667, size: 64, offset: 105408)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !630, file: !30, line: 332, baseType: !612, size: 32, offset: 105472)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !630, file: !30, line: 335, baseType: !563, size: 32, offset: 105504)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !630, file: !30, line: 338, baseType: !741, size: 64, offset: 105536)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "ping", scope: !630, file: !30, line: 341, baseType: !563, size: 32, offset: 105600)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !630, file: !30, line: 344, baseType: !574, size: 64, offset: 105664)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !630, file: !30, line: 347, baseType: !816, size: 64, offset: 105728)
!816 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !817, line: 7, baseType: !818)
!817 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "")
!818 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !619, line: 160, baseType: !620)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "intensity", scope: !630, file: !30, line: 350, baseType: !820, size: 32, offset: 105792)
!820 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelIntensityMethod", file: !395, line: 79, baseType: !411)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !630, file: !30, line: 353, baseType: !574, size: 64, offset: 105856)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !556, file: !30, line: 443, baseType: !667, size: 64, offset: 2112)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !556, file: !30, line: 446, baseType: !730, size: 64, offset: 2176)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !556, file: !30, line: 449, baseType: !667, size: 64, offset: 2240)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !556, file: !30, line: 450, baseType: !667, size: 64, offset: 2304)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !556, file: !30, line: 453, baseType: !827, size: 64, offset: 2368)
!827 = !DIDerivedType(tag: DW_TAG_typedef, name: "StreamHandler", file: !828, line: 26, baseType: !829)
!828 = !DIFile(filename: "./magick/stream.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 64)
!830 = !DISubroutineType(types: !831)
!831 = !{!574, !832, !834, !836}
!832 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !833, size: 64)
!833 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !629)
!834 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !835, size: 64)
!835 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!836 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !574)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !556, file: !30, line: 456, baseType: !838, size: 64, offset: 2432)
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 64)
!839 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !840, line: 7, baseType: !841)
!840 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!841 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !842, line: 49, size: 1728, elements: !843)
!842 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!843 = !{!844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !859, !861, !862, !863, !865, !866, !868, !872, !875, !877, !880, !883, !884, !885, !886, !887}
!844 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !841, file: !842, line: 51, baseType: !769, size: 32)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !841, file: !842, line: 54, baseType: !568, size: 64, offset: 64)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !841, file: !842, line: 55, baseType: !568, size: 64, offset: 128)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !841, file: !842, line: 56, baseType: !568, size: 64, offset: 192)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !841, file: !842, line: 57, baseType: !568, size: 64, offset: 256)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !841, file: !842, line: 58, baseType: !568, size: 64, offset: 320)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !841, file: !842, line: 59, baseType: !568, size: 64, offset: 384)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !841, file: !842, line: 60, baseType: !568, size: 64, offset: 448)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !841, file: !842, line: 61, baseType: !568, size: 64, offset: 512)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !841, file: !842, line: 64, baseType: !568, size: 64, offset: 576)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !841, file: !842, line: 65, baseType: !568, size: 64, offset: 640)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !841, file: !842, line: 66, baseType: !568, size: 64, offset: 704)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !841, file: !842, line: 68, baseType: !857, size: 64, offset: 768)
!857 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !858, size: 64)
!858 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !842, line: 36, flags: DIFlagFwdDecl)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !841, file: !842, line: 70, baseType: !860, size: 64, offset: 832)
!860 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !841, size: 64)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !841, file: !842, line: 72, baseType: !769, size: 32, offset: 896)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !841, file: !842, line: 73, baseType: !769, size: 32, offset: 928)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !841, file: !842, line: 74, baseType: !864, size: 64, offset: 960)
!864 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !619, line: 152, baseType: !620)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !841, file: !842, line: 77, baseType: !600, size: 16, offset: 1024)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !841, file: !842, line: 78, baseType: !867, size: 8, offset: 1040)
!867 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !841, file: !842, line: 79, baseType: !869, size: 8, offset: 1048)
!869 = !DICompositeType(tag: DW_TAG_array_type, baseType: !569, size: 8, elements: !870)
!870 = !{!871}
!871 = !DISubrange(count: 1)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !841, file: !842, line: 81, baseType: !873, size: 64, offset: 1088)
!873 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !874, size: 64)
!874 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !842, line: 43, baseType: null)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !841, file: !842, line: 89, baseType: !876, size: 64, offset: 1152)
!876 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !619, line: 153, baseType: !620)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !841, file: !842, line: 91, baseType: !878, size: 64, offset: 1216)
!878 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !879, size: 64)
!879 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !842, line: 37, flags: DIFlagFwdDecl)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !841, file: !842, line: 92, baseType: !881, size: 64, offset: 1280)
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !882, size: 64)
!882 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !842, line: 38, flags: DIFlagFwdDecl)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !841, file: !842, line: 93, baseType: !860, size: 64, offset: 1344)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !841, file: !842, line: 94, baseType: !667, size: 64, offset: 1408)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !841, file: !842, line: 95, baseType: !574, size: 64, offset: 1472)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !841, file: !842, line: 96, baseType: !769, size: 32, offset: 1536)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !841, file: !842, line: 98, baseType: !888, size: 160, offset: 1568)
!888 = !DICompositeType(tag: DW_TAG_array_type, baseType: !569, size: 160, elements: !889)
!889 = !{!890}
!890 = !DISubrange(count: 20)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !556, file: !30, line: 459, baseType: !667, size: 64, offset: 2496)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !556, file: !30, line: 462, baseType: !574, size: 64, offset: 2560)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !556, file: !30, line: 465, baseType: !755, size: 32768, offset: 2624)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "unique", scope: !556, file: !30, line: 466, baseType: !755, size: 32768, offset: 35392)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "zero", scope: !556, file: !30, line: 467, baseType: !755, size: 32768, offset: 68160)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !556, file: !30, line: 468, baseType: !755, size: 32768, offset: 100928)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !556, file: !30, line: 471, baseType: !563, size: 32, offset: 133696)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "tile", scope: !556, file: !30, line: 474, baseType: !568, size: 64, offset: 133760)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "subimage", scope: !556, file: !30, line: 477, baseType: !574, size: 64, offset: 133824)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "subrange", scope: !556, file: !30, line: 478, baseType: !574, size: 64, offset: 133888)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "pen", scope: !556, file: !30, line: 481, baseType: !595, size: 64, offset: 133952)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !556, file: !30, line: 484, baseType: !574, size: 64, offset: 134016)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_pixel_method", scope: !556, file: !30, line: 487, baseType: !904, size: 32, offset: 134080)
!904 = !DIDerivedType(tag: DW_TAG_typedef, name: "VirtualPixelMethod", file: !424, line: 47, baseType: !423)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_color", scope: !556, file: !30, line: 490, baseType: !595, size: 64, offset: 134112)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !556, file: !30, line: 493, baseType: !667, size: 64, offset: 134208)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "synchronize", scope: !556, file: !30, line: 496, baseType: !563, size: 32, offset: 134272)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "image", scope: !550, file: !1, line: 73, baseType: !832, size: 64, offset: 64)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !550, file: !1, line: 76, baseType: !628, size: 64, offset: 128)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "quantum_info", scope: !550, file: !1, line: 79, baseType: !911, size: 64, offset: 192)
!911 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !912, size: 64)
!912 = !DIDerivedType(tag: DW_TAG_typedef, name: "QuantumInfo", file: !57, line: 85, baseType: !913)
!913 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QuantumInfo", file: !914, line: 42, size: 1216, elements: !915)
!914 = !DIFile(filename: "./magick/quantum-private.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!915 = !{!916, !917, !918, !920, !921, !922, !923, !924, !925, !926, !928, !929, !931, !932, !933, !943, !944}
!916 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !913, file: !914, line: 45, baseType: !574, size: 64)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "quantum", scope: !913, file: !914, line: 46, baseType: !574, size: 64, offset: 64)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !913, file: !914, line: 49, baseType: !919, size: 32, offset: 128)
!919 = !DIDerivedType(tag: DW_TAG_typedef, name: "QuantumFormatType", file: !57, line: 50, baseType: !444)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "minimum", scope: !913, file: !914, line: 52, baseType: !592, size: 64, offset: 192)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "maximum", scope: !913, file: !914, line: 53, baseType: !592, size: 64, offset: 256)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !913, file: !914, line: 54, baseType: !592, size: 64, offset: 320)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !913, file: !914, line: 57, baseType: !574, size: 64, offset: 384)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "min_is_white", scope: !913, file: !914, line: 60, baseType: !563, size: 32, offset: 448)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "pack", scope: !913, file: !914, line: 61, baseType: !563, size: 32, offset: 480)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_type", scope: !913, file: !914, line: 64, baseType: !927, size: 32, offset: 512)
!927 = !DIDerivedType(tag: DW_TAG_typedef, name: "QuantumAlphaType", file: !57, line: 42, baseType: !450)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "number_threads", scope: !913, file: !914, line: 67, baseType: !574, size: 64, offset: 576)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "pixels", scope: !913, file: !914, line: 70, baseType: !930, size: 64, offset: 640)
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !791, size: 64)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !913, file: !914, line: 73, baseType: !574, size: 64, offset: 704)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !913, file: !914, line: 76, baseType: !582, size: 32, offset: 768)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !913, file: !914, line: 79, baseType: !934, size: 256, offset: 832)
!934 = !DIDerivedType(tag: DW_TAG_typedef, name: "QuantumState", file: !914, line: 40, baseType: !935)
!935 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QuantumState", file: !914, line: 27, size: 256, elements: !936)
!936 = !{!937, !938, !939, !940}
!937 = !DIDerivedType(tag: DW_TAG_member, name: "inverse_scale", scope: !935, file: !914, line: 30, baseType: !592, size: 64)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "pixel", scope: !935, file: !914, line: 33, baseType: !5, size: 32, offset: 64)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !935, file: !914, line: 36, baseType: !574, size: 64, offset: 128)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !935, file: !914, line: 39, baseType: !941, size: 64, offset: 192)
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 64)
!942 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !913, file: !914, line: 82, baseType: !775, size: 64, offset: 1088)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !913, file: !914, line: 85, baseType: !574, size: 64, offset: 1152)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !550, file: !1, line: 82, baseType: !568, size: 64, offset: 256)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "storage_type", scope: !550, file: !1, line: 85, baseType: !947, size: 32, offset: 320)
!947 = !DIDerivedType(tag: DW_TAG_typedef, name: "StorageType", file: !456, line: 35, baseType: !455)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "pixels", scope: !550, file: !1, line: 88, baseType: !791, size: 64, offset: 384)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "extract_info", scope: !550, file: !1, line: 91, baseType: !676, size: 256, offset: 448)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !550, file: !1, line: 94, baseType: !616, size: 64, offset: 704)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "exception", scope: !550, file: !1, line: 97, baseType: !952, size: 64, offset: 768)
!952 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 64)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !550, file: !1, line: 100, baseType: !834, size: 64, offset: 832)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !550, file: !1, line: 103, baseType: !574, size: 64, offset: 896)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64)
!956 = !DIDerivedType(tag: DW_TAG_typedef, name: "CacheInfo", file: !957, line: 217, baseType: !958)
!957 = !DIFile(filename: "./magick/cache-private.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!958 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_CacheInfo", file: !957, line: 128, size: 68224, elements: !959)
!959 = !{!960, !961, !962, !963, !965, !967, !968, !969, !970, !971, !972, !973, !989, !990, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1074, !1079, !1080, !1081, !1082, !1083, !1089, !1090, !1091, !1092, !1093}
!960 = !DIDerivedType(tag: DW_TAG_member, name: "storage_class", scope: !958, file: !957, line: 131, baseType: !633, size: 32)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !958, file: !957, line: 134, baseType: !610, size: 32, offset: 32)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !958, file: !957, line: 137, baseType: !574, size: 64, offset: 64)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !958, file: !957, line: 140, baseType: !964, size: 32, offset: 128)
!964 = !DIDerivedType(tag: DW_TAG_typedef, name: "CacheType", file: !502, line: 35, baseType: !501)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !958, file: !957, line: 143, baseType: !966, size: 32, offset: 160)
!966 = !DIDerivedType(tag: DW_TAG_typedef, name: "MapMode", file: !511, line: 35, baseType: !510)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "mapped", scope: !958, file: !957, line: 146, baseType: !563, size: 32, offset: 192)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !958, file: !957, line: 149, baseType: !574, size: 64, offset: 256)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !958, file: !957, line: 150, baseType: !574, size: 64, offset: 320)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !958, file: !957, line: 153, baseType: !738, size: 64, offset: 384)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !958, file: !957, line: 156, baseType: !741, size: 64, offset: 448)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_pixel_method", scope: !958, file: !957, line: 159, baseType: !904, size: 32, offset: 512)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_pixel_color", scope: !958, file: !957, line: 162, baseType: !974, size: 448, offset: 576)
!974 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickPixelPacket", file: !395, line: 127, baseType: !975)
!975 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MagickPixelPacket", file: !395, line: 104, size: 448, elements: !976)
!976 = !{!977, !978, !979, !980, !981, !982, !985, !986, !987, !988}
!977 = !DIDerivedType(tag: DW_TAG_member, name: "storage_class", scope: !975, file: !395, line: 107, baseType: !633, size: 32)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !975, file: !395, line: 110, baseType: !610, size: 32, offset: 32)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "matte", scope: !975, file: !395, line: 113, baseType: !563, size: 32, offset: 64)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !975, file: !395, line: 116, baseType: !592, size: 64, offset: 128)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !975, file: !395, line: 119, baseType: !574, size: 64, offset: 192)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !975, file: !395, line: 122, baseType: !983, size: 32, offset: 256)
!983 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickRealType", file: !42, line: 78, baseType: !984)
!984 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !975, file: !395, line: 123, baseType: !983, size: 32, offset: 288)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !975, file: !395, line: 124, baseType: !983, size: 32, offset: 320)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !975, file: !395, line: 125, baseType: !983, size: 32, offset: 352)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !975, file: !395, line: 126, baseType: !983, size: 32, offset: 384)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "number_threads", scope: !958, file: !957, line: 165, baseType: !574, size: 64, offset: 1024)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "nexus_info", scope: !958, file: !957, line: 168, baseType: !991, size: 64, offset: 1088)
!991 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !992, size: 64)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 64)
!993 = !DIDerivedType(tag: DW_TAG_typedef, name: "NexusInfo", file: !957, line: 126, baseType: !994)
!994 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_NexusInfo", file: !957, line: 103, size: 704, elements: !995)
!995 = !{!996, !997, !998, !999, !1000, !1001, !1002, !1005}
!996 = !DIDerivedType(tag: DW_TAG_member, name: "mapped", scope: !994, file: !957, line: 106, baseType: !563, size: 32)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !994, file: !957, line: 109, baseType: !676, size: 256, offset: 64)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !994, file: !957, line: 112, baseType: !741, size: 64, offset: 320)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !994, file: !957, line: 115, baseType: !645, size: 64, offset: 384)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "pixels", scope: !994, file: !957, line: 116, baseType: !645, size: 64, offset: 448)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "authentic_pixel_cache", scope: !994, file: !957, line: 119, baseType: !563, size: 32, offset: 512)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "indexes", scope: !994, file: !957, line: 122, baseType: !1003, size: 64, offset: 576)
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1004, size: 64)
!1004 = !DIDerivedType(tag: DW_TAG_typedef, name: "IndexPacket", file: !395, line: 129, baseType: !599)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !994, file: !957, line: 125, baseType: !574, size: 64, offset: 640)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "pixels", scope: !958, file: !957, line: 171, baseType: !645, size: 64, offset: 1152)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "indexes", scope: !958, file: !957, line: 174, baseType: !1003, size: 64, offset: 1216)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "active_index_channel", scope: !958, file: !957, line: 177, baseType: !563, size: 32, offset: 1280)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !958, file: !957, line: 180, baseType: !769, size: 32, offset: 1312)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !958, file: !957, line: 183, baseType: !755, size: 32768, offset: 1344)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "cache_filename", scope: !958, file: !957, line: 184, baseType: !755, size: 32768, offset: 34112)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "methods", scope: !958, file: !957, line: 187, baseType: !1013, size: 704, offset: 66880)
!1013 = !DIDerivedType(tag: DW_TAG_typedef, name: "CacheMethods", file: !957, line: 101, baseType: !1014)
!1014 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_CacheMethods", file: !957, line: 67, size: 704, elements: !1015)
!1015 = !{!1016, !1025, !1030, !1037, !1042, !1047, !1052, !1057, !1062, !1064, !1069}
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "get_virtual_pixel_handler", scope: !1014, file: !957, line: 70, baseType: !1017, size: 64)
!1017 = !DIDerivedType(tag: DW_TAG_typedef, name: "GetVirtualPixelHandler", file: !957, line: 49, baseType: !1018)
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 64)
!1019 = !DISubroutineType(types: !1020)
!1020 = !{!1021, !832, !1023, !1024, !1024, !836, !836, !952}
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1022, size: 64)
!1022 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !595)
!1023 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !904)
!1024 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !616)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "get_virtual_pixels_handler", scope: !1014, file: !957, line: 73, baseType: !1026, size: 64, offset: 64)
!1026 = !DIDerivedType(tag: DW_TAG_typedef, name: "GetVirtualPixelsHandler", file: !957, line: 51, baseType: !1027)
!1027 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1028, size: 64)
!1028 = !DISubroutineType(types: !1029)
!1029 = !{!1021, !832}
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "get_virtual_indexes_from_handler", scope: !1014, file: !957, line: 76, baseType: !1031, size: 64, offset: 128)
!1031 = !DIDerivedType(tag: DW_TAG_typedef, name: "GetVirtualIndexesFromHandler", file: !957, line: 36, baseType: !1032)
!1032 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1033, size: 64)
!1033 = !DISubroutineType(types: !1034)
!1034 = !{!1035, !832}
!1035 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1036, size: 64)
!1036 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1004)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "get_one_virtual_pixel_from_handler", scope: !1014, file: !957, line: 79, baseType: !1038, size: 64, offset: 192)
!1038 = !DIDerivedType(tag: DW_TAG_typedef, name: "GetOneVirtualPixelFromHandler", file: !957, line: 44, baseType: !1039)
!1039 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1040, size: 64)
!1040 = !DISubroutineType(types: !1041)
!1041 = !{!563, !832, !1023, !1024, !1024, !645, !952}
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "get_authentic_pixels_handler", scope: !1014, file: !957, line: 82, baseType: !1043, size: 64, offset: 256)
!1043 = !DIDerivedType(tag: DW_TAG_typedef, name: "GetAuthenticPixelsHandler", file: !957, line: 54, baseType: !1044)
!1044 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1045, size: 64)
!1045 = !DISubroutineType(types: !1046)
!1046 = !{!645, !628, !1024, !1024, !836, !836, !952}
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "get_authentic_indexes_from_handler", scope: !1014, file: !957, line: 85, baseType: !1048, size: 64, offset: 320)
!1048 = !DIDerivedType(tag: DW_TAG_typedef, name: "GetAuthenticIndexesFromHandler", file: !957, line: 39, baseType: !1049)
!1049 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1050, size: 64)
!1050 = !DISubroutineType(types: !1051)
!1051 = !{!1003, !832}
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "get_one_authentic_pixel_from_handler", scope: !1014, file: !957, line: 88, baseType: !1053, size: 64, offset: 384)
!1053 = !DIDerivedType(tag: DW_TAG_typedef, name: "GetOneAuthenticPixelFromHandler", file: !957, line: 42, baseType: !1054)
!1054 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1055, size: 64)
!1055 = !DISubroutineType(types: !1056)
!1056 = !{!563, !628, !1024, !1024, !645, !952}
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "get_authentic_pixels_from_handler", scope: !1014, file: !957, line: 91, baseType: !1058, size: 64, offset: 448)
!1058 = !DIDerivedType(tag: DW_TAG_typedef, name: "GetAuthenticPixelsFromHandler", file: !957, line: 58, baseType: !1059)
!1059 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1060, size: 64)
!1060 = !DISubroutineType(types: !1061)
!1061 = !{!645, !832}
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "queue_authentic_pixels_handler", scope: !1014, file: !957, line: 94, baseType: !1063, size: 64, offset: 512)
!1063 = !DIDerivedType(tag: DW_TAG_typedef, name: "QueueAuthenticPixelsHandler", file: !957, line: 61, baseType: !1044)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "sync_authentic_pixels_handler", scope: !1014, file: !957, line: 97, baseType: !1065, size: 64, offset: 576)
!1065 = !DIDerivedType(tag: DW_TAG_typedef, name: "SyncAuthenticPixelsHandler", file: !957, line: 46, baseType: !1066)
!1066 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1067, size: 64)
!1067 = !DISubroutineType(types: !1068)
!1068 = !{!563, !628, !952}
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "destroy_pixel_handler", scope: !1014, file: !957, line: 100, baseType: !1070, size: 64, offset: 640)
!1070 = !DIDerivedType(tag: DW_TAG_typedef, name: "DestroyPixelHandler", file: !957, line: 65, baseType: !1071)
!1071 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1072, size: 64)
!1072 = !DISubroutineType(types: !1073)
!1073 = !{null, !628}
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "random_info", scope: !958, file: !957, line: 190, baseType: !1075, size: 64, offset: 67584)
!1075 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1076, size: 64)
!1076 = !DIDerivedType(tag: DW_TAG_typedef, name: "RandomInfo", file: !1077, line: 31, baseType: !1078)
!1077 = !DIFile(filename: "./magick/random_.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!1078 = !DICompositeType(tag: DW_TAG_structure_type, name: "_RandomInfo", file: !1077, line: 30, flags: DIFlagFwdDecl)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "number_connections", scope: !958, file: !957, line: 193, baseType: !574, size: 64, offset: 67648)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "server_info", scope: !958, file: !957, line: 196, baseType: !667, size: 64, offset: 67712)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "synchronize", scope: !958, file: !957, line: 199, baseType: !563, size: 32, offset: 67776)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !958, file: !957, line: 200, baseType: !563, size: 32, offset: 67808)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !958, file: !957, line: 203, baseType: !1084, size: 32, offset: 67840)
!1084 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickThreadType", file: !1085, line: 30, baseType: !1086)
!1085 = !DIFile(filename: "./magick/thread_.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!1086 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !1087, line: 97, baseType: !1088)
!1087 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "")
!1088 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !619, line: 154, baseType: !769)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !958, file: !957, line: 206, baseType: !616, size: 64, offset: 67904)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !958, file: !957, line: 209, baseType: !775, size: 64, offset: 67968)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "file_semaphore", scope: !958, file: !957, line: 210, baseType: !775, size: 64, offset: 68032)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !958, file: !957, line: 213, baseType: !816, size: 64, offset: 68096)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !958, file: !957, line: 216, baseType: !574, size: 64, offset: 68160)
!1094 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1095, size: 64)
!1095 = !DIDerivedType(tag: DW_TAG_typedef, name: "QuantumType", file: !57, line: 82, baseType: !516)
!1096 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64)
!1097 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64)
!1098 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!1099 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64)
!1100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !599, size: 64)
!1101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64)
!1102 = !{i32 7, !"Dwarf Version", i32 4}
!1103 = !{i32 2, !"Debug Info Version", i32 3}
!1104 = !{i32 1, !"wchar_size", i32 4}
!1105 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!1106 = distinct !DISubprogram(name: "AcquireStreamInfo", scope: !1, file: !1, line: 151, type: !1107, scopeLine: 152, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !1109)
!1107 = !DISubroutineType(types: !1108)
!1108 = !{!547, !553}
!1109 = !{}
!1110 = !DILocalVariable(name: "image_info", arg: 1, scope: !1106, file: !1, line: 151, type: !553)
!1111 = !DILocation(line: 151, column: 61, scope: !1106)
!1112 = !DILocalVariable(name: "stream_info", scope: !1106, file: !1, line: 154, type: !547)
!1113 = !DILocation(line: 154, column: 6, scope: !1106)
!1114 = !DILocation(line: 156, column: 30, scope: !1106)
!1115 = !DILocation(line: 156, column: 15, scope: !1106)
!1116 = !DILocation(line: 156, column: 14, scope: !1106)
!1117 = !DILocation(line: 157, column: 7, scope: !1118)
!1118 = distinct !DILexicalBlock(scope: !1106, file: !1, line: 157, column: 7)
!1119 = !DILocation(line: 157, column: 19, scope: !1118)
!1120 = !DILocation(line: 157, column: 7, scope: !1106)
!1121 = !DILocalVariable(name: "message", scope: !1122, file: !1, line: 158, type: !568)
!1122 = distinct !DILexicalBlock(scope: !1118, file: !1, line: 158, column: 5)
!1123 = !DILocation(line: 158, column: 5, scope: !1122)
!1124 = !DILocalVariable(name: "exception", scope: !1122, file: !1, line: 158, type: !763)
!1125 = !DILocation(line: 159, column: 28, scope: !1106)
!1126 = !DILocation(line: 159, column: 10, scope: !1106)
!1127 = !DILocation(line: 160, column: 41, scope: !1106)
!1128 = !DILocation(line: 160, column: 3, scope: !1106)
!1129 = !DILocation(line: 160, column: 16, scope: !1106)
!1130 = !DILocation(line: 160, column: 22, scope: !1106)
!1131 = !DILocation(line: 162, column: 7, scope: !1132)
!1132 = distinct !DILexicalBlock(scope: !1106, file: !1, line: 162, column: 7)
!1133 = !DILocation(line: 162, column: 20, scope: !1132)
!1134 = !DILocation(line: 162, column: 27, scope: !1132)
!1135 = !DILocation(line: 162, column: 7, scope: !1106)
!1136 = !DILocalVariable(name: "message", scope: !1137, file: !1, line: 163, type: !568)
!1137 = distinct !DILexicalBlock(scope: !1132, file: !1, line: 163, column: 5)
!1138 = !DILocation(line: 163, column: 5, scope: !1137)
!1139 = !DILocalVariable(name: "exception", scope: !1137, file: !1, line: 163, type: !763)
!1140 = !DILocation(line: 164, column: 20, scope: !1106)
!1141 = !DILocation(line: 164, column: 3, scope: !1106)
!1142 = !DILocation(line: 164, column: 16, scope: !1106)
!1143 = !DILocation(line: 164, column: 19, scope: !1106)
!1144 = !DILocation(line: 165, column: 3, scope: !1106)
!1145 = !DILocation(line: 165, column: 16, scope: !1106)
!1146 = !DILocation(line: 165, column: 28, scope: !1106)
!1147 = !DILocation(line: 166, column: 36, scope: !1106)
!1148 = !DILocation(line: 166, column: 23, scope: !1106)
!1149 = !DILocation(line: 166, column: 3, scope: !1106)
!1150 = !DILocation(line: 166, column: 16, scope: !1106)
!1151 = !DILocation(line: 166, column: 22, scope: !1106)
