; ModuleID = 'magick/segment.c'
source_filename = "magick/segment.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct._Image = type { i32, i32, i32, i64, i32, i32, i32, i64, i64, i64, i64, %struct._PixelPacket*, %struct._PixelPacket, %struct._PixelPacket, %struct._PixelPacket, double, %struct._ChromaticityInfo, i32, i8*, i32, i8*, i8*, i8*, i64, double, double, %struct._RectangleInfo, %struct._RectangleInfo, %struct._RectangleInfo, double, double, double, i32, i32, i32, i32, i32, i32, %struct._Image*, i64, i64, i64, i64, i64, i64, %struct._ErrorInfo, %struct._TimerInfo, i32 (i8*, i64, i64, i8*)*, i8*, i8*, i8*, %struct._Ascii85Info*, %struct._BlobInfo*, [4096 x i8], [4096 x i8], [4096 x i8], i64, i64, %struct._ExceptionInfo, i32, i64, %struct.SemaphoreInfo*, %struct._ProfileInfo, %struct._ProfileInfo, %struct._ProfileInfo*, i64, i64, %struct._Image*, %struct._Image*, %struct._Image*, i32, i32, %struct._PixelPacket, %struct._Image*, %struct._RectangleInfo, i8*, i8*, i32, i32, i64, i32, i64, i64, i32, i64 }

!338 = !DIEnumerator(name: "Average16InterpolatePixel", value: 10, isUnsigned: true)
!339 = !DIEnumerator(name: "BlendInterpolatePixel", value: 11, isUnsigned: true)
!340 = !DIEnumerator(name: "BackgroundInterpolatePixel", value: 12, isUnsigned: true)
!341 = !DIEnumerator(name: "CatromInterpolatePixel", value: 13, isUnsigned: true)
!342 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !77, line: 47, baseType: !5, size: 32, elements: !343)
!343 = !{!344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355}
!344 = !DIEnumerator(name: "UndefinedType", value: 0, isUnsigned: true)
!345 = !DIEnumerator(name: "BilevelType", value: 1, isUnsigned: true)
!346 = !DIEnumerator(name: "GrayscaleType", value: 2, isUnsigned: true)
!347 = !DIEnumerator(name: "GrayscaleMatteType", value: 3, isUnsigned: true)
!348 = !DIEnumerator(name: "PaletteType", value: 4, isUnsigned: true)
!349 = !DIEnumerator(name: "PaletteMatteType", value: 5, isUnsigned: true)
!350 = !DIEnumerator(name: "TrueColorType", value: 6, isUnsigned: true)
!351 = !DIEnumerator(name: "TrueColorMatteType", value: 7, isUnsigned: true)
!352 = !DIEnumerator(name: "ColorSeparationType", value: 8, isUnsigned: true)
!353 = !DIEnumerator(name: "ColorSeparationMatteType", value: 9, isUnsigned: true)
!354 = !DIEnumerator(name: "OptimizeType", value: 10, isUnsigned: true)
!355 = !DIEnumerator(name: "PaletteBilevelMatteType", value: 11, isUnsigned: true)
!356 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !326, line: 67, baseType: !5, size: 32, elements: !357)
!357 = !{!358, !359, !360, !361, !362, !363, !364, !365, !366, !367}
!358 = !DIEnumerator(name: "UndefinedPixelIntensityMethod", value: 0, isUnsigned: true)
!359 = !DIEnumerator(name: "AveragePixelIntensityMethod", value: 1, isUnsigned: true)
!360 = !DIEnumerator(name: "BrightnessPixelIntensityMethod", value: 2, isUnsigned: true)
!361 = !DIEnumerator(name: "LightnessPixelIntensityMethod", value: 3, isUnsigned: true)
!362 = !DIEnumerator(name: "Rec601LumaPixelIntensityMethod", value: 4, isUnsigned: true)
!363 = !DIEnumerator(name: "Rec601LuminancePixelIntensityMethod", value: 5, isUnsigned: true)
!364 = !DIEnumerator(name: "Rec709LumaPixelIntensityMethod", value: 6, isUnsigned: true)
!365 = !DIEnumerator(name: "Rec709LuminancePixelIntensityMethod", value: 7, isUnsigned: true)
!366 = !DIEnumerator(name: "RMSPixelIntensityMethod", value: 8, isUnsigned: true)
!367 = !DIEnumerator(name: "MSPixelIntensityMethod", value: 9, isUnsigned: true)
!368 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !369, line: 34, baseType: !5, size: 32, elements: !370)
!369 = !DIFile(filename: "./magick/log.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!370 = !{!371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392}
!371 = !DIEnumerator(name: "UndefinedEvents", value: 0, isUnsigned: true)
!372 = !DIEnumerator(name: "NoEvents", value: 0, isUnsigned: true)
!373 = !DIEnumerator(name: "TraceEvent", value: 1, isUnsigned: true)
!374 = !DIEnumerator(name: "AnnotateEvent", value: 2, isUnsigned: true)
!375 = !DIEnumerator(name: "BlobEvent", value: 4, isUnsigned: true)
!376 = !DIEnumerator(name: "CacheEvent", value: 8, isUnsigned: true)
!377 = !DIEnumerator(name: "CoderEvent", value: 16, isUnsigned: true)
!378 = !DIEnumerator(name: "ConfigureEvent", value: 32, isUnsigned: true)
!379 = !DIEnumerator(name: "DeprecateEvent", value: 64, isUnsigned: true)
!380 = !DIEnumerator(name: "DrawEvent", value: 128, isUnsigned: true)
!381 = !DIEnumerator(name: "ExceptionEvent", value: 256, isUnsigned: true)
!382 = !DIEnumerator(name: "ImageEvent", value: 512, isUnsigned: true)
!383 = !DIEnumerator(name: "LocaleEvent", value: 1024, isUnsigned: true)
!384 = !DIEnumerator(name: "ModuleEvent", value: 2048, isUnsigned: true)
!385 = !DIEnumerator(name: "PolicyEvent", value: 4096, isUnsigned: true)
!386 = !DIEnumerator(name: "ResourceEvent", value: 8192, isUnsigned: true)
!387 = !DIEnumerator(name: "TransformEvent", value: 16384, isUnsigned: true)
!388 = !DIEnumerator(name: "UserEvent", value: 36864, isUnsigned: true)
!389 = !DIEnumerator(name: "WandEvent", value: 65536, isUnsigned: true)
!390 = !DIEnumerator(name: "X11Event", value: 131072, isUnsigned: true)
!391 = !DIEnumerator(name: "AccelerateEvent", value: 262144, isUnsigned: true)
!392 = !DIEnumerator(name: "AllEvents", value: 2147483647, isUnsigned: true)
!393 = !{!394, !395, !401, !403, !404, !396, !424, !415, !435, !437, !438, !551, !430, !641, !449, !654, !665, !588, !642, !402, !666, !466, !461, !667, !668}
!394 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !397, line: 77, baseType: !398)
!397 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !399, line: 193, baseType: !400)
!399 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!400 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!402 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64)
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "Cluster", file: !1, line: 147, baseType: !406)
!406 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Cluster", file: !1, line: 134, size: 960, elements: !407)
!407 = !{!408, !410, !420, !421, !422, !423}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !406, file: !1, line: 137, baseType: !409, size: 64)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !406, file: !1, line: 140, baseType: !411, size: 256, offset: 64)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExtentPacket", file: !1, line: 132, baseType: !412)
!412 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ExtentPacket", file: !1, line: 123, size: 256, elements: !413)
!413 = !{!414, !417, !418, !419}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "center", scope: !412, file: !1, line: 126, baseType: !415, size: 32)
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickRealType", file: !4, line: 78, baseType: !416)
!416 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !412, file: !1, line: 129, baseType: !396, size: 64, offset: 64)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !412, file: !1, line: 130, baseType: !396, size: 64, offset: 128)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !412, file: !1, line: 131, baseType: !396, size: 64, offset: 192)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !406, file: !1, line: 141, baseType: !411, size: 256, offset: 320)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !406, file: !1, line: 142, baseType: !411, size: 256, offset: 576)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !406, file: !1, line: 145, baseType: !396, size: 64, offset: 832)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !406, file: !1, line: 146, baseType: !396, size: 64, offset: 896)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!425 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !426)
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelPacket", file: !326, line: 148, baseType: !427)
!427 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PixelPacket", file: !326, line: 131, size: 64, elements: !428)
!428 = !{!429, !432, !433, !434}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !427, file: !326, line: 143, baseType: !430, size: 16)
!430 = !DIDerivedType(tag: DW_TAG_typedef, name: "Quantum", file: !4, line: 93, baseType: !431)
!431 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !427, file: !326, line: 144, baseType: !430, size: 16, offset: 16)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !427, file: !326, line: 145, baseType: !430, size: 16, offset: 32)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !427, file: !326, line: 146, baseType: !430, size: 16, offset: 48)
!435 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickOffsetType", file: !4, line: 150, baseType: !436)
!436 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!437 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "Image", file: !4, line: 221, baseType: !440)
!440 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Image", file: !77, line: 150, size: 105920, elements: !441)
!441 = !{!442, !444, !446, !448, !451, !453, !455, !456, !457, !458, !459, !460, !462, !463, !464, !465, !467, !481, !483, !484, !486, !489, !490, !491, !492, !493, !494, !502, !503, !504, !505, !506, !507, !509, !511, !513, !515, !517, !519, !521, !522, !523, !524, !525, !526, !527, !535, !550, !562, !563, !564, !565, !569, !573, !577, !578, !579, !580, !581, !599, !600, !602, !603, !612, !613, !615, !616, !617, !618, !619, !620, !622, !623, !624, !625, !626, !627, !628, !630, !631, !632, !633, !634, !638, !640}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "storage_class", scope: !440, file: !77, line: 153, baseType: !443, size: 32)
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "ClassType", file: !4, line: 209, baseType: !9)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !440, file: !77, line: 156, baseType: !445, size: 32, offset: 32)
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorspaceType", file: !15, line: 61, baseType: !14)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !440, file: !77, line: 159, baseType: !447, size: 32, offset: 64)
!447 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompressionType", file: !52, line: 49, baseType: !51)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !440, file: !77, line: 162, baseType: !449, size: 64, offset: 128)
!449 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !450, line: 46, baseType: !394)
!450 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!451 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !440, file: !77, line: 165, baseType: !452, size: 32, offset: 192)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "OrientationType", file: !77, line: 86, baseType: !76)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "taint", scope: !440, file: !77, line: 168, baseType: !454, size: 32, offset: 224)
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickBooleanType", file: !4, line: 215, baseType: !3)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "matte", scope: !440, file: !77, line: 169, baseType: !454, size: 32, offset: 256)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !440, file: !77, line: 172, baseType: !449, size: 64, offset: 320)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !440, file: !77, line: 173, baseType: !449, size: 64, offset: 384)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !440, file: !77, line: 174, baseType: !449, size: 64, offset: 448)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !440, file: !77, line: 175, baseType: !449, size: 64, offset: 512)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "colormap", scope: !440, file: !77, line: 178, baseType: !461, size: 64, offset: 576)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "background_color", scope: !440, file: !77, line: 179, baseType: !426, size: 64, offset: 640)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !440, file: !77, line: 180, baseType: !426, size: 64, offset: 704)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "matte_color", scope: !440, file: !77, line: 181, baseType: !426, size: 64, offset: 768)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !440, file: !77, line: 184, baseType: !466, size: 64, offset: 832)
!466 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "chromaticity", scope: !440, file: !77, line: 187, baseType: !468, size: 768, offset: 896)
!468 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChromaticityInfo", file: !77, line: 128, baseType: !469)
!469 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ChromaticityInfo", file: !77, line: 121, size: 768, elements: !470)
!470 = !{!471, !478, !479, !480}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "red_primary", scope: !469, file: !77, line: 124, baseType: !472, size: 192)
!472 = !DIDerivedType(tag: DW_TAG_typedef, name: "PrimaryInfo", file: !77, line: 101, baseType: !473)
!473 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PrimaryInfo", file: !77, line: 95, size: 192, elements: !474)
!474 = !{!475, !476, !477}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !473, file: !77, line: 98, baseType: !466, size: 64)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !473, file: !77, line: 99, baseType: !466, size: 64, offset: 64)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !473, file: !77, line: 100, baseType: !466, size: 64, offset: 128)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "green_primary", scope: !469, file: !77, line: 125, baseType: !472, size: 192, offset: 192)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "blue_primary", scope: !469, file: !77, line: 126, baseType: !472, size: 192, offset: 384)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "white_point", scope: !469, file: !77, line: 127, baseType: !472, size: 192, offset: 576)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "rendering_intent", scope: !440, file: !77, line: 190, baseType: !482, size: 32, offset: 1664)
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderingIntent", file: !89, line: 49, baseType: !88)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !440, file: !77, line: 193, baseType: !403, size: 64, offset: 1728)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !440, file: !77, line: 196, baseType: !485, size: 32, offset: 1792)
!485 = !DIDerivedType(tag: DW_TAG_typedef, name: "ResolutionType", file: !77, line: 93, baseType: !96)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "montage", scope: !440, file: !77, line: 199, baseType: !487, size: 64, offset: 1856)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!488 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "directory", scope: !440, file: !77, line: 200, baseType: !487, size: 64, offset: 1920)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "geometry", scope: !440, file: !77, line: 201, baseType: !487, size: 64, offset: 1984)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !440, file: !77, line: 204, baseType: !396, size: 64, offset: 2048)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "x_resolution", scope: !440, file: !77, line: 207, baseType: !466, size: 64, offset: 2112)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "y_resolution", scope: !440, file: !77, line: 208, baseType: !466, size: 64, offset: 2176)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !440, file: !77, line: 211, baseType: !495, size: 256, offset: 2240)
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "RectangleInfo", file: !153, line: 130, baseType: !496)
!496 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_RectangleInfo", file: !153, line: 121, size: 256, elements: !497)
!497 = !{!498, !499, !500, !501}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !496, file: !153, line: 124, baseType: !449, size: 64)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !496, file: !153, line: 125, baseType: !449, size: 64, offset: 64)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !496, file: !153, line: 128, baseType: !396, size: 64, offset: 128)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !496, file: !153, line: 129, baseType: !396, size: 64, offset: 192)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "extract_info", scope: !440, file: !77, line: 212, baseType: !495, size: 256, offset: 2496)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "tile_info", scope: !440, file: !77, line: 213, baseType: !495, size: 256, offset: 2752)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "bias", scope: !440, file: !77, line: 216, baseType: !466, size: 64, offset: 3008)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "blur", scope: !440, file: !77, line: 217, baseType: !466, size: 64, offset: 3072)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !440, file: !77, line: 218, baseType: !466, size: 64, offset: 3136)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !440, file: !77, line: 221, baseType: !508, size: 32, offset: 3200)
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "FilterTypes", file: !102, line: 66, baseType: !101)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "interlace", scope: !440, file: !77, line: 224, baseType: !510, size: 32, offset: 3232)
!510 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterlaceType", file: !77, line: 73, baseType: !136)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !440, file: !77, line: 227, baseType: !512, size: 32, offset: 3264)
!512 = !DIDerivedType(tag: DW_TAG_typedef, name: "EndianType", file: !147, line: 35, baseType: !146)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !440, file: !77, line: 230, baseType: !514, size: 32, offset: 3296)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "GravityType", file: !153, line: 91, baseType: !152)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !440, file: !77, line: 233, baseType: !516, size: 32, offset: 3328)
!516 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompositeOperator", file: !168, line: 99, baseType: !167)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "dispose", scope: !440, file: !77, line: 236, baseType: !518, size: 32, offset: 3360)
!518 = !DIDerivedType(tag: DW_TAG_typedef, name: "DisposeType", file: !239, line: 32, baseType: !238)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "clip_mask", scope: !440, file: !77, line: 239, baseType: !520, size: 64, offset: 3392)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !440, file: !77, line: 242, baseType: !449, size: 64, offset: 3456)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !440, file: !77, line: 243, baseType: !449, size: 64, offset: 3520)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_second", scope: !440, file: !77, line: 246, baseType: !396, size: 64, offset: 3584)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "iterations", scope: !440, file: !77, line: 249, baseType: !449, size: 64, offset: 3648)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "total_colors", scope: !440, file: !77, line: 250, baseType: !449, size: 64, offset: 3712)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "start_loop", scope: !440, file: !77, line: 253, baseType: !396, size: 64, offset: 3776)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !440, file: !77, line: 256, baseType: !528, size: 192, offset: 3840)
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErrorInfo", file: !529, line: 68, baseType: !530)
!529 = !DIFile(filename: "./magick/color.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!530 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ErrorInfo", file: !529, line: 62, size: 192, elements: !531)
!531 = !{!532, !533, !534}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "mean_error_per_pixel", scope: !530, file: !529, line: 65, baseType: !466, size: 64)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_mean_error", scope: !530, file: !529, line: 66, baseType: !466, size: 64, offset: 64)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_maximum_error", scope: !530, file: !529, line: 67, baseType: !466, size: 64, offset: 128)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !440, file: !77, line: 259, baseType: !536, size: 512, offset: 4032)
!536 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerInfo", file: !247, line: 51, baseType: !537)
!537 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TimerInfo", file: !247, line: 40, size: 512, elements: !538)
!538 = !{!539, !546, !547, !549}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !537, file: !247, line: 43, baseType: !540, size: 192)
!540 = !DIDerivedType(tag: DW_TAG_typedef, name: "Timer", file: !247, line: 38, baseType: !541)
!541 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Timer", file: !247, line: 32, size: 192, elements: !542)
!542 = !{!543, !544, !545}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !541, file: !247, line: 35, baseType: !466, size: 64)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !541, file: !247, line: 36, baseType: !466, size: 64, offset: 64)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !541, file: !247, line: 37, baseType: !466, size: 64, offset: 128)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "elapsed", scope: !537, file: !247, line: 44, baseType: !540, size: 192, offset: 192)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !537, file: !247, line: 47, baseType: !548, size: 32, offset: 384)
!548 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerState", file: !247, line: 30, baseType: !246)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !537, file: !247, line: 50, baseType: !449, size: 64, offset: 448)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !440, file: !77, line: 262, baseType: !551, size: 64, offset: 4544)
!551 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickProgressMonitor", file: !552, line: 26, baseType: !553)
!552 = !DIFile(filename: "./magick/monitor.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64)
!554 = !DISubroutineType(types: !555)
!555 = !{!454, !556, !558, !559, !403}
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 64)
!557 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !488)
!558 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !435)
!559 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !560)
!560 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickSizeType", file: !4, line: 151, baseType: !561)
!561 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !440, file: !77, line: 265, baseType: !403, size: 64, offset: 4608)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !440, file: !77, line: 266, baseType: !403, size: 64, offset: 4672)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !440, file: !77, line: 267, baseType: !403, size: 64, offset: 4736)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "ascii85", scope: !440, file: !77, line: 270, baseType: !566, size: 64, offset: 4800)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64)
!567 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ascii85Info", file: !52, line: 52, baseType: !568)
!568 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Ascii85Info", file: !52, line: 51, flags: DIFlagFwdDecl)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !440, file: !77, line: 273, baseType: !570, size: 64, offset: 4864)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64)
!571 = !DIDerivedType(tag: DW_TAG_typedef, name: "BlobInfo", file: !4, line: 217, baseType: !572)
!572 = !DICompositeType(tag: DW_TAG_structure_type, name: "_BlobInfo", file: !4, line: 217, flags: DIFlagFwdDecl)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !440, file: !77, line: 276, baseType: !574, size: 32768, offset: 4928)
!574 = !DICompositeType(tag: DW_TAG_array_type, baseType: !488, size: 32768, elements: !575)
!575 = !{!576}
!576 = !DISubrange(count: 4096)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "magick_filename", scope: !440, file: !77, line: 277, baseType: !574, size: 32768, offset: 37696)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !440, file: !77, line: 278, baseType: !574, size: 32768, offset: 70464)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "magick_columns", scope: !440, file: !77, line: 281, baseType: !449, size: 64, offset: 103232)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "magick_rows", scope: !440, file: !77, line: 282, baseType: !449, size: 64, offset: 103296)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "exception", scope: !440, file: !77, line: 285, baseType: !582, size: 448, offset: 103360)
!582 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionInfo", file: !4, line: 219, baseType: !583)
!583 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ExceptionInfo", file: !253, line: 102, size: 448, elements: !584)
!584 = !{!585, !587, !589, !590, !591, !592, !593, !598}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "severity", scope: !583, file: !253, line: 105, baseType: !586, size: 32)
!586 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionType", file: !253, line: 100, baseType: !252)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "error_number", scope: !583, file: !253, line: 108, baseType: !588, size: 32, offset: 32)
!588 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !583, file: !253, line: 111, baseType: !487, size: 64, offset: 64)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !583, file: !253, line: 112, baseType: !487, size: 64, offset: 128)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "exceptions", scope: !583, file: !253, line: 115, baseType: !403, size: 64, offset: 192)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "relinquish", scope: !583, file: !253, line: 118, baseType: !454, size: 32, offset: 256)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !583, file: !253, line: 121, baseType: !594, size: 64, offset: 320)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 64)
!595 = !DIDerivedType(tag: DW_TAG_typedef, name: "SemaphoreInfo", file: !596, line: 26, baseType: !597)
!596 = !DIFile(filename: "./magick/semaphore.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!597 = !DICompositeType(tag: DW_TAG_structure_type, name: "SemaphoreInfo", file: !596, line: 25, flags: DIFlagFwdDecl)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !583, file: !253, line: 124, baseType: !449, size: 64, offset: 384)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !440, file: !77, line: 288, baseType: !454, size: 32, offset: 103808)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !440, file: !77, line: 291, baseType: !601, size: 64, offset: 103872)
!601 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !396)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !440, file: !77, line: 294, baseType: !594, size: 64, offset: 103936)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "color_profile", scope: !440, file: !77, line: 297, baseType: !604, size: 256, offset: 104000)
!604 = !DIDerivedType(tag: DW_TAG_typedef, name: "ProfileInfo", file: !89, line: 40, baseType: !605)
!605 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ProfileInfo", file: !89, line: 27, size: 256, elements: !606)
!606 = !{!607, !608, !609, !611}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !605, file: !89, line: 30, baseType: !487, size: 64)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !605, file: !89, line: 33, baseType: !449, size: 64, offset: 64)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !605, file: !89, line: 36, baseType: !610, size: 64, offset: 128)
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !605, file: !89, line: 39, baseType: !449, size: 64, offset: 192)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "iptc_profile", scope: !440, file: !77, line: 298, baseType: !604, size: 256, offset: 104256)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profile", scope: !440, file: !77, line: 299, baseType: !614, size: 64, offset: 104512)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 64)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profiles", scope: !440, file: !77, line: 302, baseType: !449, size: 64, offset: 104576)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !440, file: !77, line: 305, baseType: !449, size: 64, offset: 104640)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !440, file: !77, line: 308, baseType: !520, size: 64, offset: 104704)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !440, file: !77, line: 309, baseType: !520, size: 64, offset: 104768)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !440, file: !77, line: 310, baseType: !520, size: 64, offset: 104832)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "interpolate", scope: !440, file: !77, line: 313, baseType: !621, size: 32, offset: 104896)
!621 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterpolatePixelMethod", file: !326, line: 47, baseType: !325)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "black_point_compensation", scope: !440, file: !77, line: 316, baseType: !454, size: 32, offset: 104928)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_color", scope: !440, file: !77, line: 319, baseType: !426, size: 64, offset: 104960)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !440, file: !77, line: 322, baseType: !520, size: 64, offset: 105024)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "tile_offset", scope: !440, file: !77, line: 325, baseType: !495, size: 256, offset: 105088)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !440, file: !77, line: 328, baseType: !403, size: 64, offset: 105344)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "artifacts", scope: !440, file: !77, line: 329, baseType: !403, size: 64, offset: 105408)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !440, file: !77, line: 332, baseType: !629, size: 32, offset: 105472)
!629 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageType", file: !77, line: 61, baseType: !342)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !440, file: !77, line: 335, baseType: !454, size: 32, offset: 105504)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !440, file: !77, line: 338, baseType: !560, size: 64, offset: 105536)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "ping", scope: !440, file: !77, line: 341, baseType: !454, size: 32, offset: 105600)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !440, file: !77, line: 344, baseType: !449, size: 64, offset: 105664)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !440, file: !77, line: 347, baseType: !635, size: 64, offset: 105728)
!635 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !636, line: 7, baseType: !637)
!636 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "")
!637 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !399, line: 160, baseType: !400)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "intensity", scope: !440, file: !77, line: 350, baseType: !639, size: 32, offset: 105792)
!639 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelIntensityMethod", file: !326, line: 79, baseType: !356)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !440, file: !77, line: 353, baseType: !449, size: 64, offset: 105856)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64)
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 64)
!643 = !DIDerivedType(tag: DW_TAG_typedef, name: "IntervalTree", file: !1, line: 165, baseType: !644)
!644 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IntervalTree", file: !1, line: 149, size: 384, elements: !645)
!645 = !{!646, !647, !648, !649, !650, !651, !653}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "tau", scope: !644, file: !1, line: 152, baseType: !415, size: 32)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !644, file: !1, line: 155, baseType: !396, size: 64, offset: 64)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !644, file: !1, line: 156, baseType: !396, size: 64, offset: 128)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "mean_stability", scope: !644, file: !1, line: 159, baseType: !415, size: 32, offset: 192)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "stability", scope: !644, file: !1, line: 160, baseType: !415, size: 32, offset: 224)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "sibling", scope: !644, file: !1, line: 163, baseType: !652, size: 64, offset: 256)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 64)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !644, file: !1, line: 164, baseType: !652, size: 64, offset: 320)
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 64)
!655 = !DIDerivedType(tag: DW_TAG_typedef, name: "ZeroCrossing", file: !1, line: 175, baseType: !656)
!656 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ZeroCrossing", file: !1, line: 167, size: 12320, elements: !657)
!657 = !{!658, !659, !663}
!658 = !DIDerivedType(tag: DW_TAG_member, name: "tau", scope: !656, file: !1, line: 170, baseType: !415, size: 32)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "histogram", scope: !656, file: !1, line: 171, baseType: !660, size: 8192, offset: 32)
!660 = !DICompositeType(tag: DW_TAG_array_type, baseType: !415, size: 8192, elements: !661)
!661 = !{!662}
!662 = !DISubrange(count: 256)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "crossings", scope: !656, file: !1, line: 174, baseType: !664, size: 4096, offset: 8224)
!664 = !DICompositeType(tag: DW_TAG_array_type, baseType: !402, size: 4096, elements: !661)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64)
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64)
!668 = !DIDerivedType(tag: DW_TAG_typedef, name: "IndexPacket", file: !326, line: 129, baseType: !430)
!669 = !{!670, !673, !675, !677, !679}
!670 = !DIGlobalVariableExpression(var: !671, expr: !DIExpression(DW_OP_constu, 0, DW_OP_stack_value))
!671 = distinct !DIGlobalVariable(name: "Red", scope: !0, file: !1, line: 183, type: !672, isLocal: true, isDefinition: true)
!672 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !588)
!673 = !DIGlobalVariableExpression(var: !674, expr: !DIExpression(DW_OP_constu, 1, DW_OP_stack_value))
!674 = distinct !DIGlobalVariable(name: "Green", scope: !0, file: !1, line: 182, type: !672, isLocal: true, isDefinition: true)
!675 = !DIGlobalVariableExpression(var: !676, expr: !DIExpression(DW_OP_constu, 2, DW_OP_stack_value))
!676 = distinct !DIGlobalVariable(name: "Blue", scope: !0, file: !1, line: 181, type: !672, isLocal: true, isDefinition: true)
!677 = !DIGlobalVariableExpression(var: !678, expr: !DIExpression(DW_OP_constu, 3, DW_OP_stack_value))
!678 = distinct !DIGlobalVariable(name: "SafeMargin", scope: !0, file: !1, line: 184, type: !672, isLocal: true, isDefinition: true)
!679 = !DIGlobalVariableExpression(var: !680, expr: !DIExpression(DW_OP_constu, 600, DW_OP_stack_value))
!680 = distinct !DIGlobalVariable(name: "TreeLength", scope: !0, file: !1, line: 185, type: !672, isLocal: true, isDefinition: true)
!681 = !{i32 7, !"Dwarf Version", i32 4}
!682 = !{i32 2, !"Debug Info Version", i32 3}
!683 = !{i32 1, !"wchar_size", i32 4}
!684 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!685 = distinct !DISubprogram(name: "GetImageDynamicThreshold", scope: !1, file: !1, line: 951, type: !686, scopeLine: 954, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !706)
!686 = !DISubroutineType(types: !687)
!687 = !{!454, !688, !690, !690, !691, !705}
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 64)
!689 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !439)
!690 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !466)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 64)
!692 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickPixelPacket", file: !326, line: 127, baseType: !693)
!693 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MagickPixelPacket", file: !326, line: 104, size: 448, elements: !694)
!694 = !{!695, !696, !697, !698, !699, !700, !701, !702, !703, !704}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "storage_class", scope: !693, file: !326, line: 107, baseType: !443, size: 32)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !693, file: !326, line: 110, baseType: !445, size: 32, offset: 32)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "matte", scope: !693, file: !326, line: 113, baseType: !454, size: 32, offset: 64)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !693, file: !326, line: 116, baseType: !466, size: 64, offset: 128)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !693, file: !326, line: 119, baseType: !449, size: 64, offset: 192)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !693, file: !326, line: 122, baseType: !415, size: 32, offset: 256)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !693, file: !326, line: 123, baseType: !415, size: 32, offset: 288)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !693, file: !326, line: 124, baseType: !415, size: 32, offset: 320)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !693, file: !326, line: 125, baseType: !415, size: 32, offset: 352)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !693, file: !326, line: 126, baseType: !415, size: 32, offset: 384)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64)
!706 = !{}
!707 = !DILocalVariable(name: "image", arg: 1, scope: !685, file: !1, line: 951, type: !688)
!708 = !DILocation(line: 951, column: 70, scope: !685)
!709 = !DILocalVariable(name: "cluster_threshold", arg: 2, scope: !685, file: !1, line: 952, type: !690)
!710 = !DILocation(line: 952, column: 16, scope: !685)
!711 = !DILocalVariable(name: "smooth_threshold", arg: 3, scope: !685, file: !1, line: 952, type: !690)
!712 = !DILocation(line: 952, column: 47, scope: !685)
!713 = !DILocalVariable(name: "pixel", arg: 4, scope: !685, file: !1, line: 953, type: !691)
!714 = !DILocation(line: 953, column: 22, scope: !685)
!715 = !DILocalVariable(name: "exception", arg: 5, scope: !685, file: !1, line: 953, type: !705)
!716 = !DILocation(line: 953, column: 43, scope: !685)
!717 = !DILocalVariable(name: "background", scope: !685, file: !1, line: 956, type: !404)
!718 = !DILocation(line: 956, column: 6, scope: !685)
!719 = !DILocalVariable(name: "cluster", scope: !685, file: !1, line: 957, type: !404)
!720 = !DILocation(line: 957, column: 6, scope: !685)
!721 = !DILocalVariable(name: "object", scope: !685, file: !1, line: 958, type: !404)
!722 = !DILocation(line: 958, column: 6, scope: !685)
!723 = !DILocalVariable(name: "head", scope: !685, file: !1, line: 959, type: !404)
!724 = !DILocation(line: 959, column: 6, scope: !685)
!725 = !DILocalVariable(name: "last_cluster", scope: !685, file: !1, line: 960, type: !404)
!726 = !DILocation(line: 960, column: 6, scope: !685)
!727 = !DILocalVariable(name: "next_cluster", scope: !685, file: !1, line: 961, type: !404)
!728 = !DILocation(line: 961, column: 6, scope: !685)
!729 = !DILocalVariable(name: "blue", scope: !685, file: !1, line: 964, type: !411)
!730 = !DILocation(line: 964, column: 5, scope: !685)
!731 = !DILocalVariable(name: "green", scope: !685, file: !1, line: 965, type: !411)
!732 = !DILocation(line: 965, column: 5, scope: !685)
!733 = !DILocalVariable(name: "red", scope: !685, file: !1, line: 966, type: !411)
!734 = !DILocation(line: 966, column: 5, scope: !685)
!735 = !DILocalVariable(name: "proceed", scope: !685, file: !1, line: 969, type: !454)
!736 = !DILocation(line: 969, column: 5, scope: !685)
!737 = !DILocalVariable(name: "threshold", scope: !685, file: !1, line: 972, type: !415)
!738 = !DILocation(line: 972, column: 5, scope: !685)
!739 = !DILocalVariable(name: "p", scope: !685, file: !1, line: 975, type: !424)
!740 = !DILocation(line: 975, column: 6, scope: !685)
!741 = !DILocalVariable(name: "i", scope: !685, file: !1, line: 978, type: !396)
!742 = !DILocation(line: 978, column: 5, scope: !685)
!743 = !DILocalVariable(name: "x", scope: !685, file: !1, line: 979, type: !396)
!744 = !DILocation(line: 979, column: 5, scope: !685)
!745 = !DILocalVariable(name: "extrema", scope: !685, file: !1, line: 982, type: !746)
!746 = !DICompositeType(tag: DW_TAG_array_type, baseType: !401, size: 192, elements: !747)
!747 = !{!748}
!748 = !DISubrange(count: 3)
!749 = !DILocation(line: 982, column: 6, scope: !685)
!750 = !DILocalVariable(name: "count", scope: !685, file: !1, line: 985, type: !396)
!751 = !DILocation(line: 985, column: 5, scope: !685)
!752 = !DILocalVariable(name: "histogram", scope: !685, file: !1, line: 986, type: !753)
!753 = !DICompositeType(tag: DW_TAG_array_type, baseType: !395, size: 192, elements: !747)
!754 = !DILocation(line: 986, column: 6, scope: !685)
!755 = !DILocalVariable(name: "y", scope: !685, file: !1, line: 987, type: !396)
!756 = !DILocation(line: 987, column: 5, scope: !685)
!757 = !DILocation(line: 994, column: 7, scope: !758)
!758 = distinct !DILexicalBlock(scope: !685, file: !1, line: 994, column: 7)
!759 = !DILocation(line: 994, column: 14, scope: !758)
!760 = !DILocation(line: 994, column: 20, scope: !758)
!761 = !DILocation(line: 994, column: 7, scope: !685)
