; ModuleID = 'magick/color.c'
source_filename = "magick/color.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.SemaphoreInfo = type opaque
%struct._LinkedListInfo = type opaque
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct._ColorMapInfo = type { i8*, i8, i8, i8, float, i64 }
%struct._ColorInfo = type { i8*, i8*, i32, %struct._MagickPixelPacket, i32, i32, %struct._ColorInfo*, %struct._ColorInfo*, i64 }
%struct._MagickPixelPacket = type { i32, i32, i32, double, i64, float, float, float, float, float }
%struct._ExceptionInfo = type { i32, i32, i8*, i8*, i8*, i32, %struct.SemaphoreInfo*, i64 }

!505 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !475, line: 67, baseType: !7, size: 32, elements: !506)
!506 = !{!507, !508, !509, !510, !511, !512, !513, !514, !515, !516}
!507 = !DIEnumerator(name: "UndefinedPixelIntensityMethod", value: 0, isUnsigned: true)
!508 = !DIEnumerator(name: "AveragePixelIntensityMethod", value: 1, isUnsigned: true)
!509 = !DIEnumerator(name: "BrightnessPixelIntensityMethod", value: 2, isUnsigned: true)
!510 = !DIEnumerator(name: "LightnessPixelIntensityMethod", value: 3, isUnsigned: true)
!511 = !DIEnumerator(name: "Rec601LumaPixelIntensityMethod", value: 4, isUnsigned: true)
!512 = !DIEnumerator(name: "Rec601LuminancePixelIntensityMethod", value: 5, isUnsigned: true)
!513 = !DIEnumerator(name: "Rec709LumaPixelIntensityMethod", value: 6, isUnsigned: true)
!514 = !DIEnumerator(name: "Rec709LuminancePixelIntensityMethod", value: 7, isUnsigned: true)
!515 = !DIEnumerator(name: "RMSPixelIntensityMethod", value: 8, isUnsigned: true)
!516 = !DIEnumerator(name: "MSPixelIntensityMethod", value: 9, isUnsigned: true)
!517 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !375, line: 25, baseType: !7, size: 32, elements: !518)
!518 = !{!519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544}
!519 = !DIEnumerator(name: "NoValue", value: 0, isUnsigned: true)
!520 = !DIEnumerator(name: "XValue", value: 1, isUnsigned: true)
!521 = !DIEnumerator(name: "XiValue", value: 1, isUnsigned: true)
!522 = !DIEnumerator(name: "YValue", value: 2, isUnsigned: true)
!523 = !DIEnumerator(name: "PsiValue", value: 2, isUnsigned: true)
!524 = !DIEnumerator(name: "WidthValue", value: 4, isUnsigned: true)
!525 = !DIEnumerator(name: "RhoValue", value: 4, isUnsigned: true)
!526 = !DIEnumerator(name: "HeightValue", value: 8, isUnsigned: true)
!527 = !DIEnumerator(name: "SigmaValue", value: 8, isUnsigned: true)
!528 = !DIEnumerator(name: "ChiValue", value: 16, isUnsigned: true)
!529 = !DIEnumerator(name: "XiNegative", value: 32, isUnsigned: true)
!530 = !DIEnumerator(name: "XNegative", value: 32, isUnsigned: true)
!531 = !DIEnumerator(name: "PsiNegative", value: 64, isUnsigned: true)
!532 = !DIEnumerator(name: "YNegative", value: 64, isUnsigned: true)
!533 = !DIEnumerator(name: "ChiNegative", value: 128, isUnsigned: true)
!534 = !DIEnumerator(name: "PercentValue", value: 4096, isUnsigned: true)
!535 = !DIEnumerator(name: "AspectValue", value: 8192, isUnsigned: true)
!536 = !DIEnumerator(name: "NormalizeValue", value: 8192, isUnsigned: true)
!537 = !DIEnumerator(name: "LessValue", value: 16384, isUnsigned: true)
!538 = !DIEnumerator(name: "GreaterValue", value: 32768, isUnsigned: true)
!539 = !DIEnumerator(name: "MinimumValue", value: 65536, isUnsigned: true)
!540 = !DIEnumerator(name: "CorrelateNormalizeValue", value: 65536, isUnsigned: true)
!541 = !DIEnumerator(name: "AreaValue", value: 131072, isUnsigned: true)
!542 = !DIEnumerator(name: "DecimalValue", value: 262144, isUnsigned: true)
!543 = !DIEnumerator(name: "SeparatorValue", value: 524288, isUnsigned: true)
!544 = !DIEnumerator(name: "AllValues", value: 2147483647, isUnsigned: true)
!545 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !546, line: 25, baseType: !7, size: 32, elements: !547)
!546 = !DIFile(filename: "./magick/utility.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!547 = !{!548, !549, !550, !551, !552, !553, !554, !555, !556}
!548 = !DIEnumerator(name: "UndefinedPath", value: 0, isUnsigned: true)
!549 = !DIEnumerator(name: "MagickPath", value: 1, isUnsigned: true)
!550 = !DIEnumerator(name: "RootPath", value: 2, isUnsigned: true)
!551 = !DIEnumerator(name: "HeadPath", value: 3, isUnsigned: true)
!552 = !DIEnumerator(name: "TailPath", value: 4, isUnsigned: true)
!553 = !DIEnumerator(name: "BasePath", value: 5, isUnsigned: true)
!554 = !DIEnumerator(name: "ExtensionPath", value: 6, isUnsigned: true)
!555 = !DIEnumerator(name: "SubimagePath", value: 7, isUnsigned: true)
!556 = !DIEnumerator(name: "CanonicalPath", value: 8, isUnsigned: true)
!557 = !{!558, !562, !563, !567, !607, !199, !609, !610, !611, !593, !612, !589, !613, !591, !614, !573, !595, !615, !620, !626, !631, !685, !687, !585, !7, !872, !873, !577, !883, !629}
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 64)
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "SemaphoreInfo", file: !560, line: 26, baseType: !561)
!560 = !DIFile(filename: "./magick/semaphore.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!561 = !DICompositeType(tag: DW_TAG_structure_type, name: "SemaphoreInfo", file: !560, line: 25, flags: DIFlagFwdDecl)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64)
!564 = !DIDerivedType(tag: DW_TAG_typedef, name: "LinkedListInfo", file: !565, line: 34, baseType: !566)
!565 = !DIFile(filename: "./magick/hashmap.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!566 = !DICompositeType(tag: DW_TAG_structure_type, name: "_LinkedListInfo", file: !565, line: 33, flags: DIFlagFwdDecl)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!568 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !569)
!569 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorInfo", file: !12, line: 60, baseType: !570)
!570 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ColorInfo", file: !12, line: 38, size: 896, elements: !571)
!571 = !{!572, !575, !576, !578, !601, !602, !603, !605, !606}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !570, file: !12, line: 41, baseType: !573, size: 64)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64)
!574 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !570, file: !12, line: 42, baseType: !573, size: 64, offset: 64)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "compliance", scope: !570, file: !12, line: 45, baseType: !577, size: 32, offset: 128)
!577 = !DIDerivedType(tag: DW_TAG_typedef, name: "ComplianceType", file: !12, line: 36, baseType: !11)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !570, file: !12, line: 48, baseType: !579, size: 448, offset: 192)
!579 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickPixelPacket", file: !475, line: 127, baseType: !580)
!580 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MagickPixelPacket", file: !475, line: 104, size: 448, elements: !581)
!581 = !{!582, !584, !586, !588, !590, !594, !597, !598, !599, !600}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "storage_class", scope: !580, file: !475, line: 107, baseType: !583, size: 32)
!583 = !DIDerivedType(tag: DW_TAG_typedef, name: "ClassType", file: !6, line: 209, baseType: !20)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !580, file: !475, line: 110, baseType: !585, size: 32, offset: 32)
!585 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorspaceType", file: !26, line: 61, baseType: !25)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "matte", scope: !580, file: !475, line: 113, baseType: !587, size: 32, offset: 64)
!587 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickBooleanType", file: !6, line: 215, baseType: !5)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !580, file: !475, line: 116, baseType: !589, size: 64, offset: 128)
!589 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !580, file: !475, line: 119, baseType: !591, size: 64, offset: 192)
!591 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !592, line: 46, baseType: !593)
!592 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!593 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !580, file: !475, line: 122, baseType: !595, size: 32, offset: 256)
!595 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickRealType", file: !6, line: 78, baseType: !596)
!596 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !580, file: !475, line: 123, baseType: !595, size: 32, offset: 288)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !580, file: !475, line: 124, baseType: !595, size: 32, offset: 320)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !580, file: !475, line: 125, baseType: !595, size: 32, offset: 352)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !580, file: !475, line: 126, baseType: !595, size: 32, offset: 384)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "exempt", scope: !570, file: !12, line: 51, baseType: !587, size: 32, offset: 640)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "stealth", scope: !570, file: !12, line: 52, baseType: !587, size: 32, offset: 672)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !570, file: !12, line: 55, baseType: !604, size: 64, offset: 704)
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 64)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !570, file: !12, line: 56, baseType: !604, size: 64, offset: 768)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !570, file: !12, line: 59, baseType: !591, size: 64, offset: 832)
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64)
!608 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !574)
!609 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!610 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64)
!612 = !DIDerivedType(tag: DW_TAG_typedef, name: "Quantum", file: !6, line: 93, baseType: !610)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 64)
!615 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !616, line: 77, baseType: !617)
!616 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!617 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !618, line: 193, baseType: !619)
!618 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!619 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!620 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickProgressMonitor", file: !621, line: 26, baseType: !622)
!621 = !DIFile(filename: "./magick/monitor.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 64)
!623 = !DISubroutineType(types: !624)
!624 = !{!587, !607, !625, !628, !562}
!625 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !626)
!626 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickOffsetType", file: !6, line: 150, baseType: !627)
!627 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!628 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !629)
!629 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickSizeType", file: !6, line: 151, baseType: !630)
!630 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64)
!632 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !633)
!633 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !634, line: 7, baseType: !635)
!634 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!635 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !636, line: 49, size: 1728, elements: !637)
!636 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!637 = !{!638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !653, !655, !656, !657, !659, !660, !662, !666, !669, !671, !674, !677, !678, !679, !680, !681}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !635, file: !636, line: 51, baseType: !199, size: 32)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !635, file: !636, line: 54, baseType: !573, size: 64, offset: 64)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !635, file: !636, line: 55, baseType: !573, size: 64, offset: 128)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !635, file: !636, line: 56, baseType: !573, size: 64, offset: 192)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !635, file: !636, line: 57, baseType: !573, size: 64, offset: 256)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !635, file: !636, line: 58, baseType: !573, size: 64, offset: 320)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !635, file: !636, line: 59, baseType: !573, size: 64, offset: 384)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !635, file: !636, line: 60, baseType: !573, size: 64, offset: 448)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !635, file: !636, line: 61, baseType: !573, size: 64, offset: 512)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !635, file: !636, line: 64, baseType: !573, size: 64, offset: 576)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !635, file: !636, line: 65, baseType: !573, size: 64, offset: 640)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !635, file: !636, line: 66, baseType: !573, size: 64, offset: 704)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !635, file: !636, line: 68, baseType: !651, size: 64, offset: 768)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64)
!652 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !636, line: 36, flags: DIFlagFwdDecl)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !635, file: !636, line: 70, baseType: !654, size: 64, offset: 832)
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !635, file: !636, line: 72, baseType: !199, size: 32, offset: 896)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !635, file: !636, line: 73, baseType: !199, size: 32, offset: 928)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !635, file: !636, line: 74, baseType: !658, size: 64, offset: 960)
!658 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !618, line: 152, baseType: !619)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !635, file: !636, line: 77, baseType: !610, size: 16, offset: 1024)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !635, file: !636, line: 78, baseType: !661, size: 8, offset: 1040)
!661 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !635, file: !636, line: 79, baseType: !663, size: 8, offset: 1048)
!663 = !DICompositeType(tag: DW_TAG_array_type, baseType: !574, size: 8, elements: !664)
!664 = !{!665}
!665 = !DISubrange(count: 1)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !635, file: !636, line: 81, baseType: !667, size: 64, offset: 1088)
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64)
!668 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !636, line: 43, baseType: null)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !635, file: !636, line: 89, baseType: !670, size: 64, offset: 1152)
!670 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !618, line: 153, baseType: !619)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !635, file: !636, line: 91, baseType: !672, size: 64, offset: 1216)
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 64)
!673 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !636, line: 37, flags: DIFlagFwdDecl)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !635, file: !636, line: 92, baseType: !675, size: 64, offset: 1280)
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !676, size: 64)
!676 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !636, line: 38, flags: DIFlagFwdDecl)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !635, file: !636, line: 93, baseType: !654, size: 64, offset: 1344)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !635, file: !636, line: 94, baseType: !562, size: 64, offset: 1408)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !635, file: !636, line: 95, baseType: !591, size: 64, offset: 1472)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !635, file: !636, line: 96, baseType: !199, size: 32, offset: 1536)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !635, file: !636, line: 98, baseType: !682, size: 160, offset: 1568)
!682 = !DICompositeType(tag: DW_TAG_array_type, baseType: !574, size: 160, elements: !683)
!683 = !{!684}
!684 = !DISubrange(count: 20)
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !686, size: 64)
!686 = !DIDerivedType(tag: DW_TAG_typedef, name: "IndexPacket", file: !475, line: 129, baseType: !612)
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 64)
!688 = !DIDerivedType(tag: DW_TAG_typedef, name: "Image", file: !6, line: 221, baseType: !689)
!689 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Image", file: !299, line: 150, size: 105920, elements: !690)
!690 = !{!691, !692, !693, !695, !696, !698, !699, !700, !701, !702, !703, !704, !713, !714, !715, !716, !717, !731, !733, !734, !736, !737, !738, !739, !740, !741, !742, !750, !751, !752, !753, !754, !755, !757, !759, !761, !763, !765, !767, !769, !770, !771, !772, !773, !774, !775, !782, !797, !798, !799, !800, !801, !805, !809, !813, !814, !815, !816, !817, !830, !831, !833, !834, !843, !844, !846, !847, !848, !849, !850, !851, !853, !854, !855, !856, !857, !858, !859, !861, !862, !863, !864, !865, !869, !871}
!691 = !DIDerivedType(tag: DW_TAG_member, name: "storage_class", scope: !689, file: !299, line: 153, baseType: !583, size: 32)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !689, file: !299, line: 156, baseType: !585, size: 32, offset: 32)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !689, file: !299, line: 159, baseType: !694, size: 32, offset: 64)
!694 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompressionType", file: !274, line: 49, baseType: !273)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !689, file: !299, line: 162, baseType: !591, size: 64, offset: 128)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !689, file: !299, line: 165, baseType: !697, size: 32, offset: 192)
!697 = !DIDerivedType(tag: DW_TAG_typedef, name: "OrientationType", file: !299, line: 86, baseType: !298)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "taint", scope: !689, file: !299, line: 168, baseType: !587, size: 32, offset: 224)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "matte", scope: !689, file: !299, line: 169, baseType: !587, size: 32, offset: 256)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !689, file: !299, line: 172, baseType: !591, size: 64, offset: 320)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !689, file: !299, line: 173, baseType: !591, size: 64, offset: 384)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !689, file: !299, line: 174, baseType: !591, size: 64, offset: 448)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !689, file: !299, line: 175, baseType: !591, size: 64, offset: 512)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "colormap", scope: !689, file: !299, line: 178, baseType: !705, size: 64, offset: 576)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 64)
!706 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelPacket", file: !475, line: 148, baseType: !707)
!707 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PixelPacket", file: !475, line: 131, size: 64, elements: !708)
!708 = !{!709, !710, !711, !712}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !707, file: !475, line: 143, baseType: !612, size: 16)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !707, file: !475, line: 144, baseType: !612, size: 16, offset: 16)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !707, file: !475, line: 145, baseType: !612, size: 16, offset: 32)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !707, file: !475, line: 146, baseType: !612, size: 16, offset: 48)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "background_color", scope: !689, file: !299, line: 179, baseType: !706, size: 64, offset: 640)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !689, file: !299, line: 180, baseType: !706, size: 64, offset: 704)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "matte_color", scope: !689, file: !299, line: 181, baseType: !706, size: 64, offset: 768)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !689, file: !299, line: 184, baseType: !589, size: 64, offset: 832)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "chromaticity", scope: !689, file: !299, line: 187, baseType: !718, size: 768, offset: 896)
!718 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChromaticityInfo", file: !299, line: 128, baseType: !719)
!719 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ChromaticityInfo", file: !299, line: 121, size: 768, elements: !720)
!720 = !{!721, !728, !729, !730}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "red_primary", scope: !719, file: !299, line: 124, baseType: !722, size: 192)
!722 = !DIDerivedType(tag: DW_TAG_typedef, name: "PrimaryInfo", file: !299, line: 101, baseType: !723)
!723 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PrimaryInfo", file: !299, line: 95, size: 192, elements: !724)
!724 = !{!725, !726, !727}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !723, file: !299, line: 98, baseType: !589, size: 64)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !723, file: !299, line: 99, baseType: !589, size: 64, offset: 64)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !723, file: !299, line: 100, baseType: !589, size: 64, offset: 128)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "green_primary", scope: !719, file: !299, line: 125, baseType: !722, size: 192, offset: 192)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "blue_primary", scope: !719, file: !299, line: 126, baseType: !722, size: 192, offset: 384)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "white_point", scope: !719, file: !299, line: 127, baseType: !722, size: 192, offset: 576)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "rendering_intent", scope: !689, file: !299, line: 190, baseType: !732, size: 32, offset: 1664)
!732 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderingIntent", file: !311, line: 49, baseType: !310)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !689, file: !299, line: 193, baseType: !562, size: 64, offset: 1728)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !689, file: !299, line: 196, baseType: !735, size: 32, offset: 1792)
!735 = !DIDerivedType(tag: DW_TAG_typedef, name: "ResolutionType", file: !299, line: 93, baseType: !318)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "montage", scope: !689, file: !299, line: 199, baseType: !573, size: 64, offset: 1856)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "directory", scope: !689, file: !299, line: 200, baseType: !573, size: 64, offset: 1920)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "geometry", scope: !689, file: !299, line: 201, baseType: !573, size: 64, offset: 1984)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !689, file: !299, line: 204, baseType: !615, size: 64, offset: 2048)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "x_resolution", scope: !689, file: !299, line: 207, baseType: !589, size: 64, offset: 2112)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "y_resolution", scope: !689, file: !299, line: 208, baseType: !589, size: 64, offset: 2176)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !689, file: !299, line: 211, baseType: !743, size: 256, offset: 2240)
!743 = !DIDerivedType(tag: DW_TAG_typedef, name: "RectangleInfo", file: !375, line: 130, baseType: !744)
!744 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_RectangleInfo", file: !375, line: 121, size: 256, elements: !745)
!745 = !{!746, !747, !748, !749}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !744, file: !375, line: 124, baseType: !591, size: 64)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !744, file: !375, line: 125, baseType: !591, size: 64, offset: 64)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !744, file: !375, line: 128, baseType: !615, size: 64, offset: 128)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !744, file: !375, line: 129, baseType: !615, size: 64, offset: 192)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "extract_info", scope: !689, file: !299, line: 212, baseType: !743, size: 256, offset: 2496)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "tile_info", scope: !689, file: !299, line: 213, baseType: !743, size: 256, offset: 2752)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "bias", scope: !689, file: !299, line: 216, baseType: !589, size: 64, offset: 3008)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "blur", scope: !689, file: !299, line: 217, baseType: !589, size: 64, offset: 3072)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !689, file: !299, line: 218, baseType: !589, size: 64, offset: 3136)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !689, file: !299, line: 221, baseType: !756, size: 32, offset: 3200)
!756 = !DIDerivedType(tag: DW_TAG_typedef, name: "FilterTypes", file: !324, line: 66, baseType: !323)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "interlace", scope: !689, file: !299, line: 224, baseType: !758, size: 32, offset: 3232)
!758 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterlaceType", file: !299, line: 73, baseType: !358)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !689, file: !299, line: 227, baseType: !760, size: 32, offset: 3264)
!760 = !DIDerivedType(tag: DW_TAG_typedef, name: "EndianType", file: !369, line: 35, baseType: !368)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !689, file: !299, line: 230, baseType: !762, size: 32, offset: 3296)
!762 = !DIDerivedType(tag: DW_TAG_typedef, name: "GravityType", file: !375, line: 91, baseType: !374)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !689, file: !299, line: 233, baseType: !764, size: 32, offset: 3328)
!764 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompositeOperator", file: !390, line: 99, baseType: !389)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "dispose", scope: !689, file: !299, line: 236, baseType: !766, size: 32, offset: 3360)
!766 = !DIDerivedType(tag: DW_TAG_typedef, name: "DisposeType", file: !461, line: 32, baseType: !460)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "clip_mask", scope: !689, file: !299, line: 239, baseType: !768, size: 64, offset: 3392)
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 64)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !689, file: !299, line: 242, baseType: !591, size: 64, offset: 3456)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !689, file: !299, line: 243, baseType: !591, size: 64, offset: 3520)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_second", scope: !689, file: !299, line: 246, baseType: !615, size: 64, offset: 3584)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "iterations", scope: !689, file: !299, line: 249, baseType: !591, size: 64, offset: 3648)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "total_colors", scope: !689, file: !299, line: 250, baseType: !591, size: 64, offset: 3712)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "start_loop", scope: !689, file: !299, line: 253, baseType: !615, size: 64, offset: 3776)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !689, file: !299, line: 256, baseType: !776, size: 192, offset: 3840)
!776 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErrorInfo", file: !12, line: 68, baseType: !777)
!777 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ErrorInfo", file: !12, line: 62, size: 192, elements: !778)
!778 = !{!779, !780, !781}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "mean_error_per_pixel", scope: !777, file: !12, line: 65, baseType: !589, size: 64)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_mean_error", scope: !777, file: !12, line: 66, baseType: !589, size: 64, offset: 64)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_maximum_error", scope: !777, file: !12, line: 67, baseType: !589, size: 64, offset: 128)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !689, file: !299, line: 259, baseType: !783, size: 512, offset: 4032)
!783 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerInfo", file: !469, line: 51, baseType: !784)
!784 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TimerInfo", file: !469, line: 40, size: 512, elements: !785)
!785 = !{!786, !793, !794, !796}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !784, file: !469, line: 43, baseType: !787, size: 192)
!787 = !DIDerivedType(tag: DW_TAG_typedef, name: "Timer", file: !469, line: 38, baseType: !788)
!788 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Timer", file: !469, line: 32, size: 192, elements: !789)
!789 = !{!790, !791, !792}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !788, file: !469, line: 35, baseType: !589, size: 64)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !788, file: !469, line: 36, baseType: !589, size: 64, offset: 64)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !788, file: !469, line: 37, baseType: !589, size: 64, offset: 128)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "elapsed", scope: !784, file: !469, line: 44, baseType: !787, size: 192, offset: 192)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !784, file: !469, line: 47, baseType: !795, size: 32, offset: 384)
!795 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerState", file: !469, line: 30, baseType: !468)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !784, file: !469, line: 50, baseType: !591, size: 64, offset: 448)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !689, file: !299, line: 262, baseType: !620, size: 64, offset: 4544)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !689, file: !299, line: 265, baseType: !562, size: 64, offset: 4608)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !689, file: !299, line: 266, baseType: !562, size: 64, offset: 4672)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !689, file: !299, line: 267, baseType: !562, size: 64, offset: 4736)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "ascii85", scope: !689, file: !299, line: 270, baseType: !802, size: 64, offset: 4800)
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !803, size: 64)
!803 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ascii85Info", file: !274, line: 52, baseType: !804)
!804 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Ascii85Info", file: !274, line: 51, flags: DIFlagFwdDecl)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !689, file: !299, line: 273, baseType: !806, size: 64, offset: 4864)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 64)
!807 = !DIDerivedType(tag: DW_TAG_typedef, name: "BlobInfo", file: !6, line: 217, baseType: !808)
!808 = !DICompositeType(tag: DW_TAG_structure_type, name: "_BlobInfo", file: !6, line: 217, flags: DIFlagFwdDecl)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !689, file: !299, line: 276, baseType: !810, size: 32768, offset: 4928)
!810 = !DICompositeType(tag: DW_TAG_array_type, baseType: !574, size: 32768, elements: !811)
!811 = !{!812}
!812 = !DISubrange(count: 4096)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "magick_filename", scope: !689, file: !299, line: 277, baseType: !810, size: 32768, offset: 37696)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !689, file: !299, line: 278, baseType: !810, size: 32768, offset: 70464)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "magick_columns", scope: !689, file: !299, line: 281, baseType: !591, size: 64, offset: 103232)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "magick_rows", scope: !689, file: !299, line: 282, baseType: !591, size: 64, offset: 103296)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "exception", scope: !689, file: !299, line: 285, baseType: !818, size: 448, offset: 103360)
!818 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionInfo", file: !6, line: 219, baseType: !819)
!819 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ExceptionInfo", file: !63, line: 102, size: 448, elements: !820)
!820 = !{!821, !823, !824, !825, !826, !827, !828, !829}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "severity", scope: !819, file: !63, line: 105, baseType: !822, size: 32)
!822 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionType", file: !63, line: 100, baseType: !62)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "error_number", scope: !819, file: !63, line: 108, baseType: !199, size: 32, offset: 32)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !819, file: !63, line: 111, baseType: !573, size: 64, offset: 64)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !819, file: !63, line: 112, baseType: !573, size: 64, offset: 128)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "exceptions", scope: !819, file: !63, line: 115, baseType: !562, size: 64, offset: 192)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "relinquish", scope: !819, file: !63, line: 118, baseType: !587, size: 32, offset: 256)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !819, file: !63, line: 121, baseType: !558, size: 64, offset: 320)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !819, file: !63, line: 124, baseType: !591, size: 64, offset: 384)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !689, file: !299, line: 288, baseType: !587, size: 32, offset: 103808)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !689, file: !299, line: 291, baseType: !832, size: 64, offset: 103872)
!832 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !615)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !689, file: !299, line: 294, baseType: !558, size: 64, offset: 103936)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "color_profile", scope: !689, file: !299, line: 297, baseType: !835, size: 256, offset: 104000)
!835 = !DIDerivedType(tag: DW_TAG_typedef, name: "ProfileInfo", file: !311, line: 40, baseType: !836)
!836 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ProfileInfo", file: !311, line: 27, size: 256, elements: !837)
!837 = !{!838, !839, !840, !842}
!838 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !836, file: !311, line: 30, baseType: !573, size: 64)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !836, file: !311, line: 33, baseType: !591, size: 64, offset: 64)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !836, file: !311, line: 36, baseType: !841, size: 64, offset: 128)
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !836, file: !311, line: 39, baseType: !591, size: 64, offset: 192)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "iptc_profile", scope: !689, file: !299, line: 298, baseType: !835, size: 256, offset: 104256)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profile", scope: !689, file: !299, line: 299, baseType: !845, size: 64, offset: 104512)
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !835, size: 64)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profiles", scope: !689, file: !299, line: 302, baseType: !591, size: 64, offset: 104576)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !689, file: !299, line: 305, baseType: !591, size: 64, offset: 104640)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !689, file: !299, line: 308, baseType: !768, size: 64, offset: 104704)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !689, file: !299, line: 309, baseType: !768, size: 64, offset: 104768)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !689, file: !299, line: 310, baseType: !768, size: 64, offset: 104832)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "interpolate", scope: !689, file: !299, line: 313, baseType: !852, size: 32, offset: 104896)
!852 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterpolatePixelMethod", file: !475, line: 47, baseType: !474)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "black_point_compensation", scope: !689, file: !299, line: 316, baseType: !587, size: 32, offset: 104928)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_color", scope: !689, file: !299, line: 319, baseType: !706, size: 64, offset: 104960)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !689, file: !299, line: 322, baseType: !768, size: 64, offset: 105024)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "tile_offset", scope: !689, file: !299, line: 325, baseType: !743, size: 256, offset: 105088)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !689, file: !299, line: 328, baseType: !562, size: 64, offset: 105344)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "artifacts", scope: !689, file: !299, line: 329, baseType: !562, size: 64, offset: 105408)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !689, file: !299, line: 332, baseType: !860, size: 32, offset: 105472)
!860 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageType", file: !299, line: 61, baseType: !491)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !689, file: !299, line: 335, baseType: !587, size: 32, offset: 105504)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !689, file: !299, line: 338, baseType: !629, size: 64, offset: 105536)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "ping", scope: !689, file: !299, line: 341, baseType: !587, size: 32, offset: 105600)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !689, file: !299, line: 344, baseType: !591, size: 64, offset: 105664)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !689, file: !299, line: 347, baseType: !866, size: 64, offset: 105728)
!866 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !867, line: 7, baseType: !868)
!867 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "")
!868 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !618, line: 160, baseType: !619)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "intensity", scope: !689, file: !299, line: 350, baseType: !870, size: 32, offset: 105792)
!870 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelIntensityMethod", file: !475, line: 79, baseType: !505)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !689, file: !299, line: 353, baseType: !591, size: 64, offset: 105856)
!872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!873 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !874, size: 64)
!874 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !875)
!875 = !DIDerivedType(tag: DW_TAG_typedef, name: "StringInfo", file: !876, line: 40, baseType: !877)
!876 = !DIFile(filename: "./magick/string_.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!877 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_StringInfo", file: !876, line: 29, size: 32960, elements: !878)
!878 = !{!879, !880, !881, !882}
!879 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !877, file: !876, line: 32, baseType: !810, size: 32768)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "datum", scope: !877, file: !876, line: 35, baseType: !841, size: 64, offset: 32768)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !877, file: !876, line: 38, baseType: !591, size: 64, offset: 32832)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !877, file: !876, line: 39, baseType: !591, size: 64, offset: 32896)
!883 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !884, size: 64)
!884 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !686)
!885 = !{!0, !886, !888}
!886 = !DIGlobalVariableExpression(var: !887, expr: !DIExpression())
!887 = distinct !DIGlobalVariable(name: "color_cache", scope: !2, file: !3, line: 786, type: !563, isLocal: true, isDefinition: true)
!888 = !DIGlobalVariableExpression(var: !889, expr: !DIExpression())
!889 = distinct !DIGlobalVariable(name: "ColorMap", scope: !2, file: !3, line: 100, type: !890, isLocal: true, isDefinition: true)
!890 = !DICompositeType(tag: DW_TAG_array_type, baseType: !891, size: 130176, elements: !904)
!891 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !892)
!892 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorMapInfo", file: !3, line: 94, baseType: !893)
!893 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ColorMapInfo", file: !3, line: 79, size: 192, elements: !894)
!894 = !{!895, !896, !898, !899, !900, !902}
!895 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !893, file: !3, line: 82, baseType: !607, size: 64)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !893, file: !3, line: 85, baseType: !897, size: 8, offset: 64)
!897 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !609)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !893, file: !3, line: 86, baseType: !897, size: 8, offset: 72)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !893, file: !3, line: 87, baseType: !897, size: 8, offset: 80)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !893, file: !3, line: 90, baseType: !901, size: 32, offset: 96)
!901 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !596)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "compliance", scope: !893, file: !3, line: 93, baseType: !903, size: 64, offset: 128)
!903 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !615)
!904 = !{!905}
!905 = !DISubrange(count: 678)
!906 = !{i32 7, !"Dwarf Version", i32 4}
!907 = !{i32 2, !"Debug Info Version", i32 3}
!908 = !{i32 1, !"wchar_size", i32 4}
!909 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!910 = distinct !DISubprogram(name: "ColorComponentGenesis", scope: !3, file: !3, line: 917, type: !911, scopeLine: 918, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !913)
!911 = !DISubroutineType(types: !912)
!912 = !{!587}
!913 = !{}
!914 = !DILocation(line: 919, column: 7, scope: !915)
!915 = distinct !DILexicalBlock(scope: !910, file: !3, line: 919, column: 7)
!916 = !DILocation(line: 919, column: 23, scope: !915)
!917 = !DILocation(line: 919, column: 7, scope: !910)
!918 = !DILocation(line: 920, column: 21, scope: !915)
!919 = !DILocation(line: 920, column: 20, scope: !915)
!920 = !DILocation(line: 920, column: 5, scope: !915)
!921 = !DILocation(line: 921, column: 3, scope: !910)
!922 = distinct !DISubprogram(name: "ColorComponentTerminus", scope: !3, file: !3, line: 960, type: !923, scopeLine: 961, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !913)
!923 = !DISubroutineType(types: !924)
!924 = !{null}
!925 = !DILocation(line: 962, column: 7, scope: !926)
!926 = distinct !DILexicalBlock(scope: !922, file: !3, line: 962, column: 7)
!927 = !DILocation(line: 962, column: 23, scope: !926)
!928 = !DILocation(line: 962, column: 7, scope: !922)
!929 = !DILocation(line: 963, column: 5, scope: !926)
!930 = !DILocation(line: 964, column: 21, scope: !922)
!931 = !DILocation(line: 964, column: 3, scope: !922)
!932 = !DILocation(line: 965, column: 7, scope: !933)
!933 = distinct !DILexicalBlock(scope: !922, file: !3, line: 965, column: 7)
!934 = !DILocation(line: 965, column: 19, scope: !933)
!935 = !DILocation(line: 965, column: 7, scope: !922)
!936 = !DILocation(line: 966, column: 35, scope: !933)
!937 = !DILocation(line: 966, column: 17, scope: !933)
!938 = !DILocation(line: 966, column: 16, scope: !933)
!939 = !DILocation(line: 966, column: 5, scope: !933)
!940 = !DILocation(line: 967, column: 23, scope: !922)
!941 = !DILocation(line: 967, column: 3, scope: !922)
!942 = !DILocation(line: 968, column: 3, scope: !922)
!943 = !DILocation(line: 969, column: 1, scope: !922)
!944 = distinct !DISubprogram(name: "DestroyColorElement", scope: !3, file: !3, line: 943, type: !945, scopeLine: 944, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !913)
!945 = !DISubroutineType(types: !946)
!946 = !{!562, !562}
!947 = !DILocalVariable(name: "color_info", arg: 1, scope: !944, file: !3, line: 943, type: !562)
!948 = !DILocation(line: 943, column: 40, scope: !944)
!949 = !DILocalVariable(name: "p", scope: !944, file: !3, line: 946, type: !611)
!950 = !DILocation(line: 946, column: 6, scope: !944)
!951 = !DILocation(line: 948, column: 19, scope: !944)
!952 = !DILocation(line: 948, column: 5, scope: !944)
!953 = !DILocation(line: 948, column: 4, scope: !944)
!954 = !DILocation(line: 949, column: 7, scope: !955)
!955 = distinct !DILexicalBlock(scope: !944, file: !3, line: 949, column: 7)
!956 = !DILocation(line: 949, column: 10, scope: !955)
!957 = !DILocation(line: 949, column: 18, scope: !955)
!958 = !DILocation(line: 949, column: 7, scope: !944)
!959 = !DILocation(line: 951, column: 11, scope: !960)
!960 = distinct !DILexicalBlock(scope: !961, file: !3, line: 951, column: 11)
!961 = distinct !DILexicalBlock(scope: !955, file: !3, line: 950, column: 5)
!962 = !DILocation(line: 951, column: 14, scope: !960)
!963 = !DILocation(line: 951, column: 19, scope: !960)
!964 = !DILocation(line: 951, column: 11, scope: !961)
!965 = !DILocation(line: 952, column: 31, scope: !960)
!966 = !DILocation(line: 952, column: 34, scope: !960)
!967 = !DILocation(line: 952, column: 17, scope: !960)
!968 = !DILocation(line: 952, column: 9, scope: !960)
!969 = !DILocation(line: 952, column: 12, scope: !960)
!970 = !DILocation(line: 952, column: 16, scope: !960)
!971 = !DILocation(line: 953, column: 11, scope: !972)
!972 = distinct !DILexicalBlock(scope: !961, file: !3, line: 953, column: 11)
!973 = !DILocation(line: 953, column: 14, scope: !972)
!974 = !DILocation(line: 953, column: 19, scope: !972)
!975 = !DILocation(line: 953, column: 11, scope: !961)
!976 = !DILocation(line: 954, column: 31, scope: !972)
!977 = !DILocation(line: 954, column: 34, scope: !972)
!978 = !DILocation(line: 954, column: 17, scope: !972)
!979 = !DILocation(line: 954, column: 9, scope: !972)
!980 = !DILocation(line: 954, column: 12, scope: !972)
!981 = !DILocation(line: 954, column: 16, scope: !972)
!982 = !DILocation(line: 955, column: 5, scope: !961)
!983 = !DILocation(line: 956, column: 42, scope: !944)
!984 = !DILocation(line: 956, column: 19, scope: !944)
!985 = !DILocation(line: 956, column: 5, scope: !944)
!986 = !DILocation(line: 956, column: 4, scope: !944)
!987 = !DILocation(line: 957, column: 3, scope: !944)
!988 = distinct !DISubprogram(name: "GetColorCompliance", scope: !3, file: !3, line: 999, type: !989, scopeLine: 1001, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !913)
!989 = !DISubroutineType(types: !990)
!990 = !{!567, !607, !991, !992}
!991 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !577)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !818, size: 64)
!993 = !DILocalVariable(name: "name", arg: 1, scope: !988, file: !3, line: 999, type: !607)
!994 = !DILocation(line: 999, column: 62, scope: !988)
!995 = !DILocalVariable(name: "compliance", arg: 2, scope: !988, file: !3, line: 1000, type: !991)
!996 = !DILocation(line: 1000, column: 24, scope: !988)
!997 = !DILocalVariable(name: "exception", arg: 3, scope: !988, file: !3, line: 1000, type: !992)
!998 = !DILocation(line: 1000, column: 50, scope: !988)
!999 = !DILocalVariable(name: "colorname", scope: !988, file: !3, line: 1003, type: !810)
!1000 = !DILocation(line: 1003, column: 5, scope: !988)
!1001 = !DILocalVariable(name: "p", scope: !988, file: !3, line: 1006, type: !567)
!1002 = !DILocation(line: 1006, column: 6, scope: !988)
!1003 = !DILocalVariable(name: "q", scope: !988, file: !3, line: 1009, type: !573)
!1004 = !DILocation(line: 1009, column: 6, scope: !988)
!1005 = !DILocation(line: 1012, column: 32, scope: !1006)
!1006 = distinct !DILexicalBlock(scope: !988, file: !3, line: 1012, column: 7)
!1007 = !DILocation(line: 1012, column: 7, scope: !1006)
!1008 = !DILocation(line: 1012, column: 43, scope: !1006)
!1009 = !DILocation(line: 1012, column: 7, scope: !988)
!1010 = !DILocation(line: 1013, column: 5, scope: !1006)
!1011 = !DILocation(line: 1017, column: 3, scope: !988)
!1012 = !DILocation(line: 1017, column: 13, scope: !988)
!1013 = !DILocation(line: 1018, column: 7, scope: !1014)
!1014 = distinct !DILexicalBlock(scope: !988, file: !3, line: 1018, column: 7)
!1015 = !DILocation(line: 1018, column: 12, scope: !1014)
!1016 = !DILocation(line: 1018, column: 7, scope: !988)
!1017 = !DILocation(line: 1019, column: 29, scope: !1014)
!1018 = !DILocation(line: 1019, column: 39, scope: !1014)
!1019 = !DILocation(line: 1019, column: 12, scope: !1014)
!1020 = !DILocation(line: 1019, column: 5, scope: !1014)
!1021 = !DILocation(line: 1020, column: 10, scope: !1022)
!1022 = distinct !DILexicalBlock(scope: !988, file: !3, line: 1020, column: 3)
!1023 = !DILocation(line: 1020, column: 9, scope: !1022)
!1024 = !DILocation(line: 1020, column: 8, scope: !1022)
!1025 = !DILocation(line: 1020, column: 22, scope: !1026)
!1026 = distinct !DILexicalBlock(scope: !1022, file: !3, line: 1020, column: 3)
!1027 = !DILocation(line: 1020, column: 21, scope: !1026)
!1028 = !DILocation(line: 1020, column: 24, scope: !1026)
!1029 = !DILocation(line: 1020, column: 3, scope: !1022)
!1030 = !DILocation(line: 1022, column: 9, scope: !1031)
!1031 = distinct !DILexicalBlock(scope: !1032, file: !3, line: 1022, column: 9)
!1032 = distinct !DILexicalBlock(scope: !1026, file: !3, line: 1021, column: 3)
!1033 = !DILocation(line: 1022, column: 45, scope: !1031)
!1034 = !DILocation(line: 1022, column: 9, scope: !1032)
!1035 = !DILocation(line: 1023, column: 7, scope: !1031)
!1036 = !DILocation(line: 1024, column: 29, scope: !1032)
!1037 = !DILocation(line: 1024, column: 31, scope: !1032)
!1038 = !DILocation(line: 1024, column: 32, scope: !1032)
!1039 = !DILocation(line: 1024, column: 12, scope: !1032)
!1040 = !DILocation(line: 1025, column: 6, scope: !1032)
!1041 = !DILocation(line: 1026, column: 3, scope: !1032)
!1042 = !DILocation(line: 1020, column: 34, scope: !1026)
!1043 = !DILocation(line: 1020, column: 3, scope: !1026)
!1044 = distinct !{!1044, !1029, !1045}
!1045 = !DILocation(line: 1026, column: 3, scope: !1022)
!1046 = !DILocation(line: 1030, column: 21, scope: !988)
!1047 = !DILocation(line: 1030, column: 3, scope: !988)
!1048 = !DILocation(line: 1031, column: 27, scope: !988)
!1049 = !DILocation(line: 1031, column: 3, scope: !988)
!1050 = !DILocation(line: 1032, column: 50, scope: !988)
!1051 = !DILocation(line: 1032, column: 25, scope: !988)
!1052 = !DILocation(line: 1032, column: 5, scope: !988)
!1053 = !DILocation(line: 1032, column: 4, scope: !988)
!1054 = !DILocation(line: 1033, column: 8, scope: !1055)
!1055 = distinct !DILexicalBlock(scope: !988, file: !3, line: 1033, column: 7)
!1056 = !DILocation(line: 1033, column: 13, scope: !1055)
!1057 = !DILocation(line: 1033, column: 37, scope: !1055)
!1058 = !DILocation(line: 1033, column: 55, scope: !1055)
!1059 = !DILocation(line: 1033, column: 41, scope: !1055)
!1060 = !DILocation(line: 1033, column: 65, scope: !1055)
!1061 = !DILocation(line: 1033, column: 7, scope: !988)
!1062 = !DILocation(line: 1035, column: 27, scope: !1063)
!1063 = distinct !DILexicalBlock(scope: !1055, file: !3, line: 1034, column: 5)
!1064 = !DILocation(line: 1035, column: 7, scope: !1063)
!1065 = !DILocation(line: 1036, column: 14, scope: !1063)
!1066 = !DILocation(line: 1036, column: 7, scope: !1063)
!1067 = !DILocation(line: 1038, column: 3, scope: !988)
!1068 = !DILocation(line: 1038, column: 10, scope: !988)
!1069 = !DILocation(line: 1038, column: 12, scope: !988)
!1070 = !DILocation(line: 1040, column: 11, scope: !1071)
!1071 = distinct !DILexicalBlock(scope: !1072, file: !3, line: 1040, column: 9)
!1072 = distinct !DILexicalBlock(scope: !988, file: !3, line: 1039, column: 3)
!1073 = !DILocation(line: 1040, column: 14, scope: !1071)
!1074 = !DILocation(line: 1040, column: 27, scope: !1071)
!1075 = !DILocation(line: 1040, column: 25, scope: !1071)
!1076 = !DILocation(line: 1040, column: 39, scope: !1071)
!1077 = !DILocation(line: 1040, column: 45, scope: !1071)
!1078 = !DILocation(line: 1041, column: 24, scope: !1071)
!1079 = !DILocation(line: 1041, column: 34, scope: !1071)
!1080 = !DILocation(line: 1041, column: 37, scope: !1071)
!1081 = !DILocation(line: 1041, column: 10, scope: !1071)
!1082 = !DILocation(line: 1041, column: 43, scope: !1071)
!1083 = !DILocation(line: 1040, column: 9, scope: !1072)
!1084 = !DILocation(line: 1042, column: 7, scope: !1071)
!1085 = !DILocation(line: 1043, column: 52, scope: !1072)
!1086 = !DILocation(line: 1043, column: 27, scope: !1072)
!1087 = !DILocation(line: 1043, column: 7, scope: !1072)
!1088 = !DILocation(line: 1043, column: 6, scope: !1072)
!1089 = distinct !{!1089, !1067, !1090}
!1090 = !DILocation(line: 1044, column: 3, scope: !988)
!1091 = !DILocation(line: 1045, column: 7, scope: !1092)
!1092 = distinct !DILexicalBlock(scope: !988, file: !3, line: 1045, column: 7)
!1093 = !DILocation(line: 1045, column: 9, scope: !1092)
!1094 = !DILocation(line: 1045, column: 7, scope: !988)
!1095 = !DILocation(line: 1046, column: 33, scope: !1092)
!1096 = !DILocation(line: 1047, column: 34, scope: !1092)
!1097 = !DILocation(line: 1046, column: 12, scope: !1092)
!1098 = !DILocation(line: 1046, column: 5, scope: !1092)
!1099 = !DILocation(line: 1049, column: 36, scope: !1092)
!1100 = !DILocation(line: 1050, column: 42, scope: !1092)
!1101 = !DILocation(line: 1050, column: 54, scope: !1092)
!1102 = !DILocation(line: 1050, column: 7, scope: !1092)
!1103 = !DILocation(line: 1049, column: 12, scope: !1092)
!1104 = !DILocation(line: 1051, column: 23, scope: !988)
!1105 = !DILocation(line: 1051, column: 3, scope: !988)
!1106 = !DILocation(line: 1052, column: 10, scope: !988)
!1107 = !DILocation(line: 1052, column: 3, scope: !988)
!1108 = !DILocation(line: 1053, column: 1, scope: !988)
!1109 = distinct !DISubprogram(name: "IsColorCacheInstantiated", scope: !3, file: !3, line: 1607, type: !1110, scopeLine: 1608, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !913)
!1110 = !DISubroutineType(types: !1111)
!1111 = !{!587, !992}
!1112 = !DILocalVariable(name: "exception", arg: 1, scope: !1109, file: !3, line: 1607, type: !992)
!1113 = !DILocation(line: 1607, column: 66, scope: !1109)
!1114 = !DILocation(line: 1609, column: 7, scope: !1115)
!1115 = distinct !DILexicalBlock(scope: !1109, file: !3, line: 1609, column: 7)
!1116 = !DILocation(line: 1609, column: 19, scope: !1115)
!1117 = !DILocation(line: 1609, column: 7, scope: !1109)
!1118 = !DILocation(line: 1611, column: 11, scope: !1119)
!1119 = distinct !DILexicalBlock(scope: !1120, file: !3, line: 1611, column: 11)
!1120 = distinct !DILexicalBlock(scope: !1115, file: !3, line: 1610, column: 5)
!1121 = !DILocation(line: 1611, column: 27, scope: !1119)
!1122 = !DILocation(line: 1611, column: 11, scope: !1120)
!1123 = !DILocation(line: 1612, column: 9, scope: !1119)
!1124 = !DILocation(line: 1613, column: 25, scope: !1120)
!1125 = !DILocation(line: 1613, column: 7, scope: !1120)
!1126 = !DILocation(line: 1614, column: 11, scope: !1127)
!1127 = distinct !DILexicalBlock(scope: !1120, file: !3, line: 1614, column: 11)
!1128 = !DILocation(line: 1614, column: 23, scope: !1127)
!1129 = !DILocation(line: 1614, column: 11, scope: !1120)
!1130 = !DILocation(line: 1615, column: 53, scope: !1127)
!1131 = !DILocation(line: 1615, column: 21, scope: !1127)
!1132 = !DILocation(line: 1615, column: 20, scope: !1127)
!1133 = !DILocation(line: 1615, column: 9, scope: !1127)
!1134 = !DILocation(line: 1616, column: 27, scope: !1120)
!1135 = !DILocation(line: 1616, column: 7, scope: !1120)
!1136 = !DILocation(line: 1617, column: 5, scope: !1120)
!1137 = !DILocation(line: 1618, column: 10, scope: !1109)
!1138 = !DILocation(line: 1618, column: 22, scope: !1109)
!1139 = !DILocation(line: 1618, column: 3, scope: !1109)
!1140 = distinct !DISubprogram(name: "GetColorInfo", scope: !3, file: !3, line: 1084, type: !1141, scopeLine: 1086, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !913)
!1141 = !DISubroutineType(types: !1142)
!1142 = !{!567, !607, !992}
!1143 = !DILocalVariable(name: "name", arg: 1, scope: !1140, file: !3, line: 1084, type: !607)
!1144 = !DILocation(line: 1084, column: 56, scope: !1140)
!1145 = !DILocalVariable(name: "exception", arg: 2, scope: !1140, file: !3, line: 1085, type: !992)
!1146 = !DILocation(line: 1085, column: 18, scope: !1140)
!1147 = !DILocation(line: 1087, column: 29, scope: !1140)
!1148 = !DILocation(line: 1087, column: 48, scope: !1140)
!1149 = !DILocation(line: 1087, column: 10, scope: !1140)
!1150 = !DILocation(line: 1087, column: 3, scope: !1140)
!1151 = distinct !DISubprogram(name: "ConcatenateColorComponent", scope: !3, file: !3, line: 1119, type: !1152, scopeLine: 1121, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !913)
!1152 = !DISubroutineType(types: !1153)
!1153 = !{null, !1154, !1156, !991, !573}
!1154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1155, size: 64)
!1155 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !579)
!1156 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1157)
!1157 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChannelType", file: !6, line: 202, baseType: !150)
!1158 = !DILocalVariable(name: "pixel", arg: 1, scope: !1151, file: !3, line: 1119, type: !1154)
!1159 = !DILocation(line: 1119, column: 70, scope: !1151)
!1160 = !DILocalVariable(name: "channel", arg: 2, scope: !1151, file: !3, line: 1120, type: !1156)
!1161 = !DILocation(line: 1120, column: 21, scope: !1151)
!1162 = !DILocalVariable(name: "compliance", arg: 3, scope: !1151, file: !3, line: 1120, type: !991)
!1163 = !DILocation(line: 1120, column: 50, scope: !1151)
!1164 = !DILocalVariable(name: "tuple", arg: 4, scope: !1151, file: !3, line: 1120, type: !573)
!1165 = !DILocation(line: 1120, column: 67, scope: !1151)
!1166 = !DILocalVariable(name: "component", scope: !1151, file: !3, line: 1123, type: !810)
!1167 = !DILocation(line: 1123, column: 5, scope: !1151)
!1168 = !DILocalVariable(name: "color", scope: !1151, file: !3, line: 1126, type: !589)
!1169 = !DILocation(line: 1126, column: 5, scope: !1151)
!1170 = !DILocation(line: 1128, column: 8, scope: !1151)
!1171 = !DILocation(line: 1129, column: 11, scope: !1151)
!1172 = !DILocation(line: 1129, column: 3, scope: !1151)
!1173 = !DILocation(line: 1133, column: 13, scope: !1174)
!1174 = distinct !DILexicalBlock(scope: !1175, file: !3, line: 1132, column: 5)
!1175 = distinct !DILexicalBlock(scope: !1151, file: !3, line: 1130, column: 3)
!1176 = !DILocation(line: 1133, column: 20, scope: !1174)
!1177 = !DILocation(line: 1133, column: 12, scope: !1174)
!1178 = !DILocation(line: 1134, column: 7, scope: !1174)
!1179 = !DILocation(line: 1138, column: 13, scope: !1180)
!1180 = distinct !DILexicalBlock(scope: !1175, file: !3, line: 1137, column: 5)
!1181 = !DILocation(line: 1138, column: 20, scope: !1180)
!1182 = !DILocation(line: 1138, column: 12, scope: !1180)
!1183 = !DILocation(line: 1139, column: 7, scope: !1180)
!1184 = !DILocation(line: 1143, column: 13, scope: !1185)
!1185 = distinct !DILexicalBlock(scope: !1175, file: !3, line: 1142, column: 5)
!1186 = !DILocation(line: 1143, column: 20, scope: !1185)
!1187 = !DILocation(line: 1143, column: 12, scope: !1185)
!1188 = !DILocation(line: 1144, column: 7, scope: !1185)
!1189 = !DILocation(line: 1148, column: 26, scope: !1190)
!1190 = distinct !DILexicalBlock(scope: !1175, file: !3, line: 1147, column: 5)
!1191 = !DILocation(line: 1148, column: 33, scope: !1190)
!1192 = !DILocation(line: 1148, column: 25, scope: !1190)
!1193 = !DILocation(line: 1148, column: 13, scope: !1190)
!1194 = !DILocation(line: 1148, column: 12, scope: !1190)
!1195 = !DILocation(line: 1149, column: 7, scope: !1190)
!1196 = !DILocation(line: 1153, column: 13, scope: !1197)
!1197 = distinct !DILexicalBlock(scope: !1175, file: !3, line: 1152, column: 5)
!1198 = !DILocation(line: 1153, column: 20, scope: !1197)
!1199 = !DILocation(line: 1153, column: 12, scope: !1197)
!1200 = !DILocation(line: 1154, column: 7, scope: !1197)
!1201 = !DILocation(line: 1157, column: 7, scope: !1175)
!1202 = !DILocation(line: 1159, column: 7, scope: !1203)
!1203 = distinct !DILexicalBlock(scope: !1151, file: !3, line: 1159, column: 7)
!1204 = !DILocation(line: 1159, column: 18, scope: !1203)
!1205 = !DILocation(line: 1159, column: 7, scope: !1151)
!1206 = !DILocation(line: 1161, column: 33, scope: !1207)
!1207 = distinct !DILexicalBlock(scope: !1203, file: !3, line: 1160, column: 5)
!1208 = !DILocation(line: 1162, column: 9, scope: !1207)
!1209 = !DILocation(line: 1162, column: 30, scope: !1207)
!1210 = !DILocation(line: 1161, column: 14, scope: !1207)
!1211 = !DILocation(line: 1163, column: 38, scope: !1207)
!1212 = !DILocation(line: 1163, column: 44, scope: !1207)
!1213 = !DILocation(line: 1163, column: 14, scope: !1207)
!1214 = !DILocation(line: 1164, column: 7, scope: !1207)
!1215 = !DILocation(line: 1166, column: 7, scope: !1216)
!1216 = distinct !DILexicalBlock(scope: !1151, file: !3, line: 1166, column: 7)
!1217 = !DILocation(line: 1166, column: 18, scope: !1216)
!1218 = !DILocation(line: 1166, column: 7, scope: !1151)
!1219 = !DILocation(line: 1168, column: 11, scope: !1220)
!1220 = distinct !DILexicalBlock(scope: !1221, file: !3, line: 1168, column: 11)
!1221 = distinct !DILexicalBlock(scope: !1216, file: !3, line: 1167, column: 5)
!1222 = !DILocation(line: 1168, column: 18, scope: !1220)
!1223 = !DILocation(line: 1168, column: 24, scope: !1220)
!1224 = !DILocation(line: 1168, column: 11, scope: !1221)
!1225 = !DILocation(line: 1170, column: 37, scope: !1226)
!1226 = distinct !DILexicalBlock(scope: !1220, file: !3, line: 1169, column: 9)
!1227 = !DILocation(line: 1171, column: 63, scope: !1226)
!1228 = !DILocation(line: 1171, column: 48, scope: !1226)
!1229 = !DILocation(line: 1171, column: 29, scope: !1226)
!1230 = !DILocation(line: 1171, column: 13, scope: !1226)
!1231 = !DILocation(line: 1170, column: 18, scope: !1226)
!1232 = !DILocation(line: 1172, column: 42, scope: !1226)
!1233 = !DILocation(line: 1172, column: 48, scope: !1226)
!1234 = !DILocation(line: 1172, column: 18, scope: !1226)
!1235 = !DILocation(line: 1173, column: 11, scope: !1226)
!1236 = !DILocation(line: 1175, column: 11, scope: !1237)
!1237 = distinct !DILexicalBlock(scope: !1221, file: !3, line: 1175, column: 11)
!1238 = !DILocation(line: 1175, column: 18, scope: !1237)
!1239 = !DILocation(line: 1175, column: 24, scope: !1237)
!1240 = !DILocation(line: 1175, column: 11, scope: !1221)
!1241 = !DILocation(line: 1177, column: 37, scope: !1242)
!1242 = distinct !DILexicalBlock(scope: !1237, file: !3, line: 1176, column: 9)
!1243 = !DILocation(line: 1178, column: 48, scope: !1242)
!1244 = !DILocation(line: 1178, column: 33, scope: !1242)
!1245 = !DILocation(line: 1178, column: 13, scope: !1242)
!1246 = !DILocation(line: 1177, column: 18, scope: !1242)
!1247 = !DILocation(line: 1179, column: 42, scope: !1242)
!1248 = !DILocation(line: 1179, column: 48, scope: !1242)
!1249 = !DILocation(line: 1179, column: 18, scope: !1242)
!1250 = !DILocation(line: 1180, column: 11, scope: !1242)
!1251 = !DILocation(line: 1182, column: 33, scope: !1221)
!1252 = !DILocation(line: 1183, column: 43, scope: !1221)
!1253 = !DILocation(line: 1183, column: 28, scope: !1221)
!1254 = !DILocation(line: 1183, column: 9, scope: !1221)
!1255 = !DILocation(line: 1182, column: 14, scope: !1221)
!1256 = !DILocation(line: 1184, column: 38, scope: !1221)
!1257 = !DILocation(line: 1184, column: 44, scope: !1221)
!1258 = !DILocation(line: 1184, column: 14, scope: !1221)
!1259 = !DILocation(line: 1185, column: 7, scope: !1221)
!1260 = !DILocation(line: 1187, column: 7, scope: !1261)
!1261 = distinct !DILexicalBlock(scope: !1151, file: !3, line: 1187, column: 7)
!1262 = !DILocation(line: 1187, column: 15, scope: !1261)
!1263 = !DILocation(line: 1187, column: 7, scope: !1151)
!1264 = !DILocation(line: 1189, column: 33, scope: !1265)
!1265 = distinct !DILexicalBlock(scope: !1261, file: !3, line: 1188, column: 5)
!1266 = !DILocation(line: 1190, column: 9, scope: !1265)
!1267 = !DILocation(line: 1190, column: 44, scope: !1265)
!1268 = !DILocation(line: 1190, column: 43, scope: !1265)
!1269 = !DILocation(line: 1189, column: 14, scope: !1265)
!1270 = !DILocation(line: 1191, column: 38, scope: !1265)
!1271 = !DILocation(line: 1191, column: 44, scope: !1265)
!1272 = !DILocation(line: 1191, column: 14, scope: !1265)
!1273 = !DILocation(line: 1192, column: 7, scope: !1265)
!1274 = !DILocation(line: 1194, column: 8, scope: !1275)
!1275 = distinct !DILexicalBlock(scope: !1151, file: !3, line: 1194, column: 7)
!1276 = !DILocation(line: 1194, column: 15, scope: !1275)
!1277 = !DILocation(line: 1194, column: 26, scope: !1275)
!1278 = !DILocation(line: 1194, column: 44, scope: !1275)
!1279 = !DILocation(line: 1195, column: 8, scope: !1275)
!1280 = !DILocation(line: 1195, column: 15, scope: !1275)
!1281 = !DILocation(line: 1195, column: 26, scope: !1275)
!1282 = !DILocation(line: 1195, column: 45, scope: !1275)
!1283 = !DILocation(line: 1196, column: 8, scope: !1275)
!1284 = !DILocation(line: 1196, column: 15, scope: !1275)
!1285 = !DILocation(line: 1196, column: 26, scope: !1275)
!1286 = !DILocation(line: 1196, column: 44, scope: !1275)
!1287 = !DILocation(line: 1197, column: 8, scope: !1275)
!1288 = !DILocation(line: 1197, column: 15, scope: !1275)
!1289 = !DILocation(line: 1197, column: 26, scope: !1275)
!1290 = !DILocation(line: 1197, column: 44, scope: !1275)
!1291 = !DILocation(line: 1198, column: 8, scope: !1275)
!1292 = !DILocation(line: 1198, column: 15, scope: !1275)
!1293 = !DILocation(line: 1198, column: 26, scope: !1275)
!1294 = !DILocation(line: 1198, column: 44, scope: !1275)
!1295 = !DILocation(line: 1199, column: 8, scope: !1275)
!1296 = !DILocation(line: 1199, column: 15, scope: !1275)
!1297 = !DILocation(line: 1199, column: 26, scope: !1275)
!1298 = !DILocation(line: 1199, column: 44, scope: !1275)
!1299 = !DILocation(line: 1200, column: 8, scope: !1275)
!1300 = !DILocation(line: 1200, column: 15, scope: !1275)
!1301 = !DILocation(line: 1200, column: 26, scope: !1275)
!1302 = !DILocation(line: 1194, column: 7, scope: !1151)
!1303 = !DILocation(line: 1202, column: 33, scope: !1304)
!1304 = distinct !DILexicalBlock(scope: !1275, file: !3, line: 1201, column: 5)
!1305 = !DILocation(line: 1203, column: 9, scope: !1304)
!1306 = !DILocation(line: 1203, column: 50, scope: !1304)
!1307 = !DILocation(line: 1203, column: 49, scope: !1304)
!1308 = !DILocation(line: 1202, column: 14, scope: !1304)
!1309 = !DILocation(line: 1204, column: 38, scope: !1304)
!1310 = !DILocation(line: 1204, column: 44, scope: !1304)
!1311 = !DILocation(line: 1204, column: 14, scope: !1304)
!1312 = !DILocation(line: 1205, column: 7, scope: !1304)
!1313 = !DILocation(line: 1207, column: 7, scope: !1314)
!1314 = distinct !DILexicalBlock(scope: !1151, file: !3, line: 1207, column: 7)
!1315 = !DILocation(line: 1207, column: 14, scope: !1314)
!1316 = !DILocation(line: 1207, column: 20, scope: !1314)
!1317 = !DILocation(line: 1207, column: 7, scope: !1151)
!1318 = !DILocation(line: 1209, column: 33, scope: !1319)
!1319 = distinct !DILexicalBlock(scope: !1314, file: !3, line: 1208, column: 5)
!1320 = !DILocation(line: 1210, column: 9, scope: !1319)
!1321 = !DILocation(line: 1210, column: 50, scope: !1319)
!1322 = !DILocation(line: 1210, column: 49, scope: !1319)
!1323 = !DILocation(line: 1209, column: 14, scope: !1319)
!1324 = !DILocation(line: 1211, column: 38, scope: !1319)
!1325 = !DILocation(line: 1211, column: 44, scope: !1319)
!1326 = !DILocation(line: 1211, column: 14, scope: !1319)
!1327 = !DILocation(line: 1212, column: 7, scope: !1319)
!1328 = !DILocation(line: 1214, column: 29, scope: !1151)
!1329 = !DILocation(line: 1215, column: 39, scope: !1151)
!1330 = !DILocation(line: 1215, column: 24, scope: !1151)
!1331 = !DILocation(line: 1215, column: 5, scope: !1151)
!1332 = !DILocation(line: 1214, column: 10, scope: !1151)
!1333 = !DILocation(line: 1216, column: 34, scope: !1151)
!1334 = !DILocation(line: 1216, column: 40, scope: !1151)
!1335 = !DILocation(line: 1216, column: 10, scope: !1151)
!1336 = !DILocation(line: 1217, column: 1, scope: !1151)
!1337 = distinct !DISubprogram(name: "ScaleQuantumToLong", scope: !1338, file: !1338, line: 395, type: !1339, scopeLine: 396, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !913)
!1338 = !DIFile(filename: "./magick/quantum-private.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!1339 = !DISubroutineType(types: !1340)
!1340 = !{!7, !1341}
!1341 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !612)
!1342 = !DILocalVariable(name: "quantum", arg: 1, scope: !1337, file: !1338, line: 395, type: !1341)
!1343 = !DILocation(line: 395, column: 61, scope: !1337)
!1344 = !DILocation(line: 398, column: 34, scope: !1337)
!1345 = !DILocation(line: 398, column: 33, scope: !1337)
!1346 = !DILocation(line: 398, column: 10, scope: !1337)
!1347 = !DILocation(line: 398, column: 3, scope: !1337)
!1348 = distinct !DISubprogram(name: "ClampToQuantum", scope: !369, file: !369, line: 87, type: !1349, scopeLine: 88, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !913)
!1349 = !DISubroutineType(types: !1350)
!1350 = !{!612, !1351}
!1351 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !595)
!1352 = !DILocalVariable(name: "value", arg: 1, scope: !1348, file: !369, line: 87, type: !1351)
!1353 = !DILocation(line: 87, column: 59, scope: !1348)
!1354 = !DILocation(line: 92, column: 7, scope: !1355)
!1355 = distinct !DILexicalBlock(scope: !1348, file: !369, line: 92, column: 7)
!1356 = !DILocation(line: 92, column: 13, scope: !1355)
!1357 = !DILocation(line: 92, column: 7, scope: !1348)
!1358 = !DILocation(line: 93, column: 5, scope: !1355)
!1359 = !DILocation(line: 94, column: 7, scope: !1360)
!1360 = distinct !DILexicalBlock(scope: !1348, file: !369, line: 94, column: 7)
!1361 = !DILocation(line: 94, column: 13, scope: !1360)
!1362 = !DILocation(line: 94, column: 7, scope: !1348)
!1363 = !DILocation(line: 95, column: 5, scope: !1360)
!1364 = !DILocation(line: 96, column: 21, scope: !1348)
!1365 = !DILocation(line: 96, column: 26, scope: !1348)
!1366 = !DILocation(line: 96, column: 10, scope: !1348)
!1367 = !DILocation(line: 96, column: 3, scope: !1348)
!1368 = !DILocation(line: 98, column: 1, scope: !1348)
!1369 = distinct !DISubprogram(name: "ScaleQuantumToShort", scope: !1338, file: !1338, line: 421, type: !1370, scopeLine: 422, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !913)
!1370 = !DISubroutineType(types: !1371)
!1371 = !{!610, !1341}
!1372 = !DILocalVariable(name: "quantum", arg: 1, scope: !1369, file: !1338, line: 421, type: !1341)
!1373 = !DILocation(line: 421, column: 64, scope: !1369)
!1374 = !DILocation(line: 424, column: 27, scope: !1369)
!1375 = !DILocation(line: 424, column: 3, scope: !1369)
!1376 = distinct !DISubprogram(name: "ScaleQuantumToChar", scope: !369, file: !369, line: 114, type: !1377, scopeLine: 115, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !913)
!1377 = !DISubroutineType(types: !1378)
!1378 = !{!609, !1341}
!1379 = !DILocalVariable(name: "quantum", arg: 1, scope: !1376, file: !369, line: 114, type: !1341)
!1380 = !DILocation(line: 114, column: 62, scope: !1376)
!1381 = !DILocation(line: 117, column: 29, scope: !1376)
!1382 = !DILocation(line: 117, column: 36, scope: !1376)
!1383 = !DILocation(line: 117, column: 46, scope: !1376)
!1384 = !DILocation(line: 117, column: 53, scope: !1376)
!1385 = !DILocation(line: 117, column: 61, scope: !1376)
!1386 = !DILocation(line: 117, column: 43, scope: !1376)
!1387 = !DILocation(line: 117, column: 68, scope: !1376)
!1388 = !DILocation(line: 117, column: 10, scope: !1376)
!1389 = !DILocation(line: 117, column: 3, scope: !1376)
!1390 = distinct !DISubprogram(name: "GetColorInfoList", scope: !3, file: !3, line: 1268, type: !1391, scopeLine: 1270, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !913)
!1391 = !DISubroutineType(types: !1392)
!1392 = !{!613, !607, !1393, !992}
!1393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64)
!1394 = !DILocalVariable(name: "pattern", arg: 1, scope: !1390, file: !3, line: 1268, type: !607)
!1395 = !DILocation(line: 1268, column: 61, scope: !1390)
!1396 = !DILocalVariable(name: "number_colors", arg: 2, scope: !1390, file: !3, line: 1269, type: !1393)
!1397 = !DILocation(line: 1269, column: 11, scope: !1390)
!1398 = !DILocalVariable(name: "exception", arg: 3, scope: !1390, file: !3, line: 1269, type: !992)
!1399 = !DILocation(line: 1269, column: 40, scope: !1390)
!1400 = !DILocalVariable(name: "colors", scope: !1390, file: !3, line: 1272, type: !613)
!1401 = !DILocation(line: 1272, column: 7, scope: !1390)
!1402 = !DILocalVariable(name: "p", scope: !1390, file: !3, line: 1275, type: !567)
!1403 = !DILocation(line: 1275, column: 6, scope: !1390)
!1404 = !DILocalVariable(name: "i", scope: !1390, file: !3, line: 1278, type: !615)
!1405 = !DILocation(line: 1278, column: 5, scope: !1390)
!1406 = !DILocation(line: 1284, column: 59, scope: !1390)
!1407 = !DILocation(line: 1284, column: 10, scope: !1390)
!1408 = !DILocation(line: 1286, column: 4, scope: !1390)
!1409 = !DILocation(line: 1286, column: 17, scope: !1390)
!1410 = !DILocation(line: 1287, column: 22, scope: !1390)
!1411 = !DILocation(line: 1287, column: 5, scope: !1390)
!1412 = !DILocation(line: 1287, column: 4, scope: !1390)
!1413 = !DILocation(line: 1288, column: 7, scope: !1414)
!1414 = distinct !DILexicalBlock(scope: !1390, file: !3, line: 1288, column: 7)
!1415 = !DILocation(line: 1288, column: 9, scope: !1414)
!1416 = !DILocation(line: 1288, column: 7, scope: !1390)
!1417 = !DILocation(line: 1289, column: 5, scope: !1414)
!1418 = !DILocation(line: 1291, column: 37, scope: !1390)
!1419 = !DILocation(line: 1291, column: 5, scope: !1390)
!1420 = !DILocation(line: 1291, column: 49, scope: !1390)
!1421 = !DILocation(line: 1290, column: 31, scope: !1390)
!1422 = !DILocation(line: 1290, column: 10, scope: !1390)
!1423 = !DILocation(line: 1290, column: 9, scope: !1390)
!1424 = !DILocation(line: 1292, column: 7, scope: !1425)
!1425 = distinct !DILexicalBlock(scope: !1390, file: !3, line: 1292, column: 7)
!1426 = !DILocation(line: 1292, column: 14, scope: !1425)
!1427 = !DILocation(line: 1292, column: 7, scope: !1390)
!1428 = !DILocation(line: 1293, column: 5, scope: !1425)
!1429 = !DILocation(line: 1297, column: 21, scope: !1390)
!1430 = !DILocation(line: 1297, column: 3, scope: !1390)
!1431 = !DILocation(line: 1298, column: 27, scope: !1390)
!1432 = !DILocation(line: 1298, column: 3, scope: !1390)
!1433 = !DILocation(line: 1299, column: 50, scope: !1390)
!1434 = !DILocation(line: 1299, column: 25, scope: !1390)
!1435 = !DILocation(line: 1299, column: 5, scope: !1390)
!1436 = !DILocation(line: 1299, column: 4, scope: !1390)
!1437 = !DILocation(line: 1300, column: 9, scope: !1438)
!1438 = distinct !DILexicalBlock(scope: !1390, file: !3, line: 1300, column: 3)
!1439 = !DILocation(line: 1300, column: 8, scope: !1438)
!1440 = !DILocation(line: 1300, column: 13, scope: !1441)
!1441 = distinct !DILexicalBlock(scope: !1438, file: !3, line: 1300, column: 3)
!1442 = !DILocation(line: 1300, column: 15, scope: !1441)
!1443 = !DILocation(line: 1300, column: 3, scope: !1438)
!1444 = !DILocation(line: 1302, column: 10, scope: !1445)
!1445 = distinct !DILexicalBlock(scope: !1446, file: !3, line: 1302, column: 9)
!1446 = distinct !DILexicalBlock(scope: !1441, file: !3, line: 1301, column: 3)
!1447 = !DILocation(line: 1302, column: 13, scope: !1445)
!1448 = !DILocation(line: 1302, column: 21, scope: !1445)
!1449 = !DILocation(line: 1302, column: 37, scope: !1445)
!1450 = !DILocation(line: 1303, column: 25, scope: !1445)
!1451 = !DILocation(line: 1303, column: 28, scope: !1445)
!1452 = !DILocation(line: 1303, column: 33, scope: !1445)
!1453 = !DILocation(line: 1303, column: 10, scope: !1445)
!1454 = !DILocation(line: 1303, column: 54, scope: !1445)
!1455 = !DILocation(line: 1302, column: 9, scope: !1446)
!1456 = !DILocation(line: 1304, column: 19, scope: !1445)
!1457 = !DILocation(line: 1304, column: 7, scope: !1445)
!1458 = !DILocation(line: 1304, column: 15, scope: !1445)
!1459 = !DILocation(line: 1304, column: 18, scope: !1445)
!1460 = !DILocation(line: 1305, column: 52, scope: !1446)
!1461 = !DILocation(line: 1305, column: 27, scope: !1446)
!1462 = !DILocation(line: 1305, column: 7, scope: !1446)
!1463 = !DILocation(line: 1305, column: 6, scope: !1446)
!1464 = !DILocation(line: 1300, column: 3, scope: !1441)
!1465 = distinct !{!1465, !1443, !1466}
!1466 = !DILocation(line: 1306, column: 3, scope: !1438)
!1467 = !DILocation(line: 1307, column: 23, scope: !1390)
!1468 = !DILocation(line: 1307, column: 3, scope: !1390)
!1469 = !DILocation(line: 1308, column: 18, scope: !1390)
!1470 = !DILocation(line: 1308, column: 9, scope: !1390)
!1471 = !DILocation(line: 1308, column: 34, scope: !1390)
!1472 = !DILocation(line: 1308, column: 3, scope: !1390)
!1473 = !DILocation(line: 1309, column: 3, scope: !1390)
!1474 = !DILocation(line: 1309, column: 10, scope: !1390)
!1475 = !DILocation(line: 1309, column: 12, scope: !1390)
!1476 = !DILocation(line: 1310, column: 27, scope: !1390)
!1477 = !DILocation(line: 1310, column: 4, scope: !1390)
!1478 = !DILocation(line: 1310, column: 17, scope: !1390)
!1479 = !DILocation(line: 1311, column: 10, scope: !1390)
!1480 = !DILocation(line: 1311, column: 3, scope: !1390)
!1481 = !DILocation(line: 1312, column: 1, scope: !1390)
!1482 = distinct !DISubprogram(name: "ColorInfoCompare", scope: !3, file: !3, line: 1251, type: !1483, scopeLine: 1252, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !913)
!1483 = !DISubroutineType(types: !1484)
!1484 = !{!199, !1485, !1485}
!1485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1486, size: 64)
!1486 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1487 = !DILocalVariable(name: "x", arg: 1, scope: !1482, file: !3, line: 1251, type: !1485)
!1488 = !DILocation(line: 1251, column: 41, scope: !1482)
!1489 = !DILocalVariable(name: "y", arg: 2, scope: !1482, file: !3, line: 1251, type: !1485)
!1490 = !DILocation(line: 1251, column: 55, scope: !1482)
!1491 = !DILocalVariable(name: "p", scope: !1482, file: !3, line: 1254, type: !613)
!1492 = !DILocation(line: 1254, column: 7, scope: !1482)
!1493 = !DILocalVariable(name: "q", scope: !1482, file: !3, line: 1255, type: !613)
!1494 = !DILocation(line: 1255, column: 7, scope: !1482)
!1495 = !DILocation(line: 1257, column: 26, scope: !1482)
!1496 = !DILocation(line: 1257, column: 5, scope: !1482)
!1497 = !DILocation(line: 1257, column: 4, scope: !1482)
!1498 = !DILocation(line: 1258, column: 26, scope: !1482)
!1499 = !DILocation(line: 1258, column: 5, scope: !1482)
!1500 = !DILocation(line: 1258, column: 4, scope: !1482)
!1501 = !DILocation(line: 1259, column: 23, scope: !1502)
!1502 = distinct !DILexicalBlock(scope: !1482, file: !3, line: 1259, column: 7)
!1503 = !DILocation(line: 1259, column: 22, scope: !1502)
!1504 = !DILocation(line: 1259, column: 27, scope: !1502)
!1505 = !DILocation(line: 1259, column: 34, scope: !1502)
!1506 = !DILocation(line: 1259, column: 33, scope: !1502)
!1507 = !DILocation(line: 1259, column: 38, scope: !1502)
!1508 = !DILocation(line: 1259, column: 7, scope: !1502)
!1509 = !DILocation(line: 1259, column: 44, scope: !1502)
!1510 = !DILocation(line: 1259, column: 7, scope: !1482)
!1511 = !DILocation(line: 1260, column: 28, scope: !1502)
!1512 = !DILocation(line: 1260, column: 27, scope: !1502)
!1513 = !DILocation(line: 1260, column: 32, scope: !1502)
!1514 = !DILocation(line: 1260, column: 39, scope: !1502)
!1515 = !DILocation(line: 1260, column: 38, scope: !1502)
!1516 = !DILocation(line: 1260, column: 43, scope: !1502)
!1517 = !DILocation(line: 1260, column: 12, scope: !1502)
!1518 = !DILocation(line: 1260, column: 5, scope: !1502)
!1519 = !DILocation(line: 1261, column: 26, scope: !1482)
!1520 = !DILocation(line: 1261, column: 25, scope: !1482)
!1521 = !DILocation(line: 1261, column: 30, scope: !1482)
!1522 = !DILocation(line: 1261, column: 37, scope: !1482)
!1523 = !DILocation(line: 1261, column: 36, scope: !1482)
!1524 = !DILocation(line: 1261, column: 41, scope: !1482)
!1525 = !DILocation(line: 1261, column: 10, scope: !1482)
!1526 = !DILocation(line: 1261, column: 3, scope: !1482)
!1527 = !DILocation(line: 1262, column: 1, scope: !1482)
!1528 = distinct !DISubprogram(name: "GetColorList", scope: !3, file: !3, line: 1361, type: !1529, scopeLine: 1363, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !913)
!1529 = !DISubroutineType(types: !1530)
!1530 = !{!614, !607, !1393, !992}
!1531 = !DILocalVariable(name: "pattern", arg: 1, scope: !1528, file: !3, line: 1361, type: !607)
!1532 = !DILocation(line: 1361, column: 46, scope: !1528)
!1533 = !DILocalVariable(name: "number_colors", arg: 2, scope: !1528, file: !3, line: 1362, type: !1393)
!1534 = !DILocation(line: 1362, column: 11, scope: !1528)
!1535 = !DILocalVariable(name: "exception", arg: 3, scope: !1528, file: !3, line: 1362, type: !992)
!1536 = !DILocation(line: 1362, column: 40, scope: !1528)
!1537 = !DILocalVariable(name: "colors", scope: !1528, file: !3, line: 1365, type: !614)
!1538 = !DILocation(line: 1365, column: 7, scope: !1528)
!1539 = !DILocalVariable(name: "p", scope: !1528, file: !3, line: 1368, type: !567)
!1540 = !DILocation(line: 1368, column: 6, scope: !1528)
!1541 = !DILocalVariable(name: "i", scope: !1528, file: !3, line: 1371, type: !615)
!1542 = !DILocation(line: 1371, column: 5, scope: !1528)
!1543 = !DILocation(line: 1377, column: 59, scope: !1528)
!1544 = !DILocation(line: 1377, column: 10, scope: !1528)
!1545 = !DILocation(line: 1379, column: 4, scope: !1528)
!1546 = !DILocation(line: 1379, column: 17, scope: !1528)
!1547 = !DILocation(line: 1380, column: 22, scope: !1528)
!1548 = !DILocation(line: 1380, column: 5, scope: !1528)
!1549 = !DILocation(line: 1380, column: 4, scope: !1528)
!1550 = !DILocation(line: 1381, column: 7, scope: !1551)
!1551 = distinct !DILexicalBlock(scope: !1528, file: !3, line: 1381, column: 7)
!1552 = !DILocation(line: 1381, column: 9, scope: !1551)
!1553 = !DILocation(line: 1381, column: 7, scope: !1528)
!1554 = !DILocation(line: 1382, column: 5, scope: !1551)
!1555 = !DILocation(line: 1384, column: 37, scope: !1528)
!1556 = !DILocation(line: 1384, column: 5, scope: !1528)
!1557 = !DILocation(line: 1384, column: 49, scope: !1528)
!1558 = !DILocation(line: 1383, column: 20, scope: !1528)
!1559 = !DILocation(line: 1383, column: 10, scope: !1528)
!1560 = !DILocation(line: 1383, column: 9, scope: !1528)
!1561 = !DILocation(line: 1385, column: 7, scope: !1562)
!1562 = distinct !DILexicalBlock(scope: !1528, file: !3, line: 1385, column: 7)
!1563 = !DILocation(line: 1385, column: 14, scope: !1562)
!1564 = !DILocation(line: 1385, column: 7, scope: !1528)
!1565 = !DILocation(line: 1386, column: 5, scope: !1562)
!1566 = !DILocation(line: 1390, column: 21, scope: !1528)
!1567 = !DILocation(line: 1390, column: 3, scope: !1528)
!1568 = !DILocation(line: 1391, column: 27, scope: !1528)
!1569 = !DILocation(line: 1391, column: 3, scope: !1528)
!1570 = !DILocation(line: 1392, column: 50, scope: !1528)
!1571 = !DILocation(line: 1392, column: 25, scope: !1528)
!1572 = !DILocation(line: 1392, column: 5, scope: !1528)
!1573 = !DILocation(line: 1392, column: 4, scope: !1528)
!1574 = !DILocation(line: 1393, column: 9, scope: !1575)
!1575 = distinct !DILexicalBlock(scope: !1528, file: !3, line: 1393, column: 3)
!1576 = !DILocation(line: 1393, column: 8, scope: !1575)
!1577 = !DILocation(line: 1393, column: 13, scope: !1578)
!1578 = distinct !DILexicalBlock(scope: !1575, file: !3, line: 1393, column: 3)
!1579 = !DILocation(line: 1393, column: 15, scope: !1578)
!1580 = !DILocation(line: 1393, column: 3, scope: !1575)
!1581 = !DILocation(line: 1395, column: 10, scope: !1582)
!1582 = distinct !DILexicalBlock(scope: !1583, file: !3, line: 1395, column: 9)
!1583 = distinct !DILexicalBlock(scope: !1578, file: !3, line: 1394, column: 3)
!1584 = !DILocation(line: 1395, column: 13, scope: !1582)
!1585 = !DILocation(line: 1395, column: 21, scope: !1582)
!1586 = !DILocation(line: 1395, column: 37, scope: !1582)
!1587 = !DILocation(line: 1396, column: 25, scope: !1582)
!1588 = !DILocation(line: 1396, column: 28, scope: !1582)
!1589 = !DILocation(line: 1396, column: 33, scope: !1582)
!1590 = !DILocation(line: 1396, column: 10, scope: !1582)
!1591 = !DILocation(line: 1396, column: 54, scope: !1582)
!1592 = !DILocation(line: 1395, column: 9, scope: !1583)
!1593 = !DILocation(line: 1397, column: 34, scope: !1582)
!1594 = !DILocation(line: 1397, column: 37, scope: !1582)
!1595 = !DILocation(line: 1397, column: 19, scope: !1582)
!1596 = !DILocation(line: 1397, column: 7, scope: !1582)
!1597 = !DILocation(line: 1397, column: 15, scope: !1582)
!1598 = !DILocation(line: 1397, column: 18, scope: !1582)
!1599 = !DILocation(line: 1398, column: 52, scope: !1583)
!1600 = !DILocation(line: 1398, column: 27, scope: !1583)
!1601 = !DILocation(line: 1398, column: 7, scope: !1583)
!1602 = !DILocation(line: 1398, column: 6, scope: !1583)
!1603 = !DILocation(line: 1393, column: 3, scope: !1578)
!1604 = distinct !{!1604, !1580, !1605}
!1605 = !DILocation(line: 1399, column: 3, scope: !1575)
!1606 = !DILocation(line: 1400, column: 23, scope: !1528)
!1607 = !DILocation(line: 1400, column: 3, scope: !1528)
!1608 = !DILocation(line: 1401, column: 18, scope: !1528)
!1609 = !DILocation(line: 1401, column: 9, scope: !1528)
!1610 = !DILocation(line: 1401, column: 34, scope: !1528)
!1611 = !DILocation(line: 1401, column: 3, scope: !1528)
!1612 = !DILocation(line: 1402, column: 3, scope: !1528)
!1613 = !DILocation(line: 1402, column: 10, scope: !1528)
!1614 = !DILocation(line: 1402, column: 12, scope: !1528)
!1615 = !DILocation(line: 1403, column: 27, scope: !1528)
!1616 = !DILocation(line: 1403, column: 4, scope: !1528)
!1617 = !DILocation(line: 1403, column: 17, scope: !1528)
!1618 = !DILocation(line: 1404, column: 10, scope: !1528)
!1619 = !DILocation(line: 1404, column: 3, scope: !1528)
!1620 = !DILocation(line: 1405, column: 1, scope: !1528)
!1621 = distinct !DISubprogram(name: "ColorCompare", scope: !3, file: !3, line: 1346, type: !1483, scopeLine: 1347, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !913)
!1622 = !DILocalVariable(name: "x", arg: 1, scope: !1621, file: !3, line: 1346, type: !1485)
!1623 = !DILocation(line: 1346, column: 37, scope: !1621)
!1624 = !DILocalVariable(name: "y", arg: 2, scope: !1621, file: !3, line: 1346, type: !1485)
!1625 = !DILocation(line: 1346, column: 51, scope: !1621)
!1626 = !DILocalVariable(name: "p", scope: !1621, file: !3, line: 1349, type: !872)
!1627 = !DILocation(line: 1349, column: 7, scope: !1621)
!1628 = !DILocalVariable(name: "q", scope: !1621, file: !3, line: 1350, type: !872)
!1629 = !DILocation(line: 1350, column: 7, scope: !1621)
!1630 = !DILocation(line: 1352, column: 21, scope: !1621)
!1631 = !DILocation(line: 1352, column: 5, scope: !1621)
!1632 = !DILocation(line: 1352, column: 4, scope: !1621)
!1633 = !DILocation(line: 1353, column: 21, scope: !1621)
!1634 = !DILocation(line: 1353, column: 5, scope: !1621)
!1635 = !DILocation(line: 1353, column: 4, scope: !1621)
!1636 = !DILocation(line: 1354, column: 25, scope: !1621)
!1637 = !DILocation(line: 1354, column: 24, scope: !1621)
!1638 = !DILocation(line: 1354, column: 28, scope: !1621)
!1639 = !DILocation(line: 1354, column: 27, scope: !1621)
!1640 = !DILocation(line: 1354, column: 10, scope: !1621)
!1641 = !DILocation(line: 1354, column: 3, scope: !1621)
!1642 = distinct !DISubprogram(name: "GetColorTuple", scope: !3, file: !3, line: 1504, type: !1643, scopeLine: 1506, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !913)
!1643 = !DISubroutineType(types: !1644)
!1644 = !{null, !1154, !1645, !573}
!1645 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !587)
!1646 = !DILocalVariable(name: "pixel", arg: 1, scope: !1642, file: !3, line: 1504, type: !1154)
!1647 = !DILocation(line: 1504, column: 58, scope: !1642)
!1648 = !DILocalVariable(name: "hex", arg: 2, scope: !1642, file: !3, line: 1505, type: !1645)
!1649 = !DILocation(line: 1505, column: 27, scope: !1642)
!1650 = !DILocalVariable(name: "tuple", arg: 3, scope: !1642, file: !3, line: 1505, type: !573)
!1651 = !DILocation(line: 1505, column: 37, scope: !1642)
!1652 = !DILocalVariable(name: "color", scope: !1642, file: !3, line: 1508, type: !579)
!1653 = !DILocation(line: 1508, column: 5, scope: !1642)
!1654 = !DILocation(line: 1512, column: 59, scope: !1642)
!1655 = !DILocation(line: 1512, column: 10, scope: !1642)
!1656 = !DILocation(line: 1513, column: 4, scope: !1642)
!1657 = !DILocation(line: 1513, column: 9, scope: !1642)
!1658 = !DILocation(line: 1514, column: 7, scope: !1659)
!1659 = distinct !DILexicalBlock(scope: !1642, file: !3, line: 1514, column: 7)
!1660 = !DILocation(line: 1514, column: 11, scope: !1659)
!1661 = !DILocation(line: 1514, column: 7, scope: !1642)
!1662 = !DILocation(line: 1519, column: 38, scope: !1663)
!1663 = distinct !DILexicalBlock(scope: !1659, file: !3, line: 1515, column: 5)
!1664 = !DILocation(line: 1519, column: 14, scope: !1663)
!1665 = !DILocation(line: 1520, column: 37, scope: !1663)
!1666 = !DILocation(line: 1520, column: 54, scope: !1663)
!1667 = !DILocation(line: 1520, column: 7, scope: !1663)
!1668 = !DILocation(line: 1521, column: 37, scope: !1663)
!1669 = !DILocation(line: 1521, column: 56, scope: !1663)
!1670 = !DILocation(line: 1521, column: 7, scope: !1663)
!1671 = !DILocation(line: 1522, column: 37, scope: !1663)
!1672 = !DILocation(line: 1522, column: 55, scope: !1663)
!1673 = !DILocation(line: 1522, column: 7, scope: !1663)
!1674 = !DILocation(line: 1523, column: 11, scope: !1675)
!1675 = distinct !DILexicalBlock(scope: !1663, file: !3, line: 1523, column: 11)
!1676 = !DILocation(line: 1523, column: 18, scope: !1675)
!1677 = !DILocation(line: 1523, column: 29, scope: !1675)
!1678 = !DILocation(line: 1523, column: 11, scope: !1663)
!1679 = !DILocation(line: 1524, column: 39, scope: !1675)
!1680 = !DILocation(line: 1524, column: 58, scope: !1675)
!1681 = !DILocation(line: 1524, column: 9, scope: !1675)
!1682 = !DILocation(line: 1525, column: 12, scope: !1683)
!1683 = distinct !DILexicalBlock(scope: !1663, file: !3, line: 1525, column: 11)
!1684 = !DILocation(line: 1525, column: 19, scope: !1683)
!1685 = !DILocation(line: 1525, column: 25, scope: !1683)
!1686 = !DILocation(line: 1525, column: 41, scope: !1683)
!1687 = !DILocation(line: 1525, column: 45, scope: !1683)
!1688 = !DILocation(line: 1525, column: 52, scope: !1683)
!1689 = !DILocation(line: 1525, column: 60, scope: !1683)
!1690 = !DILocation(line: 1525, column: 11, scope: !1663)
!1691 = !DILocation(line: 1526, column: 39, scope: !1683)
!1692 = !DILocation(line: 1526, column: 60, scope: !1683)
!1693 = !DILocation(line: 1526, column: 9, scope: !1683)
!1694 = !DILocation(line: 1527, column: 7, scope: !1663)
!1695 = !DILocation(line: 1532, column: 11, scope: !1642)
!1696 = !DILocation(line: 1532, column: 10, scope: !1642)
!1697 = !DILocation(line: 1533, column: 13, scope: !1698)
!1698 = distinct !DILexicalBlock(scope: !1642, file: !3, line: 1533, column: 7)
!1699 = !DILocation(line: 1533, column: 19, scope: !1698)
!1700 = !DILocation(line: 1533, column: 7, scope: !1642)
!1701 = !DILocalVariable(name: "status", scope: !1702, file: !3, line: 1539, type: !1703)
!1702 = distinct !DILexicalBlock(scope: !1698, file: !3, line: 1534, column: 5)
!1703 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickStatusType", file: !6, line: 147, baseType: !7)
!1704 = !DILocation(line: 1539, column: 9, scope: !1702)
!1705 = !DILocation(line: 1544, column: 20, scope: !1702)
!1706 = !DILocation(line: 1544, column: 27, scope: !1702)
!1707 = !DILocation(line: 1544, column: 24, scope: !1702)
!1708 = !DILocation(line: 1544, column: 13, scope: !1702)
!1709 = !DILocation(line: 1545, column: 21, scope: !1702)
!1710 = !DILocation(line: 1545, column: 30, scope: !1702)
!1711 = !DILocation(line: 1545, column: 27, scope: !1702)
!1712 = !DILocation(line: 1545, column: 13, scope: !1702)
!1713 = !DILocation(line: 1546, column: 21, scope: !1702)
!1714 = !DILocation(line: 1546, column: 29, scope: !1702)
!1715 = !DILocation(line: 1546, column: 26, scope: !1702)
!1716 = !DILocation(line: 1546, column: 13, scope: !1702)
!1717 = !DILocation(line: 1547, column: 17, scope: !1718)
!1718 = distinct !DILexicalBlock(scope: !1702, file: !3, line: 1547, column: 11)
!1719 = !DILocation(line: 1547, column: 28, scope: !1718)
!1720 = !DILocation(line: 1547, column: 11, scope: !1702)
!1721 = !DILocation(line: 1548, column: 23, scope: !1718)
!1722 = !DILocation(line: 1548, column: 32, scope: !1718)
!1723 = !DILocation(line: 1548, column: 29, scope: !1718)
!1724 = !DILocation(line: 1548, column: 15, scope: !1718)
!1725 = !DILocation(line: 1548, column: 9, scope: !1718)
!1726 = !DILocation(line: 1549, column: 17, scope: !1727)
!1727 = distinct !DILexicalBlock(scope: !1702, file: !3, line: 1549, column: 11)
!1728 = !DILocation(line: 1549, column: 23, scope: !1727)
!1729 = !DILocation(line: 1549, column: 11, scope: !1702)
!1730 = !DILocation(line: 1550, column: 23, scope: !1727)
!1731 = !DILocation(line: 1550, column: 34, scope: !1727)
!1732 = !DILocation(line: 1550, column: 31, scope: !1727)
!1733 = !DILocation(line: 1550, column: 15, scope: !1727)
!1734 = !DILocation(line: 1550, column: 9, scope: !1727)
!1735 = !DILocation(line: 1551, column: 11, scope: !1736)
!1736 = distinct !DILexicalBlock(scope: !1702, file: !3, line: 1551, column: 11)
!1737 = !DILocation(line: 1551, column: 18, scope: !1736)
!1738 = !DILocation(line: 1551, column: 11, scope: !1702)
!1739 = !DILocation(line: 1552, column: 15, scope: !1736)
!1740 = !DILocation(line: 1552, column: 20, scope: !1736)
!1741 = !DILocation(line: 1552, column: 9, scope: !1736)
!1742 = !DILocation(line: 1553, column: 5, scope: !1702)
!1743 = !DILocation(line: 1554, column: 34, scope: !1642)
!1744 = !DILocation(line: 1555, column: 45, scope: !1642)
!1745 = !DILocation(line: 1555, column: 29, scope: !1642)
!1746 = !DILocation(line: 1554, column: 40, scope: !1642)
!1747 = !DILocation(line: 1554, column: 10, scope: !1642)
!1748 = !DILocation(line: 1556, column: 13, scope: !1749)
!1749 = distinct !DILexicalBlock(scope: !1642, file: !3, line: 1556, column: 7)
!1750 = !DILocation(line: 1556, column: 19, scope: !1749)
!1751 = !DILocation(line: 1556, column: 7, scope: !1642)
!1752 = !DILocation(line: 1557, column: 36, scope: !1749)
!1753 = !DILocation(line: 1557, column: 12, scope: !1749)
!1754 = !DILocation(line: 1557, column: 5, scope: !1749)
!1755 = !DILocation(line: 1558, column: 34, scope: !1642)
!1756 = !DILocation(line: 1558, column: 10, scope: !1642)
!1757 = !DILocation(line: 1559, column: 13, scope: !1758)
!1758 = distinct !DILexicalBlock(scope: !1642, file: !3, line: 1559, column: 7)
!1759 = !DILocation(line: 1559, column: 24, scope: !1758)
!1760 = !DILocation(line: 1559, column: 7, scope: !1642)
!1761 = !DILocation(line: 1560, column: 64, scope: !1758)
!1762 = !DILocation(line: 1560, column: 5, scope: !1758)
!1763 = !DILocation(line: 1563, column: 65, scope: !1764)
!1764 = distinct !DILexicalBlock(scope: !1758, file: !3, line: 1562, column: 5)
!1765 = !DILocation(line: 1563, column: 7, scope: !1764)
!1766 = !DILocation(line: 1564, column: 38, scope: !1764)
!1767 = !DILocation(line: 1564, column: 14, scope: !1764)
!1768 = !DILocation(line: 1565, column: 67, scope: !1764)
!1769 = !DILocation(line: 1565, column: 7, scope: !1764)
!1770 = !DILocation(line: 1566, column: 38, scope: !1764)
!1771 = !DILocation(line: 1566, column: 14, scope: !1764)
!1772 = !DILocation(line: 1567, column: 66, scope: !1764)
!1773 = !DILocation(line: 1567, column: 7, scope: !1764)
!1774 = !DILocation(line: 1569, column: 13, scope: !1775)
