; ModuleID = 'magick/enhance.c'
source_filename = "magick/enhance.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._Image = type { i32, i32, i32, i64, i32, i32, i32, i64, i64, i64, i64, %struct._PixelPacket*, %struct._PixelPacket, %struct._PixelPacket, %struct._PixelPacket, double, %struct._ChromaticityInfo, i32, i8*, i32, i8*, i8*, i8*, i64, double, double, %struct._RectangleInfo, %struct._RectangleInfo, %struct._RectangleInfo, double, double, double, i32, i32, i32, i32, i32, i32, %struct._Image*, i64, i64, i64, i64, i64, i64, %struct._ErrorInfo, %struct._TimerInfo, i32 (i8*, i64, i64, i8*)*, i8*, i8*, i8*, %struct._Ascii85Info*, %struct._BlobInfo*, [4096 x i8], [4096 x i8], [4096 x i8], i64, i64, %struct._ExceptionInfo, i32, i64, %struct.SemaphoreInfo*, %struct._ProfileInfo, %struct._ProfileInfo, %struct._ProfileInfo*, i64, i64, %struct._Image*, %struct._Image*, %struct._Image*, i32, i32, %struct._PixelPacket, %struct._Image*, %struct._RectangleInfo, i8*, i8*, i32, i32, i64, i32, i64, i64, i32, i64 }
%struct._ChromaticityInfo = type { %struct._PrimaryInfo, %struct._PrimaryInfo, %struct._PrimaryInfo, %struct._PrimaryInfo }
%struct._PrimaryInfo = type { double, double, double }
%struct._ErrorInfo = type { double, double, double }
%struct._TimerInfo = type { %struct._Timer, %struct._Timer, i32, i64 }
%struct._Timer = type { double, double, double }

!475 = !DIEnumerator(name: "MagickChannelOptions", value: 4)
!476 = !DIEnumerator(name: "MagickClassOptions", value: 5)
!477 = !DIEnumerator(name: "MagickClipPathOptions", value: 6)
!478 = !DIEnumerator(name: "MagickCoderOptions", value: 7)
!479 = !DIEnumerator(name: "MagickColorOptions", value: 8)
!480 = !DIEnumerator(name: "MagickColorspaceOptions", value: 9)
!481 = !DIEnumerator(name: "MagickCommandOptions", value: 10)
!482 = !DIEnumerator(name: "MagickComposeOptions", value: 11)
!483 = !DIEnumerator(name: "MagickCompressOptions", value: 12)
!484 = !DIEnumerator(name: "MagickConfigureOptions", value: 13)
!485 = !DIEnumerator(name: "MagickDataTypeOptions", value: 14)
!486 = !DIEnumerator(name: "MagickDebugOptions", value: 15)
!487 = !DIEnumerator(name: "MagickDecorateOptions", value: 16)
!488 = !DIEnumerator(name: "MagickDelegateOptions", value: 17)
!489 = !DIEnumerator(name: "MagickDirectionOptions", value: 18)
!490 = !DIEnumerator(name: "MagickDisposeOptions", value: 19)
!491 = !DIEnumerator(name: "MagickDistortOptions", value: 20)
!492 = !DIEnumerator(name: "MagickDitherOptions", value: 21)
!493 = !DIEnumerator(name: "MagickEndianOptions", value: 22)
!494 = !DIEnumerator(name: "MagickEvaluateOptions", value: 23)
!495 = !DIEnumerator(name: "MagickFillRuleOptions", value: 24)
!496 = !DIEnumerator(name: "MagickFilterOptions", value: 25)
!497 = !DIEnumerator(name: "MagickFontOptions", value: 26)
!498 = !DIEnumerator(name: "MagickFontsOptions", value: 27)
!499 = !DIEnumerator(name: "MagickFormatOptions", value: 28)
!500 = !DIEnumerator(name: "MagickFunctionOptions", value: 29)
!501 = !DIEnumerator(name: "MagickGravityOptions", value: 30)
!502 = !DIEnumerator(name: "MagickIntentOptions", value: 31)
!503 = !DIEnumerator(name: "MagickInterlaceOptions", value: 32)
!504 = !DIEnumerator(name: "MagickInterpolateOptions", value: 33)
!505 = !DIEnumerator(name: "MagickKernelOptions", value: 34)
!506 = !DIEnumerator(name: "MagickLayerOptions", value: 35)
!507 = !DIEnumerator(name: "MagickLineCapOptions", value: 36)
!508 = !DIEnumerator(name: "MagickLineJoinOptions", value: 37)
!509 = !DIEnumerator(name: "MagickListOptions", value: 38)
!510 = !DIEnumerator(name: "MagickLocaleOptions", value: 39)
!511 = !DIEnumerator(name: "MagickLogEventOptions", value: 40)
!512 = !DIEnumerator(name: "MagickLogOptions", value: 41)
!513 = !DIEnumerator(name: "MagickMagicOptions", value: 42)
!514 = !DIEnumerator(name: "MagickMethodOptions", value: 43)
!515 = !DIEnumerator(name: "MagickMetricOptions", value: 44)
!516 = !DIEnumerator(name: "MagickMimeOptions", value: 45)
!517 = !DIEnumerator(name: "MagickModeOptions", value: 46)
!518 = !DIEnumerator(name: "MagickModuleOptions", value: 47)
!519 = !DIEnumerator(name: "MagickMorphologyOptions", value: 48)
!520 = !DIEnumerator(name: "MagickNoiseOptions", value: 49)
!521 = !DIEnumerator(name: "MagickOrientationOptions", value: 50)
!522 = !DIEnumerator(name: "MagickPixelIntensityOptions", value: 51)
!523 = !DIEnumerator(name: "MagickPolicyOptions", value: 52)
!524 = !DIEnumerator(name: "MagickPolicyDomainOptions", value: 53)
!525 = !DIEnumerator(name: "MagickPolicyRightsOptions", value: 54)
!526 = !DIEnumerator(name: "MagickPreviewOptions", value: 55)
!527 = !DIEnumerator(name: "MagickPrimitiveOptions", value: 56)
!528 = !DIEnumerator(name: "MagickQuantumFormatOptions", value: 57)
!529 = !DIEnumerator(name: "MagickResolutionOptions", value: 58)
!530 = !DIEnumerator(name: "MagickResourceOptions", value: 59)
!531 = !DIEnumerator(name: "MagickSparseColorOptions", value: 60)
!532 = !DIEnumerator(name: "MagickStatisticOptions", value: 61)
!533 = !DIEnumerator(name: "MagickStorageOptions", value: 62)
!534 = !DIEnumerator(name: "MagickStretchOptions", value: 63)
!535 = !DIEnumerator(name: "MagickStyleOptions", value: 64)
!536 = !DIEnumerator(name: "MagickThresholdOptions", value: 65)
!537 = !DIEnumerator(name: "MagickTypeOptions", value: 66)
!538 = !DIEnumerator(name: "MagickValidateOptions", value: 67)
!539 = !DIEnumerator(name: "MagickVirtualPixelOptions", value: 68)
!540 = !DIEnumerator(name: "MagickComplexOptions", value: 69)
!541 = !DIEnumerator(name: "MagickIntensityOptions", value: 70)
!542 = !{!543, !544, !546, !547, !550, !551, !555, !557, !565, !615, !769, !679, !771, !785, !786, !787, !556, !789, !798, !468, !800, !801, !576, !802, !572, !5}
!543 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!544 = !DIDerivedType(tag: DW_TAG_typedef, name: "Quantum", file: !4, line: 93, baseType: !545)
!545 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!546 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64)
!548 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !549)
!549 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64)
!552 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMLTreeInfo", file: !553, line: 29, baseType: !554)
!553 = !DIFile(filename: "./magick/xml-tree.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!554 = !DICompositeType(tag: DW_TAG_structure_type, name: "_XMLTreeInfo", file: !553, line: 28, flags: DIFlagFwdDecl)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64)
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64)
!558 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelPacket", file: !326, line: 148, baseType: !559)
!559 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PixelPacket", file: !326, line: 131, size: 64, elements: !560)
!560 = !{!561, !562, !563, !564}
!561 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !559, file: !326, line: 143, baseType: !544, size: 16)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !559, file: !326, line: 144, baseType: !544, size: 16, offset: 16)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !559, file: !326, line: 145, baseType: !544, size: 16, offset: 32)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !559, file: !326, line: 146, baseType: !544, size: 16, offset: 48)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64)
!566 = !DIDerivedType(tag: DW_TAG_typedef, name: "Image", file: !4, line: 221, baseType: !567)
!567 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Image", file: !77, line: 150, size: 105920, elements: !568)
!568 = !{!569, !571, !573, !575, !578, !580, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !606, !608, !609, !611, !612, !613, !614, !620, !621, !622, !630, !631, !632, !633, !634, !635, !637, !639, !641, !643, !645, !647, !649, !650, !651, !652, !653, !654, !655, !663, !678, !690, !691, !692, !693, !697, !701, !705, !706, !707, !708, !709, !726, !727, !729, !730, !740, !741, !743, !744, !745, !746, !747, !748, !750, !751, !752, !753, !754, !755, !756, !758, !759, !760, !761, !762, !766, !768}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "storage_class", scope: !567, file: !77, line: 153, baseType: !570, size: 32)
!570 = !DIDerivedType(tag: DW_TAG_typedef, name: "ClassType", file: !4, line: 209, baseType: !9)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !567, file: !77, line: 156, baseType: !572, size: 32, offset: 32)
!572 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorspaceType", file: !15, line: 61, baseType: !14)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !567, file: !77, line: 159, baseType: !574, size: 32, offset: 64)
!574 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompressionType", file: !52, line: 49, baseType: !51)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !567, file: !77, line: 162, baseType: !576, size: 64, offset: 128)
!576 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !577, line: 46, baseType: !546)
!577 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!578 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !567, file: !77, line: 165, baseType: !579, size: 32, offset: 192)
!579 = !DIDerivedType(tag: DW_TAG_typedef, name: "OrientationType", file: !77, line: 86, baseType: !76)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "taint", scope: !567, file: !77, line: 168, baseType: !581, size: 32, offset: 224)
!581 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickBooleanType", file: !4, line: 215, baseType: !3)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "matte", scope: !567, file: !77, line: 169, baseType: !581, size: 32, offset: 256)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !567, file: !77, line: 172, baseType: !576, size: 64, offset: 320)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !567, file: !77, line: 173, baseType: !576, size: 64, offset: 384)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !567, file: !77, line: 174, baseType: !576, size: 64, offset: 448)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !567, file: !77, line: 175, baseType: !576, size: 64, offset: 512)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "colormap", scope: !567, file: !77, line: 178, baseType: !557, size: 64, offset: 576)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "background_color", scope: !567, file: !77, line: 179, baseType: !558, size: 64, offset: 640)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !567, file: !77, line: 180, baseType: !558, size: 64, offset: 704)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "matte_color", scope: !567, file: !77, line: 181, baseType: !558, size: 64, offset: 768)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !567, file: !77, line: 184, baseType: !543, size: 64, offset: 832)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "chromaticity", scope: !567, file: !77, line: 187, baseType: !593, size: 768, offset: 896)
!593 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChromaticityInfo", file: !77, line: 128, baseType: !594)
!594 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ChromaticityInfo", file: !77, line: 121, size: 768, elements: !595)
!595 = !{!596, !603, !604, !605}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "red_primary", scope: !594, file: !77, line: 124, baseType: !597, size: 192)
!597 = !DIDerivedType(tag: DW_TAG_typedef, name: "PrimaryInfo", file: !77, line: 101, baseType: !598)
!598 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PrimaryInfo", file: !77, line: 95, size: 192, elements: !599)
!599 = !{!600, !601, !602}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !598, file: !77, line: 98, baseType: !543, size: 64)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !598, file: !77, line: 99, baseType: !543, size: 64, offset: 64)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !598, file: !77, line: 100, baseType: !543, size: 64, offset: 128)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "green_primary", scope: !594, file: !77, line: 125, baseType: !597, size: 192, offset: 192)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "blue_primary", scope: !594, file: !77, line: 126, baseType: !597, size: 192, offset: 384)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "white_point", scope: !594, file: !77, line: 127, baseType: !597, size: 192, offset: 576)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "rendering_intent", scope: !567, file: !77, line: 190, baseType: !607, size: 32, offset: 1664)
!607 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderingIntent", file: !89, line: 49, baseType: !88)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !567, file: !77, line: 193, baseType: !550, size: 64, offset: 1728)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !567, file: !77, line: 196, baseType: !610, size: 32, offset: 1792)
!610 = !DIDerivedType(tag: DW_TAG_typedef, name: "ResolutionType", file: !77, line: 93, baseType: !96)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "montage", scope: !567, file: !77, line: 199, baseType: !556, size: 64, offset: 1856)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "directory", scope: !567, file: !77, line: 200, baseType: !556, size: 64, offset: 1920)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "geometry", scope: !567, file: !77, line: 201, baseType: !556, size: 64, offset: 1984)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !567, file: !77, line: 204, baseType: !615, size: 64, offset: 2048)
!615 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !616, line: 77, baseType: !617)
!616 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!617 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !618, line: 193, baseType: !619)
!618 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!619 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "x_resolution", scope: !567, file: !77, line: 207, baseType: !543, size: 64, offset: 2112)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "y_resolution", scope: !567, file: !77, line: 208, baseType: !543, size: 64, offset: 2176)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !567, file: !77, line: 211, baseType: !623, size: 256, offset: 2240)
!623 = !DIDerivedType(tag: DW_TAG_typedef, name: "RectangleInfo", file: !153, line: 130, baseType: !624)
!624 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_RectangleInfo", file: !153, line: 121, size: 256, elements: !625)
!625 = !{!626, !627, !628, !629}
!626 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !624, file: !153, line: 124, baseType: !576, size: 64)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !624, file: !153, line: 125, baseType: !576, size: 64, offset: 64)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !624, file: !153, line: 128, baseType: !615, size: 64, offset: 128)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !624, file: !153, line: 129, baseType: !615, size: 64, offset: 192)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "extract_info", scope: !567, file: !77, line: 212, baseType: !623, size: 256, offset: 2496)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "tile_info", scope: !567, file: !77, line: 213, baseType: !623, size: 256, offset: 2752)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "bias", scope: !567, file: !77, line: 216, baseType: !543, size: 64, offset: 3008)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "blur", scope: !567, file: !77, line: 217, baseType: !543, size: 64, offset: 3072)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !567, file: !77, line: 218, baseType: !543, size: 64, offset: 3136)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !567, file: !77, line: 221, baseType: !636, size: 32, offset: 3200)
!636 = !DIDerivedType(tag: DW_TAG_typedef, name: "FilterTypes", file: !102, line: 66, baseType: !101)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "interlace", scope: !567, file: !77, line: 224, baseType: !638, size: 32, offset: 3232)
!638 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterlaceType", file: !77, line: 73, baseType: !136)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !567, file: !77, line: 227, baseType: !640, size: 32, offset: 3264)
!640 = !DIDerivedType(tag: DW_TAG_typedef, name: "EndianType", file: !147, line: 35, baseType: !146)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !567, file: !77, line: 230, baseType: !642, size: 32, offset: 3296)
!642 = !DIDerivedType(tag: DW_TAG_typedef, name: "GravityType", file: !153, line: 91, baseType: !152)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !567, file: !77, line: 233, baseType: !644, size: 32, offset: 3328)
!644 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompositeOperator", file: !168, line: 99, baseType: !167)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "dispose", scope: !567, file: !77, line: 236, baseType: !646, size: 32, offset: 3360)
!646 = !DIDerivedType(tag: DW_TAG_typedef, name: "DisposeType", file: !239, line: 32, baseType: !238)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "clip_mask", scope: !567, file: !77, line: 239, baseType: !648, size: 64, offset: 3392)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !567, file: !77, line: 242, baseType: !576, size: 64, offset: 3456)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !567, file: !77, line: 243, baseType: !576, size: 64, offset: 3520)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_second", scope: !567, file: !77, line: 246, baseType: !615, size: 64, offset: 3584)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "iterations", scope: !567, file: !77, line: 249, baseType: !576, size: 64, offset: 3648)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "total_colors", scope: !567, file: !77, line: 250, baseType: !576, size: 64, offset: 3712)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "start_loop", scope: !567, file: !77, line: 253, baseType: !615, size: 64, offset: 3776)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !567, file: !77, line: 256, baseType: !656, size: 192, offset: 3840)
!656 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErrorInfo", file: !657, line: 68, baseType: !658)
!657 = !DIFile(filename: "./magick/color.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!658 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ErrorInfo", file: !657, line: 62, size: 192, elements: !659)
!659 = !{!660, !661, !662}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "mean_error_per_pixel", scope: !658, file: !657, line: 65, baseType: !543, size: 64)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_mean_error", scope: !658, file: !657, line: 66, baseType: !543, size: 64, offset: 64)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_maximum_error", scope: !658, file: !657, line: 67, baseType: !543, size: 64, offset: 128)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !567, file: !77, line: 259, baseType: !664, size: 512, offset: 4032)
!664 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerInfo", file: !247, line: 51, baseType: !665)
!665 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TimerInfo", file: !247, line: 40, size: 512, elements: !666)
!666 = !{!667, !674, !675, !677}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !665, file: !247, line: 43, baseType: !668, size: 192)
!668 = !DIDerivedType(tag: DW_TAG_typedef, name: "Timer", file: !247, line: 38, baseType: !669)
!669 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Timer", file: !247, line: 32, size: 192, elements: !670)
!670 = !{!671, !672, !673}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !669, file: !247, line: 35, baseType: !543, size: 64)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !669, file: !247, line: 36, baseType: !543, size: 64, offset: 64)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !669, file: !247, line: 37, baseType: !543, size: 64, offset: 128)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "elapsed", scope: !665, file: !247, line: 44, baseType: !668, size: 192, offset: 192)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !665, file: !247, line: 47, baseType: !676, size: 32, offset: 384)
!676 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerState", file: !247, line: 30, baseType: !246)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !665, file: !247, line: 50, baseType: !576, size: 64, offset: 448)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !567, file: !77, line: 262, baseType: !679, size: 64, offset: 4544)
!679 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickProgressMonitor", file: !680, line: 26, baseType: !681)
!680 = !DIFile(filename: "./magick/monitor.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64)
!682 = !DISubroutineType(types: !683)
!683 = !{!581, !547, !684, !687, !550}
!684 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !685)
!685 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickOffsetType", file: !4, line: 150, baseType: !686)
!686 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!687 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !688)
!688 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickSizeType", file: !4, line: 151, baseType: !689)
!689 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !567, file: !77, line: 265, baseType: !550, size: 64, offset: 4608)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !567, file: !77, line: 266, baseType: !550, size: 64, offset: 4672)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !567, file: !77, line: 267, baseType: !550, size: 64, offset: 4736)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "ascii85", scope: !567, file: !77, line: 270, baseType: !694, size: 64, offset: 4800)
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 64)
!695 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ascii85Info", file: !52, line: 52, baseType: !696)
!696 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Ascii85Info", file: !52, line: 51, flags: DIFlagFwdDecl)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !567, file: !77, line: 273, baseType: !698, size: 64, offset: 4864)
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 64)
!699 = !DIDerivedType(tag: DW_TAG_typedef, name: "BlobInfo", file: !4, line: 217, baseType: !700)
!700 = !DICompositeType(tag: DW_TAG_structure_type, name: "_BlobInfo", file: !4, line: 217, flags: DIFlagFwdDecl)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !567, file: !77, line: 276, baseType: !702, size: 32768, offset: 4928)
!702 = !DICompositeType(tag: DW_TAG_array_type, baseType: !549, size: 32768, elements: !703)
!703 = !{!704}
!704 = !DISubrange(count: 4096)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "magick_filename", scope: !567, file: !77, line: 277, baseType: !702, size: 32768, offset: 37696)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !567, file: !77, line: 278, baseType: !702, size: 32768, offset: 70464)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "magick_columns", scope: !567, file: !77, line: 281, baseType: !576, size: 64, offset: 103232)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "magick_rows", scope: !567, file: !77, line: 282, baseType: !576, size: 64, offset: 103296)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "exception", scope: !567, file: !77, line: 285, baseType: !710, size: 448, offset: 103360)
!710 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionInfo", file: !4, line: 219, baseType: !711)
!711 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ExceptionInfo", file: !253, line: 102, size: 448, elements: !712)
!712 = !{!713, !715, !716, !717, !718, !719, !720, !725}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "severity", scope: !711, file: !253, line: 105, baseType: !714, size: 32)
!714 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionType", file: !253, line: 100, baseType: !252)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "error_number", scope: !711, file: !253, line: 108, baseType: !468, size: 32, offset: 32)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !711, file: !253, line: 111, baseType: !556, size: 64, offset: 64)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !711, file: !253, line: 112, baseType: !556, size: 64, offset: 128)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "exceptions", scope: !711, file: !253, line: 115, baseType: !550, size: 64, offset: 192)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "relinquish", scope: !711, file: !253, line: 118, baseType: !581, size: 32, offset: 256)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !711, file: !253, line: 121, baseType: !721, size: 64, offset: 320)
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 64)
!722 = !DIDerivedType(tag: DW_TAG_typedef, name: "SemaphoreInfo", file: !723, line: 26, baseType: !724)
!723 = !DIFile(filename: "./magick/semaphore.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!724 = !DICompositeType(tag: DW_TAG_structure_type, name: "SemaphoreInfo", file: !723, line: 25, flags: DIFlagFwdDecl)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !711, file: !253, line: 124, baseType: !576, size: 64, offset: 384)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !567, file: !77, line: 288, baseType: !581, size: 32, offset: 103808)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !567, file: !77, line: 291, baseType: !728, size: 64, offset: 103872)
!728 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !615)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !567, file: !77, line: 294, baseType: !721, size: 64, offset: 103936)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "color_profile", scope: !567, file: !77, line: 297, baseType: !731, size: 256, offset: 104000)
!731 = !DIDerivedType(tag: DW_TAG_typedef, name: "ProfileInfo", file: !89, line: 40, baseType: !732)
!732 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ProfileInfo", file: !89, line: 27, size: 256, elements: !733)
!733 = !{!734, !735, !736, !739}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !732, file: !89, line: 30, baseType: !556, size: 64)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !732, file: !89, line: 33, baseType: !576, size: 64, offset: 64)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !732, file: !89, line: 36, baseType: !737, size: 64, offset: 128)
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !738, size: 64)
!738 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !732, file: !89, line: 39, baseType: !576, size: 64, offset: 192)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "iptc_profile", scope: !567, file: !77, line: 298, baseType: !731, size: 256, offset: 104256)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profile", scope: !567, file: !77, line: 299, baseType: !742, size: 64, offset: 104512)
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 64)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profiles", scope: !567, file: !77, line: 302, baseType: !576, size: 64, offset: 104576)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !567, file: !77, line: 305, baseType: !576, size: 64, offset: 104640)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !567, file: !77, line: 308, baseType: !648, size: 64, offset: 104704)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !567, file: !77, line: 309, baseType: !648, size: 64, offset: 104768)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !567, file: !77, line: 310, baseType: !648, size: 64, offset: 104832)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "interpolate", scope: !567, file: !77, line: 313, baseType: !749, size: 32, offset: 104896)
!749 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterpolatePixelMethod", file: !326, line: 47, baseType: !325)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "black_point_compensation", scope: !567, file: !77, line: 316, baseType: !581, size: 32, offset: 104928)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_color", scope: !567, file: !77, line: 319, baseType: !558, size: 64, offset: 104960)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !567, file: !77, line: 322, baseType: !648, size: 64, offset: 105024)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "tile_offset", scope: !567, file: !77, line: 325, baseType: !623, size: 256, offset: 105088)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !567, file: !77, line: 328, baseType: !550, size: 64, offset: 105344)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "artifacts", scope: !567, file: !77, line: 329, baseType: !550, size: 64, offset: 105408)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !567, file: !77, line: 332, baseType: !757, size: 32, offset: 105472)
!757 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageType", file: !77, line: 61, baseType: !342)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !567, file: !77, line: 335, baseType: !581, size: 32, offset: 105504)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !567, file: !77, line: 338, baseType: !688, size: 64, offset: 105536)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "ping", scope: !567, file: !77, line: 341, baseType: !581, size: 32, offset: 105600)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !567, file: !77, line: 344, baseType: !576, size: 64, offset: 105664)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !567, file: !77, line: 347, baseType: !763, size: 64, offset: 105728)
!763 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !764, line: 7, baseType: !765)
!764 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "")
!765 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !618, line: 160, baseType: !619)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "intensity", scope: !567, file: !77, line: 350, baseType: !767, size: 32, offset: 105792)
!767 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelIntensityMethod", file: !326, line: 79, baseType: !356)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !567, file: !77, line: 353, baseType: !576, size: 64, offset: 105856)
!769 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickRealType", file: !4, line: 78, baseType: !770)
!770 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 64)
!772 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickPixelPacket", file: !326, line: 127, baseType: !773)
!773 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MagickPixelPacket", file: !326, line: 104, size: 448, elements: !774)
!774 = !{!775, !776, !777, !778, !779, !780, !781, !782, !783, !784}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "storage_class", scope: !773, file: !326, line: 107, baseType: !570, size: 32)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !773, file: !326, line: 110, baseType: !572, size: 32, offset: 32)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "matte", scope: !773, file: !326, line: 113, baseType: !581, size: 32, offset: 64)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !773, file: !326, line: 116, baseType: !543, size: 64, offset: 128)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !773, file: !326, line: 119, baseType: !576, size: 64, offset: 192)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !773, file: !326, line: 122, baseType: !769, size: 32, offset: 256)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !773, file: !326, line: 123, baseType: !769, size: 32, offset: 288)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !773, file: !326, line: 124, baseType: !769, size: 32, offset: 320)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !773, file: !326, line: 125, baseType: !769, size: 32, offset: 352)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !773, file: !326, line: 126, baseType: !769, size: 32, offset: 384)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 64)
!786 = !DIDerivedType(tag: DW_TAG_typedef, name: "IndexPacket", file: !326, line: 129, baseType: !544)
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 64)
!788 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !786)
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !790, size: 64)
!790 = !DIDerivedType(tag: DW_TAG_typedef, name: "QuantumPixelPacket", file: !326, line: 158, baseType: !791)
!791 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QuantumPixelPacket", file: !326, line: 150, size: 80, elements: !792)
!792 = !{!793, !794, !795, !796, !797}
!793 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !791, file: !326, line: 153, baseType: !544, size: 16)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !791, file: !326, line: 154, baseType: !544, size: 16, offset: 16)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !791, file: !326, line: 155, baseType: !544, size: 16, offset: 32)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !791, file: !326, line: 156, baseType: !544, size: 16, offset: 48)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !791, file: !326, line: 157, baseType: !544, size: 16, offset: 64)
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !799, size: 64)
!799 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !558)
!800 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChannelType", file: !4, line: 202, baseType: !368)
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64)
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 64)
!803 = !{i32 7, !"Dwarf Version", i32 4}
!804 = !{i32 2, !"Debug Info Version", i32 3}
!805 = !{i32 1, !"wchar_size", i32 4}
!806 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!807 = distinct !DISubprogram(name: "AutoGammaImage", scope: !1, file: !1, line: 115, type: !808, scopeLine: 116, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !810)
!808 = !DISubroutineType(types: !809)
!809 = !{!581, !565}
!810 = !{}
!811 = !DILocalVariable(name: "image", arg: 1, scope: !807, file: !1, line: 115, type: !565)
!812 = !DILocation(line: 115, column: 54, scope: !807)
!813 = !DILocation(line: 117, column: 32, scope: !807)
!814 = !DILocation(line: 117, column: 10, scope: !807)
!815 = !DILocation(line: 117, column: 3, scope: !807)
!816 = distinct !DISubprogram(name: "AutoGammaImageChannel", scope: !1, file: !1, line: 120, type: !817, scopeLine: 122, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !810)
!817 = !DISubroutineType(types: !818)
!818 = !{!581, !565, !819}
!819 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !800)
!820 = !DILocalVariable(name: "image", arg: 1, scope: !816, file: !1, line: 120, type: !565)
!821 = !DILocation(line: 120, column: 61, scope: !816)
!822 = !DILocalVariable(name: "channel", arg: 2, scope: !816, file: !1, line: 121, type: !819)
!823 = !DILocation(line: 121, column: 21, scope: !816)
!824 = !DILocalVariable(name: "gamma", scope: !816, file: !1, line: 124, type: !543)
!825 = !DILocation(line: 124, column: 5, scope: !816)
!826 = !DILocalVariable(name: "mean", scope: !816, file: !1, line: 125, type: !543)
!827 = !DILocation(line: 125, column: 5, scope: !816)
!828 = !DILocalVariable(name: "logmean", scope: !816, file: !1, line: 126, type: !543)
!829 = !DILocation(line: 126, column: 5, scope: !816)
!830 = !DILocalVariable(name: "sans", scope: !816, file: !1, line: 127, type: !543)
!831 = !DILocation(line: 127, column: 5, scope: !816)
!832 = !DILocalVariable(name: "status", scope: !816, file: !1, line: 130, type: !833)
!833 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickStatusType", file: !4, line: 147, baseType: !5)
!834 = !DILocation(line: 130, column: 5, scope: !816)
!835 = !DILocation(line: 132, column: 11, scope: !816)
!836 = !DILocation(line: 132, column: 10, scope: !816)
!837 = !DILocation(line: 133, column: 8, scope: !838)
!838 = distinct !DILexicalBlock(scope: !816, file: !1, line: 133, column: 7)
!839 = !DILocation(line: 133, column: 16, scope: !838)
!840 = !DILocation(line: 133, column: 32, scope: !838)
!841 = !DILocation(line: 133, column: 7, scope: !816)
!842 = !DILocation(line: 138, column: 34, scope: !843)
!843 = distinct !DILexicalBlock(scope: !838, file: !1, line: 134, column: 5)
!844 = !DILocation(line: 138, column: 40, scope: !843)
!845 = !DILocation(line: 138, column: 61, scope: !843)
!846 = !DILocation(line: 138, column: 68, scope: !843)
!847 = !DILocation(line: 138, column: 14, scope: !843)
!848 = !DILocation(line: 139, column: 17, scope: !843)
!849 = !DILocation(line: 139, column: 21, scope: !843)
!850 = !DILocation(line: 139, column: 13, scope: !843)
!851 = !DILocation(line: 139, column: 36, scope: !843)
!852 = !DILocation(line: 139, column: 35, scope: !843)
!853 = !DILocation(line: 139, column: 12, scope: !843)
!854 = !DILocation(line: 140, column: 32, scope: !843)
!855 = !DILocation(line: 140, column: 38, scope: !843)
!856 = !DILocation(line: 140, column: 72, scope: !843)
!857 = !DILocation(line: 140, column: 14, scope: !843)
!858 = !DILocation(line: 140, column: 7, scope: !843)
!859 = !DILocation(line: 145, column: 10, scope: !816)
!860 = !DILocation(line: 146, column: 8, scope: !861)
!861 = distinct !DILexicalBlock(scope: !816, file: !1, line: 146, column: 7)
!862 = !DILocation(line: 146, column: 16, scope: !861)
!863 = !DILocation(line: 146, column: 30, scope: !861)
!864 = !DILocation(line: 146, column: 7, scope: !816)
!865 = !DILocation(line: 148, column: 34, scope: !866)
!866 = distinct !DILexicalBlock(scope: !861, file: !1, line: 147, column: 5)
!867 = !DILocation(line: 149, column: 10, scope: !866)
!868 = !DILocation(line: 149, column: 17, scope: !866)
!869 = !DILocation(line: 148, column: 14, scope: !866)
!870 = !DILocation(line: 150, column: 17, scope: !866)
!871 = !DILocation(line: 150, column: 21, scope: !866)
!872 = !DILocation(line: 150, column: 13, scope: !866)
!873 = !DILocation(line: 150, column: 36, scope: !866)
!874 = !DILocation(line: 150, column: 35, scope: !866)
!875 = !DILocation(line: 150, column: 12, scope: !866)
!876 = !DILocation(line: 151, column: 33, scope: !866)
!877 = !DILocation(line: 152, column: 9, scope: !866)
!878 = !DILocation(line: 151, column: 15, scope: !866)
!879 = !DILocation(line: 151, column: 13, scope: !866)
!880 = !DILocation(line: 153, column: 5, scope: !866)
!881 = !DILocation(line: 154, column: 8, scope: !882)
!882 = distinct !DILexicalBlock(scope: !816, file: !1, line: 154, column: 7)
!883 = !DILocation(line: 154, column: 16, scope: !882)
!884 = !DILocation(line: 154, column: 32, scope: !882)
!885 = !DILocation(line: 154, column: 7, scope: !816)
!886 = !DILocation(line: 156, column: 34, scope: !887)
!887 = distinct !DILexicalBlock(scope: !882, file: !1, line: 155, column: 5)
!888 = !DILocation(line: 157, column: 10, scope: !887)
!889 = !DILocation(line: 157, column: 17, scope: !887)
!890 = !DILocation(line: 156, column: 14, scope: !887)
!891 = !DILocation(line: 158, column: 17, scope: !887)
!892 = !DILocation(line: 158, column: 21, scope: !887)
!893 = !DILocation(line: 158, column: 13, scope: !887)
!894 = !DILocation(line: 158, column: 36, scope: !887)
!895 = !DILocation(line: 158, column: 35, scope: !887)
!896 = !DILocation(line: 158, column: 12, scope: !887)
!897 = !DILocation(line: 159, column: 33, scope: !887)
!898 = !DILocation(line: 160, column: 9, scope: !887)
!899 = !DILocation(line: 159, column: 15, scope: !887)
!900 = !DILocation(line: 159, column: 13, scope: !887)
!901 = !DILocation(line: 161, column: 5, scope: !887)
!902 = !DILocation(line: 162, column: 8, scope: !903)
!903 = distinct !DILexicalBlock(scope: !816, file: !1, line: 162, column: 7)
!904 = !DILocation(line: 162, column: 16, scope: !903)
!905 = !DILocation(line: 162, column: 31, scope: !903)
!906 = !DILocation(line: 162, column: 7, scope: !816)
!907 = !DILocation(line: 164, column: 34, scope: !908)
!908 = distinct !DILexicalBlock(scope: !903, file: !1, line: 163, column: 5)
!909 = !DILocation(line: 165, column: 10, scope: !908)
!910 = !DILocation(line: 165, column: 17, scope: !908)
!911 = !DILocation(line: 164, column: 14, scope: !908)
!912 = !DILocation(line: 166, column: 17, scope: !908)
!913 = !DILocation(line: 166, column: 21, scope: !908)
!914 = !DILocation(line: 166, column: 13, scope: !908)
!915 = !DILocation(line: 166, column: 36, scope: !908)
!916 = !DILocation(line: 166, column: 35, scope: !908)
!917 = !DILocation(line: 166, column: 12, scope: !908)
!918 = !DILocation(line: 167, column: 33, scope: !908)
!919 = !DILocation(line: 168, column: 9, scope: !908)
!920 = !DILocation(line: 167, column: 15, scope: !908)
!921 = !DILocation(line: 167, column: 13, scope: !908)
!922 = !DILocation(line: 169, column: 5, scope: !908)
!923 = !DILocation(line: 170, column: 9, scope: !924)
!924 = distinct !DILexicalBlock(scope: !816, file: !1, line: 170, column: 7)
!925 = !DILocation(line: 170, column: 17, scope: !924)
!926 = !DILocation(line: 170, column: 35, scope: !924)
!927 = !DILocation(line: 170, column: 41, scope: !924)
!928 = !DILocation(line: 171, column: 8, scope: !924)
!929 = !DILocation(line: 171, column: 15, scope: !924)
!930 = !DILocation(line: 171, column: 21, scope: !924)
!931 = !DILocation(line: 170, column: 7, scope: !816)
!932 = !DILocation(line: 173, column: 34, scope: !933)
!933 = distinct !DILexicalBlock(scope: !924, file: !1, line: 172, column: 5)
!934 = !DILocation(line: 174, column: 10, scope: !933)
!935 = !DILocation(line: 174, column: 17, scope: !933)
!936 = !DILocation(line: 173, column: 14, scope: !933)
!937 = !DILocation(line: 175, column: 17, scope: !933)
!938 = !DILocation(line: 175, column: 21, scope: !933)
!939 = !DILocation(line: 175, column: 13, scope: !933)
!940 = !DILocation(line: 175, column: 36, scope: !933)
!941 = !DILocation(line: 175, column: 35, scope: !933)
!942 = !DILocation(line: 175, column: 12, scope: !933)
!943 = !DILocation(line: 176, column: 33, scope: !933)
!944 = !DILocation(line: 177, column: 9, scope: !933)
!945 = !DILocation(line: 176, column: 15, scope: !933)
!946 = !DILocation(line: 176, column: 13, scope: !933)
!947 = !DILocation(line: 178, column: 5, scope: !933)
!948 = !DILocation(line: 179, column: 9, scope: !949)
!949 = distinct !DILexicalBlock(scope: !816, file: !1, line: 179, column: 7)
!950 = !DILocation(line: 179, column: 17, scope: !949)
!951 = !DILocation(line: 179, column: 33, scope: !949)
!952 = !DILocation(line: 179, column: 39, scope: !949)
!953 = !DILocation(line: 180, column: 8, scope: !949)
!954 = !DILocation(line: 180, column: 15, scope: !949)
!955 = !DILocation(line: 180, column: 26, scope: !949)
!956 = !DILocation(line: 179, column: 7, scope: !816)
!957 = !DILocation(line: 182, column: 34, scope: !958)
!958 = distinct !DILexicalBlock(scope: !949, file: !1, line: 181, column: 5)
!959 = !DILocation(line: 183, column: 10, scope: !958)
!960 = !DILocation(line: 183, column: 17, scope: !958)
!961 = !DILocation(line: 182, column: 14, scope: !958)
!962 = !DILocation(line: 184, column: 17, scope: !958)
!963 = !DILocation(line: 184, column: 21, scope: !958)
!964 = !DILocation(line: 184, column: 13, scope: !958)
!965 = !DILocation(line: 184, column: 36, scope: !958)
!966 = !DILocation(line: 184, column: 35, scope: !958)
!967 = !DILocation(line: 184, column: 12, scope: !958)
!968 = !DILocation(line: 185, column: 33, scope: !958)
!969 = !DILocation(line: 186, column: 9, scope: !958)
!970 = !DILocation(line: 185, column: 15, scope: !958)
!971 = !DILocation(line: 185, column: 13, scope: !958)
!972 = !DILocation(line: 187, column: 5, scope: !958)
!973 = !DILocation(line: 188, column: 10, scope: !816)
!974 = !DILocation(line: 188, column: 17, scope: !816)
!975 = !DILocation(line: 188, column: 3, scope: !816)
!976 = !DILocation(line: 189, column: 1, scope: !816)
!977 = distinct !DISubprogram(name: "LevelImageChannel", scope: !1, file: !1, line: 2931, type: !978, scopeLine: 2934, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !810)
!978 = !DISubroutineType(types: !979)
!979 = !{!581, !565, !819, !980, !980, !980}
!980 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !543)
!981 = !DILocalVariable(name: "image", arg: 1, scope: !977, file: !1, line: 2931, type: !565)
!982 = !DILocation(line: 2931, column: 57, scope: !977)
!983 = !DILocalVariable(name: "channel", arg: 2, scope: !977, file: !1, line: 2932, type: !819)
!984 = !DILocation(line: 2932, column: 21, scope: !977)
!985 = !DILocalVariable(name: "black_point", arg: 3, scope: !977, file: !1, line: 2932, type: !980)
!986 = !DILocation(line: 2932, column: 42, scope: !977)
!987 = !DILocalVariable(name: "white_point", arg: 4, scope: !977, file: !1, line: 2932, type: !980)
!988 = !DILocation(line: 2932, column: 67, scope: !977)
!989 = !DILocalVariable(name: "gamma", arg: 5, scope: !977, file: !1, line: 2933, type: !980)
!990 = !DILocation(line: 2933, column: 16, scope: !977)
!991 = !DILocalVariable(name: "image_view", scope: !977, file: !1, line: 2938, type: !992)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 64)
!993 = !DIDerivedType(tag: DW_TAG_typedef, name: "CacheView", file: !994, line: 50, baseType: !995)
!994 = !DIFile(filename: "./magick/cache-view.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!995 = !DICompositeType(tag: DW_TAG_structure_type, name: "_CacheView", file: !326, line: 160, flags: DIFlagFwdDecl)
!996 = !DILocation(line: 2938, column: 6, scope: !977)
!997 = !DILocalVariable(name: "exception", scope: !977, file: !1, line: 2941, type: !998)
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 64)
!999 = !DILocation(line: 2941, column: 6, scope: !977)
!1000 = !DILocalVariable(name: "status", scope: !977, file: !1, line: 2944, type: !581)
!1001 = !DILocation(line: 2944, column: 5, scope: !977)
!1002 = !DILocalVariable(name: "progress", scope: !977, file: !1, line: 2947, type: !685)
!1003 = !DILocation(line: 2947, column: 5, scope: !977)
!1004 = !DILocalVariable(name: "i", scope: !977, file: !1, line: 2950, type: !615)
!1005 = !DILocation(line: 2950, column: 5, scope: !977)
!1006 = !DILocalVariable(name: "y", scope: !977, file: !1, line: 2953, type: !615)
!1007 = !DILocation(line: 2953, column: 5, scope: !977)
!1008 = !DILocation(line: 2960, column: 7, scope: !1009)
!1009 = distinct !DILexicalBlock(scope: !977, file: !1, line: 2960, column: 7)
!1010 = !DILocation(line: 2960, column: 14, scope: !1009)
!1011 = !DILocation(line: 2960, column: 20, scope: !1009)
!1012 = !DILocation(line: 2960, column: 7, scope: !977)
!1013 = !DILocation(line: 2961, column: 61, scope: !1009)
!1014 = !DILocation(line: 2961, column: 68, scope: !1009)
!1015 = !DILocation(line: 2961, column: 12, scope: !1009)
!1016 = !DILocation(line: 2961, column: 5, scope: !1009)
!1017 = !DILocation(line: 2962, column: 7, scope: !1018)
!1018 = distinct !DILexicalBlock(scope: !977, file: !1, line: 2962, column: 7)
!1019 = !DILocation(line: 2962, column: 14, scope: !1018)
!1020 = !DILocation(line: 2962, column: 28, scope: !1018)
!1021 = !DILocation(line: 2962, column: 7, scope: !977)
!1022 = !DILocation(line: 2963, column: 11, scope: !1023)
!1023 = distinct !DILexicalBlock(scope: !1018, file: !1, line: 2963, column: 5)
!1024 = !DILocation(line: 2963, column: 10, scope: !1023)
!1025 = !DILocation(line: 2963, column: 15, scope: !1026)
!1026 = distinct !DILexicalBlock(scope: !1023, file: !1, line: 2963, column: 5)
!1027 = !DILocation(line: 2963, column: 29, scope: !1026)
!1028 = !DILocation(line: 2963, column: 36, scope: !1026)
!1029 = !DILocation(line: 2963, column: 17, scope: !1026)
!1030 = !DILocation(line: 2963, column: 5, scope: !1023)
!1031 = !DILocation(line: 2968, column: 12, scope: !1032)
!1032 = distinct !DILexicalBlock(scope: !1033, file: !1, line: 2968, column: 11)
!1033 = distinct !DILexicalBlock(scope: !1026, file: !1, line: 2964, column: 5)
!1034 = !DILocation(line: 2968, column: 20, scope: !1032)
!1035 = !DILocation(line: 2968, column: 34, scope: !1032)
!1036 = !DILocation(line: 2968, column: 11, scope: !1033)
!1037 = !DILocation(line: 2969, column: 68, scope: !1032)
!1038 = !DILocation(line: 2970, column: 11, scope: !1032)
!1039 = !DILocation(line: 2970, column: 23, scope: !1032)
!1040 = !DILocation(line: 2970, column: 46, scope: !1032)
!1041 = !DILocation(line: 2970, column: 53, scope: !1032)
!1042 = !DILocation(line: 2970, column: 62, scope: !1032)
!1043 = !DILocation(line: 2970, column: 65, scope: !1032)
!1044 = !DILocation(line: 2970, column: 29, scope: !1032)
!1045 = !DILocation(line: 2969, column: 57, scope: !1032)
!1046 = !DILocation(line: 2969, column: 42, scope: !1032)
!1047 = !DILocation(line: 2969, column: 9, scope: !1032)
!1048 = !DILocation(line: 2969, column: 16, scope: !1032)
!1049 = !DILocation(line: 2969, column: 25, scope: !1032)
!1050 = !DILocation(line: 2969, column: 28, scope: !1032)
!1051 = !DILocation(line: 2969, column: 31, scope: !1032)
!1052 = !DILocation(line: 2971, column: 12, scope: !1053)
!1053 = distinct !DILexicalBlock(scope: !1033, file: !1, line: 2971, column: 11)
!1054 = !DILocation(line: 2971, column: 20, scope: !1053)
!1055 = !DILocation(line: 2971, column: 36, scope: !1053)
!1056 = !DILocation(line: 2971, column: 11, scope: !1033)
!1057 = !DILocation(line: 2973, column: 11, scope: !1053)
!1058 = !DILocation(line: 2973, column: 23, scope: !1053)
!1059 = !DILocation(line: 2973, column: 35, scope: !1053)
!1060 = !DILocation(line: 2974, column: 11, scope: !1053)
!1061 = !DILocation(line: 2974, column: 18, scope: !1053)
!1062 = !DILocation(line: 2974, column: 27, scope: !1053)
!1063 = !DILocation(line: 2974, column: 30, scope: !1053)
!1064 = !DILocation(line: 2973, column: 41, scope: !1053)
!1065 = !DILocation(line: 2972, column: 59, scope: !1053)
!1066 = !DILocation(line: 2972, column: 44, scope: !1053)
!1067 = !DILocation(line: 2972, column: 9, scope: !1053)
!1068 = !DILocation(line: 2972, column: 16, scope: !1053)
!1069 = !DILocation(line: 2972, column: 25, scope: !1053)
!1070 = !DILocation(line: 2972, column: 28, scope: !1053)
!1071 = !DILocation(line: 2972, column: 33, scope: !1053)
!1072 = !DILocation(line: 2975, column: 12, scope: !1073)
!1073 = distinct !DILexicalBlock(scope: !1033, file: !1, line: 2975, column: 11)
!1074 = !DILocation(line: 2975, column: 20, scope: !1073)
!1075 = !DILocation(line: 2975, column: 35, scope: !1073)
!1076 = !DILocation(line: 2975, column: 11, scope: !1033)
!1077 = !DILocation(line: 2976, column: 69, scope: !1073)
!1078 = !DILocation(line: 2977, column: 11, scope: !1073)
!1079 = !DILocation(line: 2977, column: 23, scope: !1073)
!1080 = !DILocation(line: 2977, column: 46, scope: !1073)
!1081 = !DILocation(line: 2977, column: 53, scope: !1073)
!1082 = !DILocation(line: 2977, column: 62, scope: !1073)
!1083 = !DILocation(line: 2977, column: 65, scope: !1073)
!1084 = !DILocation(line: 2977, column: 29, scope: !1073)
!1085 = !DILocation(line: 2976, column: 58, scope: !1073)
!1086 = !DILocation(line: 2976, column: 43, scope: !1073)
!1087 = !DILocation(line: 2976, column: 9, scope: !1073)
!1088 = !DILocation(line: 2976, column: 16, scope: !1073)
!1089 = !DILocation(line: 2976, column: 25, scope: !1073)
!1090 = !DILocation(line: 2976, column: 28, scope: !1073)
!1091 = !DILocation(line: 2976, column: 32, scope: !1073)
!1092 = !DILocation(line: 2978, column: 12, scope: !1093)
!1093 = distinct !DILexicalBlock(scope: !1033, file: !1, line: 2978, column: 11)
!1094 = !DILocation(line: 2978, column: 20, scope: !1093)
!1095 = !DILocation(line: 2978, column: 38, scope: !1093)
!1096 = !DILocation(line: 2978, column: 11, scope: !1033)
!1097 = !DILocation(line: 2980, column: 37, scope: !1093)
!1098 = !DILocation(line: 2980, column: 49, scope: !1093)
!1099 = !DILocation(line: 2980, column: 61, scope: !1093)
!1100 = !DILocation(line: 2981, column: 42, scope: !1093)
!1101 = !DILocation(line: 2981, column: 49, scope: !1093)
!1102 = !DILocation(line: 2981, column: 58, scope: !1093)
!1103 = !DILocation(line: 2981, column: 61, scope: !1093)
!1104 = !DILocation(line: 2981, column: 41, scope: !1093)
!1105 = !DILocation(line: 2981, column: 11, scope: !1093)
!1106 = !DILocation(line: 2980, column: 26, scope: !1093)
!1107 = !DILocation(line: 2980, column: 11, scope: !1093)
!1108 = !DILocation(line: 2979, column: 60, scope: !1093)
!1109 = !DILocation(line: 2979, column: 59, scope: !1093)
!1110 = !DILocation(line: 2979, column: 36, scope: !1093)
!1111 = !DILocation(line: 2979, column: 9, scope: !1093)
!1112 = !DILocation(line: 2979, column: 16, scope: !1093)
!1113 = !DILocation(line: 2979, column: 25, scope: !1093)
!1114 = !DILocation(line: 2979, column: 28, scope: !1093)
!1115 = !DILocation(line: 2979, column: 35, scope: !1093)
!1116 = !DILocation(line: 2982, column: 5, scope: !1033)
!1117 = !DILocation(line: 2963, column: 45, scope: !1026)
!1118 = !DILocation(line: 2963, column: 5, scope: !1026)
!1119 = distinct !{!1119, !1030, !1120}
!1120 = !DILocation(line: 2982, column: 5, scope: !1023)
!1121 = !DILocation(line: 2986, column: 9, scope: !977)
!1122 = !DILocation(line: 2987, column: 11, scope: !977)
!1123 = !DILocation(line: 2988, column: 15, scope: !977)
!1124 = !DILocation(line: 2988, column: 22, scope: !977)
!1125 = !DILocation(line: 2988, column: 12, scope: !977)
!1126 = !DILocation(line: 2989, column: 40, scope: !977)
!1127 = !DILocation(line: 2989, column: 46, scope: !977)
!1128 = !DILocation(line: 2989, column: 14, scope: !977)
!1129 = !DILocation(line: 2989, column: 13, scope: !977)
!1130 = !DILocation(line: 2994, column: 9, scope: !1131)
!1131 = distinct !DILexicalBlock(scope: !977, file: !1, line: 2994, column: 3)
!1132 = !DILocation(line: 2994, column: 8, scope: !1131)
!1133 = !DILocation(line: 2994, column: 13, scope: !1134)
!1134 = distinct !DILexicalBlock(scope: !1131, file: !1, line: 2994, column: 3)
!1135 = !DILocation(line: 2994, column: 27, scope: !1134)
!1136 = !DILocation(line: 2994, column: 34, scope: !1134)
!1137 = !DILocation(line: 2994, column: 15, scope: !1134)
!1138 = !DILocation(line: 2994, column: 3, scope: !1131)
!1139 = !DILocalVariable(name: "indexes", scope: !1140, file: !1, line: 2997, type: !1141)
!1140 = distinct !DILexicalBlock(scope: !1134, file: !1, line: 2995, column: 3)
!1141 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !785)
!1142 = !DILocation(line: 2997, column: 17, scope: !1140)
!1143 = !DILocalVariable(name: "q", scope: !1140, file: !1, line: 3000, type: !1144)
!1144 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !557)
!1145 = !DILocation(line: 3000, column: 17, scope: !1140)
!1146 = !DILocalVariable(name: "x", scope: !1140, file: !1, line: 3003, type: !615)
!1147 = !DILocation(line: 3003, column: 7, scope: !1140)
!1148 = !DILocation(line: 3005, column: 9, scope: !1149)
!1149 = distinct !DILexicalBlock(scope: !1140, file: !1, line: 3005, column: 9)
!1150 = !DILocation(line: 3005, column: 16, scope: !1149)
!1151 = !DILocation(line: 3005, column: 9, scope: !1140)
!1152 = !DILocation(line: 3006, column: 7, scope: !1149)
!1153 = !DILocation(line: 3007, column: 35, scope: !1140)
!1154 = !DILocation(line: 3007, column: 48, scope: !1140)
!1155 = !DILocation(line: 3007, column: 50, scope: !1140)
!1156 = !DILocation(line: 3007, column: 57, scope: !1140)
!1157 = !DILocation(line: 3007, column: 67, scope: !1140)
!1158 = !DILocation(line: 3007, column: 7, scope: !1140)
!1159 = !DILocation(line: 3007, column: 6, scope: !1140)
!1160 = !DILocation(line: 3008, column: 9, scope: !1161)
!1161 = distinct !DILexicalBlock(scope: !1140, file: !1, line: 3008, column: 9)
!1162 = !DILocation(line: 3008, column: 11, scope: !1161)
!1163 = !DILocation(line: 3008, column: 9, scope: !1140)
!1164 = !DILocation(line: 3010, column: 15, scope: !1165)
!1165 = distinct !DILexicalBlock(scope: !1161, file: !1, line: 3009, column: 7)
!1166 = !DILocation(line: 3011, column: 9, scope: !1165)
!1167 = !DILocation(line: 3013, column: 45, scope: !1140)
!1168 = !DILocation(line: 3013, column: 13, scope: !1140)
!1169 = !DILocation(line: 3013, column: 12, scope: !1140)
!1170 = !DILocation(line: 3014, column: 11, scope: !1171)
!1171 = distinct !DILexicalBlock(scope: !1140, file: !1, line: 3014, column: 5)
!1172 = !DILocation(line: 3014, column: 10, scope: !1171)
!1173 = !DILocation(line: 3014, column: 15, scope: !1174)
!1174 = distinct !DILexicalBlock(scope: !1171, file: !1, line: 3014, column: 5)
!1175 = !DILocation(line: 3014, column: 29, scope: !1174)
!1176 = !DILocation(line: 3014, column: 36, scope: !1174)
!1177 = !DILocation(line: 3014, column: 17, scope: !1174)
!1178 = !DILocation(line: 3014, column: 5, scope: !1171)
!1179 = !DILocation(line: 3016, column: 12, scope: !1180)
!1180 = distinct !DILexicalBlock(scope: !1181, file: !1, line: 3016, column: 11)
!1181 = distinct !DILexicalBlock(scope: !1174, file: !1, line: 3015, column: 5)
!1182 = !DILocation(line: 3016, column: 20, scope: !1180)
!1183 = !DILocation(line: 3016, column: 34, scope: !1180)
!1184 = !DILocation(line: 3016, column: 11, scope: !1181)
!1185 = !DILocation(line: 3017, column: 9, scope: !1180)
!1186 = !DILocation(line: 3019, column: 12, scope: !1187)
!1187 = distinct !DILexicalBlock(scope: !1181, file: !1, line: 3019, column: 11)
!1188 = !DILocation(line: 3019, column: 20, scope: !1187)
!1189 = !DILocation(line: 3019, column: 36, scope: !1187)
!1190 = !DILocation(line: 3019, column: 11, scope: !1181)
!1191 = !DILocation(line: 3020, column: 9, scope: !1187)
!1192 = !DILocation(line: 3022, column: 12, scope: !1193)
!1193 = distinct !DILexicalBlock(scope: !1181, file: !1, line: 3022, column: 11)
!1194 = !DILocation(line: 3022, column: 20, scope: !1193)
!1195 = !DILocation(line: 3022, column: 35, scope: !1193)
!1196 = !DILocation(line: 3022, column: 11, scope: !1181)
!1197 = !DILocation(line: 3023, column: 9, scope: !1193)
!1198 = !DILocation(line: 3025, column: 13, scope: !1199)
!1199 = distinct !DILexicalBlock(scope: !1181, file: !1, line: 3025, column: 11)
!1200 = !DILocation(line: 3025, column: 21, scope: !1199)
!1201 = !DILocation(line: 3025, column: 39, scope: !1199)
!1202 = !DILocation(line: 3025, column: 45, scope: !1199)
!1203 = !DILocation(line: 3026, column: 12, scope: !1199)
!1204 = !DILocation(line: 3026, column: 19, scope: !1199)
!1205 = !DILocation(line: 3026, column: 25, scope: !1199)
!1206 = !DILocation(line: 3025, column: 11, scope: !1181)
!1207 = !DILocation(line: 3027, column: 9, scope: !1199)
!1208 = !DILocation(line: 3029, column: 13, scope: !1209)
!1209 = distinct !DILexicalBlock(scope: !1181, file: !1, line: 3029, column: 11)
!1210 = !DILocation(line: 3029, column: 21, scope: !1209)
!1211 = !DILocation(line: 3029, column: 37, scope: !1209)
!1212 = !DILocation(line: 3029, column: 43, scope: !1209)
!1213 = !DILocation(line: 3030, column: 12, scope: !1209)
!1214 = !DILocation(line: 3030, column: 19, scope: !1209)
!1215 = !DILocation(line: 3030, column: 30, scope: !1209)
!1216 = !DILocation(line: 3029, column: 11, scope: !1181)
!1217 = !DILocation(line: 3031, column: 9, scope: !1218)
!1218 = distinct !DILexicalBlock(scope: !1219, file: !1, line: 3031, column: 9)
!1219 = distinct !DILexicalBlock(scope: !1209, file: !1, line: 3031, column: 9)
!1220 = !DILocation(line: 3031, column: 9, scope: !1219)
!1221 = !DILocation(line: 3033, column: 8, scope: !1181)
!1222 = !DILocation(line: 3034, column: 5, scope: !1181)
!1223 = !DILocation(line: 3014, column: 46, scope: !1174)
!1224 = !DILocation(line: 3014, column: 5, scope: !1174)
!1225 = distinct !{!1225, !1178, !1226}
!1226 = !DILocation(line: 3034, column: 5, scope: !1171)
!1227 = !DILocation(line: 3035, column: 38, scope: !1228)
!1228 = distinct !DILexicalBlock(scope: !1140, file: !1, line: 3035, column: 9)
!1229 = !DILocation(line: 3035, column: 49, scope: !1228)
!1230 = !DILocation(line: 3035, column: 9, scope: !1228)
!1231 = !DILocation(line: 3035, column: 60, scope: !1228)
!1232 = !DILocation(line: 3035, column: 9, scope: !1140)
!1233 = !DILocation(line: 3036, column: 13, scope: !1228)
!1234 = !DILocation(line: 3036, column: 7, scope: !1228)
!1235 = !DILocation(line: 3037, column: 9, scope: !1236)
!1236 = distinct !DILexicalBlock(scope: !1140, file: !1, line: 3037, column: 9)
!1237 = !DILocation(line: 3037, column: 16, scope: !1236)
!1238 = !DILocation(line: 3037, column: 33, scope: !1236)
!1239 = !DILocation(line: 3037, column: 9, scope: !1140)
!1240 = !DILocalVariable(name: "proceed", scope: !1241, file: !1, line: 3040, type: !581)
!1241 = distinct !DILexicalBlock(scope: !1236, file: !1, line: 3038, column: 7)
!1242 = !DILocation(line: 3040, column: 11, scope: !1241)
!1243 = !DILocation(line: 3045, column: 34, scope: !1241)
!1244 = !DILocation(line: 3045, column: 62, scope: !1241)
!1245 = !DILocation(line: 3045, column: 65, scope: !1241)
!1246 = !DILocation(line: 3045, column: 72, scope: !1241)
!1247 = !DILocation(line: 3045, column: 17, scope: !1241)
!1248 = !DILocation(line: 3045, column: 16, scope: !1241)
!1249 = !DILocation(line: 3046, column: 13, scope: !1250)
!1250 = distinct !DILexicalBlock(scope: !1241, file: !1, line: 3046, column: 13)
!1251 = !DILocation(line: 3046, column: 21, scope: !1250)
!1252 = !DILocation(line: 3046, column: 13, scope: !1241)
!1253 = !DILocation(line: 3047, column: 17, scope: !1250)
!1254 = !DILocation(line: 3047, column: 11, scope: !1250)
!1255 = !DILocation(line: 3048, column: 7, scope: !1241)
!1256 = !DILocation(line: 3049, column: 3, scope: !1140)
!1257 = !DILocation(line: 2994, column: 41, scope: !1134)
!1258 = !DILocation(line: 2994, column: 3, scope: !1134)
!1259 = distinct !{!1259, !1138, !1260}
!1260 = !DILocation(line: 3049, column: 3, scope: !1131)
!1261 = !DILocation(line: 3050, column: 31, scope: !977)
!1262 = !DILocation(line: 3050, column: 14, scope: !977)
!1263 = !DILocation(line: 3050, column: 13, scope: !977)
!1264 = !DILocation(line: 3051, column: 21, scope: !977)
!1265 = !DILocation(line: 3051, column: 10, scope: !977)
!1266 = !DILocation(line: 3052, column: 10, scope: !977)
!1267 = !DILocation(line: 3052, column: 3, scope: !977)
!1268 = distinct !DISubprogram(name: "AutoLevelImage", scope: !1, file: !1, line: 221, type: !808, scopeLine: 222, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !810)
!1269 = !DILocalVariable(name: "image", arg: 1, scope: !1268, file: !1, line: 221, type: !565)
!1270 = !DILocation(line: 221, column: 54, scope: !1268)
!1271 = !DILocation(line: 223, column: 32, scope: !1268)
!1272 = !DILocation(line: 223, column: 10, scope: !1268)
!1273 = !DILocation(line: 223, column: 3, scope: !1268)
!1274 = distinct !DISubprogram(name: "AutoLevelImageChannel", scope: !1, file: !1, line: 226, type: !817, scopeLine: 228, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !810)
!1275 = !DILocalVariable(name: "image", arg: 1, scope: !1274, file: !1, line: 226, type: !565)
!1276 = !DILocation(line: 226, column: 61, scope: !1274)
!1277 = !DILocalVariable(name: "channel", arg: 2, scope: !1274, file: !1, line: 227, type: !819)
!1278 = !DILocation(line: 227, column: 21, scope: !1274)
!1279 = !DILocation(line: 232, column: 29, scope: !1274)
!1280 = !DILocation(line: 232, column: 35, scope: !1274)
!1281 = !DILocation(line: 232, column: 10, scope: !1274)
!1282 = !DILocation(line: 232, column: 3, scope: !1274)
!1283 = distinct !DISubprogram(name: "BrightnessContrastImage", scope: !1, file: !1, line: 270, type: !1284, scopeLine: 272, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !810)
!1284 = !DISubroutineType(types: !1285)
!1285 = !{!581, !565, !980, !980}
!1286 = !DILocalVariable(name: "image", arg: 1, scope: !1283, file: !1, line: 270, type: !565)
!1287 = !DILocation(line: 270, column: 63, scope: !1283)
!1288 = !DILocalVariable(name: "brightness", arg: 2, scope: !1283, file: !1, line: 271, type: !980)
!1289 = !DILocation(line: 271, column: 16, scope: !1283)
!1290 = !DILocalVariable(name: "contrast", arg: 3, scope: !1283, file: !1, line: 271, type: !980)
!1291 = !DILocation(line: 271, column: 40, scope: !1283)
!1292 = !DILocalVariable(name: "status", scope: !1283, file: !1, line: 274, type: !581)
!1293 = !DILocation(line: 274, column: 5, scope: !1283)
!1294 = !DILocation(line: 276, column: 41, scope: !1283)
!1295 = !DILocation(line: 276, column: 63, scope: !1283)
!1296 = !DILocation(line: 277, column: 5, scope: !1283)
!1297 = !DILocation(line: 276, column: 10, scope: !1283)
!1298 = !DILocation(line: 276, column: 9, scope: !1283)
!1299 = !DILocation(line: 278, column: 10, scope: !1283)
!1300 = !DILocation(line: 278, column: 3, scope: !1283)
!1301 = distinct !DISubprogram(name: "BrightnessContrastImageChannel", scope: !1, file: !1, line: 281, type: !1302, scopeLine: 283, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !810)
!1302 = !DISubroutineType(types: !1303)
!1303 = !{!581, !565, !819, !980, !980}
!1304 = !DILocalVariable(name: "image", arg: 1, scope: !1301, file: !1, line: 281, type: !565)
!1305 = !DILocation(line: 281, column: 70, scope: !1301)
!1306 = !DILocalVariable(name: "channel", arg: 2, scope: !1301, file: !1, line: 282, type: !819)
!1307 = !DILocation(line: 282, column: 21, scope: !1301)
!1308 = !DILocalVariable(name: "brightness", arg: 3, scope: !1301, file: !1, line: 282, type: !980)
!1309 = !DILocation(line: 282, column: 42, scope: !1301)
!1310 = !DILocalVariable(name: "contrast", arg: 4, scope: !1301, file: !1, line: 282, type: !980)
!1311 = !DILocation(line: 282, column: 66, scope: !1301)
!1312 = !DILocalVariable(name: "alpha", scope: !1301, file: !1, line: 287, type: !543)
!1313 = !DILocation(line: 287, column: 5, scope: !1301)
!1314 = !DILocalVariable(name: "intercept", scope: !1301, file: !1, line: 288, type: !543)
!1315 = !DILocation(line: 288, column: 5, scope: !1301)
!1316 = !DILocalVariable(name: "coefficients", scope: !1301, file: !1, line: 289, type: !1317)
!1317 = !DICompositeType(tag: DW_TAG_array_type, baseType: !543, size: 128, elements: !1318)
!1318 = !{!1319}
!1319 = !DISubrange(count: 2)
!1320 = !DILocation(line: 289, column: 5, scope: !1301)
!1321 = !DILocalVariable(name: "slope", scope: !1301, file: !1, line: 290, type: !543)
!1322 = !DILocation(line: 290, column: 5, scope: !1301)
!1323 = !DILocalVariable(name: "status", scope: !1301, file: !1, line: 293, type: !581)
!1324 = !DILocation(line: 293, column: 5, scope: !1301)
!1325 = !DILocation(line: 300, column: 7, scope: !1326)
!1326 = distinct !DILexicalBlock(scope: !1301, file: !1, line: 300, column: 7)
!1327 = !DILocation(line: 300, column: 14, scope: !1326)
!1328 = !DILocation(line: 300, column: 20, scope: !1326)
!1329 = !DILocation(line: 300, column: 7, scope: !1301)
!1330 = !DILocation(line: 301, column: 61, scope: !1326)
!1331 = !DILocation(line: 301, column: 68, scope: !1326)
!1332 = !DILocation(line: 301, column: 12, scope: !1326)
!1333 = !DILocation(line: 301, column: 5, scope: !1326)
!1334 = !DILocation(line: 302, column: 9, scope: !1301)
!1335 = !DILocation(line: 302, column: 8, scope: !1301)
!1336 = !DILocation(line: 303, column: 33, scope: !1301)
!1337 = !DILocation(line: 303, column: 38, scope: !1301)
!1338 = !DILocation(line: 303, column: 44, scope: !1301)
!1339 = !DILocation(line: 303, column: 31, scope: !1301)
!1340 = !DILocation(line: 303, column: 49, scope: !1301)
!1341 = !DILocation(line: 303, column: 9, scope: !1301)
!1342 = !DILocation(line: 303, column: 8, scope: !1301)
!1343 = !DILocation(line: 304, column: 7, scope: !1344)
!1344 = distinct !DILexicalBlock(scope: !1301, file: !1, line: 304, column: 7)
!1345 = !DILocation(line: 304, column: 13, scope: !1344)
!1346 = !DILocation(line: 304, column: 7, scope: !1301)
!1347 = !DILocation(line: 305, column: 10, scope: !1344)
!1348 = !DILocation(line: 305, column: 5, scope: !1344)
!1349 = !DILocation(line: 306, column: 13, scope: !1301)
!1350 = !DILocation(line: 306, column: 23, scope: !1301)
!1351 = !DILocation(line: 306, column: 36, scope: !1301)
!1352 = !DILocation(line: 306, column: 35, scope: !1301)
!1353 = !DILocation(line: 306, column: 47, scope: !1301)
!1354 = !DILocation(line: 306, column: 60, scope: !1301)
!1355 = !DILocation(line: 306, column: 59, scope: !1301)
!1356 = !DILocation(line: 306, column: 54, scope: !1301)
!1357 = !DILocation(line: 306, column: 29, scope: !1301)
!1358 = !DILocation(line: 306, column: 12, scope: !1301)
!1359 = !DILocation(line: 307, column: 19, scope: !1301)
!1360 = !DILocation(line: 307, column: 3, scope: !1301)
!1361 = !DILocation(line: 307, column: 18, scope: !1301)
!1362 = !DILocation(line: 308, column: 19, scope: !1301)
!1363 = !DILocation(line: 308, column: 3, scope: !1301)
!1364 = !DILocation(line: 308, column: 18, scope: !1301)
!1365 = !DILocation(line: 309, column: 31, scope: !1301)
!1366 = !DILocation(line: 309, column: 37, scope: !1301)
!1367 = !DILocation(line: 309, column: 66, scope: !1301)
!1368 = !DILocation(line: 310, column: 6, scope: !1301)
!1369 = !DILocation(line: 310, column: 13, scope: !1301)
!1370 = !DILocation(line: 309, column: 10, scope: !1301)
!1371 = !DILocation(line: 309, column: 9, scope: !1301)
!1372 = !DILocation(line: 311, column: 10, scope: !1301)
!1373 = !DILocation(line: 311, column: 3, scope: !1301)
!1374 = distinct !DISubprogram(name: "ColorDecisionListImage", scope: !1, file: !1, line: 357, type: !1375, scopeLine: 359, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !810)
!1375 = !DISubroutineType(types: !1376)
!1376 = !{!581, !565, !547}
!1377 = !DILocalVariable(name: "image", arg: 1, scope: !1374, file: !1, line: 357, type: !565)
!1378 = !DILocation(line: 357, column: 62, scope: !1374)
!1379 = !DILocalVariable(name: "color_correction_collection", arg: 2, scope: !1374, file: !1, line: 358, type: !547)
!1380 = !DILocation(line: 358, column: 15, scope: !1374)
!1381 = !DILocalVariable(name: "image_view", scope: !1374, file: !1, line: 382, type: !992)
!1382 = !DILocation(line: 382, column: 6, scope: !1374)
!1383 = !DILocalVariable(name: "token", scope: !1374, file: !1, line: 385, type: !702)
!1384 = !DILocation(line: 385, column: 5, scope: !1374)
!1385 = !DILocalVariable(name: "color_correction", scope: !1374, file: !1, line: 388, type: !1386)
!1386 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorCorrection", scope: !1374, file: !1, line: 379, baseType: !1387)
!1387 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ColorCorrection", scope: !1374, file: !1, line: 370, size: 640, elements: !1388)
!1388 = !{!1389, !1396, !1397, !1398}
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !1387, file: !1, line: 373, baseType: !1390, size: 192)
!1390 = !DIDerivedType(tag: DW_TAG_typedef, name: "Correction", scope: !1374, file: !1, line: 368, baseType: !1391)
!1391 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Correction", scope: !1374, file: !1, line: 362, size: 192, elements: !1392)
!1392 = !{!1393, !1394, !1395}
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "slope", scope: !1391, file: !1, line: 365, baseType: !543, size: 64)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1391, file: !1, line: 366, baseType: !543, size: 64, offset: 64)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "power", scope: !1391, file: !1, line: 367, baseType: !543, size: 64, offset: 128)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !1387, file: !1, line: 374, baseType: !1390, size: 192, offset: 192)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !1387, file: !1, line: 375, baseType: !1390, size: 192, offset: 384)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "saturation", scope: !1387, file: !1, line: 378, baseType: !543, size: 64, offset: 576)
!1399 = !DILocation(line: 388, column: 5, scope: !1374)
!1400 = !DILocalVariable(name: "content", scope: !1374, file: !1, line: 391, type: !547)
!1401 = !DILocation(line: 391, column: 6, scope: !1374)
!1402 = !DILocalVariable(name: "p", scope: !1374, file: !1, line: 392, type: !547)
!1403 = !DILocation(line: 392, column: 6, scope: !1374)
!1404 = !DILocalVariable(name: "exception", scope: !1374, file: !1, line: 395, type: !998)
!1405 = !DILocation(line: 395, column: 6, scope: !1374)
!1406 = !DILocalVariable(name: "status", scope: !1374, file: !1, line: 398, type: !581)
!1407 = !DILocation(line: 398, column: 5, scope: !1374)
!1408 = !DILocalVariable(name: "progress", scope: !1374, file: !1, line: 401, type: !685)
!1409 = !DILocation(line: 401, column: 5, scope: !1374)
!1410 = !DILocalVariable(name: "cdl_map", scope: !1374, file: !1, line: 404, type: !557)
!1411 = !DILocation(line: 404, column: 6, scope: !1374)
!1412 = !DILocalVariable(name: "i", scope: !1374, file: !1, line: 407, type: !615)
!1413 = !DILocation(line: 407, column: 5, scope: !1374)
!1414 = !DILocalVariable(name: "y", scope: !1374, file: !1, line: 410, type: !615)
!1415 = !DILocation(line: 410, column: 5, scope: !1374)
!1416 = !DILocalVariable(name: "cc", scope: !1374, file: !1, line: 413, type: !551)
!1417 = !DILocation(line: 413, column: 6, scope: !1374)
!1418 = !DILocalVariable(name: "ccc", scope: !1374, file: !1, line: 414, type: !551)
!1419 = !DILocation(line: 414, column: 6, scope: !1374)
!1420 = !DILocalVariable(name: "sat", scope: !1374, file: !1, line: 415, type: !551)
!1421 = !DILocation(line: 415, column: 6, scope: !1374)
!1422 = !DILocalVariable(name: "sop", scope: !1374, file: !1, line: 416, type: !551)
!1423 = !DILocation(line: 416, column: 6, scope: !1374)
!1424 = !DILocation(line: 423, column: 7, scope: !1425)
!1425 = distinct !DILexicalBlock(scope: !1374, file: !1, line: 423, column: 7)
!1426 = !DILocation(line: 423, column: 14, scope: !1425)
!1427 = !DILocation(line: 423, column: 20, scope: !1425)
!1428 = !DILocation(line: 423, column: 7, scope: !1374)
!1429 = !DILocation(line: 424, column: 61, scope: !1425)
!1430 = !DILocation(line: 424, column: 68, scope: !1425)
!1431 = !DILocation(line: 424, column: 12, scope: !1425)
!1432 = !DILocation(line: 424, column: 5, scope: !1425)
!1433 = !DILocation(line: 425, column: 7, scope: !1434)
!1434 = distinct !DILexicalBlock(scope: !1374, file: !1, line: 425, column: 7)
!1435 = !DILocation(line: 425, column: 35, scope: !1434)
!1436 = !DILocation(line: 425, column: 7, scope: !1374)
!1437 = !DILocation(line: 426, column: 5, scope: !1434)
!1438 = !DILocation(line: 427, column: 33, scope: !1374)
!1439 = !DILocation(line: 427, column: 62, scope: !1374)
!1440 = !DILocation(line: 427, column: 69, scope: !1374)
!1441 = !DILocation(line: 427, column: 7, scope: !1374)
!1442 = !DILocation(line: 427, column: 6, scope: !1374)
!1443 = !DILocation(line: 428, column: 7, scope: !1444)
!1444 = distinct !DILexicalBlock(scope: !1374, file: !1, line: 428, column: 7)
!1445 = !DILocation(line: 428, column: 11, scope: !1444)
!1446 = !DILocation(line: 428, column: 7, scope: !1374)
!1447 = !DILocation(line: 429, column: 5, scope: !1444)
!1448 = !DILocation(line: 430, column: 22, scope: !1374)
!1449 = !DILocation(line: 430, column: 6, scope: !1374)
!1450 = !DILocation(line: 430, column: 5, scope: !1374)
!1451 = !DILocation(line: 431, column: 7, scope: !1452)
!1452 = distinct !DILexicalBlock(scope: !1374, file: !1, line: 431, column: 7)
!1453 = !DILocation(line: 431, column: 10, scope: !1452)
!1454 = !DILocation(line: 431, column: 7, scope: !1374)
!1455 = !DILocation(line: 433, column: 26, scope: !1456)
!1456 = distinct !DILexicalBlock(scope: !1452, file: !1, line: 432, column: 5)
!1457 = !DILocation(line: 433, column: 11, scope: !1456)
!1458 = !DILocation(line: 433, column: 10, scope: !1456)
!1459 = !DILocation(line: 434, column: 7, scope: !1456)
!1460 = !DILocation(line: 436, column: 20, scope: !1374)
!1461 = !DILocation(line: 436, column: 24, scope: !1374)
!1462 = !DILocation(line: 436, column: 29, scope: !1374)
!1463 = !DILocation(line: 437, column: 20, scope: !1374)
!1464 = !DILocation(line: 437, column: 24, scope: !1374)
!1465 = !DILocation(line: 437, column: 30, scope: !1374)
!1466 = !DILocation(line: 438, column: 20, scope: !1374)
!1467 = !DILocation(line: 438, column: 24, scope: !1374)
!1468 = !DILocation(line: 438, column: 29, scope: !1374)
!1469 = !DILocation(line: 439, column: 20, scope: !1374)
!1470 = !DILocation(line: 439, column: 26, scope: !1374)
!1471 = !DILocation(line: 439, column: 31, scope: !1374)
!1472 = !DILocation(line: 440, column: 20, scope: !1374)
!1473 = !DILocation(line: 440, column: 26, scope: !1374)
!1474 = !DILocation(line: 440, column: 32, scope: !1374)
!1475 = !DILocation(line: 441, column: 20, scope: !1374)
!1476 = !DILocation(line: 441, column: 26, scope: !1374)
!1477 = !DILocation(line: 441, column: 31, scope: !1374)
!1478 = !DILocation(line: 442, column: 20, scope: !1374)
!1479 = !DILocation(line: 442, column: 25, scope: !1374)
!1480 = !DILocation(line: 442, column: 30, scope: !1374)
!1481 = !DILocation(line: 443, column: 20, scope: !1374)
!1482 = !DILocation(line: 443, column: 25, scope: !1374)
!1483 = !DILocation(line: 443, column: 31, scope: !1374)
!1484 = !DILocation(line: 444, column: 20, scope: !1374)
!1485 = !DILocation(line: 444, column: 25, scope: !1374)
!1486 = !DILocation(line: 444, column: 30, scope: !1374)
!1487 = !DILocation(line: 445, column: 20, scope: !1374)
!1488 = !DILocation(line: 445, column: 30, scope: !1374)
!1489 = !DILocation(line: 446, column: 23, scope: !1374)
!1490 = !DILocation(line: 446, column: 7, scope: !1374)
!1491 = !DILocation(line: 446, column: 6, scope: !1374)
!1492 = !DILocation(line: 447, column: 7, scope: !1493)
!1493 = distinct !DILexicalBlock(scope: !1374, file: !1, line: 447, column: 7)
!1494 = !DILocation(line: 447, column: 11, scope: !1493)
!1495 = !DILocation(line: 447, column: 7, scope: !1374)
!1496 = !DILocalVariable(name: "offset", scope: !1497, file: !1, line: 450, type: !551)
!1497 = distinct !DILexicalBlock(scope: !1493, file: !1, line: 448, column: 5)
!1498 = !DILocation(line: 450, column: 10, scope: !1497)
!1499 = !DILocalVariable(name: "power", scope: !1497, file: !1, line: 451, type: !551)
!1500 = !DILocation(line: 451, column: 10, scope: !1497)
!1501 = !DILocalVariable(name: "slope", scope: !1497, file: !1, line: 452, type: !551)
!1502 = !DILocation(line: 452, column: 10, scope: !1497)
!1503 = !DILocation(line: 454, column: 29, scope: !1497)
!1504 = !DILocation(line: 454, column: 13, scope: !1497)
!1505 = !DILocation(line: 454, column: 12, scope: !1497)
!1506 = !DILocation(line: 455, column: 11, scope: !1507)
!1507 = distinct !DILexicalBlock(scope: !1497, file: !1, line: 455, column: 11)
!1508 = !DILocation(line: 455, column: 17, scope: !1507)
!1509 = !DILocation(line: 455, column: 11, scope: !1497)
!1510 = !DILocation(line: 457, column: 37, scope: !1511)
!1511 = distinct !DILexicalBlock(scope: !1507, file: !1, line: 456, column: 9)
!1512 = !DILocation(line: 457, column: 19, scope: !1511)
!1513 = !DILocation(line: 457, column: 18, scope: !1511)
!1514 = !DILocation(line: 458, column: 28, scope: !1511)
!1515 = !DILocation(line: 458, column: 12, scope: !1511)
!1516 = !DILocation(line: 459, column: 17, scope: !1517)
!1517 = distinct !DILexicalBlock(scope: !1511, file: !1, line: 459, column: 11)
!1518 = !DILocation(line: 459, column: 16, scope: !1517)
!1519 = !DILocation(line: 459, column: 23, scope: !1520)
!1520 = distinct !DILexicalBlock(scope: !1517, file: !1, line: 459, column: 11)
!1521 = !DILocation(line: 459, column: 22, scope: !1520)
!1522 = !DILocation(line: 459, column: 25, scope: !1520)
!1523 = !DILocation(line: 459, column: 34, scope: !1520)
!1524 = !DILocation(line: 459, column: 38, scope: !1520)
!1525 = !DILocation(line: 459, column: 40, scope: !1520)
!1526 = !DILocation(line: 0, scope: !1520)
!1527 = !DILocation(line: 459, column: 11, scope: !1517)
!1528 = !DILocation(line: 461, column: 28, scope: !1529)
!1529 = distinct !DILexicalBlock(scope: !1520, file: !1, line: 460, column: 11)
!1530 = !DILocation(line: 461, column: 33, scope: !1529)
!1531 = !DILocation(line: 461, column: 13, scope: !1529)
!1532 = !DILocation(line: 462, column: 17, scope: !1533)
!1533 = distinct !DILexicalBlock(scope: !1529, file: !1, line: 462, column: 17)
!1534 = !DILocation(line: 462, column: 24, scope: !1533)
!1535 = !DILocation(line: 462, column: 17, scope: !1529)
!1536 = !DILocation(line: 463, column: 30, scope: !1533)
!1537 = !DILocation(line: 463, column: 35, scope: !1533)
!1538 = !DILocation(line: 463, column: 15, scope: !1533)
!1539 = !DILocation(line: 464, column: 21, scope: !1529)
!1540 = !DILocation(line: 464, column: 13, scope: !1529)
!1541 = !DILocation(line: 468, column: 59, scope: !1542)
!1542 = distinct !DILexicalBlock(scope: !1543, file: !1, line: 467, column: 15)
!1543 = distinct !DILexicalBlock(scope: !1529, file: !1, line: 465, column: 13)
!1544 = !DILocation(line: 468, column: 44, scope: !1542)
!1545 = !DILocation(line: 468, column: 34, scope: !1542)
!1546 = !DILocation(line: 468, column: 38, scope: !1542)
!1547 = !DILocation(line: 468, column: 43, scope: !1542)
!1548 = !DILocation(line: 469, column: 17, scope: !1542)
!1549 = !DILocation(line: 473, column: 61, scope: !1550)
!1550 = distinct !DILexicalBlock(scope: !1543, file: !1, line: 472, column: 15)
!1551 = !DILocation(line: 473, column: 46, scope: !1550)
!1552 = !DILocation(line: 473, column: 34, scope: !1550)
!1553 = !DILocation(line: 473, column: 40, scope: !1550)
!1554 = !DILocation(line: 473, column: 45, scope: !1550)
!1555 = !DILocation(line: 475, column: 17, scope: !1550)
!1556 = !DILocation(line: 479, column: 60, scope: !1557)
!1557 = distinct !DILexicalBlock(scope: !1543, file: !1, line: 478, column: 15)
!1558 = !DILocation(line: 479, column: 45, scope: !1557)
!1559 = !DILocation(line: 479, column: 34, scope: !1557)
!1560 = !DILocation(line: 479, column: 39, scope: !1557)
!1561 = !DILocation(line: 479, column: 44, scope: !1557)
!1562 = !DILocation(line: 481, column: 17, scope: !1557)
!1563 = !DILocation(line: 484, column: 11, scope: !1529)
!1564 = !DILocation(line: 459, column: 47, scope: !1520)
!1565 = !DILocation(line: 459, column: 11, scope: !1520)
!1566 = distinct !{!1566, !1527, !1567}
!1567 = !DILocation(line: 484, column: 11, scope: !1517)
!1568 = !DILocation(line: 485, column: 9, scope: !1511)
!1569 = !DILocation(line: 486, column: 30, scope: !1497)
!1570 = !DILocation(line: 486, column: 14, scope: !1497)
!1571 = !DILocation(line: 486, column: 13, scope: !1497)
!1572 = !DILocation(line: 487, column: 11, scope: !1573)
!1573 = distinct !DILexicalBlock(scope: !1497, file: !1, line: 487, column: 11)
!1574 = !DILocation(line: 487, column: 18, scope: !1573)
!1575 = !DILocation(line: 487, column: 11, scope: !1497)
!1576 = !DILocation(line: 489, column: 37, scope: !1577)
!1577 = distinct !DILexicalBlock(scope: !1573, file: !1, line: 488, column: 9)
!1578 = !DILocation(line: 489, column: 19, scope: !1577)
!1579 = !DILocation(line: 489, column: 18, scope: !1577)
!1580 = !DILocation(line: 490, column: 28, scope: !1577)
!1581 = !DILocation(line: 490, column: 12, scope: !1577)
!1582 = !DILocation(line: 491, column: 17, scope: !1583)
!1583 = distinct !DILexicalBlock(scope: !1577, file: !1, line: 491, column: 11)
!1584 = !DILocation(line: 491, column: 16, scope: !1583)
!1585 = !DILocation(line: 491, column: 23, scope: !1586)
!1586 = distinct !DILexicalBlock(scope: !1583, file: !1, line: 491, column: 11)
!1587 = !DILocation(line: 491, column: 22, scope: !1586)
!1588 = !DILocation(line: 491, column: 25, scope: !1586)
!1589 = !DILocation(line: 491, column: 34, scope: !1586)
!1590 = !DILocation(line: 491, column: 38, scope: !1586)
!1591 = !DILocation(line: 491, column: 40, scope: !1586)
!1592 = !DILocation(line: 0, scope: !1586)
!1593 = !DILocation(line: 491, column: 11, scope: !1583)
!1594 = !DILocation(line: 493, column: 28, scope: !1595)
!1595 = distinct !DILexicalBlock(scope: !1586, file: !1, line: 492, column: 11)
!1596 = !DILocation(line: 493, column: 33, scope: !1595)
!1597 = !DILocation(line: 493, column: 13, scope: !1595)
!1598 = !DILocation(line: 494, column: 17, scope: !1599)
!1599 = distinct !DILexicalBlock(scope: !1595, file: !1, line: 494, column: 17)
!1600 = !DILocation(line: 494, column: 24, scope: !1599)
!1601 = !DILocation(line: 494, column: 17, scope: !1595)
!1602 = !DILocation(line: 495, column: 30, scope: !1599)
!1603 = !DILocation(line: 495, column: 35, scope: !1599)
!1604 = !DILocation(line: 495, column: 15, scope: !1599)
!1605 = !DILocation(line: 496, column: 21, scope: !1595)
!1606 = !DILocation(line: 496, column: 13, scope: !1595)
!1607 = !DILocation(line: 500, column: 60, scope: !1608)
!1608 = distinct !DILexicalBlock(scope: !1609, file: !1, line: 499, column: 15)
!1609 = distinct !DILexicalBlock(scope: !1595, file: !1, line: 497, column: 13)
!1610 = !DILocation(line: 500, column: 45, scope: !1608)
!1611 = !DILocation(line: 500, column: 34, scope: !1608)
!1612 = !DILocation(line: 500, column: 38, scope: !1608)
!1613 = !DILocation(line: 500, column: 44, scope: !1608)
!1614 = !DILocation(line: 502, column: 17, scope: !1608)
!1615 = !DILocation(line: 506, column: 62, scope: !1616)
!1616 = distinct !DILexicalBlock(scope: !1609, file: !1, line: 505, column: 15)
!1617 = !DILocation(line: 506, column: 47, scope: !1616)
!1618 = !DILocation(line: 506, column: 34, scope: !1616)
!1619 = !DILocation(line: 506, column: 40, scope: !1616)
!1620 = !DILocation(line: 506, column: 46, scope: !1616)
!1621 = !DILocation(line: 508, column: 17, scope: !1616)
!1622 = !DILocation(line: 512, column: 61, scope: !1623)
!1623 = distinct !DILexicalBlock(scope: !1609, file: !1, line: 511, column: 15)
!1624 = !DILocation(line: 512, column: 46, scope: !1623)
!1625 = !DILocation(line: 512, column: 34, scope: !1623)
!1626 = !DILocation(line: 512, column: 39, scope: !1623)
!1627 = !DILocation(line: 512, column: 45, scope: !1623)
!1628 = !DILocation(line: 514, column: 17, scope: !1623)
!1629 = !DILocation(line: 517, column: 11, scope: !1595)
!1630 = !DILocation(line: 491, column: 47, scope: !1586)
!1631 = !DILocation(line: 491, column: 11, scope: !1586)
!1632 = distinct !{!1632, !1593, !1633}
!1633 = !DILocation(line: 517, column: 11, scope: !1583)
!1634 = !DILocation(line: 518, column: 9, scope: !1577)
!1635 = !DILocation(line: 519, column: 29, scope: !1497)
!1636 = !DILocation(line: 519, column: 13, scope: !1497)
!1637 = !DILocation(line: 519, column: 12, scope: !1497)
!1638 = !DILocation(line: 520, column: 11, scope: !1639)
!1639 = distinct !DILexicalBlock(scope: !1497, file: !1, line: 520, column: 11)
!1640 = !DILocation(line: 520, column: 17, scope: !1639)
!1641 = !DILocation(line: 520, column: 11, scope: !1497)
!1642 = !DILocation(line: 522, column: 37, scope: !1643)
!1643 = distinct !DILexicalBlock(scope: !1639, file: !1, line: 521, column: 9)
!1644 = !DILocation(line: 522, column: 19, scope: !1643)
!1645 = !DILocation(line: 522, column: 18, scope: !1643)
!1646 = !DILocation(line: 523, column: 28, scope: !1643)
!1647 = !DILocation(line: 523, column: 12, scope: !1643)
!1648 = !DILocation(line: 524, column: 17, scope: !1649)
!1649 = distinct !DILexicalBlock(scope: !1643, file: !1, line: 524, column: 11)
!1650 = !DILocation(line: 524, column: 16, scope: !1649)
!1651 = !DILocation(line: 524, column: 23, scope: !1652)
!1652 = distinct !DILexicalBlock(scope: !1649, file: !1, line: 524, column: 11)
!1653 = !DILocation(line: 524, column: 22, scope: !1652)
!1654 = !DILocation(line: 524, column: 25, scope: !1652)
!1655 = !DILocation(line: 524, column: 34, scope: !1652)
!1656 = !DILocation(line: 524, column: 38, scope: !1652)
!1657 = !DILocation(line: 524, column: 40, scope: !1652)
!1658 = !DILocation(line: 0, scope: !1652)
!1659 = !DILocation(line: 524, column: 11, scope: !1649)
!1660 = !DILocation(line: 526, column: 28, scope: !1661)
!1661 = distinct !DILexicalBlock(scope: !1652, file: !1, line: 525, column: 11)
!1662 = !DILocation(line: 526, column: 33, scope: !1661)
!1663 = !DILocation(line: 526, column: 13, scope: !1661)
!1664 = !DILocation(line: 527, column: 17, scope: !1665)
!1665 = distinct !DILexicalBlock(scope: !1661, file: !1, line: 527, column: 17)
!1666 = !DILocation(line: 527, column: 24, scope: !1665)
!1667 = !DILocation(line: 527, column: 17, scope: !1661)
!1668 = !DILocation(line: 528, column: 30, scope: !1665)
!1669 = !DILocation(line: 528, column: 35, scope: !1665)
!1670 = !DILocation(line: 528, column: 15, scope: !1665)
!1671 = !DILocation(line: 529, column: 21, scope: !1661)
!1672 = !DILocation(line: 529, column: 13, scope: !1661)
!1673 = !DILocation(line: 533, column: 59, scope: !1674)
!1674 = distinct !DILexicalBlock(scope: !1675, file: !1, line: 532, column: 15)
!1675 = distinct !DILexicalBlock(scope: !1661, file: !1, line: 530, column: 13)
!1676 = !DILocation(line: 533, column: 44, scope: !1674)
!1677 = !DILocation(line: 533, column: 34, scope: !1674)
!1678 = !DILocation(line: 533, column: 38, scope: !1674)
!1679 = !DILocation(line: 533, column: 43, scope: !1674)
!1680 = !DILocation(line: 534, column: 17, scope: !1674)
!1681 = !DILocation(line: 538, column: 61, scope: !1682)
!1682 = distinct !DILexicalBlock(scope: !1675, file: !1, line: 537, column: 15)
!1683 = !DILocation(line: 538, column: 46, scope: !1682)
!1684 = !DILocation(line: 538, column: 34, scope: !1682)
!1685 = !DILocation(line: 538, column: 40, scope: !1682)
!1686 = !DILocation(line: 538, column: 45, scope: !1682)
!1687 = !DILocation(line: 540, column: 17, scope: !1682)
!1688 = !DILocation(line: 544, column: 60, scope: !1689)
!1689 = distinct !DILexicalBlock(scope: !1675, file: !1, line: 543, column: 15)
!1690 = !DILocation(line: 544, column: 45, scope: !1689)
!1691 = !DILocation(line: 544, column: 34, scope: !1689)
!1692 = !DILocation(line: 544, column: 39, scope: !1689)
!1693 = !DILocation(line: 544, column: 44, scope: !1689)
!1694 = !DILocation(line: 546, column: 17, scope: !1689)
!1695 = !DILocation(line: 549, column: 11, scope: !1661)
!1696 = !DILocation(line: 524, column: 47, scope: !1652)
!1697 = !DILocation(line: 524, column: 11, scope: !1652)
!1698 = distinct !{!1698, !1659, !1699}
!1699 = !DILocation(line: 549, column: 11, scope: !1649)
!1700 = !DILocation(line: 550, column: 9, scope: !1643)
!1701 = !DILocation(line: 551, column: 5, scope: !1497)
!1702 = !DILocation(line: 552, column: 23, scope: !1374)
!1703 = !DILocation(line: 552, column: 7, scope: !1374)
!1704 = !DILocation(line: 552, column: 6, scope: !1374)
!1705 = !DILocation(line: 553, column: 7, scope: !1706)
!1706 = distinct !DILexicalBlock(scope: !1374, file: !1, line: 553, column: 7)
!1707 = !DILocation(line: 553, column: 11, scope: !1706)
!1708 = !DILocation(line: 553, column: 7, scope: !1374)
!1709 = !DILocalVariable(name: "saturation", scope: !1710, file: !1, line: 556, type: !551)
!1710 = distinct !DILexicalBlock(scope: !1706, file: !1, line: 554, column: 5)
!1711 = !DILocation(line: 556, column: 10, scope: !1710)
!1712 = !DILocation(line: 558, column: 34, scope: !1710)
!1713 = !DILocation(line: 558, column: 18, scope: !1710)
!1714 = !DILocation(line: 558, column: 17, scope: !1710)
!1715 = !DILocation(line: 559, column: 11, scope: !1716)
!1716 = distinct !DILexicalBlock(scope: !1710, file: !1, line: 559, column: 11)
!1717 = !DILocation(line: 559, column: 22, scope: !1716)
!1718 = !DILocation(line: 559, column: 11, scope: !1710)
!1719 = !DILocation(line: 561, column: 37, scope: !1720)
!1720 = distinct !DILexicalBlock(scope: !1716, file: !1, line: 560, column: 9)
!1721 = !DILocation(line: 561, column: 19, scope: !1720)
!1722 = !DILocation(line: 561, column: 18, scope: !1720)
!1723 = !DILocation(line: 562, column: 28, scope: !1720)
!1724 = !DILocation(line: 562, column: 12, scope: !1720)
!1725 = !DILocation(line: 563, column: 26, scope: !1720)
!1726 = !DILocation(line: 563, column: 31, scope: !1720)
!1727 = !DILocation(line: 563, column: 11, scope: !1720)
!1728 = !DILocation(line: 564, column: 54, scope: !1720)
!1729 = !DILocation(line: 564, column: 39, scope: !1720)
!1730 = !DILocation(line: 564, column: 28, scope: !1720)
!1731 = !DILocation(line: 564, column: 38, scope: !1720)
!1732 = !DILocation(line: 565, column: 9, scope: !1720)
!1733 = !DILocation(line: 566, column: 5, scope: !1710)
!1734 = !DILocation(line: 567, column: 22, scope: !1374)
!1735 = !DILocation(line: 567, column: 7, scope: !1374)
!1736 = !DILocation(line: 567, column: 6, scope: !1374)
!1737 = !DILocation(line: 568, column: 7, scope: !1738)
!1738 = distinct !DILexicalBlock(scope: !1374, file: !1, line: 568, column: 7)
!1739 = !DILocation(line: 568, column: 14, scope: !1738)
!1740 = !DILocation(line: 568, column: 20, scope: !1738)
!1741 = !DILocation(line: 568, column: 7, scope: !1374)
!1742 = !DILocation(line: 570, column: 14, scope: !1743)
!1743 = distinct !DILexicalBlock(scope: !1738, file: !1, line: 569, column: 5)
!1744 = !DILocation(line: 573, column: 61, scope: !1743)
!1745 = !DILocation(line: 573, column: 65, scope: !1743)
!1746 = !DILocation(line: 572, column: 14, scope: !1743)
!1747 = !DILocation(line: 575, column: 62, scope: !1743)
!1748 = !DILocation(line: 575, column: 66, scope: !1743)
!1749 = !DILocation(line: 574, column: 14, scope: !1743)
!1750 = !DILocation(line: 577, column: 61, scope: !1743)
!1751 = !DILocation(line: 577, column: 65, scope: !1743)
!1752 = !DILocation(line: 576, column: 14, scope: !1743)
!1753 = !DILocation(line: 579, column: 63, scope: !1743)
!1754 = !DILocation(line: 579, column: 69, scope: !1743)
!1755 = !DILocation(line: 578, column: 14, scope: !1743)
!1756 = !DILocation(line: 581, column: 64, scope: !1743)
!1757 = !DILocation(line: 581, column: 70, scope: !1743)
!1758 = !DILocation(line: 580, column: 14, scope: !1743)
!1759 = !DILocation(line: 583, column: 63, scope: !1743)
!1760 = !DILocation(line: 583, column: 69, scope: !1743)
!1761 = !DILocation(line: 582, column: 14, scope: !1743)
!1762 = !DILocation(line: 585, column: 62, scope: !1743)
!1763 = !DILocation(line: 585, column: 67, scope: !1743)
!1764 = !DILocation(line: 584, column: 14, scope: !1743)
!1765 = !DILocation(line: 587, column: 63, scope: !1743)
!1766 = !DILocation(line: 587, column: 68, scope: !1743)
!1767 = !DILocation(line: 586, column: 14, scope: !1743)
!1768 = !DILocation(line: 589, column: 62, scope: !1743)
!1769 = !DILocation(line: 589, column: 67, scope: !1743)
!1770 = !DILocation(line: 588, column: 14, scope: !1743)
!1771 = !DILocation(line: 591, column: 62, scope: !1743)
!1772 = !DILocation(line: 590, column: 14, scope: !1743)
!1773 = !DILocation(line: 592, column: 5, scope: !1743)
!1774 = !DILocation(line: 593, column: 27, scope: !1374)
!1775 = !DILocation(line: 593, column: 11, scope: !1374)
!1776 = !DILocation(line: 593, column: 10, scope: !1374)
!1777 = !DILocation(line: 594, column: 7, scope: !1778)
!1778 = distinct !DILexicalBlock(scope: !1374, file: !1, line: 594, column: 7)
!1779 = !DILocation(line: 594, column: 15, scope: !1778)
!1780 = !DILocation(line: 594, column: 7, scope: !1374)
!1781 = !DILocation(line: 595, column: 5, scope: !1782)
!1782 = distinct !DILexicalBlock(scope: !1783, file: !1, line: 595, column: 5)
!1783 = distinct !DILexicalBlock(scope: !1778, file: !1, line: 595, column: 5)
!1784 = !DILocation(line: 595, column: 5, scope: !1783)
!1785 = !DILocation(line: 597, column: 9, scope: !1786)
!1786 = distinct !DILexicalBlock(scope: !1374, file: !1, line: 597, column: 3)
!1787 = !DILocation(line: 597, column: 8, scope: !1786)
!1788 = !DILocation(line: 597, column: 13, scope: !1789)
!1789 = distinct !DILexicalBlock(scope: !1786, file: !1, line: 597, column: 3)
!1790 = !DILocation(line: 597, column: 15, scope: !1789)
!1791 = !DILocation(line: 597, column: 3, scope: !1786)
!1792 = !DILocation(line: 600, column: 53, scope: !1793)
!1793 = distinct !DILexicalBlock(scope: !1789, file: !1, line: 598, column: 3)
!1794 = !DILocation(line: 600, column: 57, scope: !1793)
!1795 = !DILocation(line: 600, column: 63, scope: !1793)
!1796 = !DILocation(line: 600, column: 62, scope: !1793)
!1797 = !DILocation(line: 600, column: 64, scope: !1793)
!1798 = !DILocation(line: 601, column: 24, scope: !1793)
!1799 = !DILocation(line: 601, column: 28, scope: !1793)
!1800 = !DILocation(line: 600, column: 71, scope: !1793)
!1801 = !DILocation(line: 601, column: 52, scope: !1793)
!1802 = !DILocation(line: 601, column: 56, scope: !1793)
!1803 = !DILocation(line: 600, column: 32, scope: !1793)
!1804 = !DILocation(line: 600, column: 30, scope: !1793)
!1805 = !DILocation(line: 599, column: 70, scope: !1793)
!1806 = !DILocation(line: 599, column: 52, scope: !1793)
!1807 = !DILocation(line: 599, column: 35, scope: !1793)
!1808 = !DILocation(line: 599, column: 20, scope: !1793)
!1809 = !DILocation(line: 599, column: 5, scope: !1793)
!1810 = !DILocation(line: 599, column: 13, scope: !1793)
!1811 = !DILocation(line: 599, column: 16, scope: !1793)
!1812 = !DILocation(line: 599, column: 19, scope: !1793)
!1813 = !DILocation(line: 603, column: 53, scope: !1793)
!1814 = !DILocation(line: 603, column: 59, scope: !1793)
!1815 = !DILocation(line: 603, column: 65, scope: !1793)
!1816 = !DILocation(line: 603, column: 64, scope: !1793)
!1817 = !DILocation(line: 603, column: 66, scope: !1793)
!1818 = !DILocation(line: 604, column: 24, scope: !1793)
!1819 = !DILocation(line: 604, column: 30, scope: !1793)
!1820 = !DILocation(line: 603, column: 73, scope: !1793)
!1821 = !DILocation(line: 604, column: 54, scope: !1793)
!1822 = !DILocation(line: 604, column: 60, scope: !1793)
!1823 = !DILocation(line: 603, column: 32, scope: !1793)
!1824 = !DILocation(line: 603, column: 30, scope: !1793)
!1825 = !DILocation(line: 602, column: 72, scope: !1793)
!1826 = !DILocation(line: 602, column: 54, scope: !1793)
!1827 = !DILocation(line: 602, column: 37, scope: !1793)
