; ModuleID = 'magick/resample.c'
source_filename = "magick/resample.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._ResampleFilter = type { %struct._CacheView*, %struct._Image*, %struct._ExceptionInfo*, i32, i64, i32, i32, i32, i32, i32, i32, %struct._MagickPixelPacket, double, double, double, double, double, double, double, [1024 x double], double, i64 }
%struct._CacheView = type opaque
%struct._MagickPixelPacket = type { i32, i32, i32, double, i64, float, float, float, float, float }

!416 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!417 = !{!418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489}
!418 = !DIEnumerator(name: "MagickUndefinedOptions", value: -1)
!419 = !DIEnumerator(name: "MagickAlignOptions", value: 0)
!420 = !DIEnumerator(name: "MagickAlphaOptions", value: 1)
!421 = !DIEnumerator(name: "MagickBooleanOptions", value: 2)
!422 = !DIEnumerator(name: "MagickCacheOptions", value: 3)
!423 = !DIEnumerator(name: "MagickChannelOptions", value: 4)
!424 = !DIEnumerator(name: "MagickClassOptions", value: 5)
!425 = !DIEnumerator(name: "MagickClipPathOptions", value: 6)
!426 = !DIEnumerator(name: "MagickCoderOptions", value: 7)
!427 = !DIEnumerator(name: "MagickColorOptions", value: 8)
!428 = !DIEnumerator(name: "MagickColorspaceOptions", value: 9)
!429 = !DIEnumerator(name: "MagickCommandOptions", value: 10)
!430 = !DIEnumerator(name: "MagickComposeOptions", value: 11)
!431 = !DIEnumerator(name: "MagickCompressOptions", value: 12)
!432 = !DIEnumerator(name: "MagickConfigureOptions", value: 13)
!433 = !DIEnumerator(name: "MagickDataTypeOptions", value: 14)
!434 = !DIEnumerator(name: "MagickDebugOptions", value: 15)
!435 = !DIEnumerator(name: "MagickDecorateOptions", value: 16)
!436 = !DIEnumerator(name: "MagickDelegateOptions", value: 17)
!437 = !DIEnumerator(name: "MagickDirectionOptions", value: 18)
!438 = !DIEnumerator(name: "MagickDisposeOptions", value: 19)
!439 = !DIEnumerator(name: "MagickDistortOptions", value: 20)
!440 = !DIEnumerator(name: "MagickDitherOptions", value: 21)
!441 = !DIEnumerator(name: "MagickEndianOptions", value: 22)
!442 = !DIEnumerator(name: "MagickEvaluateOptions", value: 23)
!443 = !DIEnumerator(name: "MagickFillRuleOptions", value: 24)
!444 = !DIEnumerator(name: "MagickFilterOptions", value: 25)
!445 = !DIEnumerator(name: "MagickFontOptions", value: 26)
!446 = !DIEnumerator(name: "MagickFontsOptions", value: 27)
!447 = !DIEnumerator(name: "MagickFormatOptions", value: 28)
!448 = !DIEnumerator(name: "MagickFunctionOptions", value: 29)
!449 = !DIEnumerator(name: "MagickGravityOptions", value: 30)
!450 = !DIEnumerator(name: "MagickIntentOptions", value: 31)
!451 = !DIEnumerator(name: "MagickInterlaceOptions", value: 32)
!452 = !DIEnumerator(name: "MagickInterpolateOptions", value: 33)
!453 = !DIEnumerator(name: "MagickKernelOptions", value: 34)
!454 = !DIEnumerator(name: "MagickLayerOptions", value: 35)
!455 = !DIEnumerator(name: "MagickLineCapOptions", value: 36)
!456 = !DIEnumerator(name: "MagickLineJoinOptions", value: 37)
!457 = !DIEnumerator(name: "MagickListOptions", value: 38)
!458 = !DIEnumerator(name: "MagickLocaleOptions", value: 39)
!459 = !DIEnumerator(name: "MagickLogEventOptions", value: 40)
!460 = !DIEnumerator(name: "MagickLogOptions", value: 41)
!461 = !DIEnumerator(name: "MagickMagicOptions", value: 42)
!462 = !DIEnumerator(name: "MagickMethodOptions", value: 43)
!463 = !DIEnumerator(name: "MagickMetricOptions", value: 44)
!464 = !DIEnumerator(name: "MagickMimeOptions", value: 45)
!465 = !DIEnumerator(name: "MagickModeOptions", value: 46)
!466 = !DIEnumerator(name: "MagickModuleOptions", value: 47)
!467 = !DIEnumerator(name: "MagickMorphologyOptions", value: 48)
!468 = !DIEnumerator(name: "MagickNoiseOptions", value: 49)
!469 = !DIEnumerator(name: "MagickOrientationOptions", value: 50)
!470 = !DIEnumerator(name: "MagickPixelIntensityOptions", value: 51)
!471 = !DIEnumerator(name: "MagickPolicyOptions", value: 52)
!472 = !DIEnumerator(name: "MagickPolicyDomainOptions", value: 53)
!473 = !DIEnumerator(name: "MagickPolicyRightsOptions", value: 54)
!474 = !DIEnumerator(name: "MagickPreviewOptions", value: 55)
!475 = !DIEnumerator(name: "MagickPrimitiveOptions", value: 56)
!476 = !DIEnumerator(name: "MagickQuantumFormatOptions", value: 57)
!477 = !DIEnumerator(name: "MagickResolutionOptions", value: 58)
!478 = !DIEnumerator(name: "MagickResourceOptions", value: 59)
!479 = !DIEnumerator(name: "MagickSparseColorOptions", value: 60)
!480 = !DIEnumerator(name: "MagickStatisticOptions", value: 61)
!481 = !DIEnumerator(name: "MagickStorageOptions", value: 62)
!482 = !DIEnumerator(name: "MagickStretchOptions", value: 63)
!483 = !DIEnumerator(name: "MagickStyleOptions", value: 64)
!484 = !DIEnumerator(name: "MagickThresholdOptions", value: 65)
!485 = !DIEnumerator(name: "MagickTypeOptions", value: 66)
!486 = !DIEnumerator(name: "MagickValidateOptions", value: 67)
!487 = !DIEnumerator(name: "MagickVirtualPixelOptions", value: 68)
!488 = !DIEnumerator(name: "MagickComplexOptions", value: 69)
!489 = !DIEnumerator(name: "MagickIntensityOptions", value: 70)
!490 = !{!491, !492, !556, !416, !501, !565, !538, !761, !524, !762, !764, !529, !742, !512, !766, !770}
!491 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64)
!493 = !DIDerivedType(tag: DW_TAG_typedef, name: "ResampleFilter", file: !102, line: 76, baseType: !494)
!494 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ResampleFilter", file: !1, line: 91, size: 67072, elements: !495)
!495 = !{!496, !500, !721, !723, !724, !725, !726, !728, !729, !730, !731, !732, !748, !749, !750, !751, !752, !753, !754, !755, !759, !760}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !494, file: !1, line: 94, baseType: !497, size: 64)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64)
!498 = !DIDerivedType(tag: DW_TAG_typedef, name: "CacheView", file: !369, line: 50, baseType: !499)
!499 = !DICompositeType(tag: DW_TAG_structure_type, name: "_CacheView", file: !326, line: 160, flags: DIFlagFwdDecl)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "image", scope: !494, file: !1, line: 97, baseType: !501, size: 64, offset: 64)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64)
!502 = !DIDerivedType(tag: DW_TAG_typedef, name: "Image", file: !4, line: 221, baseType: !503)
!503 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Image", file: !73, line: 150, size: 105920, elements: !504)
!504 = !{!505, !507, !509, !511, !514, !516, !518, !519, !520, !521, !522, !523, !534, !535, !536, !537, !539, !553, !555, !557, !559, !562, !563, !564, !570, !571, !572, !580, !581, !582, !583, !584, !585, !587, !589, !591, !593, !595, !597, !599, !600, !601, !602, !603, !604, !605, !613, !628, !642, !643, !644, !645, !649, !653, !657, !658, !659, !660, !661, !678, !679, !681, !682, !692, !693, !695, !696, !697, !698, !699, !700, !702, !703, !704, !705, !706, !707, !708, !710, !711, !712, !713, !714, !718, !720}
!505 = !DIDerivedType(tag: DW_TAG_member, name: "storage_class", scope: !503, file: !73, line: 153, baseType: !506, size: 32)
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "ClassType", file: !4, line: 209, baseType: !3)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !503, file: !73, line: 156, baseType: !508, size: 32, offset: 32)
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorspaceType", file: !11, line: 61, baseType: !10)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !503, file: !73, line: 159, baseType: !510, size: 32, offset: 64)
!510 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompressionType", file: !48, line: 49, baseType: !47)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !503, file: !73, line: 162, baseType: !512, size: 64, offset: 128)
!512 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !513, line: 46, baseType: !491)
!513 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!514 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !503, file: !73, line: 165, baseType: !515, size: 32, offset: 192)
!515 = !DIDerivedType(tag: DW_TAG_typedef, name: "OrientationType", file: !73, line: 86, baseType: !72)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "taint", scope: !503, file: !73, line: 168, baseType: !517, size: 32, offset: 224)
!517 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickBooleanType", file: !4, line: 215, baseType: !84)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "matte", scope: !503, file: !73, line: 169, baseType: !517, size: 32, offset: 256)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !503, file: !73, line: 172, baseType: !512, size: 64, offset: 320)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !503, file: !73, line: 173, baseType: !512, size: 64, offset: 384)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !503, file: !73, line: 174, baseType: !512, size: 64, offset: 448)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !503, file: !73, line: 175, baseType: !512, size: 64, offset: 512)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "colormap", scope: !503, file: !73, line: 178, baseType: !524, size: 64, offset: 576)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64)
!525 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelPacket", file: !326, line: 148, baseType: !526)
!526 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PixelPacket", file: !326, line: 131, size: 64, elements: !527)
!527 = !{!528, !531, !532, !533}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !526, file: !326, line: 143, baseType: !529, size: 16)
!529 = !DIDerivedType(tag: DW_TAG_typedef, name: "Quantum", file: !4, line: 93, baseType: !530)
!530 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !526, file: !326, line: 144, baseType: !529, size: 16, offset: 16)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !526, file: !326, line: 145, baseType: !529, size: 16, offset: 32)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !526, file: !326, line: 146, baseType: !529, size: 16, offset: 48)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "background_color", scope: !503, file: !73, line: 179, baseType: !525, size: 64, offset: 640)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !503, file: !73, line: 180, baseType: !525, size: 64, offset: 704)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "matte_color", scope: !503, file: !73, line: 181, baseType: !525, size: 64, offset: 768)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !503, file: !73, line: 184, baseType: !538, size: 64, offset: 832)
!538 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "chromaticity", scope: !503, file: !73, line: 187, baseType: !540, size: 768, offset: 896)
!540 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChromaticityInfo", file: !73, line: 128, baseType: !541)
!541 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ChromaticityInfo", file: !73, line: 121, size: 768, elements: !542)
!542 = !{!543, !550, !551, !552}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "red_primary", scope: !541, file: !73, line: 124, baseType: !544, size: 192)
!544 = !DIDerivedType(tag: DW_TAG_typedef, name: "PrimaryInfo", file: !73, line: 101, baseType: !545)
!545 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PrimaryInfo", file: !73, line: 95, size: 192, elements: !546)
!546 = !{!547, !548, !549}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !545, file: !73, line: 98, baseType: !538, size: 64)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !545, file: !73, line: 99, baseType: !538, size: 64, offset: 64)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !545, file: !73, line: 100, baseType: !538, size: 64, offset: 128)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "green_primary", scope: !541, file: !73, line: 125, baseType: !544, size: 192, offset: 192)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "blue_primary", scope: !541, file: !73, line: 126, baseType: !544, size: 192, offset: 384)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "white_point", scope: !541, file: !73, line: 127, baseType: !544, size: 192, offset: 576)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "rendering_intent", scope: !503, file: !73, line: 190, baseType: !554, size: 32, offset: 1664)
!554 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderingIntent", file: !89, line: 49, baseType: !88)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !503, file: !73, line: 193, baseType: !556, size: 64, offset: 1728)
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !503, file: !73, line: 196, baseType: !558, size: 32, offset: 1792)
!558 = !DIDerivedType(tag: DW_TAG_typedef, name: "ResolutionType", file: !73, line: 93, baseType: !96)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "montage", scope: !503, file: !73, line: 199, baseType: !560, size: 64, offset: 1856)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64)
!561 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "directory", scope: !503, file: !73, line: 200, baseType: !560, size: 64, offset: 1920)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "geometry", scope: !503, file: !73, line: 201, baseType: !560, size: 64, offset: 1984)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !503, file: !73, line: 204, baseType: !565, size: 64, offset: 2048)
!565 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !566, line: 77, baseType: !567)
!566 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!567 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !568, line: 193, baseType: !569)
!568 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!569 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "x_resolution", scope: !503, file: !73, line: 207, baseType: !538, size: 64, offset: 2112)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "y_resolution", scope: !503, file: !73, line: 208, baseType: !538, size: 64, offset: 2176)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !503, file: !73, line: 211, baseType: !573, size: 256, offset: 2240)
!573 = !DIDerivedType(tag: DW_TAG_typedef, name: "RectangleInfo", file: !153, line: 130, baseType: !574)
!574 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_RectangleInfo", file: !153, line: 121, size: 256, elements: !575)
!575 = !{!576, !577, !578, !579}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !574, file: !153, line: 124, baseType: !512, size: 64)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !574, file: !153, line: 125, baseType: !512, size: 64, offset: 64)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !574, file: !153, line: 128, baseType: !565, size: 64, offset: 128)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !574, file: !153, line: 129, baseType: !565, size: 64, offset: 192)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "extract_info", scope: !503, file: !73, line: 212, baseType: !573, size: 256, offset: 2496)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "tile_info", scope: !503, file: !73, line: 213, baseType: !573, size: 256, offset: 2752)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "bias", scope: !503, file: !73, line: 216, baseType: !538, size: 64, offset: 3008)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "blur", scope: !503, file: !73, line: 217, baseType: !538, size: 64, offset: 3072)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !503, file: !73, line: 218, baseType: !538, size: 64, offset: 3136)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !503, file: !73, line: 221, baseType: !586, size: 32, offset: 3200)
!586 = !DIDerivedType(tag: DW_TAG_typedef, name: "FilterTypes", file: !102, line: 66, baseType: !101)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "interlace", scope: !503, file: !73, line: 224, baseType: !588, size: 32, offset: 3232)
!588 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterlaceType", file: !73, line: 73, baseType: !136)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !503, file: !73, line: 227, baseType: !590, size: 32, offset: 3264)
!590 = !DIDerivedType(tag: DW_TAG_typedef, name: "EndianType", file: !147, line: 35, baseType: !146)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !503, file: !73, line: 230, baseType: !592, size: 32, offset: 3296)
!592 = !DIDerivedType(tag: DW_TAG_typedef, name: "GravityType", file: !153, line: 91, baseType: !152)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !503, file: !73, line: 233, baseType: !594, size: 32, offset: 3328)
!594 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompositeOperator", file: !168, line: 99, baseType: !167)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "dispose", scope: !503, file: !73, line: 236, baseType: !596, size: 32, offset: 3360)
!596 = !DIDerivedType(tag: DW_TAG_typedef, name: "DisposeType", file: !239, line: 32, baseType: !238)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "clip_mask", scope: !503, file: !73, line: 239, baseType: !598, size: 64, offset: 3392)
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !503, file: !73, line: 242, baseType: !512, size: 64, offset: 3456)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !503, file: !73, line: 243, baseType: !512, size: 64, offset: 3520)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_second", scope: !503, file: !73, line: 246, baseType: !565, size: 64, offset: 3584)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "iterations", scope: !503, file: !73, line: 249, baseType: !512, size: 64, offset: 3648)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "total_colors", scope: !503, file: !73, line: 250, baseType: !512, size: 64, offset: 3712)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "start_loop", scope: !503, file: !73, line: 253, baseType: !565, size: 64, offset: 3776)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !503, file: !73, line: 256, baseType: !606, size: 192, offset: 3840)
!606 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErrorInfo", file: !607, line: 68, baseType: !608)
!607 = !DIFile(filename: "./magick/color.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!608 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ErrorInfo", file: !607, line: 62, size: 192, elements: !609)
!609 = !{!610, !611, !612}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "mean_error_per_pixel", scope: !608, file: !607, line: 65, baseType: !538, size: 64)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_mean_error", scope: !608, file: !607, line: 66, baseType: !538, size: 64, offset: 64)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_maximum_error", scope: !608, file: !607, line: 67, baseType: !538, size: 64, offset: 128)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !503, file: !73, line: 259, baseType: !614, size: 512, offset: 4032)
!614 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerInfo", file: !247, line: 51, baseType: !615)
!615 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TimerInfo", file: !247, line: 40, size: 512, elements: !616)
!616 = !{!617, !624, !625, !627}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !615, file: !247, line: 43, baseType: !618, size: 192)
!618 = !DIDerivedType(tag: DW_TAG_typedef, name: "Timer", file: !247, line: 38, baseType: !619)
!619 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Timer", file: !247, line: 32, size: 192, elements: !620)
!620 = !{!621, !622, !623}
!621 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !619, file: !247, line: 35, baseType: !538, size: 64)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !619, file: !247, line: 36, baseType: !538, size: 64, offset: 64)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !619, file: !247, line: 37, baseType: !538, size: 64, offset: 128)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "elapsed", scope: !615, file: !247, line: 44, baseType: !618, size: 192, offset: 192)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !615, file: !247, line: 47, baseType: !626, size: 32, offset: 384)
!626 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerState", file: !247, line: 30, baseType: !246)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !615, file: !247, line: 50, baseType: !512, size: 64, offset: 448)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !503, file: !73, line: 262, baseType: !629, size: 64, offset: 4544)
!629 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickProgressMonitor", file: !630, line: 26, baseType: !631)
!630 = !DIFile(filename: "./magick/monitor.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64)
!632 = !DISubroutineType(types: !633)
!633 = !{!517, !634, !636, !639, !556}
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64)
!635 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !561)
!636 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !637)
!637 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickOffsetType", file: !4, line: 150, baseType: !638)
!638 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!639 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !640)
!640 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickSizeType", file: !4, line: 151, baseType: !641)
!641 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !503, file: !73, line: 265, baseType: !556, size: 64, offset: 4608)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !503, file: !73, line: 266, baseType: !556, size: 64, offset: 4672)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !503, file: !73, line: 267, baseType: !556, size: 64, offset: 4736)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "ascii85", scope: !503, file: !73, line: 270, baseType: !646, size: 64, offset: 4800)
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64)
!647 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ascii85Info", file: !48, line: 52, baseType: !648)
!648 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Ascii85Info", file: !48, line: 51, flags: DIFlagFwdDecl)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !503, file: !73, line: 273, baseType: !650, size: 64, offset: 4864)
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 64)
!651 = !DIDerivedType(tag: DW_TAG_typedef, name: "BlobInfo", file: !4, line: 217, baseType: !652)
!652 = !DICompositeType(tag: DW_TAG_structure_type, name: "_BlobInfo", file: !4, line: 217, flags: DIFlagFwdDecl)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !503, file: !73, line: 276, baseType: !654, size: 32768, offset: 4928)
!654 = !DICompositeType(tag: DW_TAG_array_type, baseType: !561, size: 32768, elements: !655)
!655 = !{!656}
!656 = !DISubrange(count: 4096)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "magick_filename", scope: !503, file: !73, line: 277, baseType: !654, size: 32768, offset: 37696)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !503, file: !73, line: 278, baseType: !654, size: 32768, offset: 70464)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "magick_columns", scope: !503, file: !73, line: 281, baseType: !512, size: 64, offset: 103232)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "magick_rows", scope: !503, file: !73, line: 282, baseType: !512, size: 64, offset: 103296)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "exception", scope: !503, file: !73, line: 285, baseType: !662, size: 448, offset: 103360)
!662 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionInfo", file: !4, line: 219, baseType: !663)
!663 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ExceptionInfo", file: !253, line: 102, size: 448, elements: !664)
!664 = !{!665, !667, !668, !669, !670, !671, !672, !677}
!665 = !DIDerivedType(tag: DW_TAG_member, name: "severity", scope: !663, file: !253, line: 105, baseType: !666, size: 32)
!666 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionType", file: !253, line: 100, baseType: !252)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "error_number", scope: !663, file: !253, line: 108, baseType: !416, size: 32, offset: 32)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !663, file: !253, line: 111, baseType: !560, size: 64, offset: 64)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !663, file: !253, line: 112, baseType: !560, size: 64, offset: 128)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "exceptions", scope: !663, file: !253, line: 115, baseType: !556, size: 64, offset: 192)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "relinquish", scope: !663, file: !253, line: 118, baseType: !517, size: 32, offset: 256)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !663, file: !253, line: 121, baseType: !673, size: 64, offset: 320)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64)
!674 = !DIDerivedType(tag: DW_TAG_typedef, name: "SemaphoreInfo", file: !675, line: 26, baseType: !676)
!675 = !DIFile(filename: "./magick/semaphore.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!676 = !DICompositeType(tag: DW_TAG_structure_type, name: "SemaphoreInfo", file: !675, line: 25, flags: DIFlagFwdDecl)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !663, file: !253, line: 124, baseType: !512, size: 64, offset: 384)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !503, file: !73, line: 288, baseType: !517, size: 32, offset: 103808)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !503, file: !73, line: 291, baseType: !680, size: 64, offset: 103872)
!680 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !565)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !503, file: !73, line: 294, baseType: !673, size: 64, offset: 103936)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "color_profile", scope: !503, file: !73, line: 297, baseType: !683, size: 256, offset: 104000)
!683 = !DIDerivedType(tag: DW_TAG_typedef, name: "ProfileInfo", file: !89, line: 40, baseType: !684)
!684 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ProfileInfo", file: !89, line: 27, size: 256, elements: !685)
!685 = !{!686, !687, !688, !691}
!686 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !684, file: !89, line: 30, baseType: !560, size: 64)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !684, file: !89, line: 33, baseType: !512, size: 64, offset: 64)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !684, file: !89, line: 36, baseType: !689, size: 64, offset: 128)
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 64)
!690 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !684, file: !89, line: 39, baseType: !512, size: 64, offset: 192)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "iptc_profile", scope: !503, file: !73, line: 298, baseType: !683, size: 256, offset: 104256)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profile", scope: !503, file: !73, line: 299, baseType: !694, size: 64, offset: 104512)
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 64)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profiles", scope: !503, file: !73, line: 302, baseType: !512, size: 64, offset: 104576)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !503, file: !73, line: 305, baseType: !512, size: 64, offset: 104640)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !503, file: !73, line: 308, baseType: !598, size: 64, offset: 104704)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !503, file: !73, line: 309, baseType: !598, size: 64, offset: 104768)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !503, file: !73, line: 310, baseType: !598, size: 64, offset: 104832)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "interpolate", scope: !503, file: !73, line: 313, baseType: !701, size: 32, offset: 104896)
!701 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterpolatePixelMethod", file: !326, line: 47, baseType: !325)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "black_point_compensation", scope: !503, file: !73, line: 316, baseType: !517, size: 32, offset: 104928)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_color", scope: !503, file: !73, line: 319, baseType: !525, size: 64, offset: 104960)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !503, file: !73, line: 322, baseType: !598, size: 64, offset: 105024)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "tile_offset", scope: !503, file: !73, line: 325, baseType: !573, size: 256, offset: 105088)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !503, file: !73, line: 328, baseType: !556, size: 64, offset: 105344)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "artifacts", scope: !503, file: !73, line: 329, baseType: !556, size: 64, offset: 105408)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !503, file: !73, line: 332, baseType: !709, size: 32, offset: 105472)
!709 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageType", file: !73, line: 61, baseType: !342)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !503, file: !73, line: 335, baseType: !517, size: 32, offset: 105504)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !503, file: !73, line: 338, baseType: !640, size: 64, offset: 105536)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "ping", scope: !503, file: !73, line: 341, baseType: !517, size: 32, offset: 105600)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !503, file: !73, line: 344, baseType: !512, size: 64, offset: 105664)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !503, file: !73, line: 347, baseType: !715, size: 64, offset: 105728)
!715 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !716, line: 7, baseType: !717)
!716 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "")
!717 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !568, line: 160, baseType: !569)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "intensity", scope: !503, file: !73, line: 350, baseType: !719, size: 32, offset: 105792)
!719 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelIntensityMethod", file: !326, line: 79, baseType: !356)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !503, file: !73, line: 353, baseType: !512, size: 64, offset: 105856)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "exception", scope: !494, file: !1, line: 100, baseType: !722, size: 64, offset: 128)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !662, size: 64)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !494, file: !1, line: 103, baseType: !517, size: 32, offset: 192)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "image_area", scope: !494, file: !1, line: 107, baseType: !565, size: 64, offset: 256)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "interpolate", scope: !494, file: !1, line: 110, baseType: !701, size: 32, offset: 320)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_pixel", scope: !494, file: !1, line: 113, baseType: !727, size: 32, offset: 352)
!727 = !DIDerivedType(tag: DW_TAG_typedef, name: "VirtualPixelMethod", file: !369, line: 47, baseType: !368)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !494, file: !1, line: 116, baseType: !586, size: 32, offset: 384)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "limit_reached", scope: !494, file: !1, line: 120, baseType: !517, size: 32, offset: 416)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "do_interpolate", scope: !494, file: !1, line: 121, baseType: !517, size: 32, offset: 448)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "average_defined", scope: !494, file: !1, line: 122, baseType: !517, size: 32, offset: 480)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "average_pixel", scope: !494, file: !1, line: 125, baseType: !733, size: 448, offset: 512)
!733 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickPixelPacket", file: !326, line: 127, baseType: !734)
!734 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MagickPixelPacket", file: !326, line: 104, size: 448, elements: !735)
!735 = !{!736, !737, !738, !739, !740, !741, !744, !745, !746, !747}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "storage_class", scope: !734, file: !326, line: 107, baseType: !506, size: 32)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !734, file: !326, line: 110, baseType: !508, size: 32, offset: 32)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "matte", scope: !734, file: !326, line: 113, baseType: !517, size: 32, offset: 64)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !734, file: !326, line: 116, baseType: !538, size: 64, offset: 128)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !734, file: !326, line: 119, baseType: !512, size: 64, offset: 192)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !734, file: !326, line: 122, baseType: !742, size: 32, offset: 256)
!742 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickRealType", file: !4, line: 78, baseType: !743)
!743 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !734, file: !326, line: 123, baseType: !742, size: 32, offset: 288)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !734, file: !326, line: 124, baseType: !742, size: 32, offset: 320)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !734, file: !326, line: 125, baseType: !742, size: 32, offset: 352)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !734, file: !326, line: 126, baseType: !742, size: 32, offset: 384)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "A", scope: !494, file: !1, line: 129, baseType: !538, size: 64, offset: 960)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "B", scope: !494, file: !1, line: 129, baseType: !538, size: 64, offset: 1024)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "C", scope: !494, file: !1, line: 129, baseType: !538, size: 64, offset: 1088)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "Vlimit", scope: !494, file: !1, line: 130, baseType: !538, size: 64, offset: 1152)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "Ulimit", scope: !494, file: !1, line: 130, baseType: !538, size: 64, offset: 1216)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "Uwidth", scope: !494, file: !1, line: 130, baseType: !538, size: 64, offset: 1280)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "slope", scope: !494, file: !1, line: 130, baseType: !538, size: 64, offset: 1344)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "filter_lut", scope: !494, file: !1, line: 135, baseType: !756, size: 65536, offset: 1408)
!756 = !DICompositeType(tag: DW_TAG_array_type, baseType: !538, size: 65536, elements: !757)
!757 = !{!758}
!758 = !DISubrange(count: 1024)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "support", scope: !494, file: !1, line: 147, baseType: !538, size: 64, offset: 66944)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !494, file: !1, line: 150, baseType: !512, size: 64, offset: 67008)
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 64)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 64)
!763 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !525)
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 64)
!765 = !DIDerivedType(tag: DW_TAG_typedef, name: "IndexPacket", file: !326, line: 129, baseType: !529)
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64)
!767 = !DIDerivedType(tag: DW_TAG_typedef, name: "ResizeFilter", file: !768, line: 26, baseType: !769)
!768 = !DIFile(filename: "./magick/resize.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!769 = !DICompositeType(tag: DW_TAG_structure_type, name: "_ResizeFilter", file: !768, line: 25, flags: DIFlagFwdDecl)
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !771, size: 64)
!771 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !765)
!772 = !{i32 7, !"Dwarf Version", i32 4}
!773 = !{i32 2, !"Debug Info Version", i32 3}
!774 = !{i32 1, !"wchar_size", i32 4}
!775 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!776 = distinct !DISubprogram(name: "AcquireResampleFilter", scope: !1, file: !1, line: 206, type: !777, scopeLine: 208, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !781)
!777 = !DISubroutineType(types: !778)
!778 = !{!492, !779, !722}
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !780, size: 64)
!780 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !502)
!781 = !{}
!782 = !DILocalVariable(name: "image", arg: 1, scope: !776, file: !1, line: 206, type: !779)
!783 = !DILocation(line: 206, column: 65, scope: !776)
!784 = !DILocalVariable(name: "exception", arg: 2, scope: !776, file: !1, line: 207, type: !722)
!785 = !DILocation(line: 207, column: 18, scope: !776)
!786 = !DILocalVariable(name: "resample_filter", scope: !776, file: !1, line: 210, type: !492)
!787 = !DILocation(line: 210, column: 6, scope: !776)
!788 = !DILocation(line: 214, column: 7, scope: !789)
!789 = distinct !DILexicalBlock(scope: !776, file: !1, line: 214, column: 7)
!790 = !DILocation(line: 214, column: 14, scope: !789)
!791 = !DILocation(line: 214, column: 20, scope: !789)
!792 = !DILocation(line: 214, column: 7, scope: !776)
!793 = !DILocation(line: 215, column: 61, scope: !789)
!794 = !DILocation(line: 215, column: 68, scope: !789)
!795 = !DILocation(line: 215, column: 12, scope: !789)
!796 = !DILocation(line: 215, column: 5, scope: !789)
!797 = !DILocation(line: 219, column: 38, scope: !776)
!798 = !DILocation(line: 219, column: 19, scope: !776)
!799 = !DILocation(line: 219, column: 18, scope: !776)
!800 = !DILocation(line: 221, column: 7, scope: !801)
!801 = distinct !DILexicalBlock(scope: !776, file: !1, line: 221, column: 7)
!802 = !DILocation(line: 221, column: 23, scope: !801)
!803 = !DILocation(line: 221, column: 7, scope: !776)
!804 = !DILocalVariable(name: "message", scope: !805, file: !1, line: 222, type: !560)
!805 = distinct !DILexicalBlock(scope: !801, file: !1, line: 222, column: 5)
!806 = !DILocation(line: 222, column: 5, scope: !805)
!807 = !DILocalVariable(name: "exception", scope: !805, file: !1, line: 222, type: !662)
!808 = !DILocation(line: 223, column: 28, scope: !776)
!809 = !DILocation(line: 223, column: 10, scope: !776)
!810 = !DILocation(line: 225, column: 30, scope: !776)
!811 = !DILocation(line: 225, column: 3, scope: !776)
!812 = !DILocation(line: 225, column: 20, scope: !776)
!813 = !DILocation(line: 225, column: 29, scope: !776)
!814 = !DILocation(line: 226, column: 51, scope: !776)
!815 = !DILocation(line: 226, column: 26, scope: !776)
!816 = !DILocation(line: 226, column: 3, scope: !776)
