; ModuleID = 'magick/layer.c'
source_filename = "magick/layer.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._Image = type { i32, i32, i32, i64, i32, i32, i32, i64, i64, i64, i64, %struct._PixelPacket*, %struct._PixelPacket, %struct._PixelPacket, %struct._PixelPacket, double, %struct._ChromaticityInfo, i32, i8*, i32, i8*, i8*, i8*, i64, double, double, %struct._RectangleInfo, %struct._RectangleInfo, %struct._RectangleInfo, double, double, double, i32, i32, i32, i32, i32, i32, %struct._Image*, i64, i64, i64, i64, i64, i64, %struct._ErrorInfo, %struct._TimerInfo, i32 (i8*, i64, i64, i8*)*, i8*, i8*, i8*, %struct._Ascii85Info*, %struct._BlobInfo*, [4096 x i8], [4096 x i8], [4096 x i8], i64, i64, %struct._ExceptionInfo, i32, i64, %struct.SemaphoreInfo*, %struct._ProfileInfo, %struct._ProfileInfo, %struct._ProfileInfo*, i64, i64, %struct._Image*, %struct._Image*, %struct._Image*, i32, i32, %struct._PixelPacket, %struct._Image*, %struct._RectangleInfo, i8*, i8*, i32, i32, i64, i32, i64, i64, i32, i64 }
%struct._ChromaticityInfo = type { %struct._PrimaryInfo, %struct._PrimaryInfo, %struct._PrimaryInfo, %struct._PrimaryInfo }
%struct._PrimaryInfo = type { double, double, double }
%struct._ErrorInfo = type { double, double, double }
%struct._TimerInfo = type { %struct._Timer, %struct._Timer, i32, i64 }
%struct._Timer = type { double, double, double }
%struct._Ascii85Info = type opaque

!367 = !DIEnumerator(name: "MSPixelIntensityMethod", value: 9, isUnsigned: true)
!368 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !369, line: 34, baseType: !5, size: 32, elements: !370)
!369 = !DIFile(filename: "./magick/log.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!370 = !{!371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392}
!371 = !DIEnumerator(name: "UndefinedEvents", value: 0, isUnsigned: true)
!372 = !DIEnumerator(name: "NoEvents", value: 0, isUnsigned: true)
!373 = !DIEnumerator(name: "TraceEvent", value: 1, isUnsigned: true)
!374 = !DIEnumerator(name: "AnnotateEvent", value: 2, isUnsigned: true)
!375 = !DIEnumerator(name: "BlobEvent", value: 4, isUnsigned: true)
!376 = !DIEnumerator(name: "CacheEvent", value: 8, isUnsigned: true)
!377 = !DIEnumerator(name: "CoderEvent", value: 16, isUnsigned: true)
!378 = !DIEnumerator(name: "ConfigureEvent", value: 32, isUnsigned: true)
!379 = !DIEnumerator(name: "DeprecateEvent", value: 64, isUnsigned: true)
!380 = !DIEnumerator(name: "DrawEvent", value: 128, isUnsigned: true)
!381 = !DIEnumerator(name: "ExceptionEvent", value: 256, isUnsigned: true)
!382 = !DIEnumerator(name: "ImageEvent", value: 512, isUnsigned: true)
!383 = !DIEnumerator(name: "LocaleEvent", value: 1024, isUnsigned: true)
!384 = !DIEnumerator(name: "ModuleEvent", value: 2048, isUnsigned: true)
!385 = !DIEnumerator(name: "PolicyEvent", value: 4096, isUnsigned: true)
!386 = !DIEnumerator(name: "ResourceEvent", value: 8192, isUnsigned: true)
!387 = !DIEnumerator(name: "TransformEvent", value: 16384, isUnsigned: true)
!388 = !DIEnumerator(name: "UserEvent", value: 36864, isUnsigned: true)
!389 = !DIEnumerator(name: "WandEvent", value: 65536, isUnsigned: true)
!390 = !DIEnumerator(name: "X11Event", value: 131072, isUnsigned: true)
!391 = !DIEnumerator(name: "AccelerateEvent", value: 262144, isUnsigned: true)
!392 = !DIEnumerator(name: "AllEvents", value: 2147483647, isUnsigned: true)
!393 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !239, line: 34, baseType: !5, size: 32, elements: !394)
!394 = !{!395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411}
!395 = !DIEnumerator(name: "UndefinedLayer", value: 0, isUnsigned: true)
!396 = !DIEnumerator(name: "CoalesceLayer", value: 1, isUnsigned: true)
!397 = !DIEnumerator(name: "CompareAnyLayer", value: 2, isUnsigned: true)
!398 = !DIEnumerator(name: "CompareClearLayer", value: 3, isUnsigned: true)
!399 = !DIEnumerator(name: "CompareOverlayLayer", value: 4, isUnsigned: true)
!400 = !DIEnumerator(name: "DisposeLayer", value: 5, isUnsigned: true)
!401 = !DIEnumerator(name: "OptimizeLayer", value: 6, isUnsigned: true)
!402 = !DIEnumerator(name: "OptimizeImageLayer", value: 7, isUnsigned: true)
!403 = !DIEnumerator(name: "OptimizePlusLayer", value: 8, isUnsigned: true)
!404 = !DIEnumerator(name: "OptimizeTransLayer", value: 9, isUnsigned: true)
!405 = !DIEnumerator(name: "RemoveDupsLayer", value: 10, isUnsigned: true)
!406 = !DIEnumerator(name: "RemoveZeroLayer", value: 11, isUnsigned: true)
!407 = !DIEnumerator(name: "CompositeLayer", value: 12, isUnsigned: true)
!408 = !DIEnumerator(name: "MergeLayer", value: 13, isUnsigned: true)
!409 = !DIEnumerator(name: "FlattenLayer", value: 14, isUnsigned: true)
!410 = !DIEnumerator(name: "MosaicLayer", value: 15, isUnsigned: true)
!411 = !DIEnumerator(name: "TrimBoundsLayer", value: 16, isUnsigned: true)
!412 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !73, line: 30, baseType: !5, size: 32, elements: !413)
!413 = !{!414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426}
!414 = !DIEnumerator(name: "UndefinedAlphaChannel", value: 0, isUnsigned: true)
!415 = !DIEnumerator(name: "ActivateAlphaChannel", value: 1, isUnsigned: true)
!416 = !DIEnumerator(name: "BackgroundAlphaChannel", value: 2, isUnsigned: true)
!417 = !DIEnumerator(name: "CopyAlphaChannel", value: 3, isUnsigned: true)
!418 = !DIEnumerator(name: "DeactivateAlphaChannel", value: 4, isUnsigned: true)
!419 = !DIEnumerator(name: "ExtractAlphaChannel", value: 5, isUnsigned: true)
!420 = !DIEnumerator(name: "OpaqueAlphaChannel", value: 6, isUnsigned: true)
!421 = !DIEnumerator(name: "ResetAlphaChannel", value: 7, isUnsigned: true)
!422 = !DIEnumerator(name: "SetAlphaChannel", value: 8, isUnsigned: true)
!423 = !DIEnumerator(name: "ShapeAlphaChannel", value: 9, isUnsigned: true)
!424 = !DIEnumerator(name: "TransparentAlphaChannel", value: 10, isUnsigned: true)
!425 = !DIEnumerator(name: "FlattenAlphaChannel", value: 11, isUnsigned: true)
!426 = !DIEnumerator(name: "RemoveAlphaChannel", value: 12, isUnsigned: true)
!427 = !{!428, !429, !484, !493, !457, !650, !440, !651, !565, !452, !653, !655, !657, !445, !660, !524, !557}
!428 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!430 = !DIDerivedType(tag: DW_TAG_typedef, name: "Image", file: !4, line: 221, baseType: !431)
!431 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Image", file: !73, line: 150, size: 105920, elements: !432)
!432 = !{!433, !435, !437, !439, !442, !444, !446, !447, !448, !449, !450, !451, !462, !463, !464, !465, !467, !481, !483, !485, !487, !490, !491, !492, !498, !499, !500, !508, !509, !510, !511, !512, !513, !515, !517, !519, !521, !523, !525, !527, !528, !529, !530, !531, !532, !533, !541, !556, !570, !571, !572, !573, !577, !581, !585, !586, !587, !588, !589, !607, !608, !610, !611, !621, !622, !624, !625, !626, !627, !628, !629, !631, !632, !633, !634, !635, !636, !637, !639, !640, !641, !642, !643, !647, !649}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "storage_class", scope: !431, file: !73, line: 153, baseType: !434, size: 32)
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "ClassType", file: !4, line: 209, baseType: !3)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !431, file: !73, line: 156, baseType: !436, size: 32, offset: 32)
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorspaceType", file: !11, line: 61, baseType: !10)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !431, file: !73, line: 159, baseType: !438, size: 32, offset: 64)
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompressionType", file: !48, line: 49, baseType: !47)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !431, file: !73, line: 162, baseType: !440, size: 64, offset: 128)
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !441, line: 46, baseType: !428)
!441 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!442 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !431, file: !73, line: 165, baseType: !443, size: 32, offset: 192)
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "OrientationType", file: !73, line: 86, baseType: !72)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "taint", scope: !431, file: !73, line: 168, baseType: !445, size: 32, offset: 224)
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickBooleanType", file: !4, line: 215, baseType: !84)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "matte", scope: !431, file: !73, line: 169, baseType: !445, size: 32, offset: 256)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !431, file: !73, line: 172, baseType: !440, size: 64, offset: 320)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !431, file: !73, line: 173, baseType: !440, size: 64, offset: 384)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !431, file: !73, line: 174, baseType: !440, size: 64, offset: 448)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !431, file: !73, line: 175, baseType: !440, size: 64, offset: 512)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "colormap", scope: !431, file: !73, line: 178, baseType: !452, size: 64, offset: 576)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64)
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelPacket", file: !326, line: 148, baseType: !454)
!454 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PixelPacket", file: !326, line: 131, size: 64, elements: !455)
!455 = !{!456, !459, !460, !461}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !454, file: !326, line: 143, baseType: !457, size: 16)
!457 = !DIDerivedType(tag: DW_TAG_typedef, name: "Quantum", file: !4, line: 93, baseType: !458)
!458 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !454, file: !326, line: 144, baseType: !457, size: 16, offset: 16)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !454, file: !326, line: 145, baseType: !457, size: 16, offset: 32)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !454, file: !326, line: 146, baseType: !457, size: 16, offset: 48)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "background_color", scope: !431, file: !73, line: 179, baseType: !453, size: 64, offset: 640)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !431, file: !73, line: 180, baseType: !453, size: 64, offset: 704)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "matte_color", scope: !431, file: !73, line: 181, baseType: !453, size: 64, offset: 768)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !431, file: !73, line: 184, baseType: !466, size: 64, offset: 832)
!466 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "chromaticity", scope: !431, file: !73, line: 187, baseType: !468, size: 768, offset: 896)
!468 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChromaticityInfo", file: !73, line: 128, baseType: !469)
!469 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ChromaticityInfo", file: !73, line: 121, size: 768, elements: !470)
!470 = !{!471, !478, !479, !480}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "red_primary", scope: !469, file: !73, line: 124, baseType: !472, size: 192)
!472 = !DIDerivedType(tag: DW_TAG_typedef, name: "PrimaryInfo", file: !73, line: 101, baseType: !473)
!473 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PrimaryInfo", file: !73, line: 95, size: 192, elements: !474)
!474 = !{!475, !476, !477}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !473, file: !73, line: 98, baseType: !466, size: 64)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !473, file: !73, line: 99, baseType: !466, size: 64, offset: 64)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !473, file: !73, line: 100, baseType: !466, size: 64, offset: 128)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "green_primary", scope: !469, file: !73, line: 125, baseType: !472, size: 192, offset: 192)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "blue_primary", scope: !469, file: !73, line: 126, baseType: !472, size: 192, offset: 384)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "white_point", scope: !469, file: !73, line: 127, baseType: !472, size: 192, offset: 576)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "rendering_intent", scope: !431, file: !73, line: 190, baseType: !482, size: 32, offset: 1664)
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderingIntent", file: !89, line: 49, baseType: !88)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !431, file: !73, line: 193, baseType: !484, size: 64, offset: 1728)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !431, file: !73, line: 196, baseType: !486, size: 32, offset: 1792)
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "ResolutionType", file: !73, line: 93, baseType: !96)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "montage", scope: !431, file: !73, line: 199, baseType: !488, size: 64, offset: 1856)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64)
!489 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "directory", scope: !431, file: !73, line: 200, baseType: !488, size: 64, offset: 1920)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "geometry", scope: !431, file: !73, line: 201, baseType: !488, size: 64, offset: 1984)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !431, file: !73, line: 204, baseType: !493, size: 64, offset: 2048)
!493 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !494, line: 77, baseType: !495)
!494 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !496, line: 193, baseType: !497)
!496 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!497 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "x_resolution", scope: !431, file: !73, line: 207, baseType: !466, size: 64, offset: 2112)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "y_resolution", scope: !431, file: !73, line: 208, baseType: !466, size: 64, offset: 2176)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !431, file: !73, line: 211, baseType: !501, size: 256, offset: 2240)
!501 = !DIDerivedType(tag: DW_TAG_typedef, name: "RectangleInfo", file: !153, line: 130, baseType: !502)
!502 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_RectangleInfo", file: !153, line: 121, size: 256, elements: !503)
!503 = !{!504, !505, !506, !507}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !502, file: !153, line: 124, baseType: !440, size: 64)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !502, file: !153, line: 125, baseType: !440, size: 64, offset: 64)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !502, file: !153, line: 128, baseType: !493, size: 64, offset: 128)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !502, file: !153, line: 129, baseType: !493, size: 64, offset: 192)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "extract_info", scope: !431, file: !73, line: 212, baseType: !501, size: 256, offset: 2496)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "tile_info", scope: !431, file: !73, line: 213, baseType: !501, size: 256, offset: 2752)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "bias", scope: !431, file: !73, line: 216, baseType: !466, size: 64, offset: 3008)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "blur", scope: !431, file: !73, line: 217, baseType: !466, size: 64, offset: 3072)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !431, file: !73, line: 218, baseType: !466, size: 64, offset: 3136)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !431, file: !73, line: 221, baseType: !514, size: 32, offset: 3200)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "FilterTypes", file: !102, line: 66, baseType: !101)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "interlace", scope: !431, file: !73, line: 224, baseType: !516, size: 32, offset: 3232)
!516 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterlaceType", file: !73, line: 73, baseType: !136)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !431, file: !73, line: 227, baseType: !518, size: 32, offset: 3264)
!518 = !DIDerivedType(tag: DW_TAG_typedef, name: "EndianType", file: !147, line: 35, baseType: !146)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !431, file: !73, line: 230, baseType: !520, size: 32, offset: 3296)
!520 = !DIDerivedType(tag: DW_TAG_typedef, name: "GravityType", file: !153, line: 91, baseType: !152)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !431, file: !73, line: 233, baseType: !522, size: 32, offset: 3328)
!522 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompositeOperator", file: !168, line: 99, baseType: !167)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "dispose", scope: !431, file: !73, line: 236, baseType: !524, size: 32, offset: 3360)
!524 = !DIDerivedType(tag: DW_TAG_typedef, name: "DisposeType", file: !239, line: 32, baseType: !238)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "clip_mask", scope: !431, file: !73, line: 239, baseType: !526, size: 64, offset: 3392)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !431, file: !73, line: 242, baseType: !440, size: 64, offset: 3456)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !431, file: !73, line: 243, baseType: !440, size: 64, offset: 3520)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_second", scope: !431, file: !73, line: 246, baseType: !493, size: 64, offset: 3584)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "iterations", scope: !431, file: !73, line: 249, baseType: !440, size: 64, offset: 3648)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "total_colors", scope: !431, file: !73, line: 250, baseType: !440, size: 64, offset: 3712)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "start_loop", scope: !431, file: !73, line: 253, baseType: !493, size: 64, offset: 3776)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !431, file: !73, line: 256, baseType: !534, size: 192, offset: 3840)
!534 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErrorInfo", file: !535, line: 68, baseType: !536)
!535 = !DIFile(filename: "./magick/color.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!536 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ErrorInfo", file: !535, line: 62, size: 192, elements: !537)
!537 = !{!538, !539, !540}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "mean_error_per_pixel", scope: !536, file: !535, line: 65, baseType: !466, size: 64)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_mean_error", scope: !536, file: !535, line: 66, baseType: !466, size: 64, offset: 64)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_maximum_error", scope: !536, file: !535, line: 67, baseType: !466, size: 64, offset: 128)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !431, file: !73, line: 259, baseType: !542, size: 512, offset: 4032)
!542 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerInfo", file: !247, line: 51, baseType: !543)
!543 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TimerInfo", file: !247, line: 40, size: 512, elements: !544)
!544 = !{!545, !552, !553, !555}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !543, file: !247, line: 43, baseType: !546, size: 192)
!546 = !DIDerivedType(tag: DW_TAG_typedef, name: "Timer", file: !247, line: 38, baseType: !547)
!547 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Timer", file: !247, line: 32, size: 192, elements: !548)
!548 = !{!549, !550, !551}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !547, file: !247, line: 35, baseType: !466, size: 64)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !547, file: !247, line: 36, baseType: !466, size: 64, offset: 64)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !547, file: !247, line: 37, baseType: !466, size: 64, offset: 128)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "elapsed", scope: !543, file: !247, line: 44, baseType: !546, size: 192, offset: 192)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !543, file: !247, line: 47, baseType: !554, size: 32, offset: 384)
!554 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerState", file: !247, line: 30, baseType: !246)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !543, file: !247, line: 50, baseType: !440, size: 64, offset: 448)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !431, file: !73, line: 262, baseType: !557, size: 64, offset: 4544)
!557 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickProgressMonitor", file: !558, line: 26, baseType: !559)
!558 = !DIFile(filename: "./magick/monitor.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 64)
!560 = !DISubroutineType(types: !561)
!561 = !{!445, !562, !564, !567, !484}
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64)
!563 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !489)
!564 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !565)
!565 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickOffsetType", file: !4, line: 150, baseType: !566)
!566 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!567 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !568)
!568 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickSizeType", file: !4, line: 151, baseType: !569)
!569 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !431, file: !73, line: 265, baseType: !484, size: 64, offset: 4608)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !431, file: !73, line: 266, baseType: !484, size: 64, offset: 4672)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !431, file: !73, line: 267, baseType: !484, size: 64, offset: 4736)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "ascii85", scope: !431, file: !73, line: 270, baseType: !574, size: 64, offset: 4800)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64)
!575 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ascii85Info", file: !48, line: 52, baseType: !576)
!576 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Ascii85Info", file: !48, line: 51, flags: DIFlagFwdDecl)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !431, file: !73, line: 273, baseType: !578, size: 64, offset: 4864)
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64)
!579 = !DIDerivedType(tag: DW_TAG_typedef, name: "BlobInfo", file: !4, line: 217, baseType: !580)
!580 = !DICompositeType(tag: DW_TAG_structure_type, name: "_BlobInfo", file: !4, line: 217, flags: DIFlagFwdDecl)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !431, file: !73, line: 276, baseType: !582, size: 32768, offset: 4928)
!582 = !DICompositeType(tag: DW_TAG_array_type, baseType: !489, size: 32768, elements: !583)
!583 = !{!584}
!584 = !DISubrange(count: 4096)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "magick_filename", scope: !431, file: !73, line: 277, baseType: !582, size: 32768, offset: 37696)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !431, file: !73, line: 278, baseType: !582, size: 32768, offset: 70464)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "magick_columns", scope: !431, file: !73, line: 281, baseType: !440, size: 64, offset: 103232)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "magick_rows", scope: !431, file: !73, line: 282, baseType: !440, size: 64, offset: 103296)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "exception", scope: !431, file: !73, line: 285, baseType: !590, size: 448, offset: 103360)
!590 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionInfo", file: !4, line: 219, baseType: !591)
!591 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ExceptionInfo", file: !253, line: 102, size: 448, elements: !592)
!592 = !{!593, !595, !597, !598, !599, !600, !601, !606}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "severity", scope: !591, file: !253, line: 105, baseType: !594, size: 32)
!594 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionType", file: !253, line: 100, baseType: !252)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "error_number", scope: !591, file: !253, line: 108, baseType: !596, size: 32, offset: 32)
!596 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !591, file: !253, line: 111, baseType: !488, size: 64, offset: 64)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !591, file: !253, line: 112, baseType: !488, size: 64, offset: 128)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "exceptions", scope: !591, file: !253, line: 115, baseType: !484, size: 64, offset: 192)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "relinquish", scope: !591, file: !253, line: 118, baseType: !445, size: 32, offset: 256)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !591, file: !253, line: 121, baseType: !602, size: 64, offset: 320)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64)
!603 = !DIDerivedType(tag: DW_TAG_typedef, name: "SemaphoreInfo", file: !604, line: 26, baseType: !605)
!604 = !DIFile(filename: "./magick/semaphore.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!605 = !DICompositeType(tag: DW_TAG_structure_type, name: "SemaphoreInfo", file: !604, line: 25, flags: DIFlagFwdDecl)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !591, file: !253, line: 124, baseType: !440, size: 64, offset: 384)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !431, file: !73, line: 288, baseType: !445, size: 32, offset: 103808)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !431, file: !73, line: 291, baseType: !609, size: 64, offset: 103872)
!609 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !493)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !431, file: !73, line: 294, baseType: !602, size: 64, offset: 103936)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "color_profile", scope: !431, file: !73, line: 297, baseType: !612, size: 256, offset: 104000)
!612 = !DIDerivedType(tag: DW_TAG_typedef, name: "ProfileInfo", file: !89, line: 40, baseType: !613)
!613 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ProfileInfo", file: !89, line: 27, size: 256, elements: !614)
!614 = !{!615, !616, !617, !620}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !613, file: !89, line: 30, baseType: !488, size: 64)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !613, file: !89, line: 33, baseType: !440, size: 64, offset: 64)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !613, file: !89, line: 36, baseType: !618, size: 64, offset: 128)
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !619, size: 64)
!619 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !613, file: !89, line: 39, baseType: !440, size: 64, offset: 192)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "iptc_profile", scope: !431, file: !73, line: 298, baseType: !612, size: 256, offset: 104256)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profile", scope: !431, file: !73, line: 299, baseType: !623, size: 64, offset: 104512)
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profiles", scope: !431, file: !73, line: 302, baseType: !440, size: 64, offset: 104576)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !431, file: !73, line: 305, baseType: !440, size: 64, offset: 104640)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !431, file: !73, line: 308, baseType: !526, size: 64, offset: 104704)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !431, file: !73, line: 309, baseType: !526, size: 64, offset: 104768)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !431, file: !73, line: 310, baseType: !526, size: 64, offset: 104832)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "interpolate", scope: !431, file: !73, line: 313, baseType: !630, size: 32, offset: 104896)
!630 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterpolatePixelMethod", file: !326, line: 47, baseType: !325)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "black_point_compensation", scope: !431, file: !73, line: 316, baseType: !445, size: 32, offset: 104928)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_color", scope: !431, file: !73, line: 319, baseType: !453, size: 64, offset: 104960)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !431, file: !73, line: 322, baseType: !526, size: 64, offset: 105024)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "tile_offset", scope: !431, file: !73, line: 325, baseType: !501, size: 256, offset: 105088)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !431, file: !73, line: 328, baseType: !484, size: 64, offset: 105344)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "artifacts", scope: !431, file: !73, line: 329, baseType: !484, size: 64, offset: 105408)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !431, file: !73, line: 332, baseType: !638, size: 32, offset: 105472)
!638 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageType", file: !73, line: 61, baseType: !342)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !431, file: !73, line: 335, baseType: !445, size: 32, offset: 105504)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !431, file: !73, line: 338, baseType: !568, size: 64, offset: 105536)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "ping", scope: !431, file: !73, line: 341, baseType: !445, size: 32, offset: 105600)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !431, file: !73, line: 344, baseType: !440, size: 64, offset: 105664)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !431, file: !73, line: 347, baseType: !644, size: 64, offset: 105728)
!644 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !645, line: 7, baseType: !646)
!645 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "")
!646 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !496, line: 160, baseType: !497)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "intensity", scope: !431, file: !73, line: 350, baseType: !648, size: 32, offset: 105792)
!648 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelIntensityMethod", file: !326, line: 79, baseType: !356)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !431, file: !73, line: 353, baseType: !440, size: 64, offset: 105856)
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64)
!652 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !430)
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64)
!654 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !453)
!655 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickRealType", file: !4, line: 78, baseType: !656)
!656 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64)
!658 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !659)
!659 = !DIDerivedType(tag: DW_TAG_typedef, name: "IndexPacket", file: !326, line: 129, baseType: !457)
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 64)
!661 = !{i32 7, !"Dwarf Version", i32 4}
!662 = !{i32 2, !"Debug Info Version", i32 3}
!663 = !{i32 1, !"wchar_size", i32 4}
!664 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!665 = distinct !DISubprogram(name: "CoalesceImages", scope: !1, file: !1, line: 231, type: !666, scopeLine: 232, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !669)
!666 = !DISubroutineType(types: !667)
!667 = !{!429, !651, !668}
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 64)
!669 = !{}
!670 = !DILocalVariable(name: "image", arg: 1, scope: !665, file: !1, line: 231, type: !651)
!671 = !DILocation(line: 231, column: 49, scope: !665)
!672 = !DILocalVariable(name: "exception", arg: 2, scope: !665, file: !1, line: 231, type: !668)
!673 = !DILocation(line: 231, column: 70, scope: !665)
!674 = !DILocalVariable(name: "coalesce_image", scope: !665, file: !1, line: 234, type: !429)
!675 = !DILocation(line: 234, column: 6, scope: !665)
!676 = !DILocalVariable(name: "dispose_image", scope: !665, file: !1, line: 235, type: !429)
!677 = !DILocation(line: 235, column: 6, scope: !665)
!678 = !DILocalVariable(name: "previous", scope: !665, file: !1, line: 236, type: !429)
!679 = !DILocation(line: 236, column: 6, scope: !665)
!680 = !DILocalVariable(name: "next", scope: !665, file: !1, line: 239, type: !429)
!681 = !DILocation(line: 239, column: 6, scope: !665)
!682 = !DILocalVariable(name: "bounds", scope: !665, file: !1, line: 242, type: !501)
!683 = !DILocation(line: 242, column: 5, scope: !665)
!684 = !DILocation(line: 249, column: 7, scope: !685)
!685 = distinct !DILexicalBlock(scope: !665, file: !1, line: 249, column: 7)
!686 = !DILocation(line: 249, column: 14, scope: !685)
!687 = !DILocation(line: 249, column: 20, scope: !685)
!688 = !DILocation(line: 249, column: 7, scope: !665)
!689 = !DILocation(line: 250, column: 61, scope: !685)
!690 = !DILocation(line: 250, column: 68, scope: !685)
!691 = !DILocation(line: 250, column: 12, scope: !685)
!692 = !DILocation(line: 250, column: 5, scope: !685)
!693 = !DILocation(line: 255, column: 28, scope: !665)
!694 = !DILocation(line: 255, column: 8, scope: !665)
!695 = !DILocation(line: 255, column: 7, scope: !665)
!696 = !DILocation(line: 256, column: 10, scope: !665)
!697 = !DILocation(line: 256, column: 16, scope: !665)
!698 = !DILocation(line: 257, column: 14, scope: !699)
!699 = distinct !DILexicalBlock(scope: !665, file: !1, line: 257, column: 7)
!700 = !DILocation(line: 257, column: 20, scope: !699)
!701 = !DILocation(line: 257, column: 7, scope: !665)
!702 = !DILocation(line: 259, column: 20, scope: !703)
!703 = distinct !DILexicalBlock(scope: !699, file: !1, line: 258, column: 5)
!704 = !DILocation(line: 259, column: 26, scope: !703)
!705 = !DILocation(line: 259, column: 14, scope: !703)
!706 = !DILocation(line: 259, column: 19, scope: !703)
!707 = !DILocation(line: 260, column: 18, scope: !708)
!708 = distinct !DILexicalBlock(scope: !703, file: !1, line: 260, column: 11)
!709 = !DILocation(line: 260, column: 20, scope: !708)
!710 = !DILocation(line: 260, column: 11, scope: !703)
!711 = !DILocation(line: 261, column: 30, scope: !708)
!712 = !DILocation(line: 261, column: 16, scope: !708)
!713 = !DILocation(line: 261, column: 21, scope: !708)
!714 = !DILocation(line: 261, column: 9, scope: !708)
!715 = !DILocation(line: 262, column: 5, scope: !703)
!716 = !DILocation(line: 263, column: 14, scope: !717)
!717 = distinct !DILexicalBlock(scope: !665, file: !1, line: 263, column: 7)
!718 = !DILocation(line: 263, column: 21, scope: !717)
!719 = !DILocation(line: 263, column: 7, scope: !665)
!720 = !DILocation(line: 265, column: 21, scope: !721)
!721 = distinct !DILexicalBlock(scope: !717, file: !1, line: 264, column: 5)
!722 = !DILocation(line: 265, column: 27, scope: !721)
!723 = !DILocation(line: 265, column: 14, scope: !721)
!724 = !DILocation(line: 265, column: 20, scope: !721)
!725 = !DILocation(line: 266, column: 18, scope: !726)
!726 = distinct !DILexicalBlock(scope: !721, file: !1, line: 266, column: 11)
!727 = !DILocation(line: 266, column: 20, scope: !726)
!728 = !DILocation(line: 266, column: 11, scope: !721)
!729 = !DILocation(line: 267, column: 31, scope: !726)
!730 = !DILocation(line: 267, column: 16, scope: !726)
!731 = !DILocation(line: 267, column: 22, scope: !726)
!732 = !DILocation(line: 267, column: 9, scope: !726)
!733 = !DILocation(line: 268, column: 5, scope: !721)
!734 = !DILocation(line: 269, column: 10, scope: !665)
!735 = !DILocation(line: 269, column: 11, scope: !665)
!736 = !DILocation(line: 270, column: 10, scope: !665)
!737 = !DILocation(line: 270, column: 11, scope: !665)
!738 = !DILocation(line: 271, column: 29, scope: !665)
!739 = !DILocation(line: 271, column: 41, scope: !665)
!740 = !DILocation(line: 271, column: 54, scope: !665)
!741 = !DILocation(line: 272, column: 5, scope: !665)
!742 = !DILocation(line: 271, column: 18, scope: !665)
!743 = !DILocation(line: 271, column: 17, scope: !665)
!744 = !DILocation(line: 273, column: 7, scope: !745)
!745 = distinct !DILexicalBlock(scope: !665, file: !1, line: 273, column: 7)
!746 = !DILocation(line: 273, column: 22, scope: !745)
!747 = !DILocation(line: 273, column: 7, scope: !665)
!748 = !DILocation(line: 274, column: 5, scope: !745)
!749 = !DILocation(line: 275, column: 34, scope: !665)
!750 = !DILocation(line: 275, column: 10, scope: !665)
!751 = !DILocation(line: 276, column: 25, scope: !665)
!752 = !DILocation(line: 276, column: 31, scope: !665)
!753 = !DILocation(line: 276, column: 3, scope: !665)
!754 = !DILocation(line: 276, column: 19, scope: !665)
!755 = !DILocation(line: 276, column: 24, scope: !665)
!756 = !DILocation(line: 277, column: 3, scope: !665)
!757 = !DILocation(line: 277, column: 19, scope: !665)
!758 = !DILocation(line: 277, column: 24, scope: !665)
!759 = !DILocation(line: 278, column: 3, scope: !665)
!760 = !DILocation(line: 278, column: 19, scope: !665)
!761 = !DILocation(line: 278, column: 26, scope: !665)
!762 = !DILocation(line: 282, column: 28, scope: !665)
!763 = !DILocation(line: 282, column: 58, scope: !665)
!764 = !DILocation(line: 282, column: 17, scope: !665)
!765 = !DILocation(line: 282, column: 16, scope: !665)
!766 = !DILocation(line: 283, column: 25, scope: !665)
!767 = !DILocation(line: 283, column: 56, scope: !665)
!768 = !DILocation(line: 283, column: 61, scope: !665)
!769 = !DILocation(line: 283, column: 67, scope: !665)
!770 = !DILocation(line: 283, column: 72, scope: !665)
!771 = !DILocation(line: 284, column: 5, scope: !665)
!772 = !DILocation(line: 284, column: 11, scope: !665)
!773 = !DILocation(line: 284, column: 16, scope: !665)
!774 = !DILocation(line: 283, column: 10, scope: !665)
!775 = !DILocation(line: 285, column: 27, scope: !665)
!776 = !DILocation(line: 285, column: 8, scope: !665)
!777 = !DILocation(line: 285, column: 7, scope: !665)
!778 = !DILocation(line: 286, column: 3, scope: !665)
!779 = !DILocation(line: 286, column: 11, scope: !780)
!780 = distinct !DILexicalBlock(scope: !781, file: !1, line: 286, column: 3)
!781 = distinct !DILexicalBlock(scope: !665, file: !1, line: 286, column: 3)
!782 = !DILocation(line: 286, column: 16, scope: !780)
!783 = !DILocation(line: 286, column: 3, scope: !781)
!784 = !DILocation(line: 291, column: 37, scope: !785)
!785 = distinct !DILexicalBlock(scope: !780, file: !1, line: 287, column: 3)
!786 = !DILocation(line: 291, column: 14, scope: !785)
!787 = !DILocation(line: 291, column: 13, scope: !785)
!788 = !DILocation(line: 292, column: 12, scope: !785)
!789 = !DILocation(line: 292, column: 22, scope: !785)
!790 = !DILocation(line: 293, column: 18, scope: !785)
!791 = !DILocation(line: 293, column: 28, scope: !785)
!792 = !DILocation(line: 293, column: 12, scope: !785)
!793 = !DILocation(line: 293, column: 17, scope: !785)
!794 = !DILocation(line: 294, column: 19, scope: !785)
!795 = !DILocation(line: 294, column: 29, scope: !785)
!796 = !DILocation(line: 294, column: 12, scope: !785)
!797 = !DILocation(line: 294, column: 18, scope: !785)
!798 = !DILocation(line: 295, column: 16, scope: !799)
!799 = distinct !DILexicalBlock(scope: !785, file: !1, line: 295, column: 9)
!800 = !DILocation(line: 295, column: 18, scope: !799)
!801 = !DILocation(line: 295, column: 9, scope: !785)
!802 = !DILocation(line: 297, column: 30, scope: !803)
!803 = distinct !DILexicalBlock(scope: !799, file: !1, line: 296, column: 7)
!804 = !DILocation(line: 297, column: 16, scope: !803)
!805 = !DILocation(line: 297, column: 21, scope: !803)
!806 = !DILocation(line: 298, column: 16, scope: !803)
!807 = !DILocation(line: 298, column: 17, scope: !803)
!808 = !DILocation(line: 299, column: 7, scope: !803)
!809 = !DILocation(line: 300, column: 27, scope: !810)
!810 = distinct !DILexicalBlock(scope: !785, file: !1, line: 300, column: 9)
!811 = !DILocation(line: 300, column: 36, scope: !810)
!812 = !DILocation(line: 300, column: 28, scope: !810)
!813 = !DILocation(line: 300, column: 55, scope: !810)
!814 = !DILocation(line: 300, column: 71, scope: !810)
!815 = !DILocation(line: 300, column: 43, scope: !810)
!816 = !DILocation(line: 300, column: 9, scope: !785)
!817 = !DILocation(line: 301, column: 20, scope: !810)
!818 = !DILocation(line: 301, column: 36, scope: !810)
!819 = !DILocation(line: 301, column: 51, scope: !810)
!820 = !DILocation(line: 301, column: 43, scope: !810)
!821 = !DILocation(line: 301, column: 14, scope: !810)
!822 = !DILocation(line: 301, column: 19, scope: !810)
!823 = !DILocation(line: 301, column: 7, scope: !810)
!824 = !DILocation(line: 302, column: 16, scope: !825)
!825 = distinct !DILexicalBlock(scope: !785, file: !1, line: 302, column: 9)
!826 = !DILocation(line: 302, column: 18, scope: !825)
!827 = !DILocation(line: 302, column: 9, scope: !785)
!828 = !DILocation(line: 304, column: 31, scope: !829)
!829 = distinct !DILexicalBlock(scope: !825, file: !1, line: 303, column: 7)
!830 = !DILocation(line: 304, column: 16, scope: !829)
!831 = !DILocation(line: 304, column: 22, scope: !829)
!832 = !DILocation(line: 305, column: 16, scope: !829)
!833 = !DILocation(line: 305, column: 17, scope: !829)
!834 = !DILocation(line: 306, column: 7, scope: !829)
!835 = !DILocation(line: 307, column: 27, scope: !836)
!836 = distinct !DILexicalBlock(scope: !785, file: !1, line: 307, column: 9)
!837 = !DILocation(line: 307, column: 36, scope: !836)
!838 = !DILocation(line: 307, column: 28, scope: !836)
!839 = !DILocation(line: 307, column: 56, scope: !836)
!840 = !DILocation(line: 307, column: 72, scope: !836)
!841 = !DILocation(line: 307, column: 44, scope: !836)
!842 = !DILocation(line: 307, column: 9, scope: !785)
!843 = !DILocation(line: 308, column: 21, scope: !836)
!844 = !DILocation(line: 308, column: 37, scope: !836)
!845 = !DILocation(line: 308, column: 49, scope: !836)
!846 = !DILocation(line: 308, column: 41, scope: !836)
!847 = !DILocation(line: 308, column: 14, scope: !836)
!848 = !DILocation(line: 308, column: 20, scope: !836)
!849 = !DILocation(line: 308, column: 7, scope: !836)
!850 = !DILocation(line: 312, column: 32, scope: !851)
!851 = distinct !DILexicalBlock(scope: !785, file: !1, line: 312, column: 9)
!852 = !DILocation(line: 312, column: 9, scope: !851)
!853 = !DILocation(line: 312, column: 39, scope: !851)
!854 = !DILocation(line: 312, column: 47, scope: !851)
!855 = !DILocation(line: 312, column: 9, scope: !785)
!856 = !DILocation(line: 314, column: 36, scope: !857)
!857 = distinct !DILexicalBlock(scope: !851, file: !1, line: 313, column: 7)
!858 = !DILocation(line: 314, column: 23, scope: !857)
!859 = !DILocation(line: 314, column: 22, scope: !857)
!860 = !DILocation(line: 315, column: 34, scope: !857)
!861 = !DILocation(line: 315, column: 64, scope: !857)
!862 = !DILocation(line: 315, column: 23, scope: !857)
!863 = !DILocation(line: 315, column: 22, scope: !857)
!864 = !DILocation(line: 316, column: 13, scope: !865)
!865 = distinct !DILexicalBlock(scope: !857, file: !1, line: 316, column: 13)
!866 = !DILocation(line: 316, column: 27, scope: !865)
!867 = !DILocation(line: 316, column: 13, scope: !857)
!868 = !DILocation(line: 318, column: 45, scope: !869)
!869 = distinct !DILexicalBlock(scope: !865, file: !1, line: 317, column: 11)
!870 = !DILocation(line: 318, column: 28, scope: !869)
!871 = !DILocation(line: 318, column: 27, scope: !869)
!872 = !DILocation(line: 319, column: 13, scope: !869)
!873 = !DILocation(line: 321, column: 7, scope: !857)
!874 = !DILocation(line: 325, column: 9, scope: !875)
!875 = distinct !DILexicalBlock(scope: !785, file: !1, line: 325, column: 9)
!876 = !DILocation(line: 325, column: 15, scope: !875)
!877 = !DILocation(line: 325, column: 25, scope: !875)
!878 = !DILocation(line: 325, column: 33, scope: !875)
!879 = !DILocation(line: 325, column: 9, scope: !785)
!880 = !DILocation(line: 326, column: 19, scope: !875)
!881 = !DILocation(line: 326, column: 7, scope: !875)
!882 = !DILocation(line: 330, column: 37, scope: !785)
!883 = !DILocation(line: 330, column: 66, scope: !785)
!884 = !DILocation(line: 330, column: 26, scope: !785)
!885 = !DILocation(line: 330, column: 5, scope: !785)
!886 = !DILocation(line: 330, column: 21, scope: !785)
!887 = !DILocation(line: 330, column: 25, scope: !785)
!888 = !DILocation(line: 331, column: 36, scope: !785)
!889 = !DILocation(line: 331, column: 5, scope: !785)
!890 = !DILocation(line: 331, column: 21, scope: !785)
!891 = !DILocation(line: 331, column: 27, scope: !785)
!892 = !DILocation(line: 331, column: 35, scope: !785)
!893 = !DILocation(line: 332, column: 14, scope: !785)
!894 = !DILocation(line: 332, column: 13, scope: !785)
!895 = !DILocation(line: 333, column: 39, scope: !785)
!896 = !DILocation(line: 333, column: 20, scope: !785)
!897 = !DILocation(line: 333, column: 19, scope: !785)
!898 = !DILocation(line: 334, column: 27, scope: !785)
!899 = !DILocation(line: 334, column: 42, scope: !785)
!900 = !DILocation(line: 334, column: 48, scope: !785)
!901 = !DILocation(line: 334, column: 54, scope: !785)
!902 = !DILocation(line: 335, column: 41, scope: !785)
!903 = !DILocation(line: 335, column: 46, scope: !785)
!904 = !DILocation(line: 335, column: 52, scope: !785)
!905 = !DILocation(line: 335, column: 57, scope: !785)
!906 = !DILocation(line: 335, column: 59, scope: !785)
!907 = !DILocation(line: 335, column: 65, scope: !785)
!908 = !DILocation(line: 335, column: 70, scope: !785)
!909 = !DILocation(line: 334, column: 12, scope: !785)
!910 = !DILocation(line: 336, column: 31, scope: !785)
!911 = !DILocation(line: 336, column: 46, scope: !785)
!912 = !DILocation(line: 336, column: 12, scope: !785)
!913 = !DILocation(line: 337, column: 33, scope: !785)
!914 = !DILocation(line: 337, column: 48, scope: !785)
!915 = !DILocation(line: 337, column: 12, scope: !785)
!916 = !DILocation(line: 338, column: 32, scope: !785)
!917 = !DILocation(line: 338, column: 47, scope: !785)
!918 = !DILocation(line: 338, column: 12, scope: !785)
!919 = !DILocation(line: 339, column: 5, scope: !785)
!920 = !DILocation(line: 339, column: 21, scope: !785)
!921 = !DILocation(line: 339, column: 26, scope: !785)
!922 = !DILocation(line: 339, column: 36, scope: !785)
!923 = !DILocation(line: 343, column: 25, scope: !924)
!924 = distinct !DILexicalBlock(scope: !785, file: !1, line: 343, column: 9)
!925 = !DILocation(line: 343, column: 34, scope: !924)
!926 = !DILocation(line: 343, column: 57, scope: !924)
!927 = !DILocation(line: 343, column: 9, scope: !924)
!928 = !DILocation(line: 343, column: 68, scope: !924)
!929 = !DILocation(line: 343, column: 9, scope: !785)
!930 = !DILocation(line: 344, column: 7, scope: !924)
!931 = !DILocation(line: 344, column: 23, scope: !924)
!932 = !DILocation(line: 344, column: 30, scope: !924)
!933 = !DILocation(line: 346, column: 7, scope: !924)
!934 = !DILocation(line: 346, column: 23, scope: !924)
!935 = !DILocation(line: 346, column: 30, scope: !924)
!936 = !DILocation(line: 347, column: 23, scope: !785)
!937 = !DILocation(line: 347, column: 39, scope: !785)
!938 = !DILocation(line: 347, column: 5, scope: !785)
!939 = !DILocation(line: 347, column: 15, scope: !785)
!940 = !DILocation(line: 347, column: 22, scope: !785)
!941 = !DILocation(line: 348, column: 3, scope: !785)
!942 = !DILocation(line: 286, column: 59, scope: !780)
!943 = !DILocation(line: 286, column: 40, scope: !780)
!944 = !DILocation(line: 286, column: 39, scope: !780)
!945 = !DILocation(line: 286, column: 3, scope: !780)
!946 = distinct !{!946, !783, !947}
!947 = !DILocation(line: 348, column: 3, scope: !781)
!948 = !DILocation(line: 349, column: 30, scope: !665)
!949 = !DILocation(line: 349, column: 17, scope: !665)
!950 = !DILocation(line: 349, column: 16, scope: !665)
!951 = !DILocation(line: 350, column: 30, scope: !665)
!952 = !DILocation(line: 350, column: 10, scope: !665)
!953 = !DILocation(line: 350, column: 3, scope: !665)
!954 = !DILocation(line: 351, column: 1, scope: !665)
!955 = distinct !DISubprogram(name: "ClearBounds", scope: !1, file: !1, line: 97, type: !956, scopeLine: 98, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !669)
!956 = !DISubroutineType(types: !957)
!957 = !{null, !429, !650}
!958 = !DILocalVariable(name: "image", arg: 1, scope: !955, file: !1, line: 97, type: !429)
!959 = !DILocation(line: 97, column: 32, scope: !955)
!960 = !DILocalVariable(name: "bounds", arg: 2, scope: !955, file: !1, line: 97, type: !650)
!961 = !DILocation(line: 97, column: 53, scope: !955)
!962 = !DILocalVariable(name: "exception", scope: !955, file: !1, line: 100, type: !668)
!963 = !DILocation(line: 100, column: 6, scope: !955)
!964 = !DILocalVariable(name: "y", scope: !955, file: !1, line: 103, type: !493)
!965 = !DILocation(line: 103, column: 5, scope: !955)
!966 = !DILocation(line: 105, column: 7, scope: !967)
!967 = distinct !DILexicalBlock(scope: !955, file: !1, line: 105, column: 7)
!968 = !DILocation(line: 105, column: 15, scope: !967)
!969 = !DILocation(line: 105, column: 17, scope: !967)
!970 = !DILocation(line: 105, column: 7, scope: !955)
!971 = !DILocation(line: 106, column: 5, scope: !967)
!972 = !DILocation(line: 107, column: 7, scope: !973)
!973 = distinct !DILexicalBlock(scope: !955, file: !1, line: 107, column: 7)
!974 = !DILocation(line: 107, column: 14, scope: !973)
!975 = !DILocation(line: 107, column: 20, scope: !973)
!976 = !DILocation(line: 107, column: 7, scope: !955)
!977 = !DILocation(line: 108, column: 33, scope: !973)
!978 = !DILocation(line: 108, column: 12, scope: !973)
!979 = !DILocation(line: 108, column: 5, scope: !973)
!980 = !DILocation(line: 109, column: 15, scope: !955)
!981 = !DILocation(line: 109, column: 22, scope: !955)
!982 = !DILocation(line: 109, column: 12, scope: !955)
!983 = !DILocation(line: 110, column: 9, scope: !984)
!984 = distinct !DILexicalBlock(scope: !955, file: !1, line: 110, column: 3)
!985 = !DILocation(line: 110, column: 8, scope: !984)
!986 = !DILocation(line: 110, column: 13, scope: !987)
!987 = distinct !DILexicalBlock(scope: !984, file: !1, line: 110, column: 3)
!988 = !DILocation(line: 110, column: 27, scope: !987)
!989 = !DILocation(line: 110, column: 35, scope: !987)
!990 = !DILocation(line: 110, column: 15, scope: !987)
!991 = !DILocation(line: 110, column: 3, scope: !984)
!992 = !DILocalVariable(name: "x", scope: !993, file: !1, line: 113, type: !493)
!993 = distinct !DILexicalBlock(scope: !987, file: !1, line: 111, column: 3)
!994 = !DILocation(line: 113, column: 7, scope: !993)
!995 = !DILocalVariable(name: "q", scope: !993, file: !1, line: 116, type: !996)
!996 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !452)
!997 = !DILocation(line: 116, column: 17, scope: !993)
!998 = !DILocation(line: 118, column: 26, scope: !993)
!999 = !DILocation(line: 118, column: 32, scope: !993)
!1000 = !DILocation(line: 118, column: 40, scope: !993)
!1001 = !DILocation(line: 118, column: 42, scope: !993)
!1002 = !DILocation(line: 118, column: 50, scope: !993)
!1003 = !DILocation(line: 118, column: 52, scope: !993)
!1004 = !DILocation(line: 118, column: 51, scope: !993)
!1005 = !DILocation(line: 118, column: 54, scope: !993)
!1006 = !DILocation(line: 118, column: 62, scope: !993)
!1007 = !DILocation(line: 118, column: 70, scope: !993)
!1008 = !DILocation(line: 118, column: 7, scope: !993)
!1009 = !DILocation(line: 118, column: 6, scope: !993)
!1010 = !DILocation(line: 119, column: 9, scope: !1011)
!1011 = distinct !DILexicalBlock(scope: !993, file: !1, line: 119, column: 9)
!1012 = !DILocation(line: 119, column: 11, scope: !1011)
!1013 = !DILocation(line: 119, column: 9, scope: !993)
!1014 = !DILocation(line: 120, column: 7, scope: !1011)
!1015 = !DILocation(line: 121, column: 11, scope: !1016)
!1016 = distinct !DILexicalBlock(scope: !993, file: !1, line: 121, column: 5)
!1017 = !DILocation(line: 121, column: 10, scope: !1016)
!1018 = !DILocation(line: 121, column: 15, scope: !1019)
!1019 = distinct !DILexicalBlock(scope: !1016, file: !1, line: 121, column: 5)
!1020 = !DILocation(line: 121, column: 29, scope: !1019)
!1021 = !DILocation(line: 121, column: 37, scope: !1019)
!1022 = !DILocation(line: 121, column: 17, scope: !1019)
!1023 = !DILocation(line: 121, column: 5, scope: !1016)
!1024 = !DILocation(line: 123, column: 7, scope: !1025)
!1025 = distinct !DILexicalBlock(scope: !1019, file: !1, line: 122, column: 5)
!1026 = !DILocation(line: 123, column: 10, scope: !1025)
!1027 = !DILocation(line: 123, column: 17, scope: !1025)
!1028 = !DILocation(line: 124, column: 8, scope: !1025)
!1029 = !DILocation(line: 125, column: 5, scope: !1025)
!1030 = !DILocation(line: 121, column: 45, scope: !1019)
!1031 = !DILocation(line: 121, column: 5, scope: !1019)
!1032 = distinct !{!1032, !1023, !1033}
!1033 = !DILocation(line: 125, column: 5, scope: !1016)
!1034 = !DILocation(line: 126, column: 29, scope: !1035)
!1035 = distinct !DILexicalBlock(scope: !993, file: !1, line: 126, column: 9)
!1036 = !DILocation(line: 126, column: 35, scope: !1035)
!1037 = !DILocation(line: 126, column: 9, scope: !1035)
!1038 = !DILocation(line: 126, column: 46, scope: !1035)
!1039 = !DILocation(line: 126, column: 9, scope: !993)
!1040 = !DILocation(line: 127, column: 7, scope: !1035)
!1041 = !DILocation(line: 128, column: 3, scope: !993)
!1042 = !DILocation(line: 110, column: 44, scope: !987)
!1043 = !DILocation(line: 110, column: 3, scope: !987)
!1044 = distinct !{!1044, !991, !1045}
!1045 = !DILocation(line: 128, column: 3, scope: !984)
!1046 = !DILocation(line: 129, column: 1, scope: !955)
!1047 = distinct !DISubprogram(name: "IsBoundsCleared", scope: !1, file: !1, line: 165, type: !1048, scopeLine: 167, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !669)
!1048 = !DISubroutineType(types: !1049)
!1049 = !{!445, !651, !651, !650, !668}
!1050 = !DILocalVariable(name: "image1", arg: 1, scope: !1047, file: !1, line: 165, type: !651)
!1051 = !DILocation(line: 165, column: 55, scope: !1047)
!1052 = !DILocalVariable(name: "image2", arg: 2, scope: !1047, file: !1, line: 166, type: !651)
!1053 = !DILocation(line: 166, column: 16, scope: !1047)
!1054 = !DILocalVariable(name: "bounds", arg: 3, scope: !1047, file: !1, line: 166, type: !650)
!1055 = !DILocation(line: 166, column: 38, scope: !1047)
!1056 = !DILocalVariable(name: "exception", arg: 4, scope: !1047, file: !1, line: 166, type: !668)
!1057 = !DILocation(line: 166, column: 60, scope: !1047)
!1058 = !DILocalVariable(name: "p", scope: !1047, file: !1, line: 169, type: !653)
!1059 = !DILocation(line: 169, column: 6, scope: !1047)
!1060 = !DILocalVariable(name: "q", scope: !1047, file: !1, line: 170, type: !653)
!1061 = !DILocation(line: 170, column: 6, scope: !1047)
!1062 = !DILocalVariable(name: "x", scope: !1047, file: !1, line: 173, type: !493)
!1063 = !DILocation(line: 173, column: 5, scope: !1047)
!1064 = !DILocalVariable(name: "y", scope: !1047, file: !1, line: 176, type: !493)
!1065 = !DILocation(line: 176, column: 5, scope: !1047)
!1066 = !DILocation(line: 178, column: 7, scope: !1067)
!1067 = distinct !DILexicalBlock(scope: !1047, file: !1, line: 178, column: 7)
!1068 = !DILocation(line: 178, column: 15, scope: !1067)
!1069 = !DILocation(line: 178, column: 17, scope: !1067)
!1070 = !DILocation(line: 178, column: 7, scope: !1047)
!1071 = !DILocation(line: 179, column: 5, scope: !1067)
!1072 = !DILocation(line: 180, column: 9, scope: !1073)
!1073 = distinct !DILexicalBlock(scope: !1047, file: !1, line: 180, column: 3)
!1074 = !DILocation(line: 180, column: 8, scope: !1073)
!1075 = !DILocation(line: 180, column: 13, scope: !1076)
!1076 = distinct !DILexicalBlock(scope: !1073, file: !1, line: 180, column: 3)
!1077 = !DILocation(line: 180, column: 27, scope: !1076)
!1078 = !DILocation(line: 180, column: 35, scope: !1076)
!1079 = !DILocation(line: 180, column: 15, scope: !1076)
!1080 = !DILocation(line: 180, column: 3, scope: !1073)
!1081 = !DILocation(line: 182, column: 24, scope: !1082)
!1082 = distinct !DILexicalBlock(scope: !1076, file: !1, line: 181, column: 3)
!1083 = !DILocation(line: 182, column: 31, scope: !1082)
!1084 = !DILocation(line: 182, column: 39, scope: !1082)
!1085 = !DILocation(line: 182, column: 41, scope: !1082)
!1086 = !DILocation(line: 182, column: 49, scope: !1082)
!1087 = !DILocation(line: 182, column: 51, scope: !1082)
!1088 = !DILocation(line: 182, column: 50, scope: !1082)
!1089 = !DILocation(line: 182, column: 53, scope: !1082)
!1090 = !DILocation(line: 182, column: 61, scope: !1082)
!1091 = !DILocation(line: 183, column: 7, scope: !1082)
!1092 = !DILocation(line: 182, column: 7, scope: !1082)
!1093 = !DILocation(line: 182, column: 6, scope: !1082)
!1094 = !DILocation(line: 184, column: 24, scope: !1082)
!1095 = !DILocation(line: 184, column: 31, scope: !1082)
!1096 = !DILocation(line: 184, column: 39, scope: !1082)
!1097 = !DILocation(line: 184, column: 41, scope: !1082)
!1098 = !DILocation(line: 184, column: 49, scope: !1082)
!1099 = !DILocation(line: 184, column: 51, scope: !1082)
!1100 = !DILocation(line: 184, column: 50, scope: !1082)
!1101 = !DILocation(line: 184, column: 53, scope: !1082)
!1102 = !DILocation(line: 184, column: 61, scope: !1082)
!1103 = !DILocation(line: 185, column: 7, scope: !1082)
!1104 = !DILocation(line: 184, column: 7, scope: !1082)
!1105 = !DILocation(line: 184, column: 6, scope: !1082)
!1106 = !DILocation(line: 186, column: 10, scope: !1107)
!1107 = distinct !DILexicalBlock(scope: !1082, file: !1, line: 186, column: 9)
!1108 = !DILocation(line: 186, column: 12, scope: !1107)
!1109 = !DILocation(line: 186, column: 43, scope: !1107)
!1110 = !DILocation(line: 186, column: 47, scope: !1107)
!1111 = !DILocation(line: 186, column: 49, scope: !1107)
!1112 = !DILocation(line: 186, column: 9, scope: !1082)
!1113 = !DILocation(line: 187, column: 7, scope: !1107)
!1114 = !DILocation(line: 188, column: 11, scope: !1115)
!1115 = distinct !DILexicalBlock(scope: !1082, file: !1, line: 188, column: 5)
!1116 = !DILocation(line: 188, column: 10, scope: !1115)
!1117 = !DILocation(line: 188, column: 15, scope: !1118)
!1118 = distinct !DILexicalBlock(scope: !1115, file: !1, line: 188, column: 5)
!1119 = !DILocation(line: 188, column: 29, scope: !1118)
!1120 = !DILocation(line: 188, column: 37, scope: !1118)
!1121 = !DILocation(line: 188, column: 17, scope: !1118)
!1122 = !DILocation(line: 188, column: 5, scope: !1115)
!1123 = !DILocation(line: 190, column: 12, scope: !1124)
!1124 = distinct !DILexicalBlock(scope: !1125, file: !1, line: 190, column: 11)
!1125 = distinct !DILexicalBlock(scope: !1118, file: !1, line: 189, column: 5)
!1126 = !DILocation(line: 190, column: 31, scope: !1124)
!1127 = !DILocation(line: 190, column: 62, scope: !1124)
!1128 = !DILocation(line: 191, column: 12, scope: !1124)
!1129 = !DILocation(line: 191, column: 15, scope: !1124)
!1130 = !DILocation(line: 191, column: 23, scope: !1124)
!1131 = !DILocation(line: 190, column: 11, scope: !1125)
!1132 = !DILocation(line: 192, column: 9, scope: !1124)
!1133 = !DILocation(line: 193, column: 8, scope: !1125)
!1134 = !DILocation(line: 194, column: 8, scope: !1125)
!1135 = !DILocation(line: 195, column: 5, scope: !1125)
!1136 = !DILocation(line: 188, column: 45, scope: !1118)
!1137 = !DILocation(line: 188, column: 5, scope: !1118)
!1138 = distinct !{!1138, !1122, !1139}
!1139 = !DILocation(line: 195, column: 5, scope: !1115)
!1140 = !DILocation(line: 196, column: 9, scope: !1141)
!1141 = distinct !DILexicalBlock(scope: !1082, file: !1, line: 196, column: 9)
!1142 = !DILocation(line: 196, column: 23, scope: !1141)
!1143 = !DILocation(line: 196, column: 31, scope: !1141)
!1144 = !DILocation(line: 196, column: 11, scope: !1141)
!1145 = !DILocation(line: 196, column: 9, scope: !1082)
!1146 = !DILocation(line: 197, column: 7, scope: !1141)
!1147 = !DILocation(line: 198, column: 3, scope: !1082)
!1148 = !DILocation(line: 180, column: 44, scope: !1076)
!1149 = !DILocation(line: 180, column: 3, scope: !1076)
!1150 = distinct !{!1150, !1080, !1151}
!1151 = !DILocation(line: 198, column: 3, scope: !1073)
!1152 = !DILocation(line: 199, column: 10, scope: !1047)
!1153 = !DILocation(line: 199, column: 24, scope: !1047)
!1154 = !DILocation(line: 199, column: 32, scope: !1047)
!1155 = !DILocation(line: 199, column: 12, scope: !1047)
!1156 = !DILocation(line: 199, column: 3, scope: !1047)
!1157 = !DILocation(line: 200, column: 1, scope: !1047)
!1158 = distinct !DISubprogram(name: "DisposeImages", scope: !1, file: !1, line: 379, type: !666, scopeLine: 380, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !669)
!1159 = !DILocalVariable(name: "images", arg: 1, scope: !1158, file: !1, line: 379, type: !651)
!1160 = !DILocation(line: 379, column: 48, scope: !1158)
!1161 = !DILocalVariable(name: "exception", arg: 2, scope: !1158, file: !1, line: 379, type: !668)
!1162 = !DILocation(line: 379, column: 70, scope: !1158)
!1163 = !DILocalVariable(name: "dispose_image", scope: !1158, file: !1, line: 382, type: !429)
!1164 = !DILocation(line: 382, column: 6, scope: !1158)
!1165 = !DILocalVariable(name: "dispose_images", scope: !1158, file: !1, line: 383, type: !429)
!1166 = !DILocation(line: 383, column: 6, scope: !1158)
!1167 = !DILocalVariable(name: "bounds", scope: !1158, file: !1, line: 386, type: !501)
!1168 = !DILocation(line: 386, column: 5, scope: !1158)
!1169 = !DILocalVariable(name: "image", scope: !1158, file: !1, line: 389, type: !429)
!1170 = !DILocation(line: 389, column: 6, scope: !1158)
!1171 = !DILocalVariable(name: "next", scope: !1158, file: !1, line: 390, type: !429)
!1172 = !DILocation(line: 390, column: 6, scope: !1158)
!1173 = !DILocation(line: 397, column: 7, scope: !1174)
!1174 = distinct !DILexicalBlock(scope: !1158, file: !1, line: 397, column: 7)
!1175 = !DILocation(line: 397, column: 15, scope: !1174)
!1176 = !DILocation(line: 397, column: 21, scope: !1174)
!1177 = !DILocation(line: 397, column: 7, scope: !1158)
!1178 = !DILocation(line: 398, column: 61, scope: !1174)
!1179 = !DILocation(line: 398, column: 69, scope: !1174)
!1180 = !DILocation(line: 398, column: 12, scope: !1174)
!1181 = !DILocation(line: 398, column: 5, scope: !1174)
!1182 = !DILocation(line: 401, column: 29, scope: !1158)
!1183 = !DILocation(line: 401, column: 9, scope: !1158)
!1184 = !DILocation(line: 401, column: 8, scope: !1158)
!1185 = !DILocation(line: 402, column: 28, scope: !1158)
!1186 = !DILocation(line: 402, column: 34, scope: !1158)
!1187 = !DILocation(line: 402, column: 41, scope: !1158)
!1188 = !DILocation(line: 402, column: 46, scope: !1158)
!1189 = !DILocation(line: 402, column: 52, scope: !1158)
!1190 = !DILocation(line: 402, column: 59, scope: !1158)
!1191 = !DILocation(line: 402, column: 64, scope: !1158)
!1192 = !DILocation(line: 403, column: 16, scope: !1158)
!1193 = !DILocation(line: 402, column: 17, scope: !1158)
!1194 = !DILocation(line: 402, column: 16, scope: !1158)
!1195 = !DILocation(line: 404, column: 7, scope: !1196)
!1196 = distinct !DILexicalBlock(scope: !1158, file: !1, line: 404, column: 7)
!1197 = !DILocation(line: 404, column: 21, scope: !1196)
!1198 = !DILocation(line: 404, column: 7, scope: !1158)
!1199 = !DILocation(line: 405, column: 5, scope: !1196)
!1200 = !DILocation(line: 406, column: 3, scope: !1158)
!1201 = !DILocation(line: 406, column: 18, scope: !1158)
!1202 = !DILocation(line: 406, column: 23, scope: !1158)
!1203 = !DILocation(line: 406, column: 30, scope: !1158)
!1204 = !DILocation(line: 407, column: 3, scope: !1158)
!1205 = !DILocation(line: 407, column: 18, scope: !1158)
!1206 = !DILocation(line: 407, column: 23, scope: !1158)
!1207 = !DILocation(line: 407, column: 24, scope: !1158)
!1208 = !DILocation(line: 408, column: 3, scope: !1158)
!1209 = !DILocation(line: 408, column: 18, scope: !1158)
!1210 = !DILocation(line: 408, column: 23, scope: !1158)
!1211 = !DILocation(line: 408, column: 24, scope: !1158)
!1212 = !DILocation(line: 409, column: 3, scope: !1158)
!1213 = !DILocation(line: 409, column: 18, scope: !1158)
!1214 = !DILocation(line: 409, column: 25, scope: !1158)
!1215 = !DILocation(line: 410, column: 3, scope: !1158)
!1216 = !DILocation(line: 410, column: 18, scope: !1158)
!1217 = !DILocation(line: 410, column: 35, scope: !1158)
!1218 = !DILocation(line: 410, column: 42, scope: !1158)
!1219 = !DILocation(line: 411, column: 34, scope: !1158)
!1220 = !DILocation(line: 411, column: 10, scope: !1158)
!1221 = !DILocation(line: 412, column: 18, scope: !1158)
!1222 = !DILocation(line: 412, column: 17, scope: !1158)
!1223 = !DILocation(line: 413, column: 13, scope: !1224)
!1224 = distinct !DILexicalBlock(scope: !1158, file: !1, line: 413, column: 3)
!1225 = !DILocation(line: 413, column: 12, scope: !1224)
!1226 = !DILocation(line: 413, column: 8, scope: !1224)
!1227 = !DILocation(line: 413, column: 20, scope: !1228)
!1228 = distinct !DILexicalBlock(scope: !1224, file: !1, line: 413, column: 3)
!1229 = !DILocation(line: 413, column: 25, scope: !1228)
!1230 = !DILocation(line: 413, column: 3, scope: !1224)
!1231 = !DILocalVariable(name: "current_image", scope: !1232, file: !1, line: 416, type: !429)
!1232 = distinct !DILexicalBlock(scope: !1228, file: !1, line: 414, column: 3)
!1233 = !DILocation(line: 416, column: 8, scope: !1232)
!1234 = !DILocation(line: 421, column: 30, scope: !1232)
!1235 = !DILocation(line: 421, column: 59, scope: !1232)
!1236 = !DILocation(line: 421, column: 19, scope: !1232)
!1237 = !DILocation(line: 421, column: 18, scope: !1232)
!1238 = !DILocation(line: 422, column: 9, scope: !1239)
!1239 = distinct !DILexicalBlock(scope: !1232, file: !1, line: 422, column: 9)
!1240 = !DILocation(line: 422, column: 23, scope: !1239)
!1241 = !DILocation(line: 422, column: 9, scope: !1232)
!1242 = !DILocation(line: 424, column: 41, scope: !1243)
!1243 = distinct !DILexicalBlock(scope: !1239, file: !1, line: 423, column: 7)
!1244 = !DILocation(line: 424, column: 24, scope: !1243)
!1245 = !DILocation(line: 424, column: 23, scope: !1243)
!1246 = !DILocation(line: 425, column: 36, scope: !1243)
!1247 = !DILocation(line: 425, column: 23, scope: !1243)
!1248 = !DILocation(line: 425, column: 22, scope: !1243)
!1249 = !DILocation(line: 426, column: 9, scope: !1243)
!1250 = !DILocation(line: 428, column: 27, scope: !1232)
!1251 = !DILocation(line: 428, column: 41, scope: !1232)
!1252 = !DILocation(line: 428, column: 47, scope: !1232)
!1253 = !DILocation(line: 428, column: 53, scope: !1232)
!1254 = !DILocation(line: 429, column: 41, scope: !1232)
!1255 = !DILocation(line: 429, column: 46, scope: !1232)
!1256 = !DILocation(line: 429, column: 52, scope: !1232)
!1257 = !DILocation(line: 429, column: 57, scope: !1232)
!1258 = !DILocation(line: 429, column: 59, scope: !1232)
!1259 = !DILocation(line: 429, column: 65, scope: !1232)
!1260 = !DILocation(line: 429, column: 70, scope: !1232)
!1261 = !DILocation(line: 428, column: 12, scope: !1232)
!1262 = !DILocation(line: 433, column: 9, scope: !1263)
!1263 = distinct !DILexicalBlock(scope: !1232, file: !1, line: 433, column: 9)
!1264 = !DILocation(line: 433, column: 15, scope: !1263)
!1265 = !DILocation(line: 433, column: 23, scope: !1263)
!1266 = !DILocation(line: 433, column: 9, scope: !1232)
!1267 = !DILocation(line: 435, column: 16, scope: !1268)
!1268 = distinct !DILexicalBlock(scope: !1263, file: !1, line: 434, column: 7)
!1269 = !DILocation(line: 435, column: 22, scope: !1268)
!1270 = !DILocation(line: 436, column: 22, scope: !1268)
!1271 = !DILocation(line: 436, column: 28, scope: !1268)
!1272 = !DILocation(line: 436, column: 16, scope: !1268)
!1273 = !DILocation(line: 436, column: 21, scope: !1268)
!1274 = !DILocation(line: 437, column: 23, scope: !1268)
!1275 = !DILocation(line: 437, column: 29, scope: !1268)
!1276 = !DILocation(line: 437, column: 16, scope: !1268)
!1277 = !DILocation(line: 437, column: 22, scope: !1268)
!1278 = !DILocation(line: 438, column: 20, scope: !1279)
!1279 = distinct !DILexicalBlock(scope: !1268, file: !1, line: 438, column: 13)
!1280 = !DILocation(line: 438, column: 22, scope: !1279)
!1281 = !DILocation(line: 438, column: 13, scope: !1268)
!1282 = !DILocation(line: 440, column: 34, scope: !1283)
!1283 = distinct !DILexicalBlock(scope: !1279, file: !1, line: 439, column: 11)
!1284 = !DILocation(line: 440, column: 20, scope: !1283)
!1285 = !DILocation(line: 440, column: 25, scope: !1283)
!1286 = !DILocation(line: 441, column: 20, scope: !1283)
!1287 = !DILocation(line: 441, column: 21, scope: !1283)
!1288 = !DILocation(line: 442, column: 11, scope: !1283)
!1289 = !DILocation(line: 443, column: 31, scope: !1290)
!1290 = distinct !DILexicalBlock(scope: !1268, file: !1, line: 443, column: 13)
!1291 = !DILocation(line: 443, column: 40, scope: !1290)
!1292 = !DILocation(line: 443, column: 32, scope: !1290)
!1293 = !DILocation(line: 443, column: 59, scope: !1290)
!1294 = !DILocation(line: 443, column: 74, scope: !1290)
!1295 = !DILocation(line: 443, column: 47, scope: !1290)
!1296 = !DILocation(line: 443, column: 13, scope: !1268)
!1297 = !DILocation(line: 444, column: 24, scope: !1290)
!1298 = !DILocation(line: 444, column: 39, scope: !1290)
!1299 = !DILocation(line: 444, column: 54, scope: !1290)
!1300 = !DILocation(line: 444, column: 46, scope: !1290)
!1301 = !DILocation(line: 444, column: 18, scope: !1290)
!1302 = !DILocation(line: 444, column: 23, scope: !1290)
!1303 = !DILocation(line: 444, column: 11, scope: !1290)
!1304 = !DILocation(line: 445, column: 20, scope: !1305)
!1305 = distinct !DILexicalBlock(scope: !1268, file: !1, line: 445, column: 13)
!1306 = !DILocation(line: 445, column: 22, scope: !1305)
!1307 = !DILocation(line: 445, column: 13, scope: !1268)
!1308 = !DILocation(line: 447, column: 35, scope: !1309)
!1309 = distinct !DILexicalBlock(scope: !1305, file: !1, line: 446, column: 11)
!1310 = !DILocation(line: 447, column: 20, scope: !1309)
!1311 = !DILocation(line: 447, column: 26, scope: !1309)
!1312 = !DILocation(line: 448, column: 20, scope: !1309)
!1313 = !DILocation(line: 448, column: 21, scope: !1309)
!1314 = !DILocation(line: 449, column: 11, scope: !1309)
!1315 = !DILocation(line: 450, column: 31, scope: !1316)
!1316 = distinct !DILexicalBlock(scope: !1268, file: !1, line: 450, column: 13)
!1317 = !DILocation(line: 450, column: 40, scope: !1316)
!1318 = !DILocation(line: 450, column: 32, scope: !1316)
!1319 = !DILocation(line: 450, column: 60, scope: !1316)
!1320 = !DILocation(line: 450, column: 75, scope: !1316)
!1321 = !DILocation(line: 450, column: 48, scope: !1316)
!1322 = !DILocation(line: 450, column: 13, scope: !1268)
!1323 = !DILocation(line: 451, column: 25, scope: !1316)
!1324 = !DILocation(line: 451, column: 40, scope: !1316)
!1325 = !DILocation(line: 451, column: 52, scope: !1316)
!1326 = !DILocation(line: 451, column: 44, scope: !1316)
!1327 = !DILocation(line: 451, column: 18, scope: !1316)
!1328 = !DILocation(line: 451, column: 24, scope: !1316)
!1329 = !DILocation(line: 451, column: 11, scope: !1316)
!1330 = !DILocation(line: 452, column: 21, scope: !1268)
!1331 = !DILocation(line: 452, column: 9, scope: !1268)
!1332 = !DILocation(line: 453, column: 7, scope: !1268)
!1333 = !DILocation(line: 457, column: 9, scope: !1334)
!1334 = distinct !DILexicalBlock(scope: !1232, file: !1, line: 457, column: 9)
!1335 = !DILocation(line: 457, column: 15, scope: !1334)
!1336 = !DILocation(line: 457, column: 23, scope: !1334)
!1337 = !DILocation(line: 457, column: 9, scope: !1232)
!1338 = !DILocation(line: 458, column: 34, scope: !1334)
!1339 = !DILocation(line: 458, column: 21, scope: !1334)
!1340 = !DILocation(line: 458, column: 20, scope: !1334)
!1341 = !DILocation(line: 458, column: 7, scope: !1334)
!1342 = !DILocation(line: 461, column: 36, scope: !1343)
!1343 = distinct !DILexicalBlock(scope: !1334, file: !1, line: 460, column: 7)
!1344 = !DILocation(line: 461, column: 23, scope: !1343)
!1345 = !DILocation(line: 461, column: 22, scope: !1343)
!1346 = !DILocation(line: 462, column: 23, scope: !1343)
!1347 = !DILocation(line: 462, column: 22, scope: !1343)
!1348 = !DILocation(line: 463, column: 22, scope: !1343)
!1349 = !DILocalVariable(name: "dispose", scope: !1350, file: !1, line: 470, type: !429)
!1350 = distinct !DILexicalBlock(scope: !1232, file: !1, line: 468, column: 5)
!1351 = !DILocation(line: 470, column: 10, scope: !1350)
!1352 = !DILocation(line: 472, column: 26, scope: !1350)
!1353 = !DILocation(line: 472, column: 55, scope: !1350)
!1354 = !DILocation(line: 472, column: 15, scope: !1350)
!1355 = !DILocation(line: 472, column: 14, scope: !1350)
!1356 = !DILocation(line: 473, column: 11, scope: !1357)
!1357 = distinct !DILexicalBlock(scope: !1350, file: !1, line: 473, column: 11)
!1358 = !DILocation(line: 473, column: 19, scope: !1357)
!1359 = !DILocation(line: 473, column: 11, scope: !1350)
!1360 = !DILocation(line: 475, column: 43, scope: !1361)
!1361 = distinct !DILexicalBlock(scope: !1357, file: !1, line: 474, column: 9)
!1362 = !DILocation(line: 475, column: 26, scope: !1361)
!1363 = !DILocation(line: 475, column: 25, scope: !1361)
!1364 = !DILocation(line: 476, column: 38, scope: !1361)
!1365 = !DILocation(line: 476, column: 25, scope: !1361)
!1366 = !DILocation(line: 476, column: 24, scope: !1361)
!1367 = !DILocation(line: 477, column: 11, scope: !1361)
!1368 = !DILocation(line: 479, column: 33, scope: !1350)
!1369 = !DILocation(line: 479, column: 41, scope: !1350)
!1370 = !DILocation(line: 479, column: 14, scope: !1350)
!1371 = !DILocation(line: 480, column: 35, scope: !1350)
!1372 = !DILocation(line: 480, column: 43, scope: !1350)
!1373 = !DILocation(line: 480, column: 14, scope: !1350)
!1374 = !DILocation(line: 481, column: 34, scope: !1350)
!1375 = !DILocation(line: 481, column: 42, scope: !1350)
!1376 = !DILocation(line: 481, column: 14, scope: !1350)
!1377 = !DILocation(line: 482, column: 7, scope: !1350)
!1378 = !DILocation(line: 482, column: 16, scope: !1350)
!1379 = !DILocation(line: 482, column: 21, scope: !1350)
!1380 = !DILocation(line: 482, column: 22, scope: !1350)
!1381 = !DILocation(line: 483, column: 7, scope: !1350)
!1382 = !DILocation(line: 483, column: 16, scope: !1350)
!1383 = !DILocation(line: 483, column: 21, scope: !1350)
!1384 = !DILocation(line: 483, column: 22, scope: !1350)
!1385 = !DILocation(line: 484, column: 24, scope: !1350)
!1386 = !DILocation(line: 484, column: 30, scope: !1350)
!1387 = !DILocation(line: 484, column: 7, scope: !1350)
!1388 = !DILocation(line: 484, column: 16, scope: !1350)
!1389 = !DILocation(line: 484, column: 23, scope: !1350)
!1390 = !DILocation(line: 485, column: 41, scope: !1350)
!1391 = !DILocation(line: 485, column: 7, scope: !1350)
!1392 = !DILocation(line: 487, column: 3, scope: !1232)
!1393 = !DILocation(line: 413, column: 68, scope: !1228)
!1394 = !DILocation(line: 413, column: 49, scope: !1228)
!1395 = !DILocation(line: 413, column: 48, scope: !1228)
!1396 = !DILocation(line: 413, column: 3, scope: !1228)
!1397 = distinct !{!1397, !1230, !1398}
!1398 = !DILocation(line: 487, column: 3, scope: !1224)
!1399 = !DILocation(line: 488, column: 30, scope: !1158)
!1400 = !DILocation(line: 488, column: 17, scope: !1158)
!1401 = !DILocation(line: 488, column: 16, scope: !1158)
!1402 = !DILocation(line: 489, column: 30, scope: !1158)
!1403 = !DILocation(line: 489, column: 10, scope: !1158)
!1404 = !DILocation(line: 489, column: 3, scope: !1158)
!1405 = !DILocation(line: 490, column: 1, scope: !1158)
!1406 = distinct !DISubprogram(name: "CompareImageLayers", scope: !1, file: !1, line: 768, type: !1407, scopeLine: 770, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !669)
!1407 = !DISubroutineType(types: !1408)
!1408 = !{!429, !651, !1409, !668}
!1409 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1410)
!1410 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageLayerMethod", file: !239, line: 53, baseType: !393)
!1411 = !DILocalVariable(name: "image", arg: 1, scope: !1406, file: !1, line: 768, type: !651)
!1412 = !DILocation(line: 768, column: 53, scope: !1406)
!1413 = !DILocalVariable(name: "method", arg: 2, scope: !1406, file: !1, line: 769, type: !1409)
!1414 = !DILocation(line: 769, column: 26, scope: !1406)
!1415 = !DILocalVariable(name: "exception", arg: 3, scope: !1406, file: !1, line: 769, type: !668)
!1416 = !DILocation(line: 769, column: 49, scope: !1406)
!1417 = !DILocalVariable(name: "image_a", scope: !1406, file: !1, line: 772, type: !429)
!1418 = !DILocation(line: 772, column: 6, scope: !1406)
!1419 = !DILocalVariable(name: "image_b", scope: !1406, file: !1, line: 773, type: !429)
!1420 = !DILocation(line: 773, column: 6, scope: !1406)
!1421 = !DILocalVariable(name: "layers", scope: !1406, file: !1, line: 774, type: !429)
!1422 = !DILocation(line: 774, column: 6, scope: !1406)
!1423 = !DILocalVariable(name: "bounds", scope: !1406, file: !1, line: 777, type: !650)
!1424 = !DILocation(line: 777, column: 6, scope: !1406)
!1425 = !DILocalVariable(name: "next", scope: !1406, file: !1, line: 780, type: !651)
!1426 = !DILocation(line: 780, column: 6, scope: !1406)
!1427 = !DILocalVariable(name: "i", scope: !1406, file: !1, line: 783, type: !493)
!1428 = !DILocation(line: 783, column: 5, scope: !1406)
!1429 = !DILocation(line: 787, column: 7, scope: !1430)
!1430 = distinct !DILexicalBlock(scope: !1406, file: !1, line: 787, column: 7)
!1431 = !DILocation(line: 787, column: 14, scope: !1430)
!1432 = !DILocation(line: 787, column: 20, scope: !1430)
!1433 = !DILocation(line: 787, column: 7, scope: !1406)
!1434 = !DILocation(line: 788, column: 61, scope: !1430)
!1435 = !DILocation(line: 788, column: 68, scope: !1430)
!1436 = !DILocation(line: 788, column: 12, scope: !1430)
!1437 = !DILocation(line: 788, column: 5, scope: !1430)
!1438 = !DILocation(line: 797, column: 28, scope: !1406)
!1439 = !DILocation(line: 797, column: 8, scope: !1406)
!1440 = !DILocation(line: 797, column: 7, scope: !1406)
!1441 = !DILocation(line: 799, column: 24, scope: !1406)
!1442 = !DILocation(line: 799, column: 5, scope: !1406)
!1443 = !DILocation(line: 798, column: 28, scope: !1406)
!1444 = !DILocation(line: 798, column: 10, scope: !1406)
!1445 = !DILocation(line: 798, column: 9, scope: !1406)
!1446 = !DILocation(line: 800, column: 7, scope: !1447)
!1447 = distinct !DILexicalBlock(scope: !1406, file: !1, line: 800, column: 7)
!1448 = !DILocation(line: 800, column: 14, scope: !1447)
!1449 = !DILocation(line: 800, column: 7, scope: !1406)
!1450 = !DILocation(line: 801, column: 5, scope: !1451)
!1451 = distinct !DILexicalBlock(scope: !1447, file: !1, line: 801, column: 5)
!1452 = !DILocation(line: 805, column: 22, scope: !1406)
!1453 = !DILocation(line: 805, column: 27, scope: !1406)
!1454 = !DILocation(line: 805, column: 33, scope: !1406)
!1455 = !DILocation(line: 805, column: 38, scope: !1406)
!1456 = !DILocation(line: 805, column: 44, scope: !1406)
!1457 = !DILocation(line: 805, column: 50, scope: !1406)
!1458 = !DILocation(line: 805, column: 55, scope: !1406)
!1459 = !DILocation(line: 806, column: 16, scope: !1406)
!1460 = !DILocation(line: 805, column: 11, scope: !1406)
!1461 = !DILocation(line: 805, column: 10, scope: !1406)
!1462 = !DILocation(line: 807, column: 7, scope: !1463)
!1463 = distinct !DILexicalBlock(scope: !1406, file: !1, line: 807, column: 7)
!1464 = !DILocation(line: 807, column: 15, scope: !1463)
!1465 = !DILocation(line: 807, column: 7, scope: !1406)
!1466 = !DILocation(line: 809, column: 55, scope: !1467)
!1467 = distinct !DILexicalBlock(scope: !1463, file: !1, line: 808, column: 5)
!1468 = !DILocation(line: 809, column: 32, scope: !1467)
!1469 = !DILocation(line: 809, column: 14, scope: !1467)
!1470 = !DILocation(line: 809, column: 13, scope: !1467)
!1471 = !DILocation(line: 810, column: 7, scope: !1467)
!1472 = !DILocation(line: 812, column: 3, scope: !1406)
!1473 = !DILocation(line: 812, column: 12, scope: !1406)
!1474 = !DILocation(line: 812, column: 29, scope: !1406)
!1475 = !DILocation(line: 812, column: 36, scope: !1406)
!1476 = !DILocation(line: 813, column: 34, scope: !1406)
!1477 = !DILocation(line: 813, column: 10, scope: !1406)
!1478 = !DILocation(line: 814, column: 3, scope: !1406)
!1479 = !DILocation(line: 814, column: 12, scope: !1406)
!1480 = !DILocation(line: 814, column: 17, scope: !1406)
!1481 = !DILocation(line: 814, column: 23, scope: !1406)
!1482 = !DILocation(line: 815, column: 3, scope: !1406)
!1483 = !DILocation(line: 815, column: 12, scope: !1406)
!1484 = !DILocation(line: 815, column: 17, scope: !1406)
!1485 = !DILocation(line: 815, column: 18, scope: !1406)
!1486 = !DILocation(line: 816, column: 3, scope: !1406)
!1487 = !DILocation(line: 816, column: 12, scope: !1406)
!1488 = !DILocation(line: 816, column: 17, scope: !1406)
!1489 = !DILocation(line: 816, column: 18, scope: !1406)
!1490 = !DILocation(line: 817, column: 25, scope: !1406)
!1491 = !DILocation(line: 817, column: 49, scope: !1406)
!1492 = !DILocation(line: 817, column: 54, scope: !1406)
!1493 = !DILocation(line: 817, column: 60, scope: !1406)
!1494 = !DILocation(line: 817, column: 65, scope: !1406)
!1495 = !DILocation(line: 817, column: 67, scope: !1406)
!1496 = !DILocation(line: 817, column: 73, scope: !1406)
!1497 = !DILocation(line: 817, column: 78, scope: !1406)
!1498 = !DILocation(line: 817, column: 10, scope: !1406)
!1499 = !DILocation(line: 821, column: 4, scope: !1406)
!1500 = !DILocation(line: 822, column: 27, scope: !1406)
!1501 = !DILocation(line: 822, column: 8, scope: !1406)
!1502 = !DILocation(line: 822, column: 7, scope: !1406)
!1503 = !DILocation(line: 823, column: 3, scope: !1406)
!1504 = !DILocation(line: 823, column: 11, scope: !1505)
!1505 = distinct !DILexicalBlock(scope: !1506, file: !1, line: 823, column: 3)
!1506 = distinct !DILexicalBlock(scope: !1406, file: !1, line: 823, column: 3)
!1507 = !DILocation(line: 823, column: 16, scope: !1505)
!1508 = !DILocation(line: 823, column: 3, scope: !1506)
!1509 = !DILocation(line: 825, column: 24, scope: !1510)
!1510 = distinct !DILexicalBlock(scope: !1505, file: !1, line: 824, column: 3)
!1511 = !DILocation(line: 825, column: 47, scope: !1510)
!1512 = !DILocation(line: 825, column: 13, scope: !1510)
!1513 = !DILocation(line: 825, column: 12, scope: !1510)
!1514 = !DILocation(line: 826, column: 9, scope: !1515)
!1515 = distinct !DILexicalBlock(scope: !1510, file: !1, line: 826, column: 9)
!1516 = !DILocation(line: 826, column: 17, scope: !1515)
!1517 = !DILocation(line: 826, column: 9, scope: !1510)
!1518 = !DILocation(line: 828, column: 30, scope: !1519)
!1519 = distinct !DILexicalBlock(scope: !1515, file: !1, line: 827, column: 7)
!1520 = !DILocation(line: 828, column: 17, scope: !1519)
!1521 = !DILocation(line: 828, column: 16, scope: !1519)
!1522 = !DILocation(line: 829, column: 57, scope: !1519)
!1523 = !DILocation(line: 829, column: 34, scope: !1519)
!1524 = !DILocation(line: 829, column: 16, scope: !1519)
!1525 = !DILocation(line: 829, column: 15, scope: !1519)
!1526 = !DILocation(line: 830, column: 9, scope: !1519)
!1527 = !DILocation(line: 832, column: 27, scope: !1510)
!1528 = !DILocation(line: 832, column: 51, scope: !1510)
!1529 = !DILocation(line: 832, column: 56, scope: !1510)
!1530 = !DILocation(line: 832, column: 62, scope: !1510)
!1531 = !DILocation(line: 832, column: 67, scope: !1510)
!1532 = !DILocation(line: 833, column: 28, scope: !1510)
!1533 = !DILocation(line: 833, column: 34, scope: !1510)
!1534 = !DILocation(line: 833, column: 39, scope: !1510)
!1535 = !DILocation(line: 832, column: 12, scope: !1510)
!1536 = !DILocation(line: 834, column: 5, scope: !1510)
!1537 = !DILocation(line: 834, column: 12, scope: !1510)
!1538 = !DILocation(line: 834, column: 34, scope: !1510)
!1539 = !DILocation(line: 834, column: 42, scope: !1510)
!1540 = !DILocation(line: 834, column: 50, scope: !1510)
!1541 = !DILocation(line: 834, column: 57, scope: !1510)
!1542 = !DILocation(line: 834, column: 15, scope: !1510)
!1543 = !DILocation(line: 836, column: 26, scope: !1510)
!1544 = !DILocation(line: 836, column: 13, scope: !1510)
!1545 = !DILocation(line: 836, column: 12, scope: !1510)
!1546 = !DILocation(line: 837, column: 6, scope: !1510)
!1547 = !DILocation(line: 838, column: 3, scope: !1510)
!1548 = !DILocation(line: 823, column: 65, scope: !1505)
!1549 = !DILocation(line: 823, column: 46, scope: !1505)
!1550 = !DILocation(line: 823, column: 45, scope: !1505)
!1551 = !DILocation(line: 823, column: 3, scope: !1505)
!1552 = distinct !{!1552, !1508, !1553}
!1553 = !DILocation(line: 838, column: 3, scope: !1506)
!1554 = !DILocation(line: 839, column: 24, scope: !1406)
!1555 = !DILocation(line: 839, column: 11, scope: !1406)
!1556 = !DILocation(line: 839, column: 10, scope: !1406)
!1557 = !DILocation(line: 843, column: 28, scope: !1406)
!1558 = !DILocation(line: 843, column: 8, scope: !1406)
!1559 = !DILocation(line: 843, column: 7, scope: !1406)
!1560 = !DILocation(line: 844, column: 21, scope: !1406)
!1561 = !DILocation(line: 844, column: 41, scope: !1406)
!1562 = !DILocation(line: 844, column: 10, scope: !1406)
!1563 = !DILocation(line: 844, column: 9, scope: !1406)
!1564 = !DILocation(line: 845, column: 7, scope: !1565)
!1565 = distinct !DILexicalBlock(scope: !1406, file: !1, line: 845, column: 7)
!1566 = !DILocation(line: 845, column: 14, scope: !1565)
!1567 = !DILocation(line: 845, column: 7, scope: !1406)
!1568 = !DILocation(line: 847, column: 55, scope: !1569)
!1569 = distinct !DILexicalBlock(scope: !1565, file: !1, line: 846, column: 5)
!1570 = !DILocation(line: 847, column: 32, scope: !1569)
!1571 = !DILocation(line: 847, column: 14, scope: !1569)
!1572 = !DILocation(line: 847, column: 13, scope: !1569)
!1573 = !DILocation(line: 848, column: 7, scope: !1569)
!1574 = !DILocation(line: 853, column: 4, scope: !1406)
!1575 = !DILocation(line: 854, column: 27, scope: !1406)
!1576 = !DILocation(line: 854, column: 8, scope: !1406)
!1577 = !DILocation(line: 854, column: 7, scope: !1406)
!1578 = !DILocation(line: 855, column: 3, scope: !1406)
!1579 = !DILocation(line: 855, column: 11, scope: !1580)
!1580 = distinct !DILexicalBlock(scope: !1581, file: !1, line: 855, column: 3)
!1581 = distinct !DILexicalBlock(scope: !1406, file: !1, line: 855, column: 3)
!1582 = !DILocation(line: 855, column: 16, scope: !1580)
!1583 = !DILocation(line: 855, column: 3, scope: !1581)
!1584 = !DILocation(line: 857, column: 24, scope: !1585)
!1585 = distinct !DILexicalBlock(scope: !1580, file: !1, line: 856, column: 3)
!1586 = !DILocation(line: 857, column: 44, scope: !1585)
!1587 = !DILocation(line: 857, column: 13, scope: !1585)
!1588 = !DILocation(line: 857, column: 12, scope: !1585)
!1589 = !DILocation(line: 858, column: 9, scope: !1590)
!1590 = distinct !DILexicalBlock(scope: !1585, file: !1, line: 858, column: 9)
!1591 = !DILocation(line: 858, column: 17, scope: !1590)
!1592 = !DILocation(line: 858, column: 9, scope: !1585)
!1593 = !DILocation(line: 859, column: 7, scope: !1590)
!1594 = !DILocation(line: 860, column: 23, scope: !1585)
!1595 = !DILocation(line: 860, column: 32, scope: !1585)
!1596 = !DILocation(line: 860, column: 39, scope: !1585)
!1597 = !DILocation(line: 860, column: 42, scope: !1585)
!1598 = !DILocation(line: 860, column: 13, scope: !1585)
!1599 = !DILocation(line: 860, column: 12, scope: !1585)
!1600 = !DILocation(line: 861, column: 26, scope: !1585)
!1601 = !DILocation(line: 861, column: 13, scope: !1585)
!1602 = !DILocation(line: 861, column: 12, scope: !1585)
!1603 = !DILocation(line: 862, column: 9, scope: !1604)
!1604 = distinct !DILexicalBlock(scope: !1585, file: !1, line: 862, column: 9)
!1605 = !DILocation(line: 862, column: 17, scope: !1604)
!1606 = !DILocation(line: 862, column: 9, scope: !1585)
!1607 = !DILocation(line: 863, column: 7, scope: !1604)
!1608 = !DILocation(line: 864, column: 31, scope: !1585)
!1609 = !DILocation(line: 864, column: 5, scope: !1585)
!1610 = !DILocation(line: 865, column: 6, scope: !1585)
!1611 = !DILocation(line: 866, column: 3, scope: !1585)
!1612 = !DILocation(line: 855, column: 65, scope: !1580)
!1613 = !DILocation(line: 855, column: 46, scope: !1580)
!1614 = !DILocation(line: 855, column: 45, scope: !1580)
!1615 = !DILocation(line: 855, column: 3, scope: !1580)
!1616 = distinct !{!1616, !1583, !1617}
!1617 = !DILocation(line: 866, column: 3, scope: !1581)
!1618 = !DILocation(line: 867, column: 51, scope: !1406)
!1619 = !DILocation(line: 867, column: 28, scope: !1406)
!1620 = !DILocation(line: 867, column: 10, scope: !1406)
!1621 = !DILocation(line: 867, column: 9, scope: !1406)
!1622 = !DILocation(line: 868, column: 7, scope: !1623)
!1623 = distinct !DILexicalBlock(scope: !1406, file: !1, line: 868, column: 7)
!1624 = !DILocation(line: 868, column: 12, scope: !1623)
!1625 = !DILocation(line: 868, column: 7, scope: !1406)
!1626 = !DILocation(line: 870, column: 31, scope: !1627)
!1627 = distinct !DILexicalBlock(scope: !1623, file: !1, line: 869, column: 5)
!1628 = !DILocation(line: 870, column: 14, scope: !1627)
!1629 = !DILocation(line: 870, column: 13, scope: !1627)
!1630 = !DILocation(line: 871, column: 7, scope: !1627)
!1631 = !DILocation(line: 873, column: 30, scope: !1406)
!1632 = !DILocation(line: 873, column: 10, scope: !1406)
!1633 = !DILocation(line: 873, column: 3, scope: !1406)
!1634 = !DILocation(line: 874, column: 1, scope: !1406)
!1635 = distinct !DISubprogram(name: "CompareImageBounds", scope: !1, file: !1, line: 593, type: !1636, scopeLine: 595, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !669)
!1636 = !DISubroutineType(types: !1637)
!1637 = !{!501, !651, !651, !1409, !668}
!1638 = !DILocalVariable(name: "image1", arg: 1, scope: !1635, file: !1, line: 593, type: !651)
!1639 = !DILocation(line: 593, column: 54, scope: !1635)
!1640 = !DILocalVariable(name: "image2", arg: 2, scope: !1635, file: !1, line: 593, type: !651)
!1641 = !DILocation(line: 593, column: 74, scope: !1635)
!1642 = !DILocalVariable(name: "method", arg: 3, scope: !1635, file: !1, line: 594, type: !1409)
!1643 = !DILocation(line: 594, column: 26, scope: !1635)
!1644 = !DILocalVariable(name: "exception", arg: 4, scope: !1635, file: !1, line: 594, type: !668)
!1645 = !DILocation(line: 594, column: 48, scope: !1635)
!1646 = !DILocalVariable(name: "bounds", scope: !1635, file: !1, line: 597, type: !501)
!1647 = !DILocation(line: 597, column: 5, scope: !1635)
!1648 = !DILocalVariable(name: "pixel1", scope: !1635, file: !1, line: 600, type: !1649)
!1649 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickPixelPacket", file: !326, line: 127, baseType: !1650)
!1650 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MagickPixelPacket", file: !326, line: 104, size: 448, elements: !1651)
!1651 = !{!1652, !1653, !1654, !1655, !1656, !1657, !1658, !1659, !1660, !1661}
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "storage_class", scope: !1650, file: !326, line: 107, baseType: !434, size: 32)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1650, file: !326, line: 110, baseType: !436, size: 32, offset: 32)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "matte", scope: !1650, file: !326, line: 113, baseType: !445, size: 32, offset: 64)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !1650, file: !326, line: 116, baseType: !466, size: 64, offset: 128)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !1650, file: !326, line: 119, baseType: !440, size: 64, offset: 192)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !1650, file: !326, line: 122, baseType: !655, size: 32, offset: 256)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !1650, file: !326, line: 123, baseType: !655, size: 32, offset: 288)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !1650, file: !326, line: 124, baseType: !655, size: 32, offset: 320)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !1650, file: !326, line: 125, baseType: !655, size: 32, offset: 352)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1650, file: !326, line: 126, baseType: !655, size: 32, offset: 384)
!1662 = !DILocation(line: 600, column: 5, scope: !1635)
!1663 = !DILocalVariable(name: "pixel2", scope: !1635, file: !1, line: 601, type: !1649)
!1664 = !DILocation(line: 601, column: 5, scope: !1635)
!1665 = !DILocalVariable(name: "indexes1", scope: !1635, file: !1, line: 604, type: !657)
!1666 = !DILocation(line: 604, column: 6, scope: !1635)
!1667 = !DILocalVariable(name: "indexes2", scope: !1635, file: !1, line: 605, type: !657)
!1668 = !DILocation(line: 605, column: 6, scope: !1635)
!1669 = !DILocalVariable(name: "p", scope: !1635, file: !1, line: 608, type: !653)
!1670 = !DILocation(line: 608, column: 6, scope: !1635)
!1671 = !DILocalVariable(name: "q", scope: !1635, file: !1, line: 609, type: !653)
!1672 = !DILocation(line: 609, column: 6, scope: !1635)
!1673 = !DILocalVariable(name: "x", scope: !1635, file: !1, line: 612, type: !493)
!1674 = !DILocation(line: 612, column: 5, scope: !1635)
!1675 = !DILocalVariable(name: "y", scope: !1635, file: !1, line: 615, type: !493)
!1676 = !DILocation(line: 615, column: 5, scope: !1635)
!1677 = !DILocation(line: 626, column: 24, scope: !1635)
!1678 = !DILocation(line: 626, column: 3, scope: !1635)
!1679 = !DILocation(line: 627, column: 24, scope: !1635)
!1680 = !DILocation(line: 627, column: 3, scope: !1635)
!1681 = !DILocation(line: 628, column: 9, scope: !1682)
!1682 = distinct !DILexicalBlock(scope: !1635, file: !1, line: 628, column: 3)
!1683 = !DILocation(line: 628, column: 8, scope: !1682)
!1684 = !DILocation(line: 628, column: 13, scope: !1685)
!1685 = distinct !DILexicalBlock(scope: !1682, file: !1, line: 628, column: 3)
!1686 = !DILocation(line: 628, column: 27, scope: !1685)
!1687 = !DILocation(line: 628, column: 35, scope: !1685)
!1688 = !DILocation(line: 628, column: 15, scope: !1685)
!1689 = !DILocation(line: 628, column: 3, scope: !1682)
!1690 = !DILocation(line: 630, column: 24, scope: !1691)
!1691 = distinct !DILexicalBlock(scope: !1685, file: !1, line: 629, column: 3)
!1692 = !DILocation(line: 630, column: 31, scope: !1691)
!1693 = !DILocation(line: 630, column: 37, scope: !1691)
!1694 = !DILocation(line: 630, column: 45, scope: !1691)
!1695 = !DILocation(line: 630, column: 50, scope: !1691)
!1696 = !DILocation(line: 630, column: 7, scope: !1691)
!1697 = !DILocation(line: 630, column: 6, scope: !1691)
!1698 = !DILocation(line: 631, column: 24, scope: !1691)
!1699 = !DILocation(line: 631, column: 31, scope: !1691)
!1700 = !DILocation(line: 631, column: 37, scope: !1691)
!1701 = !DILocation(line: 631, column: 45, scope: !1691)
!1702 = !DILocation(line: 631, column: 50, scope: !1691)
!1703 = !DILocation(line: 631, column: 7, scope: !1691)
!1704 = !DILocation(line: 631, column: 6, scope: !1691)
!1705 = !DILocation(line: 632, column: 10, scope: !1706)
!1706 = distinct !DILexicalBlock(scope: !1691, file: !1, line: 632, column: 9)
!1707 = !DILocation(line: 632, column: 12, scope: !1706)
!1708 = !DILocation(line: 632, column: 43, scope: !1706)
!1709 = !DILocation(line: 633, column: 10, scope: !1706)
!1710 = !DILocation(line: 633, column: 12, scope: !1706)
!1711 = !DILocation(line: 632, column: 9, scope: !1691)
!1712 = !DILocation(line: 634, column: 7, scope: !1706)
!1713 = !DILocation(line: 635, column: 35, scope: !1691)
!1714 = !DILocation(line: 635, column: 14, scope: !1691)
!1715 = !DILocation(line: 635, column: 13, scope: !1691)
!1716 = !DILocation(line: 636, column: 35, scope: !1691)
!1717 = !DILocation(line: 636, column: 14, scope: !1691)
!1718 = !DILocation(line: 636, column: 13, scope: !1691)
!1719 = !DILocation(line: 637, column: 11, scope: !1720)
!1720 = distinct !DILexicalBlock(scope: !1691, file: !1, line: 637, column: 5)
!1721 = !DILocation(line: 637, column: 10, scope: !1720)
!1722 = !DILocation(line: 637, column: 15, scope: !1723)
!1723 = distinct !DILexicalBlock(scope: !1720, file: !1, line: 637, column: 5)
