; ModuleID = 'magick/annotate.c'
source_filename = "magick/annotate.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.SemaphoreInfo = type opaque
%struct.UTFInfo = type { i32, i32, i32, i32 }
%struct._Image = type { i32, i32, i32, i64, i32, i32, i32, i64, i64, i64, i64, %struct._PixelPacket*, %struct._PixelPacket, %struct._PixelPacket, %struct._PixelPacket, double, %struct._ChromaticityInfo, i32, i8*, i32, i8*, i8*, i8*, i64, double, double, %struct._RectangleInfo, %struct._RectangleInfo, %struct._RectangleInfo, double, double, double, i32, i32, i32, i32, i32, i32, %struct._Image*, i64, i64, i64, i64, i64, i64, %struct._ErrorInfo, %struct._TimerInfo, i32 (i8*, i64, i64, i8*)*, i8*, i8*, i8*, %struct._Ascii85Info*, %struct._BlobInfo*, [4096 x i8], [4096 x i8], [4096 x i8], i64, i64, %struct._ExceptionInfo, i32, i64, %struct.SemaphoreInfo*, %struct._ProfileInfo, %struct._ProfileInfo, %struct._ProfileInfo*, i64, i64, %struct._Image*, %struct._Image*, %struct._Image*, i32, i32, %struct._PixelPacket, %struct._Image*, %struct._RectangleInfo, i8*, i8*, i32, i32, i64, i32, i64, i64, i32, i64 }
%struct._ChromaticityInfo = type { %struct._PrimaryInfo, %struct._PrimaryInfo, %struct._PrimaryInfo, %struct._PrimaryInfo }
%struct._PrimaryInfo = type { double, double, double }
%struct._ErrorInfo = type { double, double, double }

!543 = !DIEnumerator(name: "WhiteVirtualPixelMethod", value: 12, isUnsigned: true)
!544 = !DIEnumerator(name: "HorizontalTileVirtualPixelMethod", value: 13, isUnsigned: true)
!545 = !DIEnumerator(name: "VerticalTileVirtualPixelMethod", value: 14, isUnsigned: true)
!546 = !DIEnumerator(name: "HorizontalTileEdgeVirtualPixelMethod", value: 15, isUnsigned: true)
!547 = !DIEnumerator(name: "VerticalTileEdgeVirtualPixelMethod", value: 16, isUnsigned: true)
!548 = !DIEnumerator(name: "CheckerTileVirtualPixelMethod", value: 17, isUnsigned: true)
!549 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !155, line: 25, baseType: !7, size: 32, elements: !550)
!550 = !{!551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576}
!551 = !DIEnumerator(name: "NoValue", value: 0, isUnsigned: true)
!552 = !DIEnumerator(name: "XValue", value: 1, isUnsigned: true)
!553 = !DIEnumerator(name: "XiValue", value: 1, isUnsigned: true)
!554 = !DIEnumerator(name: "YValue", value: 2, isUnsigned: true)
!555 = !DIEnumerator(name: "PsiValue", value: 2, isUnsigned: true)
!556 = !DIEnumerator(name: "WidthValue", value: 4, isUnsigned: true)
!557 = !DIEnumerator(name: "RhoValue", value: 4, isUnsigned: true)
!558 = !DIEnumerator(name: "HeightValue", value: 8, isUnsigned: true)
!559 = !DIEnumerator(name: "SigmaValue", value: 8, isUnsigned: true)
!560 = !DIEnumerator(name: "ChiValue", value: 16, isUnsigned: true)
!561 = !DIEnumerator(name: "XiNegative", value: 32, isUnsigned: true)
!562 = !DIEnumerator(name: "XNegative", value: 32, isUnsigned: true)
!563 = !DIEnumerator(name: "PsiNegative", value: 64, isUnsigned: true)
!564 = !DIEnumerator(name: "YNegative", value: 64, isUnsigned: true)
!565 = !DIEnumerator(name: "ChiNegative", value: 128, isUnsigned: true)
!566 = !DIEnumerator(name: "PercentValue", value: 4096, isUnsigned: true)
!567 = !DIEnumerator(name: "AspectValue", value: 8192, isUnsigned: true)
!568 = !DIEnumerator(name: "NormalizeValue", value: 8192, isUnsigned: true)
!569 = !DIEnumerator(name: "LessValue", value: 16384, isUnsigned: true)
!570 = !DIEnumerator(name: "GreaterValue", value: 32768, isUnsigned: true)
!571 = !DIEnumerator(name: "MinimumValue", value: 65536, isUnsigned: true)
!572 = !DIEnumerator(name: "CorrelateNormalizeValue", value: 65536, isUnsigned: true)
!573 = !DIEnumerator(name: "AreaValue", value: 131072, isUnsigned: true)
!574 = !DIEnumerator(name: "DecimalValue", value: 262144, isUnsigned: true)
!575 = !DIEnumerator(name: "SeparatorValue", value: 524288, isUnsigned: true)
!576 = !DIEnumerator(name: "AllValues", value: 2147483647, isUnsigned: true)
!577 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !79, line: 30, baseType: !7, size: 32, elements: !578)
!578 = !{!579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591}
!579 = !DIEnumerator(name: "UndefinedAlphaChannel", value: 0, isUnsigned: true)
!580 = !DIEnumerator(name: "ActivateAlphaChannel", value: 1, isUnsigned: true)
!581 = !DIEnumerator(name: "BackgroundAlphaChannel", value: 2, isUnsigned: true)
!582 = !DIEnumerator(name: "CopyAlphaChannel", value: 3, isUnsigned: true)
!583 = !DIEnumerator(name: "DeactivateAlphaChannel", value: 4, isUnsigned: true)
!584 = !DIEnumerator(name: "ExtractAlphaChannel", value: 5, isUnsigned: true)
!585 = !DIEnumerator(name: "OpaqueAlphaChannel", value: 6, isUnsigned: true)
!586 = !DIEnumerator(name: "ResetAlphaChannel", value: 7, isUnsigned: true)
!587 = !DIEnumerator(name: "SetAlphaChannel", value: 8, isUnsigned: true)
!588 = !DIEnumerator(name: "ShapeAlphaChannel", value: 9, isUnsigned: true)
!589 = !DIEnumerator(name: "TransparentAlphaChannel", value: 10, isUnsigned: true)
!590 = !DIEnumerator(name: "FlattenAlphaChannel", value: 11, isUnsigned: true)
!591 = !DIEnumerator(name: "RemoveAlphaChannel", value: 12, isUnsigned: true)
!592 = !{!593, !597, !598, !599, !601, !602, !604, !661, !644, !948, !637, !779, !813, !7, !1079, !878, !673, !690, !999}
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64)
!594 = !DIDerivedType(tag: DW_TAG_typedef, name: "SemaphoreInfo", file: !595, line: 26, baseType: !596)
!595 = !DIFile(filename: "./magick/semaphore.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!596 = !DICompositeType(tag: DW_TAG_structure_type, name: "SemaphoreInfo", file: !595, line: 25, flags: DIFlagFwdDecl)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!598 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64)
!600 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !599, size: 64)
!602 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !603, line: 46, baseType: !598)
!603 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 64)
!605 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageInfo", file: !6, line: 223, baseType: !606)
!606 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ImageInfo", file: !79, line: 356, size: 134336, elements: !607)
!607 = !{!608, !610, !612, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !626, !628, !630, !631, !632, !633, !634, !635, !636, !638, !639, !649, !650, !651, !652, !653, !654, !656, !658, !660, !666, !667, !668, !669, !670, !672, !862, !863, !864, !865, !866, !877, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !945, !946, !947}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !606, file: !79, line: 359, baseType: !609, size: 32)
!609 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompressionType", file: !54, line: 49, baseType: !53)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !606, file: !79, line: 362, baseType: !611, size: 32, offset: 32)
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "OrientationType", file: !79, line: 86, baseType: !78)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "temporary", scope: !606, file: !79, line: 365, baseType: !613, size: 32, offset: 64)
!613 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickBooleanType", file: !6, line: 215, baseType: !5)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "adjoin", scope: !606, file: !79, line: 366, baseType: !613, size: 32, offset: 96)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "affirm", scope: !606, file: !79, line: 367, baseType: !613, size: 32, offset: 128)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "antialias", scope: !606, file: !79, line: 368, baseType: !613, size: 32, offset: 160)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !606, file: !79, line: 371, baseType: !599, size: 64, offset: 192)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "extract", scope: !606, file: !79, line: 372, baseType: !599, size: 64, offset: 256)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !606, file: !79, line: 373, baseType: !599, size: 64, offset: 320)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "scenes", scope: !606, file: !79, line: 374, baseType: !599, size: 64, offset: 384)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !606, file: !79, line: 377, baseType: !602, size: 64, offset: 448)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "number_scenes", scope: !606, file: !79, line: 378, baseType: !602, size: 64, offset: 512)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !606, file: !79, line: 379, baseType: !602, size: 64, offset: 576)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "interlace", scope: !606, file: !79, line: 382, baseType: !625, size: 32, offset: 640)
!625 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterlaceType", file: !79, line: 73, baseType: !138)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !606, file: !79, line: 385, baseType: !627, size: 32, offset: 672)
!627 = !DIDerivedType(tag: DW_TAG_typedef, name: "EndianType", file: !149, line: 35, baseType: !148)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !606, file: !79, line: 388, baseType: !629, size: 32, offset: 704)
!629 = !DIDerivedType(tag: DW_TAG_typedef, name: "ResolutionType", file: !79, line: 93, baseType: !98)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !606, file: !79, line: 391, baseType: !602, size: 64, offset: 768)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "sampling_factor", scope: !606, file: !79, line: 394, baseType: !599, size: 64, offset: 832)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "server_name", scope: !606, file: !79, line: 395, baseType: !599, size: 64, offset: 896)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "font", scope: !606, file: !79, line: 396, baseType: !599, size: 64, offset: 960)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "texture", scope: !606, file: !79, line: 397, baseType: !599, size: 64, offset: 1024)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "density", scope: !606, file: !79, line: 398, baseType: !599, size: 64, offset: 1088)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "pointsize", scope: !606, file: !79, line: 401, baseType: !637, size: 64, offset: 1152)
!637 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !606, file: !79, line: 402, baseType: !637, size: 64, offset: 1216)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "background_color", scope: !606, file: !79, line: 405, baseType: !640, size: 64, offset: 1280)
!640 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelPacket", file: !328, line: 148, baseType: !641)
!641 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PixelPacket", file: !328, line: 131, size: 64, elements: !642)
!642 = !{!643, !646, !647, !648}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !641, file: !328, line: 143, baseType: !644, size: 16)
!644 = !DIDerivedType(tag: DW_TAG_typedef, name: "Quantum", file: !6, line: 93, baseType: !645)
!645 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !641, file: !328, line: 144, baseType: !644, size: 16, offset: 16)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !641, file: !328, line: 145, baseType: !644, size: 16, offset: 32)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !641, file: !328, line: 146, baseType: !644, size: 16, offset: 48)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !606, file: !79, line: 406, baseType: !640, size: 64, offset: 1344)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "matte_color", scope: !606, file: !79, line: 407, baseType: !640, size: 64, offset: 1408)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !606, file: !79, line: 410, baseType: !613, size: 32, offset: 1472)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "monochrome", scope: !606, file: !79, line: 411, baseType: !613, size: 32, offset: 1504)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !606, file: !79, line: 414, baseType: !602, size: 64, offset: 1536)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !606, file: !79, line: 417, baseType: !655, size: 32, offset: 1600)
!655 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorspaceType", file: !17, line: 61, baseType: !16)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !606, file: !79, line: 420, baseType: !657, size: 32, offset: 1632)
!657 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageType", file: !79, line: 61, baseType: !344)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "preview_type", scope: !606, file: !79, line: 423, baseType: !659, size: 32, offset: 1664)
!659 = !DIDerivedType(tag: DW_TAG_typedef, name: "PreviewType", file: !474, line: 59, baseType: !473)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !606, file: !79, line: 426, baseType: !661, size: 64, offset: 1728)
!661 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !662, line: 77, baseType: !663)
!662 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!663 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !664, line: 193, baseType: !665)
!664 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!665 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "ping", scope: !606, file: !79, line: 429, baseType: !613, size: 32, offset: 1792)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !606, file: !79, line: 430, baseType: !613, size: 32, offset: 1824)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !606, file: !79, line: 433, baseType: !599, size: 64, offset: 1856)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "authenticate", scope: !606, file: !79, line: 434, baseType: !599, size: 64, offset: 1920)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !606, file: !79, line: 437, baseType: !671, size: 32, offset: 1984)
!671 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChannelType", file: !6, line: 202, baseType: !506)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !606, file: !79, line: 440, baseType: !673, size: 64, offset: 2048)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64)
!674 = !DIDerivedType(tag: DW_TAG_typedef, name: "Image", file: !6, line: 221, baseType: !675)
!675 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Image", file: !79, line: 150, size: 105920, elements: !676)
!676 = !{!677, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !691, !692, !693, !694, !695, !709, !711, !712, !713, !714, !715, !716, !717, !718, !719, !727, !728, !729, !730, !731, !732, !734, !735, !736, !738, !740, !742, !744, !745, !746, !747, !748, !749, !750, !758, !773, !787, !788, !789, !790, !794, !798, !802, !803, !804, !805, !806, !820, !821, !823, !824, !834, !835, !837, !838, !839, !840, !841, !842, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !859, !861}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "storage_class", scope: !675, file: !79, line: 153, baseType: !678, size: 32)
!678 = !DIDerivedType(tag: DW_TAG_typedef, name: "ClassType", file: !6, line: 209, baseType: !11)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !675, file: !79, line: 156, baseType: !655, size: 32, offset: 32)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !675, file: !79, line: 159, baseType: !609, size: 32, offset: 64)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !675, file: !79, line: 162, baseType: !602, size: 64, offset: 128)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !675, file: !79, line: 165, baseType: !611, size: 32, offset: 192)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "taint", scope: !675, file: !79, line: 168, baseType: !613, size: 32, offset: 224)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "matte", scope: !675, file: !79, line: 169, baseType: !613, size: 32, offset: 256)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !675, file: !79, line: 172, baseType: !602, size: 64, offset: 320)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !675, file: !79, line: 173, baseType: !602, size: 64, offset: 384)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !675, file: !79, line: 174, baseType: !602, size: 64, offset: 448)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !675, file: !79, line: 175, baseType: !602, size: 64, offset: 512)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "colormap", scope: !675, file: !79, line: 178, baseType: !690, size: 64, offset: 576)
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "background_color", scope: !675, file: !79, line: 179, baseType: !640, size: 64, offset: 640)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !675, file: !79, line: 180, baseType: !640, size: 64, offset: 704)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "matte_color", scope: !675, file: !79, line: 181, baseType: !640, size: 64, offset: 768)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !675, file: !79, line: 184, baseType: !637, size: 64, offset: 832)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "chromaticity", scope: !675, file: !79, line: 187, baseType: !696, size: 768, offset: 896)
!696 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChromaticityInfo", file: !79, line: 128, baseType: !697)
!697 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ChromaticityInfo", file: !79, line: 121, size: 768, elements: !698)
!698 = !{!699, !706, !707, !708}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "red_primary", scope: !697, file: !79, line: 124, baseType: !700, size: 192)
!700 = !DIDerivedType(tag: DW_TAG_typedef, name: "PrimaryInfo", file: !79, line: 101, baseType: !701)
!701 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PrimaryInfo", file: !79, line: 95, size: 192, elements: !702)
!702 = !{!703, !704, !705}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !701, file: !79, line: 98, baseType: !637, size: 64)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !701, file: !79, line: 99, baseType: !637, size: 64, offset: 64)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !701, file: !79, line: 100, baseType: !637, size: 64, offset: 128)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "green_primary", scope: !697, file: !79, line: 125, baseType: !700, size: 192, offset: 192)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "blue_primary", scope: !697, file: !79, line: 126, baseType: !700, size: 192, offset: 384)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "white_point", scope: !697, file: !79, line: 127, baseType: !700, size: 192, offset: 576)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "rendering_intent", scope: !675, file: !79, line: 190, baseType: !710, size: 32, offset: 1664)
!710 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderingIntent", file: !91, line: 49, baseType: !90)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !675, file: !79, line: 193, baseType: !597, size: 64, offset: 1728)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !675, file: !79, line: 196, baseType: !629, size: 32, offset: 1792)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "montage", scope: !675, file: !79, line: 199, baseType: !599, size: 64, offset: 1856)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "directory", scope: !675, file: !79, line: 200, baseType: !599, size: 64, offset: 1920)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "geometry", scope: !675, file: !79, line: 201, baseType: !599, size: 64, offset: 1984)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !675, file: !79, line: 204, baseType: !661, size: 64, offset: 2048)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "x_resolution", scope: !675, file: !79, line: 207, baseType: !637, size: 64, offset: 2112)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "y_resolution", scope: !675, file: !79, line: 208, baseType: !637, size: 64, offset: 2176)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !675, file: !79, line: 211, baseType: !720, size: 256, offset: 2240)
!720 = !DIDerivedType(tag: DW_TAG_typedef, name: "RectangleInfo", file: !155, line: 130, baseType: !721)
!721 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_RectangleInfo", file: !155, line: 121, size: 256, elements: !722)
!722 = !{!723, !724, !725, !726}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !721, file: !155, line: 124, baseType: !602, size: 64)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !721, file: !155, line: 125, baseType: !602, size: 64, offset: 64)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !721, file: !155, line: 128, baseType: !661, size: 64, offset: 128)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !721, file: !155, line: 129, baseType: !661, size: 64, offset: 192)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "extract_info", scope: !675, file: !79, line: 212, baseType: !720, size: 256, offset: 2496)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "tile_info", scope: !675, file: !79, line: 213, baseType: !720, size: 256, offset: 2752)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "bias", scope: !675, file: !79, line: 216, baseType: !637, size: 64, offset: 3008)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "blur", scope: !675, file: !79, line: 217, baseType: !637, size: 64, offset: 3072)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !675, file: !79, line: 218, baseType: !637, size: 64, offset: 3136)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !675, file: !79, line: 221, baseType: !733, size: 32, offset: 3200)
!733 = !DIDerivedType(tag: DW_TAG_typedef, name: "FilterTypes", file: !104, line: 66, baseType: !103)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "interlace", scope: !675, file: !79, line: 224, baseType: !625, size: 32, offset: 3232)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !675, file: !79, line: 227, baseType: !627, size: 32, offset: 3264)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !675, file: !79, line: 230, baseType: !737, size: 32, offset: 3296)
!737 = !DIDerivedType(tag: DW_TAG_typedef, name: "GravityType", file: !155, line: 91, baseType: !154)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !675, file: !79, line: 233, baseType: !739, size: 32, offset: 3328)
!739 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompositeOperator", file: !170, line: 99, baseType: !169)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "dispose", scope: !675, file: !79, line: 236, baseType: !741, size: 32, offset: 3360)
!741 = !DIDerivedType(tag: DW_TAG_typedef, name: "DisposeType", file: !241, line: 32, baseType: !240)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "clip_mask", scope: !675, file: !79, line: 239, baseType: !743, size: 64, offset: 3392)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 64)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !675, file: !79, line: 242, baseType: !602, size: 64, offset: 3456)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !675, file: !79, line: 243, baseType: !602, size: 64, offset: 3520)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_second", scope: !675, file: !79, line: 246, baseType: !661, size: 64, offset: 3584)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "iterations", scope: !675, file: !79, line: 249, baseType: !602, size: 64, offset: 3648)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "total_colors", scope: !675, file: !79, line: 250, baseType: !602, size: 64, offset: 3712)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "start_loop", scope: !675, file: !79, line: 253, baseType: !661, size: 64, offset: 3776)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !675, file: !79, line: 256, baseType: !751, size: 192, offset: 3840)
!751 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErrorInfo", file: !752, line: 68, baseType: !753)
!752 = !DIFile(filename: "./magick/color.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!753 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ErrorInfo", file: !752, line: 62, size: 192, elements: !754)
!754 = !{!755, !756, !757}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "mean_error_per_pixel", scope: !753, file: !752, line: 65, baseType: !637, size: 64)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_mean_error", scope: !753, file: !752, line: 66, baseType: !637, size: 64, offset: 64)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_maximum_error", scope: !753, file: !752, line: 67, baseType: !637, size: 64, offset: 128)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !675, file: !79, line: 259, baseType: !759, size: 512, offset: 4032)
!759 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerInfo", file: !249, line: 51, baseType: !760)
!760 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TimerInfo", file: !249, line: 40, size: 512, elements: !761)
!761 = !{!762, !769, !770, !772}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !760, file: !249, line: 43, baseType: !763, size: 192)
!763 = !DIDerivedType(tag: DW_TAG_typedef, name: "Timer", file: !249, line: 38, baseType: !764)
!764 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Timer", file: !249, line: 32, size: 192, elements: !765)
!765 = !{!766, !767, !768}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !764, file: !249, line: 35, baseType: !637, size: 64)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !764, file: !249, line: 36, baseType: !637, size: 64, offset: 64)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !764, file: !249, line: 37, baseType: !637, size: 64, offset: 128)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "elapsed", scope: !760, file: !249, line: 44, baseType: !763, size: 192, offset: 192)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !760, file: !249, line: 47, baseType: !771, size: 32, offset: 384)
!771 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerState", file: !249, line: 30, baseType: !248)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !760, file: !249, line: 50, baseType: !602, size: 64, offset: 448)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !675, file: !79, line: 262, baseType: !774, size: 64, offset: 4544)
!774 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickProgressMonitor", file: !775, line: 26, baseType: !776)
!775 = !DIFile(filename: "./magick/monitor.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 64)
!777 = !DISubroutineType(types: !778)
!778 = !{!613, !779, !781, !784, !597}
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !780, size: 64)
!780 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !600)
!781 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !782)
!782 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickOffsetType", file: !6, line: 150, baseType: !783)
!783 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!784 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !785)
!785 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickSizeType", file: !6, line: 151, baseType: !786)
!786 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !675, file: !79, line: 265, baseType: !597, size: 64, offset: 4608)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !675, file: !79, line: 266, baseType: !597, size: 64, offset: 4672)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !675, file: !79, line: 267, baseType: !597, size: 64, offset: 4736)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "ascii85", scope: !675, file: !79, line: 270, baseType: !791, size: 64, offset: 4800)
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 64)
!792 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ascii85Info", file: !54, line: 52, baseType: !793)
!793 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Ascii85Info", file: !54, line: 51, flags: DIFlagFwdDecl)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !675, file: !79, line: 273, baseType: !795, size: 64, offset: 4864)
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 64)
!796 = !DIDerivedType(tag: DW_TAG_typedef, name: "BlobInfo", file: !6, line: 217, baseType: !797)
!797 = !DICompositeType(tag: DW_TAG_structure_type, name: "_BlobInfo", file: !6, line: 217, flags: DIFlagFwdDecl)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !675, file: !79, line: 276, baseType: !799, size: 32768, offset: 4928)
!799 = !DICompositeType(tag: DW_TAG_array_type, baseType: !600, size: 32768, elements: !800)
!800 = !{!801}
!801 = !DISubrange(count: 4096)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "magick_filename", scope: !675, file: !79, line: 277, baseType: !799, size: 32768, offset: 37696)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !675, file: !79, line: 278, baseType: !799, size: 32768, offset: 70464)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "magick_columns", scope: !675, file: !79, line: 281, baseType: !602, size: 64, offset: 103232)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "magick_rows", scope: !675, file: !79, line: 282, baseType: !602, size: 64, offset: 103296)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "exception", scope: !675, file: !79, line: 285, baseType: !807, size: 448, offset: 103360)
!807 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionInfo", file: !6, line: 219, baseType: !808)
!808 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ExceptionInfo", file: !255, line: 102, size: 448, elements: !809)
!809 = !{!810, !812, !814, !815, !816, !817, !818, !819}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "severity", scope: !808, file: !255, line: 105, baseType: !811, size: 32)
!811 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionType", file: !255, line: 100, baseType: !254)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "error_number", scope: !808, file: !255, line: 108, baseType: !813, size: 32, offset: 32)
!813 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !808, file: !255, line: 111, baseType: !599, size: 64, offset: 64)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !808, file: !255, line: 112, baseType: !599, size: 64, offset: 128)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "exceptions", scope: !808, file: !255, line: 115, baseType: !597, size: 64, offset: 192)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "relinquish", scope: !808, file: !255, line: 118, baseType: !613, size: 32, offset: 256)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !808, file: !255, line: 121, baseType: !593, size: 64, offset: 320)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !808, file: !255, line: 124, baseType: !602, size: 64, offset: 384)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !675, file: !79, line: 288, baseType: !613, size: 32, offset: 103808)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !675, file: !79, line: 291, baseType: !822, size: 64, offset: 103872)
!822 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !661)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !675, file: !79, line: 294, baseType: !593, size: 64, offset: 103936)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "color_profile", scope: !675, file: !79, line: 297, baseType: !825, size: 256, offset: 104000)
!825 = !DIDerivedType(tag: DW_TAG_typedef, name: "ProfileInfo", file: !91, line: 40, baseType: !826)
!826 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ProfileInfo", file: !91, line: 27, size: 256, elements: !827)
!827 = !{!828, !829, !830, !833}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !826, file: !91, line: 30, baseType: !599, size: 64)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !826, file: !91, line: 33, baseType: !602, size: 64, offset: 64)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !826, file: !91, line: 36, baseType: !831, size: 64, offset: 128)
!831 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !832, size: 64)
!832 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !826, file: !91, line: 39, baseType: !602, size: 64, offset: 192)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "iptc_profile", scope: !675, file: !79, line: 298, baseType: !825, size: 256, offset: 104256)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profile", scope: !675, file: !79, line: 299, baseType: !836, size: 64, offset: 104512)
!836 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !825, size: 64)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profiles", scope: !675, file: !79, line: 302, baseType: !602, size: 64, offset: 104576)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !675, file: !79, line: 305, baseType: !602, size: 64, offset: 104640)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !675, file: !79, line: 308, baseType: !743, size: 64, offset: 104704)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !675, file: !79, line: 309, baseType: !743, size: 64, offset: 104768)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !675, file: !79, line: 310, baseType: !743, size: 64, offset: 104832)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "interpolate", scope: !675, file: !79, line: 313, baseType: !843, size: 32, offset: 104896)
!843 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterpolatePixelMethod", file: !328, line: 47, baseType: !327)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "black_point_compensation", scope: !675, file: !79, line: 316, baseType: !613, size: 32, offset: 104928)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_color", scope: !675, file: !79, line: 319, baseType: !640, size: 64, offset: 104960)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !675, file: !79, line: 322, baseType: !743, size: 64, offset: 105024)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "tile_offset", scope: !675, file: !79, line: 325, baseType: !720, size: 256, offset: 105088)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !675, file: !79, line: 328, baseType: !597, size: 64, offset: 105344)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "artifacts", scope: !675, file: !79, line: 329, baseType: !597, size: 64, offset: 105408)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !675, file: !79, line: 332, baseType: !657, size: 32, offset: 105472)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !675, file: !79, line: 335, baseType: !613, size: 32, offset: 105504)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !675, file: !79, line: 338, baseType: !785, size: 64, offset: 105536)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "ping", scope: !675, file: !79, line: 341, baseType: !613, size: 32, offset: 105600)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !675, file: !79, line: 344, baseType: !602, size: 64, offset: 105664)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !675, file: !79, line: 347, baseType: !856, size: 64, offset: 105728)
!856 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !857, line: 7, baseType: !858)
!857 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "")
!858 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !664, line: 160, baseType: !665)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "intensity", scope: !675, file: !79, line: 350, baseType: !860, size: 32, offset: 105792)
!860 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelIntensityMethod", file: !328, line: 79, baseType: !358)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !675, file: !79, line: 353, baseType: !602, size: 64, offset: 105856)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !606, file: !79, line: 443, baseType: !597, size: 64, offset: 2112)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !606, file: !79, line: 446, baseType: !774, size: 64, offset: 2176)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !606, file: !79, line: 449, baseType: !597, size: 64, offset: 2240)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !606, file: !79, line: 450, baseType: !597, size: 64, offset: 2304)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !606, file: !79, line: 453, baseType: !867, size: 64, offset: 2368)
!867 = !DIDerivedType(tag: DW_TAG_typedef, name: "StreamHandler", file: !868, line: 26, baseType: !869)
!868 = !DIFile(filename: "./magick/stream.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !870, size: 64)
!870 = !DISubroutineType(types: !871)
!871 = !{!602, !872, !874, !876}
!872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !873, size: 64)
!873 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !674)
!874 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !875, size: 64)
!875 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!876 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !602)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !606, file: !79, line: 456, baseType: !878, size: 64, offset: 2432)
!878 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !879, size: 64)
!879 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !880, line: 7, baseType: !881)
!880 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!881 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !882, line: 49, size: 1728, elements: !883)
!882 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!883 = !{!884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !899, !901, !902, !903, !905, !906, !908, !912, !915, !917, !920, !923, !924, !925, !926, !927}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !881, file: !882, line: 51, baseType: !813, size: 32)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !881, file: !882, line: 54, baseType: !599, size: 64, offset: 64)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !881, file: !882, line: 55, baseType: !599, size: 64, offset: 128)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !881, file: !882, line: 56, baseType: !599, size: 64, offset: 192)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !881, file: !882, line: 57, baseType: !599, size: 64, offset: 256)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !881, file: !882, line: 58, baseType: !599, size: 64, offset: 320)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !881, file: !882, line: 59, baseType: !599, size: 64, offset: 384)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !881, file: !882, line: 60, baseType: !599, size: 64, offset: 448)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !881, file: !882, line: 61, baseType: !599, size: 64, offset: 512)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !881, file: !882, line: 64, baseType: !599, size: 64, offset: 576)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !881, file: !882, line: 65, baseType: !599, size: 64, offset: 640)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !881, file: !882, line: 66, baseType: !599, size: 64, offset: 704)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !881, file: !882, line: 68, baseType: !897, size: 64, offset: 768)
!897 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !898, size: 64)
!898 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !882, line: 36, flags: DIFlagFwdDecl)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !881, file: !882, line: 70, baseType: !900, size: 64, offset: 832)
!900 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !881, size: 64)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !881, file: !882, line: 72, baseType: !813, size: 32, offset: 896)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !881, file: !882, line: 73, baseType: !813, size: 32, offset: 928)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !881, file: !882, line: 74, baseType: !904, size: 64, offset: 960)
!904 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !664, line: 152, baseType: !665)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !881, file: !882, line: 77, baseType: !645, size: 16, offset: 1024)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !881, file: !882, line: 78, baseType: !907, size: 8, offset: 1040)
!907 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !881, file: !882, line: 79, baseType: !909, size: 8, offset: 1048)
!909 = !DICompositeType(tag: DW_TAG_array_type, baseType: !600, size: 8, elements: !910)
!910 = !{!911}
!911 = !DISubrange(count: 1)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !881, file: !882, line: 81, baseType: !913, size: 64, offset: 1088)
!913 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !914, size: 64)
!914 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !882, line: 43, baseType: null)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !881, file: !882, line: 89, baseType: !916, size: 64, offset: 1152)
!916 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !664, line: 153, baseType: !665)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !881, file: !882, line: 91, baseType: !918, size: 64, offset: 1216)
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !919, size: 64)
!919 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !882, line: 37, flags: DIFlagFwdDecl)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !881, file: !882, line: 92, baseType: !921, size: 64, offset: 1280)
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !922, size: 64)
!922 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !882, line: 38, flags: DIFlagFwdDecl)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !881, file: !882, line: 93, baseType: !900, size: 64, offset: 1344)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !881, file: !882, line: 94, baseType: !597, size: 64, offset: 1408)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !881, file: !882, line: 95, baseType: !602, size: 64, offset: 1472)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !881, file: !882, line: 96, baseType: !813, size: 32, offset: 1536)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !881, file: !882, line: 98, baseType: !928, size: 160, offset: 1568)
!928 = !DICompositeType(tag: DW_TAG_array_type, baseType: !600, size: 160, elements: !929)
!929 = !{!930}
!930 = !DISubrange(count: 20)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !606, file: !79, line: 459, baseType: !597, size: 64, offset: 2496)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !606, file: !79, line: 462, baseType: !602, size: 64, offset: 2560)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !606, file: !79, line: 465, baseType: !799, size: 32768, offset: 2624)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "unique", scope: !606, file: !79, line: 466, baseType: !799, size: 32768, offset: 35392)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "zero", scope: !606, file: !79, line: 467, baseType: !799, size: 32768, offset: 68160)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !606, file: !79, line: 468, baseType: !799, size: 32768, offset: 100928)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !606, file: !79, line: 471, baseType: !613, size: 32, offset: 133696)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "tile", scope: !606, file: !79, line: 474, baseType: !599, size: 64, offset: 133760)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "subimage", scope: !606, file: !79, line: 477, baseType: !602, size: 64, offset: 133824)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "subrange", scope: !606, file: !79, line: 478, baseType: !602, size: 64, offset: 133888)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "pen", scope: !606, file: !79, line: 481, baseType: !640, size: 64, offset: 133952)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !606, file: !79, line: 484, baseType: !602, size: 64, offset: 134016)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_pixel_method", scope: !606, file: !79, line: 487, baseType: !944, size: 32, offset: 134080)
!944 = !DIDerivedType(tag: DW_TAG_typedef, name: "VirtualPixelMethod", file: !529, line: 47, baseType: !528)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_color", scope: !606, file: !79, line: 490, baseType: !640, size: 64, offset: 134112)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !606, file: !79, line: 493, baseType: !597, size: 64, offset: 134208)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "synchronize", scope: !606, file: !79, line: 496, baseType: !613, size: 32, offset: 134272)
!948 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 64)
!949 = !DIDerivedType(tag: DW_TAG_typedef, name: "DrawInfo", file: !371, line: 333, baseType: !950)
!950 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_DrawInfo", file: !371, line: 205, size: 5760, elements: !951)
!951 = !{!952, !953, !954, !955, !965, !966, !967, !968, !969, !1018, !1019, !1020, !1021, !1022, !1023, !1025, !1027, !1029, !1030, !1031, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1041, !1043, !1044, !1045, !1046, !1047, !1049, !1050, !1051, !1052, !1054, !1055, !1056, !1058, !1059, !1060, !1072, !1073, !1074, !1075, !1076, !1077}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "primitive", scope: !950, file: !371, line: 208, baseType: !599, size: 64)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "geometry", scope: !950, file: !371, line: 209, baseType: !599, size: 64, offset: 64)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "viewbox", scope: !950, file: !371, line: 212, baseType: !720, size: 256, offset: 128)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "affine", scope: !950, file: !371, line: 215, baseType: !956, size: 384, offset: 384)
!956 = !DIDerivedType(tag: DW_TAG_typedef, name: "AffineMatrix", file: !155, line: 102, baseType: !957)
!957 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_AffineMatrix", file: !155, line: 93, size: 384, elements: !958)
!958 = !{!959, !960, !961, !962, !963, !964}
!959 = !DIDerivedType(tag: DW_TAG_member, name: "sx", scope: !957, file: !155, line: 96, baseType: !637, size: 64)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "rx", scope: !957, file: !155, line: 97, baseType: !637, size: 64, offset: 64)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "ry", scope: !957, file: !155, line: 98, baseType: !637, size: 64, offset: 128)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "sy", scope: !957, file: !155, line: 99, baseType: !637, size: 64, offset: 192)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "tx", scope: !957, file: !155, line: 100, baseType: !637, size: 64, offset: 256)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "ty", scope: !957, file: !155, line: 101, baseType: !637, size: 64, offset: 320)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !950, file: !371, line: 218, baseType: !737, size: 32, offset: 768)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !950, file: !371, line: 221, baseType: !640, size: 64, offset: 800)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "stroke", scope: !950, file: !371, line: 222, baseType: !640, size: 64, offset: 864)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "stroke_width", scope: !950, file: !371, line: 225, baseType: !637, size: 64, offset: 960)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "gradient", scope: !950, file: !371, line: 228, baseType: !970, size: 1024, offset: 1024)
!970 = !DIDerivedType(tag: DW_TAG_typedef, name: "GradientInfo", file: !371, line: 184, baseType: !971)
!971 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GradientInfo", file: !371, line: 153, size: 1024, elements: !972)
!972 = !{!973, !975, !976, !984, !1006, !1007, !1009, !1010, !1011, !1017}
!973 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !971, file: !371, line: 156, baseType: !974, size: 32)
!974 = !DIDerivedType(tag: DW_TAG_typedef, name: "GradientType", file: !371, line: 75, baseType: !370)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "bounding_box", scope: !971, file: !371, line: 159, baseType: !720, size: 256, offset: 64)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "gradient_vector", scope: !971, file: !371, line: 162, baseType: !977, size: 256, offset: 320)
!977 = !DIDerivedType(tag: DW_TAG_typedef, name: "SegmentInfo", file: !79, line: 110, baseType: !978)
!978 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_SegmentInfo", file: !79, line: 103, size: 256, elements: !979)
!979 = !{!980, !981, !982, !983}
!980 = !DIDerivedType(tag: DW_TAG_member, name: "x1", scope: !978, file: !79, line: 106, baseType: !637, size: 64)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "y1", scope: !978, file: !79, line: 107, baseType: !637, size: 64, offset: 64)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "x2", scope: !978, file: !79, line: 108, baseType: !637, size: 64, offset: 128)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "y2", scope: !978, file: !79, line: 109, baseType: !637, size: 64, offset: 192)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "stops", scope: !971, file: !371, line: 165, baseType: !985, size: 64, offset: 576)
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 64)
!986 = !DIDerivedType(tag: DW_TAG_typedef, name: "StopInfo", file: !371, line: 151, baseType: !987)
!987 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_StopInfo", file: !371, line: 144, size: 512, elements: !988)
!988 = !{!989, !1005}
!989 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !987, file: !371, line: 147, baseType: !990, size: 448)
!990 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickPixelPacket", file: !328, line: 127, baseType: !991)
!991 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MagickPixelPacket", file: !328, line: 104, size: 448, elements: !992)
!992 = !{!993, !994, !995, !996, !997, !998, !1001, !1002, !1003, !1004}
!993 = !DIDerivedType(tag: DW_TAG_member, name: "storage_class", scope: !991, file: !328, line: 107, baseType: !678, size: 32)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !991, file: !328, line: 110, baseType: !655, size: 32, offset: 32)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "matte", scope: !991, file: !328, line: 113, baseType: !613, size: 32, offset: 64)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !991, file: !328, line: 116, baseType: !637, size: 64, offset: 128)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !991, file: !328, line: 119, baseType: !602, size: 64, offset: 192)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !991, file: !328, line: 122, baseType: !999, size: 32, offset: 256)
!999 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickRealType", file: !6, line: 78, baseType: !1000)
!1000 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !991, file: !328, line: 123, baseType: !999, size: 32, offset: 288)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !991, file: !328, line: 124, baseType: !999, size: 32, offset: 320)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !991, file: !328, line: 125, baseType: !999, size: 32, offset: 352)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !991, file: !328, line: 126, baseType: !999, size: 32, offset: 384)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !987, file: !371, line: 150, baseType: !999, size: 32, offset: 448)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "number_stops", scope: !971, file: !371, line: 168, baseType: !602, size: 64, offset: 640)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "spread", scope: !971, file: !371, line: 171, baseType: !1008, size: 32, offset: 704)
!1008 = !DIDerivedType(tag: DW_TAG_typedef, name: "SpreadMethod", file: !371, line: 135, baseType: !376)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !971, file: !371, line: 174, baseType: !613, size: 32, offset: 736)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !971, file: !371, line: 177, baseType: !602, size: 64, offset: 768)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "center", scope: !971, file: !371, line: 180, baseType: !1012, size: 128, offset: 832)
!1012 = !DIDerivedType(tag: DW_TAG_typedef, name: "PointInfo", file: !371, line: 142, baseType: !1013)
!1013 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PointInfo", file: !371, line: 137, size: 128, elements: !1014)
!1014 = !{!1015, !1016}
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1013, file: !371, line: 140, baseType: !637, size: 64)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1013, file: !371, line: 141, baseType: !637, size: 64, offset: 64)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "radius", scope: !971, file: !371, line: 183, baseType: !999, size: 32, offset: 960)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "fill_pattern", scope: !950, file: !371, line: 231, baseType: !673, size: 64, offset: 2048)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "tile", scope: !950, file: !371, line: 232, baseType: !673, size: 64, offset: 2112)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "stroke_pattern", scope: !950, file: !371, line: 233, baseType: !673, size: 64, offset: 2176)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "stroke_antialias", scope: !950, file: !371, line: 236, baseType: !613, size: 32, offset: 2240)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "text_antialias", scope: !950, file: !371, line: 237, baseType: !613, size: 32, offset: 2272)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "fill_rule", scope: !950, file: !371, line: 240, baseType: !1024, size: 32, offset: 2304)
!1024 = !DIDerivedType(tag: DW_TAG_typedef, name: "FillRule", file: !371, line: 68, baseType: !382)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "linecap", scope: !950, file: !371, line: 243, baseType: !1026, size: 32, offset: 2336)
!1026 = !DIDerivedType(tag: DW_TAG_typedef, name: "LineCap", file: !371, line: 83, baseType: !387)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "linejoin", scope: !950, file: !371, line: 246, baseType: !1028, size: 32, offset: 2368)
!1028 = !DIDerivedType(tag: DW_TAG_typedef, name: "LineJoin", file: !371, line: 91, baseType: !393)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "miterlimit", scope: !950, file: !371, line: 249, baseType: !602, size: 64, offset: 2432)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "dash_offset", scope: !950, file: !371, line: 252, baseType: !637, size: 64, offset: 2496)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "decorate", scope: !950, file: !371, line: 255, baseType: !1032, size: 32, offset: 2560)
!1032 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecorationType", file: !371, line: 53, baseType: !399)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !950, file: !371, line: 258, baseType: !739, size: 32, offset: 2592)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !950, file: !371, line: 261, baseType: !599, size: 64, offset: 2624)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "face", scope: !950, file: !371, line: 264, baseType: !602, size: 64, offset: 2688)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "font", scope: !950, file: !371, line: 267, baseType: !599, size: 64, offset: 2752)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "metrics", scope: !950, file: !371, line: 268, baseType: !599, size: 64, offset: 2816)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !950, file: !371, line: 269, baseType: !599, size: 64, offset: 2880)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !950, file: !371, line: 272, baseType: !1040, size: 32, offset: 2944)
!1040 = !DIDerivedType(tag: DW_TAG_typedef, name: "StyleType", file: !407, line: 47, baseType: !406)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "stretch", scope: !950, file: !371, line: 275, baseType: !1042, size: 32, offset: 2976)
!1042 = !DIDerivedType(tag: DW_TAG_typedef, name: "StretchType", file: !407, line: 38, baseType: !414)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !950, file: !371, line: 278, baseType: !602, size: 64, offset: 3008)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !950, file: !371, line: 281, baseType: !599, size: 64, offset: 3072)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "pointsize", scope: !950, file: !371, line: 284, baseType: !637, size: 64, offset: 3136)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "density", scope: !950, file: !371, line: 287, baseType: !599, size: 64, offset: 3200)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !950, file: !371, line: 290, baseType: !1048, size: 32, offset: 3264)
!1048 = !DIDerivedType(tag: DW_TAG_typedef, name: "AlignType", file: !371, line: 36, baseType: !427)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "undercolor", scope: !950, file: !371, line: 293, baseType: !640, size: 64, offset: 3296)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !950, file: !371, line: 294, baseType: !640, size: 64, offset: 3360)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "server_name", scope: !950, file: !371, line: 297, baseType: !599, size: 64, offset: 3456)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "dash_pattern", scope: !950, file: !371, line: 300, baseType: !1053, size: 64, offset: 3520)
!1053 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 64)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "clip_mask", scope: !950, file: !371, line: 303, baseType: !599, size: 64, offset: 3584)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "bounds", scope: !950, file: !371, line: 306, baseType: !977, size: 256, offset: 3648)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "clip_units", scope: !950, file: !371, line: 309, baseType: !1057, size: 32, offset: 3904)
!1057 = !DIDerivedType(tag: DW_TAG_typedef, name: "ClipPathUnits", file: !371, line: 44, baseType: !433)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !950, file: !371, line: 312, baseType: !644, size: 16, offset: 3936)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "render", scope: !950, file: !371, line: 315, baseType: !613, size: 32, offset: 3968)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "element_reference", scope: !950, file: !371, line: 318, baseType: !1061, size: 1344, offset: 4032)
!1061 = !DIDerivedType(tag: DW_TAG_typedef, name: "ElementReference", file: !371, line: 203, baseType: !1062)
!1062 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ElementReference", file: !371, line: 186, size: 1344, elements: !1063)
!1063 = !{!1064, !1065, !1067, !1068, !1069, !1071}
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1062, file: !371, line: 189, baseType: !599, size: 64)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1062, file: !371, line: 192, baseType: !1066, size: 32, offset: 64)
!1066 = !DIDerivedType(tag: DW_TAG_typedef, name: "ReferenceType", file: !371, line: 127, baseType: !439)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "gradient", scope: !1062, file: !371, line: 195, baseType: !970, size: 1024, offset: 128)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !1062, file: !371, line: 198, baseType: !602, size: 64, offset: 1152)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !1062, file: !371, line: 201, baseType: !1070, size: 64, offset: 1216)
!1070 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1062, size: 64)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1062, file: !371, line: 202, baseType: !1070, size: 64, offset: 1280)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !950, file: !371, line: 321, baseType: !613, size: 32, offset: 5376)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !950, file: !371, line: 324, baseType: !602, size: 64, offset: 5440)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "kerning", scope: !950, file: !371, line: 327, baseType: !637, size: 64, offset: 5504)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "interword_spacing", scope: !950, file: !371, line: 328, baseType: !637, size: 64, offset: 5568)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "interline_spacing", scope: !950, file: !371, line: 329, baseType: !637, size: 64, offset: 5632)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "direction", scope: !950, file: !371, line: 332, baseType: !1078, size: 32, offset: 5696)
!1078 = !DIDerivedType(tag: DW_TAG_typedef, name: "DirectionType", file: !371, line: 60, baseType: !443)
!1079 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1080, size: 64)
!1080 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1081)
!1081 = !DIDerivedType(tag: DW_TAG_typedef, name: "TypeInfo", file: !407, line: 85, baseType: !1082)
!1082 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TypeInfo", file: !407, line: 49, size: 1024, elements: !1083)
!1083 = !{!1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1100, !1101}
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "face", scope: !1082, file: !407, line: 52, baseType: !602, size: 64)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !1082, file: !407, line: 55, baseType: !599, size: 64, offset: 64)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1082, file: !407, line: 56, baseType: !599, size: 64, offset: 128)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !1082, file: !407, line: 57, baseType: !599, size: 64, offset: 192)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !1082, file: !407, line: 58, baseType: !599, size: 64, offset: 256)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "style", scope: !1082, file: !407, line: 61, baseType: !1040, size: 32, offset: 320)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "stretch", scope: !1082, file: !407, line: 64, baseType: !1042, size: 32, offset: 352)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !1082, file: !407, line: 67, baseType: !602, size: 64, offset: 384)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !1082, file: !407, line: 70, baseType: !599, size: 64, offset: 448)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "foundry", scope: !1082, file: !407, line: 71, baseType: !599, size: 64, offset: 512)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1082, file: !407, line: 72, baseType: !599, size: 64, offset: 576)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "metrics", scope: !1082, file: !407, line: 73, baseType: !599, size: 64, offset: 640)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "glyphs", scope: !1082, file: !407, line: 74, baseType: !599, size: 64, offset: 704)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "stealth", scope: !1082, file: !407, line: 77, baseType: !613, size: 32, offset: 768)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !1082, file: !407, line: 80, baseType: !1099, size: 64, offset: 832)
!1099 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1082, size: 64)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1082, file: !407, line: 81, baseType: !1099, size: 64, offset: 896)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !1082, file: !407, line: 84, baseType: !602, size: 64, offset: 960)
!1102 = !{!0, !1103}
!1103 = !DIGlobalVariableExpression(var: !1104, expr: !DIExpression())
!1104 = distinct !DIGlobalVariable(name: "utf_info", scope: !2, file: !1105, line: 41, type: !1106, isLocal: true, isDefinition: true)
!1105 = !DIFile(filename: "./magick/token-private.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!1106 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1107, size: 768, elements: !1114)
!1107 = !DIDerivedType(tag: DW_TAG_typedef, name: "UTFInfo", file: !1105, line: 38, baseType: !1108)
!1108 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1105, line: 31, size: 128, elements: !1109)
!1109 = !{!1110, !1111, !1112, !1113}
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "code_mask", scope: !1108, file: !1105, line: 34, baseType: !813, size: 32)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "code_value", scope: !1108, file: !1105, line: 35, baseType: !813, size: 32, offset: 32)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "utf_mask", scope: !1108, file: !1105, line: 36, baseType: !813, size: 32, offset: 64)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "utf_value", scope: !1108, file: !1105, line: 37, baseType: !813, size: 32, offset: 96)
!1114 = !{!1115}
!1115 = !DISubrange(count: 6)
!1116 = !{i32 7, !"Dwarf Version", i32 4}
!1117 = !{i32 2, !"Debug Info Version", i32 3}
!1118 = !{i32 1, !"wchar_size", i32 4}
!1119 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!1120 = distinct !DISubprogram(name: "AnnotateComponentGenesis", scope: !3, file: !3, line: 139, type: !1121, scopeLine: 140, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !1123)
!1121 = !DISubroutineType(types: !1122)
!1122 = !{!613}
!1123 = !{}
!1124 = !DILocation(line: 141, column: 7, scope: !1125)
!1125 = distinct !DILexicalBlock(scope: !1120, file: !3, line: 141, column: 7)
!1126 = !DILocation(line: 141, column: 26, scope: !1125)
!1127 = !DILocation(line: 141, column: 7, scope: !1120)
!1128 = !DILocation(line: 142, column: 24, scope: !1125)
!1129 = !DILocation(line: 142, column: 23, scope: !1125)
!1130 = !DILocation(line: 142, column: 5, scope: !1125)
!1131 = !DILocation(line: 143, column: 3, scope: !1120)
!1132 = distinct !DISubprogram(name: "AnnotateComponentTerminus", scope: !3, file: !3, line: 164, type: !1133, scopeLine: 165, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !1123)
!1133 = !DISubroutineType(types: !1134)
!1134 = !{null}
!1135 = !DILocation(line: 166, column: 7, scope: !1136)
!1136 = distinct !DILexicalBlock(scope: !1132, file: !3, line: 166, column: 7)
!1137 = !DILocation(line: 166, column: 26, scope: !1136)
!1138 = !DILocation(line: 166, column: 7, scope: !1132)
!1139 = !DILocation(line: 167, column: 5, scope: !1136)
!1140 = !DILocation(line: 168, column: 3, scope: !1132)
!1141 = !DILocation(line: 169, column: 1, scope: !1132)
!1142 = distinct !DISubprogram(name: "AnnotateImage", scope: !3, file: !3, line: 219, type: !1143, scopeLine: 221, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !1123)
!1143 = !DISubroutineType(types: !1144)
!1144 = !{!613, !673, !1145}
!1145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1146, size: 64)
!1146 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !949)
!1147 = !DILocalVariable(name: "image", arg: 1, scope: !1142, file: !3, line: 219, type: !673)
!1148 = !DILocation(line: 219, column: 53, scope: !1142)
!1149 = !DILocalVariable(name: "draw_info", arg: 2, scope: !1142, file: !3, line: 220, type: !1145)
!1150 = !DILocation(line: 220, column: 19, scope: !1142)
!1151 = !DILocalVariable(name: "primitive", scope: !1142, file: !3, line: 223, type: !799)
!1152 = !DILocation(line: 223, column: 5, scope: !1142)
!1153 = !DILocalVariable(name: "textlist", scope: !1142, file: !3, line: 224, type: !601)
!1154 = !DILocation(line: 224, column: 7, scope: !1142)
!1155 = !DILocalVariable(name: "annotate", scope: !1142, file: !3, line: 227, type: !948)
!1156 = !DILocation(line: 227, column: 6, scope: !1142)
!1157 = !DILocalVariable(name: "annotate_info", scope: !1142, file: !3, line: 228, type: !948)
!1158 = !DILocation(line: 228, column: 6, scope: !1142)
!1159 = !DILocalVariable(name: "geometry_info", scope: !1142, file: !3, line: 231, type: !1160)
!1160 = !DIDerivedType(tag: DW_TAG_typedef, name: "GeometryInfo", file: !155, line: 112, baseType: !1161)
!1161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_GeometryInfo", file: !155, line: 104, size: 320, elements: !1162)
!1162 = !{!1163, !1164, !1165, !1166, !1167}
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "rho", scope: !1161, file: !155, line: 107, baseType: !637, size: 64)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "sigma", scope: !1161, file: !155, line: 108, baseType: !637, size: 64, offset: 64)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "xi", scope: !1161, file: !155, line: 109, baseType: !637, size: 64, offset: 128)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "psi", scope: !1161, file: !155, line: 110, baseType: !637, size: 64, offset: 192)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "chi", scope: !1161, file: !155, line: 111, baseType: !637, size: 64, offset: 256)
!1168 = !DILocation(line: 231, column: 5, scope: !1142)
!1169 = !DILocalVariable(name: "status", scope: !1142, file: !3, line: 234, type: !613)
!1170 = !DILocation(line: 234, column: 5, scope: !1142)
!1171 = !DILocalVariable(name: "offset", scope: !1142, file: !3, line: 237, type: !1012)
!1172 = !DILocation(line: 237, column: 5, scope: !1142)
!1173 = !DILocalVariable(name: "geometry", scope: !1142, file: !3, line: 240, type: !720)
!1174 = !DILocation(line: 240, column: 5, scope: !1142)
!1175 = !DILocalVariable(name: "i", scope: !1142, file: !3, line: 243, type: !661)
!1176 = !DILocation(line: 243, column: 5, scope: !1142)
!1177 = !DILocalVariable(name: "length", scope: !1142, file: !3, line: 246, type: !602)
!1178 = !DILocation(line: 246, column: 5, scope: !1142)
!1179 = !DILocalVariable(name: "metrics", scope: !1142, file: !3, line: 249, type: !1180)
!1180 = !DIDerivedType(tag: DW_TAG_typedef, name: "TypeMetric", file: !371, line: 372, baseType: !1181)
!1181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TypeMetric", file: !371, line: 353, size: 960, elements: !1182)
!1182 = !{!1183, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1192}
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "pixels_per_em", scope: !1181, file: !371, line: 356, baseType: !1012, size: 128)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "ascent", scope: !1181, file: !371, line: 359, baseType: !637, size: 64, offset: 128)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "descent", scope: !1181, file: !371, line: 360, baseType: !637, size: 64, offset: 192)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1181, file: !371, line: 361, baseType: !637, size: 64, offset: 256)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1181, file: !371, line: 362, baseType: !637, size: 64, offset: 320)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "max_advance", scope: !1181, file: !371, line: 363, baseType: !637, size: 64, offset: 384)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "underline_position", scope: !1181, file: !371, line: 364, baseType: !637, size: 64, offset: 448)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "underline_thickness", scope: !1181, file: !371, line: 365, baseType: !637, size: 64, offset: 512)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "bounds", scope: !1181, file: !371, line: 368, baseType: !977, size: 256, offset: 576)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "origin", scope: !1181, file: !371, line: 371, baseType: !1012, size: 128, offset: 832)
!1193 = !DILocation(line: 249, column: 5, scope: !1142)
!1194 = !DILocalVariable(name: "height", scope: !1142, file: !3, line: 252, type: !602)
!1195 = !DILocation(line: 252, column: 5, scope: !1142)
!1196 = !DILocalVariable(name: "number_lines", scope: !1142, file: !3, line: 253, type: !602)
!1197 = !DILocation(line: 253, column: 5, scope: !1142)
!1198 = !DILocation(line: 257, column: 7, scope: !1199)
!1199 = distinct !DILexicalBlock(scope: !1142, file: !3, line: 257, column: 7)
!1200 = !DILocation(line: 257, column: 14, scope: !1199)
!1201 = !DILocation(line: 257, column: 20, scope: !1199)
!1202 = !DILocation(line: 257, column: 7, scope: !1142)
!1203 = !DILocation(line: 258, column: 61, scope: !1199)
!1204 = !DILocation(line: 258, column: 68, scope: !1199)
!1205 = !DILocation(line: 258, column: 12, scope: !1199)
!1206 = !DILocation(line: 258, column: 5, scope: !1199)
!1207 = !DILocation(line: 261, column: 7, scope: !1208)
!1208 = distinct !DILexicalBlock(scope: !1142, file: !3, line: 261, column: 7)
!1209 = !DILocation(line: 261, column: 18, scope: !1208)
!1210 = !DILocation(line: 261, column: 23, scope: !1208)
!1211 = !DILocation(line: 261, column: 7, scope: !1142)
!1212 = !DILocation(line: 262, column: 5, scope: !1208)
!1213 = !DILocation(line: 263, column: 8, scope: !1214)
!1214 = distinct !DILexicalBlock(scope: !1142, file: !3, line: 263, column: 7)
!1215 = !DILocation(line: 263, column: 19, scope: !1214)
!1216 = !DILocation(line: 263, column: 7, scope: !1214)
!1217 = !DILocation(line: 263, column: 24, scope: !1214)
!1218 = !DILocation(line: 263, column: 7, scope: !1142)
!1219 = !DILocation(line: 264, column: 5, scope: !1214)
!1220 = !DILocation(line: 265, column: 25, scope: !1142)
!1221 = !DILocation(line: 265, column: 36, scope: !1142)
!1222 = !DILocation(line: 265, column: 12, scope: !1142)
!1223 = !DILocation(line: 265, column: 11, scope: !1142)
!1224 = !DILocation(line: 266, column: 7, scope: !1225)
!1225 = distinct !DILexicalBlock(scope: !1142, file: !3, line: 266, column: 7)
!1226 = !DILocation(line: 266, column: 16, scope: !1225)
!1227 = !DILocation(line: 266, column: 7, scope: !1142)
!1228 = !DILocation(line: 267, column: 5, scope: !1225)
!1229 = !DILocation(line: 268, column: 17, scope: !1142)
!1230 = !DILocation(line: 268, column: 10, scope: !1142)
!1231 = !DILocation(line: 268, column: 9, scope: !1142)
!1232 = !DILocation(line: 269, column: 9, scope: !1233)
!1233 = distinct !DILexicalBlock(scope: !1142, file: !3, line: 269, column: 3)
!1234 = !DILocation(line: 269, column: 8, scope: !1233)
!1235 = !DILocation(line: 269, column: 13, scope: !1236)
!1236 = distinct !DILexicalBlock(scope: !1233, file: !3, line: 269, column: 3)
!1237 = !DILocation(line: 269, column: 22, scope: !1236)
!1238 = !DILocation(line: 269, column: 25, scope: !1236)
!1239 = !DILocation(line: 269, column: 3, scope: !1233)
!1240 = !DILocation(line: 270, column: 16, scope: !1241)
!1241 = distinct !DILexicalBlock(scope: !1236, file: !3, line: 270, column: 9)
!1242 = !DILocation(line: 270, column: 25, scope: !1241)
!1243 = !DILocation(line: 270, column: 9, scope: !1241)
!1244 = !DILocation(line: 270, column: 31, scope: !1241)
!1245 = !DILocation(line: 270, column: 29, scope: !1241)
!1246 = !DILocation(line: 270, column: 9, scope: !1236)
!1247 = !DILocation(line: 271, column: 21, scope: !1241)
!1248 = !DILocation(line: 271, column: 30, scope: !1241)
!1249 = !DILocation(line: 271, column: 14, scope: !1241)
!1250 = !DILocation(line: 271, column: 13, scope: !1241)
!1251 = !DILocation(line: 271, column: 7, scope: !1241)
!1252 = !DILocation(line: 269, column: 44, scope: !1236)
!1253 = !DILocation(line: 269, column: 3, scope: !1236)
!1254 = distinct !{!1254, !1239, !1255}
!1255 = !DILocation(line: 271, column: 32, scope: !1233)
!1256 = !DILocation(line: 272, column: 25, scope: !1142)
!1257 = !DILocation(line: 272, column: 15, scope: !1142)
