; ModuleID = 'magick/magick.c'
source_filename = "magick/magick.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.SemaphoreInfo = type opaque
%struct._SplayTreeInfo = type opaque
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque

!423 = !DIEnumerator(name: "SyncChannels", value: 256, isUnsigned: true)
!424 = !DIEnumerator(name: "DefaultChannels", value: 134217719, isUnsigned: true)
!425 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !426, line: 27, baseType: !7, size: 32, elements: !427)
!426 = !DIFile(filename: "./magick/cache-view.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!427 = !{!428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445}
!428 = !DIEnumerator(name: "UndefinedVirtualPixelMethod", value: 0, isUnsigned: true)
!429 = !DIEnumerator(name: "BackgroundVirtualPixelMethod", value: 1, isUnsigned: true)
!430 = !DIEnumerator(name: "ConstantVirtualPixelMethod", value: 2, isUnsigned: true)
!431 = !DIEnumerator(name: "DitherVirtualPixelMethod", value: 3, isUnsigned: true)
!432 = !DIEnumerator(name: "EdgeVirtualPixelMethod", value: 4, isUnsigned: true)
!433 = !DIEnumerator(name: "MirrorVirtualPixelMethod", value: 5, isUnsigned: true)
!434 = !DIEnumerator(name: "RandomVirtualPixelMethod", value: 6, isUnsigned: true)
!435 = !DIEnumerator(name: "TileVirtualPixelMethod", value: 7, isUnsigned: true)
!436 = !DIEnumerator(name: "TransparentVirtualPixelMethod", value: 8, isUnsigned: true)
!437 = !DIEnumerator(name: "MaskVirtualPixelMethod", value: 9, isUnsigned: true)
!438 = !DIEnumerator(name: "BlackVirtualPixelMethod", value: 10, isUnsigned: true)
!439 = !DIEnumerator(name: "GrayVirtualPixelMethod", value: 11, isUnsigned: true)
!440 = !DIEnumerator(name: "WhiteVirtualPixelMethod", value: 12, isUnsigned: true)
!441 = !DIEnumerator(name: "HorizontalTileVirtualPixelMethod", value: 13, isUnsigned: true)
!442 = !DIEnumerator(name: "VerticalTileVirtualPixelMethod", value: 14, isUnsigned: true)
!443 = !DIEnumerator(name: "HorizontalTileEdgeVirtualPixelMethod", value: 15, isUnsigned: true)
!444 = !DIEnumerator(name: "VerticalTileEdgeVirtualPixelMethod", value: 16, isUnsigned: true)
!445 = !DIEnumerator(name: "CheckerTileVirtualPixelMethod", value: 17, isUnsigned: true)
!446 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !447, line: 28, baseType: !7, size: 32, elements: !448)
!447 = !DIFile(filename: "./magick/magick.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!448 = !{!449, !450, !451}
!449 = !DIEnumerator(name: "UndefinedFormatType", value: 0, isUnsigned: true)
!450 = !DIEnumerator(name: "ImplicitFormatType", value: 1, isUnsigned: true)
!451 = !DIEnumerator(name: "ExplicitFormatType", value: 2, isUnsigned: true)
!452 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !453, line: 34, baseType: !7, size: 32, elements: !454)
!453 = !DIFile(filename: "./magick/log.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!454 = !{!455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476}
!455 = !DIEnumerator(name: "UndefinedEvents", value: 0, isUnsigned: true)
!456 = !DIEnumerator(name: "NoEvents", value: 0, isUnsigned: true)
!457 = !DIEnumerator(name: "TraceEvent", value: 1, isUnsigned: true)
!458 = !DIEnumerator(name: "AnnotateEvent", value: 2, isUnsigned: true)
!459 = !DIEnumerator(name: "BlobEvent", value: 4, isUnsigned: true)
!460 = !DIEnumerator(name: "CacheEvent", value: 8, isUnsigned: true)
!461 = !DIEnumerator(name: "CoderEvent", value: 16, isUnsigned: true)
!462 = !DIEnumerator(name: "ConfigureEvent", value: 32, isUnsigned: true)
!463 = !DIEnumerator(name: "DeprecateEvent", value: 64, isUnsigned: true)
!464 = !DIEnumerator(name: "DrawEvent", value: 128, isUnsigned: true)
!465 = !DIEnumerator(name: "ExceptionEvent", value: 256, isUnsigned: true)
!466 = !DIEnumerator(name: "ImageEvent", value: 512, isUnsigned: true)
!467 = !DIEnumerator(name: "LocaleEvent", value: 1024, isUnsigned: true)
!468 = !DIEnumerator(name: "ModuleEvent", value: 2048, isUnsigned: true)
!469 = !DIEnumerator(name: "PolicyEvent", value: 4096, isUnsigned: true)
!470 = !DIEnumerator(name: "ResourceEvent", value: 8192, isUnsigned: true)
!471 = !DIEnumerator(name: "TransformEvent", value: 16384, isUnsigned: true)
!472 = !DIEnumerator(name: "UserEvent", value: 36864, isUnsigned: true)
!473 = !DIEnumerator(name: "WandEvent", value: 65536, isUnsigned: true)
!474 = !DIEnumerator(name: "X11Event", value: 131072, isUnsigned: true)
!475 = !DIEnumerator(name: "AccelerateEvent", value: 262144, isUnsigned: true)
!476 = !DIEnumerator(name: "AllEvents", value: 2147483647, isUnsigned: true)
!477 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !447, line: 35, baseType: !7, size: 32, elements: !478)
!478 = !{!479, !480, !481}
!479 = !DIEnumerator(name: "NoThreadSupport", value: 0, isUnsigned: true)
!480 = !DIEnumerator(name: "DecoderThreadSupport", value: 1, isUnsigned: true)
!481 = !DIEnumerator(name: "EncoderThreadSupport", value: 2, isUnsigned: true)
!482 = !{!483, !484, !607, !862, !675, !885, !515, !886, !887, !490, !778, !556, !715, !888, !709, !877, !892, !893}
!483 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!485 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !486)
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickInfo", file: !447, line: 103, baseType: !487)
!487 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MagickInfo", file: !447, line: 51, size: 1216, elements: !488)
!488 = !{!489, !492, !493, !494, !495, !496, !848, !856, !861, !868, !869, !870, !871, !872, !873, !874, !876, !878, !879, !881, !882, !883, !884}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !487, file: !447, line: 54, baseType: !490, size: 64)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64)
!491 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !487, file: !447, line: 55, baseType: !490, size: 64, offset: 64)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !487, file: !447, line: 56, baseType: !490, size: 64, offset: 128)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "note", scope: !487, file: !447, line: 57, baseType: !490, size: 64, offset: 192)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "module", scope: !487, file: !447, line: 58, baseType: !490, size: 64, offset: 256)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "image_info", scope: !487, file: !447, line: 61, baseType: !497, size: 64, offset: 320)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64)
!498 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageInfo", file: !6, line: 223, baseType: !499)
!499 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ImageInfo", file: !75, line: 356, size: 134336, elements: !500)
!500 = !{!501, !503, !505, !507, !508, !509, !510, !511, !512, !513, !514, !517, !518, !519, !521, !523, !525, !526, !527, !528, !529, !530, !531, !533, !534, !544, !545, !546, !547, !548, !549, !551, !553, !555, !561, !562, !563, !564, !565, !567, !762, !763, !764, !765, !766, !777, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !845, !846, !847}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !499, file: !75, line: 359, baseType: !502, size: 32)
!502 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompressionType", file: !50, line: 49, baseType: !49)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !499, file: !75, line: 362, baseType: !504, size: 32, offset: 32)
!504 = !DIDerivedType(tag: DW_TAG_typedef, name: "OrientationType", file: !75, line: 86, baseType: !74)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "temporary", scope: !499, file: !75, line: 365, baseType: !506, size: 32, offset: 64)
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickBooleanType", file: !6, line: 215, baseType: !86)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "adjoin", scope: !499, file: !75, line: 366, baseType: !506, size: 32, offset: 96)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "affirm", scope: !499, file: !75, line: 367, baseType: !506, size: 32, offset: 128)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "antialias", scope: !499, file: !75, line: 368, baseType: !506, size: 32, offset: 160)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !499, file: !75, line: 371, baseType: !490, size: 64, offset: 192)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "extract", scope: !499, file: !75, line: 372, baseType: !490, size: 64, offset: 256)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !499, file: !75, line: 373, baseType: !490, size: 64, offset: 320)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "scenes", scope: !499, file: !75, line: 374, baseType: !490, size: 64, offset: 384)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !499, file: !75, line: 377, baseType: !515, size: 64, offset: 448)
!515 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !516, line: 46, baseType: !483)
!516 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!517 = !DIDerivedType(tag: DW_TAG_member, name: "number_scenes", scope: !499, file: !75, line: 378, baseType: !515, size: 64, offset: 512)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !499, file: !75, line: 379, baseType: !515, size: 64, offset: 576)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "interlace", scope: !499, file: !75, line: 382, baseType: !520, size: 32, offset: 640)
!520 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterlaceType", file: !75, line: 73, baseType: !138)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !499, file: !75, line: 385, baseType: !522, size: 32, offset: 672)
!522 = !DIDerivedType(tag: DW_TAG_typedef, name: "EndianType", file: !149, line: 35, baseType: !148)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !499, file: !75, line: 388, baseType: !524, size: 32, offset: 704)
!524 = !DIDerivedType(tag: DW_TAG_typedef, name: "ResolutionType", file: !75, line: 93, baseType: !98)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !499, file: !75, line: 391, baseType: !515, size: 64, offset: 768)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "sampling_factor", scope: !499, file: !75, line: 394, baseType: !490, size: 64, offset: 832)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "server_name", scope: !499, file: !75, line: 395, baseType: !490, size: 64, offset: 896)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "font", scope: !499, file: !75, line: 396, baseType: !490, size: 64, offset: 960)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "texture", scope: !499, file: !75, line: 397, baseType: !490, size: 64, offset: 1024)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "density", scope: !499, file: !75, line: 398, baseType: !490, size: 64, offset: 1088)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "pointsize", scope: !499, file: !75, line: 401, baseType: !532, size: 64, offset: 1152)
!532 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !499, file: !75, line: 402, baseType: !532, size: 64, offset: 1216)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "background_color", scope: !499, file: !75, line: 405, baseType: !535, size: 64, offset: 1280)
!535 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelPacket", file: !328, line: 148, baseType: !536)
!536 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PixelPacket", file: !328, line: 131, size: 64, elements: !537)
!537 = !{!538, !541, !542, !543}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !536, file: !328, line: 143, baseType: !539, size: 16)
!539 = !DIDerivedType(tag: DW_TAG_typedef, name: "Quantum", file: !6, line: 93, baseType: !540)
!540 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !536, file: !328, line: 144, baseType: !539, size: 16, offset: 16)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !536, file: !328, line: 145, baseType: !539, size: 16, offset: 32)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !536, file: !328, line: 146, baseType: !539, size: 16, offset: 48)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !499, file: !75, line: 406, baseType: !535, size: 64, offset: 1344)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "matte_color", scope: !499, file: !75, line: 407, baseType: !535, size: 64, offset: 1408)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !499, file: !75, line: 410, baseType: !506, size: 32, offset: 1472)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "monochrome", scope: !499, file: !75, line: 411, baseType: !506, size: 32, offset: 1504)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !499, file: !75, line: 414, baseType: !515, size: 64, offset: 1536)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !499, file: !75, line: 417, baseType: !550, size: 32, offset: 1600)
!550 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorspaceType", file: !13, line: 61, baseType: !12)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !499, file: !75, line: 420, baseType: !552, size: 32, offset: 1632)
!552 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageType", file: !75, line: 61, baseType: !344)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "preview_type", scope: !499, file: !75, line: 423, baseType: !554, size: 32, offset: 1664)
!554 = !DIDerivedType(tag: DW_TAG_typedef, name: "PreviewType", file: !371, line: 59, baseType: !370)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !499, file: !75, line: 426, baseType: !556, size: 64, offset: 1728)
!556 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !557, line: 77, baseType: !558)
!557 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!558 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !559, line: 193, baseType: !560)
!559 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!560 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "ping", scope: !499, file: !75, line: 429, baseType: !506, size: 32, offset: 1792)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !499, file: !75, line: 430, baseType: !506, size: 32, offset: 1824)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !499, file: !75, line: 433, baseType: !490, size: 64, offset: 1856)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "authenticate", scope: !499, file: !75, line: 434, baseType: !490, size: 64, offset: 1920)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !499, file: !75, line: 437, baseType: !566, size: 32, offset: 1984)
!566 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChannelType", file: !6, line: 202, baseType: !403)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !499, file: !75, line: 440, baseType: !568, size: 64, offset: 2048)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64)
!569 = !DIDerivedType(tag: DW_TAG_typedef, name: "Image", file: !6, line: 221, baseType: !570)
!570 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Image", file: !75, line: 150, size: 105920, elements: !571)
!571 = !{!572, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !586, !587, !588, !589, !590, !604, !606, !608, !609, !610, !611, !612, !613, !614, !615, !623, !624, !625, !626, !627, !628, !630, !631, !632, !634, !636, !638, !640, !641, !642, !643, !644, !645, !646, !654, !669, !683, !684, !685, !686, !690, !694, !698, !699, !700, !701, !702, !720, !721, !723, !724, !734, !735, !737, !738, !739, !740, !741, !742, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !759, !761}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "storage_class", scope: !570, file: !75, line: 153, baseType: !573, size: 32)
!573 = !DIDerivedType(tag: DW_TAG_typedef, name: "ClassType", file: !6, line: 209, baseType: !5)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !570, file: !75, line: 156, baseType: !550, size: 32, offset: 32)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !570, file: !75, line: 159, baseType: !502, size: 32, offset: 64)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !570, file: !75, line: 162, baseType: !515, size: 64, offset: 128)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !570, file: !75, line: 165, baseType: !504, size: 32, offset: 192)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "taint", scope: !570, file: !75, line: 168, baseType: !506, size: 32, offset: 224)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "matte", scope: !570, file: !75, line: 169, baseType: !506, size: 32, offset: 256)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !570, file: !75, line: 172, baseType: !515, size: 64, offset: 320)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !570, file: !75, line: 173, baseType: !515, size: 64, offset: 384)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !570, file: !75, line: 174, baseType: !515, size: 64, offset: 448)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !570, file: !75, line: 175, baseType: !515, size: 64, offset: 512)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "colormap", scope: !570, file: !75, line: 178, baseType: !585, size: 64, offset: 576)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "background_color", scope: !570, file: !75, line: 179, baseType: !535, size: 64, offset: 640)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !570, file: !75, line: 180, baseType: !535, size: 64, offset: 704)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "matte_color", scope: !570, file: !75, line: 181, baseType: !535, size: 64, offset: 768)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !570, file: !75, line: 184, baseType: !532, size: 64, offset: 832)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "chromaticity", scope: !570, file: !75, line: 187, baseType: !591, size: 768, offset: 896)
!591 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChromaticityInfo", file: !75, line: 128, baseType: !592)
!592 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ChromaticityInfo", file: !75, line: 121, size: 768, elements: !593)
!593 = !{!594, !601, !602, !603}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "red_primary", scope: !592, file: !75, line: 124, baseType: !595, size: 192)
!595 = !DIDerivedType(tag: DW_TAG_typedef, name: "PrimaryInfo", file: !75, line: 101, baseType: !596)
!596 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PrimaryInfo", file: !75, line: 95, size: 192, elements: !597)
!597 = !{!598, !599, !600}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !596, file: !75, line: 98, baseType: !532, size: 64)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !596, file: !75, line: 99, baseType: !532, size: 64, offset: 64)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !596, file: !75, line: 100, baseType: !532, size: 64, offset: 128)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "green_primary", scope: !592, file: !75, line: 125, baseType: !595, size: 192, offset: 192)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "blue_primary", scope: !592, file: !75, line: 126, baseType: !595, size: 192, offset: 384)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "white_point", scope: !592, file: !75, line: 127, baseType: !595, size: 192, offset: 576)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "rendering_intent", scope: !570, file: !75, line: 190, baseType: !605, size: 32, offset: 1664)
!605 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderingIntent", file: !91, line: 49, baseType: !90)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !570, file: !75, line: 193, baseType: !607, size: 64, offset: 1728)
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !570, file: !75, line: 196, baseType: !524, size: 32, offset: 1792)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "montage", scope: !570, file: !75, line: 199, baseType: !490, size: 64, offset: 1856)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "directory", scope: !570, file: !75, line: 200, baseType: !490, size: 64, offset: 1920)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "geometry", scope: !570, file: !75, line: 201, baseType: !490, size: 64, offset: 1984)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !570, file: !75, line: 204, baseType: !556, size: 64, offset: 2048)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "x_resolution", scope: !570, file: !75, line: 207, baseType: !532, size: 64, offset: 2112)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "y_resolution", scope: !570, file: !75, line: 208, baseType: !532, size: 64, offset: 2176)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !570, file: !75, line: 211, baseType: !616, size: 256, offset: 2240)
!616 = !DIDerivedType(tag: DW_TAG_typedef, name: "RectangleInfo", file: !155, line: 130, baseType: !617)
!617 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_RectangleInfo", file: !155, line: 121, size: 256, elements: !618)
!618 = !{!619, !620, !621, !622}
!619 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !617, file: !155, line: 124, baseType: !515, size: 64)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !617, file: !155, line: 125, baseType: !515, size: 64, offset: 64)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !617, file: !155, line: 128, baseType: !556, size: 64, offset: 128)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !617, file: !155, line: 129, baseType: !556, size: 64, offset: 192)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "extract_info", scope: !570, file: !75, line: 212, baseType: !616, size: 256, offset: 2496)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "tile_info", scope: !570, file: !75, line: 213, baseType: !616, size: 256, offset: 2752)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "bias", scope: !570, file: !75, line: 216, baseType: !532, size: 64, offset: 3008)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "blur", scope: !570, file: !75, line: 217, baseType: !532, size: 64, offset: 3072)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !570, file: !75, line: 218, baseType: !532, size: 64, offset: 3136)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !570, file: !75, line: 221, baseType: !629, size: 32, offset: 3200)
!629 = !DIDerivedType(tag: DW_TAG_typedef, name: "FilterTypes", file: !104, line: 66, baseType: !103)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "interlace", scope: !570, file: !75, line: 224, baseType: !520, size: 32, offset: 3232)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !570, file: !75, line: 227, baseType: !522, size: 32, offset: 3264)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !570, file: !75, line: 230, baseType: !633, size: 32, offset: 3296)
!633 = !DIDerivedType(tag: DW_TAG_typedef, name: "GravityType", file: !155, line: 91, baseType: !154)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !570, file: !75, line: 233, baseType: !635, size: 32, offset: 3328)
!635 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompositeOperator", file: !170, line: 99, baseType: !169)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "dispose", scope: !570, file: !75, line: 236, baseType: !637, size: 32, offset: 3360)
!637 = !DIDerivedType(tag: DW_TAG_typedef, name: "DisposeType", file: !241, line: 32, baseType: !240)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "clip_mask", scope: !570, file: !75, line: 239, baseType: !639, size: 64, offset: 3392)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 64)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !570, file: !75, line: 242, baseType: !515, size: 64, offset: 3456)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !570, file: !75, line: 243, baseType: !515, size: 64, offset: 3520)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_second", scope: !570, file: !75, line: 246, baseType: !556, size: 64, offset: 3584)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "iterations", scope: !570, file: !75, line: 249, baseType: !515, size: 64, offset: 3648)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "total_colors", scope: !570, file: !75, line: 250, baseType: !515, size: 64, offset: 3712)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "start_loop", scope: !570, file: !75, line: 253, baseType: !556, size: 64, offset: 3776)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !570, file: !75, line: 256, baseType: !647, size: 192, offset: 3840)
!647 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErrorInfo", file: !648, line: 68, baseType: !649)
!648 = !DIFile(filename: "./magick/color.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!649 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ErrorInfo", file: !648, line: 62, size: 192, elements: !650)
!650 = !{!651, !652, !653}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "mean_error_per_pixel", scope: !649, file: !648, line: 65, baseType: !532, size: 64)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_mean_error", scope: !649, file: !648, line: 66, baseType: !532, size: 64, offset: 64)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_maximum_error", scope: !649, file: !648, line: 67, baseType: !532, size: 64, offset: 128)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !570, file: !75, line: 259, baseType: !655, size: 512, offset: 4032)
!655 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerInfo", file: !249, line: 51, baseType: !656)
!656 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TimerInfo", file: !249, line: 40, size: 512, elements: !657)
!657 = !{!658, !665, !666, !668}
!658 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !656, file: !249, line: 43, baseType: !659, size: 192)
!659 = !DIDerivedType(tag: DW_TAG_typedef, name: "Timer", file: !249, line: 38, baseType: !660)
!660 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Timer", file: !249, line: 32, size: 192, elements: !661)
!661 = !{!662, !663, !664}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !660, file: !249, line: 35, baseType: !532, size: 64)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !660, file: !249, line: 36, baseType: !532, size: 64, offset: 64)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !660, file: !249, line: 37, baseType: !532, size: 64, offset: 128)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "elapsed", scope: !656, file: !249, line: 44, baseType: !659, size: 192, offset: 192)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !656, file: !249, line: 47, baseType: !667, size: 32, offset: 384)
!667 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerState", file: !249, line: 30, baseType: !248)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !656, file: !249, line: 50, baseType: !515, size: 64, offset: 448)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !570, file: !75, line: 262, baseType: !670, size: 64, offset: 4544)
!670 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickProgressMonitor", file: !671, line: 26, baseType: !672)
!671 = !DIFile(filename: "./magick/monitor.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 64)
!673 = !DISubroutineType(types: !674)
!674 = !{!506, !675, !677, !680, !607}
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !676, size: 64)
!676 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !491)
!677 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !678)
!678 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickOffsetType", file: !6, line: 150, baseType: !679)
!679 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!680 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !681)
!681 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickSizeType", file: !6, line: 151, baseType: !682)
!682 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !570, file: !75, line: 265, baseType: !607, size: 64, offset: 4608)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !570, file: !75, line: 266, baseType: !607, size: 64, offset: 4672)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !570, file: !75, line: 267, baseType: !607, size: 64, offset: 4736)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "ascii85", scope: !570, file: !75, line: 270, baseType: !687, size: 64, offset: 4800)
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 64)
!688 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ascii85Info", file: !50, line: 52, baseType: !689)
!689 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Ascii85Info", file: !50, line: 51, flags: DIFlagFwdDecl)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !570, file: !75, line: 273, baseType: !691, size: 64, offset: 4864)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 64)
!692 = !DIDerivedType(tag: DW_TAG_typedef, name: "BlobInfo", file: !6, line: 217, baseType: !693)
!693 = !DICompositeType(tag: DW_TAG_structure_type, name: "_BlobInfo", file: !6, line: 217, flags: DIFlagFwdDecl)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !570, file: !75, line: 276, baseType: !695, size: 32768, offset: 4928)
!695 = !DICompositeType(tag: DW_TAG_array_type, baseType: !491, size: 32768, elements: !696)
!696 = !{!697}
!697 = !DISubrange(count: 4096)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "magick_filename", scope: !570, file: !75, line: 277, baseType: !695, size: 32768, offset: 37696)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !570, file: !75, line: 278, baseType: !695, size: 32768, offset: 70464)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "magick_columns", scope: !570, file: !75, line: 281, baseType: !515, size: 64, offset: 103232)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "magick_rows", scope: !570, file: !75, line: 282, baseType: !515, size: 64, offset: 103296)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "exception", scope: !570, file: !75, line: 285, baseType: !703, size: 448, offset: 103360)
!703 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionInfo", file: !6, line: 219, baseType: !704)
!704 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ExceptionInfo", file: !255, line: 102, size: 448, elements: !705)
!705 = !{!706, !708, !710, !711, !712, !713, !714, !719}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "severity", scope: !704, file: !255, line: 105, baseType: !707, size: 32)
!707 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionType", file: !255, line: 100, baseType: !254)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "error_number", scope: !704, file: !255, line: 108, baseType: !709, size: 32, offset: 32)
!709 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !704, file: !255, line: 111, baseType: !490, size: 64, offset: 64)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !704, file: !255, line: 112, baseType: !490, size: 64, offset: 128)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "exceptions", scope: !704, file: !255, line: 115, baseType: !607, size: 64, offset: 192)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "relinquish", scope: !704, file: !255, line: 118, baseType: !506, size: 32, offset: 256)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !704, file: !255, line: 121, baseType: !715, size: 64, offset: 320)
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 64)
!716 = !DIDerivedType(tag: DW_TAG_typedef, name: "SemaphoreInfo", file: !717, line: 26, baseType: !718)
!717 = !DIFile(filename: "./magick/semaphore.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!718 = !DICompositeType(tag: DW_TAG_structure_type, name: "SemaphoreInfo", file: !717, line: 25, flags: DIFlagFwdDecl)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !704, file: !255, line: 124, baseType: !515, size: 64, offset: 384)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !570, file: !75, line: 288, baseType: !506, size: 32, offset: 103808)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !570, file: !75, line: 291, baseType: !722, size: 64, offset: 103872)
!722 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !556)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !570, file: !75, line: 294, baseType: !715, size: 64, offset: 103936)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "color_profile", scope: !570, file: !75, line: 297, baseType: !725, size: 256, offset: 104000)
!725 = !DIDerivedType(tag: DW_TAG_typedef, name: "ProfileInfo", file: !91, line: 40, baseType: !726)
!726 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ProfileInfo", file: !91, line: 27, size: 256, elements: !727)
!727 = !{!728, !729, !730, !733}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !726, file: !91, line: 30, baseType: !490, size: 64)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !726, file: !91, line: 33, baseType: !515, size: 64, offset: 64)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !726, file: !91, line: 36, baseType: !731, size: 64, offset: 128)
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !732, size: 64)
!732 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !726, file: !91, line: 39, baseType: !515, size: 64, offset: 192)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "iptc_profile", scope: !570, file: !75, line: 298, baseType: !725, size: 256, offset: 104256)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profile", scope: !570, file: !75, line: 299, baseType: !736, size: 64, offset: 104512)
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 64)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profiles", scope: !570, file: !75, line: 302, baseType: !515, size: 64, offset: 104576)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !570, file: !75, line: 305, baseType: !515, size: 64, offset: 104640)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !570, file: !75, line: 308, baseType: !639, size: 64, offset: 104704)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !570, file: !75, line: 309, baseType: !639, size: 64, offset: 104768)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !570, file: !75, line: 310, baseType: !639, size: 64, offset: 104832)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "interpolate", scope: !570, file: !75, line: 313, baseType: !743, size: 32, offset: 104896)
!743 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterpolatePixelMethod", file: !328, line: 47, baseType: !327)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "black_point_compensation", scope: !570, file: !75, line: 316, baseType: !506, size: 32, offset: 104928)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_color", scope: !570, file: !75, line: 319, baseType: !535, size: 64, offset: 104960)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !570, file: !75, line: 322, baseType: !639, size: 64, offset: 105024)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "tile_offset", scope: !570, file: !75, line: 325, baseType: !616, size: 256, offset: 105088)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !570, file: !75, line: 328, baseType: !607, size: 64, offset: 105344)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "artifacts", scope: !570, file: !75, line: 329, baseType: !607, size: 64, offset: 105408)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !570, file: !75, line: 332, baseType: !552, size: 32, offset: 105472)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !570, file: !75, line: 335, baseType: !506, size: 32, offset: 105504)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !570, file: !75, line: 338, baseType: !681, size: 64, offset: 105536)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "ping", scope: !570, file: !75, line: 341, baseType: !506, size: 32, offset: 105600)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !570, file: !75, line: 344, baseType: !515, size: 64, offset: 105664)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !570, file: !75, line: 347, baseType: !756, size: 64, offset: 105728)
!756 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !757, line: 7, baseType: !758)
!757 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "")
!758 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !559, line: 160, baseType: !560)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "intensity", scope: !570, file: !75, line: 350, baseType: !760, size: 32, offset: 105792)
!760 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelIntensityMethod", file: !328, line: 79, baseType: !358)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !570, file: !75, line: 353, baseType: !515, size: 64, offset: 105856)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !499, file: !75, line: 443, baseType: !607, size: 64, offset: 2112)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !499, file: !75, line: 446, baseType: !670, size: 64, offset: 2176)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !499, file: !75, line: 449, baseType: !607, size: 64, offset: 2240)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !499, file: !75, line: 450, baseType: !607, size: 64, offset: 2304)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !499, file: !75, line: 453, baseType: !767, size: 64, offset: 2368)
!767 = !DIDerivedType(tag: DW_TAG_typedef, name: "StreamHandler", file: !768, line: 26, baseType: !769)
!768 = !DIFile(filename: "./magick/stream.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 64)
!770 = !DISubroutineType(types: !771)
!771 = !{!515, !772, !774, !776}
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 64)
!773 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !569)
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 64)
!775 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!776 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !515)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !499, file: !75, line: 456, baseType: !778, size: 64, offset: 2432)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 64)
!779 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !780, line: 7, baseType: !781)
!780 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!781 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !782, line: 49, size: 1728, elements: !783)
!782 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!783 = !{!784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !799, !801, !802, !803, !805, !806, !808, !812, !815, !817, !820, !823, !824, !825, !826, !827}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !781, file: !782, line: 51, baseType: !709, size: 32)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !781, file: !782, line: 54, baseType: !490, size: 64, offset: 64)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !781, file: !782, line: 55, baseType: !490, size: 64, offset: 128)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !781, file: !782, line: 56, baseType: !490, size: 64, offset: 192)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !781, file: !782, line: 57, baseType: !490, size: 64, offset: 256)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !781, file: !782, line: 58, baseType: !490, size: 64, offset: 320)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !781, file: !782, line: 59, baseType: !490, size: 64, offset: 384)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !781, file: !782, line: 60, baseType: !490, size: 64, offset: 448)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !781, file: !782, line: 61, baseType: !490, size: 64, offset: 512)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !781, file: !782, line: 64, baseType: !490, size: 64, offset: 576)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !781, file: !782, line: 65, baseType: !490, size: 64, offset: 640)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !781, file: !782, line: 66, baseType: !490, size: 64, offset: 704)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !781, file: !782, line: 68, baseType: !797, size: 64, offset: 768)
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !798, size: 64)
!798 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !782, line: 36, flags: DIFlagFwdDecl)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !781, file: !782, line: 70, baseType: !800, size: 64, offset: 832)
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 64)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !781, file: !782, line: 72, baseType: !709, size: 32, offset: 896)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !781, file: !782, line: 73, baseType: !709, size: 32, offset: 928)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !781, file: !782, line: 74, baseType: !804, size: 64, offset: 960)
!804 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !559, line: 152, baseType: !560)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !781, file: !782, line: 77, baseType: !540, size: 16, offset: 1024)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !781, file: !782, line: 78, baseType: !807, size: 8, offset: 1040)
!807 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !781, file: !782, line: 79, baseType: !809, size: 8, offset: 1048)
!809 = !DICompositeType(tag: DW_TAG_array_type, baseType: !491, size: 8, elements: !810)
!810 = !{!811}
!811 = !DISubrange(count: 1)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !781, file: !782, line: 81, baseType: !813, size: 64, offset: 1088)
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 64)
!814 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !782, line: 43, baseType: null)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !781, file: !782, line: 89, baseType: !816, size: 64, offset: 1152)
!816 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !559, line: 153, baseType: !560)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !781, file: !782, line: 91, baseType: !818, size: 64, offset: 1216)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 64)
!819 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !782, line: 37, flags: DIFlagFwdDecl)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !781, file: !782, line: 92, baseType: !821, size: 64, offset: 1280)
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !822, size: 64)
!822 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !782, line: 38, flags: DIFlagFwdDecl)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !781, file: !782, line: 93, baseType: !800, size: 64, offset: 1344)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !781, file: !782, line: 94, baseType: !607, size: 64, offset: 1408)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !781, file: !782, line: 95, baseType: !515, size: 64, offset: 1472)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !781, file: !782, line: 96, baseType: !709, size: 32, offset: 1536)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !781, file: !782, line: 98, baseType: !828, size: 160, offset: 1568)
!828 = !DICompositeType(tag: DW_TAG_array_type, baseType: !491, size: 160, elements: !829)
!829 = !{!830}
!830 = !DISubrange(count: 20)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !499, file: !75, line: 459, baseType: !607, size: 64, offset: 2496)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !499, file: !75, line: 462, baseType: !515, size: 64, offset: 2560)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !499, file: !75, line: 465, baseType: !695, size: 32768, offset: 2624)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "unique", scope: !499, file: !75, line: 466, baseType: !695, size: 32768, offset: 35392)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "zero", scope: !499, file: !75, line: 467, baseType: !695, size: 32768, offset: 68160)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !499, file: !75, line: 468, baseType: !695, size: 32768, offset: 100928)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !499, file: !75, line: 471, baseType: !506, size: 32, offset: 133696)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "tile", scope: !499, file: !75, line: 474, baseType: !490, size: 64, offset: 133760)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "subimage", scope: !499, file: !75, line: 477, baseType: !515, size: 64, offset: 133824)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "subrange", scope: !499, file: !75, line: 478, baseType: !515, size: 64, offset: 133888)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "pen", scope: !499, file: !75, line: 481, baseType: !535, size: 64, offset: 133952)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !499, file: !75, line: 484, baseType: !515, size: 64, offset: 134016)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_pixel_method", scope: !499, file: !75, line: 487, baseType: !844, size: 32, offset: 134080)
!844 = !DIDerivedType(tag: DW_TAG_typedef, name: "VirtualPixelMethod", file: !426, line: 47, baseType: !425)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_color", scope: !499, file: !75, line: 490, baseType: !535, size: 64, offset: 134112)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !499, file: !75, line: 493, baseType: !607, size: 64, offset: 134208)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "synchronize", scope: !499, file: !75, line: 496, baseType: !506, size: 32, offset: 134272)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "decoder", scope: !487, file: !447, line: 64, baseType: !849, size: 64, offset: 384)
!849 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !850, size: 64)
!850 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeImageHandler", file: !447, line: 43, baseType: !851)
!851 = !DISubroutineType(types: !852)
!852 = !{!568, !853, !855}
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !854, size: 64)
!854 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !498)
!855 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !703, size: 64)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "encoder", scope: !487, file: !447, line: 67, baseType: !857, size: 64, offset: 448)
!857 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !858, size: 64)
!858 = !DIDerivedType(tag: DW_TAG_typedef, name: "EncodeImageHandler", file: !447, line: 46, baseType: !859)
!859 = !DISubroutineType(types: !860)
!860 = !{!506, !853, !568}
!861 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !487, file: !447, line: 70, baseType: !862, size: 64, offset: 512)
!862 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !863, size: 64)
!863 = !DIDerivedType(tag: DW_TAG_typedef, name: "IsImageFormatHandler", file: !447, line: 49, baseType: !864)
!864 = !DISubroutineType(types: !865)
!865 = !{!506, !866, !776}
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !867, size: 64)
!867 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !732)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !487, file: !447, line: 73, baseType: !607, size: 64, offset: 576)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "adjoin", scope: !487, file: !447, line: 76, baseType: !506, size: 32, offset: 640)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !487, file: !447, line: 77, baseType: !506, size: 32, offset: 672)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "endian_support", scope: !487, file: !447, line: 78, baseType: !506, size: 32, offset: 704)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "blob_support", scope: !487, file: !447, line: 79, baseType: !506, size: 32, offset: 736)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "seekable_stream", scope: !487, file: !447, line: 80, baseType: !506, size: 32, offset: 768)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "format_type", scope: !487, file: !447, line: 83, baseType: !875, size: 32, offset: 800)
!875 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickFormatType", file: !447, line: 33, baseType: !446)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "thread_support", scope: !487, file: !447, line: 86, baseType: !877, size: 32, offset: 832)
!877 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickStatusType", file: !6, line: 147, baseType: !7)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "stealth", scope: !487, file: !447, line: 89, baseType: !506, size: 32, offset: 864)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !487, file: !447, line: 92, baseType: !880, size: 64, offset: 896)
!880 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !487, file: !447, line: 93, baseType: !880, size: 64, offset: 960)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !487, file: !447, line: 96, baseType: !515, size: 64, offset: 1024)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !487, file: !447, line: 99, baseType: !490, size: 64, offset: 1088)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !487, file: !447, line: 102, baseType: !715, size: 64, offset: 1152)
!885 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64)
!886 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64)
!887 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64)
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 64)
!889 = !DIDerivedType(tag: DW_TAG_typedef, name: "SplayTreeInfo", file: !890, line: 26, baseType: !891)
!890 = !DIFile(filename: "./magick/splay-tree.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!891 = !DICompositeType(tag: DW_TAG_structure_type, name: "_SplayTreeInfo", file: !890, line: 25, flags: DIFlagFwdDecl)
!892 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 64)
!893 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !894, size: 64)
!894 = !DISubroutineType(types: !895)
!895 = !{!607, !607}
!896 = !{!897, !0, !904, !906, !909}
!897 = !DIGlobalVariableExpression(var: !898, expr: !DIExpression())
!898 = distinct !DIGlobalVariable(name: "magick_precision", scope: !899, file: !3, line: 1538, type: !709, isLocal: true, isDefinition: true)
!899 = distinct !DISubprogram(name: "SetMagickPrecision", scope: !3, file: !3, line: 1533, type: !900, scopeLine: 1534, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !903)
!900 = !DISubroutineType(types: !901)
!901 = !{!709, !902}
!902 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !709)
!903 = !{}
!904 = !DIGlobalVariableExpression(var: !905, expr: !DIExpression())
!905 = distinct !DIGlobalVariable(name: "magick_list", scope: !2, file: !3, line: 115, type: !888, isLocal: true, isDefinition: true)
!906 = !DIGlobalVariableExpression(var: !907, expr: !DIExpression())
!907 = distinct !DIGlobalVariable(name: "instantiate_magickcore", scope: !2, file: !3, line: 118, type: !908, isLocal: true, isDefinition: true)
!908 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !506)
!909 = !DIGlobalVariableExpression(var: !910, expr: !DIExpression())
!910 = distinct !DIGlobalVariable(name: "active_mutex", scope: !2, file: !911, line: 40, type: !506, isLocal: true, isDefinition: true)
!911 = !DIFile(filename: "./magick/semaphore-private.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!912 = !{i32 7, !"Dwarf Version", i32 4}
!913 = !{i32 2, !"Debug Info Version", i32 3}
!914 = !{i32 1, !"wchar_size", i32 4}
!915 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!916 = distinct !DISubprogram(name: "GetImageDecoder", scope: !3, file: !3, line: 148, type: !917, scopeLine: 149, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !903)
!917 = !DISubroutineType(types: !918)
!918 = !{!849, !484}
!919 = !DILocalVariable(name: "magick_info", arg: 1, scope: !916, file: !3, line: 148, type: !484)
!920 = !DILocation(line: 148, column: 68, scope: !916)
!921 = !DILocation(line: 150, column: 10, scope: !916)
!922 = !DILocation(line: 153, column: 10, scope: !916)
!923 = !DILocation(line: 153, column: 23, scope: !916)
!924 = !DILocation(line: 153, column: 3, scope: !916)
!925 = distinct !DISubprogram(name: "GetImageEncoder", scope: !3, file: !3, line: 178, type: !926, scopeLine: 179, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !903)
!926 = !DISubroutineType(types: !927)
!927 = !{!857, !484}
!928 = !DILocalVariable(name: "magick_info", arg: 1, scope: !925, file: !3, line: 178, type: !484)
!929 = !DILocation(line: 178, column: 68, scope: !925)
!930 = !DILocation(line: 180, column: 10, scope: !925)
!931 = !DILocation(line: 183, column: 10, scope: !925)
!932 = !DILocation(line: 183, column: 23, scope: !925)
