; ModuleID = 'magick/quantum.c'
source_filename = "magick/quantum.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._QuantumInfo = type { i64, i64, i32, double, double, double, i64, i32, i32, i32, i64, i8**, i64, i32, %struct._QuantumState, %struct.SemaphoreInfo*, i64 }
%struct._QuantumState = type { double, i32, i64, i32* }
%struct.SemaphoreInfo = type opaque
%struct._ImageInfo = type { i32, i32, i32, i32, i32, i32, i8*, i8*, i8*, i8*, i64, i64, i64, i32, i32, i32, i64, i8*, i8*, i8*, i8*, i8*, double, double, %struct._PixelPacket, %struct._PixelPacket, %struct._PixelPacket, i32, i32, i64, i32, i32, i32, i64, i32, i32, i8*, i8*, i32, %struct._Image*, i8*, i32 (i8*, i64, i64, i8*)*, i8*, i8*, i64 (%struct._Image*, i8*, i64)*, %struct._IO_FILE*, i8*, i64, [4096 x i8], [4096 x i8], [4096 x i8], [4096 x i8], i32, i8*, i64, i64, %struct._PixelPacket, i64, i32, %struct._PixelPacket, i8*, i32 }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct._PixelPacket = type { i16, i16, i16, i16 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "mask", scope: !2, file: !3, line: 572, type: !997, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "ResetQuantumState", scope: !3, file: !3, line: 570, type: !4, scopeLine: 571, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !75, retainedNodes: !996)
!3 = !DIFile(filename: "magick/quantum.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !DISubroutineType(types: !5)
!5 = !{null, !6}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "QuantumInfo", file: !8, line: 85, baseType: !9)
!8 = !DIFile(filename: "./magick/quantum.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QuantumInfo", file: !10, line: 42, size: 1216, elements: !11)
!10 = !DIFile(filename: "./magick/quantum-private.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!11 = !{!12, !16, !17, !26, !28, !29, !30, !31, !38, !39, !46, !47, !51, !52, !59, !69, !74}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !9, file: !10, line: 45, baseType: !13, size: 64)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !14, line: 46, baseType: !15)
!14 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!15 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "quantum", scope: !9, file: !10, line: 46, baseType: !13, size: 64, offset: 64)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !9, file: !10, line: 49, baseType: !18, size: 32, offset: 128)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "QuantumFormatType", file: !8, line: 50, baseType: !19)
!19 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !8, line: 44, baseType: !20, size: 32, elements: !21)
!20 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!21 = !{!22, !23, !24, !25}
!22 = !DIEnumerator(name: "UndefinedQuantumFormat", value: 0, isUnsigned: true)
!23 = !DIEnumerator(name: "FloatingPointQuantumFormat", value: 1, isUnsigned: true)
!24 = !DIEnumerator(name: "SignedQuantumFormat", value: 2, isUnsigned: true)
!25 = !DIEnumerator(name: "UnsignedQuantumFormat", value: 3, isUnsigned: true)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "minimum", scope: !9, file: !10, line: 52, baseType: !27, size: 64, offset: 192)
!27 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "maximum", scope: !9, file: !10, line: 53, baseType: !27, size: 64, offset: 256)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !9, file: !10, line: 54, baseType: !27, size: 64, offset: 320)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !9, file: !10, line: 57, baseType: !13, size: 64, offset: 384)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "min_is_white", scope: !9, file: !10, line: 60, baseType: !32, size: 32, offset: 448)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickBooleanType", file: !33, line: 215, baseType: !34)
!33 = !DIFile(filename: "./magick/magick-type.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!34 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !33, line: 211, baseType: !20, size: 32, elements: !35)
!35 = !{!36, !37}
!36 = !DIEnumerator(name: "MagickFalse", value: 0, isUnsigned: true)
!37 = !DIEnumerator(name: "MagickTrue", value: 1, isUnsigned: true)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "pack", scope: !9, file: !10, line: 61, baseType: !32, size: 32, offset: 480)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_type", scope: !9, file: !10, line: 64, baseType: !40, size: 32, offset: 512)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "QuantumAlphaType", file: !8, line: 42, baseType: !41)
!41 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !8, line: 37, baseType: !20, size: 32, elements: !42)
!42 = !{!43, !44, !45}
!43 = !DIEnumerator(name: "UndefinedQuantumAlpha", value: 0, isUnsigned: true)
!44 = !DIEnumerator(name: "AssociatedQuantumAlpha", value: 1, isUnsigned: true)
!45 = !DIEnumerator(name: "DisassociatedQuantumAlpha", value: 2, isUnsigned: true)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "number_threads", scope: !9, file: !10, line: 67, baseType: !13, size: 64, offset: 576)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "pixels", scope: !9, file: !10, line: 70, baseType: !48, size: 64, offset: 640)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!50 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !9, file: !10, line: 73, baseType: !13, size: 64, offset: 704)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !9, file: !10, line: 76, baseType: !53, size: 32, offset: 768)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "EndianType", file: !8, line: 35, baseType: !54)
!54 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !8, line: 30, baseType: !20, size: 32, elements: !55)
!55 = !{!56, !57, !58}
!56 = !DIEnumerator(name: "UndefinedEndian", value: 0, isUnsigned: true)
!57 = !DIEnumerator(name: "LSBEndian", value: 1, isUnsigned: true)
!58 = !DIEnumerator(name: "MSBEndian", value: 2, isUnsigned: true)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !9, file: !10, line: 79, baseType: !60, size: 256, offset: 832)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "QuantumState", file: !10, line: 40, baseType: !61)
!61 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_QuantumState", file: !10, line: 27, size: 256, elements: !62)
!62 = !{!63, !64, !65, !66}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "inverse_scale", scope: !61, file: !10, line: 30, baseType: !27, size: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "pixel", scope: !61, file: !10, line: 33, baseType: !20, size: 32, offset: 64)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !61, file: !10, line: 36, baseType: !13, size: 64, offset: 128)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !61, file: !10, line: 39, baseType: !67, size: 64, offset: 192)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !20)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !9, file: !10, line: 82, baseType: !70, size: 64, offset: 1088)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "SemaphoreInfo", file: !72, line: 26, baseType: !73)
!72 = !DIFile(filename: "./magick/semaphore.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!73 = !DICompositeType(tag: DW_TAG_structure_type, name: "SemaphoreInfo", file: !72, line: 25, flags: DIFlagFwdDecl)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !9, file: !10, line: 85, baseType: !13, size: 64, offset: 1152)
!75 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !76, retainedTypes: !649, globals: !995, splitDebugInlining: false, nameTableKind: None)
!76 = !{!19, !34, !41, !54, !77, !102, !114, !124, !129, !166, !180, !213, !235, !240, !248, !283, !298, !369, !377, !383, !456, !473, !485, !506, !536, !612, !637}
!77 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !78, line: 25, baseType: !20, size: 32, elements: !79)
!78 = !DIFile(filename: "./magick/compress.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!79 = !{!80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101}
!80 = !DIEnumerator(name: "UndefinedCompression", value: 0, isUnsigned: true)
!81 = !DIEnumerator(name: "NoCompression", value: 1, isUnsigned: true)
!82 = !DIEnumerator(name: "BZipCompression", value: 2, isUnsigned: true)
!83 = !DIEnumerator(name: "DXT1Compression", value: 3, isUnsigned: true)
!84 = !DIEnumerator(name: "DXT3Compression", value: 4, isUnsigned: true)
!85 = !DIEnumerator(name: "DXT5Compression", value: 5, isUnsigned: true)
!86 = !DIEnumerator(name: "FaxCompression", value: 6, isUnsigned: true)
!87 = !DIEnumerator(name: "Group4Compression", value: 7, isUnsigned: true)
!88 = !DIEnumerator(name: "JPEGCompression", value: 8, isUnsigned: true)
!89 = !DIEnumerator(name: "JPEG2000Compression", value: 9, isUnsigned: true)
!90 = !DIEnumerator(name: "LosslessJPEGCompression", value: 10, isUnsigned: true)
!91 = !DIEnumerator(name: "LZWCompression", value: 11, isUnsigned: true)
!92 = !DIEnumerator(name: "RLECompression", value: 12, isUnsigned: true)
!93 = !DIEnumerator(name: "ZipCompression", value: 13, isUnsigned: true)
!94 = !DIEnumerator(name: "ZipSCompression", value: 14, isUnsigned: true)
!95 = !DIEnumerator(name: "PizCompression", value: 15, isUnsigned: true)
!96 = !DIEnumerator(name: "Pxr24Compression", value: 16, isUnsigned: true)
!97 = !DIEnumerator(name: "B44Compression", value: 17, isUnsigned: true)
!98 = !DIEnumerator(name: "B44ACompression", value: 18, isUnsigned: true)
!99 = !DIEnumerator(name: "LZMACompression", value: 19, isUnsigned: true)
!100 = !DIEnumerator(name: "JBIG1Compression", value: 20, isUnsigned: true)
!101 = !DIEnumerator(name: "JBIG2Compression", value: 21, isUnsigned: true)
!102 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !103, line: 75, baseType: !20, size: 32, elements: !104)
!103 = !DIFile(filename: "./magick/image.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!104 = !{!105, !106, !107, !108, !109, !110, !111, !112, !113}
!105 = !DIEnumerator(name: "UndefinedOrientation", value: 0, isUnsigned: true)
!106 = !DIEnumerator(name: "TopLeftOrientation", value: 1, isUnsigned: true)
!107 = !DIEnumerator(name: "TopRightOrientation", value: 2, isUnsigned: true)
!108 = !DIEnumerator(name: "BottomRightOrientation", value: 3, isUnsigned: true)
!109 = !DIEnumerator(name: "BottomLeftOrientation", value: 4, isUnsigned: true)
!110 = !DIEnumerator(name: "LeftTopOrientation", value: 5, isUnsigned: true)
!111 = !DIEnumerator(name: "RightTopOrientation", value: 6, isUnsigned: true)
!112 = !DIEnumerator(name: "RightBottomOrientation", value: 7, isUnsigned: true)
!113 = !DIEnumerator(name: "LeftBottomOrientation", value: 8, isUnsigned: true)
!114 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !103, line: 63, baseType: !20, size: 32, elements: !115)
!115 = !{!116, !117, !118, !119, !120, !121, !122, !123}
!116 = !DIEnumerator(name: "UndefinedInterlace", value: 0, isUnsigned: true)
!117 = !DIEnumerator(name: "NoInterlace", value: 1, isUnsigned: true)
!118 = !DIEnumerator(name: "LineInterlace", value: 2, isUnsigned: true)
!119 = !DIEnumerator(name: "PlaneInterlace", value: 3, isUnsigned: true)
!120 = !DIEnumerator(name: "PartitionInterlace", value: 4, isUnsigned: true)
!121 = !DIEnumerator(name: "GIFInterlace", value: 5, isUnsigned: true)
!122 = !DIEnumerator(name: "JPEGInterlace", value: 6, isUnsigned: true)
!123 = !DIEnumerator(name: "PNGInterlace", value: 7, isUnsigned: true)
!124 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !103, line: 88, baseType: !20, size: 32, elements: !125)
!125 = !{!126, !127, !128}
!126 = !DIEnumerator(name: "UndefinedResolution", value: 0, isUnsigned: true)
!127 = !DIEnumerator(name: "PixelsPerInchResolution", value: 1, isUnsigned: true)
!128 = !DIEnumerator(name: "PixelsPerCentimeterResolution", value: 2, isUnsigned: true)
!129 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !130, line: 25, baseType: !20, size: 32, elements: !131)
!130 = !DIFile(filename: "./magick/colorspace.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!131 = !{!132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165}
!132 = !DIEnumerator(name: "UndefinedColorspace", value: 0, isUnsigned: true)
!133 = !DIEnumerator(name: "RGBColorspace", value: 1, isUnsigned: true)
!134 = !DIEnumerator(name: "GRAYColorspace", value: 2, isUnsigned: true)
!135 = !DIEnumerator(name: "TransparentColorspace", value: 3, isUnsigned: true)
!136 = !DIEnumerator(name: "OHTAColorspace", value: 4, isUnsigned: true)
!137 = !DIEnumerator(name: "LabColorspace", value: 5, isUnsigned: true)
!138 = !DIEnumerator(name: "XYZColorspace", value: 6, isUnsigned: true)
!139 = !DIEnumerator(name: "YCbCrColorspace", value: 7, isUnsigned: true)
!140 = !DIEnumerator(name: "YCCColorspace", value: 8, isUnsigned: true)
!141 = !DIEnumerator(name: "YIQColorspace", value: 9, isUnsigned: true)
!142 = !DIEnumerator(name: "YPbPrColorspace", value: 10, isUnsigned: true)
!143 = !DIEnumerator(name: "YUVColorspace", value: 11, isUnsigned: true)
!144 = !DIEnumerator(name: "CMYKColorspace", value: 12, isUnsigned: true)
!145 = !DIEnumerator(name: "sRGBColorspace", value: 13, isUnsigned: true)
!146 = !DIEnumerator(name: "HSBColorspace", value: 14, isUnsigned: true)
!147 = !DIEnumerator(name: "HSLColorspace", value: 15, isUnsigned: true)
!148 = !DIEnumerator(name: "HWBColorspace", value: 16, isUnsigned: true)
!149 = !DIEnumerator(name: "Rec601LumaColorspace", value: 17, isUnsigned: true)
!150 = !DIEnumerator(name: "Rec601YCbCrColorspace", value: 18, isUnsigned: true)
!151 = !DIEnumerator(name: "Rec709LumaColorspace", value: 19, isUnsigned: true)
!152 = !DIEnumerator(name: "Rec709YCbCrColorspace", value: 20, isUnsigned: true)
!153 = !DIEnumerator(name: "LogColorspace", value: 21, isUnsigned: true)
!154 = !DIEnumerator(name: "CMYColorspace", value: 22, isUnsigned: true)
!155 = !DIEnumerator(name: "LuvColorspace", value: 23, isUnsigned: true)
!156 = !DIEnumerator(name: "HCLColorspace", value: 24, isUnsigned: true)
!157 = !DIEnumerator(name: "LCHColorspace", value: 25, isUnsigned: true)
!158 = !DIEnumerator(name: "LMSColorspace", value: 26, isUnsigned: true)
!159 = !DIEnumerator(name: "LCHabColorspace", value: 27, isUnsigned: true)
!160 = !DIEnumerator(name: "LCHuvColorspace", value: 28, isUnsigned: true)
!161 = !DIEnumerator(name: "scRGBColorspace", value: 29, isUnsigned: true)
!162 = !DIEnumerator(name: "HSIColorspace", value: 30, isUnsigned: true)
!163 = !DIEnumerator(name: "HSVColorspace", value: 31, isUnsigned: true)
!164 = !DIEnumerator(name: "HCLpColorspace", value: 32, isUnsigned: true)
!165 = !DIEnumerator(name: "YDbDrColorspace", value: 33, isUnsigned: true)
!166 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !103, line: 47, baseType: !20, size: 32, elements: !167)
!167 = !{!168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179}
!168 = !DIEnumerator(name: "UndefinedType", value: 0, isUnsigned: true)
!169 = !DIEnumerator(name: "BilevelType", value: 1, isUnsigned: true)
!170 = !DIEnumerator(name: "GrayscaleType", value: 2, isUnsigned: true)
!171 = !DIEnumerator(name: "GrayscaleMatteType", value: 3, isUnsigned: true)
!172 = !DIEnumerator(name: "PaletteType", value: 4, isUnsigned: true)
!173 = !DIEnumerator(name: "PaletteMatteType", value: 5, isUnsigned: true)
!174 = !DIEnumerator(name: "TrueColorType", value: 6, isUnsigned: true)
!175 = !DIEnumerator(name: "TrueColorMatteType", value: 7, isUnsigned: true)
!176 = !DIEnumerator(name: "ColorSeparationType", value: 8, isUnsigned: true)
!177 = !DIEnumerator(name: "ColorSeparationMatteType", value: 9, isUnsigned: true)
!178 = !DIEnumerator(name: "OptimizeType", value: 10, isUnsigned: true)
!179 = !DIEnumerator(name: "PaletteBilevelMatteType", value: 11, isUnsigned: true)
!180 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !181, line: 27, baseType: !20, size: 32, elements: !182)
!181 = !DIFile(filename: "./magick/effect.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!182 = !{!183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212}
!183 = !DIEnumerator(name: "UndefinedPreview", value: 0, isUnsigned: true)
!184 = !DIEnumerator(name: "RotatePreview", value: 1, isUnsigned: true)
!185 = !DIEnumerator(name: "ShearPreview", value: 2, isUnsigned: true)
!186 = !DIEnumerator(name: "RollPreview", value: 3, isUnsigned: true)
!187 = !DIEnumerator(name: "HuePreview", value: 4, isUnsigned: true)
!188 = !DIEnumerator(name: "SaturationPreview", value: 5, isUnsigned: true)
!189 = !DIEnumerator(name: "BrightnessPreview", value: 6, isUnsigned: true)
!190 = !DIEnumerator(name: "GammaPreview", value: 7, isUnsigned: true)
!191 = !DIEnumerator(name: "SpiffPreview", value: 8, isUnsigned: true)
!192 = !DIEnumerator(name: "DullPreview", value: 9, isUnsigned: true)
!193 = !DIEnumerator(name: "GrayscalePreview", value: 10, isUnsigned: true)
!194 = !DIEnumerator(name: "QuantizePreview", value: 11, isUnsigned: true)
!195 = !DIEnumerator(name: "DespecklePreview", value: 12, isUnsigned: true)
!196 = !DIEnumerator(name: "ReduceNoisePreview", value: 13, isUnsigned: true)
!197 = !DIEnumerator(name: "AddNoisePreview", value: 14, isUnsigned: true)
!198 = !DIEnumerator(name: "SharpenPreview", value: 15, isUnsigned: true)
!199 = !DIEnumerator(name: "BlurPreview", value: 16, isUnsigned: true)
!200 = !DIEnumerator(name: "ThresholdPreview", value: 17, isUnsigned: true)
!201 = !DIEnumerator(name: "EdgeDetectPreview", value: 18, isUnsigned: true)
!202 = !DIEnumerator(name: "SpreadPreview", value: 19, isUnsigned: true)
!203 = !DIEnumerator(name: "SolarizePreview", value: 20, isUnsigned: true)
!204 = !DIEnumerator(name: "ShadePreview", value: 21, isUnsigned: true)
!205 = !DIEnumerator(name: "RaisePreview", value: 22, isUnsigned: true)
!206 = !DIEnumerator(name: "SegmentPreview", value: 23, isUnsigned: true)
!207 = !DIEnumerator(name: "SwirlPreview", value: 24, isUnsigned: true)
!208 = !DIEnumerator(name: "ImplodePreview", value: 25, isUnsigned: true)
!209 = !DIEnumerator(name: "WavePreview", value: 26, isUnsigned: true)
!210 = !DIEnumerator(name: "OilPaintPreview", value: 27, isUnsigned: true)
!211 = !DIEnumerator(name: "CharcoalDrawingPreview", value: 28, isUnsigned: true)
!212 = !DIEnumerator(name: "JPEGPreview", value: 29, isUnsigned: true)
!213 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !33, line: 177, baseType: !20, size: 32, elements: !214)
!214 = !{!215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234}
!215 = !DIEnumerator(name: "UndefinedChannel", value: 0, isUnsigned: true)
!216 = !DIEnumerator(name: "RedChannel", value: 1, isUnsigned: true)
!217 = !DIEnumerator(name: "GrayChannel", value: 1, isUnsigned: true)
!218 = !DIEnumerator(name: "CyanChannel", value: 1, isUnsigned: true)
!219 = !DIEnumerator(name: "GreenChannel", value: 2, isUnsigned: true)
!220 = !DIEnumerator(name: "MagentaChannel", value: 2, isUnsigned: true)
!221 = !DIEnumerator(name: "BlueChannel", value: 4, isUnsigned: true)
!222 = !DIEnumerator(name: "YellowChannel", value: 4, isUnsigned: true)
!223 = !DIEnumerator(name: "AlphaChannel", value: 8, isUnsigned: true)
!224 = !DIEnumerator(name: "OpacityChannel", value: 8, isUnsigned: true)
!225 = !DIEnumerator(name: "MatteChannel", value: 8, isUnsigned: true)
!226 = !DIEnumerator(name: "BlackChannel", value: 32, isUnsigned: true)
!227 = !DIEnumerator(name: "IndexChannel", value: 32, isUnsigned: true)
!228 = !DIEnumerator(name: "CompositeChannels", value: 47, isUnsigned: true)
!229 = !DIEnumerator(name: "AllChannels", value: 134217727, isUnsigned: true)
!230 = !DIEnumerator(name: "TrueAlphaChannel", value: 64, isUnsigned: true)
!231 = !DIEnumerator(name: "RGBChannels", value: 128, isUnsigned: true)
!232 = !DIEnumerator(name: "GrayChannels", value: 128, isUnsigned: true)
!233 = !DIEnumerator(name: "SyncChannels", value: 256, isUnsigned: true)
!234 = !DIEnumerator(name: "DefaultChannels", value: 134217719, isUnsigned: true)
!235 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !33, line: 204, baseType: !20, size: 32, elements: !236)
!236 = !{!237, !238, !239}
!237 = !DIEnumerator(name: "UndefinedClass", value: 0, isUnsigned: true)
!238 = !DIEnumerator(name: "DirectClass", value: 1, isUnsigned: true)
!239 = !DIEnumerator(name: "PseudoClass", value: 2, isUnsigned: true)
!240 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !241, line: 42, baseType: !20, size: 32, elements: !242)
!241 = !DIFile(filename: "./magick/profile.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!242 = !{!243, !244, !245, !246, !247}
!243 = !DIEnumerator(name: "UndefinedIntent", value: 0, isUnsigned: true)
!244 = !DIEnumerator(name: "SaturationIntent", value: 1, isUnsigned: true)
!245 = !DIEnumerator(name: "PerceptualIntent", value: 2, isUnsigned: true)
!246 = !DIEnumerator(name: "AbsoluteIntent", value: 3, isUnsigned: true)
!247 = !DIEnumerator(name: "RelativeIntent", value: 4, isUnsigned: true)
!248 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !249, line: 32, baseType: !20, size: 32, elements: !250)
!249 = !DIFile(filename: "./magick/resample.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!250 = !{!251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282}
!251 = !DIEnumerator(name: "UndefinedFilter", value: 0, isUnsigned: true)
!252 = !DIEnumerator(name: "PointFilter", value: 1, isUnsigned: true)
!253 = !DIEnumerator(name: "BoxFilter", value: 2, isUnsigned: true)
!254 = !DIEnumerator(name: "TriangleFilter", value: 3, isUnsigned: true)
!255 = !DIEnumerator(name: "HermiteFilter", value: 4, isUnsigned: true)
!256 = !DIEnumerator(name: "HanningFilter", value: 5, isUnsigned: true)
!257 = !DIEnumerator(name: "HammingFilter", value: 6, isUnsigned: true)
!258 = !DIEnumerator(name: "BlackmanFilter", value: 7, isUnsigned: true)
!259 = !DIEnumerator(name: "GaussianFilter", value: 8, isUnsigned: true)
!260 = !DIEnumerator(name: "QuadraticFilter", value: 9, isUnsigned: true)
!261 = !DIEnumerator(name: "CubicFilter", value: 10, isUnsigned: true)
!262 = !DIEnumerator(name: "CatromFilter", value: 11, isUnsigned: true)
!263 = !DIEnumerator(name: "MitchellFilter", value: 12, isUnsigned: true)
!264 = !DIEnumerator(name: "JincFilter", value: 13, isUnsigned: true)
!265 = !DIEnumerator(name: "SincFilter", value: 14, isUnsigned: true)
!266 = !DIEnumerator(name: "SincFastFilter", value: 15, isUnsigned: true)
!267 = !DIEnumerator(name: "KaiserFilter", value: 16, isUnsigned: true)
!268 = !DIEnumerator(name: "WelshFilter", value: 17, isUnsigned: true)
!269 = !DIEnumerator(name: "ParzenFilter", value: 18, isUnsigned: true)
!270 = !DIEnumerator(name: "BohmanFilter", value: 19, isUnsigned: true)
!271 = !DIEnumerator(name: "BartlettFilter", value: 20, isUnsigned: true)
!272 = !DIEnumerator(name: "LagrangeFilter", value: 21, isUnsigned: true)
!273 = !DIEnumerator(name: "LanczosFilter", value: 22, isUnsigned: true)
!274 = !DIEnumerator(name: "LanczosSharpFilter", value: 23, isUnsigned: true)
!275 = !DIEnumerator(name: "Lanczos2Filter", value: 24, isUnsigned: true)
!276 = !DIEnumerator(name: "Lanczos2SharpFilter", value: 25, isUnsigned: true)
!277 = !DIEnumerator(name: "RobidouxFilter", value: 26, isUnsigned: true)
!278 = !DIEnumerator(name: "RobidouxSharpFilter", value: 27, isUnsigned: true)
!279 = !DIEnumerator(name: "CosineFilter", value: 28, isUnsigned: true)
!280 = !DIEnumerator(name: "SplineFilter", value: 29, isUnsigned: true)
!281 = !DIEnumerator(name: "LanczosRadiusFilter", value: 30, isUnsigned: true)
!282 = !DIEnumerator(name: "SentinelFilter", value: 31, isUnsigned: true)
!283 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !284, line: 77, baseType: !20, size: 32, elements: !285)
!284 = !DIFile(filename: "./magick/geometry.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!285 = !{!286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297}
!286 = !DIEnumerator(name: "UndefinedGravity", value: 0, isUnsigned: true)
!287 = !DIEnumerator(name: "ForgetGravity", value: 0, isUnsigned: true)
!288 = !DIEnumerator(name: "NorthWestGravity", value: 1, isUnsigned: true)
!289 = !DIEnumerator(name: "NorthGravity", value: 2, isUnsigned: true)
!290 = !DIEnumerator(name: "NorthEastGravity", value: 3, isUnsigned: true)
!291 = !DIEnumerator(name: "WestGravity", value: 4, isUnsigned: true)
!292 = !DIEnumerator(name: "CenterGravity", value: 5, isUnsigned: true)
!293 = !DIEnumerator(name: "EastGravity", value: 6, isUnsigned: true)
!294 = !DIEnumerator(name: "SouthWestGravity", value: 7, isUnsigned: true)
!295 = !DIEnumerator(name: "SouthGravity", value: 8, isUnsigned: true)
!296 = !DIEnumerator(name: "SouthEastGravity", value: 9, isUnsigned: true)
!297 = !DIEnumerator(name: "StaticGravity", value: 10, isUnsigned: true)
!298 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !299, line: 25, baseType: !20, size: 32, elements: !300)
!299 = !DIFile(filename: "./magick/composite.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!300 = !{!301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368}
!301 = !DIEnumerator(name: "UndefinedCompositeOp", value: 0, isUnsigned: true)
!302 = !DIEnumerator(name: "NoCompositeOp", value: 1, isUnsigned: true)
!303 = !DIEnumerator(name: "ModulusAddCompositeOp", value: 2, isUnsigned: true)
!304 = !DIEnumerator(name: "AtopCompositeOp", value: 3, isUnsigned: true)
!305 = !DIEnumerator(name: "BlendCompositeOp", value: 4, isUnsigned: true)
!306 = !DIEnumerator(name: "BumpmapCompositeOp", value: 5, isUnsigned: true)
!307 = !DIEnumerator(name: "ChangeMaskCompositeOp", value: 6, isUnsigned: true)
!308 = !DIEnumerator(name: "ClearCompositeOp", value: 7, isUnsigned: true)
!309 = !DIEnumerator(name: "ColorBurnCompositeOp", value: 8, isUnsigned: true)
!310 = !DIEnumerator(name: "ColorDodgeCompositeOp", value: 9, isUnsigned: true)
!311 = !DIEnumerator(name: "ColorizeCompositeOp", value: 10, isUnsigned: true)
!312 = !DIEnumerator(name: "CopyBlackCompositeOp", value: 11, isUnsigned: true)
!313 = !DIEnumerator(name: "CopyBlueCompositeOp", value: 12, isUnsigned: true)
!314 = !DIEnumerator(name: "CopyCompositeOp", value: 13, isUnsigned: true)
!315 = !DIEnumerator(name: "CopyCyanCompositeOp", value: 14, isUnsigned: true)
!316 = !DIEnumerator(name: "CopyGreenCompositeOp", value: 15, isUnsigned: true)
!317 = !DIEnumerator(name: "CopyMagentaCompositeOp", value: 16, isUnsigned: true)
!318 = !DIEnumerator(name: "CopyOpacityCompositeOp", value: 17, isUnsigned: true)
!319 = !DIEnumerator(name: "CopyRedCompositeOp", value: 18, isUnsigned: true)
!320 = !DIEnumerator(name: "CopyYellowCompositeOp", value: 19, isUnsigned: true)
!321 = !DIEnumerator(name: "DarkenCompositeOp", value: 20, isUnsigned: true)
!322 = !DIEnumerator(name: "DstAtopCompositeOp", value: 21, isUnsigned: true)
!323 = !DIEnumerator(name: "DstCompositeOp", value: 22, isUnsigned: true)
!324 = !DIEnumerator(name: "DstInCompositeOp", value: 23, isUnsigned: true)
!325 = !DIEnumerator(name: "DstOutCompositeOp", value: 24, isUnsigned: true)
!326 = !DIEnumerator(name: "DstOverCompositeOp", value: 25, isUnsigned: true)
!327 = !DIEnumerator(name: "DifferenceCompositeOp", value: 26, isUnsigned: true)
!328 = !DIEnumerator(name: "DisplaceCompositeOp", value: 27, isUnsigned: true)
!329 = !DIEnumerator(name: "DissolveCompositeOp", value: 28, isUnsigned: true)
!330 = !DIEnumerator(name: "ExclusionCompositeOp", value: 29, isUnsigned: true)
!331 = !DIEnumerator(name: "HardLightCompositeOp", value: 30, isUnsigned: true)
!332 = !DIEnumerator(name: "HueCompositeOp", value: 31, isUnsigned: true)
!333 = !DIEnumerator(name: "InCompositeOp", value: 32, isUnsigned: true)
!334 = !DIEnumerator(name: "LightenCompositeOp", value: 33, isUnsigned: true)
!335 = !DIEnumerator(name: "LinearLightCompositeOp", value: 34, isUnsigned: true)
!336 = !DIEnumerator(name: "LuminizeCompositeOp", value: 35, isUnsigned: true)
!337 = !DIEnumerator(name: "MinusDstCompositeOp", value: 36, isUnsigned: true)
!338 = !DIEnumerator(name: "ModulateCompositeOp", value: 37, isUnsigned: true)
!339 = !DIEnumerator(name: "MultiplyCompositeOp", value: 38, isUnsigned: true)
!340 = !DIEnumerator(name: "OutCompositeOp", value: 39, isUnsigned: true)
!341 = !DIEnumerator(name: "OverCompositeOp", value: 40, isUnsigned: true)
!342 = !DIEnumerator(name: "OverlayCompositeOp", value: 41, isUnsigned: true)
!343 = !DIEnumerator(name: "PlusCompositeOp", value: 42, isUnsigned: true)
!344 = !DIEnumerator(name: "ReplaceCompositeOp", value: 43, isUnsigned: true)
!345 = !DIEnumerator(name: "SaturateCompositeOp", value: 44, isUnsigned: true)
!346 = !DIEnumerator(name: "ScreenCompositeOp", value: 45, isUnsigned: true)
!347 = !DIEnumerator(name: "SoftLightCompositeOp", value: 46, isUnsigned: true)
!348 = !DIEnumerator(name: "SrcAtopCompositeOp", value: 47, isUnsigned: true)
!349 = !DIEnumerator(name: "SrcCompositeOp", value: 48, isUnsigned: true)
!350 = !DIEnumerator(name: "SrcInCompositeOp", value: 49, isUnsigned: true)
!351 = !DIEnumerator(name: "SrcOutCompositeOp", value: 50, isUnsigned: true)
!352 = !DIEnumerator(name: "SrcOverCompositeOp", value: 51, isUnsigned: true)
!353 = !DIEnumerator(name: "ModulusSubtractCompositeOp", value: 52, isUnsigned: true)
!354 = !DIEnumerator(name: "ThresholdCompositeOp", value: 53, isUnsigned: true)
!355 = !DIEnumerator(name: "XorCompositeOp", value: 54, isUnsigned: true)
!356 = !DIEnumerator(name: "DivideDstCompositeOp", value: 55, isUnsigned: true)
!357 = !DIEnumerator(name: "DistortCompositeOp", value: 56, isUnsigned: true)
!358 = !DIEnumerator(name: "BlurCompositeOp", value: 57, isUnsigned: true)
!359 = !DIEnumerator(name: "PegtopLightCompositeOp", value: 58, isUnsigned: true)
!360 = !DIEnumerator(name: "VividLightCompositeOp", value: 59, isUnsigned: true)
!361 = !DIEnumerator(name: "PinLightCompositeOp", value: 60, isUnsigned: true)
!362 = !DIEnumerator(name: "LinearDodgeCompositeOp", value: 61, isUnsigned: true)
!363 = !DIEnumerator(name: "LinearBurnCompositeOp", value: 62, isUnsigned: true)
!364 = !DIEnumerator(name: "MathematicsCompositeOp", value: 63, isUnsigned: true)
!365 = !DIEnumerator(name: "DivideSrcCompositeOp", value: 64, isUnsigned: true)
!366 = !DIEnumerator(name: "MinusSrcCompositeOp", value: 65, isUnsigned: true)
!367 = !DIEnumerator(name: "DarkenIntensityCompositeOp", value: 66, isUnsigned: true)
!368 = !DIEnumerator(name: "LightenIntensityCompositeOp", value: 67, isUnsigned: true)
!369 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !370, line: 25, baseType: !20, size: 32, elements: !371)
!370 = !DIFile(filename: "./magick/layer.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!371 = !{!372, !373, !374, !375, !376}
!372 = !DIEnumerator(name: "UnrecognizedDispose", value: 0, isUnsigned: true)
!373 = !DIEnumerator(name: "UndefinedDispose", value: 0, isUnsigned: true)
!374 = !DIEnumerator(name: "NoneDispose", value: 1, isUnsigned: true)
!375 = !DIEnumerator(name: "BackgroundDispose", value: 2, isUnsigned: true)
!376 = !DIEnumerator(name: "PreviousDispose", value: 3, isUnsigned: true)
!377 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !378, line: 25, baseType: !20, size: 32, elements: !379)
!378 = !DIFile(filename: "./magick/timer.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!379 = !{!380, !381, !382}
!380 = !DIEnumerator(name: "UndefinedTimerState", value: 0, isUnsigned: true)
!381 = !DIEnumerator(name: "StoppedTimerState", value: 1, isUnsigned: true)
!382 = !DIEnumerator(name: "RunningTimerState", value: 2, isUnsigned: true)
!383 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !384, line: 28, baseType: !20, size: 32, elements: !385)
!384 = !DIFile(filename: "./magick/exception.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!385 = !{!386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455}
!386 = !DIEnumerator(name: "UndefinedException", value: 0, isUnsigned: true)
!387 = !DIEnumerator(name: "WarningException", value: 300, isUnsigned: true)
!388 = !DIEnumerator(name: "ResourceLimitWarning", value: 300, isUnsigned: true)
!389 = !DIEnumerator(name: "TypeWarning", value: 305, isUnsigned: true)
!390 = !DIEnumerator(name: "OptionWarning", value: 310, isUnsigned: true)
!391 = !DIEnumerator(name: "DelegateWarning", value: 315, isUnsigned: true)
!392 = !DIEnumerator(name: "MissingDelegateWarning", value: 320, isUnsigned: true)
!393 = !DIEnumerator(name: "CorruptImageWarning", value: 325, isUnsigned: true)
!394 = !DIEnumerator(name: "FileOpenWarning", value: 330, isUnsigned: true)
!395 = !DIEnumerator(name: "BlobWarning", value: 335, isUnsigned: true)
!396 = !DIEnumerator(name: "StreamWarning", value: 340, isUnsigned: true)
!397 = !DIEnumerator(name: "CacheWarning", value: 345, isUnsigned: true)
!398 = !DIEnumerator(name: "CoderWarning", value: 350, isUnsigned: true)
!399 = !DIEnumerator(name: "FilterWarning", value: 352, isUnsigned: true)
!400 = !DIEnumerator(name: "ModuleWarning", value: 355, isUnsigned: true)
!401 = !DIEnumerator(name: "DrawWarning", value: 360, isUnsigned: true)
!402 = !DIEnumerator(name: "ImageWarning", value: 365, isUnsigned: true)
!403 = !DIEnumerator(name: "WandWarning", value: 370, isUnsigned: true)
!404 = !DIEnumerator(name: "RandomWarning", value: 375, isUnsigned: true)
!405 = !DIEnumerator(name: "XServerWarning", value: 380, isUnsigned: true)
!406 = !DIEnumerator(name: "MonitorWarning", value: 385, isUnsigned: true)
!407 = !DIEnumerator(name: "RegistryWarning", value: 390, isUnsigned: true)
!408 = !DIEnumerator(name: "ConfigureWarning", value: 395, isUnsigned: true)
!409 = !DIEnumerator(name: "PolicyWarning", value: 399, isUnsigned: true)
!410 = !DIEnumerator(name: "ErrorException", value: 400, isUnsigned: true)
!411 = !DIEnumerator(name: "ResourceLimitError", value: 400, isUnsigned: true)
!412 = !DIEnumerator(name: "TypeError", value: 405, isUnsigned: true)
!413 = !DIEnumerator(name: "OptionError", value: 410, isUnsigned: true)
!414 = !DIEnumerator(name: "DelegateError", value: 415, isUnsigned: true)
!415 = !DIEnumerator(name: "MissingDelegateError", value: 420, isUnsigned: true)
!416 = !DIEnumerator(name: "CorruptImageError", value: 425, isUnsigned: true)
!417 = !DIEnumerator(name: "FileOpenError", value: 430, isUnsigned: true)
!418 = !DIEnumerator(name: "BlobError", value: 435, isUnsigned: true)
!419 = !DIEnumerator(name: "StreamError", value: 440, isUnsigned: true)
!420 = !DIEnumerator(name: "CacheError", value: 445, isUnsigned: true)
!421 = !DIEnumerator(name: "CoderError", value: 450, isUnsigned: true)
!422 = !DIEnumerator(name: "FilterError", value: 452, isUnsigned: true)
!423 = !DIEnumerator(name: "ModuleError", value: 455, isUnsigned: true)
!424 = !DIEnumerator(name: "DrawError", value: 460, isUnsigned: true)
!425 = !DIEnumerator(name: "ImageError", value: 465, isUnsigned: true)
!426 = !DIEnumerator(name: "WandError", value: 470, isUnsigned: true)
!427 = !DIEnumerator(name: "RandomError", value: 475, isUnsigned: true)
!428 = !DIEnumerator(name: "XServerError", value: 480, isUnsigned: true)
!429 = !DIEnumerator(name: "MonitorError", value: 485, isUnsigned: true)
!430 = !DIEnumerator(name: "RegistryError", value: 490, isUnsigned: true)
!431 = !DIEnumerator(name: "ConfigureError", value: 495, isUnsigned: true)
!432 = !DIEnumerator(name: "PolicyError", value: 499, isUnsigned: true)
!433 = !DIEnumerator(name: "FatalErrorException", value: 700, isUnsigned: true)
!434 = !DIEnumerator(name: "ResourceLimitFatalError", value: 700, isUnsigned: true)
!435 = !DIEnumerator(name: "TypeFatalError", value: 705, isUnsigned: true)
!436 = !DIEnumerator(name: "OptionFatalError", value: 710, isUnsigned: true)
!437 = !DIEnumerator(name: "DelegateFatalError", value: 715, isUnsigned: true)
!438 = !DIEnumerator(name: "MissingDelegateFatalError", value: 720, isUnsigned: true)
!439 = !DIEnumerator(name: "CorruptImageFatalError", value: 725, isUnsigned: true)
!440 = !DIEnumerator(name: "FileOpenFatalError", value: 730, isUnsigned: true)
!441 = !DIEnumerator(name: "BlobFatalError", value: 735, isUnsigned: true)
!442 = !DIEnumerator(name: "StreamFatalError", value: 740, isUnsigned: true)
!443 = !DIEnumerator(name: "CacheFatalError", value: 745, isUnsigned: true)
!444 = !DIEnumerator(name: "CoderFatalError", value: 750, isUnsigned: true)
!445 = !DIEnumerator(name: "FilterFatalError", value: 752, isUnsigned: true)
!446 = !DIEnumerator(name: "ModuleFatalError", value: 755, isUnsigned: true)
!447 = !DIEnumerator(name: "DrawFatalError", value: 760, isUnsigned: true)
!448 = !DIEnumerator(name: "ImageFatalError", value: 765, isUnsigned: true)
!449 = !DIEnumerator(name: "WandFatalError", value: 770, isUnsigned: true)
!450 = !DIEnumerator(name: "RandomFatalError", value: 775, isUnsigned: true)
!451 = !DIEnumerator(name: "XServerFatalError", value: 780, isUnsigned: true)
!452 = !DIEnumerator(name: "MonitorFatalError", value: 785, isUnsigned: true)
!453 = !DIEnumerator(name: "RegistryFatalError", value: 790, isUnsigned: true)
!454 = !DIEnumerator(name: "ConfigureFatalError", value: 795, isUnsigned: true)
!455 = !DIEnumerator(name: "PolicyFatalError", value: 799, isUnsigned: true)
!456 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !457, line: 31, baseType: !20, size: 32, elements: !458)
!457 = !DIFile(filename: "./magick/pixel.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!458 = !{!459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472}
!459 = !DIEnumerator(name: "UndefinedInterpolatePixel", value: 0, isUnsigned: true)
!460 = !DIEnumerator(name: "AverageInterpolatePixel", value: 1, isUnsigned: true)
!461 = !DIEnumerator(name: "BicubicInterpolatePixel", value: 2, isUnsigned: true)
!462 = !DIEnumerator(name: "BilinearInterpolatePixel", value: 3, isUnsigned: true)
!463 = !DIEnumerator(name: "FilterInterpolatePixel", value: 4, isUnsigned: true)
!464 = !DIEnumerator(name: "IntegerInterpolatePixel", value: 5, isUnsigned: true)
!465 = !DIEnumerator(name: "MeshInterpolatePixel", value: 6, isUnsigned: true)
!466 = !DIEnumerator(name: "NearestNeighborInterpolatePixel", value: 7, isUnsigned: true)
!467 = !DIEnumerator(name: "SplineInterpolatePixel", value: 8, isUnsigned: true)
!468 = !DIEnumerator(name: "Average9InterpolatePixel", value: 9, isUnsigned: true)
!469 = !DIEnumerator(name: "Average16InterpolatePixel", value: 10, isUnsigned: true)
!470 = !DIEnumerator(name: "BlendInterpolatePixel", value: 11, isUnsigned: true)
!471 = !DIEnumerator(name: "BackgroundInterpolatePixel", value: 12, isUnsigned: true)
!472 = !DIEnumerator(name: "CatromInterpolatePixel", value: 13, isUnsigned: true)
!473 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !457, line: 67, baseType: !20, size: 32, elements: !474)
!474 = !{!475, !476, !477, !478, !479, !480, !481, !482, !483, !484}
!475 = !DIEnumerator(name: "UndefinedPixelIntensityMethod", value: 0, isUnsigned: true)
!476 = !DIEnumerator(name: "AveragePixelIntensityMethod", value: 1, isUnsigned: true)
!477 = !DIEnumerator(name: "BrightnessPixelIntensityMethod", value: 2, isUnsigned: true)
!478 = !DIEnumerator(name: "LightnessPixelIntensityMethod", value: 3, isUnsigned: true)
!479 = !DIEnumerator(name: "Rec601LumaPixelIntensityMethod", value: 4, isUnsigned: true)
!480 = !DIEnumerator(name: "Rec601LuminancePixelIntensityMethod", value: 5, isUnsigned: true)
!481 = !DIEnumerator(name: "Rec709LumaPixelIntensityMethod", value: 6, isUnsigned: true)
!482 = !DIEnumerator(name: "Rec709LuminancePixelIntensityMethod", value: 7, isUnsigned: true)
!483 = !DIEnumerator(name: "RMSPixelIntensityMethod", value: 8, isUnsigned: true)
!484 = !DIEnumerator(name: "MSPixelIntensityMethod", value: 9, isUnsigned: true)
!485 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !486, line: 27, baseType: !20, size: 32, elements: !487)
!486 = !DIFile(filename: "./magick/cache-view.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!487 = !{!488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505}
!488 = !DIEnumerator(name: "UndefinedVirtualPixelMethod", value: 0, isUnsigned: true)
!489 = !DIEnumerator(name: "BackgroundVirtualPixelMethod", value: 1, isUnsigned: true)
!490 = !DIEnumerator(name: "ConstantVirtualPixelMethod", value: 2, isUnsigned: true)
!491 = !DIEnumerator(name: "DitherVirtualPixelMethod", value: 3, isUnsigned: true)
!492 = !DIEnumerator(name: "EdgeVirtualPixelMethod", value: 4, isUnsigned: true)
!493 = !DIEnumerator(name: "MirrorVirtualPixelMethod", value: 5, isUnsigned: true)
!494 = !DIEnumerator(name: "RandomVirtualPixelMethod", value: 6, isUnsigned: true)
!495 = !DIEnumerator(name: "TileVirtualPixelMethod", value: 7, isUnsigned: true)
!496 = !DIEnumerator(name: "TransparentVirtualPixelMethod", value: 8, isUnsigned: true)
!497 = !DIEnumerator(name: "MaskVirtualPixelMethod", value: 9, isUnsigned: true)
!498 = !DIEnumerator(name: "BlackVirtualPixelMethod", value: 10, isUnsigned: true)
!499 = !DIEnumerator(name: "GrayVirtualPixelMethod", value: 11, isUnsigned: true)
!500 = !DIEnumerator(name: "WhiteVirtualPixelMethod", value: 12, isUnsigned: true)
!501 = !DIEnumerator(name: "HorizontalTileVirtualPixelMethod", value: 13, isUnsigned: true)
!502 = !DIEnumerator(name: "VerticalTileVirtualPixelMethod", value: 14, isUnsigned: true)
!503 = !DIEnumerator(name: "HorizontalTileEdgeVirtualPixelMethod", value: 15, isUnsigned: true)
!504 = !DIEnumerator(name: "VerticalTileEdgeVirtualPixelMethod", value: 16, isUnsigned: true)
!505 = !DIEnumerator(name: "CheckerTileVirtualPixelMethod", value: 17, isUnsigned: true)
!506 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !8, line: 52, baseType: !20, size: 32, elements: !507)
!507 = !{!508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535}
!508 = !DIEnumerator(name: "UndefinedQuantum", value: 0, isUnsigned: true)
!509 = !DIEnumerator(name: "AlphaQuantum", value: 1, isUnsigned: true)
!510 = !DIEnumerator(name: "BlackQuantum", value: 2, isUnsigned: true)
!511 = !DIEnumerator(name: "BlueQuantum", value: 3, isUnsigned: true)
!512 = !DIEnumerator(name: "CMYKAQuantum", value: 4, isUnsigned: true)
!513 = !DIEnumerator(name: "CMYKQuantum", value: 5, isUnsigned: true)
!514 = !DIEnumerator(name: "CyanQuantum", value: 6, isUnsigned: true)
!515 = !DIEnumerator(name: "GrayAlphaQuantum", value: 7, isUnsigned: true)
!516 = !DIEnumerator(name: "GrayQuantum", value: 8, isUnsigned: true)
!517 = !DIEnumerator(name: "GreenQuantum", value: 9, isUnsigned: true)
!518 = !DIEnumerator(name: "IndexAlphaQuantum", value: 10, isUnsigned: true)
!519 = !DIEnumerator(name: "IndexQuantum", value: 11, isUnsigned: true)
!520 = !DIEnumerator(name: "MagentaQuantum", value: 12, isUnsigned: true)
!521 = !DIEnumerator(name: "OpacityQuantum", value: 13, isUnsigned: true)
!522 = !DIEnumerator(name: "RedQuantum", value: 14, isUnsigned: true)
!523 = !DIEnumerator(name: "RGBAQuantum", value: 15, isUnsigned: true)
!524 = !DIEnumerator(name: "BGRAQuantum", value: 16, isUnsigned: true)
!525 = !DIEnumerator(name: "RGBOQuantum", value: 17, isUnsigned: true)
!526 = !DIEnumerator(name: "RGBQuantum", value: 18, isUnsigned: true)
!527 = !DIEnumerator(name: "YellowQuantum", value: 19, isUnsigned: true)
!528 = !DIEnumerator(name: "GrayPadQuantum", value: 20, isUnsigned: true)
!529 = !DIEnumerator(name: "RGBPadQuantum", value: 21, isUnsigned: true)
!530 = !DIEnumerator(name: "CbYCrYQuantum", value: 22, isUnsigned: true)
!531 = !DIEnumerator(name: "CbYCrQuantum", value: 23, isUnsigned: true)
!532 = !DIEnumerator(name: "CbYCrAQuantum", value: 24, isUnsigned: true)
!533 = !DIEnumerator(name: "CMYKOQuantum", value: 25, isUnsigned: true)
!534 = !DIEnumerator(name: "BGRQuantum", value: 26, isUnsigned: true)
!535 = !DIEnumerator(name: "BGROQuantum", value: 27, isUnsigned: true)
!536 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !537, line: 25, baseType: !538, size: 32, elements: !539)
!537 = !DIFile(filename: "./magick/option.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!538 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!539 = !{!540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611}
!540 = !DIEnumerator(name: "MagickUndefinedOptions", value: -1)
!541 = !DIEnumerator(name: "MagickAlignOptions", value: 0)
!542 = !DIEnumerator(name: "MagickAlphaOptions", value: 1)
!543 = !DIEnumerator(name: "MagickBooleanOptions", value: 2)
!544 = !DIEnumerator(name: "MagickCacheOptions", value: 3)
!545 = !DIEnumerator(name: "MagickChannelOptions", value: 4)
!546 = !DIEnumerator(name: "MagickClassOptions", value: 5)
!547 = !DIEnumerator(name: "MagickClipPathOptions", value: 6)
!548 = !DIEnumerator(name: "MagickCoderOptions", value: 7)
!549 = !DIEnumerator(name: "MagickColorOptions", value: 8)
!550 = !DIEnumerator(name: "MagickColorspaceOptions", value: 9)
!551 = !DIEnumerator(name: "MagickCommandOptions", value: 10)
!552 = !DIEnumerator(name: "MagickComposeOptions", value: 11)
!553 = !DIEnumerator(name: "MagickCompressOptions", value: 12)
!554 = !DIEnumerator(name: "MagickConfigureOptions", value: 13)
!555 = !DIEnumerator(name: "MagickDataTypeOptions", value: 14)
!556 = !DIEnumerator(name: "MagickDebugOptions", value: 15)
!557 = !DIEnumerator(name: "MagickDecorateOptions", value: 16)
!558 = !DIEnumerator(name: "MagickDelegateOptions", value: 17)
!559 = !DIEnumerator(name: "MagickDirectionOptions", value: 18)
!560 = !DIEnumerator(name: "MagickDisposeOptions", value: 19)
!561 = !DIEnumerator(name: "MagickDistortOptions", value: 20)
!562 = !DIEnumerator(name: "MagickDitherOptions", value: 21)
!563 = !DIEnumerator(name: "MagickEndianOptions", value: 22)
!564 = !DIEnumerator(name: "MagickEvaluateOptions", value: 23)
!565 = !DIEnumerator(name: "MagickFillRuleOptions", value: 24)
!566 = !DIEnumerator(name: "MagickFilterOptions", value: 25)
!567 = !DIEnumerator(name: "MagickFontOptions", value: 26)
!568 = !DIEnumerator(name: "MagickFontsOptions", value: 27)
!569 = !DIEnumerator(name: "MagickFormatOptions", value: 28)
!570 = !DIEnumerator(name: "MagickFunctionOptions", value: 29)
!571 = !DIEnumerator(name: "MagickGravityOptions", value: 30)
!572 = !DIEnumerator(name: "MagickIntentOptions", value: 31)
!573 = !DIEnumerator(name: "MagickInterlaceOptions", value: 32)
!574 = !DIEnumerator(name: "MagickInterpolateOptions", value: 33)
!575 = !DIEnumerator(name: "MagickKernelOptions", value: 34)
!576 = !DIEnumerator(name: "MagickLayerOptions", value: 35)
!577 = !DIEnumerator(name: "MagickLineCapOptions", value: 36)
!578 = !DIEnumerator(name: "MagickLineJoinOptions", value: 37)
!579 = !DIEnumerator(name: "MagickListOptions", value: 38)
!580 = !DIEnumerator(name: "MagickLocaleOptions", value: 39)
!581 = !DIEnumerator(name: "MagickLogEventOptions", value: 40)
!582 = !DIEnumerator(name: "MagickLogOptions", value: 41)
!583 = !DIEnumerator(name: "MagickMagicOptions", value: 42)
!584 = !DIEnumerator(name: "MagickMethodOptions", value: 43)
!585 = !DIEnumerator(name: "MagickMetricOptions", value: 44)
!586 = !DIEnumerator(name: "MagickMimeOptions", value: 45)
!587 = !DIEnumerator(name: "MagickModeOptions", value: 46)
!588 = !DIEnumerator(name: "MagickModuleOptions", value: 47)
!589 = !DIEnumerator(name: "MagickMorphologyOptions", value: 48)
!590 = !DIEnumerator(name: "MagickNoiseOptions", value: 49)
!591 = !DIEnumerator(name: "MagickOrientationOptions", value: 50)
!592 = !DIEnumerator(name: "MagickPixelIntensityOptions", value: 51)
!593 = !DIEnumerator(name: "MagickPolicyOptions", value: 52)
!594 = !DIEnumerator(name: "MagickPolicyDomainOptions", value: 53)
!595 = !DIEnumerator(name: "MagickPolicyRightsOptions", value: 54)
!596 = !DIEnumerator(name: "MagickPreviewOptions", value: 55)
!597 = !DIEnumerator(name: "MagickPrimitiveOptions", value: 56)
!598 = !DIEnumerator(name: "MagickQuantumFormatOptions", value: 57)
!599 = !DIEnumerator(name: "MagickResolutionOptions", value: 58)
!600 = !DIEnumerator(name: "MagickResourceOptions", value: 59)
!601 = !DIEnumerator(name: "MagickSparseColorOptions", value: 60)
!602 = !DIEnumerator(name: "MagickStatisticOptions", value: 61)
!603 = !DIEnumerator(name: "MagickStorageOptions", value: 62)
!604 = !DIEnumerator(name: "MagickStretchOptions", value: 63)
!605 = !DIEnumerator(name: "MagickStyleOptions", value: 64)
!606 = !DIEnumerator(name: "MagickThresholdOptions", value: 65)
!607 = !DIEnumerator(name: "MagickTypeOptions", value: 66)
!608 = !DIEnumerator(name: "MagickValidateOptions", value: 67)
!609 = !DIEnumerator(name: "MagickVirtualPixelOptions", value: 68)
!610 = !DIEnumerator(name: "MagickComplexOptions", value: 69)
!611 = !DIEnumerator(name: "MagickIntensityOptions", value: 70)
!612 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !613, line: 34, baseType: !20, size: 32, elements: !614)
!613 = !DIFile(filename: "./magick/log.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!614 = !{!615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636}
!615 = !DIEnumerator(name: "UndefinedEvents", value: 0, isUnsigned: true)
!616 = !DIEnumerator(name: "NoEvents", value: 0, isUnsigned: true)
!617 = !DIEnumerator(name: "TraceEvent", value: 1, isUnsigned: true)
!618 = !DIEnumerator(name: "AnnotateEvent", value: 2, isUnsigned: true)
!619 = !DIEnumerator(name: "BlobEvent", value: 4, isUnsigned: true)
!620 = !DIEnumerator(name: "CacheEvent", value: 8, isUnsigned: true)
!621 = !DIEnumerator(name: "CoderEvent", value: 16, isUnsigned: true)
!622 = !DIEnumerator(name: "ConfigureEvent", value: 32, isUnsigned: true)
!623 = !DIEnumerator(name: "DeprecateEvent", value: 64, isUnsigned: true)
!624 = !DIEnumerator(name: "DrawEvent", value: 128, isUnsigned: true)
!625 = !DIEnumerator(name: "ExceptionEvent", value: 256, isUnsigned: true)
!626 = !DIEnumerator(name: "ImageEvent", value: 512, isUnsigned: true)
!627 = !DIEnumerator(name: "LocaleEvent", value: 1024, isUnsigned: true)
!628 = !DIEnumerator(name: "ModuleEvent", value: 2048, isUnsigned: true)
!629 = !DIEnumerator(name: "PolicyEvent", value: 4096, isUnsigned: true)
!630 = !DIEnumerator(name: "ResourceEvent", value: 8192, isUnsigned: true)
!631 = !DIEnumerator(name: "TransformEvent", value: 16384, isUnsigned: true)
!632 = !DIEnumerator(name: "UserEvent", value: 36864, isUnsigned: true)
!633 = !DIEnumerator(name: "WandEvent", value: 65536, isUnsigned: true)
!634 = !DIEnumerator(name: "X11Event", value: 131072, isUnsigned: true)
!635 = !DIEnumerator(name: "AccelerateEvent", value: 262144, isUnsigned: true)
!636 = !DIEnumerator(name: "AllEvents", value: 2147483647, isUnsigned: true)
!637 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !638, line: 25, baseType: !20, size: 32, elements: !639)
!638 = !DIFile(filename: "./magick/resource_.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!639 = !{!640, !641, !642, !643, !644, !645, !646, !647, !648}
!640 = !DIEnumerator(name: "UndefinedResource", value: 0, isUnsigned: true)
!641 = !DIEnumerator(name: "AreaResource", value: 1, isUnsigned: true)
!642 = !DIEnumerator(name: "DiskResource", value: 2, isUnsigned: true)
!643 = !DIEnumerator(name: "FileResource", value: 3, isUnsigned: true)
!644 = !DIEnumerator(name: "MapResource", value: 4, isUnsigned: true)
!645 = !DIEnumerator(name: "MemoryResource", value: 5, isUnsigned: true)
!646 = !DIEnumerator(name: "ThreadResource", value: 6, isUnsigned: true)
!647 = !DIEnumerator(name: "TimeResource", value: 7, isUnsigned: true)
!648 = !DIEnumerator(name: "ThrottleResource", value: 8, isUnsigned: true)
!649 = !{!6, !650, !15, !538, !651, !48, !70, !13, !677, !860, !706, !18, !992, !993, !711, !49}
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64)
!652 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !653)
!653 = !DIDerivedType(tag: DW_TAG_typedef, name: "Image", file: !33, line: 221, baseType: !654)
!654 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Image", file: !103, line: 150, size: 105920, elements: !655)
!655 = !{!656, !658, !660, !662, !663, !665, !666, !667, !668, !669, !670, !671, !682, !683, !684, !685, !686, !700, !702, !703, !705, !708, !709, !710, !716, !717, !718, !726, !727, !728, !729, !730, !731, !733, !735, !736, !738, !740, !742, !744, !745, !746, !747, !748, !749, !750, !758, !773, !787, !788, !789, !790, !794, !798, !802, !803, !804, !805, !806, !819, !820, !822, !823, !831, !832, !834, !835, !836, !837, !838, !839, !841, !842, !843, !844, !845, !846, !847, !849, !850, !851, !852, !853, !857, !859}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "storage_class", scope: !654, file: !103, line: 153, baseType: !657, size: 32)
!657 = !DIDerivedType(tag: DW_TAG_typedef, name: "ClassType", file: !33, line: 209, baseType: !235)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !654, file: !103, line: 156, baseType: !659, size: 32, offset: 32)
!659 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorspaceType", file: !130, line: 61, baseType: !129)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !654, file: !103, line: 159, baseType: !661, size: 32, offset: 64)
!661 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompressionType", file: !78, line: 49, baseType: !77)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !654, file: !103, line: 162, baseType: !13, size: 64, offset: 128)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !654, file: !103, line: 165, baseType: !664, size: 32, offset: 192)
!664 = !DIDerivedType(tag: DW_TAG_typedef, name: "OrientationType", file: !103, line: 86, baseType: !102)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "taint", scope: !654, file: !103, line: 168, baseType: !32, size: 32, offset: 224)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "matte", scope: !654, file: !103, line: 169, baseType: !32, size: 32, offset: 256)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !654, file: !103, line: 172, baseType: !13, size: 64, offset: 320)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !654, file: !103, line: 173, baseType: !13, size: 64, offset: 384)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !654, file: !103, line: 174, baseType: !13, size: 64, offset: 448)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !654, file: !103, line: 175, baseType: !13, size: 64, offset: 512)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "colormap", scope: !654, file: !103, line: 178, baseType: !672, size: 64, offset: 576)
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 64)
!673 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelPacket", file: !457, line: 148, baseType: !674)
!674 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PixelPacket", file: !457, line: 131, size: 64, elements: !675)
!675 = !{!676, !679, !680, !681}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !674, file: !457, line: 143, baseType: !677, size: 16)
!677 = !DIDerivedType(tag: DW_TAG_typedef, name: "Quantum", file: !33, line: 93, baseType: !678)
!678 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !674, file: !457, line: 144, baseType: !677, size: 16, offset: 16)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !674, file: !457, line: 145, baseType: !677, size: 16, offset: 32)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !674, file: !457, line: 146, baseType: !677, size: 16, offset: 48)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "background_color", scope: !654, file: !103, line: 179, baseType: !673, size: 64, offset: 640)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !654, file: !103, line: 180, baseType: !673, size: 64, offset: 704)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "matte_color", scope: !654, file: !103, line: 181, baseType: !673, size: 64, offset: 768)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !654, file: !103, line: 184, baseType: !27, size: 64, offset: 832)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "chromaticity", scope: !654, file: !103, line: 187, baseType: !687, size: 768, offset: 896)
!687 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChromaticityInfo", file: !103, line: 128, baseType: !688)
!688 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ChromaticityInfo", file: !103, line: 121, size: 768, elements: !689)
!689 = !{!690, !697, !698, !699}
!690 = !DIDerivedType(tag: DW_TAG_member, name: "red_primary", scope: !688, file: !103, line: 124, baseType: !691, size: 192)
!691 = !DIDerivedType(tag: DW_TAG_typedef, name: "PrimaryInfo", file: !103, line: 101, baseType: !692)
!692 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PrimaryInfo", file: !103, line: 95, size: 192, elements: !693)
!693 = !{!694, !695, !696}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !692, file: !103, line: 98, baseType: !27, size: 64)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !692, file: !103, line: 99, baseType: !27, size: 64, offset: 64)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !692, file: !103, line: 100, baseType: !27, size: 64, offset: 128)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "green_primary", scope: !688, file: !103, line: 125, baseType: !691, size: 192, offset: 192)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "blue_primary", scope: !688, file: !103, line: 126, baseType: !691, size: 192, offset: 384)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "white_point", scope: !688, file: !103, line: 127, baseType: !691, size: 192, offset: 576)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "rendering_intent", scope: !654, file: !103, line: 190, baseType: !701, size: 32, offset: 1664)
!701 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderingIntent", file: !241, line: 49, baseType: !240)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !654, file: !103, line: 193, baseType: !650, size: 64, offset: 1728)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !654, file: !103, line: 196, baseType: !704, size: 32, offset: 1792)
!704 = !DIDerivedType(tag: DW_TAG_typedef, name: "ResolutionType", file: !103, line: 93, baseType: !124)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "montage", scope: !654, file: !103, line: 199, baseType: !706, size: 64, offset: 1856)
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 64)
!707 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "directory", scope: !654, file: !103, line: 200, baseType: !706, size: 64, offset: 1920)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "geometry", scope: !654, file: !103, line: 201, baseType: !706, size: 64, offset: 1984)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !654, file: !103, line: 204, baseType: !711, size: 64, offset: 2048)
!711 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !712, line: 77, baseType: !713)
!712 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!713 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !714, line: 193, baseType: !715)
!714 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!715 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "x_resolution", scope: !654, file: !103, line: 207, baseType: !27, size: 64, offset: 2112)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "y_resolution", scope: !654, file: !103, line: 208, baseType: !27, size: 64, offset: 2176)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !654, file: !103, line: 211, baseType: !719, size: 256, offset: 2240)
!719 = !DIDerivedType(tag: DW_TAG_typedef, name: "RectangleInfo", file: !284, line: 130, baseType: !720)
!720 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_RectangleInfo", file: !284, line: 121, size: 256, elements: !721)
!721 = !{!722, !723, !724, !725}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !720, file: !284, line: 124, baseType: !13, size: 64)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !720, file: !284, line: 125, baseType: !13, size: 64, offset: 64)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !720, file: !284, line: 128, baseType: !711, size: 64, offset: 128)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !720, file: !284, line: 129, baseType: !711, size: 64, offset: 192)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "extract_info", scope: !654, file: !103, line: 212, baseType: !719, size: 256, offset: 2496)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "tile_info", scope: !654, file: !103, line: 213, baseType: !719, size: 256, offset: 2752)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "bias", scope: !654, file: !103, line: 216, baseType: !27, size: 64, offset: 3008)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "blur", scope: !654, file: !103, line: 217, baseType: !27, size: 64, offset: 3072)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !654, file: !103, line: 218, baseType: !27, size: 64, offset: 3136)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !654, file: !103, line: 221, baseType: !732, size: 32, offset: 3200)
!732 = !DIDerivedType(tag: DW_TAG_typedef, name: "FilterTypes", file: !249, line: 66, baseType: !248)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "interlace", scope: !654, file: !103, line: 224, baseType: !734, size: 32, offset: 3232)
!734 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterlaceType", file: !103, line: 73, baseType: !114)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !654, file: !103, line: 227, baseType: !53, size: 32, offset: 3264)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !654, file: !103, line: 230, baseType: !737, size: 32, offset: 3296)
!737 = !DIDerivedType(tag: DW_TAG_typedef, name: "GravityType", file: !284, line: 91, baseType: !283)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !654, file: !103, line: 233, baseType: !739, size: 32, offset: 3328)
!739 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompositeOperator", file: !299, line: 99, baseType: !298)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "dispose", scope: !654, file: !103, line: 236, baseType: !741, size: 32, offset: 3360)
!741 = !DIDerivedType(tag: DW_TAG_typedef, name: "DisposeType", file: !370, line: 32, baseType: !369)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "clip_mask", scope: !654, file: !103, line: 239, baseType: !743, size: 64, offset: 3392)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !654, file: !103, line: 242, baseType: !13, size: 64, offset: 3456)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !654, file: !103, line: 243, baseType: !13, size: 64, offset: 3520)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_second", scope: !654, file: !103, line: 246, baseType: !711, size: 64, offset: 3584)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "iterations", scope: !654, file: !103, line: 249, baseType: !13, size: 64, offset: 3648)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "total_colors", scope: !654, file: !103, line: 250, baseType: !13, size: 64, offset: 3712)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "start_loop", scope: !654, file: !103, line: 253, baseType: !711, size: 64, offset: 3776)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !654, file: !103, line: 256, baseType: !751, size: 192, offset: 3840)
!751 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErrorInfo", file: !752, line: 68, baseType: !753)
!752 = !DIFile(filename: "./magick/color.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!753 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ErrorInfo", file: !752, line: 62, size: 192, elements: !754)
!754 = !{!755, !756, !757}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "mean_error_per_pixel", scope: !753, file: !752, line: 65, baseType: !27, size: 64)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_mean_error", scope: !753, file: !752, line: 66, baseType: !27, size: 64, offset: 64)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_maximum_error", scope: !753, file: !752, line: 67, baseType: !27, size: 64, offset: 128)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !654, file: !103, line: 259, baseType: !759, size: 512, offset: 4032)
!759 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerInfo", file: !378, line: 51, baseType: !760)
!760 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TimerInfo", file: !378, line: 40, size: 512, elements: !761)
!761 = !{!762, !769, !770, !772}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !760, file: !378, line: 43, baseType: !763, size: 192)
!763 = !DIDerivedType(tag: DW_TAG_typedef, name: "Timer", file: !378, line: 38, baseType: !764)
!764 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Timer", file: !378, line: 32, size: 192, elements: !765)
!765 = !{!766, !767, !768}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !764, file: !378, line: 35, baseType: !27, size: 64)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !764, file: !378, line: 36, baseType: !27, size: 64, offset: 64)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !764, file: !378, line: 37, baseType: !27, size: 64, offset: 128)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "elapsed", scope: !760, file: !378, line: 44, baseType: !763, size: 192, offset: 192)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !760, file: !378, line: 47, baseType: !771, size: 32, offset: 384)
!771 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerState", file: !378, line: 30, baseType: !377)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !760, file: !378, line: 50, baseType: !13, size: 64, offset: 448)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !654, file: !103, line: 262, baseType: !774, size: 64, offset: 4544)
!774 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickProgressMonitor", file: !775, line: 26, baseType: !776)
!775 = !DIFile(filename: "./magick/monitor.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 64)
!777 = !DISubroutineType(types: !778)
!778 = !{!32, !779, !781, !784, !650}
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !780, size: 64)
!780 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !707)
!781 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !782)
!782 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickOffsetType", file: !33, line: 150, baseType: !783)
!783 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!784 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !785)
!785 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickSizeType", file: !33, line: 151, baseType: !786)
!786 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !654, file: !103, line: 265, baseType: !650, size: 64, offset: 4608)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !654, file: !103, line: 266, baseType: !650, size: 64, offset: 4672)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !654, file: !103, line: 267, baseType: !650, size: 64, offset: 4736)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "ascii85", scope: !654, file: !103, line: 270, baseType: !791, size: 64, offset: 4800)
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 64)
!792 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ascii85Info", file: !78, line: 52, baseType: !793)
!793 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Ascii85Info", file: !78, line: 51, flags: DIFlagFwdDecl)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !654, file: !103, line: 273, baseType: !795, size: 64, offset: 4864)
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 64)
!796 = !DIDerivedType(tag: DW_TAG_typedef, name: "BlobInfo", file: !33, line: 217, baseType: !797)
!797 = !DICompositeType(tag: DW_TAG_structure_type, name: "_BlobInfo", file: !33, line: 217, flags: DIFlagFwdDecl)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !654, file: !103, line: 276, baseType: !799, size: 32768, offset: 4928)
!799 = !DICompositeType(tag: DW_TAG_array_type, baseType: !707, size: 32768, elements: !800)
!800 = !{!801}
!801 = !DISubrange(count: 4096)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "magick_filename", scope: !654, file: !103, line: 277, baseType: !799, size: 32768, offset: 37696)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !654, file: !103, line: 278, baseType: !799, size: 32768, offset: 70464)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "magick_columns", scope: !654, file: !103, line: 281, baseType: !13, size: 64, offset: 103232)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "magick_rows", scope: !654, file: !103, line: 282, baseType: !13, size: 64, offset: 103296)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "exception", scope: !654, file: !103, line: 285, baseType: !807, size: 448, offset: 103360)
!807 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionInfo", file: !33, line: 219, baseType: !808)
!808 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ExceptionInfo", file: !384, line: 102, size: 448, elements: !809)
!809 = !{!810, !812, !813, !814, !815, !816, !817, !818}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "severity", scope: !808, file: !384, line: 105, baseType: !811, size: 32)
!811 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionType", file: !384, line: 100, baseType: !383)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "error_number", scope: !808, file: !384, line: 108, baseType: !538, size: 32, offset: 32)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !808, file: !384, line: 111, baseType: !706, size: 64, offset: 64)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !808, file: !384, line: 112, baseType: !706, size: 64, offset: 128)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "exceptions", scope: !808, file: !384, line: 115, baseType: !650, size: 64, offset: 192)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "relinquish", scope: !808, file: !384, line: 118, baseType: !32, size: 32, offset: 256)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !808, file: !384, line: 121, baseType: !70, size: 64, offset: 320)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !808, file: !384, line: 124, baseType: !13, size: 64, offset: 384)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !654, file: !103, line: 288, baseType: !32, size: 32, offset: 103808)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !654, file: !103, line: 291, baseType: !821, size: 64, offset: 103872)
!821 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !711)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !654, file: !103, line: 294, baseType: !70, size: 64, offset: 103936)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "color_profile", scope: !654, file: !103, line: 297, baseType: !824, size: 256, offset: 104000)
!824 = !DIDerivedType(tag: DW_TAG_typedef, name: "ProfileInfo", file: !241, line: 40, baseType: !825)
!825 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ProfileInfo", file: !241, line: 27, size: 256, elements: !826)
!826 = !{!827, !828, !829, !830}
!827 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !825, file: !241, line: 30, baseType: !706, size: 64)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !825, file: !241, line: 33, baseType: !13, size: 64, offset: 64)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !825, file: !241, line: 36, baseType: !49, size: 64, offset: 128)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !825, file: !241, line: 39, baseType: !13, size: 64, offset: 192)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "iptc_profile", scope: !654, file: !103, line: 298, baseType: !824, size: 256, offset: 104256)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profile", scope: !654, file: !103, line: 299, baseType: !833, size: 64, offset: 104512)
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 64)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profiles", scope: !654, file: !103, line: 302, baseType: !13, size: 64, offset: 104576)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !654, file: !103, line: 305, baseType: !13, size: 64, offset: 104640)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !654, file: !103, line: 308, baseType: !743, size: 64, offset: 104704)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !654, file: !103, line: 309, baseType: !743, size: 64, offset: 104768)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !654, file: !103, line: 310, baseType: !743, size: 64, offset: 104832)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "interpolate", scope: !654, file: !103, line: 313, baseType: !840, size: 32, offset: 104896)
!840 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterpolatePixelMethod", file: !457, line: 47, baseType: !456)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "black_point_compensation", scope: !654, file: !103, line: 316, baseType: !32, size: 32, offset: 104928)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_color", scope: !654, file: !103, line: 319, baseType: !673, size: 64, offset: 104960)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !654, file: !103, line: 322, baseType: !743, size: 64, offset: 105024)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "tile_offset", scope: !654, file: !103, line: 325, baseType: !719, size: 256, offset: 105088)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !654, file: !103, line: 328, baseType: !650, size: 64, offset: 105344)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "artifacts", scope: !654, file: !103, line: 329, baseType: !650, size: 64, offset: 105408)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !654, file: !103, line: 332, baseType: !848, size: 32, offset: 105472)
!848 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageType", file: !103, line: 61, baseType: !166)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !654, file: !103, line: 335, baseType: !32, size: 32, offset: 105504)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !654, file: !103, line: 338, baseType: !785, size: 64, offset: 105536)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "ping", scope: !654, file: !103, line: 341, baseType: !32, size: 32, offset: 105600)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !654, file: !103, line: 344, baseType: !13, size: 64, offset: 105664)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !654, file: !103, line: 347, baseType: !854, size: 64, offset: 105728)
!854 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !855, line: 7, baseType: !856)
!855 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "")
!856 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !714, line: 160, baseType: !715)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "intensity", scope: !654, file: !103, line: 350, baseType: !858, size: 32, offset: 105792)
!858 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelIntensityMethod", file: !457, line: 79, baseType: !473)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !654, file: !103, line: 353, baseType: !13, size: 64, offset: 105856)
!860 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !861, size: 64)
!861 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !862)
!862 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageInfo", file: !33, line: 223, baseType: !863)
!863 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ImageInfo", file: !103, line: 356, size: 134336, elements: !864)
!864 = !{!865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !899, !900, !901, !902, !903, !904, !906, !908, !909, !910, !911, !912, !921, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !989, !990, !991}
!865 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !863, file: !103, line: 359, baseType: !661, size: 32)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !863, file: !103, line: 362, baseType: !664, size: 32, offset: 32)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "temporary", scope: !863, file: !103, line: 365, baseType: !32, size: 32, offset: 64)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "adjoin", scope: !863, file: !103, line: 366, baseType: !32, size: 32, offset: 96)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "affirm", scope: !863, file: !103, line: 367, baseType: !32, size: 32, offset: 128)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "antialias", scope: !863, file: !103, line: 368, baseType: !32, size: 32, offset: 160)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !863, file: !103, line: 371, baseType: !706, size: 64, offset: 192)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "extract", scope: !863, file: !103, line: 372, baseType: !706, size: 64, offset: 256)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !863, file: !103, line: 373, baseType: !706, size: 64, offset: 320)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "scenes", scope: !863, file: !103, line: 374, baseType: !706, size: 64, offset: 384)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !863, file: !103, line: 377, baseType: !13, size: 64, offset: 448)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "number_scenes", scope: !863, file: !103, line: 378, baseType: !13, size: 64, offset: 512)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !863, file: !103, line: 379, baseType: !13, size: 64, offset: 576)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "interlace", scope: !863, file: !103, line: 382, baseType: !734, size: 32, offset: 640)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !863, file: !103, line: 385, baseType: !53, size: 32, offset: 672)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !863, file: !103, line: 388, baseType: !704, size: 32, offset: 704)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !863, file: !103, line: 391, baseType: !13, size: 64, offset: 768)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "sampling_factor", scope: !863, file: !103, line: 394, baseType: !706, size: 64, offset: 832)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "server_name", scope: !863, file: !103, line: 395, baseType: !706, size: 64, offset: 896)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "font", scope: !863, file: !103, line: 396, baseType: !706, size: 64, offset: 960)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "texture", scope: !863, file: !103, line: 397, baseType: !706, size: 64, offset: 1024)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "density", scope: !863, file: !103, line: 398, baseType: !706, size: 64, offset: 1088)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "pointsize", scope: !863, file: !103, line: 401, baseType: !27, size: 64, offset: 1152)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !863, file: !103, line: 402, baseType: !27, size: 64, offset: 1216)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "background_color", scope: !863, file: !103, line: 405, baseType: !673, size: 64, offset: 1280)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !863, file: !103, line: 406, baseType: !673, size: 64, offset: 1344)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "matte_color", scope: !863, file: !103, line: 407, baseType: !673, size: 64, offset: 1408)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !863, file: !103, line: 410, baseType: !32, size: 32, offset: 1472)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "monochrome", scope: !863, file: !103, line: 411, baseType: !32, size: 32, offset: 1504)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !863, file: !103, line: 414, baseType: !13, size: 64, offset: 1536)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !863, file: !103, line: 417, baseType: !659, size: 32, offset: 1600)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !863, file: !103, line: 420, baseType: !848, size: 32, offset: 1632)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "preview_type", scope: !863, file: !103, line: 423, baseType: !898, size: 32, offset: 1664)
!898 = !DIDerivedType(tag: DW_TAG_typedef, name: "PreviewType", file: !181, line: 59, baseType: !180)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !863, file: !103, line: 426, baseType: !711, size: 64, offset: 1728)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "ping", scope: !863, file: !103, line: 429, baseType: !32, size: 32, offset: 1792)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !863, file: !103, line: 430, baseType: !32, size: 32, offset: 1824)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !863, file: !103, line: 433, baseType: !706, size: 64, offset: 1856)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "authenticate", scope: !863, file: !103, line: 434, baseType: !706, size: 64, offset: 1920)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !863, file: !103, line: 437, baseType: !905, size: 32, offset: 1984)
!905 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChannelType", file: !33, line: 202, baseType: !213)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !863, file: !103, line: 440, baseType: !907, size: 64, offset: 2048)
!907 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 64)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !863, file: !103, line: 443, baseType: !650, size: 64, offset: 2112)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !863, file: !103, line: 446, baseType: !774, size: 64, offset: 2176)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !863, file: !103, line: 449, baseType: !650, size: 64, offset: 2240)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !863, file: !103, line: 450, baseType: !650, size: 64, offset: 2304)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !863, file: !103, line: 453, baseType: !913, size: 64, offset: 2368)
!913 = !DIDerivedType(tag: DW_TAG_typedef, name: "StreamHandler", file: !914, line: 26, baseType: !915)
!914 = !DIFile(filename: "./magick/stream.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!915 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !916, size: 64)
!916 = !DISubroutineType(types: !917)
!917 = !{!13, !651, !918, !920}
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !919, size: 64)
!919 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!920 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !863, file: !103, line: 456, baseType: !922, size: 64, offset: 2432)
!922 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !923, size: 64)
!923 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !924, line: 7, baseType: !925)
!924 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!925 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !926, line: 49, size: 1728, elements: !927)
!926 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!927 = !{!928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !943, !945, !946, !947, !949, !950, !952, !956, !959, !961, !964, !967, !968, !969, !970, !971}
!928 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !925, file: !926, line: 51, baseType: !538, size: 32)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !925, file: !926, line: 54, baseType: !706, size: 64, offset: 64)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !925, file: !926, line: 55, baseType: !706, size: 64, offset: 128)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !925, file: !926, line: 56, baseType: !706, size: 64, offset: 192)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !925, file: !926, line: 57, baseType: !706, size: 64, offset: 256)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !925, file: !926, line: 58, baseType: !706, size: 64, offset: 320)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !925, file: !926, line: 59, baseType: !706, size: 64, offset: 384)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !925, file: !926, line: 60, baseType: !706, size: 64, offset: 448)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !925, file: !926, line: 61, baseType: !706, size: 64, offset: 512)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !925, file: !926, line: 64, baseType: !706, size: 64, offset: 576)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !925, file: !926, line: 65, baseType: !706, size: 64, offset: 640)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !925, file: !926, line: 66, baseType: !706, size: 64, offset: 704)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !925, file: !926, line: 68, baseType: !941, size: 64, offset: 768)
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 64)
!942 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !926, line: 36, flags: DIFlagFwdDecl)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !925, file: !926, line: 70, baseType: !944, size: 64, offset: 832)
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !925, size: 64)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !925, file: !926, line: 72, baseType: !538, size: 32, offset: 896)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !925, file: !926, line: 73, baseType: !538, size: 32, offset: 928)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !925, file: !926, line: 74, baseType: !948, size: 64, offset: 960)
!948 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !714, line: 152, baseType: !715)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !925, file: !926, line: 77, baseType: !678, size: 16, offset: 1024)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !925, file: !926, line: 78, baseType: !951, size: 8, offset: 1040)
!951 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !925, file: !926, line: 79, baseType: !953, size: 8, offset: 1048)
!953 = !DICompositeType(tag: DW_TAG_array_type, baseType: !707, size: 8, elements: !954)
!954 = !{!955}
!955 = !DISubrange(count: 1)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !925, file: !926, line: 81, baseType: !957, size: 64, offset: 1088)
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 64)
!958 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !926, line: 43, baseType: null)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !925, file: !926, line: 89, baseType: !960, size: 64, offset: 1152)
!960 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !714, line: 153, baseType: !715)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !925, file: !926, line: 91, baseType: !962, size: 64, offset: 1216)
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 64)
!963 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !926, line: 37, flags: DIFlagFwdDecl)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !925, file: !926, line: 92, baseType: !965, size: 64, offset: 1280)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64)
!966 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !926, line: 38, flags: DIFlagFwdDecl)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !925, file: !926, line: 93, baseType: !944, size: 64, offset: 1344)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !925, file: !926, line: 94, baseType: !650, size: 64, offset: 1408)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !925, file: !926, line: 95, baseType: !13, size: 64, offset: 1472)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !925, file: !926, line: 96, baseType: !538, size: 32, offset: 1536)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !925, file: !926, line: 98, baseType: !972, size: 160, offset: 1568)
!972 = !DICompositeType(tag: DW_TAG_array_type, baseType: !707, size: 160, elements: !973)
!973 = !{!974}
!974 = !DISubrange(count: 20)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !863, file: !103, line: 459, baseType: !650, size: 64, offset: 2496)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !863, file: !103, line: 462, baseType: !13, size: 64, offset: 2560)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !863, file: !103, line: 465, baseType: !799, size: 32768, offset: 2624)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "unique", scope: !863, file: !103, line: 466, baseType: !799, size: 32768, offset: 35392)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "zero", scope: !863, file: !103, line: 467, baseType: !799, size: 32768, offset: 68160)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !863, file: !103, line: 468, baseType: !799, size: 32768, offset: 100928)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !863, file: !103, line: 471, baseType: !32, size: 32, offset: 133696)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "tile", scope: !863, file: !103, line: 474, baseType: !706, size: 64, offset: 133760)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "subimage", scope: !863, file: !103, line: 477, baseType: !13, size: 64, offset: 133824)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "subrange", scope: !863, file: !103, line: 478, baseType: !13, size: 64, offset: 133888)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "pen", scope: !863, file: !103, line: 481, baseType: !673, size: 64, offset: 133952)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !863, file: !103, line: 484, baseType: !13, size: 64, offset: 134016)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_pixel_method", scope: !863, file: !103, line: 487, baseType: !988, size: 32, offset: 134080)
!988 = !DIDerivedType(tag: DW_TAG_typedef, name: "VirtualPixelMethod", file: !486, line: 47, baseType: !485)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_color", scope: !863, file: !103, line: 490, baseType: !673, size: 64, offset: 134112)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !863, file: !103, line: 493, baseType: !650, size: 64, offset: 134208)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "synchronize", scope: !863, file: !103, line: 496, baseType: !32, size: 32, offset: 134272)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 64)
!993 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickRealType", file: !33, line: 78, baseType: !994)
!994 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!995 = !{!0}
!996 = !{}
!997 = !DICompositeType(tag: DW_TAG_array_type, baseType: !68, size: 1024, elements: !998)
!998 = !{!999}
!999 = !DISubrange(count: 32)
!1000 = !{i32 7, !"Dwarf Version", i32 4}
!1001 = !{i32 2, !"Debug Info Version", i32 3}
!1002 = !{i32 1, !"wchar_size", i32 4}
!1003 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!1004 = distinct !DISubprogram(name: "AcquireQuantumInfo", scope: !3, file: !3, line: 114, type: !1005, scopeLine: 116, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !75, retainedNodes: !996)
!1005 = !DISubroutineType(types: !1006)
!1006 = !{!6, !860, !907}
!1007 = !DILocalVariable(name: "image_info", arg: 1, scope: !1004, file: !3, line: 114, type: !860)
!1008 = !DILocation(line: 114, column: 63, scope: !1004)
!1009 = !DILocalVariable(name: "image", arg: 2, scope: !1004, file: !3, line: 115, type: !907)
!1010 = !DILocation(line: 115, column: 10, scope: !1004)
!1011 = !DILocalVariable(name: "status", scope: !1004, file: !3, line: 118, type: !32)
!1012 = !DILocation(line: 118, column: 5, scope: !1004)
!1013 = !DILocalVariable(name: "quantum_info", scope: !1004, file: !3, line: 121, type: !6)
!1014 = !DILocation(line: 121, column: 6, scope: !1004)
!1015 = !DILocation(line: 123, column: 32, scope: !1004)
!1016 = !DILocation(line: 123, column: 16, scope: !1004)
!1017 = !DILocation(line: 123, column: 15, scope: !1004)
!1018 = !DILocation(line: 124, column: 7, scope: !1019)
!1019 = distinct !DILexicalBlock(scope: !1004, file: !3, line: 124, column: 7)
!1020 = !DILocation(line: 124, column: 20, scope: !1019)
!1021 = !DILocation(line: 124, column: 7, scope: !1004)
!1022 = !DILocalVariable(name: "message", scope: !1023, file: !3, line: 125, type: !706)
!1023 = distinct !DILexicalBlock(scope: !1019, file: !3, line: 125, column: 5)
!1024 = !DILocation(line: 125, column: 5, scope: !1023)
!1025 = !DILocalVariable(name: "exception", scope: !1023, file: !3, line: 125, type: !807)
!1026 = !DILocation(line: 126, column: 3, scope: !1004)
!1027 = !DILocation(line: 126, column: 17, scope: !1004)
!1028 = !DILocation(line: 126, column: 26, scope: !1004)
!1029 = !DILocation(line: 127, column: 18, scope: !1004)
!1030 = !DILocation(line: 127, column: 29, scope: !1004)
!1031 = !DILocation(line: 127, column: 3, scope: !1004)
!1032 = !DILocation(line: 128, column: 7, scope: !1033)
!1033 = distinct !DILexicalBlock(scope: !1004, file: !3, line: 128, column: 7)
!1034 = !DILocation(line: 128, column: 13, scope: !1033)
!1035 = !DILocation(line: 128, column: 7, scope: !1004)
!1036 = !DILocation(line: 129, column: 12, scope: !1033)
