; ModuleID = 'magick/mime.c'
source_filename = "magick/mime.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._LinkedListInfo = type opaque
%struct.SemaphoreInfo = type opaque
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct._ExceptionInfo = type { i32, i32, i8*, i8*, i8*, i32, %struct.SemaphoreInfo*, i64 }
%struct._StringInfo = type { [4096 x i8], i8*, i64, i64 }
%struct._MimeInfo = type { i8*, i8*, i8*, i8*, i64, i64, i64, i32, i64, i64, i32, i64, i8*, i32, i64 }
%struct._XMLTreeInfo = type opaque

@mime_cache = internal global %struct._LinkedListInfo* null, align 8, !dbg !0
@mime_semaphore = internal global %struct.SemaphoreInfo* null, align 8, !dbg !356
@.str = private unnamed_addr constant [14 x i8] c"magick/mime.c\00", align 1
@.str.1 = private unnamed_addr constant [1 x i8] zeroinitializer, align 1
@.str.2 = private unnamed_addr constant [3 x i8] c"%s\00", align 1
@.str.3 = private unnamed_addr constant [2 x i8] c"*\00", align 1
@.str.4 = private unnamed_addr constant [4 x i8] c"...\00", align 1

!158 = !DIEnumerator(name: "MagickDirectionOptions", value: 18)
!159 = !DIEnumerator(name: "MagickDisposeOptions", value: 19)
!160 = !DIEnumerator(name: "MagickDistortOptions", value: 20)
!161 = !DIEnumerator(name: "MagickDitherOptions", value: 21)
!162 = !DIEnumerator(name: "MagickEndianOptions", value: 22)
!163 = !DIEnumerator(name: "MagickEvaluateOptions", value: 23)
!164 = !DIEnumerator(name: "MagickFillRuleOptions", value: 24)
!165 = !DIEnumerator(name: "MagickFilterOptions", value: 25)
!166 = !DIEnumerator(name: "MagickFontOptions", value: 26)
!167 = !DIEnumerator(name: "MagickFontsOptions", value: 27)
!168 = !DIEnumerator(name: "MagickFormatOptions", value: 28)
!169 = !DIEnumerator(name: "MagickFunctionOptions", value: 29)
!170 = !DIEnumerator(name: "MagickGravityOptions", value: 30)
!171 = !DIEnumerator(name: "MagickIntentOptions", value: 31)
!172 = !DIEnumerator(name: "MagickInterlaceOptions", value: 32)
!173 = !DIEnumerator(name: "MagickInterpolateOptions", value: 33)
!174 = !DIEnumerator(name: "MagickKernelOptions", value: 34)
!175 = !DIEnumerator(name: "MagickLayerOptions", value: 35)
!176 = !DIEnumerator(name: "MagickLineCapOptions", value: 36)
!177 = !DIEnumerator(name: "MagickLineJoinOptions", value: 37)
!178 = !DIEnumerator(name: "MagickListOptions", value: 38)
!179 = !DIEnumerator(name: "MagickLocaleOptions", value: 39)
!180 = !DIEnumerator(name: "MagickLogEventOptions", value: 40)
!181 = !DIEnumerator(name: "MagickLogOptions", value: 41)
!182 = !DIEnumerator(name: "MagickMagicOptions", value: 42)
!183 = !DIEnumerator(name: "MagickMethodOptions", value: 43)
!184 = !DIEnumerator(name: "MagickMetricOptions", value: 44)
!185 = !DIEnumerator(name: "MagickMimeOptions", value: 45)
!186 = !DIEnumerator(name: "MagickModeOptions", value: 46)
!187 = !DIEnumerator(name: "MagickModuleOptions", value: 47)
!188 = !DIEnumerator(name: "MagickMorphologyOptions", value: 48)
!189 = !DIEnumerator(name: "MagickNoiseOptions", value: 49)
!190 = !DIEnumerator(name: "MagickOrientationOptions", value: 50)
!191 = !DIEnumerator(name: "MagickPixelIntensityOptions", value: 51)
!192 = !DIEnumerator(name: "MagickPolicyOptions", value: 52)
!193 = !DIEnumerator(name: "MagickPolicyDomainOptions", value: 53)
!194 = !DIEnumerator(name: "MagickPolicyRightsOptions", value: 54)
!195 = !DIEnumerator(name: "MagickPreviewOptions", value: 55)
!196 = !DIEnumerator(name: "MagickPrimitiveOptions", value: 56)
!197 = !DIEnumerator(name: "MagickQuantumFormatOptions", value: 57)
!198 = !DIEnumerator(name: "MagickResolutionOptions", value: 58)
!199 = !DIEnumerator(name: "MagickResourceOptions", value: 59)
!200 = !DIEnumerator(name: "MagickSparseColorOptions", value: 60)
!201 = !DIEnumerator(name: "MagickStatisticOptions", value: 61)
!202 = !DIEnumerator(name: "MagickStorageOptions", value: 62)
!203 = !DIEnumerator(name: "MagickStretchOptions", value: 63)
!204 = !DIEnumerator(name: "MagickStyleOptions", value: 64)
!205 = !DIEnumerator(name: "MagickThresholdOptions", value: 65)
!206 = !DIEnumerator(name: "MagickTypeOptions", value: 66)
!207 = !DIEnumerator(name: "MagickValidateOptions", value: 67)
!208 = !DIEnumerator(name: "MagickVirtualPixelOptions", value: 68)
!209 = !DIEnumerator(name: "MagickComplexOptions", value: 69)
!210 = !DIEnumerator(name: "MagickIntensityOptions", value: 70)
!211 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !212, line: 46, baseType: !7, size: 32, elements: !213)
!212 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!213 = !{!214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225}
!214 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!215 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!216 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!217 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!218 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!219 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!220 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!221 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!222 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!223 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!224 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!225 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!226 = !{!227, !231, !232, !270, !239, !254, !245, !256, !265, !272, !273, !274, !275, !330, !332, !137, !336, !349, !258, !262, !266, !304, !251}
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "LinkedListInfo", file: !229, line: 34, baseType: !230)
!229 = !DIFile(filename: "./magick/hashmap.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!230 = !DICompositeType(tag: DW_TAG_structure_type, name: "_LinkedListInfo", file: !229, line: 33, flags: DIFlagFwdDecl)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !234)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "MimeInfo", file: !235, line: 26, baseType: !236)
!235 = !DIFile(filename: "./magick/mime.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MimeInfo", file: !3, line: 68, size: 960, elements: !237)
!237 = !{!238, !241, !242, !243, !244, !250, !253, !257, !259, !260, !261, !263, !264, !267, !269}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !236, file: !3, line: 71, baseType: !239, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!240 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !236, file: !3, line: 72, baseType: !239, size: 64, offset: 64)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !236, file: !3, line: 73, baseType: !239, size: 64, offset: 128)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "pattern", scope: !236, file: !3, line: 74, baseType: !239, size: 64, offset: 192)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !236, file: !3, line: 77, baseType: !245, size: 64, offset: 256)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !246, line: 77, baseType: !247)
!246 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !248, line: 193, baseType: !249)
!248 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!249 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !236, file: !3, line: 80, baseType: !251, size: 64, offset: 320)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickOffsetType", file: !6, line: 150, baseType: !252)
!252 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !236, file: !3, line: 83, baseType: !254, size: 64, offset: 384)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !255, line: 46, baseType: !256)
!255 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!256 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "data_type", scope: !236, file: !3, line: 86, baseType: !258, size: 32, offset: 448)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "DataType", file: !85, line: 32, baseType: !84)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !236, file: !3, line: 89, baseType: !245, size: 64, offset: 512)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !236, file: !3, line: 90, baseType: !245, size: 64, offset: 576)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !236, file: !3, line: 93, baseType: !262, size: 32, offset: 640)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "EndianType", file: !93, line: 35, baseType: !92)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !236, file: !3, line: 96, baseType: !254, size: 64, offset: 704)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !236, file: !3, line: 99, baseType: !265, size: 64, offset: 768)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!266 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "stealth", scope: !236, file: !3, line: 102, baseType: !268, size: 32, offset: 832)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickBooleanType", file: !6, line: 215, baseType: !5)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !236, file: !3, line: 105, baseType: !254, size: 64, offset: 896)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !266)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!276 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !277)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !278, line: 7, baseType: !279)
!278 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!279 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !280, line: 49, size: 1728, elements: !281)
!280 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!281 = !{!282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !297, !299, !300, !301, !303, !305, !307, !311, !314, !316, !319, !322, !323, !324, !325, !326}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !279, file: !280, line: 51, baseType: !137, size: 32)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !279, file: !280, line: 54, baseType: !239, size: 64, offset: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !279, file: !280, line: 55, baseType: !239, size: 64, offset: 128)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !279, file: !280, line: 56, baseType: !239, size: 64, offset: 192)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !279, file: !280, line: 57, baseType: !239, size: 64, offset: 256)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !279, file: !280, line: 58, baseType: !239, size: 64, offset: 320)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !279, file: !280, line: 59, baseType: !239, size: 64, offset: 384)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !279, file: !280, line: 60, baseType: !239, size: 64, offset: 448)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !279, file: !280, line: 61, baseType: !239, size: 64, offset: 512)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !279, file: !280, line: 64, baseType: !239, size: 64, offset: 576)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !279, file: !280, line: 65, baseType: !239, size: 64, offset: 640)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !279, file: !280, line: 66, baseType: !239, size: 64, offset: 704)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !279, file: !280, line: 68, baseType: !295, size: 64, offset: 768)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64)
!296 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !280, line: 36, flags: DIFlagFwdDecl)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !279, file: !280, line: 70, baseType: !298, size: 64, offset: 832)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !279, file: !280, line: 72, baseType: !137, size: 32, offset: 896)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !279, file: !280, line: 73, baseType: !137, size: 32, offset: 928)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !279, file: !280, line: 74, baseType: !302, size: 64, offset: 960)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !248, line: 152, baseType: !249)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !279, file: !280, line: 77, baseType: !304, size: 16, offset: 1024)
!304 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !279, file: !280, line: 78, baseType: !306, size: 8, offset: 1040)
!306 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !279, file: !280, line: 79, baseType: !308, size: 8, offset: 1048)
!308 = !DICompositeType(tag: DW_TAG_array_type, baseType: !240, size: 8, elements: !309)
!309 = !{!310}
!310 = !DISubrange(count: 1)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !279, file: !280, line: 81, baseType: !312, size: 64, offset: 1088)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !280, line: 43, baseType: null)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !279, file: !280, line: 89, baseType: !315, size: 64, offset: 1152)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !248, line: 153, baseType: !249)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !279, file: !280, line: 91, baseType: !317, size: 64, offset: 1216)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!318 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !280, line: 37, flags: DIFlagFwdDecl)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !279, file: !280, line: 92, baseType: !320, size: 64, offset: 1280)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64)
!321 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !280, line: 38, flags: DIFlagFwdDecl)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !279, file: !280, line: 93, baseType: !298, size: 64, offset: 1344)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !279, file: !280, line: 94, baseType: !231, size: 64, offset: 1408)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !279, file: !280, line: 95, baseType: !254, size: 64, offset: 1472)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !279, file: !280, line: 96, baseType: !137, size: 32, offset: 1536)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !279, file: !280, line: 98, baseType: !327, size: 160, offset: 1568)
!327 = !DICompositeType(tag: DW_TAG_array_type, baseType: !240, size: 160, elements: !328)
!328 = !{!329}
!329 = !DISubrange(count: 20)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64)
!331 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !240)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "SemaphoreInfo", file: !334, line: 26, baseType: !335)
!334 = !DIFile(filename: "./magick/semaphore.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!335 = !DICompositeType(tag: DW_TAG_structure_type, name: "SemaphoreInfo", file: !334, line: 25, flags: DIFlagFwdDecl)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64)
!337 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !338)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "StringInfo", file: !339, line: 40, baseType: !340)
!339 = !DIFile(filename: "./magick/string_.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!340 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_StringInfo", file: !339, line: 29, size: 32960, elements: !341)
!341 = !{!342, !346, !347, !348}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !340, file: !339, line: 32, baseType: !343, size: 32768)
!343 = !DICompositeType(tag: DW_TAG_array_type, baseType: !240, size: 32768, elements: !344)
!344 = !{!345}
!345 = !DISubrange(count: 4096)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "datum", scope: !340, file: !339, line: 35, baseType: !265, size: 64, offset: 32768)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !340, file: !339, line: 38, baseType: !254, size: 64, offset: 32832)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !340, file: !339, line: 39, baseType: !254, size: 64, offset: 32896)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "XMLTreeInfo", file: !351, line: 29, baseType: !352)
!351 = !DIFile(filename: "./magick/xml-tree.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!352 = !DICompositeType(tag: DW_TAG_structure_type, name: "_XMLTreeInfo", file: !351, line: 28, flags: DIFlagFwdDecl)
!353 = !{!354, !0, !356}
!354 = !DIGlobalVariableExpression(var: !355, expr: !DIExpression())
!355 = distinct !DIGlobalVariable(name: "MimeMap", scope: !2, file: !3, line: 112, type: !330, isLocal: true, isDefinition: true)
!356 = !DIGlobalVariableExpression(var: !357, expr: !DIExpression())
!357 = distinct !DIGlobalVariable(name: "mime_semaphore", scope: !2, file: !3, line: 121, type: !332, isLocal: true, isDefinition: true)
!358 = !{i32 7, !"Dwarf Version", i32 4}
!359 = !{i32 2, !"Debug Info Version", i32 3}
!360 = !{i32 1, !"wchar_size", i32 4}
!361 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!362 = distinct !DISubprogram(name: "LoadMimeLists", scope: !3, file: !3, line: 194, type: !363, scopeLine: 196, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !378)
!363 = !DISubroutineType(types: !364)
!364 = !{!268, !330, !365}
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionInfo", file: !6, line: 219, baseType: !367)
!367 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ExceptionInfo", file: !12, line: 102, size: 448, elements: !368)
!368 = !{!369, !371, !372, !373, !374, !375, !376, !377}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "severity", scope: !367, file: !12, line: 105, baseType: !370, size: 32)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionType", file: !12, line: 100, baseType: !11)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "error_number", scope: !367, file: !12, line: 108, baseType: !137, size: 32, offset: 32)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !367, file: !12, line: 111, baseType: !239, size: 64, offset: 64)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !367, file: !12, line: 112, baseType: !239, size: 64, offset: 128)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "exceptions", scope: !367, file: !12, line: 115, baseType: !231, size: 64, offset: 192)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "relinquish", scope: !367, file: !12, line: 118, baseType: !268, size: 32, offset: 256)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !367, file: !12, line: 121, baseType: !332, size: 64, offset: 320)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !367, file: !12, line: 124, baseType: !254, size: 64, offset: 384)
!378 = !{}
!379 = !DILocalVariable(name: "name", arg: 1, scope: !362, file: !3, line: 194, type: !330)
!380 = !DILocation(line: 194, column: 58, scope: !362)
!381 = !DILocalVariable(name: "exception", arg: 2, scope: !362, file: !3, line: 195, type: !365)
!382 = !DILocation(line: 195, column: 18, scope: !362)
!383 = !DILocation(line: 197, column: 31, scope: !362)
!384 = !DILocation(line: 197, column: 36, scope: !362)
!385 = !DILocation(line: 197, column: 14, scope: !362)
!386 = !DILocation(line: 197, column: 13, scope: !362)
!387 = !DILocation(line: 198, column: 10, scope: !362)
!388 = !DILocation(line: 198, column: 21, scope: !362)
!389 = !DILocation(line: 198, column: 3, scope: !362)
!390 = distinct !DISubprogram(name: "AcquireMimeCache", scope: !3, file: !3, line: 157, type: !391, scopeLine: 159, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !378)
!391 = !DISubroutineType(types: !392)
!392 = !{!227, !330, !365}
!393 = !DILocalVariable(name: "filename", arg: 1, scope: !390, file: !3, line: 157, type: !330)
!394 = !DILocation(line: 157, column: 53, scope: !390)
!395 = !DILocalVariable(name: "exception", arg: 2, scope: !390, file: !3, line: 158, type: !365)
!396 = !DILocation(line: 158, column: 18, scope: !390)
!397 = !DILocalVariable(name: "mime_cache", scope: !390, file: !3, line: 161, type: !227)
!398 = !DILocation(line: 161, column: 6, scope: !390)
!399 = !DILocalVariable(name: "status", scope: !390, file: !3, line: 164, type: !400)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickStatusType", file: !6, line: 147, baseType: !7)
!401 = !DILocation(line: 164, column: 5, scope: !390)
!402 = !DILocation(line: 166, column: 14, scope: !390)
!403 = !DILocation(line: 166, column: 13, scope: !390)
!404 = !DILocation(line: 167, column: 7, scope: !405)
!405 = distinct !DILexicalBlock(scope: !390, file: !3, line: 167, column: 7)
!406 = !DILocation(line: 167, column: 18, scope: !405)
!407 = !DILocation(line: 167, column: 7, scope: !390)
!408 = !DILocalVariable(name: "message", scope: !409, file: !3, line: 168, type: !239)
!409 = distinct !DILexicalBlock(scope: !405, file: !3, line: 168, column: 5)
!410 = !DILocation(line: 168, column: 5, scope: !409)
!411 = !DILocalVariable(name: "exception", scope: !409, file: !3, line: 168, type: !366)
!412 = !DILocation(line: 169, column: 9, scope: !390)
!413 = !DILocalVariable(name: "option", scope: !414, file: !3, line: 173, type: !336)
!414 = distinct !DILexicalBlock(scope: !390, file: !3, line: 171, column: 3)
!415 = !DILocation(line: 173, column: 8, scope: !414)
!416 = !DILocalVariable(name: "options", scope: !414, file: !3, line: 176, type: !227)
!417 = !DILocation(line: 176, column: 8, scope: !414)
!418 = !DILocation(line: 178, column: 33, scope: !414)
!419 = !DILocation(line: 178, column: 42, scope: !414)
!420 = !DILocation(line: 178, column: 13, scope: !414)
!421 = !DILocation(line: 178, column: 12, scope: !414)
!422 = !DILocation(line: 179, column: 58, scope: !414)
!423 = !DILocation(line: 179, column: 33, scope: !414)
!424 = !DILocation(line: 179, column: 12, scope: !414)
!425 = !DILocation(line: 179, column: 11, scope: !414)
!426 = !DILocation(line: 180, column: 5, scope: !414)
!427 = !DILocation(line: 180, column: 12, scope: !414)
!428 = !DILocation(line: 180, column: 19, scope: !414)
!429 = !DILocation(line: 182, column: 29, scope: !430)
!430 = distinct !DILexicalBlock(scope: !414, file: !3, line: 181, column: 5)
!431 = !DILocation(line: 183, column: 28, scope: !430)
!432 = !DILocation(line: 183, column: 9, scope: !430)
!433 = !DILocation(line: 183, column: 54, scope: !430)
!434 = !DILocation(line: 183, column: 36, scope: !430)
!435 = !DILocation(line: 183, column: 64, scope: !430)
!436 = !DILocation(line: 182, column: 15, scope: !430)
!437 = !DILocation(line: 182, column: 13, scope: !430)
