; ModuleID = 'magick/monitor.c'
source_filename = "magick/monitor.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._Image = type { i32, i32, i32, i64, i32, i32, i32, i64, i64, i64, i64, %struct._PixelPacket*, %struct._PixelPacket, %struct._PixelPacket, %struct._PixelPacket, double, %struct._ChromaticityInfo, i32, i8*, i32, i8*, i8*, i8*, i64, double, double, %struct._RectangleInfo, %struct._RectangleInfo, %struct._RectangleInfo, double, double, double, i32, i32, i32, i32, i32, i32, %struct._Image*, i64, i64, i64, i64, i64, i64, %struct._ErrorInfo, %struct._TimerInfo, i32 (i8*, i64, i64, i8*)*, i8*, i8*, i8*, %struct._Ascii85Info*, %struct._BlobInfo*, [4096 x i8], [4096 x i8], [4096 x i8], i64, i64, %struct._ExceptionInfo, i32, i64, %struct.SemaphoreInfo*, %struct._ProfileInfo, %struct._ProfileInfo, %struct._ProfileInfo*, i64, i64, %struct._Image*, %struct._Image*, %struct._Image*, i32, i32, %struct._PixelPacket, %struct._Image*, %struct._RectangleInfo, i8*, i8*, i32, i32, i64, i32, i64, i64, i32, i64 }
%struct._ChromaticityInfo = type { %struct._PrimaryInfo, %struct._PrimaryInfo, %struct._PrimaryInfo, %struct._PrimaryInfo }
%struct._PrimaryInfo = type { double, double, double }
%struct._ErrorInfo = type { double, double, double }
%struct._TimerInfo = type { %struct._Timer, %struct._Timer, i32, i64 }
%struct._Timer = type { double, double, double }

!408 = !DIEnumerator(name: "MagentaChannel", value: 2, isUnsigned: true)
!409 = !DIEnumerator(name: "BlueChannel", value: 4, isUnsigned: true)
!410 = !DIEnumerator(name: "YellowChannel", value: 4, isUnsigned: true)
!411 = !DIEnumerator(name: "AlphaChannel", value: 8, isUnsigned: true)
!412 = !DIEnumerator(name: "OpacityChannel", value: 8, isUnsigned: true)
!413 = !DIEnumerator(name: "MatteChannel", value: 8, isUnsigned: true)
!414 = !DIEnumerator(name: "BlackChannel", value: 32, isUnsigned: true)
!415 = !DIEnumerator(name: "IndexChannel", value: 32, isUnsigned: true)
!416 = !DIEnumerator(name: "CompositeChannels", value: 47, isUnsigned: true)
!417 = !DIEnumerator(name: "AllChannels", value: 134217727, isUnsigned: true)
!418 = !DIEnumerator(name: "TrueAlphaChannel", value: 64, isUnsigned: true)
!419 = !DIEnumerator(name: "RGBChannels", value: 128, isUnsigned: true)
!420 = !DIEnumerator(name: "GrayChannels", value: 128, isUnsigned: true)
!421 = !DIEnumerator(name: "SyncChannels", value: 256, isUnsigned: true)
!422 = !DIEnumerator(name: "DefaultChannels", value: 134217719, isUnsigned: true)
!423 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !424, line: 27, baseType: !5, size: 32, elements: !425)
!424 = !DIFile(filename: "./magick/cache-view.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!425 = !{!426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443}
!426 = !DIEnumerator(name: "UndefinedVirtualPixelMethod", value: 0, isUnsigned: true)
!427 = !DIEnumerator(name: "BackgroundVirtualPixelMethod", value: 1, isUnsigned: true)
!428 = !DIEnumerator(name: "ConstantVirtualPixelMethod", value: 2, isUnsigned: true)
!429 = !DIEnumerator(name: "DitherVirtualPixelMethod", value: 3, isUnsigned: true)
!430 = !DIEnumerator(name: "EdgeVirtualPixelMethod", value: 4, isUnsigned: true)
!431 = !DIEnumerator(name: "MirrorVirtualPixelMethod", value: 5, isUnsigned: true)
!432 = !DIEnumerator(name: "RandomVirtualPixelMethod", value: 6, isUnsigned: true)
!433 = !DIEnumerator(name: "TileVirtualPixelMethod", value: 7, isUnsigned: true)
!434 = !DIEnumerator(name: "TransparentVirtualPixelMethod", value: 8, isUnsigned: true)
!435 = !DIEnumerator(name: "MaskVirtualPixelMethod", value: 9, isUnsigned: true)
!436 = !DIEnumerator(name: "BlackVirtualPixelMethod", value: 10, isUnsigned: true)
!437 = !DIEnumerator(name: "GrayVirtualPixelMethod", value: 11, isUnsigned: true)
!438 = !DIEnumerator(name: "WhiteVirtualPixelMethod", value: 12, isUnsigned: true)
!439 = !DIEnumerator(name: "HorizontalTileVirtualPixelMethod", value: 13, isUnsigned: true)
!440 = !DIEnumerator(name: "VerticalTileVirtualPixelMethod", value: 14, isUnsigned: true)
!441 = !DIEnumerator(name: "HorizontalTileEdgeVirtualPixelMethod", value: 15, isUnsigned: true)
!442 = !DIEnumerator(name: "VerticalTileEdgeVirtualPixelMethod", value: 16, isUnsigned: true)
!443 = !DIEnumerator(name: "CheckerTileVirtualPixelMethod", value: 17, isUnsigned: true)
!444 = !{i32 7, !"Dwarf Version", i32 4}
!445 = !{i32 2, !"Debug Info Version", i32 3}
!446 = !{i32 1, !"wchar_size", i32 4}
!447 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!448 = distinct !DISubprogram(name: "SetImageProgressMonitor", scope: !1, file: !1, line: 85, type: !449, scopeLine: 87, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !674)
!449 = !DISubroutineType(types: !450)
!450 = !{!451, !467, !673, !466}
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickProgressMonitor", file: !452, line: 26, baseType: !453)
!452 = !DIFile(filename: "./magick/monitor.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!454 = !DISubroutineType(types: !455)
!455 = !{!456, !457, !460, !463, !466}
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickBooleanType", file: !4, line: 215, baseType: !3)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !459)
!459 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!460 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !461)
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickOffsetType", file: !4, line: 150, baseType: !462)
!462 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!463 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !464)
!464 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickSizeType", file: !4, line: 151, baseType: !465)
!465 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64)
!468 = !DIDerivedType(tag: DW_TAG_typedef, name: "Image", file: !4, line: 221, baseType: !469)
!469 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Image", file: !77, line: 150, size: 105920, elements: !470)
!470 = !{!471, !473, !475, !477, !481, !483, !484, !485, !486, !487, !488, !489, !500, !501, !502, !503, !505, !519, !521, !522, !524, !526, !527, !528, !534, !535, !536, !544, !545, !546, !547, !548, !549, !551, !553, !555, !557, !559, !561, !563, !564, !565, !566, !567, !568, !569, !577, !592, !593, !594, !595, !596, !600, !604, !608, !609, !610, !611, !612, !630, !631, !633, !634, !644, !645, !647, !648, !649, !650, !651, !652, !654, !655, !656, !657, !658, !659, !660, !662, !663, !664, !665, !666, !670, !672}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "storage_class", scope: !469, file: !77, line: 153, baseType: !472, size: 32)
!472 = !DIDerivedType(tag: DW_TAG_typedef, name: "ClassType", file: !4, line: 209, baseType: !9)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !469, file: !77, line: 156, baseType: !474, size: 32, offset: 32)
!474 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorspaceType", file: !15, line: 61, baseType: !14)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !469, file: !77, line: 159, baseType: !476, size: 32, offset: 64)
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompressionType", file: !52, line: 49, baseType: !51)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !469, file: !77, line: 162, baseType: !478, size: 64, offset: 128)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !479, line: 46, baseType: !480)
!479 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!480 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !469, file: !77, line: 165, baseType: !482, size: 32, offset: 192)
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "OrientationType", file: !77, line: 86, baseType: !76)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "taint", scope: !469, file: !77, line: 168, baseType: !456, size: 32, offset: 224)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "matte", scope: !469, file: !77, line: 169, baseType: !456, size: 32, offset: 256)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !469, file: !77, line: 172, baseType: !478, size: 64, offset: 320)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !469, file: !77, line: 173, baseType: !478, size: 64, offset: 384)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !469, file: !77, line: 174, baseType: !478, size: 64, offset: 448)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !469, file: !77, line: 175, baseType: !478, size: 64, offset: 512)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "colormap", scope: !469, file: !77, line: 178, baseType: !490, size: 64, offset: 576)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64)
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelPacket", file: !326, line: 148, baseType: !492)
!492 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PixelPacket", file: !326, line: 131, size: 64, elements: !493)
!493 = !{!494, !497, !498, !499}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !492, file: !326, line: 143, baseType: !495, size: 16)
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "Quantum", file: !4, line: 93, baseType: !496)
!496 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !492, file: !326, line: 144, baseType: !495, size: 16, offset: 16)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !492, file: !326, line: 145, baseType: !495, size: 16, offset: 32)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !492, file: !326, line: 146, baseType: !495, size: 16, offset: 48)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "background_color", scope: !469, file: !77, line: 179, baseType: !491, size: 64, offset: 640)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !469, file: !77, line: 180, baseType: !491, size: 64, offset: 704)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "matte_color", scope: !469, file: !77, line: 181, baseType: !491, size: 64, offset: 768)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !469, file: !77, line: 184, baseType: !504, size: 64, offset: 832)
!504 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "chromaticity", scope: !469, file: !77, line: 187, baseType: !506, size: 768, offset: 896)
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChromaticityInfo", file: !77, line: 128, baseType: !507)
!507 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ChromaticityInfo", file: !77, line: 121, size: 768, elements: !508)
!508 = !{!509, !516, !517, !518}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "red_primary", scope: !507, file: !77, line: 124, baseType: !510, size: 192)
!510 = !DIDerivedType(tag: DW_TAG_typedef, name: "PrimaryInfo", file: !77, line: 101, baseType: !511)
!511 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PrimaryInfo", file: !77, line: 95, size: 192, elements: !512)
!512 = !{!513, !514, !515}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !511, file: !77, line: 98, baseType: !504, size: 64)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !511, file: !77, line: 99, baseType: !504, size: 64, offset: 64)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !511, file: !77, line: 100, baseType: !504, size: 64, offset: 128)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "green_primary", scope: !507, file: !77, line: 125, baseType: !510, size: 192, offset: 192)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "blue_primary", scope: !507, file: !77, line: 126, baseType: !510, size: 192, offset: 384)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "white_point", scope: !507, file: !77, line: 127, baseType: !510, size: 192, offset: 576)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "rendering_intent", scope: !469, file: !77, line: 190, baseType: !520, size: 32, offset: 1664)
!520 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderingIntent", file: !89, line: 49, baseType: !88)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !469, file: !77, line: 193, baseType: !466, size: 64, offset: 1728)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !469, file: !77, line: 196, baseType: !523, size: 32, offset: 1792)
!523 = !DIDerivedType(tag: DW_TAG_typedef, name: "ResolutionType", file: !77, line: 93, baseType: !96)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "montage", scope: !469, file: !77, line: 199, baseType: !525, size: 64, offset: 1856)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "directory", scope: !469, file: !77, line: 200, baseType: !525, size: 64, offset: 1920)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "geometry", scope: !469, file: !77, line: 201, baseType: !525, size: 64, offset: 1984)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !469, file: !77, line: 204, baseType: !529, size: 64, offset: 2048)
!529 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !530, line: 77, baseType: !531)
!530 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!531 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !532, line: 193, baseType: !533)
!532 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!533 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "x_resolution", scope: !469, file: !77, line: 207, baseType: !504, size: 64, offset: 2112)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "y_resolution", scope: !469, file: !77, line: 208, baseType: !504, size: 64, offset: 2176)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !469, file: !77, line: 211, baseType: !537, size: 256, offset: 2240)
!537 = !DIDerivedType(tag: DW_TAG_typedef, name: "RectangleInfo", file: !153, line: 130, baseType: !538)
!538 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_RectangleInfo", file: !153, line: 121, size: 256, elements: !539)
!539 = !{!540, !541, !542, !543}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !538, file: !153, line: 124, baseType: !478, size: 64)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !538, file: !153, line: 125, baseType: !478, size: 64, offset: 64)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !538, file: !153, line: 128, baseType: !529, size: 64, offset: 128)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !538, file: !153, line: 129, baseType: !529, size: 64, offset: 192)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "extract_info", scope: !469, file: !77, line: 212, baseType: !537, size: 256, offset: 2496)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "tile_info", scope: !469, file: !77, line: 213, baseType: !537, size: 256, offset: 2752)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "bias", scope: !469, file: !77, line: 216, baseType: !504, size: 64, offset: 3008)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "blur", scope: !469, file: !77, line: 217, baseType: !504, size: 64, offset: 3072)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !469, file: !77, line: 218, baseType: !504, size: 64, offset: 3136)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !469, file: !77, line: 221, baseType: !550, size: 32, offset: 3200)
!550 = !DIDerivedType(tag: DW_TAG_typedef, name: "FilterTypes", file: !102, line: 66, baseType: !101)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "interlace", scope: !469, file: !77, line: 224, baseType: !552, size: 32, offset: 3232)
!552 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterlaceType", file: !77, line: 73, baseType: !136)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !469, file: !77, line: 227, baseType: !554, size: 32, offset: 3264)
!554 = !DIDerivedType(tag: DW_TAG_typedef, name: "EndianType", file: !147, line: 35, baseType: !146)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !469, file: !77, line: 230, baseType: !556, size: 32, offset: 3296)
!556 = !DIDerivedType(tag: DW_TAG_typedef, name: "GravityType", file: !153, line: 91, baseType: !152)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !469, file: !77, line: 233, baseType: !558, size: 32, offset: 3328)
!558 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompositeOperator", file: !168, line: 99, baseType: !167)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "dispose", scope: !469, file: !77, line: 236, baseType: !560, size: 32, offset: 3360)
!560 = !DIDerivedType(tag: DW_TAG_typedef, name: "DisposeType", file: !239, line: 32, baseType: !238)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "clip_mask", scope: !469, file: !77, line: 239, baseType: !562, size: 64, offset: 3392)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !469, file: !77, line: 242, baseType: !478, size: 64, offset: 3456)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !469, file: !77, line: 243, baseType: !478, size: 64, offset: 3520)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_second", scope: !469, file: !77, line: 246, baseType: !529, size: 64, offset: 3584)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "iterations", scope: !469, file: !77, line: 249, baseType: !478, size: 64, offset: 3648)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "total_colors", scope: !469, file: !77, line: 250, baseType: !478, size: 64, offset: 3712)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "start_loop", scope: !469, file: !77, line: 253, baseType: !529, size: 64, offset: 3776)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !469, file: !77, line: 256, baseType: !570, size: 192, offset: 3840)
!570 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErrorInfo", file: !571, line: 68, baseType: !572)
!571 = !DIFile(filename: "./magick/color.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!572 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ErrorInfo", file: !571, line: 62, size: 192, elements: !573)
!573 = !{!574, !575, !576}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "mean_error_per_pixel", scope: !572, file: !571, line: 65, baseType: !504, size: 64)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_mean_error", scope: !572, file: !571, line: 66, baseType: !504, size: 64, offset: 64)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_maximum_error", scope: !572, file: !571, line: 67, baseType: !504, size: 64, offset: 128)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !469, file: !77, line: 259, baseType: !578, size: 512, offset: 4032)
!578 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerInfo", file: !247, line: 51, baseType: !579)
!579 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TimerInfo", file: !247, line: 40, size: 512, elements: !580)
!580 = !{!581, !588, !589, !591}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !579, file: !247, line: 43, baseType: !582, size: 192)
!582 = !DIDerivedType(tag: DW_TAG_typedef, name: "Timer", file: !247, line: 38, baseType: !583)
!583 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Timer", file: !247, line: 32, size: 192, elements: !584)
!584 = !{!585, !586, !587}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !583, file: !247, line: 35, baseType: !504, size: 64)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !583, file: !247, line: 36, baseType: !504, size: 64, offset: 64)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !583, file: !247, line: 37, baseType: !504, size: 64, offset: 128)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "elapsed", scope: !579, file: !247, line: 44, baseType: !582, size: 192, offset: 192)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !579, file: !247, line: 47, baseType: !590, size: 32, offset: 384)
!590 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerState", file: !247, line: 30, baseType: !246)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !579, file: !247, line: 50, baseType: !478, size: 64, offset: 448)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !469, file: !77, line: 262, baseType: !451, size: 64, offset: 4544)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !469, file: !77, line: 265, baseType: !466, size: 64, offset: 4608)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !469, file: !77, line: 266, baseType: !466, size: 64, offset: 4672)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !469, file: !77, line: 267, baseType: !466, size: 64, offset: 4736)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "ascii85", scope: !469, file: !77, line: 270, baseType: !597, size: 64, offset: 4800)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 64)
!598 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ascii85Info", file: !52, line: 52, baseType: !599)
!599 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Ascii85Info", file: !52, line: 51, flags: DIFlagFwdDecl)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !469, file: !77, line: 273, baseType: !601, size: 64, offset: 4864)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64)
!602 = !DIDerivedType(tag: DW_TAG_typedef, name: "BlobInfo", file: !4, line: 217, baseType: !603)
!603 = !DICompositeType(tag: DW_TAG_structure_type, name: "_BlobInfo", file: !4, line: 217, flags: DIFlagFwdDecl)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !469, file: !77, line: 276, baseType: !605, size: 32768, offset: 4928)
!605 = !DICompositeType(tag: DW_TAG_array_type, baseType: !459, size: 32768, elements: !606)
!606 = !{!607}
!607 = !DISubrange(count: 4096)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "magick_filename", scope: !469, file: !77, line: 277, baseType: !605, size: 32768, offset: 37696)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !469, file: !77, line: 278, baseType: !605, size: 32768, offset: 70464)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "magick_columns", scope: !469, file: !77, line: 281, baseType: !478, size: 64, offset: 103232)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "magick_rows", scope: !469, file: !77, line: 282, baseType: !478, size: 64, offset: 103296)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "exception", scope: !469, file: !77, line: 285, baseType: !613, size: 448, offset: 103360)
!613 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionInfo", file: !4, line: 219, baseType: !614)
!614 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ExceptionInfo", file: !253, line: 102, size: 448, elements: !615)
!615 = !{!616, !618, !620, !621, !622, !623, !624, !629}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "severity", scope: !614, file: !253, line: 105, baseType: !617, size: 32)
!617 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionType", file: !253, line: 100, baseType: !252)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "error_number", scope: !614, file: !253, line: 108, baseType: !619, size: 32, offset: 32)
!619 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !614, file: !253, line: 111, baseType: !525, size: 64, offset: 64)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !614, file: !253, line: 112, baseType: !525, size: 64, offset: 128)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "exceptions", scope: !614, file: !253, line: 115, baseType: !466, size: 64, offset: 192)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "relinquish", scope: !614, file: !253, line: 118, baseType: !456, size: 32, offset: 256)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !614, file: !253, line: 121, baseType: !625, size: 64, offset: 320)
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 64)
!626 = !DIDerivedType(tag: DW_TAG_typedef, name: "SemaphoreInfo", file: !627, line: 26, baseType: !628)
!627 = !DIFile(filename: "./magick/semaphore.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!628 = !DICompositeType(tag: DW_TAG_structure_type, name: "SemaphoreInfo", file: !627, line: 25, flags: DIFlagFwdDecl)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !614, file: !253, line: 124, baseType: !478, size: 64, offset: 384)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !469, file: !77, line: 288, baseType: !456, size: 32, offset: 103808)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !469, file: !77, line: 291, baseType: !632, size: 64, offset: 103872)
!632 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !529)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !469, file: !77, line: 294, baseType: !625, size: 64, offset: 103936)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "color_profile", scope: !469, file: !77, line: 297, baseType: !635, size: 256, offset: 104000)
!635 = !DIDerivedType(tag: DW_TAG_typedef, name: "ProfileInfo", file: !89, line: 40, baseType: !636)
!636 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ProfileInfo", file: !89, line: 27, size: 256, elements: !637)
!637 = !{!638, !639, !640, !643}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !636, file: !89, line: 30, baseType: !525, size: 64)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !636, file: !89, line: 33, baseType: !478, size: 64, offset: 64)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !636, file: !89, line: 36, baseType: !641, size: 64, offset: 128)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64)
!642 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !636, file: !89, line: 39, baseType: !478, size: 64, offset: 192)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "iptc_profile", scope: !469, file: !77, line: 298, baseType: !635, size: 256, offset: 104256)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profile", scope: !469, file: !77, line: 299, baseType: !646, size: 64, offset: 104512)
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profiles", scope: !469, file: !77, line: 302, baseType: !478, size: 64, offset: 104576)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !469, file: !77, line: 305, baseType: !478, size: 64, offset: 104640)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !469, file: !77, line: 308, baseType: !562, size: 64, offset: 104704)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !469, file: !77, line: 309, baseType: !562, size: 64, offset: 104768)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !469, file: !77, line: 310, baseType: !562, size: 64, offset: 104832)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "interpolate", scope: !469, file: !77, line: 313, baseType: !653, size: 32, offset: 104896)
!653 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterpolatePixelMethod", file: !326, line: 47, baseType: !325)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "black_point_compensation", scope: !469, file: !77, line: 316, baseType: !456, size: 32, offset: 104928)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_color", scope: !469, file: !77, line: 319, baseType: !491, size: 64, offset: 104960)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !469, file: !77, line: 322, baseType: !562, size: 64, offset: 105024)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "tile_offset", scope: !469, file: !77, line: 325, baseType: !537, size: 256, offset: 105088)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !469, file: !77, line: 328, baseType: !466, size: 64, offset: 105344)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "artifacts", scope: !469, file: !77, line: 329, baseType: !466, size: 64, offset: 105408)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !469, file: !77, line: 332, baseType: !661, size: 32, offset: 105472)
!661 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageType", file: !77, line: 61, baseType: !342)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !469, file: !77, line: 335, baseType: !456, size: 32, offset: 105504)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !469, file: !77, line: 338, baseType: !464, size: 64, offset: 105536)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "ping", scope: !469, file: !77, line: 341, baseType: !456, size: 32, offset: 105600)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !469, file: !77, line: 344, baseType: !478, size: 64, offset: 105664)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !469, file: !77, line: 347, baseType: !667, size: 64, offset: 105728)
!667 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !668, line: 7, baseType: !669)
!668 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "")
!669 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !532, line: 160, baseType: !533)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "intensity", scope: !469, file: !77, line: 350, baseType: !671, size: 32, offset: 105792)
!671 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelIntensityMethod", file: !326, line: 79, baseType: !356)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !469, file: !77, line: 353, baseType: !478, size: 64, offset: 105856)
!673 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !451)
!674 = !{}
!675 = !DILocalVariable(name: "image", arg: 1, scope: !448, file: !1, line: 85, type: !467)
!676 = !DILocation(line: 85, column: 67, scope: !448)
!677 = !DILocalVariable(name: "progress_monitor", arg: 2, scope: !448, file: !1, line: 86, type: !673)
!678 = !DILocation(line: 86, column: 31, scope: !448)
!679 = !DILocalVariable(name: "client_data", arg: 3, scope: !448, file: !1, line: 86, type: !466)
!680 = !DILocation(line: 86, column: 54, scope: !448)
!681 = !DILocalVariable(name: "previous_monitor", scope: !448, file: !1, line: 89, type: !451)
!682 = !DILocation(line: 89, column: 5, scope: !448)
!683 = !DILocation(line: 91, column: 20, scope: !448)
!684 = !DILocation(line: 91, column: 27, scope: !448)
!685 = !DILocation(line: 91, column: 19, scope: !448)
!686 = !DILocation(line: 92, column: 27, scope: !448)
!687 = !DILocation(line: 92, column: 3, scope: !448)
!688 = !DILocation(line: 92, column: 10, scope: !448)
!689 = !DILocation(line: 92, column: 26, scope: !448)
!690 = !DILocation(line: 93, column: 22, scope: !448)
!691 = !DILocation(line: 93, column: 3, scope: !448)
!692 = !DILocation(line: 93, column: 10, scope: !448)
!693 = !DILocation(line: 93, column: 21, scope: !448)
!694 = !DILocation(line: 94, column: 10, scope: !448)
!695 = !DILocation(line: 94, column: 3, scope: !448)
!696 = distinct !DISubprogram(name: "SetImageInfoProgressMonitor", scope: !1, file: !1, line: 134, type: !697, scopeLine: 137, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !674)
!697 = !DISubroutineType(types: !698)
!698 = !{!451, !699, !673, !466}
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !700, size: 64)
!700 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageInfo", file: !4, line: 223, baseType: !701)
!701 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ImageInfo", file: !77, line: 356, size: 134336, elements: !702)
!702 = !{!703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !737, !738, !739, !740, !741, !742, !744, !745, !746, !747, !748, !749, !760, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !828, !829, !830}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !701, file: !77, line: 359, baseType: !476, size: 32)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !701, file: !77, line: 362, baseType: !482, size: 32, offset: 32)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "temporary", scope: !701, file: !77, line: 365, baseType: !456, size: 32, offset: 64)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "adjoin", scope: !701, file: !77, line: 366, baseType: !456, size: 32, offset: 96)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "affirm", scope: !701, file: !77, line: 367, baseType: !456, size: 32, offset: 128)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "antialias", scope: !701, file: !77, line: 368, baseType: !456, size: 32, offset: 160)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !701, file: !77, line: 371, baseType: !525, size: 64, offset: 192)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "extract", scope: !701, file: !77, line: 372, baseType: !525, size: 64, offset: 256)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !701, file: !77, line: 373, baseType: !525, size: 64, offset: 320)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "scenes", scope: !701, file: !77, line: 374, baseType: !525, size: 64, offset: 384)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !701, file: !77, line: 377, baseType: !478, size: 64, offset: 448)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "number_scenes", scope: !701, file: !77, line: 378, baseType: !478, size: 64, offset: 512)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !701, file: !77, line: 379, baseType: !478, size: 64, offset: 576)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "interlace", scope: !701, file: !77, line: 382, baseType: !552, size: 32, offset: 640)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !701, file: !77, line: 385, baseType: !554, size: 32, offset: 672)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !701, file: !77, line: 388, baseType: !523, size: 32, offset: 704)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !701, file: !77, line: 391, baseType: !478, size: 64, offset: 768)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "sampling_factor", scope: !701, file: !77, line: 394, baseType: !525, size: 64, offset: 832)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "server_name", scope: !701, file: !77, line: 395, baseType: !525, size: 64, offset: 896)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "font", scope: !701, file: !77, line: 396, baseType: !525, size: 64, offset: 960)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "texture", scope: !701, file: !77, line: 397, baseType: !525, size: 64, offset: 1024)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "density", scope: !701, file: !77, line: 398, baseType: !525, size: 64, offset: 1088)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "pointsize", scope: !701, file: !77, line: 401, baseType: !504, size: 64, offset: 1152)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !701, file: !77, line: 402, baseType: !504, size: 64, offset: 1216)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "background_color", scope: !701, file: !77, line: 405, baseType: !491, size: 64, offset: 1280)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !701, file: !77, line: 406, baseType: !491, size: 64, offset: 1344)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "matte_color", scope: !701, file: !77, line: 407, baseType: !491, size: 64, offset: 1408)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !701, file: !77, line: 410, baseType: !456, size: 32, offset: 1472)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "monochrome", scope: !701, file: !77, line: 411, baseType: !456, size: 32, offset: 1504)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !701, file: !77, line: 414, baseType: !478, size: 64, offset: 1536)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !701, file: !77, line: 417, baseType: !474, size: 32, offset: 1600)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !701, file: !77, line: 420, baseType: !661, size: 32, offset: 1632)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "preview_type", scope: !701, file: !77, line: 423, baseType: !736, size: 32, offset: 1664)
!736 = !DIDerivedType(tag: DW_TAG_typedef, name: "PreviewType", file: !369, line: 59, baseType: !368)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "group", scope: !701, file: !77, line: 426, baseType: !529, size: 64, offset: 1728)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "ping", scope: !701, file: !77, line: 429, baseType: !456, size: 32, offset: 1792)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !701, file: !77, line: 430, baseType: !456, size: 32, offset: 1824)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !701, file: !77, line: 433, baseType: !525, size: 64, offset: 1856)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "authenticate", scope: !701, file: !77, line: 434, baseType: !525, size: 64, offset: 1920)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "channel", scope: !701, file: !77, line: 437, baseType: !743, size: 32, offset: 1984)
!743 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChannelType", file: !4, line: 202, baseType: !401)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !701, file: !77, line: 440, baseType: !467, size: 64, offset: 2048)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !701, file: !77, line: 443, baseType: !466, size: 64, offset: 2112)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !701, file: !77, line: 446, baseType: !451, size: 64, offset: 2176)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !701, file: !77, line: 449, baseType: !466, size: 64, offset: 2240)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !701, file: !77, line: 450, baseType: !466, size: 64, offset: 2304)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !701, file: !77, line: 453, baseType: !750, size: 64, offset: 2368)
!750 = !DIDerivedType(tag: DW_TAG_typedef, name: "StreamHandler", file: !751, line: 26, baseType: !752)
!751 = !DIFile(filename: "./magick/stream.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 64)
!753 = !DISubroutineType(types: !754)
!754 = !{!478, !755, !757, !759}
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 64)
!756 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !468)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 64)
!758 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!759 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !478)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !701, file: !77, line: 456, baseType: !761, size: 64, offset: 2432)
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 64)
!762 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !763, line: 7, baseType: !764)
!763 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!764 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !765, line: 49, size: 1728, elements: !766)
!765 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!766 = !{!767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !782, !784, !785, !786, !788, !789, !791, !795, !798, !800, !803, !806, !807, !808, !809, !810}
!767 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !764, file: !765, line: 51, baseType: !619, size: 32)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !764, file: !765, line: 54, baseType: !525, size: 64, offset: 64)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !764, file: !765, line: 55, baseType: !525, size: 64, offset: 128)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !764, file: !765, line: 56, baseType: !525, size: 64, offset: 192)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !764, file: !765, line: 57, baseType: !525, size: 64, offset: 256)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !764, file: !765, line: 58, baseType: !525, size: 64, offset: 320)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !764, file: !765, line: 59, baseType: !525, size: 64, offset: 384)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !764, file: !765, line: 60, baseType: !525, size: 64, offset: 448)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !764, file: !765, line: 61, baseType: !525, size: 64, offset: 512)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !764, file: !765, line: 64, baseType: !525, size: 64, offset: 576)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !764, file: !765, line: 65, baseType: !525, size: 64, offset: 640)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !764, file: !765, line: 66, baseType: !525, size: 64, offset: 704)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !764, file: !765, line: 68, baseType: !780, size: 64, offset: 768)
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 64)
!781 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !765, line: 36, flags: DIFlagFwdDecl)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !764, file: !765, line: 70, baseType: !783, size: 64, offset: 832)
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 64)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !764, file: !765, line: 72, baseType: !619, size: 32, offset: 896)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !764, file: !765, line: 73, baseType: !619, size: 32, offset: 928)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !764, file: !765, line: 74, baseType: !787, size: 64, offset: 960)
!787 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !532, line: 152, baseType: !533)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !764, file: !765, line: 77, baseType: !496, size: 16, offset: 1024)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !764, file: !765, line: 78, baseType: !790, size: 8, offset: 1040)
!790 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !764, file: !765, line: 79, baseType: !792, size: 8, offset: 1048)
!792 = !DICompositeType(tag: DW_TAG_array_type, baseType: !459, size: 8, elements: !793)
!793 = !{!794}
!794 = !DISubrange(count: 1)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !764, file: !765, line: 81, baseType: !796, size: 64, offset: 1088)
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !797, size: 64)
!797 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !765, line: 43, baseType: null)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !764, file: !765, line: 89, baseType: !799, size: 64, offset: 1152)
!799 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !532, line: 153, baseType: !533)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !764, file: !765, line: 91, baseType: !801, size: 64, offset: 1216)
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 64)
!802 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !765, line: 37, flags: DIFlagFwdDecl)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !764, file: !765, line: 92, baseType: !804, size: 64, offset: 1280)
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 64)
!805 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !765, line: 38, flags: DIFlagFwdDecl)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !764, file: !765, line: 93, baseType: !783, size: 64, offset: 1344)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !764, file: !765, line: 94, baseType: !466, size: 64, offset: 1408)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !764, file: !765, line: 95, baseType: !478, size: 64, offset: 1472)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !764, file: !765, line: 96, baseType: !619, size: 32, offset: 1536)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !764, file: !765, line: 98, baseType: !811, size: 160, offset: 1568)
!811 = !DICompositeType(tag: DW_TAG_array_type, baseType: !459, size: 160, elements: !812)
!812 = !{!813}
!813 = !DISubrange(count: 20)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !701, file: !77, line: 459, baseType: !466, size: 64, offset: 2496)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !701, file: !77, line: 462, baseType: !478, size: 64, offset: 2560)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !701, file: !77, line: 465, baseType: !605, size: 32768, offset: 2624)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "unique", scope: !701, file: !77, line: 466, baseType: !605, size: 32768, offset: 35392)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "zero", scope: !701, file: !77, line: 467, baseType: !605, size: 32768, offset: 68160)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !701, file: !77, line: 468, baseType: !605, size: 32768, offset: 100928)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !701, file: !77, line: 471, baseType: !456, size: 32, offset: 133696)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "tile", scope: !701, file: !77, line: 474, baseType: !525, size: 64, offset: 133760)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "subimage", scope: !701, file: !77, line: 477, baseType: !478, size: 64, offset: 133824)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "subrange", scope: !701, file: !77, line: 478, baseType: !478, size: 64, offset: 133888)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "pen", scope: !701, file: !77, line: 481, baseType: !491, size: 64, offset: 133952)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !701, file: !77, line: 484, baseType: !478, size: 64, offset: 134016)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_pixel_method", scope: !701, file: !77, line: 487, baseType: !827, size: 32, offset: 134080)
!827 = !DIDerivedType(tag: DW_TAG_typedef, name: "VirtualPixelMethod", file: !424, line: 47, baseType: !423)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_color", scope: !701, file: !77, line: 490, baseType: !491, size: 64, offset: 134112)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !701, file: !77, line: 493, baseType: !466, size: 64, offset: 134208)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "synchronize", scope: !701, file: !77, line: 496, baseType: !456, size: 32, offset: 134272)
!831 = !DILocalVariable(name: "image_info", arg: 1, scope: !696, file: !1, line: 135, type: !699)
!832 = !DILocation(line: 135, column: 14, scope: !696)
!833 = !DILocalVariable(name: "progress_monitor", arg: 2, scope: !696, file: !1, line: 135, type: !673)
!834 = !DILocation(line: 135, column: 53, scope: !696)
!835 = !DILocalVariable(name: "client_data", arg: 3, scope: !696, file: !1, line: 136, type: !466)
!836 = !DILocation(line: 136, column: 9, scope: !696)
!837 = !DILocalVariable(name: "previous_monitor", scope: !696, file: !1, line: 139, type: !451)
!838 = !DILocation(line: 139, column: 5, scope: !696)
!839 = !DILocation(line: 141, column: 20, scope: !696)
!840 = !DILocation(line: 141, column: 32, scope: !696)
!841 = !DILocation(line: 141, column: 19, scope: !696)
!842 = !DILocation(line: 142, column: 32, scope: !696)
!843 = !DILocation(line: 142, column: 3, scope: !696)
!844 = !DILocation(line: 142, column: 15, scope: !696)
!845 = !DILocation(line: 142, column: 31, scope: !696)
!846 = !DILocation(line: 143, column: 27, scope: !696)
!847 = !DILocation(line: 143, column: 3, scope: !696)
!848 = !DILocation(line: 143, column: 15, scope: !696)
!849 = !DILocation(line: 143, column: 26, scope: !696)
!850 = !DILocation(line: 144, column: 10, scope: !696)
!851 = !DILocation(line: 144, column: 3, scope: !696)
