; ModuleID = 'wand/pixel-wand.c'
source_filename = "wand/pixel-wand.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._PixelWand = type { i64, [4096 x i8], %struct._ExceptionInfo*, %struct._MagickPixelPacket, i64, i32, i64 }
%struct._ExceptionInfo = type { i32, i32, i8*, i8*, i8*, i32, %struct.SemaphoreInfo*, i64 }
%struct.SemaphoreInfo = type opaque
%struct._MagickPixelPacket = type { i32, i32, i32, double, i64, float, float, float, float, float }
%struct._Image = type { i32, i32, i32, i64, i32, i32, i32, i64, i64, i64, i64, %struct._PixelPacket*, %struct._PixelPacket, %struct._PixelPacket, %struct._PixelPacket, double, %struct._ChromaticityInfo, i32, i8*, i32, i8*, i8*, i8*, i64, double, double, %struct._RectangleInfo, %struct._RectangleInfo, %struct._RectangleInfo, double, double, double, i32, i32, i32, i32, i32, i32, %struct._Image*, i64, i64, i64, i64, i64, i64, %struct._ErrorInfo, %struct._TimerInfo, i32 (i8*, i64, i64, i8*)*, i8*, i8*, i8*, %struct._Ascii85Info*, %struct._BlobInfo*, [4096 x i8], [4096 x i8], [4096 x i8], i64, i64, %struct._ExceptionInfo, i32, i64, %struct.SemaphoreInfo*, %struct._ProfileInfo, %struct._ProfileInfo, %struct._ProfileInfo*, i64, i64, %struct._Image*, %struct._Image*, %struct._Image*, i32, i32, %struct._PixelPacket, %struct._Image*, %struct._RectangleInfo, i8*, i8*, i32, i32, i64, i32, i64, i64, i32, i64 }

!336 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !337, line: 25, baseType: !5, size: 32, elements: !338)
!337 = !DIFile(filename: "./magick/layer.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!338 = !{!339, !340, !341, !342, !343}
!339 = !DIEnumerator(name: "UnrecognizedDispose", value: 0, isUnsigned: true)
!340 = !DIEnumerator(name: "UndefinedDispose", value: 0, isUnsigned: true)
!341 = !DIEnumerator(name: "NoneDispose", value: 1, isUnsigned: true)
!342 = !DIEnumerator(name: "BackgroundDispose", value: 2, isUnsigned: true)
!343 = !DIEnumerator(name: "PreviousDispose", value: 3, isUnsigned: true)
!344 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !345, line: 25, baseType: !5, size: 32, elements: !346)
!345 = !DIFile(filename: "./magick/timer.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!346 = !{!347, !348, !349}
!347 = !DIEnumerator(name: "UndefinedTimerState", value: 0, isUnsigned: true)
!348 = !DIEnumerator(name: "StoppedTimerState", value: 1, isUnsigned: true)
!349 = !DIEnumerator(name: "RunningTimerState", value: 2, isUnsigned: true)
!350 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !351, line: 31, baseType: !5, size: 32, elements: !352)
!351 = !DIFile(filename: "./magick/pixel.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!352 = !{!353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366}
!353 = !DIEnumerator(name: "UndefinedInterpolatePixel", value: 0, isUnsigned: true)
!354 = !DIEnumerator(name: "AverageInterpolatePixel", value: 1, isUnsigned: true)
!355 = !DIEnumerator(name: "BicubicInterpolatePixel", value: 2, isUnsigned: true)
!356 = !DIEnumerator(name: "BilinearInterpolatePixel", value: 3, isUnsigned: true)
!357 = !DIEnumerator(name: "FilterInterpolatePixel", value: 4, isUnsigned: true)
!358 = !DIEnumerator(name: "IntegerInterpolatePixel", value: 5, isUnsigned: true)
!359 = !DIEnumerator(name: "MeshInterpolatePixel", value: 6, isUnsigned: true)
!360 = !DIEnumerator(name: "NearestNeighborInterpolatePixel", value: 7, isUnsigned: true)
!361 = !DIEnumerator(name: "SplineInterpolatePixel", value: 8, isUnsigned: true)
!362 = !DIEnumerator(name: "Average9InterpolatePixel", value: 9, isUnsigned: true)
!363 = !DIEnumerator(name: "Average16InterpolatePixel", value: 10, isUnsigned: true)
!364 = !DIEnumerator(name: "BlendInterpolatePixel", value: 11, isUnsigned: true)
!365 = !DIEnumerator(name: "BackgroundInterpolatePixel", value: 12, isUnsigned: true)
!366 = !DIEnumerator(name: "CatromInterpolatePixel", value: 13, isUnsigned: true)
!367 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !175, line: 47, baseType: !5, size: 32, elements: !368)
!368 = !{!369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380}
!369 = !DIEnumerator(name: "UndefinedType", value: 0, isUnsigned: true)
!370 = !DIEnumerator(name: "BilevelType", value: 1, isUnsigned: true)
!371 = !DIEnumerator(name: "GrayscaleType", value: 2, isUnsigned: true)
!372 = !DIEnumerator(name: "GrayscaleMatteType", value: 3, isUnsigned: true)
!373 = !DIEnumerator(name: "PaletteType", value: 4, isUnsigned: true)
!374 = !DIEnumerator(name: "PaletteMatteType", value: 5, isUnsigned: true)
!375 = !DIEnumerator(name: "TrueColorType", value: 6, isUnsigned: true)
!376 = !DIEnumerator(name: "TrueColorMatteType", value: 7, isUnsigned: true)
!377 = !DIEnumerator(name: "ColorSeparationType", value: 8, isUnsigned: true)
!378 = !DIEnumerator(name: "ColorSeparationMatteType", value: 9, isUnsigned: true)
!379 = !DIEnumerator(name: "OptimizeType", value: 10, isUnsigned: true)
!380 = !DIEnumerator(name: "PaletteBilevelMatteType", value: 11, isUnsigned: true)
!381 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !351, line: 67, baseType: !5, size: 32, elements: !382)
!382 = !{!383, !384, !385, !386, !387, !388, !389, !390, !391, !392}
!383 = !DIEnumerator(name: "UndefinedPixelIntensityMethod", value: 0, isUnsigned: true)
!384 = !DIEnumerator(name: "AveragePixelIntensityMethod", value: 1, isUnsigned: true)
!385 = !DIEnumerator(name: "BrightnessPixelIntensityMethod", value: 2, isUnsigned: true)
!386 = !DIEnumerator(name: "LightnessPixelIntensityMethod", value: 3, isUnsigned: true)
!387 = !DIEnumerator(name: "Rec601LumaPixelIntensityMethod", value: 4, isUnsigned: true)
!388 = !DIEnumerator(name: "Rec601LuminancePixelIntensityMethod", value: 5, isUnsigned: true)
!389 = !DIEnumerator(name: "Rec709LumaPixelIntensityMethod", value: 6, isUnsigned: true)
!390 = !DIEnumerator(name: "Rec709LuminancePixelIntensityMethod", value: 7, isUnsigned: true)
!391 = !DIEnumerator(name: "RMSPixelIntensityMethod", value: 8, isUnsigned: true)
!392 = !DIEnumerator(name: "MSPixelIntensityMethod", value: 9, isUnsigned: true)
!393 = !{!394, !395, !421, !416, !440, !452, !401, !453, !458, !460, !483, !579, !418, !647, !443}
!394 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelWand", file: !397, line: 26, baseType: !398)
!397 = !DIFile(filename: "./wand/pixel-wand.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!398 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PixelWand", file: !1, line: 63, size: 33536, elements: !399)
!399 = !{!400, !403, !408, !430, !449, !450, !451}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !398, file: !1, line: 66, baseType: !401, size: 64)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !402, line: 46, baseType: !394)
!402 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!403 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !398, file: !1, line: 69, baseType: !404, size: 32768, offset: 64)
!404 = !DICompositeType(tag: DW_TAG_array_type, baseType: !405, size: 32768, elements: !406)
!405 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!406 = !{!407}
!407 = !DISubrange(count: 4096)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "exception", scope: !398, file: !1, line: 72, baseType: !409, size: 64, offset: 32832)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionInfo", file: !78, line: 219, baseType: !411)
!411 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ExceptionInfo", file: !4, line: 102, size: 448, elements: !412)
!412 = !{!413, !415, !417, !419, !420, !422, !424, !429}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "severity", scope: !411, file: !4, line: 105, baseType: !414, size: 32)
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionType", file: !4, line: 100, baseType: !3)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "error_number", scope: !411, file: !4, line: 108, baseType: !416, size: 32, offset: 32)
!416 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !411, file: !4, line: 111, baseType: !418, size: 64, offset: 64)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !411, file: !4, line: 112, baseType: !418, size: 64, offset: 128)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "exceptions", scope: !411, file: !4, line: 115, baseType: !421, size: 64, offset: 192)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "relinquish", scope: !411, file: !4, line: 118, baseType: !423, size: 32, offset: 256)
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickBooleanType", file: !78, line: 215, baseType: !77)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !411, file: !4, line: 121, baseType: !425, size: 64, offset: 320)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "SemaphoreInfo", file: !427, line: 26, baseType: !428)
!427 = !DIFile(filename: "./magick/semaphore.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!428 = !DICompositeType(tag: DW_TAG_structure_type, name: "SemaphoreInfo", file: !427, line: 25, flags: DIFlagFwdDecl)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !411, file: !4, line: 124, baseType: !401, size: 64, offset: 384)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "pixel", scope: !398, file: !1, line: 75, baseType: !431, size: 448, offset: 32896)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickPixelPacket", file: !351, line: 127, baseType: !432)
!432 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_MagickPixelPacket", file: !351, line: 104, size: 448, elements: !433)
!433 = !{!434, !436, !438, !439, !441, !442, !445, !446, !447, !448}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !432, file: !351, line: 107, baseType: !435, size: 32)
!435 = !DIDerivedType(tag: DW_TAG_typedef, name: "ClassType", file: !78, line: 209, baseType: !82)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !432, file: !351, line: 110, baseType: !437, size: 32, offset: 32)
!437 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorspaceType", file: !88, line: 61, baseType: !87)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "matte", scope: !432, file: !351, line: 113, baseType: !423, size: 32, offset: 64)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !432, file: !351, line: 116, baseType: !440, size: 64, offset: 128)
!440 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !432, file: !351, line: 119, baseType: !401, size: 64, offset: 192)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !432, file: !351, line: 122, baseType: !443, size: 32, offset: 256)
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickRealType", file: !78, line: 78, baseType: !444)
!444 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !432, file: !351, line: 123, baseType: !443, size: 32, offset: 288)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !432, file: !351, line: 124, baseType: !443, size: 32, offset: 320)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !432, file: !351, line: 125, baseType: !443, size: 32, offset: 352)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !432, file: !351, line: 126, baseType: !443, size: 32, offset: 384)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !398, file: !1, line: 78, baseType: !401, size: 64, offset: 33344)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !398, file: !1, line: 81, baseType: !423, size: 32, offset: 33408)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !398, file: !1, line: 84, baseType: !401, size: 64, offset: 33472)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64)
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !454, line: 77, baseType: !455)
!454 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!455 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !456, line: 193, baseType: !457)
!456 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!457 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64)
!459 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !396)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "Image", file: !78, line: 221, baseType: !462)
!462 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Image", file: !175, line: 150, size: 105920, elements: !463)
!463 = !{!464, !465, !466, !468, !469, !471, !472, !473, !474, !475, !476, !477, !488, !489, !490, !491, !492, !506, !508, !509, !511, !512, !513, !514, !515, !516, !517, !525, !526, !527, !528, !529, !530, !532, !534, !536, !538, !540, !542, !544, !545, !546, !547, !548, !549, !550, !558, !573, !587, !588, !589, !590, !594, !598, !599, !600, !601, !602, !603, !604, !605, !607, !608, !618, !619, !621, !622, !623, !624, !625, !626, !628, !629, !630, !631, !632, !633, !634, !636, !637, !638, !639, !640, !644, !646}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !462, file: !175, line: 153, baseType: !435, size: 32)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !462, file: !175, line: 156, baseType: !437, size: 32, offset: 32)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !462, file: !175, line: 159, baseType: !467, size: 32, offset: 64)
!467 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompressionType", file: !150, line: 49, baseType: !149)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !462, file: !175, line: 162, baseType: !401, size: 64, offset: 128)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !462, file: !175, line: 165, baseType: !470, size: 32, offset: 192)
!470 = !DIDerivedType(tag: DW_TAG_typedef, name: "OrientationType", file: !175, line: 86, baseType: !174)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "taint", scope: !462, file: !175, line: 168, baseType: !423, size: 32, offset: 224)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "matte", scope: !462, file: !175, line: 169, baseType: !423, size: 32, offset: 256)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !462, file: !175, line: 172, baseType: !401, size: 64, offset: 320)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !462, file: !175, line: 173, baseType: !401, size: 64, offset: 384)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !462, file: !175, line: 174, baseType: !401, size: 64, offset: 448)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !462, file: !175, line: 175, baseType: !401, size: 64, offset: 512)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "colormap", scope: !462, file: !175, line: 178, baseType: !478, size: 64, offset: 576)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!479 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelPacket", file: !351, line: 148, baseType: !480)
!480 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PixelPacket", file: !351, line: 131, size: 64, elements: !481)
!481 = !{!482, !485, !486, !487}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !480, file: !351, line: 143, baseType: !483, size: 16)
!483 = !DIDerivedType(tag: DW_TAG_typedef, name: "Quantum", file: !78, line: 93, baseType: !484)
!484 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !480, file: !351, line: 144, baseType: !483, size: 16, offset: 16)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !480, file: !351, line: 145, baseType: !483, size: 16, offset: 32)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !480, file: !351, line: 146, baseType: !483, size: 16, offset: 48)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "background_color", scope: !462, file: !175, line: 179, baseType: !479, size: 64, offset: 640)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !462, file: !175, line: 180, baseType: !479, size: 64, offset: 704)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "matte_color", scope: !462, file: !175, line: 181, baseType: !479, size: 64, offset: 768)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !462, file: !175, line: 184, baseType: !440, size: 64, offset: 832)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "chromaticity", scope: !462, file: !175, line: 187, baseType: !493, size: 768, offset: 896)
!493 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChromaticityInfo", file: !175, line: 128, baseType: !494)
!494 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ChromaticityInfo", file: !175, line: 121, size: 768, elements: !495)
!495 = !{!496, !503, !504, !505}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "red_primary", scope: !494, file: !175, line: 124, baseType: !497, size: 192)
!497 = !DIDerivedType(tag: DW_TAG_typedef, name: "PrimaryInfo", file: !175, line: 101, baseType: !498)
!498 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PrimaryInfo", file: !175, line: 95, size: 192, elements: !499)
!499 = !{!500, !501, !502}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !498, file: !175, line: 98, baseType: !440, size: 64)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !498, file: !175, line: 99, baseType: !440, size: 64, offset: 64)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !498, file: !175, line: 100, baseType: !440, size: 64, offset: 128)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "green_primary", scope: !494, file: !175, line: 125, baseType: !497, size: 192, offset: 192)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "blue_primary", scope: !494, file: !175, line: 126, baseType: !497, size: 192, offset: 384)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "white_point", scope: !494, file: !175, line: 127, baseType: !497, size: 192, offset: 576)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "rendering_intent", scope: !462, file: !175, line: 190, baseType: !507, size: 32, offset: 1664)
!507 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderingIntent", file: !187, line: 49, baseType: !186)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !462, file: !175, line: 193, baseType: !421, size: 64, offset: 1728)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !462, file: !175, line: 196, baseType: !510, size: 32, offset: 1792)
!510 = !DIDerivedType(tag: DW_TAG_typedef, name: "ResolutionType", file: !175, line: 93, baseType: !194)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "montage", scope: !462, file: !175, line: 199, baseType: !418, size: 64, offset: 1856)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "directory", scope: !462, file: !175, line: 200, baseType: !418, size: 64, offset: 1920)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "geometry", scope: !462, file: !175, line: 201, baseType: !418, size: 64, offset: 1984)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !462, file: !175, line: 204, baseType: !453, size: 64, offset: 2048)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "x_resolution", scope: !462, file: !175, line: 207, baseType: !440, size: 64, offset: 2112)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "y_resolution", scope: !462, file: !175, line: 208, baseType: !440, size: 64, offset: 2176)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !462, file: !175, line: 211, baseType: !518, size: 256, offset: 2240)
!518 = !DIDerivedType(tag: DW_TAG_typedef, name: "RectangleInfo", file: !251, line: 130, baseType: !519)
!519 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_RectangleInfo", file: !251, line: 121, size: 256, elements: !520)
!520 = !{!521, !522, !523, !524}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !519, file: !251, line: 124, baseType: !401, size: 64)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !519, file: !251, line: 125, baseType: !401, size: 64, offset: 64)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !519, file: !251, line: 128, baseType: !453, size: 64, offset: 128)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !519, file: !251, line: 129, baseType: !453, size: 64, offset: 192)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "extract_info", scope: !462, file: !175, line: 212, baseType: !518, size: 256, offset: 2496)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "tile_info", scope: !462, file: !175, line: 213, baseType: !518, size: 256, offset: 2752)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "bias", scope: !462, file: !175, line: 216, baseType: !440, size: 64, offset: 3008)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "blur", scope: !462, file: !175, line: 217, baseType: !440, size: 64, offset: 3072)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !462, file: !175, line: 218, baseType: !440, size: 64, offset: 3136)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !462, file: !175, line: 221, baseType: !531, size: 32, offset: 3200)
!531 = !DIDerivedType(tag: DW_TAG_typedef, name: "FilterTypes", file: !200, line: 66, baseType: !199)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "interlace", scope: !462, file: !175, line: 224, baseType: !533, size: 32, offset: 3232)
!533 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterlaceType", file: !175, line: 73, baseType: !234)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !462, file: !175, line: 227, baseType: !535, size: 32, offset: 3264)
!535 = !DIDerivedType(tag: DW_TAG_typedef, name: "EndianType", file: !245, line: 35, baseType: !244)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !462, file: !175, line: 230, baseType: !537, size: 32, offset: 3296)
!537 = !DIDerivedType(tag: DW_TAG_typedef, name: "GravityType", file: !251, line: 91, baseType: !250)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !462, file: !175, line: 233, baseType: !539, size: 32, offset: 3328)
!539 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompositeOperator", file: !266, line: 99, baseType: !265)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "dispose", scope: !462, file: !175, line: 236, baseType: !541, size: 32, offset: 3360)
!541 = !DIDerivedType(tag: DW_TAG_typedef, name: "DisposeType", file: !337, line: 32, baseType: !336)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "clip_mask", scope: !462, file: !175, line: 239, baseType: !543, size: 64, offset: 3392)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !462, file: !175, line: 242, baseType: !401, size: 64, offset: 3456)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !462, file: !175, line: 243, baseType: !401, size: 64, offset: 3520)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_second", scope: !462, file: !175, line: 246, baseType: !453, size: 64, offset: 3584)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "iterations", scope: !462, file: !175, line: 249, baseType: !401, size: 64, offset: 3648)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "total_colors", scope: !462, file: !175, line: 250, baseType: !401, size: 64, offset: 3712)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "start_loop", scope: !462, file: !175, line: 253, baseType: !453, size: 64, offset: 3776)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !462, file: !175, line: 256, baseType: !551, size: 192, offset: 3840)
!551 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErrorInfo", file: !552, line: 68, baseType: !553)
!552 = !DIFile(filename: "./magick/color.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!553 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ErrorInfo", file: !552, line: 62, size: 192, elements: !554)
!554 = !{!555, !556, !557}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "mean_error_per_pixel", scope: !553, file: !552, line: 65, baseType: !440, size: 64)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_mean_error", scope: !553, file: !552, line: 66, baseType: !440, size: 64, offset: 64)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_maximum_error", scope: !553, file: !552, line: 67, baseType: !440, size: 64, offset: 128)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !462, file: !175, line: 259, baseType: !559, size: 512, offset: 4032)
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerInfo", file: !345, line: 51, baseType: !560)
!560 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TimerInfo", file: !345, line: 40, size: 512, elements: !561)
!561 = !{!562, !569, !570, !572}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !560, file: !345, line: 43, baseType: !563, size: 192)
!563 = !DIDerivedType(tag: DW_TAG_typedef, name: "Timer", file: !345, line: 38, baseType: !564)
!564 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Timer", file: !345, line: 32, size: 192, elements: !565)
!565 = !{!566, !567, !568}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !564, file: !345, line: 35, baseType: !440, size: 64)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !564, file: !345, line: 36, baseType: !440, size: 64, offset: 64)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !564, file: !345, line: 37, baseType: !440, size: 64, offset: 128)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "elapsed", scope: !560, file: !345, line: 44, baseType: !563, size: 192, offset: 192)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !560, file: !345, line: 47, baseType: !571, size: 32, offset: 384)
!571 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerState", file: !345, line: 30, baseType: !344)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !560, file: !345, line: 50, baseType: !401, size: 64, offset: 448)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !462, file: !175, line: 262, baseType: !574, size: 64, offset: 4544)
!574 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickProgressMonitor", file: !575, line: 26, baseType: !576)
!575 = !DIFile(filename: "./magick/monitor.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64)
!577 = !DISubroutineType(types: !578)
!578 = !{!423, !579, !581, !584, !421}
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64)
!580 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !405)
!581 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !582)
!582 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickOffsetType", file: !78, line: 150, baseType: !583)
!583 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!584 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !585)
!585 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickSizeType", file: !78, line: 151, baseType: !586)
!586 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !462, file: !175, line: 265, baseType: !421, size: 64, offset: 4608)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !462, file: !175, line: 266, baseType: !421, size: 64, offset: 4672)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !462, file: !175, line: 267, baseType: !421, size: 64, offset: 4736)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "ascii85", scope: !462, file: !175, line: 270, baseType: !591, size: 64, offset: 4800)
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64)
!592 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ascii85Info", file: !150, line: 52, baseType: !593)
!593 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Ascii85Info", file: !150, line: 51, flags: DIFlagFwdDecl)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !462, file: !175, line: 273, baseType: !595, size: 64, offset: 4864)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64)
!596 = !DIDerivedType(tag: DW_TAG_typedef, name: "BlobInfo", file: !78, line: 217, baseType: !597)
!597 = !DICompositeType(tag: DW_TAG_structure_type, name: "_BlobInfo", file: !78, line: 217, flags: DIFlagFwdDecl)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !462, file: !175, line: 276, baseType: !404, size: 32768, offset: 4928)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "magick_filename", scope: !462, file: !175, line: 277, baseType: !404, size: 32768, offset: 37696)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !462, file: !175, line: 278, baseType: !404, size: 32768, offset: 70464)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "magick_columns", scope: !462, file: !175, line: 281, baseType: !401, size: 64, offset: 103232)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "magick_rows", scope: !462, file: !175, line: 282, baseType: !401, size: 64, offset: 103296)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "exception", scope: !462, file: !175, line: 285, baseType: !410, size: 448, offset: 103360)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !462, file: !175, line: 288, baseType: !423, size: 32, offset: 103808)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !462, file: !175, line: 291, baseType: !606, size: 64, offset: 103872)
!606 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !453)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !462, file: !175, line: 294, baseType: !425, size: 64, offset: 103936)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "color_profile", scope: !462, file: !175, line: 297, baseType: !609, size: 256, offset: 104000)
!609 = !DIDerivedType(tag: DW_TAG_typedef, name: "ProfileInfo", file: !187, line: 40, baseType: !610)
!610 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ProfileInfo", file: !187, line: 27, size: 256, elements: !611)
!611 = !{!612, !613, !614, !617}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !610, file: !187, line: 30, baseType: !418, size: 64)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !610, file: !187, line: 33, baseType: !401, size: 64, offset: 64)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !610, file: !187, line: 36, baseType: !615, size: 64, offset: 128)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 64)
!616 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !610, file: !187, line: 39, baseType: !401, size: 64, offset: 192)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "iptc_profile", scope: !462, file: !175, line: 298, baseType: !609, size: 256, offset: 104256)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profile", scope: !462, file: !175, line: 299, baseType: !620, size: 64, offset: 104512)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profiles", scope: !462, file: !175, line: 302, baseType: !401, size: 64, offset: 104576)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !462, file: !175, line: 305, baseType: !401, size: 64, offset: 104640)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !462, file: !175, line: 308, baseType: !543, size: 64, offset: 104704)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !462, file: !175, line: 309, baseType: !543, size: 64, offset: 104768)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !462, file: !175, line: 310, baseType: !543, size: 64, offset: 104832)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "interpolate", scope: !462, file: !175, line: 313, baseType: !627, size: 32, offset: 104896)
!627 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterpolatePixelMethod", file: !351, line: 47, baseType: !350)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "black_point_compensation", scope: !462, file: !175, line: 316, baseType: !423, size: 32, offset: 104928)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_color", scope: !462, file: !175, line: 319, baseType: !479, size: 64, offset: 104960)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !462, file: !175, line: 322, baseType: !543, size: 64, offset: 105024)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "tile_offset", scope: !462, file: !175, line: 325, baseType: !518, size: 256, offset: 105088)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !462, file: !175, line: 328, baseType: !421, size: 64, offset: 105344)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "artifacts", scope: !462, file: !175, line: 329, baseType: !421, size: 64, offset: 105408)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !462, file: !175, line: 332, baseType: !635, size: 32, offset: 105472)
!635 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageType", file: !175, line: 61, baseType: !367)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !462, file: !175, line: 335, baseType: !423, size: 32, offset: 105504)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !462, file: !175, line: 338, baseType: !585, size: 64, offset: 105536)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "ping", scope: !462, file: !175, line: 341, baseType: !423, size: 32, offset: 105600)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !462, file: !175, line: 344, baseType: !401, size: 64, offset: 105664)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !462, file: !175, line: 347, baseType: !641, size: 64, offset: 105728)
!641 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !642, line: 7, baseType: !643)
!642 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "")
!643 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !456, line: 160, baseType: !457)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "intensity", scope: !462, file: !175, line: 350, baseType: !645, size: 32, offset: 105792)
!645 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelIntensityMethod", file: !351, line: 79, baseType: !381)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !462, file: !175, line: 353, baseType: !401, size: 64, offset: 105856)
!647 = !DIDerivedType(tag: DW_TAG_typedef, name: "IndexPacket", file: !351, line: 129, baseType: !483)
!648 = !{i32 7, !"Dwarf Version", i32 4}
!649 = !{i32 2, !"Debug Info Version", i32 3}
!650 = !{i32 1, !"wchar_size", i32 4}
!651 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!652 = distinct !DISubprogram(name: "ClearPixelWand", scope: !1, file: !1, line: 109, type: !653, scopeLine: 110, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !655)
!653 = !DISubroutineType(types: !654)
!654 = !{null, !395}
!655 = !{}
!656 = !DILocalVariable(name: "wand", arg: 1, scope: !652, file: !1, line: 109, type: !395)
!657 = !DILocation(line: 109, column: 43, scope: !652)
!658 = !DILocation(line: 113, column: 7, scope: !659)
!659 = distinct !DILexicalBlock(scope: !652, file: !1, line: 113, column: 7)
!660 = !DILocation(line: 113, column: 13, scope: !659)
!661 = !DILocation(line: 113, column: 19, scope: !659)
!662 = !DILocation(line: 113, column: 7, scope: !652)
!663 = !DILocation(line: 114, column: 60, scope: !659)
!664 = !DILocation(line: 114, column: 66, scope: !659)
!665 = !DILocation(line: 114, column: 12, scope: !659)
!666 = !DILocation(line: 114, column: 5, scope: !659)
!667 = !DILocation(line: 115, column: 24, scope: !652)
!668 = !DILocation(line: 115, column: 30, scope: !652)
!669 = !DILocation(line: 115, column: 3, scope: !652)
!670 = !DILocation(line: 116, column: 3, scope: !652)
!671 = !DILocation(line: 116, column: 9, scope: !652)
!672 = !DILocation(line: 116, column: 15, scope: !652)
!673 = !DILocation(line: 116, column: 25, scope: !652)
!674 = !DILocation(line: 117, column: 15, scope: !652)
!675 = !DILocation(line: 117, column: 3, scope: !652)
!676 = !DILocation(line: 117, column: 9, scope: !652)
!677 = !DILocation(line: 117, column: 14, scope: !652)
!678 = !DILocation(line: 118, column: 1, scope: !652)
!679 = distinct !DISubprogram(name: "ClonePixelWand", scope: !1, file: !1, line: 142, type: !680, scopeLine: 143, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !655)
!680 = !DISubroutineType(types: !681)
!681 = !{!395, !458}
!682 = !DILocalVariable(name: "wand", arg: 1, scope: !679, file: !1, line: 142, type: !458)
!683 = !DILocation(line: 142, column: 55, scope: !679)
!684 = !DILocalVariable(name: "clone_wand", scope: !679, file: !1, line: 145, type: !395)
!685 = !DILocation(line: 145, column: 6, scope: !679)
!686 = !DILocation(line: 149, column: 7, scope: !687)
!687 = distinct !DILexicalBlock(scope: !679, file: !1, line: 149, column: 7)
!688 = !DILocation(line: 149, column: 13, scope: !687)
!689 = !DILocation(line: 149, column: 19, scope: !687)
!690 = !DILocation(line: 149, column: 7, scope: !679)
!691 = !DILocation(line: 150, column: 60, scope: !687)
!692 = !DILocation(line: 150, column: 66, scope: !687)
!693 = !DILocation(line: 150, column: 12, scope: !687)
!694 = !DILocation(line: 150, column: 5, scope: !687)
!695 = !DILocation(line: 151, column: 28, scope: !679)
!696 = !DILocation(line: 151, column: 14, scope: !679)
!697 = !DILocation(line: 151, column: 13, scope: !679)
!698 = !DILocation(line: 152, column: 7, scope: !699)
!699 = distinct !DILexicalBlock(scope: !679, file: !1, line: 152, column: 7)
!700 = !DILocation(line: 152, column: 18, scope: !699)
!701 = !DILocation(line: 152, column: 7, scope: !679)
!702 = !DILocalVariable(name: "exception", scope: !703, file: !1, line: 153, type: !410)
!703 = distinct !DILexicalBlock(scope: !699, file: !1, line: 153, column: 5)
!704 = !DILocation(line: 153, column: 5, scope: !703)
!705 = !DILocation(line: 155, column: 28, scope: !679)
!706 = !DILocation(line: 155, column: 10, scope: !679)
!707 = !DILocation(line: 156, column: 18, scope: !679)
!708 = !DILocation(line: 156, column: 3, scope: !679)
