; ModuleID = 'magick/locale.c'
source_filename = "magick/locale.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.SemaphoreInfo = type opaque
%struct._SplayTreeInfo = type opaque
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct._LinkedListInfo = type opaque
%struct._StringInfo = type { [4096 x i8], i8*, i64, i64 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct._LocaleInfo = type { i8*, i8*, i8*, i32, %struct._LocaleInfo*, %struct._LocaleInfo*, i64 }
%struct._ExceptionInfo = type { i32, i32, i8*, i8*, i8*, i32, %struct.SemaphoreInfo*, i64 }

@.str = private unnamed_addr constant [16 x i8] c"magick/locale.c\00", align 1
@.str.1 = private unnamed_addr constant [1 x i8] zeroinitializer, align 1
@.str.2 = private unnamed_addr constant [4 x i8] c"...\00", align 1
@locale_semaphore = internal global %struct.SemaphoreInfo* null, align 8, !dbg !0
@.str.3 = private unnamed_addr constant [2 x i8] c"*\00", align 1
@locale_cache = internal global %struct._SplayTreeInfo* null, align 8, !dbg !258
@.str.4 = private unnamed_addr constant [3 x i8] c"%s\00", align 1

!77 = !DIEnumerator(name: "DrawError", value: 460, isUnsigned: true)
!78 = !DIEnumerator(name: "ImageError", value: 465, isUnsigned: true)
!79 = !DIEnumerator(name: "WandError", value: 470, isUnsigned: true)
!80 = !DIEnumerator(name: "RandomError", value: 475, isUnsigned: true)
!81 = !DIEnumerator(name: "XServerError", value: 480, isUnsigned: true)
!82 = !DIEnumerator(name: "MonitorError", value: 485, isUnsigned: true)
!83 = !DIEnumerator(name: "RegistryError", value: 490, isUnsigned: true)
!84 = !DIEnumerator(name: "ConfigureError", value: 495, isUnsigned: true)
!85 = !DIEnumerator(name: "PolicyError", value: 499, isUnsigned: true)
!86 = !DIEnumerator(name: "FatalErrorException", value: 700, isUnsigned: true)
!87 = !DIEnumerator(name: "ResourceLimitFatalError", value: 700, isUnsigned: true)
!88 = !DIEnumerator(name: "TypeFatalError", value: 705, isUnsigned: true)
!89 = !DIEnumerator(name: "OptionFatalError", value: 710, isUnsigned: true)
!90 = !DIEnumerator(name: "DelegateFatalError", value: 715, isUnsigned: true)
!91 = !DIEnumerator(name: "MissingDelegateFatalError", value: 720, isUnsigned: true)
!92 = !DIEnumerator(name: "CorruptImageFatalError", value: 725, isUnsigned: true)
!93 = !DIEnumerator(name: "FileOpenFatalError", value: 730, isUnsigned: true)
!94 = !DIEnumerator(name: "BlobFatalError", value: 735, isUnsigned: true)
!95 = !DIEnumerator(name: "StreamFatalError", value: 740, isUnsigned: true)
!96 = !DIEnumerator(name: "CacheFatalError", value: 745, isUnsigned: true)
!97 = !DIEnumerator(name: "CoderFatalError", value: 750, isUnsigned: true)
!98 = !DIEnumerator(name: "FilterFatalError", value: 752, isUnsigned: true)
!99 = !DIEnumerator(name: "ModuleFatalError", value: 755, isUnsigned: true)
!100 = !DIEnumerator(name: "DrawFatalError", value: 760, isUnsigned: true)
!101 = !DIEnumerator(name: "ImageFatalError", value: 765, isUnsigned: true)
!102 = !DIEnumerator(name: "WandFatalError", value: 770, isUnsigned: true)
!103 = !DIEnumerator(name: "RandomFatalError", value: 775, isUnsigned: true)
!104 = !DIEnumerator(name: "XServerFatalError", value: 780, isUnsigned: true)
!105 = !DIEnumerator(name: "MonitorFatalError", value: 785, isUnsigned: true)
!106 = !DIEnumerator(name: "RegistryFatalError", value: 790, isUnsigned: true)
!107 = !DIEnumerator(name: "ConfigureFatalError", value: 795, isUnsigned: true)
!108 = !DIEnumerator(name: "PolicyFatalError", value: 799, isUnsigned: true)
!109 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !110, line: 46, baseType: !7, size: 32, elements: !111)
!110 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!111 = !{!112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123}
!112 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!113 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!114 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!115 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!116 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!117 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!118 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!119 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!120 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!121 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!122 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!123 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!124 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !125, line: 25, baseType: !7, size: 32, elements: !126)
!125 = !DIFile(filename: "./magick/utility.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!126 = !{!127, !128, !129, !130, !131, !132, !133, !134, !135}
!127 = !DIEnumerator(name: "UndefinedPath", value: 0, isUnsigned: true)
!128 = !DIEnumerator(name: "MagickPath", value: 1, isUnsigned: true)
!129 = !DIEnumerator(name: "RootPath", value: 2, isUnsigned: true)
!130 = !DIEnumerator(name: "HeadPath", value: 3, isUnsigned: true)
!131 = !DIEnumerator(name: "TailPath", value: 4, isUnsigned: true)
!132 = !DIEnumerator(name: "BasePath", value: 5, isUnsigned: true)
!133 = !DIEnumerator(name: "ExtensionPath", value: 6, isUnsigned: true)
!134 = !DIEnumerator(name: "SubimagePath", value: 7, isUnsigned: true)
!135 = !DIEnumerator(name: "CanonicalPath", value: 8, isUnsigned: true)
!136 = !{!137, !138, !143, !162, !163, !165, !160, !166, !167, !150, !168, !172, !186, !187, !243, !247, !251, !195, !254, !183, !217, !256}
!137 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !139, line: 77, baseType: !140)
!139 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !141, line: 193, baseType: !142)
!141 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!142 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!144 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !145)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "LocaleInfo", file: !146, line: 43, baseType: !147)
!146 = !DIFile(filename: "./magick/locale_.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_LocaleInfo", file: !146, line: 27, size: 448, elements: !148)
!148 = !{!149, !152, !153, !154, !156, !158, !159}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !147, file: !146, line: 30, baseType: !150, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!151 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !147, file: !146, line: 31, baseType: !150, size: 64, offset: 64)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !147, file: !146, line: 32, baseType: !150, size: 64, offset: 128)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "stealth", scope: !147, file: !146, line: 35, baseType: !155, size: 32, offset: 192)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickBooleanType", file: !32, line: 215, baseType: !31)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !147, file: !146, line: 38, baseType: !157, size: 64, offset: 256)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !147, file: !146, line: 39, baseType: !157, size: 64, offset: 320)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !147, file: !146, line: 42, baseType: !160, size: 64, offset: 384)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !161, line: 46, baseType: !137)
!161 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !151)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "LinkedListInfo", file: !170, line: 34, baseType: !171)
!170 = !DIFile(filename: "./magick/hashmap.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!171 = !DICompositeType(tag: DW_TAG_structure_type, name: "_LinkedListInfo", file: !170, line: 33, flags: DIFlagFwdDecl)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "StringInfo", file: !174, line: 40, baseType: !175)
!174 = !DIFile(filename: "./magick/string_.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_StringInfo", file: !174, line: 29, size: 32960, elements: !176)
!176 = !{!177, !181, !184, !185}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !175, file: !174, line: 32, baseType: !178, size: 32768)
!178 = !DICompositeType(tag: DW_TAG_array_type, baseType: !151, size: 32768, elements: !179)
!179 = !{!180}
!180 = !DISubrange(count: 4096)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "datum", scope: !175, file: !174, line: 35, baseType: !182, size: 64, offset: 32768)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !175, file: !174, line: 38, baseType: !160, size: 64, offset: 32832)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !175, file: !174, line: 39, baseType: !160, size: 64, offset: 32896)
!186 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!188 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !189)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !190, line: 7, baseType: !191)
!190 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!191 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !192, line: 49, size: 1728, elements: !193)
!192 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!193 = !{!194, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !210, !212, !213, !214, !216, !218, !220, !224, !227, !229, !232, !235, !236, !237, !238, !239}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !191, file: !192, line: 51, baseType: !195, size: 32)
!195 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !191, file: !192, line: 54, baseType: !150, size: 64, offset: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !191, file: !192, line: 55, baseType: !150, size: 64, offset: 128)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !191, file: !192, line: 56, baseType: !150, size: 64, offset: 192)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !191, file: !192, line: 57, baseType: !150, size: 64, offset: 256)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !191, file: !192, line: 58, baseType: !150, size: 64, offset: 320)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !191, file: !192, line: 59, baseType: !150, size: 64, offset: 384)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !191, file: !192, line: 60, baseType: !150, size: 64, offset: 448)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !191, file: !192, line: 61, baseType: !150, size: 64, offset: 512)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !191, file: !192, line: 64, baseType: !150, size: 64, offset: 576)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !191, file: !192, line: 65, baseType: !150, size: 64, offset: 640)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !191, file: !192, line: 66, baseType: !150, size: 64, offset: 704)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !191, file: !192, line: 68, baseType: !208, size: 64, offset: 768)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !192, line: 36, flags: DIFlagFwdDecl)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !191, file: !192, line: 70, baseType: !211, size: 64, offset: 832)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !191, file: !192, line: 72, baseType: !195, size: 32, offset: 896)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !191, file: !192, line: 73, baseType: !195, size: 32, offset: 928)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !191, file: !192, line: 74, baseType: !215, size: 64, offset: 960)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !141, line: 152, baseType: !142)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !191, file: !192, line: 77, baseType: !217, size: 16, offset: 1024)
!217 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !191, file: !192, line: 78, baseType: !219, size: 8, offset: 1040)
!219 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !191, file: !192, line: 79, baseType: !221, size: 8, offset: 1048)
!221 = !DICompositeType(tag: DW_TAG_array_type, baseType: !151, size: 8, elements: !222)
!222 = !{!223}
!223 = !DISubrange(count: 1)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !191, file: !192, line: 81, baseType: !225, size: 64, offset: 1088)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !192, line: 43, baseType: null)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !191, file: !192, line: 89, baseType: !228, size: 64, offset: 1152)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !141, line: 153, baseType: !142)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !191, file: !192, line: 91, baseType: !230, size: 64, offset: 1216)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!231 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !192, line: 37, flags: DIFlagFwdDecl)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !191, file: !192, line: 92, baseType: !233, size: 64, offset: 1280)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!234 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !192, line: 38, flags: DIFlagFwdDecl)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !191, file: !192, line: 93, baseType: !211, size: 64, offset: 1344)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !191, file: !192, line: 94, baseType: !162, size: 64, offset: 1408)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !191, file: !192, line: 95, baseType: !160, size: 64, offset: 1472)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !191, file: !192, line: 96, baseType: !195, size: 32, offset: 1536)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !191, file: !192, line: 98, baseType: !240, size: 160, offset: 1568)
!240 = !DICompositeType(tag: DW_TAG_array_type, baseType: !151, size: 160, elements: !241)
!241 = !{!242}
!242 = !DISubrange(count: 20)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "SemaphoreInfo", file: !245, line: 26, baseType: !246)
!245 = !DIFile(filename: "./magick/semaphore.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!246 = !DICompositeType(tag: DW_TAG_structure_type, name: "SemaphoreInfo", file: !245, line: 25, flags: DIFlagFwdDecl)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "SplayTreeInfo", file: !249, line: 26, baseType: !250)
!249 = !DIFile(filename: "./magick/splay-tree.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!250 = !DICompositeType(tag: DW_TAG_structure_type, name: "_SplayTreeInfo", file: !249, line: 25, flags: DIFlagFwdDecl)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!252 = !DISubroutineType(types: !253)
!253 = !{!162, !162}
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64)
!255 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !173)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!257 = !{!0, !258, !260}
!258 = !DIGlobalVariableExpression(var: !259, expr: !DIExpression())
!259 = distinct !DIGlobalVariable(name: "locale_cache", scope: !2, file: !3, line: 94, type: !247, isLocal: true, isDefinition: true)
!260 = !DIGlobalVariableExpression(var: !261, expr: !DIExpression())
!261 = distinct !DIGlobalVariable(name: "LocaleMap", scope: !2, file: !3, line: 79, type: !163, isLocal: true, isDefinition: true)
!262 = !{i32 7, !"Dwarf Version", i32 4}
!263 = !{i32 2, !"Debug Info Version", i32 3}
!264 = !{i32 1, !"wchar_size", i32 4}
!265 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!266 = distinct !DISubprogram(name: "DestroyLocaleOptions", scope: !3, file: !3, line: 301, type: !267, scopeLine: 302, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !269)
!267 = !DISubroutineType(types: !268)
!268 = !{!168, !168}
!269 = !{}
!270 = !DILocalVariable(name: "messages", arg: 1, scope: !266, file: !3, line: 301, type: !168)
!271 = !DILocation(line: 301, column: 67, scope: !266)
!272 = !DILocation(line: 304, column: 10, scope: !266)
!273 = !DILocation(line: 305, column: 28, scope: !266)
!274 = !DILocation(line: 305, column: 10, scope: !266)
!275 = !DILocation(line: 305, column: 3, scope: !266)
!276 = distinct !DISubprogram(name: "DestroyOptions", scope: !3, file: !3, line: 296, type: !252, scopeLine: 297, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !269)
!277 = !DILocalVariable(name: "message", arg: 1, scope: !276, file: !3, line: 296, type: !162)
!278 = !DILocation(line: 296, column: 35, scope: !276)
!279 = !DILocation(line: 298, column: 43, scope: !276)
!280 = !DILocation(line: 298, column: 28, scope: !276)
!281 = !DILocation(line: 298, column: 10, scope: !276)
!282 = !DILocation(line: 298, column: 9, scope: !276)
!283 = !DILocation(line: 298, column: 3, scope: !276)
!284 = distinct !DISubprogram(name: "FormatLocaleFileList", scope: !3, file: !3, line: 335, type: !285, scopeLine: 337, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !269)
!285 = !DISubroutineType(types: !286)
!286 = !{!138, !287, !288, !289}
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!288 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !163)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64)
!290 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !3, line: 306, size: 192, elements: !291)
!291 = !{!292, !293, !294, !295}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !290, file: !3, line: 306, baseType: !7, size: 32)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !290, file: !3, line: 306, baseType: !7, size: 32, offset: 32)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !290, file: !3, line: 306, baseType: !162, size: 64, offset: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !290, file: !3, line: 306, baseType: !162, size: 64, offset: 128)
!296 = !DILocalVariable(name: "file", arg: 1, scope: !284, file: !3, line: 335, type: !287)
!297 = !DILocation(line: 335, column: 49, scope: !284)
!298 = !DILocalVariable(name: "format", arg: 2, scope: !284, file: !3, line: 336, type: !288)
!299 = !DILocation(line: 336, column: 24, scope: !284)
!300 = !DILocalVariable(name: "operands", arg: 3, scope: !284, file: !3, line: 336, type: !289)
!301 = !DILocation(line: 336, column: 39, scope: !284)
!302 = !DILocalVariable(name: "n", scope: !284, file: !3, line: 339, type: !138)
!303 = !DILocation(line: 339, column: 5, scope: !284)
!304 = !DILocation(line: 374, column: 24, scope: !284)
!305 = !DILocation(line: 374, column: 29, scope: !284)
!306 = !DILocation(line: 374, column: 36, scope: !284)
!307 = !DILocation(line: 374, column: 15, scope: !284)
!308 = !DILocation(line: 374, column: 5, scope: !284)
!309 = !DILocation(line: 374, column: 4, scope: !284)
!310 = !DILocation(line: 377, column: 10, scope: !284)
!311 = !DILocation(line: 377, column: 3, scope: !284)
!312 = distinct !DISubprogram(name: "FormatLocaleFile", scope: !3, file: !3, line: 380, type: !313, scopeLine: 382, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !269)
!313 = !DISubroutineType(types: !314)
!314 = !{!138, !287, !288, null}
!315 = !DILocalVariable(name: "file", arg: 1, scope: !312, file: !3, line: 380, type: !287)
!316 = !DILocation(line: 380, column: 45, scope: !312)
!317 = !DILocalVariable(name: "format", arg: 2, scope: !312, file: !3, line: 380, type: !288)
!318 = !DILocation(line: 380, column: 71, scope: !312)
!319 = !DILocalVariable(name: "n", scope: !312, file: !3, line: 384, type: !138)
!320 = !DILocation(line: 384, column: 5, scope: !312)
!321 = !DILocalVariable(name: "operands", scope: !312, file: !3, line: 387, type: !322)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !139, line: 52, baseType: !323)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !324, line: 32, baseType: !325)
!324 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stdarg.h", directory: "/home/venkat/IF-DV")
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !3, line: 387, baseType: !326)
!326 = !DICompositeType(tag: DW_TAG_array_type, baseType: !290, size: 192, elements: !222)
!327 = !DILocation(line: 387, column: 5, scope: !312)
!328 = !DILocation(line: 389, column: 3, scope: !312)
!329 = !DILocation(line: 390, column: 26, scope: !312)
!330 = !DILocation(line: 390, column: 31, scope: !312)
!331 = !DILocation(line: 390, column: 38, scope: !312)
!332 = !DILocation(line: 390, column: 5, scope: !312)
!333 = !DILocation(line: 390, column: 4, scope: !312)
!334 = !DILocation(line: 391, column: 3, scope: !312)
!335 = !DILocation(line: 392, column: 10, scope: !312)
!336 = !DILocation(line: 392, column: 3, scope: !312)
!337 = distinct !DISubprogram(name: "FormatLocaleStringList", scope: !3, file: !3, line: 426, type: !338, scopeLine: 428, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !269)
!338 = !DISubroutineType(types: !339)
!339 = !{!138, !340, !341, !288, !289}
!340 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !150)
!341 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !160)
!342 = !DILocalVariable(name: "string", arg: 1, scope: !337, file: !3, line: 426, type: !340)
!343 = !DILocation(line: 426, column: 60, scope: !337)
!344 = !DILocalVariable(name: "length", arg: 2, scope: !337, file: !3, line: 427, type: !341)
!345 = !DILocation(line: 427, column: 16, scope: !337)
!346 = !DILocalVariable(name: "format", arg: 3, scope: !337, file: !3, line: 427, type: !288)
!347 = !DILocation(line: 427, column: 44, scope: !337)
!348 = !DILocalVariable(name: "operands", arg: 4, scope: !337, file: !3, line: 427, type: !289)
!349 = !DILocation(line: 427, column: 59, scope: !337)
!350 = !DILocalVariable(name: "n", scope: !337, file: !3, line: 430, type: !138)
!351 = !DILocation(line: 430, column: 5, scope: !337)
!352 = !DILocation(line: 465, column: 25, scope: !337)
!353 = !DILocation(line: 465, column: 32, scope: !337)
!354 = !DILocation(line: 465, column: 39, scope: !337)
!355 = !DILocation(line: 465, column: 46, scope: !337)
!356 = !DILocation(line: 465, column: 15, scope: !337)
!357 = !DILocation(line: 465, column: 5, scope: !337)
!358 = !DILocation(line: 465, column: 4, scope: !337)
!359 = !DILocation(line: 470, column: 7, scope: !360)
!360 = distinct !DILexicalBlock(scope: !337, file: !3, line: 470, column: 7)
!361 = !DILocation(line: 470, column: 9, scope: !360)
!362 = !DILocation(line: 470, column: 7, scope: !337)
!363 = !DILocation(line: 471, column: 5, scope: !360)
!364 = !DILocation(line: 471, column: 12, scope: !360)
!365 = !DILocation(line: 471, column: 18, scope: !360)
!366 = !DILocation(line: 471, column: 21, scope: !360)
!367 = !DILocation(line: 472, column: 10, scope: !337)
!368 = !DILocation(line: 472, column: 3, scope: !337)
!369 = distinct !DISubprogram(name: "FormatLocaleString", scope: !3, file: !3, line: 475, type: !370, scopeLine: 477, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !269)
!370 = !DISubroutineType(types: !371)
!371 = !{!138, !340, !341, !288, null}
!372 = !DILocalVariable(name: "string", arg: 1, scope: !369, file: !3, line: 475, type: !340)
!373 = !DILocation(line: 475, column: 56, scope: !369)
!374 = !DILocalVariable(name: "length", arg: 2, scope: !369, file: !3, line: 476, type: !341)
!375 = !DILocation(line: 476, column: 16, scope: !369)
!376 = !DILocalVariable(name: "format", arg: 3, scope: !369, file: !3, line: 476, type: !288)
!377 = !DILocation(line: 476, column: 44, scope: !369)
!378 = !DILocalVariable(name: "n", scope: !369, file: !3, line: 479, type: !138)
!379 = !DILocation(line: 479, column: 5, scope: !369)
!380 = !DILocalVariable(name: "operands", scope: !369, file: !3, line: 482, type: !322)
!381 = !DILocation(line: 482, column: 5, scope: !369)
!382 = !DILocation(line: 484, column: 3, scope: !369)
!383 = !DILocation(line: 485, column: 28, scope: !369)
!384 = !DILocation(line: 485, column: 35, scope: !369)
!385 = !DILocation(line: 485, column: 42, scope: !369)
!386 = !DILocation(line: 485, column: 49, scope: !369)
!387 = !DILocation(line: 485, column: 5, scope: !369)
!388 = !DILocation(line: 485, column: 4, scope: !369)
!389 = !DILocation(line: 486, column: 3, scope: !369)
!390 = !DILocation(line: 487, column: 10, scope: !369)
!391 = !DILocation(line: 487, column: 3, scope: !369)
!392 = distinct !DISubprogram(name: "GetLocaleInfo_", scope: !3, file: !3, line: 516, type: !393, scopeLine: 518, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !269)
!393 = !DISubroutineType(types: !394)
!394 = !{!143, !163, !395}
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionInfo", file: !32, line: 219, baseType: !397)
!397 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ExceptionInfo", file: !37, line: 102, size: 448, elements: !398)
!398 = !{!399, !401, !402, !403, !404, !405, !406, !407}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "severity", scope: !397, file: !37, line: 105, baseType: !400, size: 32)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionType", file: !37, line: 100, baseType: !36)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "error_number", scope: !397, file: !37, line: 108, baseType: !195, size: 32, offset: 32)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !397, file: !37, line: 111, baseType: !150, size: 64, offset: 64)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !397, file: !37, line: 112, baseType: !150, size: 64, offset: 128)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "exceptions", scope: !397, file: !37, line: 115, baseType: !162, size: 64, offset: 192)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "relinquish", scope: !397, file: !37, line: 118, baseType: !155, size: 32, offset: 256)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !397, file: !37, line: 121, baseType: !243, size: 64, offset: 320)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !397, file: !37, line: 124, baseType: !160, size: 64, offset: 384)
!408 = !DILocalVariable(name: "tag", arg: 1, scope: !392, file: !3, line: 516, type: !163)
!409 = !DILocation(line: 516, column: 59, scope: !392)
!410 = !DILocalVariable(name: "exception", arg: 2, scope: !392, file: !3, line: 517, type: !395)
!411 = !DILocation(line: 517, column: 18, scope: !392)
!412 = !DILocalVariable(name: "locale_info", scope: !392, file: !3, line: 520, type: !143)
!413 = !DILocation(line: 520, column: 6, scope: !392)
!414 = !DILocation(line: 523, column: 32, scope: !415)
!415 = distinct !DILexicalBlock(scope: !392, file: !3, line: 523, column: 7)
!416 = !DILocation(line: 523, column: 7, scope: !415)
!417 = !DILocation(line: 523, column: 43, scope: !415)
!418 = !DILocation(line: 523, column: 7, scope: !392)
!419 = !DILocation(line: 524, column: 5, scope: !415)
!420 = !DILocation(line: 525, column: 21, scope: !392)
!421 = !DILocation(line: 525, column: 3, scope: !392)
!422 = !DILocation(line: 526, column: 8, scope: !423)
!423 = distinct !DILexicalBlock(scope: !392, file: !3, line: 526, column: 7)
!424 = !DILocation(line: 526, column: 12, scope: !423)
!425 = !DILocation(line: 526, column: 36, scope: !423)
!426 = !DILocation(line: 526, column: 54, scope: !423)
!427 = !DILocation(line: 526, column: 40, scope: !423)
!428 = !DILocation(line: 526, column: 63, scope: !423)
!429 = !DILocation(line: 526, column: 7, scope: !392)
!430 = !DILocation(line: 528, column: 30, scope: !431)
!431 = distinct !DILexicalBlock(scope: !423, file: !3, line: 527, column: 5)
!432 = !DILocation(line: 528, column: 7, scope: !431)
!433 = !DILocation(line: 529, column: 64, scope: !431)
!434 = !DILocation(line: 529, column: 40, scope: !431)
!435 = !DILocation(line: 529, column: 19, scope: !431)
!436 = !DILocation(line: 529, column: 18, scope: !431)
!437 = !DILocation(line: 530, column: 27, scope: !431)
!438 = !DILocation(line: 530, column: 7, scope: !431)
!439 = !DILocation(line: 531, column: 14, scope: !431)
!440 = !DILocation(line: 531, column: 7, scope: !431)
!441 = !DILocation(line: 533, column: 58, scope: !392)
!442 = !DILocation(line: 533, column: 71, scope: !392)
!443 = !DILocation(line: 533, column: 36, scope: !392)
!444 = !DILocation(line: 533, column: 15, scope: !392)
!445 = !DILocation(line: 533, column: 14, scope: !392)
!446 = !DILocation(line: 534, column: 23, scope: !392)
!447 = !DILocation(line: 534, column: 3, scope: !392)
!448 = !DILocation(line: 535, column: 10, scope: !392)
!449 = !DILocation(line: 535, column: 3, scope: !392)
!450 = !DILocation(line: 536, column: 1, scope: !392)
!451 = distinct !DISubprogram(name: "IsLocaleTreeInstantiated", scope: !3, file: !3, line: 911, type: !452, scopeLine: 912, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !269)
!452 = !DISubroutineType(types: !453)
!453 = !{!155, !395}
!454 = !DILocalVariable(name: "exception", arg: 1, scope: !451, file: !3, line: 911, type: !395)
!455 = !DILocation(line: 911, column: 66, scope: !451)
!456 = !DILocation(line: 913, column: 7, scope: !457)
!457 = distinct !DILexicalBlock(scope: !451, file: !3, line: 913, column: 7)
!458 = !DILocation(line: 913, column: 20, scope: !457)
!459 = !DILocation(line: 913, column: 7, scope: !451)
!460 = !DILocation(line: 915, column: 11, scope: !461)
!461 = distinct !DILexicalBlock(scope: !462, file: !3, line: 915, column: 11)
!462 = distinct !DILexicalBlock(scope: !457, file: !3, line: 914, column: 5)
!463 = !DILocation(line: 915, column: 28, scope: !461)
!464 = !DILocation(line: 915, column: 11, scope: !462)
!465 = !DILocation(line: 916, column: 9, scope: !461)
!466 = !DILocation(line: 917, column: 25, scope: !462)
!467 = !DILocation(line: 917, column: 7, scope: !462)
!468 = !DILocation(line: 918, column: 11, scope: !469)
!469 = distinct !DILexicalBlock(scope: !462, file: !3, line: 918, column: 11)
!470 = !DILocation(line: 918, column: 24, scope: !469)
