; ModuleID = 'magick/colormap.c'
source_filename = "magick/colormap.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._Image = type { i32, i32, i32, i64, i32, i32, i32, i64, i64, i64, i64, %struct._PixelPacket*, %struct._PixelPacket, %struct._PixelPacket, %struct._PixelPacket, double, %struct._ChromaticityInfo, i32, i8*, i32, i8*, i8*, i8*, i64, double, double, %struct._RectangleInfo, %struct._RectangleInfo, %struct._RectangleInfo, double, double, double, i32, i32, i32, i32, i32, i32, %struct._Image*, i64, i64, i64, i64, i64, i64, %struct._ErrorInfo, %struct._TimerInfo, i32 (i8*, i64, i64, i8*)*, i8*, i8*, i8*, %struct._Ascii85Info*, %struct._BlobInfo*, [4096 x i8], [4096 x i8], [4096 x i8], i64, i64, %struct._ExceptionInfo, i32, i64, %struct.SemaphoreInfo*, %struct._ProfileInfo, %struct._ProfileInfo, %struct._ProfileInfo*, i64, i64, %struct._Image*, %struct._Image*, %struct._Image*, i32, i32, %struct._PixelPacket, %struct._Image*, %struct._RectangleInfo, i8*, i8*, i32, i32, i64, i32, i64, i64, i32, i64 }
%struct._ChromaticityInfo = type { %struct._PrimaryInfo, %struct._PrimaryInfo, %struct._PrimaryInfo, %struct._PrimaryInfo }
%struct._PrimaryInfo = type { double, double, double }
%struct._ErrorInfo = type { double, double, double }
%struct._TimerInfo = type { %struct._Timer, %struct._Timer, i32, i64 }
%struct._Timer = type { double, double, double }

!333 = !DIEnumerator(name: "IntegerInterpolatePixel", value: 5, isUnsigned: true)
!334 = !DIEnumerator(name: "MeshInterpolatePixel", value: 6, isUnsigned: true)
!335 = !DIEnumerator(name: "NearestNeighborInterpolatePixel", value: 7, isUnsigned: true)
!336 = !DIEnumerator(name: "SplineInterpolatePixel", value: 8, isUnsigned: true)
!337 = !DIEnumerator(name: "Average9InterpolatePixel", value: 9, isUnsigned: true)
!338 = !DIEnumerator(name: "Average16InterpolatePixel", value: 10, isUnsigned: true)
!339 = !DIEnumerator(name: "BlendInterpolatePixel", value: 11, isUnsigned: true)
!340 = !DIEnumerator(name: "BackgroundInterpolatePixel", value: 12, isUnsigned: true)
!341 = !DIEnumerator(name: "CatromInterpolatePixel", value: 13, isUnsigned: true)
!342 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !77, line: 47, baseType: !5, size: 32, elements: !343)
!343 = !{!344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355}
!344 = !DIEnumerator(name: "UndefinedType", value: 0, isUnsigned: true)
!345 = !DIEnumerator(name: "BilevelType", value: 1, isUnsigned: true)
!346 = !DIEnumerator(name: "GrayscaleType", value: 2, isUnsigned: true)
!347 = !DIEnumerator(name: "GrayscaleMatteType", value: 3, isUnsigned: true)
!348 = !DIEnumerator(name: "PaletteType", value: 4, isUnsigned: true)
!349 = !DIEnumerator(name: "PaletteMatteType", value: 5, isUnsigned: true)
!350 = !DIEnumerator(name: "TrueColorType", value: 6, isUnsigned: true)
!351 = !DIEnumerator(name: "TrueColorMatteType", value: 7, isUnsigned: true)
!352 = !DIEnumerator(name: "ColorSeparationType", value: 8, isUnsigned: true)
!353 = !DIEnumerator(name: "ColorSeparationMatteType", value: 9, isUnsigned: true)
!354 = !DIEnumerator(name: "OptimizeType", value: 10, isUnsigned: true)
!355 = !DIEnumerator(name: "PaletteBilevelMatteType", value: 11, isUnsigned: true)
!356 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !326, line: 67, baseType: !5, size: 32, elements: !357)
!357 = !{!358, !359, !360, !361, !362, !363, !364, !365, !366, !367}
!358 = !DIEnumerator(name: "UndefinedPixelIntensityMethod", value: 0, isUnsigned: true)
!359 = !DIEnumerator(name: "AveragePixelIntensityMethod", value: 1, isUnsigned: true)
!360 = !DIEnumerator(name: "BrightnessPixelIntensityMethod", value: 2, isUnsigned: true)
!361 = !DIEnumerator(name: "LightnessPixelIntensityMethod", value: 3, isUnsigned: true)
!362 = !DIEnumerator(name: "Rec601LumaPixelIntensityMethod", value: 4, isUnsigned: true)
!363 = !DIEnumerator(name: "Rec601LuminancePixelIntensityMethod", value: 5, isUnsigned: true)
!364 = !DIEnumerator(name: "Rec709LumaPixelIntensityMethod", value: 6, isUnsigned: true)
!365 = !DIEnumerator(name: "Rec709LuminancePixelIntensityMethod", value: 7, isUnsigned: true)
!366 = !DIEnumerator(name: "RMSPixelIntensityMethod", value: 8, isUnsigned: true)
!367 = !DIEnumerator(name: "MSPixelIntensityMethod", value: 9, isUnsigned: true)
!368 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !369, line: 34, baseType: !5, size: 32, elements: !370)
!369 = !DIFile(filename: "./magick/log.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!370 = !{!371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392}
!371 = !DIEnumerator(name: "UndefinedEvents", value: 0, isUnsigned: true)
!372 = !DIEnumerator(name: "NoEvents", value: 0, isUnsigned: true)
!373 = !DIEnumerator(name: "TraceEvent", value: 1, isUnsigned: true)
!374 = !DIEnumerator(name: "AnnotateEvent", value: 2, isUnsigned: true)
!375 = !DIEnumerator(name: "BlobEvent", value: 4, isUnsigned: true)
!376 = !DIEnumerator(name: "CacheEvent", value: 8, isUnsigned: true)
!377 = !DIEnumerator(name: "CoderEvent", value: 16, isUnsigned: true)
!378 = !DIEnumerator(name: "ConfigureEvent", value: 32, isUnsigned: true)
!379 = !DIEnumerator(name: "DeprecateEvent", value: 64, isUnsigned: true)
!380 = !DIEnumerator(name: "DrawEvent", value: 128, isUnsigned: true)
!381 = !DIEnumerator(name: "ExceptionEvent", value: 256, isUnsigned: true)
!382 = !DIEnumerator(name: "ImageEvent", value: 512, isUnsigned: true)
!383 = !DIEnumerator(name: "LocaleEvent", value: 1024, isUnsigned: true)
!384 = !DIEnumerator(name: "ModuleEvent", value: 2048, isUnsigned: true)
!385 = !DIEnumerator(name: "PolicyEvent", value: 4096, isUnsigned: true)
!386 = !DIEnumerator(name: "ResourceEvent", value: 8192, isUnsigned: true)
!387 = !DIEnumerator(name: "TransformEvent", value: 16384, isUnsigned: true)
!388 = !DIEnumerator(name: "UserEvent", value: 36864, isUnsigned: true)
!389 = !DIEnumerator(name: "WandEvent", value: 65536, isUnsigned: true)
!390 = !DIEnumerator(name: "X11Event", value: 131072, isUnsigned: true)
!391 = !DIEnumerator(name: "AccelerateEvent", value: 262144, isUnsigned: true)
!392 = !DIEnumerator(name: "AllEvents", value: 2147483647, isUnsigned: true)
!393 = !{!394, !395, !397, !407, !408, !459, !402, !616, !619, !618, !620, !403, !621, !562, !623}
!394 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !396, line: 46, baseType: !394)
!396 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelPacket", file: !326, line: 148, baseType: !399)
!399 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PixelPacket", file: !326, line: 131, size: 64, elements: !400)
!400 = !{!401, !404, !405, !406}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !399, file: !326, line: 143, baseType: !402, size: 16)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "Quantum", file: !4, line: 93, baseType: !403)
!403 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !399, file: !326, line: 144, baseType: !402, size: 16, offset: 16)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !399, file: !326, line: 145, baseType: !402, size: 16, offset: 32)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "opacity", scope: !399, file: !326, line: 146, baseType: !402, size: 16, offset: 48)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "Image", file: !4, line: 221, baseType: !410)
!410 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Image", file: !77, line: 150, size: 105920, elements: !411)
!411 = !{!412, !414, !416, !418, !419, !421, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !434, !448, !450, !451, !453, !456, !457, !458, !464, !465, !466, !474, !475, !476, !477, !478, !479, !481, !483, !485, !487, !489, !491, !493, !494, !495, !496, !497, !498, !499, !507, !522, !536, !537, !538, !539, !543, !547, !551, !552, !553, !554, !555, !573, !574, !576, !577, !587, !588, !590, !591, !592, !593, !594, !595, !597, !598, !599, !600, !601, !602, !603, !605, !606, !607, !608, !609, !613, !615}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "storage_class", scope: !410, file: !77, line: 153, baseType: !413, size: 32)
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "ClassType", file: !4, line: 209, baseType: !9)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !410, file: !77, line: 156, baseType: !415, size: 32, offset: 32)
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorspaceType", file: !15, line: 61, baseType: !14)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !410, file: !77, line: 159, baseType: !417, size: 32, offset: 64)
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompressionType", file: !52, line: 49, baseType: !51)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !410, file: !77, line: 162, baseType: !395, size: 64, offset: 128)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "orientation", scope: !410, file: !77, line: 165, baseType: !420, size: 32, offset: 192)
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "OrientationType", file: !77, line: 86, baseType: !76)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "taint", scope: !410, file: !77, line: 168, baseType: !422, size: 32, offset: 224)
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickBooleanType", file: !4, line: 215, baseType: !3)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "matte", scope: !410, file: !77, line: 169, baseType: !422, size: 32, offset: 256)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "columns", scope: !410, file: !77, line: 172, baseType: !395, size: 64, offset: 320)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "rows", scope: !410, file: !77, line: 173, baseType: !395, size: 64, offset: 384)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !410, file: !77, line: 174, baseType: !395, size: 64, offset: 448)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !410, file: !77, line: 175, baseType: !395, size: 64, offset: 512)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "colormap", scope: !410, file: !77, line: 178, baseType: !397, size: 64, offset: 576)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "background_color", scope: !410, file: !77, line: 179, baseType: !398, size: 64, offset: 640)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "border_color", scope: !410, file: !77, line: 180, baseType: !398, size: 64, offset: 704)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "matte_color", scope: !410, file: !77, line: 181, baseType: !398, size: 64, offset: 768)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !410, file: !77, line: 184, baseType: !433, size: 64, offset: 832)
!433 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "chromaticity", scope: !410, file: !77, line: 187, baseType: !435, size: 768, offset: 896)
!435 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChromaticityInfo", file: !77, line: 128, baseType: !436)
!436 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ChromaticityInfo", file: !77, line: 121, size: 768, elements: !437)
!437 = !{!438, !445, !446, !447}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "red_primary", scope: !436, file: !77, line: 124, baseType: !439, size: 192)
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "PrimaryInfo", file: !77, line: 101, baseType: !440)
!440 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_PrimaryInfo", file: !77, line: 95, size: 192, elements: !441)
!441 = !{!442, !443, !444}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !440, file: !77, line: 98, baseType: !433, size: 64)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !440, file: !77, line: 99, baseType: !433, size: 64, offset: 64)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !440, file: !77, line: 100, baseType: !433, size: 64, offset: 128)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "green_primary", scope: !436, file: !77, line: 125, baseType: !439, size: 192, offset: 192)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "blue_primary", scope: !436, file: !77, line: 126, baseType: !439, size: 192, offset: 384)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "white_point", scope: !436, file: !77, line: 127, baseType: !439, size: 192, offset: 576)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "rendering_intent", scope: !410, file: !77, line: 190, baseType: !449, size: 32, offset: 1664)
!449 = !DIDerivedType(tag: DW_TAG_typedef, name: "RenderingIntent", file: !89, line: 49, baseType: !88)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !410, file: !77, line: 193, baseType: !407, size: 64, offset: 1728)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !410, file: !77, line: 196, baseType: !452, size: 32, offset: 1792)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "ResolutionType", file: !77, line: 93, baseType: !96)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "montage", scope: !410, file: !77, line: 199, baseType: !454, size: 64, offset: 1856)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64)
!455 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "directory", scope: !410, file: !77, line: 200, baseType: !454, size: 64, offset: 1920)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "geometry", scope: !410, file: !77, line: 201, baseType: !454, size: 64, offset: 1984)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !410, file: !77, line: 204, baseType: !459, size: 64, offset: 2048)
!459 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !460, line: 77, baseType: !461)
!460 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !462, line: 193, baseType: !463)
!462 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!463 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "x_resolution", scope: !410, file: !77, line: 207, baseType: !433, size: 64, offset: 2112)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "y_resolution", scope: !410, file: !77, line: 208, baseType: !433, size: 64, offset: 2176)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "page", scope: !410, file: !77, line: 211, baseType: !467, size: 256, offset: 2240)
!467 = !DIDerivedType(tag: DW_TAG_typedef, name: "RectangleInfo", file: !153, line: 130, baseType: !468)
!468 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_RectangleInfo", file: !153, line: 121, size: 256, elements: !469)
!469 = !{!470, !471, !472, !473}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !468, file: !153, line: 124, baseType: !395, size: 64)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !468, file: !153, line: 125, baseType: !395, size: 64, offset: 64)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !468, file: !153, line: 128, baseType: !459, size: 64, offset: 128)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !468, file: !153, line: 129, baseType: !459, size: 64, offset: 192)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "extract_info", scope: !410, file: !77, line: 212, baseType: !467, size: 256, offset: 2496)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "tile_info", scope: !410, file: !77, line: 213, baseType: !467, size: 256, offset: 2752)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "bias", scope: !410, file: !77, line: 216, baseType: !433, size: 64, offset: 3008)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "blur", scope: !410, file: !77, line: 217, baseType: !433, size: 64, offset: 3072)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "fuzz", scope: !410, file: !77, line: 218, baseType: !433, size: 64, offset: 3136)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !410, file: !77, line: 221, baseType: !480, size: 32, offset: 3200)
!480 = !DIDerivedType(tag: DW_TAG_typedef, name: "FilterTypes", file: !102, line: 66, baseType: !101)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "interlace", scope: !410, file: !77, line: 224, baseType: !482, size: 32, offset: 3232)
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterlaceType", file: !77, line: 73, baseType: !136)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "endian", scope: !410, file: !77, line: 227, baseType: !484, size: 32, offset: 3264)
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "EndianType", file: !147, line: 35, baseType: !146)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "gravity", scope: !410, file: !77, line: 230, baseType: !486, size: 32, offset: 3296)
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "GravityType", file: !153, line: 91, baseType: !152)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "compose", scope: !410, file: !77, line: 233, baseType: !488, size: 32, offset: 3328)
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "CompositeOperator", file: !168, line: 99, baseType: !167)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "dispose", scope: !410, file: !77, line: 236, baseType: !490, size: 32, offset: 3360)
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "DisposeType", file: !239, line: 32, baseType: !238)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "clip_mask", scope: !410, file: !77, line: 239, baseType: !492, size: 64, offset: 3392)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "scene", scope: !410, file: !77, line: 242, baseType: !395, size: 64, offset: 3456)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !410, file: !77, line: 243, baseType: !395, size: 64, offset: 3520)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_second", scope: !410, file: !77, line: 246, baseType: !459, size: 64, offset: 3584)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "iterations", scope: !410, file: !77, line: 249, baseType: !395, size: 64, offset: 3648)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "total_colors", scope: !410, file: !77, line: 250, baseType: !395, size: 64, offset: 3712)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "start_loop", scope: !410, file: !77, line: 253, baseType: !459, size: 64, offset: 3776)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !410, file: !77, line: 256, baseType: !500, size: 192, offset: 3840)
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "ErrorInfo", file: !501, line: 68, baseType: !502)
!501 = !DIFile(filename: "./magick/color.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!502 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ErrorInfo", file: !501, line: 62, size: 192, elements: !503)
!503 = !{!504, !505, !506}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "mean_error_per_pixel", scope: !502, file: !501, line: 65, baseType: !433, size: 64)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_mean_error", scope: !502, file: !501, line: 66, baseType: !433, size: 64, offset: 64)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "normalized_maximum_error", scope: !502, file: !501, line: 67, baseType: !433, size: 64, offset: 128)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !410, file: !77, line: 259, baseType: !508, size: 512, offset: 4032)
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerInfo", file: !247, line: 51, baseType: !509)
!509 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_TimerInfo", file: !247, line: 40, size: 512, elements: !510)
!510 = !{!511, !518, !519, !521}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !509, file: !247, line: 43, baseType: !512, size: 192)
!512 = !DIDerivedType(tag: DW_TAG_typedef, name: "Timer", file: !247, line: 38, baseType: !513)
!513 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Timer", file: !247, line: 32, size: 192, elements: !514)
!514 = !{!515, !516, !517}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !513, file: !247, line: 35, baseType: !433, size: 64)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !513, file: !247, line: 36, baseType: !433, size: 64, offset: 64)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !513, file: !247, line: 37, baseType: !433, size: 64, offset: 128)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "elapsed", scope: !509, file: !247, line: 44, baseType: !512, size: 192, offset: 192)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !509, file: !247, line: 47, baseType: !520, size: 32, offset: 384)
!520 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimerState", file: !247, line: 30, baseType: !246)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !509, file: !247, line: 50, baseType: !395, size: 64, offset: 448)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "progress_monitor", scope: !410, file: !77, line: 262, baseType: !523, size: 64, offset: 4544)
!523 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickProgressMonitor", file: !524, line: 26, baseType: !525)
!524 = !DIFile(filename: "./magick/monitor.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64)
!526 = !DISubroutineType(types: !527)
!527 = !{!422, !528, !530, !533, !407}
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 64)
!529 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !455)
!530 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !531)
!531 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickOffsetType", file: !4, line: 150, baseType: !532)
!532 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!533 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !534)
!534 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickSizeType", file: !4, line: 151, baseType: !535)
!535 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "client_data", scope: !410, file: !77, line: 265, baseType: !407, size: 64, offset: 4608)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !410, file: !77, line: 266, baseType: !407, size: 64, offset: 4672)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !410, file: !77, line: 267, baseType: !407, size: 64, offset: 4736)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "ascii85", scope: !410, file: !77, line: 270, baseType: !540, size: 64, offset: 4800)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64)
!541 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ascii85Info", file: !52, line: 52, baseType: !542)
!542 = !DICompositeType(tag: DW_TAG_structure_type, name: "_Ascii85Info", file: !52, line: 51, flags: DIFlagFwdDecl)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "blob", scope: !410, file: !77, line: 273, baseType: !544, size: 64, offset: 4864)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64)
!545 = !DIDerivedType(tag: DW_TAG_typedef, name: "BlobInfo", file: !4, line: 217, baseType: !546)
!546 = !DICompositeType(tag: DW_TAG_structure_type, name: "_BlobInfo", file: !4, line: 217, flags: DIFlagFwdDecl)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !410, file: !77, line: 276, baseType: !548, size: 32768, offset: 4928)
!548 = !DICompositeType(tag: DW_TAG_array_type, baseType: !455, size: 32768, elements: !549)
!549 = !{!550}
!550 = !DISubrange(count: 4096)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "magick_filename", scope: !410, file: !77, line: 277, baseType: !548, size: 32768, offset: 37696)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "magick", scope: !410, file: !77, line: 278, baseType: !548, size: 32768, offset: 70464)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "magick_columns", scope: !410, file: !77, line: 281, baseType: !395, size: 64, offset: 103232)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "magick_rows", scope: !410, file: !77, line: 282, baseType: !395, size: 64, offset: 103296)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "exception", scope: !410, file: !77, line: 285, baseType: !556, size: 448, offset: 103360)
!556 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionInfo", file: !4, line: 219, baseType: !557)
!557 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ExceptionInfo", file: !253, line: 102, size: 448, elements: !558)
!558 = !{!559, !561, !563, !564, !565, !566, !567, !572}
!559 = !DIDerivedType(tag: DW_TAG_member, name: "severity", scope: !557, file: !253, line: 105, baseType: !560, size: 32)
!560 = !DIDerivedType(tag: DW_TAG_typedef, name: "ExceptionType", file: !253, line: 100, baseType: !252)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "error_number", scope: !557, file: !253, line: 108, baseType: !562, size: 32, offset: 32)
!562 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "reason", scope: !557, file: !253, line: 111, baseType: !454, size: 64, offset: 64)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !557, file: !253, line: 112, baseType: !454, size: 64, offset: 128)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "exceptions", scope: !557, file: !253, line: 115, baseType: !407, size: 64, offset: 192)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "relinquish", scope: !557, file: !253, line: 118, baseType: !422, size: 32, offset: 256)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !557, file: !253, line: 121, baseType: !568, size: 64, offset: 320)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64)
!569 = !DIDerivedType(tag: DW_TAG_typedef, name: "SemaphoreInfo", file: !570, line: 26, baseType: !571)
!570 = !DIFile(filename: "./magick/semaphore.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/538.imagick_r/build/build_base_ld-loop-ext-m64.0000")
!571 = !DICompositeType(tag: DW_TAG_structure_type, name: "SemaphoreInfo", file: !570, line: 25, flags: DIFlagFwdDecl)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !557, file: !253, line: 124, baseType: !395, size: 64, offset: 384)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !410, file: !77, line: 288, baseType: !422, size: 32, offset: 103808)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "reference_count", scope: !410, file: !77, line: 291, baseType: !575, size: 64, offset: 103872)
!575 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !459)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "semaphore", scope: !410, file: !77, line: 294, baseType: !568, size: 64, offset: 103936)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "color_profile", scope: !410, file: !77, line: 297, baseType: !578, size: 256, offset: 104000)
!578 = !DIDerivedType(tag: DW_TAG_typedef, name: "ProfileInfo", file: !89, line: 40, baseType: !579)
!579 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ProfileInfo", file: !89, line: 27, size: 256, elements: !580)
!580 = !{!581, !582, !583, !586}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !579, file: !89, line: 30, baseType: !454, size: 64)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !579, file: !89, line: 33, baseType: !395, size: 64, offset: 64)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "info", scope: !579, file: !89, line: 36, baseType: !584, size: 64, offset: 128)
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64)
!585 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !579, file: !89, line: 39, baseType: !395, size: 64, offset: 192)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "iptc_profile", scope: !410, file: !77, line: 298, baseType: !578, size: 256, offset: 104256)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profile", scope: !410, file: !77, line: 299, baseType: !589, size: 64, offset: 104512)
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 64)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "generic_profiles", scope: !410, file: !77, line: 302, baseType: !395, size: 64, offset: 104576)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !410, file: !77, line: 305, baseType: !395, size: 64, offset: 104640)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "previous", scope: !410, file: !77, line: 308, baseType: !492, size: 64, offset: 104704)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !410, file: !77, line: 309, baseType: !492, size: 64, offset: 104768)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !410, file: !77, line: 310, baseType: !492, size: 64, offset: 104832)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "interpolate", scope: !410, file: !77, line: 313, baseType: !596, size: 32, offset: 104896)
!596 = !DIDerivedType(tag: DW_TAG_typedef, name: "InterpolatePixelMethod", file: !326, line: 47, baseType: !325)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "black_point_compensation", scope: !410, file: !77, line: 316, baseType: !422, size: 32, offset: 104928)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_color", scope: !410, file: !77, line: 319, baseType: !398, size: 64, offset: 104960)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !410, file: !77, line: 322, baseType: !492, size: 64, offset: 105024)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "tile_offset", scope: !410, file: !77, line: 325, baseType: !467, size: 256, offset: 105088)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !410, file: !77, line: 328, baseType: !407, size: 64, offset: 105344)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "artifacts", scope: !410, file: !77, line: 329, baseType: !407, size: 64, offset: 105408)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !410, file: !77, line: 332, baseType: !604, size: 32, offset: 105472)
!604 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageType", file: !77, line: 61, baseType: !342)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !410, file: !77, line: 335, baseType: !422, size: 32, offset: 105504)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "extent", scope: !410, file: !77, line: 338, baseType: !534, size: 64, offset: 105536)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "ping", scope: !410, file: !77, line: 341, baseType: !422, size: 32, offset: 105600)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !410, file: !77, line: 344, baseType: !395, size: 64, offset: 105664)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !410, file: !77, line: 347, baseType: !610, size: 64, offset: 105728)
!610 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !611, line: 7, baseType: !612)
!611 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "")
!612 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !462, line: 160, baseType: !463)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "intensity", scope: !410, file: !77, line: 350, baseType: !614, size: 32, offset: 105792)
!614 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelIntensityMethod", file: !326, line: 79, baseType: !356)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !410, file: !77, line: 353, baseType: !395, size: 64, offset: 105856)
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !617, size: 64)
!617 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !618)
!618 = !DIDerivedType(tag: DW_TAG_typedef, name: "IndexPacket", file: !326, line: 129, baseType: !402)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 64)
!622 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !398)
!623 = !DIDerivedType(tag: DW_TAG_typedef, name: "MagickRealType", file: !4, line: 78, baseType: !624)
!624 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!625 = !{i32 7, !"Dwarf Version", i32 4}
!626 = !{i32 2, !"Debug Info Version", i32 3}
!627 = !{i32 1, !"wchar_size", i32 4}
!628 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!629 = distinct !DISubprogram(name: "AcquireImageColormap", scope: !1, file: !1, line: 120, type: !630, scopeLine: 122, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !633)
!630 = !DISubroutineType(types: !631)
!631 = !{!422, !408, !632}
!632 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !395)
!633 = !{}
!634 = !DILocalVariable(name: "image", arg: 1, scope: !629, file: !1, line: 120, type: !408)
!635 = !DILocation(line: 120, column: 60, scope: !629)
!636 = !DILocalVariable(name: "colors", arg: 2, scope: !629, file: !1, line: 121, type: !632)
!637 = !DILocation(line: 121, column: 16, scope: !629)
!638 = !DILocalVariable(name: "i", scope: !629, file: !1, line: 124, type: !459)
!639 = !DILocation(line: 124, column: 5, scope: !629)
!640 = !DILocalVariable(name: "length", scope: !629, file: !1, line: 127, type: !395)
!641 = !DILocation(line: 127, column: 5, scope: !629)
!642 = !DILocation(line: 134, column: 7, scope: !643)
!643 = distinct !DILexicalBlock(scope: !629, file: !1, line: 134, column: 7)
!644 = !DILocation(line: 134, column: 14, scope: !643)
!645 = !DILocation(line: 134, column: 20, scope: !643)
!646 = !DILocation(line: 134, column: 7, scope: !629)
!647 = !DILocation(line: 135, column: 61, scope: !643)
!648 = !DILocation(line: 135, column: 68, scope: !643)
!649 = !DILocation(line: 135, column: 12, scope: !643)
!650 = !DILocation(line: 135, column: 5, scope: !643)
!651 = !DILocation(line: 136, column: 17, scope: !629)
!652 = !DILocation(line: 136, column: 3, scope: !629)
!653 = !DILocation(line: 136, column: 10, scope: !629)
!654 = !DILocation(line: 136, column: 16, scope: !629)
!655 = !DILocation(line: 137, column: 19, scope: !629)
!656 = !DILocation(line: 137, column: 9, scope: !629)
!657 = !DILocation(line: 138, column: 7, scope: !658)
!658 = distinct !DILexicalBlock(scope: !629, file: !1, line: 138, column: 7)
!659 = !DILocation(line: 138, column: 14, scope: !658)
!660 = !DILocation(line: 138, column: 23, scope: !658)
!661 = !DILocation(line: 138, column: 7, scope: !629)
!662 = !DILocation(line: 139, column: 58, scope: !658)
!663 = !DILocation(line: 139, column: 37, scope: !658)
!664 = !DILocation(line: 139, column: 21, scope: !658)
!665 = !DILocation(line: 139, column: 5, scope: !658)
!666 = !DILocation(line: 139, column: 12, scope: !658)
!667 = !DILocation(line: 139, column: 20, scope: !658)
!668 = !DILocation(line: 142, column: 57, scope: !658)
!669 = !DILocation(line: 142, column: 64, scope: !658)
!670 = !DILocation(line: 142, column: 73, scope: !658)
!671 = !DILocation(line: 142, column: 37, scope: !658)
!672 = !DILocation(line: 142, column: 21, scope: !658)
!673 = !DILocation(line: 142, column: 5, scope: !658)
!674 = !DILocation(line: 142, column: 12, scope: !658)
!675 = !DILocation(line: 142, column: 20, scope: !658)
!676 = !DILocation(line: 144, column: 7, scope: !677)
