; ModuleID = 'liblzma/lz/lz_encoder_mf.c'
source_filename = "liblzma/lz/lz_encoder_mf.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.lzma_mf_s = type { i8*, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32 (%struct.lzma_mf_s*, %struct.lzma_match*)*, void (%struct.lzma_mf_s*, i32)*, i32*, i32*, i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.lzma_match = type { i32, i32 }

@lzma_crc32_table = external dso_local constant [8 x [256 x i32]], align 16

; Function Attrs: noinline nounwind uwtable
define dso_local i32 @lzma_mf_find(%struct.lzma_mf_s* %mf, i32* %count_ptr, %struct.lzma_match* %matches) #0 !dbg !20 {
entry:
  %mf.addr = alloca %struct.lzma_mf_s*, align 8
  %count_ptr.addr = alloca i32*, align 8
  %matches.addr = alloca %struct.lzma_match*, align 8
  %count = alloca i32, align 4
  %len_best = alloca i32, align 4
  %limit = alloca i32, align 4
  %p1 = alloca i8*, align 8
  %p2 = alloca i8*, align 8
  store %struct.lzma_mf_s* %mf, %struct.lzma_mf_s** %mf.addr, align 8
  call void @llvm.dbg.declare(metadata %struct.lzma_mf_s** %mf.addr, metadata !70, metadata !DIExpression()), !dbg !71
  store i32* %count_ptr, i32** %count_ptr.addr, align 8
  call void @llvm.dbg.declare(metadata i32** %count_ptr.addr, metadata !72, metadata !DIExpression()), !dbg !73
  store %struct.lzma_match* %matches, %struct.lzma_match** %matches.addr, align 8

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !11, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "liblzma/lz/lz_encoder_mf.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 250, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "liblzma/api/lzma/base.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9, !10}
!7 = !DIEnumerator(name: "LZMA_RUN", value: 0, isUnsigned: true)
!8 = !DIEnumerator(name: "LZMA_SYNC_FLUSH", value: 1, isUnsigned: true)
!9 = !DIEnumerator(name: "LZMA_FULL_FLUSH", value: 2, isUnsigned: true)
!10 = !DIEnumerator(name: "LZMA_FINISH", value: 3, isUnsigned: true)
!11 = !{!12}
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !13, line: 26, baseType: !14)
!13 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !15, line: 42, baseType: !5)
!15 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!16 = !{i32 7, !"Dwarf Version", i32 4}
!17 = !{i32 2, !"Debug Info Version", i32 3}
!18 = !{i32 1, !"wchar_size", i32 4}
!19 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!20 = distinct !DISubprogram(name: "lzma_mf_find", scope: !1, file: !1, line: 22, type: !21, scopeLine: 23, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !69)
!21 = !DISubroutineType(types: !22)
!22 = !{!12, !23, !57, !46}
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_mf", file: !25, line: 28, baseType: !26)
!25 = !DIFile(filename: "liblzma/lz/lz_encoder.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!26 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_mf_s", file: !25, line: 29, size: 960, elements: !27)
!27 = !{!28, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !52, !56, !58, !59, !60, !61, !62, !63, !64, !65, !67, !68}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !26, file: !25, line: 35, baseType: !29, size: 64)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !13, line: 24, baseType: !31)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !15, line: 38, baseType: !32)
!32 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !26, file: !25, line: 39, baseType: !12, size: 32, offset: 64)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "keep_size_before", scope: !26, file: !25, line: 45, baseType: !12, size: 32, offset: 96)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "keep_size_after", scope: !26, file: !25, line: 51, baseType: !12, size: 32, offset: 128)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !26, file: !25, line: 58, baseType: !12, size: 32, offset: 160)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "read_pos", scope: !26, file: !25, line: 63, baseType: !12, size: 32, offset: 192)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "read_ahead", scope: !26, file: !25, line: 67, baseType: !12, size: 32, offset: 224)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "read_limit", scope: !26, file: !25, line: 75, baseType: !12, size: 32, offset: 256)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "write_pos", scope: !26, file: !25, line: 80, baseType: !12, size: 32, offset: 288)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !26, file: !25, line: 84, baseType: !12, size: 32, offset: 320)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "find", scope: !26, file: !25, line: 92, baseType: !43, size: 64, offset: 384)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = !DISubroutineType(types: !45)
!45 = !{!12, !23, !46}
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_match", file: !25, line: 25, baseType: !48)
!48 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !25, line: 22, size: 64, elements: !49)
!49 = !{!50, !51}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !48, file: !25, line: 23, baseType: !12, size: 32)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !48, file: !25, line: 24, baseType: !12, size: 32, offset: 32)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "skip", scope: !26, file: !25, line: 97, baseType: !53, size: 64, offset: 448)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!54 = !DISubroutineType(types: !55)
!55 = !{null, !23, !12}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !26, file: !25, line: 99, baseType: !57, size: 64, offset: 512)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "son", scope: !26, file: !25, line: 100, baseType: !57, size: 64, offset: 576)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_pos", scope: !26, file: !25, line: 101, baseType: !12, size: 32, offset: 640)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_size", scope: !26, file: !25, line: 102, baseType: !12, size: 32, offset: 672)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "hash_mask", scope: !26, file: !25, line: 103, baseType: !12, size: 32, offset: 704)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !26, file: !25, line: 106, baseType: !12, size: 32, offset: 736)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "nice_len", scope: !26, file: !25, line: 109, baseType: !12, size: 32, offset: 768)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "match_len_max", scope: !26, file: !25, line: 114, baseType: !12, size: 32, offset: 800)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !26, file: !25, line: 119, baseType: !66, size: 32, offset: 832)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_action", file: !4, line: 322, baseType: !3)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "hash_size_sum", scope: !26, file: !25, line: 122, baseType: !12, size: 32, offset: 864)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "sons_count", scope: !26, file: !25, line: 125, baseType: !12, size: 32, offset: 896)
!69 = !{}
!70 = !DILocalVariable(name: "mf", arg: 1, scope: !20, file: !1, line: 22, type: !23)
!71 = !DILocation(line: 22, column: 23, scope: !20)
!72 = !DILocalVariable(name: "count_ptr", arg: 2, scope: !20, file: !1, line: 22, type: !57)
!73 = !DILocation(line: 22, column: 37, scope: !20)
!74 = !DILocalVariable(name: "matches", arg: 3, scope: !20, file: !1, line: 22, type: !46)
!75 = !DILocation(line: 22, column: 60, scope: !20)
!76 = !DILocalVariable(name: "count", scope: !20, file: !1, line: 27, type: !77)
!77 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !12)
!78 = !DILocation(line: 27, column: 17, scope: !20)
!79 = !DILocation(line: 27, column: 25, scope: !20)
!80 = !DILocation(line: 27, column: 29, scope: !20)
!81 = !DILocation(line: 27, column: 34, scope: !20)
!82 = !DILocation(line: 27, column: 38, scope: !20)
!83 = !DILocalVariable(name: "len_best", scope: !20, file: !1, line: 31, type: !12)
!84 = !DILocation(line: 31, column: 11, scope: !20)
!85 = !DILocation(line: 33, column: 6, scope: !86)
!86 = distinct !DILexicalBlock(scope: !20, file: !1, line: 33, column: 6)
!87 = !DILocation(line: 33, column: 12, scope: !86)
!88 = !DILocation(line: 33, column: 6, scope: !20)
!89 = !DILocation(line: 47, column: 14, scope: !90)
!90 = distinct !DILexicalBlock(scope: !86, file: !1, line: 33, column: 17)
!91 = !DILocation(line: 47, column: 22, scope: !90)
!92 = !DILocation(line: 47, column: 28, scope: !90)
!93 = !DILocation(line: 47, column: 33, scope: !90)
!94 = !DILocation(line: 47, column: 12, scope: !90)
!95 = !DILocation(line: 51, column: 7, scope: !96)
!96 = distinct !DILexicalBlock(scope: !90, file: !1, line: 51, column: 7)
!97 = !DILocation(line: 51, column: 19, scope: !96)
!98 = !DILocation(line: 51, column: 23, scope: !96)
!99 = !DILocation(line: 51, column: 16, scope: !96)
!100 = !DILocation(line: 51, column: 7, scope: !90)
!101 = !DILocalVariable(name: "limit", scope: !102, file: !1, line: 56, type: !12)
!102 = distinct !DILexicalBlock(scope: !96, file: !1, line: 51, column: 33)
!103 = !DILocation(line: 56, column: 13, scope: !102)
!104 = !DILocation(line: 56, column: 30, scope: !102)
!105 = !DILocation(line: 56, column: 21, scope: !102)
!106 = !DILocation(line: 56, column: 34, scope: !102)
!107 = !DILocation(line: 57, column: 8, scope: !108)
!108 = distinct !DILexicalBlock(scope: !102, file: !1, line: 57, column: 8)
!109 = !DILocation(line: 57, column: 16, scope: !108)
!110 = !DILocation(line: 57, column: 20, scope: !108)
!111 = !DILocation(line: 57, column: 14, scope: !108)
!112 = !DILocation(line: 57, column: 8, scope: !102)
!113 = !DILocation(line: 58, column: 13, scope: !108)
!114 = !DILocation(line: 58, column: 17, scope: !108)
!115 = !DILocation(line: 58, column: 11, scope: !108)
!116 = !DILocation(line: 58, column: 5, scope: !108)
!117 = !DILocalVariable(name: "p1", scope: !102, file: !1, line: 62, type: !118)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !30)
!120 = !DILocation(line: 62, column: 19, scope: !102)
!121 = !DILocation(line: 62, column: 31, scope: !102)
!122 = !DILocation(line: 62, column: 24, scope: !102)
!123 = !DILocation(line: 62, column: 35, scope: !102)
!124 = !DILocalVariable(name: "p2", scope: !102, file: !1, line: 66, type: !118)
!125 = !DILocation(line: 66, column: 19, scope: !102)
!126 = !DILocation(line: 66, column: 24, scope: !102)
!127 = !DILocation(line: 66, column: 29, scope: !102)
!128 = !DILocation(line: 66, column: 37, scope: !102)
!129 = !DILocation(line: 66, column: 43, scope: !102)
!130 = !DILocation(line: 66, column: 48, scope: !102)
!131 = !DILocation(line: 66, column: 27, scope: !102)
!132 = !DILocation(line: 66, column: 53, scope: !102)
!133 = !DILocation(line: 68, column: 4, scope: !102)
!134 = !DILocation(line: 68, column: 11, scope: !102)
