; ModuleID = 'xz/coder.c'
source_filename = "xz/coder.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.lzma_filter = type { i64, i8* }
%struct.lzma_options_lzma = type { i32, i8*, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i8*, i8* }
%union.io_buf = type { [1024 x i64] }
%struct.lzma_stream = type { i8*, i64, i64, i8*, i64, i64, %struct.lzma_allocator*, %struct.lzma_internal_s*, i8*, i8*, i8*, i8*, i64, i64, i64, i64, i32, i32 }
%struct.lzma_allocator = type { i8* (i8*, i64, i64)*, void (i8*, i8*)*, i8* }
%struct.lzma_internal_s = type opaque
%struct.file_pair = type { i8*, i8*, i32, i32, i8, i8, i64 }

@opt_mode = dso_local global i32 0, align 4, !dbg !0
@opt_format = dso_local global i32 0, align 4, !dbg !89
@opt_auto_adjust = dso_local global i8 1, align 1, !dbg !91
@check = internal global i32 0, align 4, !dbg !168
@check_default = internal global i8 1, align 1, !dbg !171
@preset_number = internal global i32 6, align 4, !dbg !173
@filters_count = internal global i32 0, align 4, !dbg !175
@.str = private unnamed_addr constant [34 x i8] c"Maximum number of filters is four\00", align 1
@filters = internal global [5 x %struct.lzma_filter] zeroinitializer, align 16, !dbg !137
@coder_set_compression_settings.opt_lzma = internal global %struct.lzma_options_lzma zeroinitializer, align 8, !dbg !94

!33 = !DIEnumerator(name: "LZMA_MF_HC3", value: 3, isUnsigned: true)
!34 = !DIEnumerator(name: "LZMA_MF_HC4", value: 4, isUnsigned: true)
!35 = !DIEnumerator(name: "LZMA_MF_BT2", value: 18, isUnsigned: true)
!36 = !DIEnumerator(name: "LZMA_MF_BT3", value: 19, isUnsigned: true)
!37 = !DIEnumerator(name: "LZMA_MF_BT4", value: 20, isUnsigned: true)
!38 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !39, line: 44, baseType: !7, size: 32, elements: !40)
!39 = !DIFile(filename: "liblzma/api/lzma/base.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!40 = !{!41}
!41 = !DIEnumerator(name: "LZMA_RESERVED_ENUM", value: 0, isUnsigned: true)
!42 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "message_verbosity", file: !43, line: 14, baseType: !7, size: 32, elements: !44)
!43 = !DIFile(filename: "xz/message.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!44 = !{!45, !46, !47, !48, !49}
!45 = !DIEnumerator(name: "V_SILENT", value: 0, isUnsigned: true)
!46 = !DIEnumerator(name: "V_ERROR", value: 1, isUnsigned: true)
!47 = !DIEnumerator(name: "V_WARNING", value: 2, isUnsigned: true)
!48 = !DIEnumerator(name: "V_VERBOSE", value: 3, isUnsigned: true)
!49 = !DIEnumerator(name: "V_DEBUG", value: 4, isUnsigned: true)
!50 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "coder_init_ret", file: !3, line: 17, baseType: !7, size: 32, elements: !51)
!51 = !{!52, !53, !54}
!52 = !DIEnumerator(name: "CODER_INIT_NORMAL", value: 0, isUnsigned: true)
!53 = !DIEnumerator(name: "CODER_INIT_PASSTHRU", value: 1, isUnsigned: true)
!54 = !DIEnumerator(name: "CODER_INIT_ERROR", value: 2, isUnsigned: true)
!55 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "exit_status_type", file: !56, line: 14, baseType: !7, size: 32, elements: !57)
!56 = !DIFile(filename: "xz/main.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!57 = !{!58, !59, !60}
!58 = !DIEnumerator(name: "E_SUCCESS", value: 0, isUnsigned: true)
!59 = !DIEnumerator(name: "E_ERROR", value: 1, isUnsigned: true)
!60 = !DIEnumerator(name: "E_WARNING", value: 2, isUnsigned: true)
!61 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !39, line: 57, baseType: !7, size: 32, elements: !62)
!62 = !{!63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74}
!63 = !DIEnumerator(name: "LZMA_OK", value: 0, isUnsigned: true)
!64 = !DIEnumerator(name: "LZMA_STREAM_END", value: 1, isUnsigned: true)
!65 = !DIEnumerator(name: "LZMA_NO_CHECK", value: 2, isUnsigned: true)
!66 = !DIEnumerator(name: "LZMA_UNSUPPORTED_CHECK", value: 3, isUnsigned: true)
!67 = !DIEnumerator(name: "LZMA_GET_CHECK", value: 4, isUnsigned: true)
!68 = !DIEnumerator(name: "LZMA_MEM_ERROR", value: 5, isUnsigned: true)
!69 = !DIEnumerator(name: "LZMA_MEMLIMIT_ERROR", value: 6, isUnsigned: true)
!70 = !DIEnumerator(name: "LZMA_FORMAT_ERROR", value: 7, isUnsigned: true)
!71 = !DIEnumerator(name: "LZMA_OPTIONS_ERROR", value: 8, isUnsigned: true)
!72 = !DIEnumerator(name: "LZMA_DATA_ERROR", value: 9, isUnsigned: true)
!73 = !DIEnumerator(name: "LZMA_BUF_ERROR", value: 10, isUnsigned: true)
!74 = !DIEnumerator(name: "LZMA_PROG_ERROR", value: 11, isUnsigned: true)
!75 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !39, line: 250, baseType: !7, size: 32, elements: !76)
!76 = !{!77, !78, !79, !80}
!77 = !DIEnumerator(name: "LZMA_RUN", value: 0, isUnsigned: true)
!78 = !DIEnumerator(name: "LZMA_SYNC_FLUSH", value: 1, isUnsigned: true)
!79 = !DIEnumerator(name: "LZMA_FULL_FLUSH", value: 2, isUnsigned: true)
!80 = !DIEnumerator(name: "LZMA_FINISH", value: 3, isUnsigned: true)
!81 = !{!82, !83}
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !84, line: 27, baseType: !85)
!84 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !86, line: 45, baseType: !87)
!86 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!87 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!88 = !{!0, !89, !91, !94, !137, !150, !168, !171, !173, !175, !177, !219, !227}
!89 = !DIGlobalVariableExpression(var: !90, expr: !DIExpression())
!90 = distinct !DIGlobalVariable(name: "opt_format", scope: !2, file: !3, line: 25, type: !13, isLocal: false, isDefinition: true)
!91 = !DIGlobalVariableExpression(var: !92, expr: !DIExpression())
!92 = distinct !DIGlobalVariable(name: "opt_auto_adjust", scope: !2, file: !3, line: 26, type: !93, isLocal: false, isDefinition: true)
!93 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!94 = !DIGlobalVariableExpression(var: !95, expr: !DIExpression())
!95 = distinct !DIGlobalVariable(name: "opt_lzma", scope: !96, file: !3, line: 129, type: !100, isLocal: true, isDefinition: true)
!96 = distinct !DISubprogram(name: "coder_set_compression_settings", scope: !3, file: !3, line: 126, type: !97, scopeLine: 127, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !99)
!97 = !DISubroutineType(types: !98)
!98 = !{null}
!99 = !{}
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_options_lzma", file: !27, line: 399, baseType: !101)
!101 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !27, line: 185, size: 896, elements: !102)
!102 = !{!103, !106, !112, !113, !114, !115, !116, !118, !119, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !132, !133, !134, !135, !136}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "dict_size", scope: !101, file: !27, line: 217, baseType: !104, size: 32)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !84, line: 26, baseType: !105)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !86, line: 42, baseType: !7)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "preset_dict", scope: !101, file: !27, line: 240, baseType: !107, size: 64, offset: 64)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !109)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !84, line: 24, baseType: !110)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !86, line: 38, baseType: !111)
!111 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "preset_dict_size", scope: !101, file: !27, line: 254, baseType: !104, size: 32, offset: 128)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "lc", scope: !101, file: !27, line: 281, baseType: !104, size: 32, offset: 160)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "lp", scope: !101, file: !27, line: 293, baseType: !104, size: 32, offset: 192)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !101, file: !27, line: 316, baseType: !104, size: 32, offset: 224)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !101, file: !27, line: 322, baseType: !117, size: 32, offset: 256)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_mode", file: !27, line: 155, baseType: !26)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "nice_len", scope: !101, file: !27, line: 342, baseType: !104, size: 32, offset: 288)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "mf", scope: !101, file: !27, line: 345, baseType: !120, size: 32, offset: 320)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_match_finder", file: !27, line: 111, baseType: !31)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !101, file: !27, line: 375, baseType: !104, size: 32, offset: 352)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int1", scope: !101, file: !27, line: 384, baseType: !104, size: 32, offset: 384)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int2", scope: !101, file: !27, line: 385, baseType: !104, size: 32, offset: 416)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int3", scope: !101, file: !27, line: 386, baseType: !104, size: 32, offset: 448)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int4", scope: !101, file: !27, line: 387, baseType: !104, size: 32, offset: 480)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int5", scope: !101, file: !27, line: 388, baseType: !104, size: 32, offset: 512)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int6", scope: !101, file: !27, line: 389, baseType: !104, size: 32, offset: 544)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int7", scope: !101, file: !27, line: 390, baseType: !104, size: 32, offset: 576)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int8", scope: !101, file: !27, line: 391, baseType: !104, size: 32, offset: 608)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum1", scope: !101, file: !27, line: 392, baseType: !131, size: 32, offset: 640)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_reserved_enum", file: !39, line: 46, baseType: !38)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum2", scope: !101, file: !27, line: 393, baseType: !131, size: 32, offset: 672)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum3", scope: !101, file: !27, line: 394, baseType: !131, size: 32, offset: 704)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum4", scope: !101, file: !27, line: 395, baseType: !131, size: 32, offset: 736)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr1", scope: !101, file: !27, line: 396, baseType: !82, size: 64, offset: 768)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr2", scope: !101, file: !27, line: 397, baseType: !82, size: 64, offset: 832)
!137 = !DIGlobalVariableExpression(var: !138, expr: !DIExpression())
!138 = distinct !DIGlobalVariable(name: "filters", scope: !2, file: !3, line: 33, type: !139, isLocal: true, isDefinition: true)
!139 = !DICompositeType(tag: DW_TAG_array_type, baseType: !140, size: 640, elements: !148)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_filter", file: !141, line: 65, baseType: !142)
!141 = !DIFile(filename: "liblzma/api/lzma/filter.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!142 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !141, line: 43, size: 128, elements: !143)
!143 = !{!144, !147}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !142, file: !141, line: 54, baseType: !145, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_vli", file: !146, line: 63, baseType: !83)
!146 = !DIFile(filename: "liblzma/api/lzma/vli.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!147 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !142, file: !141, line: 63, baseType: !82, size: 64, offset: 64)
!148 = !{!149}
!149 = !DISubrange(count: 5)
!150 = !DIGlobalVariableExpression(var: !151, expr: !DIExpression())
!151 = distinct !DIGlobalVariable(name: "in_buf", scope: !2, file: !3, line: 36, type: !152, isLocal: true, isDefinition: true)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "io_buf", file: !153, line: 28, baseType: !154)
!153 = !DIFile(filename: "xz/file_io.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!154 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !153, line: 24, size: 65536, elements: !155)
!155 = !{!156, !160, !164}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "u8", scope: !154, file: !153, line: 25, baseType: !157, size: 65536)
!157 = !DICompositeType(tag: DW_TAG_array_type, baseType: !109, size: 65536, elements: !158)
!158 = !{!159}
!159 = !DISubrange(count: 8192)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "u32", scope: !154, file: !153, line: 26, baseType: !161, size: 65536)
!161 = !DICompositeType(tag: DW_TAG_array_type, baseType: !104, size: 65536, elements: !162)
!162 = !{!163}
!163 = !DISubrange(count: 2048)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "u64", scope: !154, file: !153, line: 27, baseType: !165, size: 65536)
!165 = !DICompositeType(tag: DW_TAG_array_type, baseType: !83, size: 65536, elements: !166)
!166 = !{!167}
!167 = !DISubrange(count: 1024)
!168 = !DIGlobalVariableExpression(var: !169, expr: !DIExpression())
!169 = distinct !DIGlobalVariable(name: "check", scope: !2, file: !3, line: 46, type: !170, isLocal: true, isDefinition: true)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_check", file: !20, line: 55, baseType: !19)
!171 = !DIGlobalVariableExpression(var: !172, expr: !DIExpression())
!172 = distinct !DIGlobalVariable(name: "check_default", scope: !2, file: !3, line: 49, type: !93, isLocal: true, isDefinition: true)
!173 = !DIGlobalVariableExpression(var: !174, expr: !DIExpression())
!174 = distinct !DIGlobalVariable(name: "preset_number", scope: !2, file: !3, line: 43, type: !104, isLocal: true, isDefinition: true)
!175 = !DIGlobalVariableExpression(var: !176, expr: !DIExpression())
!176 = distinct !DIGlobalVariable(name: "filters_count", scope: !2, file: !3, line: 40, type: !104, isLocal: true, isDefinition: true)
!177 = !DIGlobalVariableExpression(var: !178, expr: !DIExpression())
!178 = distinct !DIGlobalVariable(name: "strm", scope: !2, file: !3, line: 30, type: !179, isLocal: true, isDefinition: true)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_stream", file: !39, line: 490, baseType: !180)
!180 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !39, line: 453, size: 1088, elements: !181)
!181 = !{!182, !183, !186, !187, !189, !190, !191, !205, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "next_in", scope: !180, file: !39, line: 454, baseType: !107, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "avail_in", scope: !180, file: !39, line: 455, baseType: !184, size: 64, offset: 64)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !185, line: 46, baseType: !87)
!185 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!186 = !DIDerivedType(tag: DW_TAG_member, name: "total_in", scope: !180, file: !39, line: 456, baseType: !83, size: 64, offset: 128)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "next_out", scope: !180, file: !39, line: 458, baseType: !188, size: 64, offset: 192)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "avail_out", scope: !180, file: !39, line: 459, baseType: !184, size: 64, offset: 256)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "total_out", scope: !180, file: !39, line: 460, baseType: !83, size: 64, offset: 320)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !180, file: !39, line: 468, baseType: !192, size: 64, offset: 384)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_allocator", file: !39, line: 403, baseType: !194)
!194 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !39, line: 341, size: 192, elements: !195)
!195 = !{!196, !200, !204}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !194, file: !39, line: 376, baseType: !197, size: 64)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!198 = !DISubroutineType(types: !199)
!199 = !{!82, !82, !184, !184}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !194, file: !39, line: 390, baseType: !201, size: 64, offset: 64)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = !DISubroutineType(types: !203)
!203 = !{null, !82, !82}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !194, file: !39, line: 401, baseType: !82, size: 64, offset: 128)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !180, file: !39, line: 471, baseType: !206, size: 64, offset: 448)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_internal", file: !39, line: 411, baseType: !208)
!208 = !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_internal_s", file: !39, line: 411, flags: DIFlagFwdDecl)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr1", scope: !180, file: !39, line: 479, baseType: !82, size: 64, offset: 512)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr2", scope: !180, file: !39, line: 480, baseType: !82, size: 64, offset: 576)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr3", scope: !180, file: !39, line: 481, baseType: !82, size: 64, offset: 640)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr4", scope: !180, file: !39, line: 482, baseType: !82, size: 64, offset: 704)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int1", scope: !180, file: !39, line: 483, baseType: !83, size: 64, offset: 768)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int2", scope: !180, file: !39, line: 484, baseType: !83, size: 64, offset: 832)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int3", scope: !180, file: !39, line: 485, baseType: !184, size: 64, offset: 896)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int4", scope: !180, file: !39, line: 486, baseType: !184, size: 64, offset: 960)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum1", scope: !180, file: !39, line: 487, baseType: !131, size: 32, offset: 1024)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum2", scope: !180, file: !39, line: 488, baseType: !131, size: 32, offset: 1056)
!219 = !DIGlobalVariableExpression(var: !220, expr: !DIExpression())
!220 = distinct !DIGlobalVariable(name: "magic", scope: !221, file: !3, line: 295, type: !224, isLocal: true, isDefinition: true)
!221 = distinct !DISubprogram(name: "is_format_xz", scope: !3, file: !3, line: 292, type: !222, scopeLine: 293, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !99)
!222 = !DISubroutineType(types: !223)
!223 = !{!93}
!224 = !DICompositeType(tag: DW_TAG_array_type, baseType: !108, size: 48, elements: !225)
!225 = !{!226}
!226 = !DISubrange(count: 6)
!227 = !DIGlobalVariableExpression(var: !228, expr: !DIExpression())
!228 = distinct !DIGlobalVariable(name: "out_buf", scope: !2, file: !3, line: 37, type: !152, isLocal: true, isDefinition: true)
!229 = !{i32 7, !"Dwarf Version", i32 4}
!230 = !{i32 2, !"Debug Info Version", i32 3}
!231 = !{i32 1, !"wchar_size", i32 4}
!232 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!233 = distinct !DISubprogram(name: "coder_set_check", scope: !3, file: !3, line: 53, type: !234, scopeLine: 54, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !99)
!234 = !DISubroutineType(types: !235)
!235 = !{null, !170}
!236 = !DILocalVariable(name: "new_check", arg: 1, scope: !233, file: !3, line: 53, type: !170)
!237 = !DILocation(line: 53, column: 28, scope: !233)
!238 = !DILocation(line: 55, column: 10, scope: !233)
!239 = !DILocation(line: 55, column: 8, scope: !233)
!240 = !DILocation(line: 56, column: 16, scope: !233)
!241 = !DILocation(line: 57, column: 2, scope: !233)
!242 = distinct !DISubprogram(name: "coder_set_preset", scope: !3, file: !3, line: 77, type: !243, scopeLine: 78, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !99)
!243 = !DISubroutineType(types: !244)
!244 = !{null, !104}
!245 = !DILocalVariable(name: "new_preset", arg: 1, scope: !242, file: !3, line: 77, type: !104)
!246 = !DILocation(line: 77, column: 27, scope: !242)
!247 = !DILocation(line: 79, column: 16, scope: !242)
!248 = !DILocation(line: 80, column: 19, scope: !242)
!249 = !DILocation(line: 80, column: 16, scope: !242)
!250 = !DILocation(line: 81, column: 2, scope: !242)
!251 = !DILocation(line: 82, column: 2, scope: !242)
!252 = distinct !DISubprogram(name: "forget_filter_chain", scope: !3, file: !3, line: 62, type: !97, scopeLine: 63, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !99)
!253 = !DILocation(line: 66, column: 2, scope: !252)
!254 = !DILocation(line: 66, column: 9, scope: !252)
!255 = !DILocation(line: 66, column: 23, scope: !252)
!256 = !DILocation(line: 67, column: 3, scope: !257)
!257 = distinct !DILexicalBlock(scope: !252, file: !3, line: 66, column: 28)
!258 = !DILocation(line: 68, column: 16, scope: !257)
!259 = !DILocation(line: 68, column: 8, scope: !257)
!260 = !DILocation(line: 68, column: 31, scope: !257)
!261 = !DILocation(line: 68, column: 3, scope: !257)
!262 = !DILocation(line: 69, column: 11, scope: !257)
!263 = !DILocation(line: 69, column: 3, scope: !257)
!264 = !DILocation(line: 69, column: 26, scope: !257)
!265 = !DILocation(line: 69, column: 34, scope: !257)
!266 = distinct !{!266, !253, !267}
!267 = !DILocation(line: 70, column: 2, scope: !252)
!268 = !DILocation(line: 72, column: 2, scope: !252)
!269 = distinct !DISubprogram(name: "coder_set_extreme", scope: !3, file: !3, line: 87, type: !97, scopeLine: 88, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !99)
!270 = !DILocation(line: 89, column: 16, scope: !269)
!271 = !DILocation(line: 90, column: 2, scope: !269)
!272 = !DILocation(line: 91, column: 2, scope: !269)
!273 = distinct !DISubprogram(name: "coder_add_filter", scope: !3, file: !3, line: 96, type: !274, scopeLine: 97, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !99)
!274 = !DISubroutineType(types: !275)
!275 = !{null, !145, !82}
!276 = !DILocalVariable(name: "id", arg: 1, scope: !273, file: !3, line: 96, type: !145)
!277 = !DILocation(line: 96, column: 27, scope: !273)
!278 = !DILocalVariable(name: "options", arg: 2, scope: !273, file: !3, line: 96, type: !82)
!279 = !DILocation(line: 96, column: 37, scope: !273)
!280 = !DILocation(line: 98, column: 6, scope: !281)
!281 = distinct !DILexicalBlock(scope: !273, file: !3, line: 98, column: 6)
!282 = !DILocation(line: 98, column: 20, scope: !281)
!283 = !DILocation(line: 98, column: 6, scope: !273)
!284 = !DILocation(line: 99, column: 3, scope: !281)
!285 = !DILocation(line: 101, column: 30, scope: !273)
!286 = !DILocation(line: 101, column: 10, scope: !273)
!287 = !DILocation(line: 101, column: 2, scope: !273)
!288 = !DILocation(line: 101, column: 25, scope: !273)
!289 = !DILocation(line: 101, column: 28, scope: !273)
!290 = !DILocation(line: 102, column: 35, scope: !273)
!291 = !DILocation(line: 102, column: 10, scope: !273)
!292 = !DILocation(line: 102, column: 2, scope: !273)
!293 = !DILocation(line: 102, column: 25, scope: !273)
!294 = !DILocation(line: 102, column: 33, scope: !273)
!295 = !DILocation(line: 103, column: 2, scope: !273)
!296 = !DILocation(line: 109, column: 16, scope: !273)
!297 = !DILocation(line: 111, column: 2, scope: !273)
!298 = !DILocation(line: 131, column: 6, scope: !299)
!299 = distinct !DILexicalBlock(scope: !96, file: !3, line: 131, column: 6)
!300 = !DILocation(line: 131, column: 20, scope: !299)
!301 = !DILocation(line: 131, column: 6, scope: !96)
!302 = !DILocation(line: 136, column: 7, scope: !303)
!303 = distinct !DILexicalBlock(scope: !304, file: !3, line: 136, column: 7)
!304 = distinct !DILexicalBlock(scope: !299, file: !3, line: 131, column: 26)
!305 = !DILocation(line: 136, column: 18, scope: !303)
!306 = !DILocation(line: 136, column: 7, scope: !304)
!307 = !DILocation(line: 139, column: 4, scope: !308)
!308 = distinct !DILexicalBlock(scope: !303, file: !3, line: 136, column: 33)
!309 = !DILocation(line: 141, column: 4, scope: !308)
!310 = !DILocation(line: 144, column: 3, scope: !308)
!311 = !DILocation(line: 147, column: 35, scope: !312)
!312 = distinct !DILexicalBlock(scope: !304, file: !3, line: 147, column: 7)
!313 = !DILocation(line: 147, column: 7, scope: !312)
!314 = !DILocation(line: 147, column: 7, scope: !304)
!315 = !DILocation(line: 148, column: 4, scope: !312)
!316 = !DILocation(line: 151, column: 19, scope: !304)
!317 = !DILocation(line: 151, column: 30, scope: !304)
!318 = !DILocation(line: 151, column: 17, scope: !304)
!319 = !DILocation(line: 153, column: 22, scope: !304)
!320 = !DILocation(line: 154, column: 17, scope: !304)
!321 = !DILocation(line: 155, column: 2, scope: !304)
!322 = !DILocation(line: 158, column: 10, scope: !96)
!323 = !DILocation(line: 158, column: 2, scope: !96)
!324 = !DILocation(line: 158, column: 25, scope: !96)
!325 = !DILocation(line: 158, column: 28, scope: !96)
!326 = !DILocation(line: 162, column: 6, scope: !327)
!327 = distinct !DILexicalBlock(scope: !96, file: !3, line: 162, column: 6)
!328 = !DILocation(line: 162, column: 17, scope: !327)
!329 = !DILocation(line: 162, column: 32, scope: !327)
!330 = !DILocation(line: 162, column: 36, scope: !327)
!331 = !DILocation(line: 162, column: 50, scope: !327)
!332 = !DILocation(line: 163, column: 4, scope: !327)
!333 = !DILocation(line: 163, column: 18, scope: !327)
!334 = !DILocation(line: 163, column: 21, scope: !327)
!335 = !DILocation(line: 162, column: 6, scope: !96)
!336 = !DILocation(line: 164, column: 3, scope: !327)
!337 = !DILocation(line: 169, column: 6, scope: !338)
!338 = distinct !DILexicalBlock(scope: !96, file: !3, line: 169, column: 6)
!339 = !DILocation(line: 169, column: 17, scope: !338)
!340 = !DILocation(line: 169, column: 6, scope: !96)
!341 = !DILocalVariable(name: "i", scope: !342, file: !3, line: 170, type: !184)
!342 = distinct !DILexicalBlock(scope: !338, file: !3, line: 170, column: 3)
!343 = !DILocation(line: 170, column: 15, scope: !342)
!344 = !DILocation(line: 170, column: 8, scope: !342)
!345 = !DILocation(line: 170, column: 22, scope: !346)
!346 = distinct !DILexicalBlock(scope: !342, file: !3, line: 170, column: 3)
!347 = !DILocation(line: 170, column: 26, scope: !346)
!348 = !DILocation(line: 170, column: 24, scope: !346)
!349 = !DILocation(line: 170, column: 3, scope: !342)
!350 = !DILocation(line: 171, column: 16, scope: !351)
!351 = distinct !DILexicalBlock(scope: !346, file: !3, line: 171, column: 8)
!352 = !DILocation(line: 171, column: 8, scope: !351)
!353 = !DILocation(line: 171, column: 19, scope: !351)
!354 = !DILocation(line: 171, column: 22, scope: !351)
!355 = !DILocation(line: 171, column: 8, scope: !346)
!356 = !DILocation(line: 172, column: 5, scope: !351)
!357 = !DILocation(line: 171, column: 25, scope: !351)
!358 = !DILocation(line: 170, column: 41, scope: !346)
!359 = !DILocation(line: 170, column: 3, scope: !346)
!360 = distinct !{!360, !349, !361}
!361 = !DILocation(line: 173, column: 29, scope: !342)
!362 = !DILocation(line: 176, column: 2, scope: !96)
!363 = !DILocalVariable(name: "memory_limit", scope: !96, file: !3, line: 181, type: !364)
!364 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !83)
!365 = !DILocation(line: 181, column: 17, scope: !96)
!366 = !DILocation(line: 181, column: 54, scope: !96)
!367 = !DILocation(line: 181, column: 32, scope: !96)
!368 = !DILocalVariable(name: "memory_usage", scope: !96, file: !3, line: 182, type: !83)
!369 = !DILocation(line: 182, column: 11, scope: !96)
!370 = !DILocation(line: 183, column: 6, scope: !371)
!371 = distinct !DILexicalBlock(scope: !96, file: !3, line: 183, column: 6)
!372 = !DILocation(line: 183, column: 15, scope: !371)
!373 = !DILocation(line: 183, column: 6, scope: !96)
!374 = !DILocation(line: 184, column: 18, scope: !371)
!375 = !DILocation(line: 184, column: 16, scope: !371)
!376 = !DILocation(line: 184, column: 3, scope: !371)
!377 = !DILocation(line: 186, column: 18, scope: !371)
!378 = !DILocation(line: 186, column: 16, scope: !371)
!379 = !DILocation(line: 188, column: 6, scope: !380)
!380 = distinct !DILexicalBlock(scope: !96, file: !3, line: 188, column: 6)
!381 = !DILocation(line: 188, column: 19, scope: !380)
!382 = !DILocation(line: 188, column: 6, scope: !96)
!383 = !DILocation(line: 189, column: 3, scope: !380)
!384 = !DILocation(line: 193, column: 30, scope: !96)
!385 = !DILocation(line: 193, column: 2, scope: !96)
!386 = !DILocation(line: 194, column: 6, scope: !387)
!387 = distinct !DILexicalBlock(scope: !96, file: !3, line: 194, column: 6)
!388 = !DILocation(line: 194, column: 15, scope: !387)
!389 = !DILocation(line: 194, column: 6, scope: !96)
!390 = !DILocalVariable(name: "decmem", scope: !391, file: !3, line: 195, type: !364)
!391 = distinct !DILexicalBlock(scope: !387, file: !3, line: 194, column: 33)
!392 = !DILocation(line: 195, column: 18, scope: !391)
!393 = !DILocation(line: 195, column: 27, scope: !391)
!394 = !DILocation(line: 196, column: 7, scope: !395)
!395 = distinct !DILexicalBlock(scope: !391, file: !3, line: 196, column: 7)
!396 = !DILocation(line: 196, column: 14, scope: !395)
!397 = !DILocation(line: 196, column: 7, scope: !391)
!398 = !DILocation(line: 199, column: 23, scope: !395)
!399 = !DILocation(line: 199, column: 7, scope: !395)
!400 = !DILocation(line: 198, column: 28, scope: !395)
!401 = !DILocation(line: 197, column: 4, scope: !395)
!402 = !DILocation(line: 200, column: 2, scope: !391)
!403 = !DILocation(line: 202, column: 6, scope: !404)
!404 = distinct !DILexicalBlock(scope: !96, file: !3, line: 202, column: 6)
!405 = !DILocation(line: 202, column: 21, scope: !404)
!406 = !DILocation(line: 202, column: 19, scope: !404)
!407 = !DILocation(line: 202, column: 6, scope: !96)
!408 = !DILocation(line: 206, column: 8, scope: !409)
!409 = distinct !DILexicalBlock(scope: !410, file: !3, line: 206, column: 7)
!410 = distinct !DILexicalBlock(scope: !404, file: !3, line: 202, column: 35)
!411 = !DILocation(line: 206, column: 24, scope: !409)
!412 = !DILocation(line: 206, column: 27, scope: !409)
!413 = !DILocation(line: 206, column: 38, scope: !409)
!414 = !DILocation(line: 206, column: 7, scope: !410)
!415 = !DILocation(line: 207, column: 23, scope: !409)
!416 = !DILocation(line: 207, column: 4, scope: !409)
!417 = !DILocalVariable(name: "i", scope: !410, file: !3, line: 214, type: !184)
!418 = !DILocation(line: 214, column: 10, scope: !410)
!419 = !DILocation(line: 215, column: 3, scope: !410)
!420 = !DILocation(line: 215, column: 18, scope: !410)
!421 = !DILocation(line: 215, column: 10, scope: !410)
!422 = !DILocation(line: 215, column: 21, scope: !410)
!423 = !DILocation(line: 215, column: 24, scope: !410)
!424 = !DILocation(line: 216, column: 5, scope: !410)
!425 = !DILocation(line: 216, column: 16, scope: !410)
!426 = !DILocation(line: 216, column: 8, scope: !410)
!427 = !DILocation(line: 216, column: 19, scope: !410)
!428 = !DILocation(line: 216, column: 22, scope: !410)
!429 = !DILocation(line: 0, scope: !410)
!430 = !DILocation(line: 217, column: 16, scope: !431)
!431 = distinct !DILexicalBlock(scope: !432, file: !3, line: 217, column: 8)
!432 = distinct !DILexicalBlock(scope: !410, file: !3, line: 216, column: 44)
!433 = !DILocation(line: 217, column: 8, scope: !431)
!434 = !DILocation(line: 217, column: 19, scope: !431)
!435 = !DILocation(line: 217, column: 22, scope: !431)
!436 = !DILocation(line: 217, column: 8, scope: !432)
!437 = !DILocation(line: 218, column: 24, scope: !431)
!438 = !DILocation(line: 218, column: 5, scope: !431)
!439 = !DILocation(line: 220, column: 4, scope: !432)
!440 = distinct !{!440, !419, !441}
!441 = !DILocation(line: 221, column: 3, scope: !410)
!442 = !DILocalVariable(name: "opt", scope: !410, file: !3, line: 225, type: !443)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!444 = !DILocation(line: 225, column: 22, scope: !410)
!445 = !DILocation(line: 225, column: 36, scope: !410)
!446 = !DILocation(line: 225, column: 28, scope: !410)
!447 = !DILocation(line: 225, column: 39, scope: !410)
!448 = !DILocalVariable(name: "orig_dict_size", scope: !410, file: !3, line: 226, type: !449)
!449 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !104)
!450 = !DILocation(line: 226, column: 18, scope: !410)
!451 = !DILocation(line: 226, column: 35, scope: !410)
!452 = !DILocation(line: 226, column: 40, scope: !410)
!453 = !DILocation(line: 227, column: 3, scope: !410)
!454 = !DILocation(line: 227, column: 8, scope: !410)
!455 = !DILocation(line: 227, column: 18, scope: !410)
!456 = !DILocation(line: 228, column: 3, scope: !410)
!457 = !DILocation(line: 236, column: 8, scope: !458)
!458 = distinct !DILexicalBlock(scope: !459, file: !3, line: 236, column: 8)
!459 = distinct !DILexicalBlock(scope: !410, file: !3, line: 228, column: 16)
!460 = !DILocation(line: 236, column: 13, scope: !458)
!461 = !DILocation(line: 236, column: 23, scope: !458)
!462 = !DILocation(line: 236, column: 8, scope: !459)
!463 = !DILocation(line: 237, column: 24, scope: !458)
!464 = !DILocation(line: 237, column: 5, scope: !458)
!465 = !DILocation(line: 239, column: 19, scope: !459)
!466 = !DILocation(line: 239, column: 17, scope: !459)
!467 = !DILocation(line: 240, column: 8, scope: !468)
!468 = distinct !DILexicalBlock(scope: !459, file: !3, line: 240, column: 8)
!469 = !DILocation(line: 240, column: 21, scope: !468)
!470 = !DILocation(line: 240, column: 8, scope: !459)
!471 = !DILocation(line: 241, column: 5, scope: !468)
!472 = !DILocation(line: 244, column: 8, scope: !473)
!473 = distinct !DILexicalBlock(scope: !459, file: !3, line: 244, column: 8)
!474 = !DILocation(line: 244, column: 24, scope: !473)
!475 = !DILocation(line: 244, column: 21, scope: !473)
!476 = !DILocation(line: 244, column: 8, scope: !459)
!477 = !DILocation(line: 245, column: 5, scope: !473)
!478 = !DILocation(line: 250, column: 4, scope: !459)
!479 = !DILocation(line: 250, column: 9, scope: !459)
!480 = !DILocation(line: 250, column: 19, scope: !459)
!481 = distinct !{!481, !456, !482}
!482 = !DILocation(line: 251, column: 3, scope: !410)
!483 = !DILocation(line: 257, column: 13, scope: !410)
!484 = !DILocation(line: 257, column: 5, scope: !410)
!485 = !DILocation(line: 257, column: 16, scope: !410)
!486 = !DILocation(line: 257, column: 19, scope: !410)
!487 = !DILocation(line: 259, column: 19, scope: !410)
!488 = !DILocation(line: 259, column: 34, scope: !410)
!489 = !DILocation(line: 259, column: 5, scope: !410)
!490 = !DILocation(line: 260, column: 19, scope: !410)
!491 = !DILocation(line: 260, column: 24, scope: !410)
!492 = !DILocation(line: 260, column: 34, scope: !410)
!493 = !DILocation(line: 260, column: 5, scope: !410)
!494 = !DILocation(line: 262, column: 6, scope: !410)
!495 = !DILocation(line: 261, column: 19, scope: !410)
!496 = !DILocation(line: 261, column: 5, scope: !410)
!497 = !DILocation(line: 254, column: 3, scope: !410)
!498 = !DILocation(line: 263, column: 2, scope: !410)
!499 = !DILocation(line: 277, column: 6, scope: !500)
!500 = distinct !DILexicalBlock(scope: !96, file: !3, line: 277, column: 6)
!501 = !DILocation(line: 277, column: 6, scope: !96)
!502 = !DILocation(line: 281, column: 9, scope: !503)
!503 = distinct !DILexicalBlock(scope: !500, file: !3, line: 277, column: 21)
!504 = !DILocation(line: 282, column: 32, scope: !505)
!505 = distinct !DILexicalBlock(scope: !503, file: !3, line: 282, column: 7)
!506 = !DILocation(line: 282, column: 8, scope: !505)
!507 = !DILocation(line: 282, column: 7, scope: !503)
!508 = !DILocation(line: 283, column: 10, scope: !505)
!509 = !DILocation(line: 283, column: 4, scope: !505)
!510 = !DILocation(line: 284, column: 2, scope: !503)
!511 = !DILocation(line: 286, column: 2, scope: !96)
!512 = distinct !DISubprogram(name: "memlimit_too_small", scope: !3, file: !3, line: 116, type: !513, scopeLine: 117, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !99)
!513 = !DISubroutineType(types: !514)
!514 = !{null, !83}
!515 = !DILocalVariable(name: "memory_usage", arg: 1, scope: !512, file: !3, line: 116, type: !83)
!516 = !DILocation(line: 116, column: 29, scope: !512)
!517 = !DILocation(line: 118, column: 2, scope: !512)
!518 = !DILocation(line: 120, column: 30, scope: !512)
!519 = !DILocation(line: 120, column: 2, scope: !512)
!520 = !DILocation(line: 121, column: 2, scope: !512)
!521 = !DILocation(line: 122, column: 1, scope: !512)
!522 = distinct !DISubprogram(name: "coder_run", scope: !3, file: !3, line: 620, type: !523, scopeLine: 621, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !99)
!523 = !DISubroutineType(types: !524)
!524 = !{null, !525}
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64)
!526 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !527)
!527 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!528 = !DILocalVariable(name: "filename", arg: 1, scope: !522, file: !3, line: 620, type: !525)
!529 = !DILocation(line: 620, column: 23, scope: !522)
!530 = !DILocation(line: 623, column: 19, scope: !522)
!531 = !DILocation(line: 623, column: 2, scope: !522)
!532 = !DILocalVariable(name: "pair", scope: !522, file: !3, line: 626, type: !533)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64)
!534 = !DIDerivedType(tag: DW_TAG_typedef, name: "file_pair", file: !153, line: 66, baseType: !535)
!535 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !153, line: 31, size: 320, elements: !536)
!536 = !{!537, !538, !540, !542, !543, !544, !545}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "src_name", scope: !535, file: !153, line: 34, baseType: !525, size: 64)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "dest_name", scope: !535, file: !153, line: 38, baseType: !539, size: 64, offset: 64)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "src_fd", scope: !535, file: !153, line: 41, baseType: !541, size: 32, offset: 128)
!541 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "dest_fd", scope: !535, file: !153, line: 44, baseType: !541, size: 32, offset: 160)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "src_eof", scope: !535, file: !153, line: 47, baseType: !93, size: 8, offset: 192)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "dest_try_sparse", scope: !535, file: !153, line: 51, baseType: !93, size: 8, offset: 200)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "dest_pending_sparse", scope: !535, file: !153, line: 56, baseType: !546, size: 64, offset: 256)
!546 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !547, line: 63, baseType: !548)
!547 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!548 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !86, line: 152, baseType: !549)
!549 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!550 = !DILocation(line: 626, column: 13, scope: !522)
!551 = !DILocation(line: 626, column: 32, scope: !522)
!552 = !DILocation(line: 626, column: 20, scope: !522)
!553 = !DILocation(line: 627, column: 6, scope: !554)
!554 = distinct !DILexicalBlock(scope: !522, file: !3, line: 627, column: 6)
!555 = !DILocation(line: 627, column: 11, scope: !554)
!556 = !DILocation(line: 627, column: 6, scope: !522)
!557 = !DILocation(line: 628, column: 3, scope: !554)
!558 = !DILocalVariable(name: "success", scope: !522, file: !3, line: 631, type: !93)
!559 = !DILocation(line: 631, column: 7, scope: !522)
!560 = !DILocation(line: 635, column: 15, scope: !522)
!561 = !DILocation(line: 636, column: 26, scope: !522)
!562 = !DILocation(line: 636, column: 18, scope: !522)
!563 = !DILocation(line: 636, column: 16, scope: !522)
!564 = !DILocation(line: 638, column: 11, scope: !565)
!565 = distinct !DILexicalBlock(scope: !522, file: !3, line: 638, column: 6)
!566 = !DILocation(line: 638, column: 20, scope: !565)
!567 = !DILocation(line: 638, column: 6, scope: !522)
!568 = !DILocalVariable(name: "init_ret", scope: !569, file: !3, line: 645, type: !570)
!569 = distinct !DILexicalBlock(scope: !565, file: !3, line: 638, column: 33)
!570 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !50)
!571 = !DILocation(line: 645, column: 29, scope: !569)
!572 = !DILocation(line: 645, column: 51, scope: !569)
!573 = !DILocation(line: 645, column: 40, scope: !569)
!574 = !DILocation(line: 647, column: 7, scope: !575)
!575 = distinct !DILexicalBlock(scope: !569, file: !3, line: 647, column: 7)
!576 = !DILocation(line: 647, column: 16, scope: !575)
!577 = !DILocation(line: 647, column: 36, scope: !575)
!578 = !DILocation(line: 647, column: 40, scope: !575)
!579 = !DILocation(line: 647, column: 7, scope: !569)
!580 = !DILocation(line: 650, column: 8, scope: !581)
!581 = distinct !DILexicalBlock(scope: !582, file: !3, line: 650, column: 8)
!582 = distinct !DILexicalBlock(scope: !575, file: !3, line: 647, column: 52)
!583 = !DILocation(line: 650, column: 17, scope: !581)
!584 = !DILocation(line: 650, column: 30, scope: !581)
!585 = !DILocation(line: 650, column: 47, scope: !581)
!586 = !DILocation(line: 650, column: 34, scope: !581)
!587 = !DILocation(line: 650, column: 8, scope: !582)
!588 = !DILocalVariable(name: "in_size", scope: !589, file: !3, line: 652, type: !364)
!589 = distinct !DILexicalBlock(scope: !581, file: !3, line: 650, column: 54)
!590 = !DILocation(line: 652, column: 20, scope: !589)
!591 = !DILocation(line: 659, column: 5, scope: !589)
!592 = !DILocation(line: 662, column: 9, scope: !593)
!593 = distinct !DILexicalBlock(scope: !589, file: !3, line: 662, column: 9)
!594 = !DILocation(line: 662, column: 18, scope: !593)
!595 = !DILocation(line: 662, column: 9, scope: !589)
!596 = !DILocation(line: 663, column: 29, scope: !593)
!597 = !DILocation(line: 663, column: 16, scope: !593)
!598 = !DILocation(line: 663, column: 14, scope: !593)
!599 = !DILocation(line: 663, column: 6, scope: !593)
!600 = !DILocation(line: 665, column: 31, scope: !593)
!601 = !DILocation(line: 665, column: 16, scope: !593)
!602 = !DILocation(line: 665, column: 14, scope: !593)
!603 = !DILocation(line: 667, column: 26, scope: !589)
!604 = !DILocation(line: 667, column: 5, scope: !589)
!605 = !DILocation(line: 668, column: 4, scope: !589)
!606 = !DILocation(line: 669, column: 3, scope: !582)
!607 = !DILocation(line: 670, column: 2, scope: !569)
!608 = !DILocation(line: 674, column: 11, scope: !522)
