; ModuleID = 'liblzma/common/block_util.c'
source_filename = "liblzma/common/block_util.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.lzma_block = type { i32, i32, i32, i64, i64, %struct.lzma_filter*, [64 x i8], i8*, i8*, i8*, i32, i32, i64, i64, i64, i64, i64, i64, i32, i32, i32, i32, i8, i8, i8, i8, i8, i8, i8, i8 }
%struct.lzma_filter = type { i64, i8* }

; Function Attrs: noinline nounwind uwtable
define dso_local i32 @lzma_block_compressed_size(%struct.lzma_block* %block, i64 %unpadded_size) #0 !dbg !35 {
entry:
  %retval = alloca i32, align 4
  %block.addr = alloca %struct.lzma_block*, align 8
  %unpadded_size.addr = alloca i64, align 8
  %container_size = alloca i32, align 4
  %compressed_size = alloca i64, align 8
  store %struct.lzma_block* %block, %struct.lzma_block** %block.addr, align 8
  call void @llvm.dbg.declare(metadata %struct.lzma_block** %block.addr, metadata !100, metadata !DIExpression()), !dbg !101
  store i64 %unpadded_size, i64* %unpadded_size.addr, align 8
  call void @llvm.dbg.declare(metadata i64* %unpadded_size.addr, metadata !102, metadata !DIExpression()), !dbg !103
  %0 = load %struct.lzma_block*, %struct.lzma_block** %block.addr, align 8, !dbg !104
  %call = call i64 @lzma_block_unpadded_size(%struct.lzma_block* %0), !dbg !106
  %cmp = icmp eq i64 %call, 0, !dbg !107
  br i1 %cmp, label %if.then, label %if.end, !dbg !108


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !29, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "liblzma/common/block_util.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!2 = !{!3, !19, !26}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 57, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "liblzma/api/lzma/base.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18}
!7 = !DIEnumerator(name: "LZMA_OK", value: 0, isUnsigned: true)
!8 = !DIEnumerator(name: "LZMA_STREAM_END", value: 1, isUnsigned: true)
!9 = !DIEnumerator(name: "LZMA_NO_CHECK", value: 2, isUnsigned: true)
!10 = !DIEnumerator(name: "LZMA_UNSUPPORTED_CHECK", value: 3, isUnsigned: true)
!11 = !DIEnumerator(name: "LZMA_GET_CHECK", value: 4, isUnsigned: true)
!12 = !DIEnumerator(name: "LZMA_MEM_ERROR", value: 5, isUnsigned: true)
!13 = !DIEnumerator(name: "LZMA_MEMLIMIT_ERROR", value: 6, isUnsigned: true)
!14 = !DIEnumerator(name: "LZMA_FORMAT_ERROR", value: 7, isUnsigned: true)
!15 = !DIEnumerator(name: "LZMA_OPTIONS_ERROR", value: 8, isUnsigned: true)
!16 = !DIEnumerator(name: "LZMA_DATA_ERROR", value: 9, isUnsigned: true)
!17 = !DIEnumerator(name: "LZMA_BUF_ERROR", value: 10, isUnsigned: true)
!18 = !DIEnumerator(name: "LZMA_PROG_ERROR", value: 11, isUnsigned: true)
!19 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !20, line: 27, baseType: !5, size: 32, elements: !21)
!20 = !DIFile(filename: "liblzma/api/lzma/check.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!21 = !{!22, !23, !24, !25}
!22 = !DIEnumerator(name: "LZMA_CHECK_NONE", value: 0, isUnsigned: true)
!23 = !DIEnumerator(name: "LZMA_CHECK_CRC32", value: 1, isUnsigned: true)
!24 = !DIEnumerator(name: "LZMA_CHECK_CRC64", value: 4, isUnsigned: true)
!25 = !DIEnumerator(name: "LZMA_CHECK_SHA256", value: 10, isUnsigned: true)
!26 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 44, baseType: !5, size: 32, elements: !27)
!27 = !{!28}
!28 = !DIEnumerator(name: "LZMA_RESERVED_ENUM", value: 0, isUnsigned: true)
!29 = !{!30, !5}
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!31 = !{i32 7, !"Dwarf Version", i32 4}
!32 = !{i32 2, !"Debug Info Version", i32 3}
!33 = !{i32 1, !"wchar_size", i32 4}
!34 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!35 = distinct !DISubprogram(name: "lzma_block_compressed_size", scope: !1, file: !1, line: 18, type: !36, scopeLine: 19, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !99)
!36 = !DISubroutineType(types: !37)
!37 = !{!38, !39, !53}
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_ret", file: !4, line: 237, baseType: !3)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_block", file: !41, line: 245, baseType: !42)
!41 = !DIFile(filename: "liblzma/api/lzma/block.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!42 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !41, line: 30, size: 1664, elements: !43)
!43 = !{!44, !49, !50, !52, !58, !59, !67, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !87, !88, !89, !90, !92, !93, !94, !95, !96, !97, !98}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !42, file: !41, line: 47, baseType: !45, size: 32)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !46, line: 26, baseType: !47)
!46 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !48, line: 42, baseType: !5)
!48 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!49 = !DIDerivedType(tag: DW_TAG_member, name: "header_size", scope: !42, file: !41, line: 67, baseType: !45, size: 32, offset: 32)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !42, file: !41, line: 88, baseType: !51, size: 32, offset: 64)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_check", file: !20, line: 55, baseType: !19)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "compressed_size", scope: !42, file: !41, line: 143, baseType: !53, size: 64, offset: 128)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_vli", file: !54, line: 63, baseType: !55)
!54 = !DIFile(filename: "liblzma/api/lzma/vli.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !46, line: 27, baseType: !56)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !48, line: 45, baseType: !57)
!57 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "uncompressed_size", scope: !42, file: !41, line: 167, baseType: !53, size: 64, offset: 192)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "filters", scope: !42, file: !41, line: 195, baseType: !60, size: 64, offset: 256)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_filter", file: !62, line: 65, baseType: !63)
!62 = !DIFile(filename: "liblzma/api/lzma/filter.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!63 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !62, line: 43, size: 128, elements: !64)
!64 = !{!65, !66}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !63, file: !62, line: 54, baseType: !53, size: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !63, file: !62, line: 63, baseType: !30, size: 64, offset: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "raw_check", scope: !42, file: !41, line: 212, baseType: !68, size: 512, offset: 320)
!68 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 512, elements: !72)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !46, line: 24, baseType: !70)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !48, line: 38, baseType: !71)
!71 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!72 = !{!73}
!73 = !DISubrange(count: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr1", scope: !42, file: !41, line: 221, baseType: !30, size: 64, offset: 832)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr2", scope: !42, file: !41, line: 222, baseType: !30, size: 64, offset: 896)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr3", scope: !42, file: !41, line: 223, baseType: !30, size: 64, offset: 960)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int1", scope: !42, file: !41, line: 224, baseType: !45, size: 32, offset: 1024)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int2", scope: !42, file: !41, line: 225, baseType: !45, size: 32, offset: 1056)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int3", scope: !42, file: !41, line: 226, baseType: !53, size: 64, offset: 1088)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int4", scope: !42, file: !41, line: 227, baseType: !53, size: 64, offset: 1152)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int5", scope: !42, file: !41, line: 228, baseType: !53, size: 64, offset: 1216)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int6", scope: !42, file: !41, line: 229, baseType: !53, size: 64, offset: 1280)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int7", scope: !42, file: !41, line: 230, baseType: !53, size: 64, offset: 1344)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int8", scope: !42, file: !41, line: 231, baseType: !53, size: 64, offset: 1408)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum1", scope: !42, file: !41, line: 232, baseType: !86, size: 32, offset: 1472)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_reserved_enum", file: !4, line: 46, baseType: !26)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum2", scope: !42, file: !41, line: 233, baseType: !86, size: 32, offset: 1504)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum3", scope: !42, file: !41, line: 234, baseType: !86, size: 32, offset: 1536)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum4", scope: !42, file: !41, line: 235, baseType: !86, size: 32, offset: 1568)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool1", scope: !42, file: !41, line: 236, baseType: !91, size: 8, offset: 1600)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_bool", file: !4, line: 29, baseType: !71)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool2", scope: !42, file: !41, line: 237, baseType: !91, size: 8, offset: 1608)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool3", scope: !42, file: !41, line: 238, baseType: !91, size: 8, offset: 1616)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool4", scope: !42, file: !41, line: 239, baseType: !91, size: 8, offset: 1624)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool5", scope: !42, file: !41, line: 240, baseType: !91, size: 8, offset: 1632)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool6", scope: !42, file: !41, line: 241, baseType: !91, size: 8, offset: 1640)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool7", scope: !42, file: !41, line: 242, baseType: !91, size: 8, offset: 1648)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool8", scope: !42, file: !41, line: 243, baseType: !91, size: 8, offset: 1656)
!99 = !{}
!100 = !DILocalVariable(name: "block", arg: 1, scope: !35, file: !1, line: 18, type: !39)
!101 = !DILocation(line: 18, column: 40, scope: !35)
!102 = !DILocalVariable(name: "unpadded_size", arg: 2, scope: !35, file: !1, line: 18, type: !53)
!103 = !DILocation(line: 18, column: 56, scope: !35)
!104 = !DILocation(line: 21, column: 31, scope: !105)
!105 = distinct !DILexicalBlock(scope: !35, file: !1, line: 21, column: 6)
!106 = !DILocation(line: 21, column: 6, scope: !105)
!107 = !DILocation(line: 21, column: 38, scope: !105)
!108 = !DILocation(line: 21, column: 6, scope: !35)
!109 = !DILocation(line: 22, column: 3, scope: !105)
!110 = !DILocalVariable(name: "container_size", scope: !35, file: !1, line: 24, type: !111)
!111 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !45)
!112 = !DILocation(line: 24, column: 17, scope: !35)
!113 = !DILocation(line: 24, column: 34, scope: !35)
!114 = !DILocation(line: 24, column: 41, scope: !35)
!115 = !DILocation(line: 25, column: 22, scope: !35)
!116 = !DILocation(line: 25, column: 29, scope: !35)
!117 = !DILocation(line: 25, column: 6, scope: !35)
!118 = !DILocation(line: 25, column: 4, scope: !35)
!119 = !DILocation(line: 28, column: 6, scope: !120)
!120 = distinct !DILexicalBlock(scope: !35, file: !1, line: 28, column: 6)
!121 = !DILocation(line: 28, column: 23, scope: !120)
!122 = !DILocation(line: 28, column: 20, scope: !120)
!123 = !DILocation(line: 28, column: 6, scope: !35)
!124 = !DILocation(line: 29, column: 3, scope: !120)
!125 = !DILocalVariable(name: "compressed_size", scope: !35, file: !1, line: 34, type: !126)
!126 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !53)
!127 = !DILocation(line: 34, column: 17, scope: !35)
!128 = !DILocation(line: 34, column: 35, scope: !35)
!129 = !DILocation(line: 34, column: 51, scope: !35)
!130 = !DILocation(line: 34, column: 49, scope: !35)
!131 = !DILocation(line: 35, column: 6, scope: !132)
!132 = distinct !DILexicalBlock(scope: !35, file: !1, line: 35, column: 6)
!133 = !DILocation(line: 35, column: 13, scope: !132)
!134 = !DILocation(line: 35, column: 29, scope: !132)
!135 = !DILocation(line: 36, column: 4, scope: !132)
!136 = !DILocation(line: 36, column: 7, scope: !132)
!137 = !DILocation(line: 36, column: 14, scope: !132)
!138 = !DILocation(line: 36, column: 33, scope: !132)
!139 = !DILocation(line: 36, column: 30, scope: !132)
!140 = !DILocation(line: 35, column: 6, scope: !35)
!141 = !DILocation(line: 37, column: 3, scope: !132)
!142 = !DILocation(line: 39, column: 27, scope: !35)
!143 = !DILocation(line: 39, column: 2, scope: !35)
!144 = !DILocation(line: 39, column: 9, scope: !35)
!145 = !DILocation(line: 39, column: 25, scope: !35)
!146 = !DILocation(line: 41, column: 2, scope: !35)
!147 = !DILocation(line: 42, column: 1, scope: !35)
!148 = distinct !DISubprogram(name: "lzma_block_unpadded_size", scope: !1, file: !1, line: 46, type: !149, scopeLine: 47, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !99)
!149 = !DISubroutineType(types: !150)
!150 = !{!53, !151}
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !40)
!153 = !DILocalVariable(name: "block", arg: 1, scope: !148, file: !1, line: 46, type: !151)
!154 = !DILocation(line: 46, column: 44, scope: !148)
!155 = !DILocation(line: 54, column: 6, scope: !156)
!156 = distinct !DILexicalBlock(scope: !148, file: !1, line: 54, column: 6)
!157 = !DILocation(line: 54, column: 12, scope: !156)
!158 = !DILocation(line: 54, column: 20, scope: !156)
!159 = !DILocation(line: 54, column: 23, scope: !156)
!160 = !DILocation(line: 54, column: 30, scope: !156)
!161 = !DILocation(line: 54, column: 38, scope: !156)
!162 = !DILocation(line: 55, column: 4, scope: !156)
!163 = !DILocation(line: 55, column: 7, scope: !156)
