; ModuleID = 'liblzma/simple/sparc.c'
source_filename = "liblzma/simple/sparc.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.lzma_next_coder_s = type { i8*, i64, i64, i32 (i8*, %struct.lzma_allocator*, i8*, i64*, i64, i8*, i64*, i64, i32)*, void (i8*, %struct.lzma_allocator*)*, i32 (i8*)*, i32 (i8*, i64*, i64*, i64)*, i32 (i8*, %struct.lzma_allocator*, %struct.lzma_filter*, %struct.lzma_filter*)* }
%struct.lzma_filter = type { i64, i8* }
%struct.lzma_allocator = type { i8* (i8*, i64, i64)*, void (i8*, i8*)*, i8* }
%struct.lzma_filter_info_s = type { i64, {}*, i8* }
%struct.lzma_simple_s = type opaque

; Function Attrs: noinline nounwind uwtable
define dso_local i32 @lzma_simple_sparc_encoder_init(%struct.lzma_next_coder_s* %next, %struct.lzma_allocator* %allocator, %struct.lzma_filter_info_s* %filters) #0 !dbg !44 {
entry:
  %next.addr = alloca %struct.lzma_next_coder_s*, align 8
  %allocator.addr = alloca %struct.lzma_allocator*, align 8
  %filters.addr = alloca %struct.lzma_filter_info_s*, align 8
  store %struct.lzma_next_coder_s* %next, %struct.lzma_next_coder_s** %next.addr, align 8
  call void @llvm.dbg.declare(metadata %struct.lzma_next_coder_s** %next.addr, metadata !134, metadata !DIExpression()), !dbg !135
  store %struct.lzma_allocator* %allocator, %struct.lzma_allocator** %allocator.addr, align 8

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !32, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "liblzma/simple/sparc.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!2 = !{!3, !19, !25}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 57, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "liblzma/api/lzma/base.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18}
!7 = !DIEnumerator(name: "LZMA_OK", value: 0, isUnsigned: true)
!8 = !DIEnumerator(name: "LZMA_STREAM_END", value: 1, isUnsigned: true)
!9 = !DIEnumerator(name: "LZMA_NO_CHECK", value: 2, isUnsigned: true)
!10 = !DIEnumerator(name: "LZMA_UNSUPPORTED_CHECK", value: 3, isUnsigned: true)
!11 = !DIEnumerator(name: "LZMA_GET_CHECK", value: 4, isUnsigned: true)
!12 = !DIEnumerator(name: "LZMA_MEM_ERROR", value: 5, isUnsigned: true)
!13 = !DIEnumerator(name: "LZMA_MEMLIMIT_ERROR", value: 6, isUnsigned: true)
!14 = !DIEnumerator(name: "LZMA_FORMAT_ERROR", value: 7, isUnsigned: true)
!15 = !DIEnumerator(name: "LZMA_OPTIONS_ERROR", value: 8, isUnsigned: true)
!16 = !DIEnumerator(name: "LZMA_DATA_ERROR", value: 9, isUnsigned: true)
!17 = !DIEnumerator(name: "LZMA_BUF_ERROR", value: 10, isUnsigned: true)
!18 = !DIEnumerator(name: "LZMA_PROG_ERROR", value: 11, isUnsigned: true)
!19 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 250, baseType: !5, size: 32, elements: !20)
!20 = !{!21, !22, !23, !24}
!21 = !DIEnumerator(name: "LZMA_RUN", value: 0, isUnsigned: true)
!22 = !DIEnumerator(name: "LZMA_SYNC_FLUSH", value: 1, isUnsigned: true)
!23 = !DIEnumerator(name: "LZMA_FULL_FLUSH", value: 2, isUnsigned: true)
!24 = !DIEnumerator(name: "LZMA_FINISH", value: 3, isUnsigned: true)
!25 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !26, line: 27, baseType: !5, size: 32, elements: !27)
!26 = !DIFile(filename: "liblzma/api/lzma/check.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!27 = !{!28, !29, !30, !31}
!28 = !DIEnumerator(name: "LZMA_CHECK_NONE", value: 0, isUnsigned: true)
!29 = !DIEnumerator(name: "LZMA_CHECK_CRC32", value: 1, isUnsigned: true)
!30 = !DIEnumerator(name: "LZMA_CHECK_CRC64", value: 4, isUnsigned: true)
!31 = !DIEnumerator(name: "LZMA_CHECK_SHA256", value: 10, isUnsigned: true)
!32 = !{!33, !37}
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !34, line: 26, baseType: !35)
!34 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !36, line: 42, baseType: !5)
!36 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !34, line: 24, baseType: !38)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !36, line: 38, baseType: !39)
!39 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!40 = !{i32 7, !"Dwarf Version", i32 4}
!41 = !{i32 2, !"Debug Info Version", i32 3}
!42 = !{i32 1, !"wchar_size", i32 4}
!43 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!44 = distinct !DISubprogram(name: "lzma_simple_sparc_encoder_init", scope: !1, file: !1, line: 69, type: !45, scopeLine: 71, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !133)
!45 = !DISubroutineType(types: !46)
!46 = !{!47, !48, !70, !123}
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_ret", file: !4, line: 237, baseType: !3)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_next_coder", file: !50, line: 80, baseType: !51)
!50 = !DIFile(filename: "liblzma/common/common.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!51 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_next_coder_s", file: !50, line: 124, size: 512, elements: !52)
!52 = !{!53, !56, !62, !65, !94, !99, !106, !111}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "coder", scope: !51, file: !50, line: 126, baseType: !54, size: 64)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_coder", file: !50, line: 78, baseType: null)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !51, file: !50, line: 130, baseType: !57, size: 64, offset: 64)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_vli", file: !58, line: 63, baseType: !59)
!58 = !DIFile(filename: "liblzma/api/lzma/vli.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !34, line: 27, baseType: !60)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !36, line: 45, baseType: !61)
!61 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !51, file: !50, line: 136, baseType: !63, size: 64, offset: 128)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !64, line: 90, baseType: !61)
!64 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!65 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !51, file: !50, line: 139, baseType: !66, size: 64, offset: 192)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_code_function", file: !50, line: 94, baseType: !67)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = !DISubroutineType(types: !69)
!69 = !{!47, !54, !70, !86, !89, !79, !91, !89, !79, !93}
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_allocator", file: !4, line: 403, baseType: !72)
!72 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 341, size: 192, elements: !73)
!73 = !{!74, !81, !85}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !72, file: !4, line: 376, baseType: !75, size: 64)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = !DISubroutineType(types: !77)
!77 = !{!78, !78, !79, !79}
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !80, line: 46, baseType: !61)
!80 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!81 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !72, file: !4, line: 390, baseType: !82, size: 64, offset: 64)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!83 = !DISubroutineType(types: !84)
!84 = !{null, !78, !78}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !72, file: !4, line: 401, baseType: !78, size: 64, offset: 128)
!86 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !87)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !37)
!89 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !90)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !92)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_action", file: !4, line: 322, baseType: !19)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !51, file: !50, line: 144, baseType: !95, size: 64, offset: 256)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_end_function", file: !50, line: 102, baseType: !96)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = !DISubroutineType(types: !98)
!98 = !{null, !54, !70}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "get_check", scope: !51, file: !50, line: 148, baseType: !100, size: 64, offset: 320)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = !DISubroutineType(types: !102)
!102 = !{!103, !104}
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_check", file: !26, line: 55, baseType: !25)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !55)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "memconfig", scope: !51, file: !50, line: 152, baseType: !107, size: 64, offset: 384)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = !DISubroutineType(types: !109)
!109 = !{!47, !54, !110, !110, !59}
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !51, file: !50, line: 157, baseType: !112, size: 64, offset: 448)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = !DISubroutineType(types: !114)
!114 = !{!47, !54, !70, !115, !115}
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !117)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_filter", file: !118, line: 65, baseType: !119)
!118 = !DIFile(filename: "liblzma/api/lzma/filter.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!119 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !118, line: 43, size: 128, elements: !120)
!120 = !{!121, !122}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !119, file: !118, line: 54, baseType: !57, size: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !119, file: !118, line: 63, baseType: !78, size: 64, offset: 64)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !125)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_filter_info", file: !50, line: 82, baseType: !126)
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_filter_info_s", file: !50, line: 109, size: 192, elements: !127)
!127 = !{!128, !129, !132}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !126, file: !50, line: 112, baseType: !57, size: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !126, file: !50, line: 116, baseType: !130, size: 64, offset: 64)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_init_function", file: !50, line: 86, baseType: !131)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !126, file: !50, line: 119, baseType: !78, size: 64, offset: 128)
!133 = !{}
!134 = !DILocalVariable(name: "next", arg: 1, scope: !44, file: !1, line: 69, type: !48)
!135 = !DILocation(line: 69, column: 49, scope: !44)
!136 = !DILocalVariable(name: "allocator", arg: 2, scope: !44, file: !1, line: 70, type: !70)
!137 = !DILocation(line: 70, column: 19, scope: !44)
!138 = !DILocalVariable(name: "filters", arg: 3, scope: !44, file: !1, line: 70, type: !123)
!139 = !DILocation(line: 70, column: 54, scope: !44)
!140 = !DILocation(line: 72, column: 26, scope: !44)
!141 = !DILocation(line: 72, column: 32, scope: !44)
!142 = !DILocation(line: 72, column: 43, scope: !44)
!143 = !DILocation(line: 72, column: 9, scope: !44)
!144 = !DILocation(line: 72, column: 2, scope: !44)
!145 = distinct !DISubprogram(name: "sparc_coder_init", scope: !1, file: !1, line: 60, type: !146, scopeLine: 62, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !133)
!146 = !DISubroutineType(types: !147)
!147 = !{!47, !48, !70, !123, !148}
!148 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!149 = !DILocalVariable(name: "next", arg: 1, scope: !145, file: !1, line: 60, type: !48)
!150 = !DILocation(line: 60, column: 35, scope: !145)
!151 = !DILocalVariable(name: "allocator", arg: 2, scope: !145, file: !1, line: 60, type: !70)
!152 = !DILocation(line: 60, column: 57, scope: !145)
!153 = !DILocalVariable(name: "filters", arg: 3, scope: !145, file: !1, line: 61, type: !123)
!154 = !DILocation(line: 61, column: 27, scope: !145)
!155 = !DILocalVariable(name: "is_encoder", arg: 4, scope: !145, file: !1, line: 61, type: !148)
!156 = !DILocation(line: 61, column: 41, scope: !145)
!157 = !DILocation(line: 63, column: 32, scope: !145)
!158 = !DILocation(line: 63, column: 38, scope: !145)
!159 = !DILocation(line: 63, column: 49, scope: !145)
!160 = !DILocation(line: 64, column: 26, scope: !145)
!161 = !DILocation(line: 63, column: 9, scope: !145)
!162 = !DILocation(line: 63, column: 2, scope: !145)
!163 = distinct !DISubprogram(name: "lzma_simple_sparc_decoder_init", scope: !1, file: !1, line: 77, type: !45, scopeLine: 79, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !133)
!164 = !DILocalVariable(name: "next", arg: 1, scope: !163, file: !1, line: 77, type: !48)
!165 = !DILocation(line: 77, column: 49, scope: !163)
!166 = !DILocalVariable(name: "allocator", arg: 2, scope: !163, file: !1, line: 78, type: !70)
!167 = !DILocation(line: 78, column: 19, scope: !163)
!168 = !DILocalVariable(name: "filters", arg: 3, scope: !163, file: !1, line: 78, type: !123)
!169 = !DILocation(line: 78, column: 54, scope: !163)
!170 = !DILocation(line: 80, column: 26, scope: !163)
!171 = !DILocation(line: 80, column: 32, scope: !163)
!172 = !DILocation(line: 80, column: 43, scope: !163)
!173 = !DILocation(line: 80, column: 9, scope: !163)
!174 = !DILocation(line: 80, column: 2, scope: !163)
!175 = distinct !DISubprogram(name: "sparc_code", scope: !1, file: !1, line: 18, type: !176, scopeLine: 21, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !133)
!176 = !DISubroutineType(types: !177)
!177 = !{!79, !178, !33, !148, !92, !79}
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_simple", file: !180, line: 19, baseType: !181)
!180 = !DIFile(filename: "liblzma/simple/simple_private.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!181 = !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_simple_s", file: !180, line: 19, flags: DIFlagFwdDecl)
!182 = !DILocalVariable(name: "simple", arg: 1, scope: !175, file: !1, line: 18, type: !178)
!183 = !DILocation(line: 18, column: 25, scope: !175)
