; ModuleID = 'liblzma/common/filter_common.c'
source_filename = "liblzma/common/filter_common.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.anon = type { i64, i64, i8, i8, i8 }
%struct.lzma_filter = type { i64, i8* }
%struct.lzma_allocator = type { i8* (i8*, i64, i64)*, void (i8*, i8*)*, i8* }
%struct.lzma_next_coder_s = type { i8*, i64, i64, i32 (i8*, %struct.lzma_allocator*, i8*, i64*, i64, i8*, i64*, i64, i32)*, void (i8*, %struct.lzma_allocator*)*, i32 (i8*)*, i32 (i8*, i64*, i64*, i64)*, i32 (i8*, %struct.lzma_allocator*, %struct.lzma_filter*, %struct.lzma_filter*)* }
%struct.lzma_filter_coder = type { i64, i32 (%struct.lzma_next_coder_s*, %struct.lzma_allocator*, %struct.lzma_filter_info_s*)*, i64 (i8*)* }
%struct.lzma_filter_info_s = type { i64, {}*, i8* }

@features = internal constant [10 x %struct.anon] [%struct.anon { i64 4611686018427387905, i64 112, i8 0, i8 1, i8 1 }, %struct.anon { i64 33, i64 112, i8 0, i8 1, i8 1 }, %struct.anon { i64 4, i64 4, i8 1, i8 0, i8 0 }, %struct.anon { i64 5, i64 4, i8 1, i8 0, i8 0 }, %struct.anon { i64 6, i64 4, i8 1, i8 0, i8 0 }, %struct.anon { i64 7, i64 4, i8 1, i8 0, i8 0 }, %struct.anon { i64 8, i64 4, i8 1, i8 0, i8 0 }, %struct.anon { i64 9, i64 4, i8 1, i8 0, i8 0 }, %struct.anon { i64 3, i64 40, i8 1, i8 0, i8 0 }, %struct.anon { i64 -1, i64 0, i8 0, i8 0, i8 0 }], align 16, !dbg !0


!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "features", scope: !2, file: !3, line: 36, type: !37, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !34, globals: !36, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "liblzma/common/filter_common.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !{!5, !21, !27}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 57, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "liblzma/api/lzma/base.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20}
!9 = !DIEnumerator(name: "LZMA_OK", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "LZMA_STREAM_END", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "LZMA_NO_CHECK", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "LZMA_UNSUPPORTED_CHECK", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "LZMA_GET_CHECK", value: 4, isUnsigned: true)
!14 = !DIEnumerator(name: "LZMA_MEM_ERROR", value: 5, isUnsigned: true)
!15 = !DIEnumerator(name: "LZMA_MEMLIMIT_ERROR", value: 6, isUnsigned: true)
!16 = !DIEnumerator(name: "LZMA_FORMAT_ERROR", value: 7, isUnsigned: true)
!17 = !DIEnumerator(name: "LZMA_OPTIONS_ERROR", value: 8, isUnsigned: true)
!18 = !DIEnumerator(name: "LZMA_DATA_ERROR", value: 9, isUnsigned: true)
!19 = !DIEnumerator(name: "LZMA_BUF_ERROR", value: 10, isUnsigned: true)
!20 = !DIEnumerator(name: "LZMA_PROG_ERROR", value: 11, isUnsigned: true)
!21 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 250, baseType: !7, size: 32, elements: !22)
!22 = !{!23, !24, !25, !26}
!23 = !DIEnumerator(name: "LZMA_RUN", value: 0, isUnsigned: true)
!24 = !DIEnumerator(name: "LZMA_SYNC_FLUSH", value: 1, isUnsigned: true)
!25 = !DIEnumerator(name: "LZMA_FULL_FLUSH", value: 2, isUnsigned: true)
!26 = !DIEnumerator(name: "LZMA_FINISH", value: 3, isUnsigned: true)
!27 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !28, line: 27, baseType: !7, size: 32, elements: !29)
!28 = !DIFile(filename: "liblzma/api/lzma/check.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!29 = !{!30, !31, !32, !33}
!30 = !DIEnumerator(name: "LZMA_CHECK_NONE", value: 0, isUnsigned: true)
!31 = !DIEnumerator(name: "LZMA_CHECK_CRC32", value: 1, isUnsigned: true)
!32 = !DIEnumerator(name: "LZMA_CHECK_CRC64", value: 4, isUnsigned: true)
!33 = !DIEnumerator(name: "LZMA_CHECK_SHA256", value: 10, isUnsigned: true)
!34 = !{!35}
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!36 = !{!0}
!37 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 1920, elements: !56)
!38 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !39)
!39 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 16, size: 192, elements: !40)
!40 = !{!41, !49, !52, !54, !55}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !39, file: !3, line: 18, baseType: !42, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_vli", file: !43, line: 63, baseType: !44)
!43 = !DIFile(filename: "liblzma/api/lzma/vli.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !45, line: 27, baseType: !46)
!45 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !47, line: 45, baseType: !48)
!47 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!48 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "options_size", scope: !39, file: !3, line: 21, baseType: !50, size: 64, offset: 64)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !51, line: 46, baseType: !48)
!51 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!52 = !DIDerivedType(tag: DW_TAG_member, name: "non_last_ok", scope: !39, file: !3, line: 25, baseType: !53, size: 8, offset: 128)
!53 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "last_ok", scope: !39, file: !3, line: 29, baseType: !53, size: 8, offset: 136)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "changes_size", scope: !39, file: !3, line: 34, baseType: !53, size: 8, offset: 144)
!56 = !{!57}
!57 = !DISubrange(count: 10)
!58 = !{i32 7, !"Dwarf Version", i32 4}
!59 = !{i32 2, !"Debug Info Version", i32 3}
!60 = !{i32 1, !"wchar_size", i32 4}
!61 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!62 = distinct !DISubprogram(name: "lzma_filters_copy", scope: !3, file: !3, line: 125, type: !63, scopeLine: 127, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !88)
!63 = !DISubroutineType(types: !64)
!64 = !{!65, !66, !74, !75}
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_ret", file: !6, line: 237, baseType: !5)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!67 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !68)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_filter", file: !69, line: 65, baseType: !70)
!69 = !DIFile(filename: "liblzma/api/lzma/filter.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!70 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !69, line: 43, size: 128, elements: !71)
!71 = !{!72, !73}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !70, file: !69, line: 54, baseType: !42, size: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !70, file: !69, line: 63, baseType: !35, size: 64, offset: 64)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_allocator", file: !6, line: 403, baseType: !77)
!77 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 341, size: 192, elements: !78)
!78 = !{!79, !83, !87}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !77, file: !6, line: 376, baseType: !80, size: 64)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = !DISubroutineType(types: !82)
!82 = !{!35, !35, !50, !50}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !77, file: !6, line: 390, baseType: !84, size: 64, offset: 64)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!85 = !DISubroutineType(types: !86)
!86 = !{null, !35, !35}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !77, file: !6, line: 401, baseType: !35, size: 64, offset: 128)
!88 = !{}
!89 = !DILocalVariable(name: "src", arg: 1, scope: !62, file: !3, line: 125, type: !66)
!90 = !DILocation(line: 125, column: 38, scope: !62)
!91 = !DILocalVariable(name: "dest", arg: 2, scope: !62, file: !3, line: 125, type: !74)
!92 = !DILocation(line: 125, column: 56, scope: !62)
!93 = !DILocalVariable(name: "allocator", arg: 3, scope: !62, file: !3, line: 126, type: !75)
!94 = !DILocation(line: 126, column: 19, scope: !62)
!95 = !DILocation(line: 128, column: 6, scope: !96)
!96 = distinct !DILexicalBlock(scope: !62, file: !3, line: 128, column: 6)
!97 = !DILocation(line: 128, column: 10, scope: !96)
!98 = !DILocation(line: 128, column: 18, scope: !96)
!99 = !DILocation(line: 128, column: 21, scope: !96)
!100 = !DILocation(line: 128, column: 26, scope: !96)
!101 = !DILocation(line: 128, column: 6, scope: !62)
!102 = !DILocation(line: 129, column: 3, scope: !96)
!103 = !DILocalVariable(name: "ret", scope: !62, file: !3, line: 131, type: !65)
!104 = !DILocation(line: 131, column: 11, scope: !62)
!105 = !DILocalVariable(name: "i", scope: !62, file: !3, line: 132, type: !50)
!106 = !DILocation(line: 132, column: 9, scope: !62)
!107 = !DILocation(line: 133, column: 9, scope: !108)
!108 = distinct !DILexicalBlock(scope: !62, file: !3, line: 133, column: 2)
!109 = !DILocation(line: 133, column: 7, scope: !108)
!110 = !DILocation(line: 133, column: 14, scope: !111)
!111 = distinct !DILexicalBlock(scope: !108, file: !3, line: 133, column: 2)
!112 = !DILocation(line: 133, column: 18, scope: !111)
!113 = !DILocation(line: 133, column: 21, scope: !111)
!114 = !DILocation(line: 133, column: 24, scope: !111)
!115 = !DILocation(line: 133, column: 2, scope: !108)
!116 = !DILocation(line: 136, column: 7, scope: !117)
!117 = distinct !DILexicalBlock(scope: !118, file: !3, line: 136, column: 7)
!118 = distinct !DILexicalBlock(scope: !111, file: !3, line: 133, column: 50)
!119 = !DILocation(line: 136, column: 9, scope: !117)
!120 = !DILocation(line: 136, column: 7, scope: !118)
!121 = !DILocation(line: 137, column: 8, scope: !122)
!122 = distinct !DILexicalBlock(scope: !117, file: !3, line: 136, column: 30)
!123 = !DILocation(line: 138, column: 4, scope: !122)
!124 = !DILocation(line: 141, column: 16, scope: !118)
!125 = !DILocation(line: 141, column: 20, scope: !118)
!126 = !DILocation(line: 141, column: 23, scope: !118)
!127 = !DILocation(line: 141, column: 3, scope: !118)
!128 = !DILocation(line: 141, column: 8, scope: !118)
!129 = !DILocation(line: 141, column: 11, scope: !118)
!130 = !DILocation(line: 141, column: 14, scope: !118)
!131 = !DILocation(line: 143, column: 7, scope: !132)
!132 = distinct !DILexicalBlock(scope: !118, file: !3, line: 143, column: 7)
!133 = !DILocation(line: 143, column: 11, scope: !132)
!134 = !DILocation(line: 143, column: 14, scope: !132)
!135 = !DILocation(line: 143, column: 22, scope: !132)
!136 = !DILocation(line: 143, column: 7, scope: !118)
!137 = !DILocation(line: 144, column: 4, scope: !138)
!138 = distinct !DILexicalBlock(scope: !132, file: !3, line: 143, column: 31)
!139 = !DILocation(line: 144, column: 9, scope: !138)
!140 = !DILocation(line: 144, column: 12, scope: !138)
!141 = !DILocation(line: 144, column: 20, scope: !138)
!142 = !DILocation(line: 145, column: 3, scope: !138)
!143 = !DILocalVariable(name: "j", scope: !144, file: !3, line: 154, type: !50)
!144 = distinct !DILexicalBlock(scope: !132, file: !3, line: 145, column: 10)
!145 = !DILocation(line: 154, column: 11, scope: !144)
!146 = !DILocation(line: 155, column: 11, scope: !147)
!147 = distinct !DILexicalBlock(scope: !144, file: !3, line: 155, column: 4)
!148 = !DILocation(line: 155, column: 9, scope: !147)
!149 = !DILocation(line: 155, column: 16, scope: !150)
!150 = distinct !DILexicalBlock(scope: !147, file: !3, line: 155, column: 4)
!151 = !DILocation(line: 155, column: 20, scope: !150)
!152 = !DILocation(line: 155, column: 23, scope: !150)
!153 = !DILocation(line: 155, column: 38, scope: !150)
!154 = !DILocation(line: 155, column: 29, scope: !150)
!155 = !DILocation(line: 155, column: 41, scope: !150)
!156 = !DILocation(line: 155, column: 26, scope: !150)
!157 = !DILocation(line: 155, column: 4, scope: !147)
!158 = !DILocation(line: 156, column: 18, scope: !159)
!159 = distinct !DILexicalBlock(scope: !160, file: !3, line: 156, column: 9)
!160 = distinct !DILexicalBlock(scope: !150, file: !3, line: 155, column: 50)
!161 = !DILocation(line: 156, column: 9, scope: !159)
!162 = !DILocation(line: 156, column: 21, scope: !159)
!163 = !DILocation(line: 156, column: 24, scope: !159)
!164 = !DILocation(line: 156, column: 9, scope: !160)
!165 = !DILocation(line: 157, column: 10, scope: !166)
!166 = distinct !DILexicalBlock(scope: !159, file: !3, line: 156, column: 45)
!167 = !DILocation(line: 158, column: 6, scope: !166)
!168 = !DILocation(line: 160, column: 4, scope: !160)
!169 = !DILocation(line: 155, column: 45, scope: !150)
!170 = !DILocation(line: 155, column: 4, scope: !150)
!171 = distinct !{!171, !157, !172}
!172 = !DILocation(line: 160, column: 4, scope: !147)
!173 = !DILocation(line: 163, column: 42, scope: !144)
!174 = !DILocation(line: 163, column: 33, scope: !144)
!175 = !DILocation(line: 163, column: 45, scope: !144)
!176 = !DILocation(line: 164, column: 6, scope: !144)
!177 = !DILocation(line: 163, column: 22, scope: !144)
!178 = !DILocation(line: 163, column: 4, scope: !144)
!179 = !DILocation(line: 163, column: 9, scope: !144)
!180 = !DILocation(line: 163, column: 12, scope: !144)
!181 = !DILocation(line: 163, column: 20, scope: !144)
!182 = !DILocation(line: 165, column: 8, scope: !183)
!183 = distinct !DILexicalBlock(scope: !144, file: !3, line: 165, column: 8)
!184 = !DILocation(line: 165, column: 13, scope: !183)
!185 = !DILocation(line: 165, column: 16, scope: !183)
!186 = !DILocation(line: 165, column: 24, scope: !183)
!187 = !DILocation(line: 165, column: 8, scope: !144)
!188 = !DILocation(line: 166, column: 9, scope: !189)
!189 = distinct !DILexicalBlock(scope: !183, file: !3, line: 165, column: 33)
!190 = !DILocation(line: 167, column: 5, scope: !189)
!191 = !DILocation(line: 170, column: 11, scope: !144)
!192 = !DILocation(line: 170, column: 16, scope: !144)
!193 = !DILocation(line: 170, column: 19, scope: !144)
!194 = !DILocation(line: 170, column: 28, scope: !144)
!195 = !DILocation(line: 170, column: 32, scope: !144)
!196 = !DILocation(line: 170, column: 35, scope: !144)
!197 = !DILocation(line: 171, column: 15, scope: !144)
!198 = !DILocation(line: 171, column: 6, scope: !144)
!199 = !DILocation(line: 171, column: 18, scope: !144)
!200 = !DILocation(line: 170, column: 4, scope: !144)
!201 = !DILocation(line: 173, column: 2, scope: !118)
!202 = !DILocation(line: 133, column: 45, scope: !111)
!203 = !DILocation(line: 133, column: 2, scope: !111)
!204 = distinct !{!204, !115, !205}
!205 = !DILocation(line: 173, column: 2, scope: !108)
!206 = !DILocation(line: 177, column: 2, scope: !62)
!207 = !DILocation(line: 177, column: 7, scope: !62)
!208 = !DILocation(line: 177, column: 10, scope: !62)
!209 = !DILocation(line: 177, column: 13, scope: !62)
!210 = !DILocation(line: 178, column: 2, scope: !62)
!211 = !DILocation(line: 178, column: 7, scope: !62)
!212 = !DILocation(line: 178, column: 10, scope: !62)
!213 = !DILocation(line: 178, column: 18, scope: !62)
!214 = !DILocation(line: 180, column: 2, scope: !62)
!215 = !DILabel(scope: !62, name: "error", file: !3, line: 182)
!216 = !DILocation(line: 182, column: 1, scope: !62)
!217 = !DILocation(line: 184, column: 2, scope: !62)
!218 = !DILocation(line: 184, column: 10, scope: !62)
!219 = !DILocation(line: 184, column: 13, scope: !62)
!220 = !DILocation(line: 185, column: 13, scope: !221)
!221 = distinct !DILexicalBlock(scope: !62, file: !3, line: 184, column: 18)
!222 = !DILocation(line: 185, column: 18, scope: !221)
!223 = !DILocation(line: 185, column: 21, scope: !221)
!224 = !DILocation(line: 185, column: 30, scope: !221)
!225 = !DILocation(line: 185, column: 3, scope: !221)
!226 = !DILocation(line: 186, column: 3, scope: !221)
!227 = !DILocation(line: 186, column: 8, scope: !221)
!228 = !DILocation(line: 186, column: 11, scope: !221)
!229 = !DILocation(line: 186, column: 19, scope: !221)
!230 = distinct !{!230, !217, !231}
!231 = !DILocation(line: 187, column: 2, scope: !62)
!232 = !DILocation(line: 189, column: 9, scope: !62)
!233 = !DILocation(line: 189, column: 2, scope: !62)
!234 = !DILocation(line: 190, column: 1, scope: !62)
!235 = distinct !DISubprogram(name: "lzma_raw_coder_init", scope: !3, file: !3, line: 242, type: !236, scopeLine: 245, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !88)
!236 = !DISubroutineType(types: !237)
!237 = !{!65, !238, !75, !66, !287, !53}
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_next_coder", file: !240, line: 80, baseType: !241)
!240 = !DIFile(filename: "liblzma/common/common.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_next_coder_s", file: !240, line: 124, size: 512, elements: !242)
!242 = !{!243, !246, !247, !250, !266, !271, !278, !283}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "coder", scope: !241, file: !240, line: 126, baseType: !244, size: 64)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_coder", file: !240, line: 78, baseType: null)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !241, file: !240, line: 130, baseType: !42, size: 64, offset: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !241, file: !240, line: 136, baseType: !248, size: 64, offset: 128)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !249, line: 90, baseType: !48)
!249 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!250 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !241, file: !240, line: 139, baseType: !251, size: 64, offset: 192)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_code_function", file: !240, line: 94, baseType: !252)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!253 = !DISubroutineType(types: !254)
!254 = !{!65, !244, !75, !255, !261, !50, !263, !261, !50, !265}
!255 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !256)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!257 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !258)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !45, line: 24, baseType: !259)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !47, line: 38, baseType: !260)
!260 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!261 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !262)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!263 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !264)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_action", file: !6, line: 322, baseType: !21)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !241, file: !240, line: 144, baseType: !267, size: 64, offset: 256)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_end_function", file: !240, line: 102, baseType: !268)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!269 = !DISubroutineType(types: !270)
!270 = !{null, !244, !75}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "get_check", scope: !241, file: !240, line: 148, baseType: !272, size: 64, offset: 320)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64)
!273 = !DISubroutineType(types: !274)
!274 = !{!275, !276}
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_check", file: !28, line: 55, baseType: !27)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!277 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !245)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "memconfig", scope: !241, file: !240, line: 152, baseType: !279, size: 64, offset: 384)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64)
!280 = !DISubroutineType(types: !281)
!281 = !{!65, !244, !282, !282, !44}
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !241, file: !240, line: 157, baseType: !284, size: 64, offset: 448)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64)
!285 = !DISubroutineType(types: !286)
!286 = !{!65, !244, !75, !66, !66}
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_filter_find", file: !288, line: 35, baseType: !289)
!288 = !DIFile(filename: "liblzma/common/filter_common.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64)
!290 = !DISubroutineType(types: !291)
!291 = !{!292, !42}
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64)
!293 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !294)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_filter_coder", file: !288, line: 32, baseType: !295)
!295 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !288, line: 20, size: 192, elements: !296)
!296 = !{!297, !298, !311}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !295, file: !288, line: 22, baseType: !42, size: 64)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !295, file: !288, line: 26, baseType: !299, size: 64, offset: 64)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_init_function", file: !240, line: 86, baseType: !300)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64)
!301 = !DISubroutineType(types: !302)
!302 = !{!65, !238, !75, !303}
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64)
!304 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !305)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_filter_info", file: !240, line: 82, baseType: !306)
!306 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_filter_info_s", file: !240, line: 109, size: 192, elements: !307)
!307 = !{!308, !309, !310}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !306, file: !240, line: 112, baseType: !42, size: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !306, file: !240, line: 116, baseType: !299, size: 64, offset: 64)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !306, file: !240, line: 119, baseType: !35, size: 64, offset: 128)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "memusage", scope: !295, file: !288, line: 30, baseType: !312, size: 64, offset: 128)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!313 = !DISubroutineType(types: !314)
!314 = !{!44, !315}
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!316 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!317 = !DILocalVariable(name: "next", arg: 1, scope: !235, file: !3, line: 242, type: !238)
!318 = !DILocation(line: 242, column: 38, scope: !235)
!319 = !DILocalVariable(name: "allocator", arg: 2, scope: !235, file: !3, line: 242, type: !75)
!320 = !DILocation(line: 242, column: 60, scope: !235)
!321 = !DILocalVariable(name: "options", arg: 3, scope: !235, file: !3, line: 243, type: !66)
!322 = !DILocation(line: 243, column: 22, scope: !235)
!323 = !DILocalVariable(name: "coder_find", arg: 4, scope: !235, file: !3, line: 244, type: !287)
!324 = !DILocation(line: 244, column: 20, scope: !235)
!325 = !DILocalVariable(name: "is_encoder", arg: 5, scope: !235, file: !3, line: 244, type: !53)
!326 = !DILocation(line: 244, column: 37, scope: !235)
!327 = !DILocalVariable(name: "count", scope: !235, file: !3, line: 247, type: !50)
!328 = !DILocation(line: 247, column: 9, scope: !235)
!329 = !DILocation(line: 248, column: 2, scope: !235)
!330 = !DILocalVariable(name: "ret_", scope: !331, file: !3, line: 248, type: !332)
!331 = distinct !DILexicalBlock(scope: !235, file: !3, line: 248, column: 2)
!332 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !65)
!333 = !DILocation(line: 248, column: 2, scope: !331)
!334 = !DILocation(line: 248, column: 2, scope: !335)
!335 = distinct !DILexicalBlock(scope: !331, file: !3, line: 248, column: 2)
!336 = !DILocalVariable(name: "filters", scope: !235, file: !3, line: 251, type: !337)
!337 = !DICompositeType(tag: DW_TAG_array_type, baseType: !305, size: 960, elements: !338)
!338 = !{!339}
!339 = !DISubrange(count: 5)
!340 = !DILocation(line: 251, column: 19, scope: !235)
!341 = !DILocation(line: 252, column: 6, scope: !342)
!342 = distinct !DILexicalBlock(scope: !235, file: !3, line: 252, column: 6)
!343 = !DILocation(line: 252, column: 6, scope: !235)
!344 = !DILocalVariable(name: "i", scope: !345, file: !3, line: 253, type: !50)
!345 = distinct !DILexicalBlock(scope: !346, file: !3, line: 253, column: 3)
!346 = distinct !DILexicalBlock(scope: !342, file: !3, line: 252, column: 18)
!347 = !DILocation(line: 253, column: 15, scope: !345)
!348 = !DILocation(line: 253, column: 8, scope: !345)
!349 = !DILocation(line: 253, column: 22, scope: !350)
!350 = distinct !DILexicalBlock(scope: !345, file: !3, line: 253, column: 3)
!351 = !DILocation(line: 253, column: 26, scope: !350)
!352 = !DILocation(line: 253, column: 24, scope: !350)
!353 = !DILocation(line: 253, column: 3, scope: !345)
!354 = !DILocalVariable(name: "j", scope: !355, file: !3, line: 257, type: !356)
!355 = distinct !DILexicalBlock(scope: !350, file: !3, line: 253, column: 38)
!356 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !50)
!357 = !DILocation(line: 257, column: 17, scope: !355)
!358 = !DILocation(line: 257, column: 21, scope: !355)
!359 = !DILocation(line: 257, column: 29, scope: !355)
!360 = !DILocation(line: 257, column: 27, scope: !355)
!361 = !DILocation(line: 257, column: 31, scope: !355)
!362 = !DILocalVariable(name: "fc", scope: !355, file: !3, line: 259, type: !363)
!363 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !292)
!364 = !DILocation(line: 259, column: 35, scope: !355)
!365 = !DILocation(line: 260, column: 8, scope: !355)
!366 = !DILocation(line: 260, column: 19, scope: !355)
!367 = !DILocation(line: 260, column: 27, scope: !355)
!368 = !DILocation(line: 260, column: 30, scope: !355)
!369 = !DILocation(line: 261, column: 8, scope: !370)
!370 = distinct !DILexicalBlock(scope: !355, file: !3, line: 261, column: 8)
!371 = !DILocation(line: 261, column: 11, scope: !370)
!372 = !DILocation(line: 261, column: 19, scope: !370)
