; ModuleID = 'liblzma/lzma/lzma_encoder.c'
source_filename = "liblzma/lzma/lzma_encoder.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.lzma_mf_s = type { i8*, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32 (%struct.lzma_mf_s*, %struct.lzma_match*)*, void (%struct.lzma_mf_s*, i32)*, i32*, i32*, i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.lzma_match = type { i32, i32 }
%struct.lzma_coder_s = type { %struct.lzma_range_encoder, i32, [4 x i32], [274 x %struct.lzma_match], i32, i32, i8, i8, i8, i32, i32, i32, [16 x [768 x i16]], [12 x [16 x i16]], [12 x i16], [12 x i16], [12 x i16], [12 x i16], [12 x [16 x i16]], [4 x [64 x i16]], [114 x i16], [16 x i16], %struct.lzma_length_encoder, %struct.lzma_length_encoder, [4 x [64 x i32]], [4 x [128 x i32]], i32, i32, [16 x i32], i32, i32, i32, [4096 x %struct.lzma_optimal] }
%struct.lzma_range_encoder = type { i64, i64, i32, i8, i64, i64, [58 x i32], [58 x i16*] }
%struct.lzma_length_encoder = type { i16, i16, [16 x [8 x i16]], [16 x [8 x i16]], [256 x i16], [16 x [272 x i32]], i32, [16 x i32] }
%struct.lzma_optimal = type { i32, i8, i8, i32, i32, i32, i32, i32, [4 x i32] }
%struct.lzma_options_lzma = type { i32, i8*, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i8*, i8* }
%struct.lzma_allocator = type { i8* (i8*, i64, i64)*, void (i8*, i8*)*, i8* }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !102, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "liblzma/lzma/lzma_encoder.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!2 = !{!3, !19, !25, !65, !80, !85, !92, !95}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 57, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "liblzma/api/lzma/base.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18}
!7 = !DIEnumerator(name: "LZMA_OK", value: 0, isUnsigned: true)
!8 = !DIEnumerator(name: "LZMA_STREAM_END", value: 1, isUnsigned: true)
!9 = !DIEnumerator(name: "LZMA_NO_CHECK", value: 2, isUnsigned: true)
!10 = !DIEnumerator(name: "LZMA_UNSUPPORTED_CHECK", value: 3, isUnsigned: true)
!11 = !DIEnumerator(name: "LZMA_GET_CHECK", value: 4, isUnsigned: true)
!12 = !DIEnumerator(name: "LZMA_MEM_ERROR", value: 5, isUnsigned: true)
!13 = !DIEnumerator(name: "LZMA_MEMLIMIT_ERROR", value: 6, isUnsigned: true)
!14 = !DIEnumerator(name: "LZMA_FORMAT_ERROR", value: 7, isUnsigned: true)
!15 = !DIEnumerator(name: "LZMA_OPTIONS_ERROR", value: 8, isUnsigned: true)
!16 = !DIEnumerator(name: "LZMA_DATA_ERROR", value: 9, isUnsigned: true)
!17 = !DIEnumerator(name: "LZMA_BUF_ERROR", value: 10, isUnsigned: true)
!18 = !DIEnumerator(name: "LZMA_PROG_ERROR", value: 11, isUnsigned: true)
!19 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 250, baseType: !5, size: 32, elements: !20)
!20 = !{!21, !22, !23, !24}
!21 = !DIEnumerator(name: "LZMA_RUN", value: 0, isUnsigned: true)
!22 = !DIEnumerator(name: "LZMA_SYNC_FLUSH", value: 1, isUnsigned: true)
!23 = !DIEnumerator(name: "LZMA_FULL_FLUSH", value: 2, isUnsigned: true)
!24 = !DIEnumerator(name: "LZMA_FINISH", value: 3, isUnsigned: true)
!25 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !27, file: !26, line: 40, baseType: !5, size: 32, elements: !59)
!26 = !DIFile(filename: "liblzma/rangecoder/range_encoder.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!27 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !26, line: 27, size: 5888, elements: !28)
!28 = !{!29, !35, !36, !39, !43, !46, !47, !51}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !27, file: !26, line: 28, baseType: !30, size: 64)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !31, line: 27, baseType: !32)
!31 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !33, line: 45, baseType: !34)
!33 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!34 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "cache_size", scope: !27, file: !26, line: 29, baseType: !30, size: 64, offset: 64)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !27, file: !26, line: 30, baseType: !37, size: 32, offset: 128)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !31, line: 26, baseType: !38)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !33, line: 42, baseType: !5)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !27, file: !26, line: 31, baseType: !40, size: 8, offset: 160)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !31, line: 24, baseType: !41)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !33, line: 38, baseType: !42)
!42 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !27, file: !26, line: 34, baseType: !44, size: 64, offset: 192)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !45, line: 46, baseType: !34)
!45 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!46 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !27, file: !26, line: 37, baseType: !44, size: 64, offset: 256)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "symbols", scope: !27, file: !26, line: 46, baseType: !48, size: 1856, offset: 320)
!48 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 1856, elements: !49)
!49 = !{!50}
!50 = !DISubrange(count: 58)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "probs", scope: !27, file: !26, line: 49, baseType: !52, size: 3712, offset: 2176)
!52 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 3712, elements: !49)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "probability", file: !55, line: 71, baseType: !56)
!55 = !DIFile(filename: "liblzma/rangecoder/range_common.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !31, line: 25, baseType: !57)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !33, line: 40, baseType: !58)
!58 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!59 = !{!60, !61, !62, !63, !64}
!60 = !DIEnumerator(name: "RC_BIT_0", value: 0, isUnsigned: true)
!61 = !DIEnumerator(name: "RC_BIT_1", value: 1, isUnsigned: true)
!62 = !DIEnumerator(name: "RC_DIRECT_0", value: 2, isUnsigned: true)
!63 = !DIEnumerator(name: "RC_DIRECT_1", value: 3, isUnsigned: true)
!64 = !DIEnumerator(name: "RC_FLUSH", value: 4, isUnsigned: true)
!65 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !66, line: 56, baseType: !5, size: 32, elements: !67)
!66 = !DIFile(filename: "liblzma/lzma/lzma_common.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!67 = !{!68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79}
!68 = !DIEnumerator(name: "STATE_LIT_LIT", value: 0, isUnsigned: true)
!69 = !DIEnumerator(name: "STATE_MATCH_LIT_LIT", value: 1, isUnsigned: true)
!70 = !DIEnumerator(name: "STATE_REP_LIT_LIT", value: 2, isUnsigned: true)
!71 = !DIEnumerator(name: "STATE_SHORTREP_LIT_LIT", value: 3, isUnsigned: true)
!72 = !DIEnumerator(name: "STATE_MATCH_LIT", value: 4, isUnsigned: true)
!73 = !DIEnumerator(name: "STATE_REP_LIT", value: 5, isUnsigned: true)
!74 = !DIEnumerator(name: "STATE_SHORTREP_LIT", value: 6, isUnsigned: true)
!75 = !DIEnumerator(name: "STATE_LIT_MATCH", value: 7, isUnsigned: true)
!76 = !DIEnumerator(name: "STATE_LIT_LONGREP", value: 8, isUnsigned: true)
!77 = !DIEnumerator(name: "STATE_LIT_SHORTREP", value: 9, isUnsigned: true)
!78 = !DIEnumerator(name: "STATE_NONLIT_MATCH", value: 10, isUnsigned: true)
!79 = !DIEnumerator(name: "STATE_NONLIT_REP", value: 11, isUnsigned: true)
!80 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !81, line: 138, baseType: !5, size: 32, elements: !82)
!81 = !DIFile(filename: "liblzma/api/lzma/lzma.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!82 = !{!83, !84}
!83 = !DIEnumerator(name: "LZMA_MODE_FAST", value: 1, isUnsigned: true)
!84 = !DIEnumerator(name: "LZMA_MODE_NORMAL", value: 2, isUnsigned: true)
!85 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !81, line: 58, baseType: !5, size: 32, elements: !86)
!86 = !{!87, !88, !89, !90, !91}
!87 = !DIEnumerator(name: "LZMA_MF_HC3", value: 3, isUnsigned: true)
!88 = !DIEnumerator(name: "LZMA_MF_HC4", value: 4, isUnsigned: true)
!89 = !DIEnumerator(name: "LZMA_MF_BT2", value: 18, isUnsigned: true)
!90 = !DIEnumerator(name: "LZMA_MF_BT3", value: 19, isUnsigned: true)
!91 = !DIEnumerator(name: "LZMA_MF_BT4", value: 20, isUnsigned: true)
!92 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 44, baseType: !5, size: 32, elements: !93)
!93 = !{!94}
!94 = !DIEnumerator(name: "LZMA_RESERVED_ENUM", value: 0, isUnsigned: true)
!95 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !96, line: 27, baseType: !5, size: 32, elements: !97)
!96 = !DIFile(filename: "liblzma/api/lzma/check.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!97 = !{!98, !99, !100, !101}
!98 = !DIEnumerator(name: "LZMA_CHECK_NONE", value: 0, isUnsigned: true)
!99 = !DIEnumerator(name: "LZMA_CHECK_CRC32", value: 1, isUnsigned: true)
!100 = !DIEnumerator(name: "LZMA_CHECK_CRC64", value: 4, isUnsigned: true)
!101 = !DIEnumerator(name: "LZMA_CHECK_SHA256", value: 10, isUnsigned: true)
!102 = !{!103, !30, !37, !40}
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!104 = !{i32 7, !"Dwarf Version", i32 4}
!105 = !{i32 2, !"Debug Info Version", i32 3}
!106 = !{i32 1, !"wchar_size", i32 4}
!107 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!108 = distinct !DISubprogram(name: "lzma_lzma_encode", scope: !1, file: !1, line: 318, type: !109, scopeLine: 321, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !162)
!109 = !DISubroutineType(types: !110)
!110 = !{!111, !112, !115, !159, !160, !44, !37}
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_ret", file: !4, line: 237, baseType: !3)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_coder", file: !114, line: 78, baseType: null)
!114 = !DIFile(filename: "liblzma/common/common.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!115 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !116)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_mf", file: !118, line: 28, baseType: !119)
!118 = !DIFile(filename: "liblzma/lz/lz_encoder.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_mf_s", file: !118, line: 29, size: 960, elements: !120)
!120 = !{!121, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !142, !146, !148, !149, !150, !151, !152, !153, !154, !155, !157, !158}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !119, file: !118, line: 35, baseType: !122, size: 64)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !119, file: !118, line: 39, baseType: !37, size: 32, offset: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "keep_size_before", scope: !119, file: !118, line: 45, baseType: !37, size: 32, offset: 96)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "keep_size_after", scope: !119, file: !118, line: 51, baseType: !37, size: 32, offset: 128)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !119, file: !118, line: 58, baseType: !37, size: 32, offset: 160)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "read_pos", scope: !119, file: !118, line: 63, baseType: !37, size: 32, offset: 192)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "read_ahead", scope: !119, file: !118, line: 67, baseType: !37, size: 32, offset: 224)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "read_limit", scope: !119, file: !118, line: 75, baseType: !37, size: 32, offset: 256)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "write_pos", scope: !119, file: !118, line: 80, baseType: !37, size: 32, offset: 288)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !119, file: !118, line: 84, baseType: !37, size: 32, offset: 320)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "find", scope: !119, file: !118, line: 92, baseType: !133, size: 64, offset: 384)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = !DISubroutineType(types: !135)
!135 = !{!37, !116, !136}
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_match", file: !118, line: 25, baseType: !138)
!138 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !118, line: 22, size: 64, elements: !139)
!139 = !{!140, !141}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !138, file: !118, line: 23, baseType: !37, size: 32)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !138, file: !118, line: 24, baseType: !37, size: 32, offset: 32)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "skip", scope: !119, file: !118, line: 97, baseType: !143, size: 64, offset: 448)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!144 = !DISubroutineType(types: !145)
!145 = !{null, !116, !37}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !119, file: !118, line: 99, baseType: !147, size: 64, offset: 512)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "son", scope: !119, file: !118, line: 100, baseType: !147, size: 64, offset: 576)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_pos", scope: !119, file: !118, line: 101, baseType: !37, size: 32, offset: 640)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_size", scope: !119, file: !118, line: 102, baseType: !37, size: 32, offset: 672)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "hash_mask", scope: !119, file: !118, line: 103, baseType: !37, size: 32, offset: 704)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !119, file: !118, line: 106, baseType: !37, size: 32, offset: 736)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "nice_len", scope: !119, file: !118, line: 109, baseType: !37, size: 32, offset: 768)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "match_len_max", scope: !119, file: !118, line: 114, baseType: !37, size: 32, offset: 800)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !119, file: !118, line: 119, baseType: !156, size: 32, offset: 832)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_action", file: !4, line: 322, baseType: !19)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "hash_size_sum", scope: !119, file: !118, line: 122, baseType: !37, size: 32, offset: 864)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "sons_count", scope: !119, file: !118, line: 125, baseType: !37, size: 32, offset: 896)
!159 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !122)
!160 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !161)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!162 = !{}
!163 = !DILocalVariable(name: "pcoder", arg: 1, scope: !108, file: !1, line: 318, type: !112)
!164 = !DILocation(line: 318, column: 43, scope: !108)
!165 = !DILocalVariable(name: "mf", arg: 2, scope: !108, file: !1, line: 318, type: !115)
!166 = !DILocation(line: 318, column: 69, scope: !108)
!167 = !DILocalVariable(name: "out", arg: 3, scope: !108, file: !1, line: 319, type: !159)
!168 = !DILocation(line: 319, column: 21, scope: !108)
!169 = !DILocalVariable(name: "out_pos", arg: 4, scope: !108, file: !1, line: 319, type: !160)
!170 = !DILocation(line: 319, column: 43, scope: !108)
!171 = !DILocalVariable(name: "out_size", arg: 5, scope: !108, file: !1, line: 320, type: !44)
!172 = !DILocation(line: 320, column: 10, scope: !108)
!173 = !DILocalVariable(name: "limit", arg: 6, scope: !108, file: !1, line: 320, type: !37)
!174 = !DILocation(line: 320, column: 29, scope: !108)
!175 = !DILocalVariable(name: "coder", scope: !108, file: !1, line: 322, type: !176)
!176 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !177)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!178 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_coder_s", file: !179, line: 72, size: 1996608, elements: !180)
!179 = !DIFile(filename: "liblzma/lzma/lzma_encoder_private.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!180 = !{!181, !183, !185, !189, !193, !194, !195, !197, !198, !199, !200, !201, !202, !207, !211, !214, !215, !216, !217, !218, !222, !226, !229, !251, !252, !254, !258, !259, !260, !261, !262, !263, !264}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "rc", scope: !178, file: !179, line: 74, baseType: !182, size: 5888)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_range_encoder", file: !26, line: 51, baseType: !27)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !178, file: !179, line: 77, baseType: !184, size: 32, offset: 5888)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_lzma_state", file: !66, line: 69, baseType: !65)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "reps", scope: !178, file: !179, line: 80, baseType: !186, size: 128, offset: 5920)
!186 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 128, elements: !187)
!187 = !{!188}
!188 = !DISubrange(count: 4)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "matches", scope: !178, file: !179, line: 83, baseType: !190, size: 17536, offset: 6048)
!190 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 17536, elements: !191)
!191 = !{!192}
!192 = !DISubrange(count: 274)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "matches_count", scope: !178, file: !179, line: 86, baseType: !37, size: 32, offset: 23584)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "longest_match_length", scope: !178, file: !179, line: 90, baseType: !37, size: 32, offset: 23616)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "fast_mode", scope: !178, file: !179, line: 93, baseType: !196, size: 8, offset: 23648)
!196 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "is_initialized", scope: !178, file: !179, line: 97, baseType: !196, size: 8, offset: 23656)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "is_flushed", scope: !178, file: !179, line: 101, baseType: !196, size: 8, offset: 23664)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "pos_mask", scope: !178, file: !179, line: 103, baseType: !37, size: 32, offset: 23680)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "literal_context_bits", scope: !178, file: !179, line: 104, baseType: !37, size: 32, offset: 23712)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "literal_pos_mask", scope: !178, file: !179, line: 105, baseType: !37, size: 32, offset: 23744)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "literal", scope: !178, file: !179, line: 108, baseType: !203, size: 196608, offset: 23776)
!203 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 196608, elements: !204)
!204 = !{!205, !206}
!205 = !DISubrange(count: 16)
!206 = !DISubrange(count: 768)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "is_match", scope: !178, file: !179, line: 109, baseType: !208, size: 3072, offset: 220384)
!208 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 3072, elements: !209)
!209 = !{!210, !205}
!210 = !DISubrange(count: 12)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "is_rep", scope: !178, file: !179, line: 110, baseType: !212, size: 192, offset: 223456)
!212 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 192, elements: !213)
!213 = !{!210}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "is_rep0", scope: !178, file: !179, line: 111, baseType: !212, size: 192, offset: 223648)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "is_rep1", scope: !178, file: !179, line: 112, baseType: !212, size: 192, offset: 223840)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "is_rep2", scope: !178, file: !179, line: 113, baseType: !212, size: 192, offset: 224032)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "is_rep0_long", scope: !178, file: !179, line: 114, baseType: !208, size: 3072, offset: 224224)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "pos_slot", scope: !178, file: !179, line: 115, baseType: !219, size: 4096, offset: 227296)
!219 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 4096, elements: !220)
!220 = !{!188, !221}
!221 = !DISubrange(count: 64)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "pos_special", scope: !178, file: !179, line: 116, baseType: !223, size: 1824, offset: 231392)
!223 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 1824, elements: !224)
!224 = !{!225}
!225 = !DISubrange(count: 114)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "pos_align", scope: !178, file: !179, line: 117, baseType: !227, size: 256, offset: 233216)
!227 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 256, elements: !228)
!228 = !{!205}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "match_len_encoder", scope: !178, file: !179, line: 121, baseType: !230, size: 148032, offset: 233472)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_length_encoder", file: !179, line: 51, baseType: !231)
!231 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !179, line: 40, size: 148032, elements: !232)
!232 = !{!233, !234, !235, !239, !240, !244, !248, !249}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "choice", scope: !231, file: !179, line: 41, baseType: !54, size: 16)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "choice2", scope: !231, file: !179, line: 42, baseType: !54, size: 16, offset: 16)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !231, file: !179, line: 43, baseType: !236, size: 2048, offset: 32)
!236 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 2048, elements: !237)
!237 = !{!205, !238}
!238 = !DISubrange(count: 8)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "mid", scope: !231, file: !179, line: 44, baseType: !236, size: 2048, offset: 2080)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !231, file: !179, line: 45, baseType: !241, size: 4096, offset: 4128)
!241 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 4096, elements: !242)
!242 = !{!243}
!243 = !DISubrange(count: 256)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "prices", scope: !231, file: !179, line: 47, baseType: !245, size: 139264, offset: 8224)
!245 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 139264, elements: !246)
!246 = !{!205, !247}
!247 = !DISubrange(count: 272)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "table_size", scope: !231, file: !179, line: 48, baseType: !37, size: 32, offset: 147488)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "counters", scope: !231, file: !179, line: 49, baseType: !250, size: 512, offset: 147520)
!250 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 512, elements: !228)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "rep_len_encoder", scope: !178, file: !179, line: 122, baseType: !230, size: 148032, offset: 381504)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "pos_slot_prices", scope: !178, file: !179, line: 125, baseType: !253, size: 8192, offset: 529536)
!253 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 8192, elements: !220)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "distances_prices", scope: !178, file: !179, line: 126, baseType: !255, size: 16384, offset: 537728)
!255 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 16384, elements: !256)
!256 = !{!188, !257}
!257 = !DISubrange(count: 128)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "dist_table_size", scope: !178, file: !179, line: 127, baseType: !37, size: 32, offset: 554112)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "match_price_count", scope: !178, file: !179, line: 128, baseType: !37, size: 32, offset: 554144)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "align_prices", scope: !178, file: !179, line: 130, baseType: !250, size: 512, offset: 554176)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "align_price_count", scope: !178, file: !179, line: 131, baseType: !37, size: 32, offset: 554688)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "opts_end_index", scope: !178, file: !179, line: 134, baseType: !37, size: 32, offset: 554720)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "opts_current_index", scope: !178, file: !179, line: 135, baseType: !37, size: 32, offset: 554752)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "opts", scope: !178, file: !179, line: 136, baseType: !265, size: 1441792, offset: 554784)
!265 = !DICompositeType(tag: DW_TAG_array_type, baseType: !266, size: 1441792, elements: !278)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_optimal", file: !179, line: 69, baseType: !267)
!267 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !179, line: 54, size: 352, elements: !268)
!268 = !{!269, !270, !271, !272, !273, !274, !275, !276, !277}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !267, file: !179, line: 55, baseType: !184, size: 32)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "prev_1_is_literal", scope: !267, file: !179, line: 57, baseType: !196, size: 8, offset: 32)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "prev_2", scope: !267, file: !179, line: 58, baseType: !196, size: 8, offset: 40)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "pos_prev_2", scope: !267, file: !179, line: 60, baseType: !37, size: 32, offset: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "back_prev_2", scope: !267, file: !179, line: 61, baseType: !37, size: 32, offset: 96)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "price", scope: !267, file: !179, line: 63, baseType: !37, size: 32, offset: 128)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "pos_prev", scope: !267, file: !179, line: 64, baseType: !37, size: 32, offset: 160)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "back_prev", scope: !267, file: !179, line: 65, baseType: !37, size: 32, offset: 192)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "backs", scope: !267, file: !179, line: 67, baseType: !186, size: 128, offset: 224)
!278 = !{!279}
!279 = !DISubrange(count: 4096)
!280 = !DILocation(line: 322, column: 32, scope: !108)
!281 = !DILocation(line: 322, column: 40, scope: !108)
!282 = !DILocation(line: 324, column: 7, scope: !283)
!283 = distinct !DILexicalBlock(scope: !108, file: !1, line: 324, column: 6)
!284 = !DILocation(line: 324, column: 14, scope: !283)
!285 = !DILocation(line: 324, column: 29, scope: !283)
!286 = !DILocation(line: 324, column: 45, scope: !283)
!287 = !DILocation(line: 324, column: 52, scope: !283)
!288 = !DILocation(line: 324, column: 33, scope: !283)
!289 = !DILocation(line: 324, column: 6, scope: !108)
!290 = !DILocation(line: 325, column: 3, scope: !283)
!291 = !DILocalVariable(name: "position", scope: !108, file: !1, line: 328, type: !37)
!292 = !DILocation(line: 328, column: 11, scope: !108)
!293 = !DILocation(line: 328, column: 34, scope: !108)
!294 = !DILocation(line: 328, column: 22, scope: !108)
!295 = !DILocation(line: 330, column: 2, scope: !108)
!296 = !DILocation(line: 337, column: 18, scope: !297)
!297 = distinct !DILexicalBlock(scope: !298, file: !1, line: 337, column: 7)
!298 = distinct !DILexicalBlock(scope: !108, file: !1, line: 330, column: 15)
!299 = !DILocation(line: 337, column: 25, scope: !297)
!300 = !DILocation(line: 337, column: 29, scope: !297)
!301 = !DILocation(line: 337, column: 34, scope: !297)
!302 = !DILocation(line: 337, column: 43, scope: !297)
!303 = !DILocation(line: 337, column: 7, scope: !297)
!304 = !DILocation(line: 337, column: 7, scope: !298)
!305 = !DILocation(line: 339, column: 4, scope: !306)
!306 = distinct !DILexicalBlock(scope: !297, file: !1, line: 337, column: 54)
!307 = !DILocation(line: 345, column: 7, scope: !308)
!308 = distinct !DILexicalBlock(scope: !298, file: !1, line: 345, column: 7)
!309 = !DILocation(line: 345, column: 13, scope: !308)
!310 = !DILocation(line: 346, column: 5, scope: !308)
!311 = !DILocation(line: 346, column: 9, scope: !308)
!312 = !DILocation(line: 346, column: 13, scope: !308)
!313 = !DILocation(line: 346, column: 24, scope: !308)
!314 = !DILocation(line: 346, column: 28, scope: !308)
!315 = !DILocation(line: 346, column: 22, scope: !308)
!316 = !DILocation(line: 346, column: 42, scope: !308)
!317 = !DILocation(line: 346, column: 39, scope: !308)
!318 = !DILocation(line: 347, column: 6, scope: !308)
!319 = !DILocation(line: 347, column: 10, scope: !308)
!320 = !DILocation(line: 347, column: 9, scope: !308)
!321 = !DILocation(line: 347, column: 32, scope: !308)
!322 = !DILocation(line: 347, column: 39, scope: !308)
!323 = !DILocation(line: 347, column: 20, scope: !308)
!324 = !DILocation(line: 347, column: 18, scope: !308)
!325 = !DILocation(line: 348, column: 7, scope: !308)
!326 = !DILocation(line: 345, column: 7, scope: !298)
!327 = !DILocation(line: 350, column: 4, scope: !308)
!328 = !DILocation(line: 353, column: 7, scope: !329)
!329 = distinct !DILexicalBlock(scope: !298, file: !1, line: 353, column: 7)
!330 = !DILocation(line: 353, column: 11, scope: !329)
!331 = !DILocation(line: 353, column: 23, scope: !329)
!332 = !DILocation(line: 353, column: 27, scope: !329)
!333 = !DILocation(line: 353, column: 20, scope: !329)
!334 = !DILocation(line: 353, column: 7, scope: !298)
!335 = !DILocation(line: 354, column: 8, scope: !336)
!336 = distinct !DILexicalBlock(scope: !337, file: !1, line: 354, column: 8)
!337 = distinct !DILexicalBlock(scope: !329, file: !1, line: 353, column: 39)
!338 = !DILocation(line: 354, column: 12, scope: !336)
!339 = !DILocation(line: 354, column: 19, scope: !336)
!340 = !DILocation(line: 354, column: 8, scope: !337)
!341 = !DILocation(line: 355, column: 5, scope: !336)
!342 = !DILocation(line: 357, column: 8, scope: !343)
!343 = distinct !DILexicalBlock(scope: !337, file: !1, line: 357, column: 8)
!344 = !DILocation(line: 357, column: 12, scope: !343)
!345 = !DILocation(line: 357, column: 23, scope: !343)
!346 = !DILocation(line: 357, column: 8, scope: !337)
!347 = !DILocation(line: 358, column: 5, scope: !343)
!348 = !DILocation(line: 359, column: 3, scope: !337)
!349 = !DILocalVariable(name: "len", scope: !298, file: !1, line: 369, type: !37)
!350 = !DILocation(line: 369, column: 12, scope: !298)
!351 = !DILocalVariable(name: "back", scope: !298, file: !1, line: 370, type: !37)
!352 = !DILocation(line: 370, column: 12, scope: !298)
!353 = !DILocation(line: 372, column: 7, scope: !354)
!354 = distinct !DILexicalBlock(scope: !298, file: !1, line: 372, column: 7)
!355 = !DILocation(line: 372, column: 14, scope: !354)
!356 = !DILocation(line: 372, column: 7, scope: !298)
!357 = !DILocation(line: 373, column: 27, scope: !354)
!358 = !DILocation(line: 373, column: 34, scope: !354)
!359 = !DILocation(line: 373, column: 4, scope: !354)
!360 = !DILocation(line: 376, column: 6, scope: !354)
!361 = !DILocation(line: 376, column: 13, scope: !354)
!362 = !DILocation(line: 376, column: 30, scope: !354)
!363 = !DILocation(line: 375, column: 4, scope: !354)
!364 = !DILocation(line: 378, column: 17, scope: !298)
!365 = !DILocation(line: 378, column: 24, scope: !298)
!366 = !DILocation(line: 378, column: 28, scope: !298)
!367 = !DILocation(line: 378, column: 34, scope: !298)
!368 = !DILocation(line: 378, column: 39, scope: !298)
!369 = !DILocation(line: 378, column: 3, scope: !298)
!370 = !DILocation(line: 380, column: 15, scope: !298)
!371 = !DILocation(line: 380, column: 12, scope: !298)
!372 = distinct !{!372, !295, !373}
!373 = !DILocation(line: 381, column: 2, scope: !108)
!374 = !DILocation(line: 383, column: 7, scope: !375)
!375 = distinct !DILexicalBlock(scope: !108, file: !1, line: 383, column: 6)
!376 = !DILocation(line: 383, column: 14, scope: !375)
!377 = !DILocation(line: 383, column: 6, scope: !108)
!378 = !DILocation(line: 384, column: 3, scope: !379)
!379 = distinct !DILexicalBlock(scope: !375, file: !1, line: 383, column: 26)
!380 = !DILocation(line: 384, column: 10, scope: !379)
!381 = !DILocation(line: 384, column: 21, scope: !379)
!382 = !DILocation(line: 388, column: 7, scope: !383)
!383 = distinct !DILexicalBlock(scope: !379, file: !1, line: 388, column: 7)
!384 = !DILocation(line: 388, column: 13, scope: !383)
!385 = !DILocation(line: 388, column: 7, scope: !379)
!386 = !DILocation(line: 389, column: 16, scope: !383)
!387 = !DILocation(line: 389, column: 23, scope: !383)
!388 = !DILocation(line: 389, column: 4, scope: !383)
!389 = !DILocation(line: 392, column: 13, scope: !379)
!390 = !DILocation(line: 392, column: 20, scope: !379)
!391 = !DILocation(line: 392, column: 3, scope: !379)
!392 = !DILocation(line: 398, column: 18, scope: !393)
!393 = distinct !DILexicalBlock(scope: !379, file: !1, line: 398, column: 7)
!394 = !DILocation(line: 398, column: 25, scope: !393)
!395 = !DILocation(line: 398, column: 29, scope: !393)
!396 = !DILocation(line: 398, column: 34, scope: !393)
!397 = !DILocation(line: 398, column: 43, scope: !393)
!398 = !DILocation(line: 398, column: 7, scope: !393)
!399 = !DILocation(line: 398, column: 7, scope: !379)
!400 = !DILocation(line: 400, column: 4, scope: !401)
!401 = distinct !DILexicalBlock(scope: !393, file: !1, line: 398, column: 54)
!402 = !DILocation(line: 402, column: 2, scope: !379)
!403 = !DILocation(line: 405, column: 2, scope: !108)
!404 = !DILocation(line: 405, column: 9, scope: !108)
!405 = !DILocation(line: 405, column: 20, scope: !108)
!406 = !DILocation(line: 407, column: 2, scope: !108)
!407 = !DILocation(line: 408, column: 1, scope: !108)
!408 = distinct !DISubprogram(name: "encode_init", scope: !1, file: !1, line: 272, type: !409, scopeLine: 273, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !162)
!409 = !DISubroutineType(types: !410)
!410 = !{!196, !112, !116}
!411 = !DILocalVariable(name: "pcoder", arg: 1, scope: !408, file: !1, line: 272, type: !112)
!412 = !DILocation(line: 272, column: 25, scope: !408)
!413 = !DILocalVariable(name: "mf", arg: 2, scope: !408, file: !1, line: 272, type: !116)
!414 = !DILocation(line: 272, column: 42, scope: !408)
!415 = !DILocalVariable(name: "coder", scope: !408, file: !1, line: 274, type: !177)
!416 = !DILocation(line: 274, column: 23, scope: !408)
!417 = !DILocation(line: 274, column: 31, scope: !408)
!418 = !DILocation(line: 277, column: 6, scope: !419)
!419 = distinct !DILexicalBlock(scope: !408, file: !1, line: 277, column: 6)
!420 = !DILocation(line: 277, column: 10, scope: !419)
!421 = !DILocation(line: 277, column: 22, scope: !419)
!422 = !DILocation(line: 277, column: 26, scope: !419)
!423 = !DILocation(line: 277, column: 19, scope: !419)
!424 = !DILocation(line: 277, column: 6, scope: !408)
!425 = !DILocation(line: 278, column: 7, scope: !426)
!426 = distinct !DILexicalBlock(scope: !427, file: !1, line: 278, column: 7)
!427 = distinct !DILexicalBlock(scope: !419, file: !1, line: 277, column: 38)
!428 = !DILocation(line: 278, column: 11, scope: !426)
!429 = !DILocation(line: 278, column: 18, scope: !426)
!430 = !DILocation(line: 278, column: 7, scope: !427)
!431 = !DILocation(line: 279, column: 4, scope: !426)
!432 = !DILocation(line: 284, column: 2, scope: !427)
!433 = !DILocation(line: 287, column: 11, scope: !434)
!434 = distinct !DILexicalBlock(scope: !419, file: !1, line: 284, column: 9)
!435 = !DILocation(line: 287, column: 3, scope: !434)
!436 = !DILocation(line: 288, column: 3, scope: !434)
!437 = !DILocation(line: 288, column: 7, scope: !434)
!438 = !DILocation(line: 288, column: 18, scope: !434)
!439 = !DILocation(line: 289, column: 11, scope: !434)
!440 = !DILocation(line: 289, column: 18, scope: !434)
!441 = !DILocation(line: 289, column: 23, scope: !434)
!442 = !DILocation(line: 289, column: 30, scope: !434)
!443 = !DILocation(line: 289, column: 3, scope: !434)
!444 = !DILocation(line: 290, column: 15, scope: !434)
!445 = !DILocation(line: 290, column: 22, scope: !434)
!446 = !DILocation(line: 290, column: 26, scope: !434)
!447 = !DILocation(line: 290, column: 33, scope: !434)
!448 = !DILocation(line: 290, column: 48, scope: !434)
!449 = !DILocation(line: 290, column: 52, scope: !434)
!450 = !DILocation(line: 290, column: 3, scope: !434)
!451 = !DILocation(line: 294, column: 2, scope: !408)
!452 = !DILocation(line: 294, column: 9, scope: !408)
!453 = !DILocation(line: 294, column: 24, scope: !408)
!454 = !DILocation(line: 296, column: 2, scope: !408)
!455 = !DILocation(line: 297, column: 1, scope: !408)
!456 = distinct !DISubprogram(name: "mf_position", scope: !118, file: !118, line: 253, type: !457, scopeLine: 254, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !162)
!457 = !DISubroutineType(types: !458)
!458 = !{!37, !459}
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64)
!460 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !117)
!461 = !DILocalVariable(name: "mf", arg: 1, scope: !456, file: !118, line: 253, type: !459)
!462 = !DILocation(line: 253, column: 28, scope: !456)
!463 = !DILocation(line: 255, column: 9, scope: !456)
!464 = !DILocation(line: 255, column: 13, scope: !456)
!465 = !DILocation(line: 255, column: 24, scope: !456)
!466 = !DILocation(line: 255, column: 28, scope: !456)
!467 = !DILocation(line: 255, column: 22, scope: !456)
!468 = !DILocation(line: 255, column: 2, scope: !456)
!469 = distinct !DISubprogram(name: "rc_encode", scope: !26, file: !26, line: 150, type: !470, scopeLine: 152, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !162)
!470 = !DISubroutineType(types: !471)
!471 = !{!196, !472, !122, !161, !44}
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!473 = !DILocalVariable(name: "rc", arg: 1, scope: !469, file: !26, line: 150, type: !472)
!474 = !DILocation(line: 150, column: 31, scope: !469)
!475 = !DILocalVariable(name: "out", arg: 2, scope: !469, file: !26, line: 151, type: !122)
!476 = !DILocation(line: 151, column: 12, scope: !469)
!477 = !DILocalVariable(name: "out_pos", arg: 3, scope: !469, file: !26, line: 151, type: !161)
!478 = !DILocation(line: 151, column: 25, scope: !469)
!479 = !DILocalVariable(name: "out_size", arg: 4, scope: !469, file: !26, line: 151, type: !44)
!480 = !DILocation(line: 151, column: 41, scope: !469)
!481 = !DILocation(line: 155, column: 2, scope: !469)
!482 = !DILocation(line: 155, column: 9, scope: !469)
!483 = !DILocation(line: 155, column: 13, scope: !469)
!484 = !DILocation(line: 155, column: 19, scope: !469)
!485 = !DILocation(line: 155, column: 23, scope: !469)
!486 = !DILocation(line: 155, column: 17, scope: !469)
!487 = !DILocation(line: 157, column: 7, scope: !488)
!488 = distinct !DILexicalBlock(scope: !489, file: !26, line: 157, column: 7)
!489 = distinct !DILexicalBlock(scope: !469, file: !26, line: 155, column: 30)
!490 = !DILocation(line: 157, column: 11, scope: !488)
!491 = !DILocation(line: 157, column: 17, scope: !488)
!492 = !DILocation(line: 157, column: 7, scope: !489)
!493 = !DILocation(line: 158, column: 21, scope: !494)
!494 = distinct !DILexicalBlock(scope: !495, file: !26, line: 158, column: 8)
!495 = distinct !DILexicalBlock(scope: !488, file: !26, line: 157, column: 33)
!496 = !DILocation(line: 158, column: 25, scope: !494)
!497 = !DILocation(line: 158, column: 30, scope: !494)
!498 = !DILocation(line: 158, column: 39, scope: !494)
!499 = !DILocation(line: 158, column: 8, scope: !494)
!500 = !DILocation(line: 158, column: 8, scope: !495)
!501 = !DILocation(line: 159, column: 5, scope: !494)
!502 = !DILocation(line: 161, column: 4, scope: !495)
!503 = !DILocation(line: 161, column: 8, scope: !495)
!504 = !DILocation(line: 161, column: 14, scope: !495)
!505 = !DILocation(line: 162, column: 3, scope: !495)
!506 = !DILocation(line: 165, column: 11, scope: !489)
!507 = !DILocation(line: 165, column: 15, scope: !489)
!508 = !DILocation(line: 165, column: 23, scope: !489)
!509 = !DILocation(line: 165, column: 27, scope: !489)
!510 = !DILocation(line: 165, column: 3, scope: !489)
!511 = !DILocalVariable(name: "prob", scope: !512, file: !26, line: 167, type: !54)
!512 = distinct !DILexicalBlock(scope: !513, file: !26, line: 166, column: 18)
!513 = distinct !DILexicalBlock(scope: !489, file: !26, line: 165, column: 33)
!514 = !DILocation(line: 167, column: 16, scope: !512)
!515 = !DILocation(line: 167, column: 24, scope: !512)
!516 = !DILocation(line: 167, column: 28, scope: !512)
!517 = !DILocation(line: 167, column: 34, scope: !512)
!518 = !DILocation(line: 167, column: 38, scope: !512)
!519 = !DILocation(line: 167, column: 23, scope: !512)
!520 = !DILocation(line: 168, column: 17, scope: !512)
!521 = !DILocation(line: 168, column: 21, scope: !512)
!522 = !DILocation(line: 168, column: 27, scope: !512)
!523 = !DILocation(line: 169, column: 8, scope: !512)
!524 = !DILocation(line: 169, column: 6, scope: !512)
!525 = !DILocation(line: 168, column: 4, scope: !512)
!526 = !DILocation(line: 168, column: 8, scope: !512)
!527 = !DILocation(line: 168, column: 14, scope: !512)
!528 = !DILocation(line: 170, column: 34, scope: !512)
!529 = !DILocation(line: 170, column: 32, scope: !512)
!530 = !DILocation(line: 170, column: 40, scope: !512)
!531 = !DILocation(line: 170, column: 9, scope: !512)
!532 = !DILocation(line: 171, column: 26, scope: !512)
!533 = !DILocation(line: 171, column: 5, scope: !512)
!534 = !DILocation(line: 171, column: 9, scope: !512)
!535 = !DILocation(line: 171, column: 15, scope: !512)
!536 = !DILocation(line: 171, column: 19, scope: !512)
!537 = !DILocation(line: 171, column: 24, scope: !512)
!538 = !DILocation(line: 172, column: 4, scope: !512)
!539 = !DILocalVariable(name: "prob", scope: !540, file: !26, line: 176, type: !54)
!540 = distinct !DILexicalBlock(scope: !513, file: !26, line: 175, column: 18)
!541 = !DILocation(line: 176, column: 16, scope: !540)
!542 = !DILocation(line: 176, column: 24, scope: !540)
!543 = !DILocation(line: 176, column: 28, scope: !540)
!544 = !DILocation(line: 176, column: 34, scope: !540)
!545 = !DILocation(line: 176, column: 38, scope: !540)
!546 = !DILocation(line: 176, column: 23, scope: !540)
!547 = !DILocalVariable(name: "bound", scope: !540, file: !26, line: 177, type: !548)
!548 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !37)
!549 = !DILocation(line: 177, column: 19, scope: !540)
!550 = !DILocation(line: 177, column: 27, scope: !540)
!551 = !DILocation(line: 177, column: 35, scope: !540)
!552 = !DILocation(line: 177, column: 39, scope: !540)
!553 = !DILocation(line: 178, column: 6, scope: !540)
!554 = !DILocation(line: 177, column: 32, scope: !540)
!555 = !DILocation(line: 179, column: 15, scope: !540)
!556 = !DILocation(line: 179, column: 4, scope: !540)
!557 = !DILocation(line: 179, column: 8, scope: !540)
!558 = !DILocation(line: 179, column: 12, scope: !540)
!559 = !DILocation(line: 180, column: 17, scope: !540)
!560 = !DILocation(line: 180, column: 4, scope: !540)
!561 = !DILocation(line: 180, column: 8, scope: !540)
!562 = !DILocation(line: 180, column: 14, scope: !540)
!563 = !DILocation(line: 181, column: 12, scope: !540)
!564 = !DILocation(line: 181, column: 17, scope: !540)
!565 = !DILocation(line: 181, column: 9, scope: !540)
!566 = !DILocation(line: 182, column: 26, scope: !540)
!567 = !DILocation(line: 182, column: 5, scope: !540)
!568 = !DILocation(line: 182, column: 9, scope: !540)
!569 = !DILocation(line: 182, column: 15, scope: !540)
!570 = !DILocation(line: 182, column: 19, scope: !540)
!571 = !DILocation(line: 182, column: 24, scope: !540)
!572 = !DILocation(line: 183, column: 4, scope: !540)
!573 = !DILocation(line: 187, column: 4, scope: !513)
!574 = !DILocation(line: 187, column: 8, scope: !513)
!575 = !DILocation(line: 187, column: 14, scope: !513)
!576 = !DILocation(line: 188, column: 4, scope: !513)
!577 = !DILocation(line: 191, column: 4, scope: !513)
!578 = !DILocation(line: 191, column: 8, scope: !513)
!579 = !DILocation(line: 191, column: 14, scope: !513)
!580 = !DILocation(line: 192, column: 15, scope: !513)
!581 = !DILocation(line: 192, column: 19, scope: !513)
!582 = !DILocation(line: 192, column: 4, scope: !513)
!583 = !DILocation(line: 192, column: 8, scope: !513)
!584 = !DILocation(line: 192, column: 12, scope: !513)
!585 = !DILocation(line: 193, column: 4, scope: !513)
!586 = !DILocation(line: 197, column: 4, scope: !513)
!587 = !DILocation(line: 197, column: 8, scope: !513)
!588 = !DILocation(line: 197, column: 14, scope: !513)
!589 = !DILocation(line: 200, column: 4, scope: !513)
!590 = !DILocation(line: 201, column: 22, scope: !591)
!591 = distinct !DILexicalBlock(scope: !592, file: !26, line: 201, column: 9)
!592 = distinct !DILexicalBlock(scope: !513, file: !26, line: 200, column: 7)
!593 = !DILocation(line: 201, column: 26, scope: !591)
!594 = !DILocation(line: 201, column: 31, scope: !591)
!595 = !DILocation(line: 201, column: 40, scope: !591)
!596 = !DILocation(line: 201, column: 9, scope: !591)
!597 = !DILocation(line: 201, column: 9, scope: !592)
!598 = !DILocation(line: 202, column: 6, scope: !591)
!599 = !DILocation(line: 203, column: 4, scope: !592)
!600 = !DILocation(line: 203, column: 15, scope: !513)
!601 = !DILocation(line: 203, column: 19, scope: !513)
!602 = !DILocation(line: 203, column: 13, scope: !513)
!603 = !DILocation(line: 203, column: 25, scope: !513)
!604 = !DILocation(line: 203, column: 29, scope: !513)
!605 = !DILocation(line: 203, column: 23, scope: !513)
!606 = distinct !{!606, !589, !607}
!607 = !DILocation(line: 203, column: 34, scope: !513)
!608 = !DILocation(line: 207, column: 13, scope: !513)
!609 = !DILocation(line: 207, column: 4, scope: !513)
!610 = !DILocation(line: 208, column: 4, scope: !513)
!611 = !DILocation(line: 212, column: 4, scope: !513)
!612 = !DILocation(line: 215, column: 5, scope: !489)
!613 = !DILocation(line: 215, column: 9, scope: !489)
!614 = !DILocation(line: 215, column: 3, scope: !489)
!615 = distinct !{!615, !481, !616}
!616 = !DILocation(line: 216, column: 2, scope: !469)
!617 = !DILocation(line: 218, column: 2, scope: !469)
!618 = !DILocation(line: 218, column: 6, scope: !469)
!619 = !DILocation(line: 218, column: 12, scope: !469)
!620 = !DILocation(line: 219, column: 2, scope: !469)
!621 = !DILocation(line: 219, column: 6, scope: !469)
!622 = !DILocation(line: 219, column: 10, scope: !469)
!623 = !DILocation(line: 221, column: 2, scope: !469)
!624 = !DILocation(line: 222, column: 1, scope: !469)
!625 = distinct !DISubprogram(name: "rc_pending", scope: !26, file: !26, line: 226, type: !626, scopeLine: 227, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !162)
!626 = !DISubroutineType(types: !627)
!627 = !{!30, !628}
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 64)
!629 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !182)
!630 = !DILocalVariable(name: "rc", arg: 1, scope: !625, file: !26, line: 226, type: !628)
!631 = !DILocation(line: 226, column: 38, scope: !625)
!632 = !DILocation(line: 228, column: 9, scope: !625)
!633 = !DILocation(line: 228, column: 13, scope: !625)
!634 = !DILocation(line: 228, column: 24, scope: !625)
!635 = !DILocation(line: 228, column: 28, scope: !625)
!636 = !DILocation(line: 228, column: 2, scope: !625)
!637 = distinct !DISubprogram(name: "encode_symbol", scope: !1, file: !1, line: 237, type: !638, scopeLine: 239, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !162)
!638 = !DISubroutineType(types: !639)
!639 = !{null, !112, !116, !37, !37, !37}
!640 = !DILocalVariable(name: "pcoder", arg: 1, scope: !637, file: !1, line: 237, type: !112)
!641 = !DILocation(line: 237, column: 27, scope: !637)
!642 = !DILocalVariable(name: "mf", arg: 2, scope: !637, file: !1, line: 237, type: !116)
!643 = !DILocation(line: 237, column: 44, scope: !637)
!644 = !DILocalVariable(name: "back", arg: 3, scope: !637, file: !1, line: 238, type: !37)
!645 = !DILocation(line: 238, column: 12, scope: !637)
!646 = !DILocalVariable(name: "len", arg: 4, scope: !637, file: !1, line: 238, type: !37)
!647 = !DILocation(line: 238, column: 27, scope: !637)
!648 = !DILocalVariable(name: "position", arg: 5, scope: !637, file: !1, line: 238, type: !37)
!649 = !DILocation(line: 238, column: 41, scope: !637)
!650 = !DILocalVariable(name: "coder", scope: !637, file: !1, line: 240, type: !177)
!651 = !DILocation(line: 240, column: 23, scope: !637)
!652 = !DILocation(line: 240, column: 31, scope: !637)
!653 = !DILocalVariable(name: "pos_state", scope: !637, file: !1, line: 241, type: !548)
!654 = !DILocation(line: 241, column: 17, scope: !637)
!655 = !DILocation(line: 241, column: 29, scope: !637)
!656 = !DILocation(line: 241, column: 40, scope: !637)
!657 = !DILocation(line: 241, column: 47, scope: !637)
!658 = !DILocation(line: 241, column: 38, scope: !637)
!659 = !DILocation(line: 243, column: 6, scope: !660)
!660 = distinct !DILexicalBlock(scope: !637, file: !1, line: 243, column: 6)
!661 = !DILocation(line: 243, column: 11, scope: !660)
!662 = !DILocation(line: 243, column: 6, scope: !637)
!663 = !DILocation(line: 246, column: 11, scope: !664)
!664 = distinct !DILexicalBlock(scope: !660, file: !1, line: 243, column: 26)
!665 = !DILocation(line: 246, column: 18, scope: !664)
!666 = !DILocation(line: 247, column: 6, scope: !664)
!667 = !DILocation(line: 247, column: 13, scope: !664)
!668 = !DILocation(line: 247, column: 22, scope: !664)
!669 = !DILocation(line: 247, column: 29, scope: !664)
!670 = !DILocation(line: 247, column: 36, scope: !664)
!671 = !DILocation(line: 246, column: 3, scope: !664)
!672 = !DILocation(line: 248, column: 11, scope: !664)
!673 = !DILocation(line: 248, column: 18, scope: !664)
!674 = !DILocation(line: 248, column: 22, scope: !664)
!675 = !DILocation(line: 248, column: 3, scope: !664)
!676 = !DILocation(line: 249, column: 2, scope: !664)
!677 = !DILocation(line: 251, column: 11, scope: !678)
!678 = distinct !DILexicalBlock(scope: !660, file: !1, line: 249, column: 9)
!679 = !DILocation(line: 251, column: 18, scope: !678)
!680 = !DILocation(line: 252, column: 5, scope: !678)
!681 = !DILocation(line: 252, column: 12, scope: !678)
!682 = !DILocation(line: 252, column: 21, scope: !678)
!683 = !DILocation(line: 252, column: 28, scope: !678)
!684 = !DILocation(line: 252, column: 35, scope: !678)
!685 = !DILocation(line: 251, column: 3, scope: !678)
!686 = !DILocation(line: 254, column: 7, scope: !687)
!687 = distinct !DILexicalBlock(scope: !678, file: !1, line: 254, column: 7)
!688 = !DILocation(line: 254, column: 12, scope: !687)
!689 = !DILocation(line: 254, column: 7, scope: !678)
!690 = !DILocation(line: 257, column: 12, scope: !691)
!691 = distinct !DILexicalBlock(scope: !687, file: !1, line: 254, column: 29)
!692 = !DILocation(line: 257, column: 19, scope: !691)
!693 = !DILocation(line: 257, column: 24, scope: !691)
!694 = !DILocation(line: 257, column: 31, scope: !691)
!695 = !DILocation(line: 257, column: 38, scope: !691)
!696 = !DILocation(line: 257, column: 45, scope: !691)
!697 = !DILocation(line: 257, column: 4, scope: !691)
!698 = !DILocation(line: 258, column: 14, scope: !691)
!699 = !DILocation(line: 258, column: 21, scope: !691)
!700 = !DILocation(line: 258, column: 32, scope: !691)
!701 = !DILocation(line: 258, column: 38, scope: !691)
!702 = !DILocation(line: 258, column: 4, scope: !691)
!703 = !DILocation(line: 259, column: 3, scope: !691)
!704 = !DILocation(line: 261, column: 12, scope: !705)
!705 = distinct !DILexicalBlock(scope: !687, file: !1, line: 259, column: 10)
!706 = !DILocation(line: 261, column: 19, scope: !705)
!707 = !DILocation(line: 261, column: 24, scope: !705)
!708 = !DILocation(line: 261, column: 31, scope: !705)
!709 = !DILocation(line: 261, column: 38, scope: !705)
!710 = !DILocation(line: 261, column: 45, scope: !705)
!711 = !DILocation(line: 261, column: 4, scope: !705)
!712 = !DILocation(line: 262, column: 10, scope: !705)
!713 = !DILocation(line: 262, column: 17, scope: !705)
!714 = !DILocation(line: 262, column: 28, scope: !705)
!715 = !DILocation(line: 262, column: 33, scope: !705)
!716 = !DILocation(line: 262, column: 50, scope: !705)
!717 = !DILocation(line: 262, column: 4, scope: !705)
!718 = !DILocation(line: 267, column: 20, scope: !637)
!719 = !DILocation(line: 267, column: 2, scope: !637)
!720 = !DILocation(line: 267, column: 6, scope: !637)
!721 = !DILocation(line: 267, column: 17, scope: !637)
!722 = !DILocation(line: 268, column: 1, scope: !637)
!723 = distinct !DISubprogram(name: "encode_eopm", scope: !1, file: !1, line: 301, type: !724, scopeLine: 302, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !162)
!724 = !DISubroutineType(types: !725)
!725 = !{null, !112, !37}
!726 = !DILocalVariable(name: "pcoder", arg: 1, scope: !723, file: !1, line: 301, type: !112)
!727 = !DILocation(line: 301, column: 25, scope: !723)
!728 = !DILocalVariable(name: "position", arg: 2, scope: !723, file: !1, line: 301, type: !37)
!729 = !DILocation(line: 301, column: 42, scope: !723)
!730 = !DILocalVariable(name: "coder", scope: !723, file: !1, line: 303, type: !177)
!731 = !DILocation(line: 303, column: 23, scope: !723)
!732 = !DILocation(line: 303, column: 31, scope: !723)
!733 = !DILocalVariable(name: "pos_state", scope: !723, file: !1, line: 304, type: !548)
!734 = !DILocation(line: 304, column: 17, scope: !723)
!735 = !DILocation(line: 304, column: 29, scope: !723)
!736 = !DILocation(line: 304, column: 40, scope: !723)
!737 = !DILocation(line: 304, column: 47, scope: !723)
!738 = !DILocation(line: 304, column: 38, scope: !723)
!739 = !DILocation(line: 305, column: 10, scope: !723)
!740 = !DILocation(line: 305, column: 17, scope: !723)
!741 = !DILocation(line: 305, column: 22, scope: !723)
!742 = !DILocation(line: 305, column: 29, scope: !723)
!743 = !DILocation(line: 305, column: 38, scope: !723)
!744 = !DILocation(line: 305, column: 45, scope: !723)
!745 = !DILocation(line: 305, column: 52, scope: !723)
!746 = !DILocation(line: 305, column: 2, scope: !723)
!747 = !DILocation(line: 306, column: 10, scope: !723)
!748 = !DILocation(line: 306, column: 17, scope: !723)
!749 = !DILocation(line: 306, column: 22, scope: !723)
!750 = !DILocation(line: 306, column: 29, scope: !723)
!751 = !DILocation(line: 306, column: 36, scope: !723)
!752 = !DILocation(line: 306, column: 43, scope: !723)
!753 = !DILocation(line: 306, column: 2, scope: !723)
!754 = !DILocation(line: 307, column: 8, scope: !723)
!755 = !DILocation(line: 307, column: 15, scope: !723)
!756 = !DILocation(line: 307, column: 2, scope: !723)
!757 = !DILocation(line: 308, column: 1, scope: !723)
!758 = distinct !DISubprogram(name: "rc_flush", scope: !26, file: !26, line: 116, type: !759, scopeLine: 117, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !162)
!759 = !DISubroutineType(types: !760)
!760 = !{null, !472}
!761 = !DILocalVariable(name: "rc", arg: 1, scope: !758, file: !26, line: 116, type: !472)
!762 = !DILocation(line: 116, column: 30, scope: !758)
!763 = !DILocalVariable(name: "i", scope: !764, file: !26, line: 118, type: !44)
!764 = distinct !DILexicalBlock(scope: !758, file: !26, line: 118, column: 2)
!765 = !DILocation(line: 118, column: 14, scope: !764)
!766 = !DILocation(line: 118, column: 7, scope: !764)
!767 = !DILocation(line: 118, column: 21, scope: !768)
!768 = distinct !DILexicalBlock(scope: !764, file: !26, line: 118, column: 2)
!769 = !DILocation(line: 118, column: 23, scope: !768)
!770 = !DILocation(line: 118, column: 2, scope: !764)
!771 = !DILocation(line: 119, column: 3, scope: !768)
!772 = !DILocation(line: 119, column: 7, scope: !768)
!773 = !DILocation(line: 119, column: 15, scope: !768)
!774 = !DILocation(line: 119, column: 19, scope: !768)
!775 = !DILocation(line: 119, column: 24, scope: !768)
!776 = !DILocation(line: 119, column: 28, scope: !768)
!777 = !DILocation(line: 118, column: 28, scope: !768)
!778 = !DILocation(line: 118, column: 2, scope: !768)
!779 = distinct !{!779, !770, !780}
!780 = !DILocation(line: 119, column: 30, scope: !764)
!781 = !DILocation(line: 120, column: 1, scope: !758)
!782 = distinct !DISubprogram(name: "lzma_lzma_encoder_reset", scope: !1, file: !1, line: 484, type: !783, scopeLine: 485, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !162)
!783 = !DISubroutineType(types: !784)
!784 = !{!111, !112, !785}
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 64)
!786 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !787)
!787 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_options_lzma", file: !81, line: 399, baseType: !788)
!788 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !81, line: 185, size: 896, elements: !789)
!789 = !{!790, !791, !794, !795, !796, !797, !798, !800, !801, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !814, !815, !816, !817, !818}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "dict_size", scope: !788, file: !81, line: 217, baseType: !37, size: 32)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "preset_dict", scope: !788, file: !81, line: 240, baseType: !792, size: 64, offset: 64)
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !793, size: 64)
!793 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !40)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "preset_dict_size", scope: !788, file: !81, line: 254, baseType: !37, size: 32, offset: 128)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "lc", scope: !788, file: !81, line: 281, baseType: !37, size: 32, offset: 160)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "lp", scope: !788, file: !81, line: 293, baseType: !37, size: 32, offset: 192)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !788, file: !81, line: 316, baseType: !37, size: 32, offset: 224)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !788, file: !81, line: 322, baseType: !799, size: 32, offset: 256)
!799 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_mode", file: !81, line: 155, baseType: !80)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "nice_len", scope: !788, file: !81, line: 342, baseType: !37, size: 32, offset: 288)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "mf", scope: !788, file: !81, line: 345, baseType: !802, size: 32, offset: 320)
!802 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_match_finder", file: !81, line: 111, baseType: !85)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !788, file: !81, line: 375, baseType: !37, size: 32, offset: 352)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int1", scope: !788, file: !81, line: 384, baseType: !37, size: 32, offset: 384)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int2", scope: !788, file: !81, line: 385, baseType: !37, size: 32, offset: 416)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int3", scope: !788, file: !81, line: 386, baseType: !37, size: 32, offset: 448)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int4", scope: !788, file: !81, line: 387, baseType: !37, size: 32, offset: 480)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int5", scope: !788, file: !81, line: 388, baseType: !37, size: 32, offset: 512)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int6", scope: !788, file: !81, line: 389, baseType: !37, size: 32, offset: 544)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int7", scope: !788, file: !81, line: 390, baseType: !37, size: 32, offset: 576)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int8", scope: !788, file: !81, line: 391, baseType: !37, size: 32, offset: 608)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum1", scope: !788, file: !81, line: 392, baseType: !813, size: 32, offset: 640)
!813 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_reserved_enum", file: !4, line: 46, baseType: !92)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum2", scope: !788, file: !81, line: 393, baseType: !813, size: 32, offset: 672)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum3", scope: !788, file: !81, line: 394, baseType: !813, size: 32, offset: 704)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum4", scope: !788, file: !81, line: 395, baseType: !813, size: 32, offset: 736)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr1", scope: !788, file: !81, line: 396, baseType: !103, size: 64, offset: 768)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr2", scope: !788, file: !81, line: 397, baseType: !103, size: 64, offset: 832)
!819 = !DILocalVariable(name: "pcoder", arg: 1, scope: !782, file: !1, line: 484, type: !112)
!820 = !DILocation(line: 484, column: 37, scope: !782)
!821 = !DILocalVariable(name: "options", arg: 2, scope: !782, file: !1, line: 484, type: !785)
!822 = !DILocation(line: 484, column: 70, scope: !782)
!823 = !DILocalVariable(name: "coder", scope: !782, file: !1, line: 486, type: !177)
!824 = !DILocation(line: 486, column: 23, scope: !782)
!825 = !DILocation(line: 486, column: 31, scope: !782)
!826 = !DILocation(line: 487, column: 24, scope: !827)
!827 = distinct !DILexicalBlock(scope: !782, file: !1, line: 487, column: 6)
!828 = !DILocation(line: 487, column: 7, scope: !827)
!829 = !DILocation(line: 487, column: 6, scope: !782)
!830 = !DILocation(line: 488, column: 3, scope: !827)
!831 = !DILocation(line: 490, column: 27, scope: !782)
!832 = !DILocation(line: 490, column: 36, scope: !782)
!833 = !DILocation(line: 490, column: 24, scope: !782)
!834 = !DILocation(line: 490, column: 40, scope: !782)
!835 = !DILocation(line: 490, column: 2, scope: !782)
!836 = !DILocation(line: 490, column: 9, scope: !782)
!837 = !DILocation(line: 490, column: 18, scope: !782)
!838 = !DILocation(line: 491, column: 32, scope: !782)
!839 = !DILocation(line: 491, column: 41, scope: !782)
!840 = !DILocation(line: 491, column: 2, scope: !782)
!841 = !DILocation(line: 491, column: 9, scope: !782)
!842 = !DILocation(line: 491, column: 30, scope: !782)
!843 = !DILocation(line: 492, column: 35, scope: !782)
!844 = !DILocation(line: 492, column: 44, scope: !782)
!845 = !DILocation(line: 492, column: 32, scope: !782)
!846 = !DILocation(line: 492, column: 48, scope: !782)
!847 = !DILocation(line: 492, column: 2, scope: !782)
!848 = !DILocation(line: 492, column: 9, scope: !782)
!849 = !DILocation(line: 492, column: 26, scope: !782)
!850 = !DILocation(line: 495, column: 12, scope: !782)
!851 = !DILocation(line: 495, column: 19, scope: !782)
!852 = !DILocation(line: 495, column: 2, scope: !782)
!853 = !DILocation(line: 498, column: 2, scope: !782)
!854 = !DILocation(line: 498, column: 9, scope: !782)
!855 = !DILocation(line: 498, column: 15, scope: !782)
!856 = !DILocalVariable(name: "i", scope: !857, file: !1, line: 499, type: !44)
!857 = distinct !DILexicalBlock(scope: !782, file: !1, line: 499, column: 2)
!858 = !DILocation(line: 499, column: 14, scope: !857)
!859 = !DILocation(line: 499, column: 7, scope: !857)
!860 = !DILocation(line: 499, column: 21, scope: !861)
!861 = distinct !DILexicalBlock(scope: !857, file: !1, line: 499, column: 2)
!862 = !DILocation(line: 499, column: 23, scope: !861)
!863 = !DILocation(line: 499, column: 2, scope: !857)
!864 = !DILocation(line: 500, column: 3, scope: !861)
!865 = !DILocation(line: 500, column: 10, scope: !861)
!866 = !DILocation(line: 500, column: 15, scope: !861)
!867 = !DILocation(line: 500, column: 18, scope: !861)
!868 = !DILocation(line: 499, column: 40, scope: !861)
!869 = !DILocation(line: 499, column: 2, scope: !861)
!870 = distinct !{!870, !863, !871}
!871 = !DILocation(line: 500, column: 20, scope: !857)
!872 = !DILocation(line: 502, column: 15, scope: !782)
!873 = !DILocation(line: 502, column: 22, scope: !782)
!874 = !DILocation(line: 502, column: 31, scope: !782)
!875 = !DILocation(line: 502, column: 40, scope: !782)
!876 = !DILocation(line: 502, column: 44, scope: !782)
!877 = !DILocation(line: 502, column: 53, scope: !782)
!878 = !DILocation(line: 502, column: 2, scope: !782)
!879 = !DILocalVariable(name: "i", scope: !880, file: !1, line: 505, type: !44)
!880 = distinct !DILexicalBlock(scope: !782, file: !1, line: 505, column: 2)
!881 = !DILocation(line: 505, column: 14, scope: !880)
!882 = !DILocation(line: 505, column: 7, scope: !880)
!883 = !DILocation(line: 505, column: 21, scope: !884)
!884 = distinct !DILexicalBlock(scope: !880, file: !1, line: 505, column: 2)
!885 = !DILocation(line: 505, column: 23, scope: !884)
!886 = !DILocation(line: 505, column: 2, scope: !880)
!887 = !DILocalVariable(name: "j", scope: !888, file: !1, line: 506, type: !44)
!888 = distinct !DILexicalBlock(scope: !889, file: !1, line: 506, column: 3)
!889 = distinct !DILexicalBlock(scope: !884, file: !1, line: 505, column: 38)
!890 = !DILocation(line: 506, column: 15, scope: !888)
!891 = !DILocation(line: 506, column: 8, scope: !888)
!892 = !DILocation(line: 506, column: 22, scope: !893)
!893 = distinct !DILexicalBlock(scope: !888, file: !1, line: 506, column: 3)
!894 = !DILocation(line: 506, column: 27, scope: !893)
!895 = !DILocation(line: 506, column: 34, scope: !893)
!896 = !DILocation(line: 506, column: 24, scope: !893)
!897 = !DILocation(line: 506, column: 3, scope: !888)
!898 = !DILocation(line: 507, column: 4, scope: !899)
!899 = distinct !DILexicalBlock(scope: !893, file: !1, line: 506, column: 49)
!900 = !DILocation(line: 508, column: 4, scope: !899)
!901 = !DILocation(line: 509, column: 3, scope: !899)
!902 = !DILocation(line: 506, column: 44, scope: !893)
!903 = !DILocation(line: 506, column: 3, scope: !893)
!904 = distinct !{!904, !897, !905}
!905 = !DILocation(line: 509, column: 3, scope: !888)
!906 = !DILocation(line: 511, column: 3, scope: !889)
!907 = !DILocation(line: 512, column: 3, scope: !889)
!908 = !DILocation(line: 513, column: 3, scope: !889)
!909 = !DILocation(line: 514, column: 3, scope: !889)
!910 = !DILocation(line: 515, column: 2, scope: !889)
!911 = !DILocation(line: 505, column: 33, scope: !884)
!912 = !DILocation(line: 505, column: 2, scope: !884)
!913 = distinct !{!913, !886, !914}
!914 = !DILocation(line: 515, column: 2, scope: !880)
!915 = !DILocalVariable(name: "i", scope: !916, file: !1, line: 517, type: !44)
!916 = distinct !DILexicalBlock(scope: !782, file: !1, line: 517, column: 2)
!917 = !DILocation(line: 517, column: 14, scope: !916)
!918 = !DILocation(line: 517, column: 7, scope: !916)
!919 = !DILocation(line: 517, column: 21, scope: !920)
!920 = distinct !DILexicalBlock(scope: !916, file: !1, line: 517, column: 2)
!921 = !DILocation(line: 517, column: 23, scope: !920)
!922 = !DILocation(line: 517, column: 2, scope: !916)
!923 = !DILocation(line: 518, column: 3, scope: !920)
!924 = !DILocation(line: 517, column: 63, scope: !920)
!925 = !DILocation(line: 517, column: 2, scope: !920)
!926 = distinct !{!926, !922, !927}
!927 = !DILocation(line: 518, column: 3, scope: !916)
!928 = !DILocalVariable(name: "i", scope: !929, file: !1, line: 521, type: !44)
!929 = distinct !DILexicalBlock(scope: !782, file: !1, line: 521, column: 2)
!930 = !DILocation(line: 521, column: 14, scope: !929)
!931 = !DILocation(line: 521, column: 7, scope: !929)
!932 = !DILocation(line: 521, column: 21, scope: !933)
!933 = distinct !DILexicalBlock(scope: !929, file: !1, line: 521, column: 2)
!934 = !DILocation(line: 521, column: 23, scope: !933)
!935 = !DILocation(line: 521, column: 2, scope: !929)
!936 = !DILocalVariable(name: "bt_i", scope: !937, file: !1, line: 522, type: !37)
!937 = distinct !DILexicalBlock(scope: !933, file: !1, line: 522, column: 3)
!938 = !DILocation(line: 522, column: 3, scope: !937)
!939 = !DILocation(line: 522, column: 3, scope: !940)
!940 = distinct !DILexicalBlock(scope: !937, file: !1, line: 522, column: 3)
!941 = distinct !{!941, !938, !938}
!942 = !DILocation(line: 521, column: 44, scope: !933)
!943 = !DILocation(line: 521, column: 2, scope: !933)
!944 = distinct !{!944, !935, !945}
!945 = !DILocation(line: 522, column: 3, scope: !929)
!946 = !DILocalVariable(name: "bt_i", scope: !947, file: !1, line: 524, type: !37)
!947 = distinct !DILexicalBlock(scope: !782, file: !1, line: 524, column: 2)
!948 = !DILocation(line: 524, column: 2, scope: !947)
!949 = !DILocation(line: 524, column: 2, scope: !950)
!950 = distinct !DILexicalBlock(scope: !947, file: !1, line: 524, column: 2)
!951 = distinct !{!951, !948, !948}
!952 = !DILocation(line: 527, column: 24, scope: !782)
!953 = !DILocation(line: 527, column: 31, scope: !782)
!954 = !DILocation(line: 528, column: 10, scope: !782)
!955 = !DILocation(line: 528, column: 19, scope: !782)
!956 = !DILocation(line: 528, column: 7, scope: !782)
!957 = !DILocation(line: 528, column: 23, scope: !782)
!958 = !DILocation(line: 528, column: 30, scope: !782)
!959 = !DILocation(line: 527, column: 2, scope: !782)
!960 = !DILocation(line: 530, column: 24, scope: !782)
!961 = !DILocation(line: 530, column: 31, scope: !782)
!962 = !DILocation(line: 531, column: 10, scope: !782)
!963 = !DILocation(line: 531, column: 19, scope: !782)
!964 = !DILocation(line: 531, column: 7, scope: !782)
!965 = !DILocation(line: 531, column: 23, scope: !782)
!966 = !DILocation(line: 531, column: 30, scope: !782)
!967 = !DILocation(line: 530, column: 2, scope: !782)
!968 = !DILocation(line: 546, column: 2, scope: !782)
!969 = !DILocation(line: 546, column: 9, scope: !782)
!970 = !DILocation(line: 546, column: 27, scope: !782)
!971 = !DILocation(line: 547, column: 2, scope: !782)
!972 = !DILocation(line: 547, column: 9, scope: !782)
!973 = !DILocation(line: 547, column: 27, scope: !782)
!974 = !DILocation(line: 549, column: 2, scope: !782)
!975 = !DILocation(line: 549, column: 9, scope: !782)
!976 = !DILocation(line: 549, column: 24, scope: !782)
!977 = !DILocation(line: 550, column: 2, scope: !782)
!978 = !DILocation(line: 550, column: 9, scope: !782)
!979 = !DILocation(line: 550, column: 28, scope: !782)
!980 = !DILocation(line: 552, column: 2, scope: !782)
!981 = !DILocation(line: 553, column: 1, scope: !782)
!982 = distinct !DISubprogram(name: "is_options_valid", scope: !1, file: !1, line: 430, type: !983, scopeLine: 431, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !162)
!983 = !DISubroutineType(types: !984)
!984 = !{!196, !785}
!985 = !DILocalVariable(name: "options", arg: 1, scope: !982, file: !1, line: 430, type: !785)
!986 = !DILocation(line: 430, column: 43, scope: !982)
!987 = !DILocation(line: 434, column: 25, scope: !982)
!988 = !DILocation(line: 434, column: 9, scope: !982)
!989 = !DILocation(line: 435, column: 4, scope: !982)
!990 = !DILocation(line: 435, column: 7, scope: !982)
!991 = !DILocation(line: 435, column: 16, scope: !982)
!992 = !DILocation(line: 435, column: 25, scope: !982)
!993 = !DILocation(line: 436, column: 4, scope: !982)
!994 = !DILocation(line: 436, column: 7, scope: !982)
!995 = !DILocation(line: 436, column: 16, scope: !982)
!996 = !DILocation(line: 436, column: 25, scope: !982)
!997 = !DILocation(line: 437, column: 4, scope: !982)
!998 = !DILocation(line: 437, column: 8, scope: !982)
!999 = !DILocation(line: 437, column: 17, scope: !982)
!1000 = !DILocation(line: 437, column: 22, scope: !982)
!1001 = !DILocation(line: 438, column: 5, scope: !982)
!1002 = !DILocation(line: 438, column: 8, scope: !982)
!1003 = !DILocation(line: 438, column: 17, scope: !982)
!1004 = !DILocation(line: 438, column: 22, scope: !982)
!1005 = !DILocation(line: 0, scope: !982)
!1006 = !DILocation(line: 434, column: 2, scope: !982)
!1007 = distinct !DISubprogram(name: "rc_reset", scope: !26, file: !26, line: 55, type: !759, scopeLine: 56, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !162)
!1008 = !DILocalVariable(name: "rc", arg: 1, scope: !1007, file: !26, line: 55, type: !472)
!1009 = !DILocation(line: 55, column: 30, scope: !1007)
!1010 = !DILocation(line: 57, column: 2, scope: !1007)
!1011 = !DILocation(line: 57, column: 6, scope: !1007)
!1012 = !DILocation(line: 57, column: 10, scope: !1007)
!1013 = !DILocation(line: 58, column: 2, scope: !1007)
!1014 = !DILocation(line: 58, column: 6, scope: !1007)
!1015 = !DILocation(line: 58, column: 17, scope: !1007)
!1016 = !DILocation(line: 59, column: 2, scope: !1007)
!1017 = !DILocation(line: 59, column: 6, scope: !1007)
!1018 = !DILocation(line: 59, column: 12, scope: !1007)
!1019 = !DILocation(line: 60, column: 2, scope: !1007)
!1020 = !DILocation(line: 60, column: 6, scope: !1007)
!1021 = !DILocation(line: 60, column: 12, scope: !1007)
!1022 = !DILocation(line: 61, column: 2, scope: !1007)
!1023 = !DILocation(line: 61, column: 6, scope: !1007)
!1024 = !DILocation(line: 61, column: 12, scope: !1007)
!1025 = !DILocation(line: 62, column: 2, scope: !1007)
!1026 = !DILocation(line: 62, column: 6, scope: !1007)
!1027 = !DILocation(line: 62, column: 10, scope: !1007)
!1028 = !DILocation(line: 63, column: 1, scope: !1007)
!1029 = distinct !DISubprogram(name: "literal_init", scope: !66, file: !66, line: 129, type: !1030, scopeLine: 131, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !162)
!1030 = !DISubroutineType(types: !1031)
!1031 = !{null, !1032, !37, !37}
!1032 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1033, size: 64)
!1033 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 12288, elements: !1034)
!1034 = !{!206}
!1035 = !DILocalVariable(name: "probs", arg: 1, scope: !1029, file: !66, line: 129, type: !1032)
!1036 = !DILocation(line: 129, column: 28, scope: !1029)
!1037 = !DILocalVariable(name: "lc", arg: 2, scope: !1029, file: !66, line: 130, type: !37)
!1038 = !DILocation(line: 130, column: 12, scope: !1029)
!1039 = !DILocalVariable(name: "lp", arg: 3, scope: !1029, file: !66, line: 130, type: !37)
!1040 = !DILocation(line: 130, column: 25, scope: !1029)
!1041 = !DILocalVariable(name: "coders", scope: !1029, file: !66, line: 134, type: !548)
!1042 = !DILocation(line: 134, column: 17, scope: !1029)
!1043 = !DILocation(line: 134, column: 33, scope: !1029)
!1044 = !DILocation(line: 134, column: 38, scope: !1029)
!1045 = !DILocation(line: 134, column: 36, scope: !1029)
!1046 = !DILocation(line: 134, column: 29, scope: !1029)
!1047 = !DILocalVariable(name: "i", scope: !1048, file: !66, line: 136, type: !37)
!1048 = distinct !DILexicalBlock(scope: !1029, file: !66, line: 136, column: 2)
!1049 = !DILocation(line: 136, column: 16, scope: !1048)
!1050 = !DILocation(line: 136, column: 7, scope: !1048)
!1051 = !DILocation(line: 136, column: 23, scope: !1052)
!1052 = distinct !DILexicalBlock(scope: !1048, file: !66, line: 136, column: 2)
!1053 = !DILocation(line: 136, column: 27, scope: !1052)
!1054 = !DILocation(line: 136, column: 25, scope: !1052)
!1055 = !DILocation(line: 136, column: 2, scope: !1048)
!1056 = !DILocalVariable(name: "j", scope: !1057, file: !66, line: 137, type: !37)
!1057 = distinct !DILexicalBlock(scope: !1052, file: !66, line: 137, column: 3)
!1058 = !DILocation(line: 137, column: 17, scope: !1057)
!1059 = !DILocation(line: 137, column: 8, scope: !1057)
!1060 = !DILocation(line: 137, column: 24, scope: !1061)
!1061 = distinct !DILexicalBlock(scope: !1057, file: !66, line: 137, column: 3)
!1062 = !DILocation(line: 137, column: 26, scope: !1061)
!1063 = !DILocation(line: 137, column: 3, scope: !1057)
!1064 = !DILocation(line: 138, column: 4, scope: !1061)
!1065 = !DILocation(line: 137, column: 48, scope: !1061)
!1066 = !DILocation(line: 137, column: 3, scope: !1061)
!1067 = distinct !{!1067, !1063, !1068}
!1068 = !DILocation(line: 138, column: 4, scope: !1057)
!1069 = !DILocation(line: 136, column: 35, scope: !1052)
!1070 = !DILocation(line: 136, column: 2, scope: !1052)
!1071 = distinct !{!1071, !1055, !1072}
!1072 = !DILocation(line: 138, column: 4, scope: !1048)
!1073 = !DILocation(line: 140, column: 2, scope: !1029)
!1074 = distinct !DISubprogram(name: "length_encoder_reset", scope: !1, file: !1, line: 461, type: !1075, scopeLine: 463, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !162)
!1075 = !DISubroutineType(types: !1076)
!1076 = !{null, !1077, !548, !1078}
!1077 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!1078 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !196)
!1079 = !DILocalVariable(name: "lencoder", arg: 1, scope: !1074, file: !1, line: 461, type: !1077)
!1080 = !DILocation(line: 461, column: 43, scope: !1074)
!1081 = !DILocalVariable(name: "num_pos_states", arg: 2, scope: !1074, file: !1, line: 462, type: !548)
!1082 = !DILocation(line: 462, column: 18, scope: !1074)
!1083 = !DILocalVariable(name: "fast_mode", arg: 3, scope: !1074, file: !1, line: 462, type: !1078)
!1084 = !DILocation(line: 462, column: 45, scope: !1074)
!1085 = !DILocation(line: 464, column: 2, scope: !1074)
!1086 = !DILocation(line: 465, column: 2, scope: !1074)
!1087 = !DILocalVariable(name: "pos_state", scope: !1088, file: !1, line: 467, type: !44)
!1088 = distinct !DILexicalBlock(scope: !1074, file: !1, line: 467, column: 2)
!1089 = !DILocation(line: 467, column: 14, scope: !1088)
!1090 = !DILocation(line: 467, column: 7, scope: !1088)
!1091 = !DILocation(line: 467, column: 29, scope: !1092)
!1092 = distinct !DILexicalBlock(scope: !1088, file: !1, line: 467, column: 2)
!1093 = !DILocation(line: 467, column: 41, scope: !1092)
!1094 = !DILocation(line: 467, column: 39, scope: !1092)
!1095 = !DILocation(line: 467, column: 2, scope: !1088)
!1096 = !DILocalVariable(name: "bt_i", scope: !1097, file: !1, line: 468, type: !37)
!1097 = distinct !DILexicalBlock(scope: !1098, file: !1, line: 468, column: 3)
!1098 = distinct !DILexicalBlock(scope: !1092, file: !1, line: 467, column: 70)
!1099 = !DILocation(line: 468, column: 3, scope: !1097)
!1100 = !DILocation(line: 468, column: 3, scope: !1101)
!1101 = distinct !DILexicalBlock(scope: !1097, file: !1, line: 468, column: 3)
!1102 = distinct !{!1102, !1099, !1099}
!1103 = !DILocalVariable(name: "bt_i", scope: !1104, file: !1, line: 469, type: !37)
!1104 = distinct !DILexicalBlock(scope: !1098, file: !1, line: 469, column: 3)
!1105 = !DILocation(line: 469, column: 3, scope: !1104)
!1106 = !DILocation(line: 469, column: 3, scope: !1107)
!1107 = distinct !DILexicalBlock(scope: !1104, file: !1, line: 469, column: 3)
!1108 = distinct !{!1108, !1105, !1105}
!1109 = !DILocation(line: 470, column: 2, scope: !1098)
!1110 = !DILocation(line: 467, column: 57, scope: !1092)
!1111 = !DILocation(line: 467, column: 2, scope: !1092)
!1112 = distinct !{!1112, !1095, !1113}
!1113 = !DILocation(line: 470, column: 2, scope: !1088)
!1114 = !DILocalVariable(name: "bt_i", scope: !1115, file: !1, line: 472, type: !37)
!1115 = distinct !DILexicalBlock(scope: !1074, file: !1, line: 472, column: 2)
!1116 = !DILocation(line: 472, column: 2, scope: !1115)
!1117 = !DILocation(line: 472, column: 2, scope: !1118)
!1118 = distinct !DILexicalBlock(scope: !1115, file: !1, line: 472, column: 2)
!1119 = distinct !{!1119, !1116, !1116}
!1120 = !DILocation(line: 474, column: 7, scope: !1121)
!1121 = distinct !DILexicalBlock(scope: !1074, file: !1, line: 474, column: 6)
!1122 = !DILocation(line: 474, column: 6, scope: !1074)
!1123 = !DILocalVariable(name: "pos_state", scope: !1124, file: !1, line: 475, type: !44)
!1124 = distinct !DILexicalBlock(scope: !1121, file: !1, line: 475, column: 3)
!1125 = !DILocation(line: 475, column: 15, scope: !1124)
!1126 = !DILocation(line: 475, column: 8, scope: !1124)
!1127 = !DILocation(line: 475, column: 30, scope: !1128)
!1128 = distinct !DILexicalBlock(scope: !1124, file: !1, line: 475, column: 3)
!1129 = !DILocation(line: 475, column: 42, scope: !1128)
!1130 = !DILocation(line: 475, column: 40, scope: !1128)
!1131 = !DILocation(line: 475, column: 3, scope: !1124)
!1132 = !DILocation(line: 477, column: 25, scope: !1128)
!1133 = !DILocation(line: 477, column: 35, scope: !1128)
!1134 = !DILocation(line: 477, column: 4, scope: !1128)
!1135 = !DILocation(line: 476, column: 5, scope: !1128)
!1136 = !DILocation(line: 475, column: 3, scope: !1128)
!1137 = distinct !{!1137, !1131, !1138}
!1138 = !DILocation(line: 477, column: 44, scope: !1124)
!1139 = !DILocation(line: 479, column: 2, scope: !1074)
!1140 = distinct !DISubprogram(name: "lzma_lzma_encoder_create", scope: !1, file: !1, line: 557, type: !1141, scopeLine: 559, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !162)
!1141 = !DISubroutineType(types: !1142)
!1142 = !{!111, !1143, !1144, !785, !1157}
!1143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!1144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1145, size: 64)
!1145 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_allocator", file: !4, line: 403, baseType: !1146)
!1146 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 341, size: 192, elements: !1147)
!1147 = !{!1148, !1152, !1156}
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1146, file: !4, line: 376, baseType: !1149, size: 64)
!1149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1150, size: 64)
!1150 = !DISubroutineType(types: !1151)
!1151 = !{!103, !103, !44, !44}
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !1146, file: !4, line: 390, baseType: !1153, size: 64, offset: 64)
!1153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1154, size: 64)
!1154 = !DISubroutineType(types: !1155)
!1155 = !{null, !103, !103}
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1146, file: !4, line: 401, baseType: !103, size: 64, offset: 128)
!1157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1158, size: 64)
!1158 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_lz_options", file: !118, line: 161, baseType: !1159)
!1159 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !118, line: 129, size: 512, elements: !1160)
!1160 = !{!1161, !1162, !1163, !1164, !1165, !1166, !1167, !1168, !1169}
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "before_size", scope: !1159, file: !118, line: 132, baseType: !44, size: 64)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "dict_size", scope: !1159, file: !118, line: 135, baseType: !44, size: 64, offset: 64)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "after_size", scope: !1159, file: !118, line: 139, baseType: !44, size: 64, offset: 128)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "match_len_max", scope: !1159, file: !118, line: 144, baseType: !44, size: 64, offset: 192)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "nice_len", scope: !1159, file: !118, line: 148, baseType: !44, size: 64, offset: 256)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "match_finder", scope: !1159, file: !118, line: 151, baseType: !802, size: 32, offset: 320)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !1159, file: !118, line: 154, baseType: !37, size: 32, offset: 352)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "preset_dict", scope: !1159, file: !118, line: 157, baseType: !792, size: 64, offset: 384)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "preset_dict_size", scope: !1159, file: !118, line: 159, baseType: !37, size: 32, offset: 448)
!1170 = !DILocalVariable(name: "coder_ptr", arg: 1, scope: !1140, file: !1, line: 557, type: !1143)
!1171 = !DILocation(line: 557, column: 39, scope: !1140)
!1172 = !DILocalVariable(name: "allocator", arg: 2, scope: !1140, file: !1, line: 557, type: !1144)
!1173 = !DILocation(line: 557, column: 66, scope: !1140)
!1174 = !DILocalVariable(name: "options", arg: 3, scope: !1140, file: !1, line: 558, type: !785)
!1175 = !DILocation(line: 558, column: 28, scope: !1140)
!1176 = !DILocalVariable(name: "lz_options", arg: 4, scope: !1140, file: !1, line: 558, type: !1157)
!1177 = !DILocation(line: 558, column: 54, scope: !1140)
!1178 = !DILocation(line: 561, column: 7, scope: !1179)
!1179 = distinct !DILexicalBlock(scope: !1140, file: !1, line: 561, column: 6)
!1180 = !DILocation(line: 561, column: 6, scope: !1179)
!1181 = !DILocation(line: 561, column: 17, scope: !1179)
!1182 = !DILocation(line: 561, column: 6, scope: !1140)
!1183 = !DILocation(line: 562, column: 56, scope: !1184)
!1184 = distinct !DILexicalBlock(scope: !1179, file: !1, line: 561, column: 26)
!1185 = !DILocation(line: 562, column: 16, scope: !1184)
!1186 = !DILocation(line: 562, column: 4, scope: !1184)
!1187 = !DILocation(line: 562, column: 14, scope: !1184)
!1188 = !DILocation(line: 563, column: 8, scope: !1189)
!1189 = distinct !DILexicalBlock(scope: !1184, file: !1, line: 563, column: 7)
!1190 = !DILocation(line: 563, column: 7, scope: !1189)
!1191 = !DILocation(line: 563, column: 18, scope: !1189)
!1192 = !DILocation(line: 563, column: 7, scope: !1184)
!1193 = !DILocation(line: 564, column: 4, scope: !1189)
!1194 = !DILocation(line: 565, column: 2, scope: !1184)
!1195 = !DILocalVariable(name: "coder", scope: !1140, file: !1, line: 567, type: !177)
!1196 = !DILocation(line: 567, column: 23, scope: !1140)
!1197 = !DILocation(line: 567, column: 32, scope: !1140)
!1198 = !DILocation(line: 567, column: 31, scope: !1140)
!1199 = !DILocation(line: 573, column: 10, scope: !1140)
!1200 = !DILocation(line: 573, column: 19, scope: !1140)
!1201 = !DILocation(line: 573, column: 2, scope: !1140)
!1202 = !DILocation(line: 575, column: 4, scope: !1203)
!1203 = distinct !DILexicalBlock(scope: !1140, file: !1, line: 573, column: 25)
!1204 = !DILocation(line: 575, column: 11, scope: !1203)
!1205 = !DILocation(line: 575, column: 21, scope: !1203)
!1206 = !DILocation(line: 576, column: 4, scope: !1203)
!1207 = !DILocation(line: 579, column: 4, scope: !1208)
!1208 = distinct !DILexicalBlock(scope: !1203, file: !1, line: 578, column: 26)
!1209 = !DILocation(line: 579, column: 11, scope: !1208)
!1210 = !DILocation(line: 579, column: 21, scope: !1208)
!1211 = !DILocalVariable(name: "log_size", scope: !1208, file: !1, line: 583, type: !37)
!1212 = !DILocation(line: 583, column: 13, scope: !1208)
!1213 = !DILocation(line: 584, column: 4, scope: !1208)
!1214 = !DILocation(line: 584, column: 27, scope: !1208)
!1215 = !DILocation(line: 584, column: 24, scope: !1208)
!1216 = !DILocation(line: 584, column: 39, scope: !1208)
!1217 = !DILocation(line: 584, column: 48, scope: !1208)
!1218 = !DILocation(line: 584, column: 37, scope: !1208)
!1219 = !DILocation(line: 585, column: 5, scope: !1208)
!1220 = distinct !{!1220, !1213, !1221}
!1221 = !DILocation(line: 585, column: 7, scope: !1208)
!1222 = !DILocation(line: 587, column: 29, scope: !1208)
!1223 = !DILocation(line: 587, column: 38, scope: !1208)
!1224 = !DILocation(line: 587, column: 4, scope: !1208)
!1225 = !DILocation(line: 587, column: 11, scope: !1208)
!1226 = !DILocation(line: 587, column: 27, scope: !1208)
!1227 = !DILocation(line: 591, column: 7, scope: !1208)
!1228 = !DILocation(line: 591, column: 16, scope: !1208)
!1229 = !DILocation(line: 591, column: 25, scope: !1208)
!1230 = !DILocation(line: 591, column: 29, scope: !1208)
!1231 = !DILocation(line: 590, column: 4, scope: !1208)
!1232 = !DILocation(line: 590, column: 11, scope: !1208)
!1233 = !DILocation(line: 590, column: 29, scope: !1208)
!1234 = !DILocation(line: 591, column: 5, scope: !1208)
!1235 = !DILocation(line: 593, column: 7, scope: !1208)
!1236 = !DILocation(line: 593, column: 16, scope: !1208)
!1237 = !DILocation(line: 593, column: 25, scope: !1208)
!1238 = !DILocation(line: 593, column: 29, scope: !1208)
!1239 = !DILocation(line: 592, column: 4, scope: !1208)
!1240 = !DILocation(line: 592, column: 11, scope: !1208)
!1241 = !DILocation(line: 592, column: 27, scope: !1208)
!1242 = !DILocation(line: 593, column: 5, scope: !1208)
!1243 = !DILocation(line: 594, column: 4, scope: !1208)
!1244 = !DILocation(line: 598, column: 4, scope: !1203)
!1245 = !DILocation(line: 605, column: 26, scope: !1140)
!1246 = !DILocation(line: 605, column: 35, scope: !1140)
!1247 = !DILocation(line: 605, column: 47, scope: !1140)
!1248 = !DILocation(line: 606, column: 4, scope: !1140)
!1249 = !DILocation(line: 606, column: 7, scope: !1140)
!1250 = !DILocation(line: 606, column: 16, scope: !1140)
!1251 = !DILocation(line: 606, column: 33, scope: !1140)
!1252 = !DILocation(line: 0, scope: !1140)
!1253 = !DILocation(line: 605, column: 2, scope: !1140)
!1254 = !DILocation(line: 605, column: 9, scope: !1140)
!1255 = !DILocation(line: 605, column: 24, scope: !1140)
!1256 = !DILocation(line: 607, column: 2, scope: !1140)
!1257 = !DILocation(line: 607, column: 9, scope: !1140)
!1258 = !DILocation(line: 607, column: 20, scope: !1140)
!1259 = !DILocation(line: 609, column: 17, scope: !1140)
!1260 = !DILocation(line: 609, column: 29, scope: !1140)
!1261 = !DILocation(line: 609, column: 2, scope: !1140)
!1262 = !DILocation(line: 611, column: 33, scope: !1140)
!1263 = !DILocation(line: 611, column: 40, scope: !1140)
!1264 = !DILocation(line: 611, column: 9, scope: !1140)
!1265 = !DILocation(line: 611, column: 2, scope: !1140)
!1266 = !DILocation(line: 612, column: 1, scope: !1140)
!1267 = distinct !DISubprogram(name: "set_lz_options", scope: !1, file: !1, line: 443, type: !1268, scopeLine: 444, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !162)
!1268 = !DISubroutineType(types: !1269)
!1269 = !{null, !1157, !785}
!1270 = !DILocalVariable(name: "lz_options", arg: 1, scope: !1267, file: !1, line: 443, type: !1157)
!1271 = !DILocation(line: 443, column: 33, scope: !1267)
!1272 = !DILocalVariable(name: "options", arg: 2, scope: !1267, file: !1, line: 443, type: !785)
!1273 = !DILocation(line: 443, column: 70, scope: !1267)
!1274 = !DILocation(line: 447, column: 2, scope: !1267)
!1275 = !DILocation(line: 447, column: 14, scope: !1267)
!1276 = !DILocation(line: 447, column: 26, scope: !1267)
!1277 = !DILocation(line: 448, column: 26, scope: !1267)
!1278 = !DILocation(line: 448, column: 35, scope: !1267)
!1279 = !DILocation(line: 448, column: 2, scope: !1267)
!1280 = !DILocation(line: 448, column: 14, scope: !1267)
!1281 = !DILocation(line: 448, column: 24, scope: !1267)
!1282 = !DILocation(line: 449, column: 2, scope: !1267)
!1283 = !DILocation(line: 449, column: 14, scope: !1267)
!1284 = !DILocation(line: 449, column: 25, scope: !1267)
!1285 = !DILocation(line: 450, column: 2, scope: !1267)
!1286 = !DILocation(line: 450, column: 14, scope: !1267)
!1287 = !DILocation(line: 450, column: 28, scope: !1267)
!1288 = !DILocation(line: 451, column: 25, scope: !1267)
!1289 = !DILocation(line: 451, column: 34, scope: !1267)
!1290 = !DILocation(line: 451, column: 2, scope: !1267)
!1291 = !DILocation(line: 451, column: 14, scope: !1267)
!1292 = !DILocation(line: 451, column: 23, scope: !1267)
!1293 = !DILocation(line: 452, column: 29, scope: !1267)
!1294 = !DILocation(line: 452, column: 38, scope: !1267)
!1295 = !DILocation(line: 452, column: 2, scope: !1267)
!1296 = !DILocation(line: 452, column: 14, scope: !1267)
!1297 = !DILocation(line: 452, column: 27, scope: !1267)
!1298 = !DILocation(line: 453, column: 22, scope: !1267)
!1299 = !DILocation(line: 453, column: 31, scope: !1267)
!1300 = !DILocation(line: 453, column: 2, scope: !1267)
!1301 = !DILocation(line: 453, column: 14, scope: !1267)
!1302 = !DILocation(line: 453, column: 20, scope: !1267)
!1303 = !DILocation(line: 454, column: 28, scope: !1267)
!1304 = !DILocation(line: 454, column: 37, scope: !1267)
!1305 = !DILocation(line: 454, column: 2, scope: !1267)
!1306 = !DILocation(line: 454, column: 14, scope: !1267)
!1307 = !DILocation(line: 454, column: 26, scope: !1267)
!1308 = !DILocation(line: 455, column: 33, scope: !1267)
!1309 = !DILocation(line: 455, column: 42, scope: !1267)
!1310 = !DILocation(line: 455, column: 2, scope: !1267)
!1311 = !DILocation(line: 455, column: 14, scope: !1267)
!1312 = !DILocation(line: 455, column: 31, scope: !1267)
!1313 = !DILocation(line: 456, column: 2, scope: !1267)
!1314 = distinct !DISubprogram(name: "lzma_lzma_encoder_init", scope: !1, file: !1, line: 626, type: !1315, scopeLine: 628, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !162)
!1315 = !DISubroutineType(types: !1316)
!1316 = !{!111, !1317, !1144, !1363}
!1317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1318, size: 64)
!1318 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_next_coder", file: !114, line: 80, baseType: !1319)
!1319 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_next_coder_s", file: !114, line: 124, size: 512, elements: !1320)
!1320 = !{!1321, !1322, !1325, !1328, !1334, !1339, !1346, !1351}
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "coder", scope: !1319, file: !114, line: 126, baseType: !112, size: 64)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1319, file: !114, line: 130, baseType: !1323, size: 64, offset: 64)
!1323 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_vli", file: !1324, line: 63, baseType: !30)
!1324 = !DIFile(filename: "liblzma/api/lzma/vli.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1319, file: !114, line: 136, baseType: !1326, size: 64, offset: 128)
!1326 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !1327, line: 90, baseType: !34)
!1327 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !1319, file: !114, line: 139, baseType: !1329, size: 64, offset: 192)
!1329 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_code_function", file: !114, line: 94, baseType: !1330)
!1330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1331, size: 64)
!1331 = !DISubroutineType(types: !1332)
!1332 = !{!111, !112, !1144, !1333, !160, !44, !159, !160, !44, !156}
!1333 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !792)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !1319, file: !114, line: 144, baseType: !1335, size: 64, offset: 256)
!1335 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_end_function", file: !114, line: 102, baseType: !1336)
!1336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1337, size: 64)
!1337 = !DISubroutineType(types: !1338)
!1338 = !{null, !112, !1144}
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "get_check", scope: !1319, file: !114, line: 148, baseType: !1340, size: 64, offset: 320)
!1340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1341, size: 64)
!1341 = !DISubroutineType(types: !1342)
!1342 = !{!1343, !1344}
!1343 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_check", file: !96, line: 55, baseType: !95)
!1344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1345, size: 64)
!1345 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !113)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "memconfig", scope: !1319, file: !114, line: 152, baseType: !1347, size: 64, offset: 384)
!1347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1348, size: 64)
!1348 = !DISubroutineType(types: !1349)
!1349 = !{!111, !112, !1350, !1350, !30}
!1350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !1319, file: !114, line: 157, baseType: !1352, size: 64, offset: 448)
!1352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1353, size: 64)
!1353 = !DISubroutineType(types: !1354)
!1354 = !{!111, !112, !1144, !1355, !1355}
!1355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1356, size: 64)
!1356 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1357)
!1357 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_filter", file: !1358, line: 65, baseType: !1359)
!1358 = !DIFile(filename: "liblzma/api/lzma/filter.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!1359 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1358, line: 43, size: 128, elements: !1360)
!1360 = !{!1361, !1362}
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1359, file: !1358, line: 54, baseType: !1323, size: 64)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !1359, file: !1358, line: 63, baseType: !103, size: 64, offset: 64)
!1363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1364, size: 64)
!1364 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1365)
!1365 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_filter_info", file: !114, line: 82, baseType: !1366)
!1366 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_filter_info_s", file: !114, line: 109, size: 192, elements: !1367)
!1367 = !{!1368, !1369, !1372}
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1366, file: !114, line: 112, baseType: !1323, size: 64)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1366, file: !114, line: 116, baseType: !1370, size: 64, offset: 64)
!1370 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_init_function", file: !114, line: 86, baseType: !1371)
!1371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1315, size: 64)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !1366, file: !114, line: 119, baseType: !103, size: 64, offset: 128)
!1373 = !DILocalVariable(name: "next", arg: 1, scope: !1314, file: !1, line: 626, type: !1317)
!1374 = !DILocation(line: 626, column: 41, scope: !1314)
!1375 = !DILocalVariable(name: "allocator", arg: 2, scope: !1314, file: !1, line: 626, type: !1144)
!1376 = !DILocation(line: 626, column: 63, scope: !1314)
!1377 = !DILocalVariable(name: "filters", arg: 3, scope: !1314, file: !1, line: 627, type: !1363)
!1378 = !DILocation(line: 627, column: 27, scope: !1314)
!1379 = !DILocation(line: 630, column: 4, scope: !1314)
!1380 = !DILocation(line: 630, column: 10, scope: !1314)
