; ModuleID = 'liblzma/common/block_decoder.c'
source_filename = "liblzma/common/block_decoder.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.lzma_next_coder_s = type { i8*, i64, i64, i32 (i8*, %struct.lzma_allocator*, i8*, i64*, i64, i8*, i64*, i64, i32)*, void (i8*, %struct.lzma_allocator*)*, i32 (i8*)*, i32 (i8*, i64*, i64*, i64)*, i32 (i8*, %struct.lzma_allocator*, %struct.lzma_filter*, %struct.lzma_filter*)* }
%struct.lzma_filter = type { i64, i8* }
%struct.lzma_allocator = type { i8* (i8*, i64, i64)*, void (i8*, i8*)*, i8* }
%struct.lzma_block = type { i32, i32, i32, i64, i64, %struct.lzma_filter*, [64 x i8], i8*, i8*, i8*, i32, i32, i64, i64, i64, i64, i64, i64, i32, i32, i32, i32, i8, i8, i8, i8, i8, i8, i8, i8 }
%struct.lzma_coder_s = type { i32, %struct.lzma_next_coder_s, %struct.lzma_block*, i64, i64, i64, i64, %struct.lzma_check_state }
%struct.lzma_check_state = type { %union.anon, %union.anon.0 }
%union.anon = type { [8 x i64] }
%union.anon.0 = type { %struct.anon }
%struct.anon = type { [8 x i32], i64 }
%struct.lzma_stream = type { i8*, i64, i64, i8*, i64, i64, %struct.lzma_allocator*, %struct.lzma_internal_s*, i8*, i8*, i8*, i8*, i64, i64, i64, i64, i32, i32 }
%struct.lzma_internal_s = type { %struct.lzma_next_coder_s, i32, i64, [4 x i8], i8 }

; Function Attrs: noinline nounwind uwtable

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !219, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "liblzma/common/block_decoder.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!2 = !{!3, !19, !25, !32, !35, !200}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 57, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "liblzma/api/lzma/base.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18}
!7 = !DIEnumerator(name: "LZMA_OK", value: 0, isUnsigned: true)
!8 = !DIEnumerator(name: "LZMA_STREAM_END", value: 1, isUnsigned: true)
!9 = !DIEnumerator(name: "LZMA_NO_CHECK", value: 2, isUnsigned: true)
!10 = !DIEnumerator(name: "LZMA_UNSUPPORTED_CHECK", value: 3, isUnsigned: true)
!11 = !DIEnumerator(name: "LZMA_GET_CHECK", value: 4, isUnsigned: true)
!12 = !DIEnumerator(name: "LZMA_MEM_ERROR", value: 5, isUnsigned: true)
!13 = !DIEnumerator(name: "LZMA_MEMLIMIT_ERROR", value: 6, isUnsigned: true)
!14 = !DIEnumerator(name: "LZMA_FORMAT_ERROR", value: 7, isUnsigned: true)
!15 = !DIEnumerator(name: "LZMA_OPTIONS_ERROR", value: 8, isUnsigned: true)
!16 = !DIEnumerator(name: "LZMA_DATA_ERROR", value: 9, isUnsigned: true)
!17 = !DIEnumerator(name: "LZMA_BUF_ERROR", value: 10, isUnsigned: true)
!18 = !DIEnumerator(name: "LZMA_PROG_ERROR", value: 11, isUnsigned: true)
!19 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 250, baseType: !5, size: 32, elements: !20)
!20 = !{!21, !22, !23, !24}
!21 = !DIEnumerator(name: "LZMA_RUN", value: 0, isUnsigned: true)
!22 = !DIEnumerator(name: "LZMA_SYNC_FLUSH", value: 1, isUnsigned: true)
!23 = !DIEnumerator(name: "LZMA_FULL_FLUSH", value: 2, isUnsigned: true)
!24 = !DIEnumerator(name: "LZMA_FINISH", value: 3, isUnsigned: true)
!25 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !26, line: 27, baseType: !5, size: 32, elements: !27)
!26 = !DIFile(filename: "liblzma/api/lzma/check.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!27 = !{!28, !29, !30, !31}
!28 = !DIEnumerator(name: "LZMA_CHECK_NONE", value: 0, isUnsigned: true)
!29 = !DIEnumerator(name: "LZMA_CHECK_CRC32", value: 1, isUnsigned: true)
!30 = !DIEnumerator(name: "LZMA_CHECK_CRC64", value: 4, isUnsigned: true)
!31 = !DIEnumerator(name: "LZMA_CHECK_SHA256", value: 10, isUnsigned: true)
!32 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 44, baseType: !5, size: 32, elements: !33)
!33 = !{!34}
!34 = !DIEnumerator(name: "LZMA_RESERVED_ENUM", value: 0, isUnsigned: true)
!35 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !36, file: !1, line: 19, baseType: !5, size: 32, elements: !196)
!36 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_coder_s", file: !1, line: 18, size: 1728, elements: !37)
!37 = !{!38, !39, !120, !164, !165, !166, !167, !168}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !36, file: !1, line: 23, baseType: !35, size: 32)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !36, file: !1, line: 26, baseType: !40, size: 512, offset: 64)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_next_coder", file: !41, line: 80, baseType: !42)
!41 = !DIFile(filename: "liblzma/common/common.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!42 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_next_coder_s", file: !41, line: 124, size: 512, elements: !43)
!43 = !{!44, !47, !55, !58, !91, !96, !103, !108}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "coder", scope: !42, file: !41, line: 126, baseType: !45, size: 64)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_coder", file: !41, line: 78, baseType: null)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !42, file: !41, line: 130, baseType: !48, size: 64, offset: 64)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_vli", file: !49, line: 63, baseType: !50)
!49 = !DIFile(filename: "liblzma/api/lzma/vli.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !51, line: 27, baseType: !52)
!51 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !53, line: 45, baseType: !54)
!53 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!54 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !42, file: !41, line: 136, baseType: !56, size: 64, offset: 128)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !57, line: 90, baseType: !54)
!57 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!58 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !42, file: !41, line: 139, baseType: !59, size: 64, offset: 192)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_code_function", file: !41, line: 94, baseType: !60)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = !DISubroutineType(types: !62)
!62 = !{!63, !45, !64, !80, !86, !73, !88, !86, !73, !90}
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_ret", file: !4, line: 237, baseType: !3)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_allocator", file: !4, line: 403, baseType: !66)
!66 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 341, size: 192, elements: !67)
!67 = !{!68, !75, !79}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !66, file: !4, line: 376, baseType: !69, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = !DISubroutineType(types: !71)
!71 = !{!72, !72, !73, !73}
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !74, line: 46, baseType: !54)
!74 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!75 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !66, file: !4, line: 390, baseType: !76, size: 64, offset: 64)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = !DISubroutineType(types: !78)
!78 = !{null, !72, !72}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !66, file: !4, line: 401, baseType: !72, size: 64, offset: 128)
!80 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !81)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !83)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !51, line: 24, baseType: !84)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !53, line: 38, baseType: !85)
!85 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!86 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !87)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !89)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_action", file: !4, line: 322, baseType: !19)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !42, file: !41, line: 144, baseType: !92, size: 64, offset: 256)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_end_function", file: !41, line: 102, baseType: !93)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = !DISubroutineType(types: !95)
!95 = !{null, !45, !64}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "get_check", scope: !42, file: !41, line: 148, baseType: !97, size: 64, offset: 320)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!98 = !DISubroutineType(types: !99)
!99 = !{!100, !101}
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_check", file: !26, line: 55, baseType: !25)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !46)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "memconfig", scope: !42, file: !41, line: 152, baseType: !104, size: 64, offset: 384)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!105 = !DISubroutineType(types: !106)
!106 = !{!63, !45, !107, !107, !50}
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !42, file: !41, line: 157, baseType: !109, size: 64, offset: 448)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = !DISubroutineType(types: !111)
!111 = !{!63, !45, !64, !112, !112}
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !114)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_filter", file: !115, line: 65, baseType: !116)
!115 = !DIFile(filename: "liblzma/api/lzma/filter.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!116 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !115, line: 43, size: 128, elements: !117)
!117 = !{!118, !119}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !116, file: !115, line: 54, baseType: !48, size: 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !116, file: !115, line: 63, baseType: !72, size: 64, offset: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !36, file: !1, line: 30, baseType: !121, size: 64, offset: 576)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_block", file: !123, line: 245, baseType: !124)
!123 = !DIFile(filename: "liblzma/api/lzma/block.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!124 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !123, line: 30, size: 1664, elements: !125)
!125 = !{!126, !129, !130, !131, !132, !133, !135, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !152, !153, !154, !155, !157, !158, !159, !160, !161, !162, !163}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !124, file: !123, line: 47, baseType: !127, size: 32)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !51, line: 26, baseType: !128)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !53, line: 42, baseType: !5)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "header_size", scope: !124, file: !123, line: 67, baseType: !127, size: 32, offset: 32)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !124, file: !123, line: 88, baseType: !100, size: 32, offset: 64)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "compressed_size", scope: !124, file: !123, line: 143, baseType: !48, size: 64, offset: 128)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "uncompressed_size", scope: !124, file: !123, line: 167, baseType: !48, size: 64, offset: 192)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "filters", scope: !124, file: !123, line: 195, baseType: !134, size: 64, offset: 256)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "raw_check", scope: !124, file: !123, line: 212, baseType: !136, size: 512, offset: 320)
!136 = !DICompositeType(tag: DW_TAG_array_type, baseType: !83, size: 512, elements: !137)
!137 = !{!138}
!138 = !DISubrange(count: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr1", scope: !124, file: !123, line: 221, baseType: !72, size: 64, offset: 832)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr2", scope: !124, file: !123, line: 222, baseType: !72, size: 64, offset: 896)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr3", scope: !124, file: !123, line: 223, baseType: !72, size: 64, offset: 960)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int1", scope: !124, file: !123, line: 224, baseType: !127, size: 32, offset: 1024)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int2", scope: !124, file: !123, line: 225, baseType: !127, size: 32, offset: 1056)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int3", scope: !124, file: !123, line: 226, baseType: !48, size: 64, offset: 1088)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int4", scope: !124, file: !123, line: 227, baseType: !48, size: 64, offset: 1152)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int5", scope: !124, file: !123, line: 228, baseType: !48, size: 64, offset: 1216)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int6", scope: !124, file: !123, line: 229, baseType: !48, size: 64, offset: 1280)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int7", scope: !124, file: !123, line: 230, baseType: !48, size: 64, offset: 1344)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int8", scope: !124, file: !123, line: 231, baseType: !48, size: 64, offset: 1408)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum1", scope: !124, file: !123, line: 232, baseType: !151, size: 32, offset: 1472)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_reserved_enum", file: !4, line: 46, baseType: !32)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum2", scope: !124, file: !123, line: 233, baseType: !151, size: 32, offset: 1504)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum3", scope: !124, file: !123, line: 234, baseType: !151, size: 32, offset: 1536)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum4", scope: !124, file: !123, line: 235, baseType: !151, size: 32, offset: 1568)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool1", scope: !124, file: !123, line: 236, baseType: !156, size: 8, offset: 1600)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_bool", file: !4, line: 29, baseType: !85)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool2", scope: !124, file: !123, line: 237, baseType: !156, size: 8, offset: 1608)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool3", scope: !124, file: !123, line: 238, baseType: !156, size: 8, offset: 1616)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool4", scope: !124, file: !123, line: 239, baseType: !156, size: 8, offset: 1624)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool5", scope: !124, file: !123, line: 240, baseType: !156, size: 8, offset: 1632)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool6", scope: !124, file: !123, line: 241, baseType: !156, size: 8, offset: 1640)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool7", scope: !124, file: !123, line: 242, baseType: !156, size: 8, offset: 1648)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool8", scope: !124, file: !123, line: 243, baseType: !156, size: 8, offset: 1656)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "compressed_size", scope: !36, file: !1, line: 33, baseType: !48, size: 64, offset: 640)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "uncompressed_size", scope: !36, file: !1, line: 36, baseType: !48, size: 64, offset: 704)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "compressed_limit", scope: !36, file: !1, line: 41, baseType: !48, size: 64, offset: 768)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "check_pos", scope: !36, file: !1, line: 44, baseType: !73, size: 64, offset: 832)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !36, file: !1, line: 47, baseType: !169, size: 832, offset: 896)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_check_state", file: !170, line: 56, baseType: !171)
!170 = !DIFile(filename: "liblzma/check/check.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!171 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !170, line: 34, size: 832, elements: !172)
!172 = !{!173, !185}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !171, file: !170, line: 40, baseType: !174, size: 512)
!174 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !171, file: !170, line: 36, size: 512, elements: !175)
!175 = !{!176, !177, !181}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "u8", scope: !174, file: !170, line: 37, baseType: !136, size: 512)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "u32", scope: !174, file: !170, line: 38, baseType: !178, size: 512)
!178 = !DICompositeType(tag: DW_TAG_array_type, baseType: !127, size: 512, elements: !179)
!179 = !{!180}
!180 = !DISubrange(count: 16)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "u64", scope: !174, file: !170, line: 39, baseType: !182, size: 512)
!182 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 512, elements: !183)
!183 = !{!184}
!184 = !DISubrange(count: 8)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !171, file: !170, line: 54, baseType: !186, size: 320, offset: 512)
!186 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !171, file: !170, line: 43, size: 320, elements: !187)
!187 = !{!188, !189, !190}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "crc32", scope: !186, file: !170, line: 44, baseType: !127, size: 32)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "crc64", scope: !186, file: !170, line: 45, baseType: !50, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "sha256", scope: !186, file: !170, line: 53, baseType: !191, size: 320)
!191 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !186, file: !170, line: 47, size: 320, elements: !192)
!192 = !{!193, !195}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !191, file: !170, line: 49, baseType: !194, size: 256)
!194 = !DICompositeType(tag: DW_TAG_array_type, baseType: !127, size: 256, elements: !183)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !191, file: !170, line: 52, baseType: !50, size: 64, offset: 256)
!196 = !{!197, !198, !199}
!197 = !DIEnumerator(name: "SEQ_CODE", value: 0, isUnsigned: true)
!198 = !DIEnumerator(name: "SEQ_PADDING", value: 1, isUnsigned: true)
!199 = !DIEnumerator(name: "SEQ_CHECK", value: 2, isUnsigned: true)
!200 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !201, file: !41, line: 187, baseType: !5, size: 32, elements: !212)
!201 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_internal_s", file: !41, line: 179, size: 704, elements: !202)
!202 = !{!203, !204, !205, !206, !211}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !201, file: !41, line: 181, baseType: !40, size: 512)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !201, file: !41, line: 194, baseType: !200, size: 32, offset: 512)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "avail_in", scope: !201, file: !41, line: 199, baseType: !73, size: 64, offset: 576)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "supported_actions", scope: !201, file: !41, line: 202, baseType: !207, size: 32, offset: 640)
!207 = !DICompositeType(tag: DW_TAG_array_type, baseType: !208, size: 32, elements: !209)
!208 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!209 = !{!210}
!210 = !DISubrange(count: 4)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "allow_buf_error", scope: !201, file: !41, line: 206, baseType: !208, size: 8, offset: 672)
!212 = !{!213, !214, !215, !216, !217, !218}
!213 = !DIEnumerator(name: "ISEQ_RUN", value: 0, isUnsigned: true)
!214 = !DIEnumerator(name: "ISEQ_SYNC_FLUSH", value: 1, isUnsigned: true)
!215 = !DIEnumerator(name: "ISEQ_FULL_FLUSH", value: 2, isUnsigned: true)
!216 = !DIEnumerator(name: "ISEQ_FINISH", value: 3, isUnsigned: true)
!217 = !DIEnumerator(name: "ISEQ_END", value: 4, isUnsigned: true)
!218 = !DIEnumerator(name: "ISEQ_ERROR", value: 5, isUnsigned: true)
!219 = !{!56, !72, !220}
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!221 = !{i32 7, !"Dwarf Version", i32 4}
!222 = !{i32 2, !"Debug Info Version", i32 3}
!223 = !{i32 1, !"wchar_size", i32 4}
!224 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!225 = distinct !DISubprogram(name: "lzma_block_decoder_init", scope: !1, file: !1, line: 184, type: !226, scopeLine: 186, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !229)
!226 = !DISubroutineType(types: !227)
!227 = !{!63, !228, !64, !121}
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!229 = !{}
!230 = !DILocalVariable(name: "next", arg: 1, scope: !225, file: !1, line: 184, type: !228)
!231 = !DILocation(line: 184, column: 42, scope: !225)
!232 = !DILocalVariable(name: "allocator", arg: 2, scope: !225, file: !1, line: 184, type: !64)
!233 = !DILocation(line: 184, column: 64, scope: !225)
!234 = !DILocalVariable(name: "block", arg: 3, scope: !225, file: !1, line: 185, type: !121)
!235 = !DILocation(line: 185, column: 15, scope: !225)
!236 = !DILocation(line: 187, column: 2, scope: !225)
!237 = !DILocation(line: 187, column: 2, scope: !238)
!238 = distinct !DILexicalBlock(scope: !239, file: !1, line: 187, column: 2)
!239 = distinct !DILexicalBlock(scope: !225, file: !1, line: 187, column: 2)
!240 = !DILocation(line: 187, column: 2, scope: !239)
!241 = !DILocation(line: 192, column: 31, scope: !242)
!242 = distinct !DILexicalBlock(scope: !225, file: !1, line: 192, column: 6)
!243 = !DILocation(line: 192, column: 6, scope: !242)
!244 = !DILocation(line: 192, column: 38, scope: !242)
!245 = !DILocation(line: 193, column: 4, scope: !242)
!246 = !DILocation(line: 193, column: 8, scope: !242)
!247 = !DILocation(line: 192, column: 6, scope: !225)
!248 = !DILocation(line: 194, column: 3, scope: !242)
!249 = !DILocation(line: 197, column: 6, scope: !250)
!250 = distinct !DILexicalBlock(scope: !225, file: !1, line: 197, column: 6)
!251 = !DILocation(line: 197, column: 12, scope: !250)
!252 = !DILocation(line: 197, column: 18, scope: !250)
!253 = !DILocation(line: 197, column: 6, scope: !225)
!254 = !DILocation(line: 198, column: 57, scope: !255)
!255 = distinct !DILexicalBlock(scope: !250, file: !1, line: 197, column: 27)
!256 = !DILocation(line: 198, column: 17, scope: !255)
!257 = !DILocation(line: 198, column: 3, scope: !255)
!258 = !DILocation(line: 198, column: 9, scope: !255)
!259 = !DILocation(line: 198, column: 15, scope: !255)
!260 = !DILocation(line: 199, column: 7, scope: !261)
!261 = distinct !DILexicalBlock(scope: !255, file: !1, line: 199, column: 7)
!262 = !DILocation(line: 199, column: 13, scope: !261)
!263 = !DILocation(line: 199, column: 19, scope: !261)
!264 = !DILocation(line: 199, column: 7, scope: !255)
!265 = !DILocation(line: 200, column: 4, scope: !261)
!266 = !DILocation(line: 202, column: 3, scope: !255)
!267 = !DILocation(line: 202, column: 9, scope: !255)
!268 = !DILocation(line: 202, column: 14, scope: !255)
!269 = !DILocation(line: 203, column: 3, scope: !255)
!270 = !DILocation(line: 203, column: 9, scope: !255)
!271 = !DILocation(line: 203, column: 13, scope: !255)
!272 = !DILocation(line: 204, column: 26, scope: !255)
!273 = !DILocation(line: 204, column: 32, scope: !255)
!274 = !DILocation(line: 204, column: 4, scope: !255)
!275 = !DILocation(line: 204, column: 40, scope: !255)
!276 = !DILocation(line: 204, column: 47, scope: !255)
!277 = !DILocation(line: 205, column: 2, scope: !255)
!278 = !DILocation(line: 208, column: 25, scope: !225)
!279 = !DILocation(line: 208, column: 31, scope: !225)
!280 = !DILocation(line: 208, column: 3, scope: !225)
!281 = !DILocation(line: 208, column: 39, scope: !225)
!282 = !DILocation(line: 208, column: 48, scope: !225)
!283 = !DILocation(line: 209, column: 47, scope: !225)
!284 = !DILocation(line: 209, column: 25, scope: !225)
!285 = !DILocation(line: 209, column: 31, scope: !225)
!286 = !DILocation(line: 209, column: 3, scope: !225)
!287 = !DILocation(line: 209, column: 39, scope: !225)
!288 = !DILocation(line: 209, column: 45, scope: !225)
!289 = !DILocation(line: 210, column: 25, scope: !225)
!290 = !DILocation(line: 210, column: 31, scope: !225)
!291 = !DILocation(line: 210, column: 3, scope: !225)
!292 = !DILocation(line: 210, column: 39, scope: !225)
!293 = !DILocation(line: 210, column: 55, scope: !225)
!294 = !DILocation(line: 211, column: 25, scope: !225)
!295 = !DILocation(line: 211, column: 31, scope: !225)
!296 = !DILocation(line: 211, column: 3, scope: !225)
!297 = !DILocation(line: 211, column: 39, scope: !225)
!298 = !DILocation(line: 211, column: 57, scope: !225)
!299 = !DILocation(line: 217, column: 6, scope: !225)
!300 = !DILocation(line: 217, column: 13, scope: !225)
!301 = !DILocation(line: 217, column: 29, scope: !225)
!302 = !DILocation(line: 219, column: 8, scope: !225)
!303 = !DILocation(line: 219, column: 15, scope: !225)
!304 = !DILocation(line: 219, column: 6, scope: !225)
!305 = !DILocation(line: 220, column: 24, scope: !225)
!306 = !DILocation(line: 220, column: 31, scope: !225)
!307 = !DILocation(line: 220, column: 8, scope: !225)
!308 = !DILocation(line: 220, column: 6, scope: !225)
!309 = !DILocation(line: 221, column: 7, scope: !225)
!310 = !DILocation(line: 221, column: 14, scope: !225)
!311 = !DILocation(line: 216, column: 25, scope: !225)
!312 = !DILocation(line: 216, column: 31, scope: !225)
!313 = !DILocation(line: 216, column: 3, scope: !225)
!314 = !DILocation(line: 216, column: 39, scope: !225)
!315 = !DILocation(line: 217, column: 4, scope: !225)
!316 = !DILocation(line: 226, column: 25, scope: !225)
!317 = !DILocation(line: 226, column: 31, scope: !225)
!318 = !DILocation(line: 226, column: 3, scope: !225)
!319 = !DILocation(line: 226, column: 39, scope: !225)
!320 = !DILocation(line: 226, column: 49, scope: !225)
!321 = !DILocation(line: 227, column: 42, scope: !225)
!322 = !DILocation(line: 227, column: 48, scope: !225)
!323 = !DILocation(line: 227, column: 20, scope: !225)
!324 = !DILocation(line: 227, column: 56, scope: !225)
!325 = !DILocation(line: 227, column: 63, scope: !225)
!326 = !DILocation(line: 227, column: 70, scope: !225)
!327 = !DILocation(line: 227, column: 2, scope: !225)
!328 = !DILocation(line: 230, column: 55, scope: !225)
!329 = !DILocation(line: 230, column: 61, scope: !225)
!330 = !DILocation(line: 230, column: 33, scope: !225)
!331 = !DILocation(line: 230, column: 69, scope: !225)
!332 = !DILocation(line: 230, column: 75, scope: !225)
!333 = !DILocation(line: 231, column: 4, scope: !225)
!334 = !DILocation(line: 231, column: 11, scope: !225)
!335 = !DILocation(line: 230, column: 9, scope: !225)
!336 = !DILocation(line: 230, column: 2, scope: !225)
!337 = !DILocation(line: 232, column: 1, scope: !225)
!338 = distinct !DISubprogram(name: "block_decode", scope: !1, file: !1, line: 74, type: !61, scopeLine: 78, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !229)
!339 = !DILocalVariable(name: "pcoder", arg: 1, scope: !338, file: !1, line: 74, type: !45)
!340 = !DILocation(line: 74, column: 26, scope: !338)
!341 = !DILocalVariable(name: "allocator", arg: 2, scope: !338, file: !1, line: 74, type: !64)
!342 = !DILocation(line: 74, column: 50, scope: !338)
!343 = !DILocalVariable(name: "in", arg: 3, scope: !338, file: !1, line: 75, type: !80)
!344 = !DILocation(line: 75, column: 27, scope: !338)
!345 = !DILocalVariable(name: "in_pos", arg: 4, scope: !338, file: !1, line: 75, type: !86)
!346 = !DILocation(line: 75, column: 48, scope: !338)
!347 = !DILocalVariable(name: "in_size", arg: 5, scope: !338, file: !1, line: 76, type: !73)
!348 = !DILocation(line: 76, column: 10, scope: !338)
!349 = !DILocalVariable(name: "out", arg: 6, scope: !338, file: !1, line: 76, type: !88)
!350 = !DILocation(line: 76, column: 37, scope: !338)
!351 = !DILocalVariable(name: "out_pos", arg: 7, scope: !338, file: !1, line: 77, type: !86)
!352 = !DILocation(line: 77, column: 20, scope: !338)
!353 = !DILocalVariable(name: "out_size", arg: 8, scope: !338, file: !1, line: 77, type: !73)
!354 = !DILocation(line: 77, column: 36, scope: !338)
!355 = !DILocalVariable(name: "action", arg: 9, scope: !338, file: !1, line: 77, type: !90)
!356 = !DILocation(line: 77, column: 58, scope: !338)
!357 = !DILocalVariable(name: "coder", scope: !338, file: !1, line: 79, type: !220)
!358 = !DILocation(line: 79, column: 23, scope: !338)
!359 = !DILocation(line: 79, column: 31, scope: !338)
!360 = !DILocation(line: 80, column: 10, scope: !338)
!361 = !DILocation(line: 80, column: 17, scope: !338)
!362 = !DILocation(line: 80, column: 2, scope: !338)
!363 = !DILocalVariable(name: "in_start", scope: !364, file: !1, line: 82, type: !366)
!364 = distinct !DILexicalBlock(scope: !365, file: !1, line: 81, column: 17)
!365 = distinct !DILexicalBlock(scope: !338, file: !1, line: 80, column: 27)
!366 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !73)
!367 = !DILocation(line: 82, column: 16, scope: !364)
!368 = !DILocation(line: 82, column: 28, scope: !364)
!369 = !DILocation(line: 82, column: 27, scope: !364)
!370 = !DILocalVariable(name: "out_start", scope: !364, file: !1, line: 83, type: !366)
!371 = !DILocation(line: 83, column: 16, scope: !364)
!372 = !DILocation(line: 83, column: 29, scope: !364)
!373 = !DILocation(line: 83, column: 28, scope: !364)
!374 = !DILocalVariable(name: "ret", scope: !364, file: !1, line: 85, type: !375)
!375 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !63)
!376 = !DILocation(line: 85, column: 18, scope: !364)
!377 = !DILocation(line: 85, column: 24, scope: !364)
!378 = !DILocation(line: 85, column: 31, scope: !364)
!379 = !DILocation(line: 85, column: 36, scope: !364)
!380 = !DILocation(line: 85, column: 41, scope: !364)
!381 = !DILocation(line: 85, column: 48, scope: !364)
!382 = !DILocation(line: 85, column: 53, scope: !364)
!383 = !DILocation(line: 86, column: 5, scope: !364)
!384 = !DILocation(line: 86, column: 16, scope: !364)
!385 = !DILocation(line: 86, column: 20, scope: !364)
!386 = !DILocation(line: 86, column: 28, scope: !364)
!387 = !DILocation(line: 87, column: 5, scope: !364)
!388 = !DILocation(line: 87, column: 10, scope: !364)
!389 = !DILocation(line: 87, column: 19, scope: !364)
!390 = !DILocation(line: 87, column: 29, scope: !364)
!391 = !DILocalVariable(name: "in_used", scope: !364, file: !1, line: 89, type: !366)
!392 = !DILocation(line: 89, column: 16, scope: !364)
!393 = !DILocation(line: 89, column: 27, scope: !364)
!394 = !DILocation(line: 89, column: 26, scope: !364)
!395 = !DILocation(line: 89, column: 36, scope: !364)
!396 = !DILocation(line: 89, column: 34, scope: !364)
!397 = !DILocalVariable(name: "out_used", scope: !364, file: !1, line: 90, type: !366)
!398 = !DILocation(line: 90, column: 16, scope: !364)
!399 = !DILocation(line: 90, column: 28, scope: !364)
!400 = !DILocation(line: 90, column: 27, scope: !364)
!401 = !DILocation(line: 90, column: 38, scope: !364)
!402 = !DILocation(line: 90, column: 36, scope: !364)
!403 = !DILocation(line: 94, column: 20, scope: !404)
!404 = distinct !DILexicalBlock(scope: !364, file: !1, line: 94, column: 7)
!405 = !DILocation(line: 94, column: 27, scope: !404)
!406 = !DILocation(line: 94, column: 44, scope: !404)
!407 = !DILocation(line: 95, column: 6, scope: !404)
!408 = !DILocation(line: 95, column: 13, scope: !404)
!409 = !DILocation(line: 94, column: 7, scope: !404)
!410 = !DILocation(line: 96, column: 5, scope: !404)
!411 = !DILocation(line: 96, column: 21, scope: !404)
!412 = !DILocation(line: 96, column: 28, scope: !404)
!413 = !DILocation(line: 97, column: 6, scope: !404)
!414 = !DILocation(line: 98, column: 6, scope: !404)
!415 = !DILocation(line: 98, column: 13, scope: !404)
!416 = !DILocation(line: 98, column: 20, scope: !404)
!417 = !DILocation(line: 96, column: 8, scope: !404)
!418 = !DILocation(line: 94, column: 7, scope: !364)
!419 = !DILocation(line: 99, column: 4, scope: !404)
!420 = !DILocation(line: 101, column: 22, scope: !364)
!421 = !DILocation(line: 101, column: 29, scope: !364)
!422 = !DILocation(line: 101, column: 36, scope: !364)
!423 = !DILocation(line: 101, column: 43, scope: !364)
!424 = !DILocation(line: 101, column: 50, scope: !364)
!425 = !DILocation(line: 102, column: 5, scope: !364)
!426 = !DILocation(line: 102, column: 11, scope: !364)
!427 = !DILocation(line: 102, column: 9, scope: !364)
!428 = !DILocation(line: 102, column: 22, scope: !364)
!429 = !DILocation(line: 101, column: 3, scope: !364)
!430 = !DILocation(line: 104, column: 7, scope: !431)
!431 = distinct !DILexicalBlock(scope: !364, file: !1, line: 104, column: 7)
!432 = !DILocation(line: 104, column: 11, scope: !431)
!433 = !DILocation(line: 104, column: 7, scope: !364)
!434 = !DILocation(line: 105, column: 11, scope: !431)
!435 = !DILocation(line: 105, column: 4, scope: !431)
!436 = !DILocation(line: 109, column: 22, scope: !437)
!437 = distinct !DILexicalBlock(scope: !364, file: !1, line: 109, column: 7)
!438 = !DILocation(line: 109, column: 29, scope: !437)
!439 = !DILocation(line: 110, column: 6, scope: !437)
!440 = !DILocation(line: 110, column: 13, scope: !437)
!441 = !DILocation(line: 110, column: 20, scope: !437)
!442 = !DILocation(line: 109, column: 8, scope: !437)
!443 = !DILocation(line: 111, column: 5, scope: !437)
!444 = !DILocation(line: 111, column: 23, scope: !437)
!445 = !DILocation(line: 111, column: 30, scope: !437)
!446 = !DILocation(line: 112, column: 6, scope: !437)
!447 = !DILocation(line: 112, column: 13, scope: !437)
!448 = !DILocation(line: 112, column: 20, scope: !437)
!449 = !DILocation(line: 111, column: 9, scope: !437)
!450 = !DILocation(line: 109, column: 7, scope: !364)
!451 = !DILocation(line: 113, column: 4, scope: !437)
!452 = !DILocation(line: 117, column: 35, scope: !364)
!453 = !DILocation(line: 117, column: 42, scope: !364)
!454 = !DILocation(line: 117, column: 3, scope: !364)
!455 = !DILocation(line: 117, column: 10, scope: !364)
!456 = !DILocation(line: 117, column: 17, scope: !364)
!457 = !DILocation(line: 117, column: 33, scope: !364)
!458 = !DILocation(line: 118, column: 37, scope: !364)
!459 = !DILocation(line: 118, column: 44, scope: !364)
!460 = !DILocation(line: 118, column: 3, scope: !364)
!461 = !DILocation(line: 118, column: 10, scope: !364)
!462 = !DILocation(line: 118, column: 17, scope: !364)
!463 = !DILocation(line: 118, column: 35, scope: !364)
!464 = !DILocation(line: 120, column: 3, scope: !364)
!465 = !DILocation(line: 120, column: 10, scope: !364)
!466 = !DILocation(line: 120, column: 19, scope: !364)
!467 = !DILocation(line: 121, column: 2, scope: !364)
!468 = !DILocation(line: 127, column: 3, scope: !365)
!469 = !DILocation(line: 127, column: 10, scope: !365)
!470 = !DILocation(line: 127, column: 17, scope: !365)
!471 = !DILocation(line: 127, column: 33, scope: !365)
!472 = !DILocation(line: 128, column: 9, scope: !473)
!473 = distinct !DILexicalBlock(scope: !474, file: !1, line: 128, column: 8)
!474 = distinct !DILexicalBlock(scope: !365, file: !1, line: 127, column: 38)
!475 = !DILocation(line: 128, column: 8, scope: !473)
!476 = !DILocation(line: 128, column: 19, scope: !473)
!477 = !DILocation(line: 128, column: 16, scope: !473)
!478 = !DILocation(line: 128, column: 8, scope: !474)
!479 = !DILocation(line: 129, column: 5, scope: !473)
!480 = !DILocation(line: 135, column: 6, scope: !474)
!481 = !DILocation(line: 135, column: 13, scope: !474)
!482 = !DILocation(line: 135, column: 4, scope: !474)
!483 = !DILocation(line: 137, column: 8, scope: !484)
!484 = distinct !DILexicalBlock(scope: !474, file: !1, line: 137, column: 8)
!485 = !DILocation(line: 137, column: 13, scope: !484)
!486 = !DILocation(line: 137, column: 20, scope: !484)
!487 = !DILocation(line: 137, column: 24, scope: !484)
!488 = !DILocation(line: 137, column: 8, scope: !474)
!489 = !DILocation(line: 138, column: 5, scope: !484)
!490 = distinct !{!490, !468, !491}
!491 = !DILocation(line: 139, column: 3, scope: !365)
!492 = !DILocation(line: 141, column: 7, scope: !493)
!493 = distinct !DILexicalBlock(scope: !365, file: !1, line: 141, column: 7)
!494 = !DILocation(line: 141, column: 14, scope: !493)
!495 = !DILocation(line: 141, column: 21, scope: !493)
!496 = !DILocation(line: 141, column: 27, scope: !493)
!497 = !DILocation(line: 141, column: 7, scope: !365)
!498 = !DILocation(line: 142, column: 4, scope: !493)
!499 = !DILocation(line: 144, column: 22, scope: !365)
!500 = !DILocation(line: 144, column: 29, scope: !365)
!501 = !DILocation(line: 144, column: 36, scope: !365)
!502 = !DILocation(line: 144, column: 43, scope: !365)
!503 = !DILocation(line: 144, column: 50, scope: !365)
!504 = !DILocation(line: 144, column: 3, scope: !365)
!505 = !DILocation(line: 145, column: 3, scope: !365)
!506 = !DILocation(line: 145, column: 10, scope: !365)
!507 = !DILocation(line: 145, column: 19, scope: !365)
!508 = !DILocalVariable(name: "check_size", scope: !509, file: !1, line: 150, type: !366)
!509 = distinct !DILexicalBlock(scope: !365, file: !1, line: 149, column: 18)
!510 = !DILocation(line: 150, column: 16, scope: !509)
!511 = !DILocation(line: 150, column: 45, scope: !509)
!512 = !DILocation(line: 150, column: 52, scope: !509)
!513 = !DILocation(line: 150, column: 59, scope: !509)
!514 = !DILocation(line: 150, column: 29, scope: !509)
!515 = !DILocation(line: 151, column: 15, scope: !509)
!516 = !DILocation(line: 151, column: 19, scope: !509)
!517 = !DILocation(line: 151, column: 27, scope: !509)
!518 = !DILocation(line: 151, column: 36, scope: !509)
!519 = !DILocation(line: 151, column: 43, scope: !509)
!520 = !DILocation(line: 151, column: 50, scope: !509)
!521 = !DILocation(line: 152, column: 6, scope: !509)
!522 = !DILocation(line: 152, column: 13, scope: !509)
!523 = !DILocation(line: 152, column: 24, scope: !509)
!524 = !DILocation(line: 151, column: 3, scope: !509)
!525 = !DILocation(line: 153, column: 7, scope: !526)
!526 = distinct !DILexicalBlock(scope: !509, file: !1, line: 153, column: 7)
!527 = !DILocation(line: 153, column: 14, scope: !526)
!528 = !DILocation(line: 153, column: 26, scope: !526)
!529 = !DILocation(line: 153, column: 24, scope: !526)
!530 = !DILocation(line: 153, column: 7, scope: !509)
!531 = !DILocation(line: 154, column: 4, scope: !526)
!532 = !DILocation(line: 159, column: 31, scope: !533)
!533 = distinct !DILexicalBlock(scope: !509, file: !1, line: 159, column: 7)
!534 = !DILocation(line: 159, column: 38, scope: !533)
!535 = !DILocation(line: 159, column: 45, scope: !533)
!536 = !DILocation(line: 159, column: 7, scope: !533)
!537 = !DILocation(line: 160, column: 5, scope: !533)
!538 = !DILocation(line: 160, column: 15, scope: !533)
!539 = !DILocation(line: 160, column: 22, scope: !533)
!540 = !DILocation(line: 160, column: 29, scope: !533)
!541 = !DILocation(line: 161, column: 6, scope: !533)
!542 = !DILocation(line: 161, column: 13, scope: !533)
!543 = !DILocation(line: 161, column: 19, scope: !533)
!544 = !DILocation(line: 161, column: 26, scope: !533)
!545 = !DILocation(line: 162, column: 6, scope: !533)
!546 = !DILocation(line: 160, column: 8, scope: !533)
!547 = !DILocation(line: 162, column: 18, scope: !533)
!548 = !DILocation(line: 159, column: 7, scope: !509)
!549 = !DILocation(line: 163, column: 4, scope: !533)
!550 = !DILocation(line: 165, column: 3, scope: !509)
!551 = !DILocation(line: 169, column: 2, scope: !338)
!552 = !DILocation(line: 170, column: 1, scope: !338)
!553 = distinct !DISubprogram(name: "block_decoder_end", scope: !1, file: !1, line: 174, type: !94, scopeLine: 175, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !229)
!554 = !DILocalVariable(name: "pcoder", arg: 1, scope: !553, file: !1, line: 174, type: !45)
!555 = !DILocation(line: 174, column: 31, scope: !553)
!556 = !DILocalVariable(name: "allocator", arg: 2, scope: !553, file: !1, line: 174, type: !64)
!557 = !DILocation(line: 174, column: 55, scope: !553)
!558 = !DILocalVariable(name: "coder", scope: !553, file: !1, line: 176, type: !220)
!559 = !DILocation(line: 176, column: 23, scope: !553)
!560 = !DILocation(line: 176, column: 31, scope: !553)
!561 = !DILocation(line: 177, column: 17, scope: !553)
!562 = !DILocation(line: 177, column: 24, scope: !553)
!563 = !DILocation(line: 177, column: 30, scope: !553)
!564 = !DILocation(line: 177, column: 2, scope: !553)
!565 = !DILocation(line: 178, column: 12, scope: !553)
!566 = !DILocation(line: 178, column: 19, scope: !553)
!567 = !DILocation(line: 178, column: 2, scope: !553)
!568 = !DILocation(line: 179, column: 2, scope: !553)
!569 = distinct !DISubprogram(name: "lzma_block_decoder", scope: !1, file: !1, line: 236, type: !570, scopeLine: 237, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !229)
!570 = !DISubroutineType(types: !571)
!571 = !{!63, !572, !121}
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 64)
!573 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_stream", file: !4, line: 490, baseType: !574)
!574 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 453, size: 1088, elements: !575)
!575 = !{!576, !577, !578, !579, !580, !581, !582, !583, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "next_in", scope: !574, file: !4, line: 454, baseType: !81, size: 64)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "avail_in", scope: !574, file: !4, line: 455, baseType: !73, size: 64, offset: 64)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "total_in", scope: !574, file: !4, line: 456, baseType: !50, size: 64, offset: 128)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "next_out", scope: !574, file: !4, line: 458, baseType: !89, size: 64, offset: 192)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "avail_out", scope: !574, file: !4, line: 459, baseType: !73, size: 64, offset: 256)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "total_out", scope: !574, file: !4, line: 460, baseType: !50, size: 64, offset: 320)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !574, file: !4, line: 468, baseType: !64, size: 64, offset: 384)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !574, file: !4, line: 471, baseType: !584, size: 64, offset: 448)
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64)
!585 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_internal", file: !4, line: 411, baseType: !201)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr1", scope: !574, file: !4, line: 479, baseType: !72, size: 64, offset: 512)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr2", scope: !574, file: !4, line: 480, baseType: !72, size: 64, offset: 576)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr3", scope: !574, file: !4, line: 481, baseType: !72, size: 64, offset: 640)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr4", scope: !574, file: !4, line: 482, baseType: !72, size: 64, offset: 704)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int1", scope: !574, file: !4, line: 483, baseType: !50, size: 64, offset: 768)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int2", scope: !574, file: !4, line: 484, baseType: !50, size: 64, offset: 832)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int3", scope: !574, file: !4, line: 485, baseType: !73, size: 64, offset: 896)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int4", scope: !574, file: !4, line: 486, baseType: !73, size: 64, offset: 960)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum1", scope: !574, file: !4, line: 487, baseType: !151, size: 32, offset: 1024)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum2", scope: !574, file: !4, line: 488, baseType: !151, size: 32, offset: 1056)
!596 = !DILocalVariable(name: "strm", arg: 1, scope: !569, file: !1, line: 236, type: !572)
!597 = !DILocation(line: 236, column: 33, scope: !569)
!598 = !DILocalVariable(name: "block", arg: 2, scope: !569, file: !1, line: 236, type: !121)
!599 = !DILocation(line: 236, column: 51, scope: !569)
!600 = !DILocation(line: 238, column: 2, scope: !569)
!601 = !DILocation(line: 238, column: 2, scope: !602)
!602 = distinct !DILexicalBlock(scope: !569, file: !1, line: 238, column: 2)
!603 = !DILocalVariable(name: "ret_", scope: !604, file: !1, line: 238, type: !375)
!604 = distinct !DILexicalBlock(scope: !602, file: !1, line: 238, column: 2)
!605 = !DILocation(line: 238, column: 2, scope: !604)
!606 = !DILocation(line: 238, column: 2, scope: !607)
!607 = distinct !DILexicalBlock(scope: !604, file: !1, line: 238, column: 2)
!608 = !DILocalVariable(name: "ret_", scope: !602, file: !1, line: 238, type: !375)
!609 = !DILocation(line: 238, column: 2, scope: !610)
!610 = distinct !DILexicalBlock(scope: !602, file: !1, line: 238, column: 2)
!611 = !DILocation(line: 238, column: 2, scope: !612)
!612 = distinct !DILexicalBlock(scope: !610, file: !1, line: 238, column: 2)
!613 = !DILocation(line: 240, column: 2, scope: !569)
!614 = !DILocation(line: 240, column: 8, scope: !569)
!615 = !DILocation(line: 240, column: 18, scope: !569)
!616 = !DILocation(line: 240, column: 46, scope: !569)
!617 = !DILocation(line: 241, column: 2, scope: !569)
!618 = !DILocation(line: 241, column: 8, scope: !569)
!619 = !DILocation(line: 241, column: 18, scope: !569)
!620 = !DILocation(line: 241, column: 49, scope: !569)
!621 = !DILocation(line: 243, column: 2, scope: !569)
!622 = !DILocation(line: 244, column: 1, scope: !569)
!623 = distinct !DISubprogram(name: "update_size", scope: !1, file: !1, line: 52, type: !624, scopeLine: 53, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !229)
!624 = !DISubroutineType(types: !625)
!625 = !{!208, !626, !48, !48}
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!627 = !DILocalVariable(name: "size", arg: 1, scope: !623, file: !1, line: 52, type: !626)
!628 = !DILocation(line: 52, column: 23, scope: !623)
!629 = !DILocalVariable(name: "add", arg: 2, scope: !623, file: !1, line: 52, type: !48)
!630 = !DILocation(line: 52, column: 38, scope: !623)
!631 = !DILocalVariable(name: "limit", arg: 3, scope: !623, file: !1, line: 52, type: !48)
!632 = !DILocation(line: 52, column: 52, scope: !623)
!633 = !DILocation(line: 54, column: 6, scope: !634)
!634 = distinct !DILexicalBlock(scope: !623, file: !1, line: 54, column: 6)
!635 = !DILocation(line: 54, column: 12, scope: !634)
!636 = !DILocation(line: 54, column: 6, scope: !623)
!637 = !DILocation(line: 55, column: 9, scope: !634)
!638 = !DILocation(line: 55, column: 3, scope: !634)
!639 = !DILocation(line: 57, column: 6, scope: !640)
!640 = distinct !DILexicalBlock(scope: !623, file: !1, line: 57, column: 6)
!641 = !DILocation(line: 57, column: 15, scope: !640)
!642 = !DILocation(line: 57, column: 14, scope: !640)
!643 = !DILocation(line: 57, column: 12, scope: !640)
!644 = !DILocation(line: 57, column: 20, scope: !640)
!645 = !DILocation(line: 57, column: 23, scope: !640)
!646 = !DILocation(line: 57, column: 32, scope: !640)
!647 = !DILocation(line: 57, column: 31, scope: !640)
!648 = !DILocation(line: 57, column: 29, scope: !640)
!649 = !DILocation(line: 57, column: 39, scope: !640)
!650 = !DILocation(line: 57, column: 37, scope: !640)
!651 = !DILocation(line: 57, column: 6, scope: !623)
!652 = !DILocation(line: 58, column: 3, scope: !640)
!653 = !DILocation(line: 60, column: 11, scope: !623)
!654 = !DILocation(line: 60, column: 3, scope: !623)
!655 = !DILocation(line: 60, column: 8, scope: !623)
!656 = !DILocation(line: 62, column: 2, scope: !623)
