; ModuleID = 'liblzma/simple/x86.c'
source_filename = "liblzma/simple/x86.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.lzma_next_coder_s = type { i8*, i64, i64, i32 (i8*, %struct.lzma_allocator*, i8*, i64*, i64, i8*, i64*, i64, i32)*, void (i8*, %struct.lzma_allocator*)*, i32 (i8*)*, i32 (i8*, i64*, i64*, i64)*, i32 (i8*, %struct.lzma_allocator*, %struct.lzma_filter*, %struct.lzma_filter*)* }
%struct.lzma_filter = type { i64, i8* }
%struct.lzma_allocator = type { i8* (i8*, i64, i64)*, void (i8*, i8*)*, i8* }
%struct.lzma_filter_info_s = type { i64, {}*, i8* }
%struct.lzma_coder_s = type { %struct.lzma_next_coder_s, i8, i8, i64 (%struct.lzma_simple_s*, i32, i1, i8*, i64)*, %struct.lzma_simple_s*, i32, i64, i64, i64, i64, [0 x i8] }
%struct.lzma_simple_s = type { i32, i32 }

@x86_code.MASK_TO_ALLOWED_STATUS = internal constant [8 x i8] c"\01\01\01\00\01\00\00\00", align 1, !dbg !0
@x86_code.MASK_TO_BIT_NUMBER = internal constant [8 x i32] [i32 0, i32 1, i32 2, i32 2, i32 3, i32 3, i32 3, i32 3], align 16, !dbg !147

; Function Attrs: noinline nounwind uwtable
define dso_local i32 @lzma_simple_x86_encoder_init(%struct.lzma_next_coder_s* %next, %struct.lzma_allocator* %allocator, %struct.lzma_filter_info_s* %filters) #0 !dbg !160 {
entry:
  %next.addr = alloca %struct.lzma_next_coder_s*, align 8
  %allocator.addr = alloca %struct.lzma_allocator*, align 8

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "MASK_TO_ALLOWED_STATUS", scope: !2, file: !3, line: 30, type: !154, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "x86_code", scope: !3, file: !3, line: 27, type: !4, scopeLine: 29, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !26, retainedNodes: !153)
!3 = !DIFile(filename: "liblzma/simple/x86.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !DISubroutineType(types: !5)
!5 = !{!6, !9, !15, !21, !22, !6}
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !7, line: 46, baseType: !8)
!7 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!8 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_simple", file: !11, line: 19, baseType: !12)
!11 = !DIFile(filename: "liblzma/simple/simple_private.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!12 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_simple_s", file: !3, line: 20, size: 64, elements: !13)
!13 = !{!14, !20}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "prev_mask", scope: !12, file: !3, line: 21, baseType: !15, size: 32)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !16, line: 26, baseType: !17)
!16 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !18, line: 42, baseType: !19)
!18 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!19 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "prev_pos", scope: !12, file: !3, line: 22, baseType: !15, size: 32, offset: 32)
!21 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !16, line: 24, baseType: !24)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !18, line: 38, baseType: !25)
!25 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!26 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !27, retainedTypes: !56, globals: !146, splitDebugInlining: false, nameTableKind: None)
!27 = !{!28, !43, !49}
!28 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !29, line: 57, baseType: !19, size: 32, elements: !30)
!29 = !DIFile(filename: "liblzma/api/lzma/base.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!30 = !{!31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42}
!31 = !DIEnumerator(name: "LZMA_OK", value: 0, isUnsigned: true)
!32 = !DIEnumerator(name: "LZMA_STREAM_END", value: 1, isUnsigned: true)
!33 = !DIEnumerator(name: "LZMA_NO_CHECK", value: 2, isUnsigned: true)
!34 = !DIEnumerator(name: "LZMA_UNSUPPORTED_CHECK", value: 3, isUnsigned: true)
!35 = !DIEnumerator(name: "LZMA_GET_CHECK", value: 4, isUnsigned: true)
!36 = !DIEnumerator(name: "LZMA_MEM_ERROR", value: 5, isUnsigned: true)
!37 = !DIEnumerator(name: "LZMA_MEMLIMIT_ERROR", value: 6, isUnsigned: true)
!38 = !DIEnumerator(name: "LZMA_FORMAT_ERROR", value: 7, isUnsigned: true)
!39 = !DIEnumerator(name: "LZMA_OPTIONS_ERROR", value: 8, isUnsigned: true)
!40 = !DIEnumerator(name: "LZMA_DATA_ERROR", value: 9, isUnsigned: true)
!41 = !DIEnumerator(name: "LZMA_BUF_ERROR", value: 10, isUnsigned: true)
!42 = !DIEnumerator(name: "LZMA_PROG_ERROR", value: 11, isUnsigned: true)
!43 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !29, line: 250, baseType: !19, size: 32, elements: !44)
!44 = !{!45, !46, !47, !48}
!45 = !DIEnumerator(name: "LZMA_RUN", value: 0, isUnsigned: true)
!46 = !DIEnumerator(name: "LZMA_SYNC_FLUSH", value: 1, isUnsigned: true)
!47 = !DIEnumerator(name: "LZMA_FULL_FLUSH", value: 2, isUnsigned: true)
!48 = !DIEnumerator(name: "LZMA_FINISH", value: 3, isUnsigned: true)
!49 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !50, line: 27, baseType: !19, size: 32, elements: !51)
!50 = !DIFile(filename: "liblzma/api/lzma/check.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!51 = !{!52, !53, !54, !55}
!52 = !DIEnumerator(name: "LZMA_CHECK_NONE", value: 0, isUnsigned: true)
!53 = !DIEnumerator(name: "LZMA_CHECK_CRC32", value: 1, isUnsigned: true)
!54 = !DIEnumerator(name: "LZMA_CHECK_CRC64", value: 4, isUnsigned: true)
!55 = !DIEnumerator(name: "LZMA_CHECK_SHA256", value: 10, isUnsigned: true)
!56 = !{!57, !15, !23}
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!58 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_coder_s", file: !11, line: 21, size: 1024, elements: !59)
!59 = !{!60, !132, !133, !134, !136, !137, !138, !139, !140, !141, !142}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !58, file: !11, line: 23, baseType: !61, size: 512)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_next_coder", file: !62, line: 80, baseType: !63)
!62 = !DIFile(filename: "liblzma/common/common.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!63 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_next_coder_s", file: !62, line: 124, size: 512, elements: !64)
!64 = !{!65, !68, !73, !76, !103, !108, !115, !120}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "coder", scope: !63, file: !62, line: 126, baseType: !66, size: 64)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_coder", file: !62, line: 78, baseType: null)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !63, file: !62, line: 130, baseType: !69, size: 64, offset: 64)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_vli", file: !70, line: 63, baseType: !71)
!70 = !DIFile(filename: "liblzma/api/lzma/vli.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !16, line: 27, baseType: !72)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !18, line: 45, baseType: !8)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !63, file: !62, line: 136, baseType: !74, size: 64, offset: 128)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !75, line: 90, baseType: !8)
!75 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!76 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !63, file: !62, line: 139, baseType: !77, size: 64, offset: 192)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_code_function", file: !62, line: 94, baseType: !78)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!79 = !DISubroutineType(types: !80)
!80 = !{!81, !66, !82, !96, !99, !6, !101, !99, !6, !102}
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_ret", file: !29, line: 237, baseType: !28)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_allocator", file: !29, line: 403, baseType: !84)
!84 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !29, line: 341, size: 192, elements: !85)
!85 = !{!86, !91, !95}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !84, file: !29, line: 376, baseType: !87, size: 64)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!88 = !DISubroutineType(types: !89)
!89 = !{!90, !90, !6, !6}
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !84, file: !29, line: 390, baseType: !92, size: 64, offset: 64)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!93 = !DISubroutineType(types: !94)
!94 = !{null, !90, !90}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !84, file: !29, line: 401, baseType: !90, size: 64, offset: 128)
!96 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !97)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !23)
!99 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !100)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!101 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !22)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_action", file: !29, line: 322, baseType: !43)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !63, file: !62, line: 144, baseType: !104, size: 64, offset: 256)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_end_function", file: !62, line: 102, baseType: !105)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!106 = !DISubroutineType(types: !107)
!107 = !{null, !66, !82}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "get_check", scope: !63, file: !62, line: 148, baseType: !109, size: 64, offset: 320)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = !DISubroutineType(types: !111)
!111 = !{!112, !113}
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_check", file: !50, line: 55, baseType: !49)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !67)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "memconfig", scope: !63, file: !62, line: 152, baseType: !116, size: 64, offset: 384)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DISubroutineType(types: !118)
!118 = !{!81, !66, !119, !119, !71}
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !63, file: !62, line: 157, baseType: !121, size: 64, offset: 448)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DISubroutineType(types: !123)
!123 = !{!81, !66, !82, !124, !124}
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !126)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_filter", file: !127, line: 65, baseType: !128)
!127 = !DIFile(filename: "liblzma/api/lzma/filter.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !127, line: 43, size: 128, elements: !129)
!129 = !{!130, !131}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !128, file: !127, line: 54, baseType: !69, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !128, file: !127, line: 63, baseType: !90, size: 64, offset: 64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "end_was_reached", scope: !58, file: !11, line: 26, baseType: !21, size: 8, offset: 512)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "is_encoder", scope: !58, file: !11, line: 32, baseType: !21, size: 8, offset: 520)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !58, file: !11, line: 36, baseType: !135, size: 64, offset: 576)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "simple", scope: !58, file: !11, line: 41, baseType: !9, size: 64, offset: 640)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "now_pos", scope: !58, file: !11, line: 46, baseType: !15, size: 32, offset: 704)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "allocated", scope: !58, file: !11, line: 49, baseType: !6, size: 64, offset: 768)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !58, file: !11, line: 53, baseType: !6, size: 64, offset: 832)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "filtered", scope: !58, file: !11, line: 57, baseType: !6, size: 64, offset: 896)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !58, file: !11, line: 61, baseType: !6, size: 64, offset: 960)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !58, file: !11, line: 64, baseType: !143, offset: 1024)
!143 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, elements: !144)
!144 = !{!145}
!145 = !DISubrange(count: -1)
!146 = !{!0, !147}
!147 = !DIGlobalVariableExpression(var: !148, expr: !DIExpression())
!148 = distinct !DIGlobalVariable(name: "MASK_TO_BIT_NUMBER", scope: !2, file: !3, line: 33, type: !149, isLocal: true, isDefinition: true)
!149 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 256, elements: !151)
!150 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !15)
!151 = !{!152}
!152 = !DISubrange(count: 8)
!153 = !{}
!154 = !DICompositeType(tag: DW_TAG_array_type, baseType: !155, size: 64, elements: !151)
!155 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !21)
!156 = !{i32 7, !"Dwarf Version", i32 4}
!157 = !{i32 2, !"Debug Info Version", i32 3}
!158 = !{i32 1, !"wchar_size", i32 4}
!159 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!160 = distinct !DISubprogram(name: "lzma_simple_x86_encoder_init", scope: !3, file: !3, line: 142, type: !161, scopeLine: 144, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !26, retainedNodes: !153)
!161 = !DISubroutineType(types: !162)
!162 = !{!81, !163, !82, !164}
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!165 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !166)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_filter_info", file: !62, line: 82, baseType: !167)
!167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_filter_info_s", file: !62, line: 109, size: 192, elements: !168)
!168 = !{!169, !170, !173}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !167, file: !62, line: 112, baseType: !69, size: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !167, file: !62, line: 116, baseType: !171, size: 64, offset: 64)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_init_function", file: !62, line: 86, baseType: !172)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !167, file: !62, line: 119, baseType: !90, size: 64, offset: 128)
!174 = !DILocalVariable(name: "next", arg: 1, scope: !160, file: !3, line: 142, type: !163)
!175 = !DILocation(line: 142, column: 47, scope: !160)
!176 = !DILocalVariable(name: "allocator", arg: 2, scope: !160, file: !3, line: 142, type: !82)
!177 = !DILocation(line: 142, column: 69, scope: !160)
!178 = !DILocalVariable(name: "filters", arg: 3, scope: !160, file: !3, line: 143, type: !164)
!179 = !DILocation(line: 143, column: 27, scope: !160)
!180 = !DILocation(line: 145, column: 24, scope: !160)
!181 = !DILocation(line: 145, column: 30, scope: !160)
!182 = !DILocation(line: 145, column: 41, scope: !160)
!183 = !DILocation(line: 145, column: 9, scope: !160)
!184 = !DILocation(line: 145, column: 2, scope: !160)
!185 = distinct !DISubprogram(name: "x86_coder_init", scope: !3, file: !3, line: 126, type: !186, scopeLine: 128, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !26, retainedNodes: !153)
!186 = !DISubroutineType(types: !187)
!187 = !{!81, !163, !82, !164, !21}
!188 = !DILocalVariable(name: "next", arg: 1, scope: !185, file: !3, line: 126, type: !163)
!189 = !DILocation(line: 126, column: 33, scope: !185)
!190 = !DILocalVariable(name: "allocator", arg: 2, scope: !185, file: !3, line: 126, type: !82)
!191 = !DILocation(line: 126, column: 55, scope: !185)
!192 = !DILocalVariable(name: "filters", arg: 3, scope: !185, file: !3, line: 127, type: !164)
!193 = !DILocation(line: 127, column: 27, scope: !185)
!194 = !DILocalVariable(name: "is_encoder", arg: 4, scope: !185, file: !3, line: 127, type: !21)
!195 = !DILocation(line: 127, column: 41, scope: !185)
!196 = !DILocalVariable(name: "ret", scope: !185, file: !3, line: 129, type: !197)
!197 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !81)
!198 = !DILocation(line: 129, column: 17, scope: !185)
!199 = !DILocation(line: 129, column: 46, scope: !185)
!200 = !DILocation(line: 129, column: 52, scope: !185)
!201 = !DILocation(line: 129, column: 63, scope: !185)
!202 = !DILocation(line: 130, column: 42, scope: !185)
!203 = !DILocation(line: 129, column: 23, scope: !185)
!204 = !DILocation(line: 132, column: 6, scope: !205)
!205 = distinct !DILexicalBlock(scope: !185, file: !3, line: 132, column: 6)
!206 = !DILocation(line: 132, column: 10, scope: !205)
!207 = !DILocation(line: 132, column: 6, scope: !185)
!208 = !DILocation(line: 133, column: 26, scope: !209)
!209 = distinct !DILexicalBlock(scope: !205, file: !3, line: 132, column: 22)
!210 = !DILocation(line: 133, column: 32, scope: !209)
!211 = !DILocation(line: 133, column: 4, scope: !209)
!212 = !DILocation(line: 133, column: 40, scope: !209)
!213 = !DILocation(line: 133, column: 48, scope: !209)
!214 = !DILocation(line: 133, column: 58, scope: !209)
!215 = !DILocation(line: 134, column: 26, scope: !209)
!216 = !DILocation(line: 134, column: 32, scope: !209)
!217 = !DILocation(line: 134, column: 4, scope: !209)
!218 = !DILocation(line: 134, column: 40, scope: !209)
!219 = !DILocation(line: 134, column: 48, scope: !209)
!220 = !DILocation(line: 134, column: 57, scope: !209)
!221 = !DILocation(line: 135, column: 2, scope: !209)
!222 = !DILocation(line: 137, column: 9, scope: !185)
!223 = !DILocation(line: 137, column: 2, scope: !185)
!224 = distinct !DISubprogram(name: "lzma_simple_x86_decoder_init", scope: !3, file: !3, line: 150, type: !161, scopeLine: 152, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !26, retainedNodes: !153)
!225 = !DILocalVariable(name: "next", arg: 1, scope: !224, file: !3, line: 150, type: !163)
!226 = !DILocation(line: 150, column: 47, scope: !224)
!227 = !DILocalVariable(name: "allocator", arg: 2, scope: !224, file: !3, line: 150, type: !82)
!228 = !DILocation(line: 150, column: 69, scope: !224)
!229 = !DILocalVariable(name: "filters", arg: 3, scope: !224, file: !3, line: 151, type: !164)
!230 = !DILocation(line: 151, column: 27, scope: !224)
