; ModuleID = 'liblzma/lzma/lzma2_encoder.c'
source_filename = "liblzma/lzma/lzma2_encoder.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.lzma_next_coder_s = type { i8*, i64, i64, i32 (i8*, %struct.lzma_allocator*, i8*, i64*, i64, i8*, i64*, i64, i32)*, void (i8*, %struct.lzma_allocator*)*, i32 (i8*)*, i32 (i8*, i64*, i64*, i64)*, i32 (i8*, %struct.lzma_allocator*, %struct.lzma_filter*, %struct.lzma_filter*)* }
%struct.lzma_filter = type { i64, i8* }
%struct.lzma_allocator = type { i8* (i8*, i64, i64)*, void (i8*, i8*)*, i8* }
%struct.lzma_filter_info_s = type { i64, {}*, i8* }
%struct.lzma_lz_encoder = type { i8*, i32 (i8*, %struct.lzma_mf_s*, i8*, i64*, i64)*, void (i8*, %struct.lzma_allocator*)*, i32 (i8*, %struct.lzma_filter*)* }
%struct.lzma_mf_s = type { i8*, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32 (%struct.lzma_mf_s*, %struct.lzma_match*)*, void (%struct.lzma_mf_s*, i32)*, i32*, i32*, i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.lzma_match = type { i32, i32 }
%struct.lzma_lz_options = type { i64, i64, i64, i64, i64, i32, i32, i8*, i32 }
%struct.lzma_coder_s = type { i32, i8*, %struct.lzma_options_lzma, i8, i8, i8, i64, i64, i64, [65542 x i8] }
%struct.lzma_options_lzma = type { i32, i8*, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i8*, i8* }


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !116, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "liblzma/lzma/lzma2_encoder.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!2 = !{!3, !19, !25, !32, !37, !44, !47}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 57, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "liblzma/api/lzma/base.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18}
!7 = !DIEnumerator(name: "LZMA_OK", value: 0, isUnsigned: true)
!8 = !DIEnumerator(name: "LZMA_STREAM_END", value: 1, isUnsigned: true)
!9 = !DIEnumerator(name: "LZMA_NO_CHECK", value: 2, isUnsigned: true)
!10 = !DIEnumerator(name: "LZMA_UNSUPPORTED_CHECK", value: 3, isUnsigned: true)
!11 = !DIEnumerator(name: "LZMA_GET_CHECK", value: 4, isUnsigned: true)
!12 = !DIEnumerator(name: "LZMA_MEM_ERROR", value: 5, isUnsigned: true)
!13 = !DIEnumerator(name: "LZMA_MEMLIMIT_ERROR", value: 6, isUnsigned: true)
!14 = !DIEnumerator(name: "LZMA_FORMAT_ERROR", value: 7, isUnsigned: true)
!15 = !DIEnumerator(name: "LZMA_OPTIONS_ERROR", value: 8, isUnsigned: true)
!16 = !DIEnumerator(name: "LZMA_DATA_ERROR", value: 9, isUnsigned: true)
!17 = !DIEnumerator(name: "LZMA_BUF_ERROR", value: 10, isUnsigned: true)
!18 = !DIEnumerator(name: "LZMA_PROG_ERROR", value: 11, isUnsigned: true)
!19 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 250, baseType: !5, size: 32, elements: !20)
!20 = !{!21, !22, !23, !24}
!21 = !DIEnumerator(name: "LZMA_RUN", value: 0, isUnsigned: true)
!22 = !DIEnumerator(name: "LZMA_SYNC_FLUSH", value: 1, isUnsigned: true)
!23 = !DIEnumerator(name: "LZMA_FULL_FLUSH", value: 2, isUnsigned: true)
!24 = !DIEnumerator(name: "LZMA_FINISH", value: 3, isUnsigned: true)
!25 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !26, line: 27, baseType: !5, size: 32, elements: !27)
!26 = !DIFile(filename: "liblzma/api/lzma/check.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!27 = !{!28, !29, !30, !31}
!28 = !DIEnumerator(name: "LZMA_CHECK_NONE", value: 0, isUnsigned: true)
!29 = !DIEnumerator(name: "LZMA_CHECK_CRC32", value: 1, isUnsigned: true)
!30 = !DIEnumerator(name: "LZMA_CHECK_CRC64", value: 4, isUnsigned: true)
!31 = !DIEnumerator(name: "LZMA_CHECK_SHA256", value: 10, isUnsigned: true)
!32 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !33, line: 138, baseType: !5, size: 32, elements: !34)
!33 = !DIFile(filename: "liblzma/api/lzma/lzma.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!34 = !{!35, !36}
!35 = !DIEnumerator(name: "LZMA_MODE_FAST", value: 1, isUnsigned: true)
!36 = !DIEnumerator(name: "LZMA_MODE_NORMAL", value: 2, isUnsigned: true)
!37 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !33, line: 58, baseType: !5, size: 32, elements: !38)
!38 = !{!39, !40, !41, !42, !43}
!39 = !DIEnumerator(name: "LZMA_MF_HC3", value: 3, isUnsigned: true)
!40 = !DIEnumerator(name: "LZMA_MF_HC4", value: 4, isUnsigned: true)
!41 = !DIEnumerator(name: "LZMA_MF_BT2", value: 18, isUnsigned: true)
!42 = !DIEnumerator(name: "LZMA_MF_BT3", value: 19, isUnsigned: true)
!43 = !DIEnumerator(name: "LZMA_MF_BT4", value: 20, isUnsigned: true)
!44 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 44, baseType: !5, size: 32, elements: !45)
!45 = !{!46}
!46 = !DIEnumerator(name: "LZMA_RESERVED_ENUM", value: 0, isUnsigned: true)
!47 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !48, file: !1, line: 21, baseType: !5, size: 32, elements: !110)
!48 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_coder_s", file: !1, line: 20, size: 525632, elements: !49)
!49 = !{!50, !51, !55, !96, !98, !99, !100, !104, !105, !106}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !48, file: !1, line: 27, baseType: !47, size: 32)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "lzma", scope: !48, file: !1, line: 30, baseType: !52, size: 64, offset: 64)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_coder", file: !54, line: 78, baseType: null)
!54 = !DIFile(filename: "liblzma/common/common.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!55 = !DIDerivedType(tag: DW_TAG_member, name: "opt_cur", scope: !48, file: !1, line: 33, baseType: !56, size: 896, offset: 128)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_options_lzma", file: !33, line: 399, baseType: !57)
!57 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !33, line: 185, size: 896, elements: !58)
!58 = !{!59, !64, !70, !71, !72, !73, !74, !76, !77, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !90, !91, !92, !93, !95}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "dict_size", scope: !57, file: !33, line: 217, baseType: !60, size: 32)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !61, line: 26, baseType: !62)
!61 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !63, line: 42, baseType: !5)
!63 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!64 = !DIDerivedType(tag: DW_TAG_member, name: "preset_dict", scope: !57, file: !33, line: 240, baseType: !65, size: 64, offset: 64)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!66 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !67)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !61, line: 24, baseType: !68)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !63, line: 38, baseType: !69)
!69 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "preset_dict_size", scope: !57, file: !33, line: 254, baseType: !60, size: 32, offset: 128)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "lc", scope: !57, file: !33, line: 281, baseType: !60, size: 32, offset: 160)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "lp", scope: !57, file: !33, line: 293, baseType: !60, size: 32, offset: 192)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !57, file: !33, line: 316, baseType: !60, size: 32, offset: 224)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !57, file: !33, line: 322, baseType: !75, size: 32, offset: 256)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_mode", file: !33, line: 155, baseType: !32)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "nice_len", scope: !57, file: !33, line: 342, baseType: !60, size: 32, offset: 288)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "mf", scope: !57, file: !33, line: 345, baseType: !78, size: 32, offset: 320)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_match_finder", file: !33, line: 111, baseType: !37)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !57, file: !33, line: 375, baseType: !60, size: 32, offset: 352)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int1", scope: !57, file: !33, line: 384, baseType: !60, size: 32, offset: 384)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int2", scope: !57, file: !33, line: 385, baseType: !60, size: 32, offset: 416)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int3", scope: !57, file: !33, line: 386, baseType: !60, size: 32, offset: 448)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int4", scope: !57, file: !33, line: 387, baseType: !60, size: 32, offset: 480)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int5", scope: !57, file: !33, line: 388, baseType: !60, size: 32, offset: 512)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int6", scope: !57, file: !33, line: 389, baseType: !60, size: 32, offset: 544)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int7", scope: !57, file: !33, line: 390, baseType: !60, size: 32, offset: 576)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int8", scope: !57, file: !33, line: 391, baseType: !60, size: 32, offset: 608)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum1", scope: !57, file: !33, line: 392, baseType: !89, size: 32, offset: 640)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_reserved_enum", file: !4, line: 46, baseType: !44)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum2", scope: !57, file: !33, line: 393, baseType: !89, size: 32, offset: 672)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum3", scope: !57, file: !33, line: 394, baseType: !89, size: 32, offset: 704)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum4", scope: !57, file: !33, line: 395, baseType: !89, size: 32, offset: 736)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr1", scope: !57, file: !33, line: 396, baseType: !94, size: 64, offset: 768)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr2", scope: !57, file: !33, line: 397, baseType: !94, size: 64, offset: 832)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "need_properties", scope: !48, file: !1, line: 35, baseType: !97, size: 8, offset: 1024)
!97 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "need_state_reset", scope: !48, file: !1, line: 36, baseType: !97, size: 8, offset: 1032)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "need_dictionary_reset", scope: !48, file: !1, line: 37, baseType: !97, size: 8, offset: 1040)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "uncompressed_size", scope: !48, file: !1, line: 40, baseType: !101, size: 64, offset: 1088)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !102, line: 46, baseType: !103)
!102 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!103 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "compressed_size", scope: !48, file: !1, line: 44, baseType: !101, size: 64, offset: 1152)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "buf_pos", scope: !48, file: !1, line: 47, baseType: !101, size: 64, offset: 1216)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !48, file: !1, line: 50, baseType: !107, size: 524336, offset: 1280)
!107 = !DICompositeType(tag: DW_TAG_array_type, baseType: !67, size: 524336, elements: !108)
!108 = !{!109}
!109 = !DISubrange(count: 65542)
!110 = !{!111, !112, !113, !114, !115}
!111 = !DIEnumerator(name: "SEQ_INIT", value: 0, isUnsigned: true)
!112 = !DIEnumerator(name: "SEQ_LZMA_ENCODE", value: 1, isUnsigned: true)
!113 = !DIEnumerator(name: "SEQ_LZMA_COPY", value: 2, isUnsigned: true)
!114 = !DIEnumerator(name: "SEQ_UNCOMPRESSED_HEADER", value: 3, isUnsigned: true)
!115 = !DIEnumerator(name: "SEQ_UNCOMPRESSED_COPY", value: 4, isUnsigned: true)
!116 = !{!94, !117, !118}
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !56)
!120 = !{i32 7, !"Dwarf Version", i32 4}
!121 = !{i32 2, !"Debug Info Version", i32 3}
!122 = !{i32 1, !"wchar_size", i32 4}
!123 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!124 = distinct !DISubprogram(name: "lzma_lzma2_encoder_init", scope: !1, file: !1, line: 357, type: !125, scopeLine: 359, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !204)
!125 = !DISubroutineType(types: !126)
!126 = !{!127, !128, !146, !194}
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_ret", file: !4, line: 237, baseType: !3)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_next_coder", file: !54, line: 80, baseType: !130)
!130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_next_coder_s", file: !54, line: 124, size: 512, elements: !131)
!131 = !{!132, !133, !138, !141, !165, !170, !177, !182}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "coder", scope: !130, file: !54, line: 126, baseType: !52, size: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !130, file: !54, line: 130, baseType: !134, size: 64, offset: 64)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_vli", file: !135, line: 63, baseType: !136)
!135 = !DIFile(filename: "liblzma/api/lzma/vli.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !61, line: 27, baseType: !137)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !63, line: 45, baseType: !103)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !130, file: !54, line: 136, baseType: !139, size: 64, offset: 128)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !140, line: 90, baseType: !103)
!140 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!141 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !130, file: !54, line: 139, baseType: !142, size: 64, offset: 192)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_code_function", file: !54, line: 94, baseType: !143)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!144 = !DISubroutineType(types: !145)
!145 = !{!127, !52, !146, !159, !160, !101, !162, !160, !101, !164}
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_allocator", file: !4, line: 403, baseType: !148)
!148 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 341, size: 192, elements: !149)
!149 = !{!150, !154, !158}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !148, file: !4, line: 376, baseType: !151, size: 64)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!152 = !DISubroutineType(types: !153)
!153 = !{!94, !94, !101, !101}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !148, file: !4, line: 390, baseType: !155, size: 64, offset: 64)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!156 = !DISubroutineType(types: !157)
!157 = !{null, !94, !94}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !148, file: !4, line: 401, baseType: !94, size: 64, offset: 128)
!159 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !65)
!160 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !161)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!162 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !163)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_action", file: !4, line: 322, baseType: !19)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !130, file: !54, line: 144, baseType: !166, size: 64, offset: 256)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_end_function", file: !54, line: 102, baseType: !167)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = !DISubroutineType(types: !169)
!169 = !{null, !52, !146}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "get_check", scope: !130, file: !54, line: 148, baseType: !171, size: 64, offset: 320)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!172 = !DISubroutineType(types: !173)
!173 = !{!174, !175}
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_check", file: !26, line: 55, baseType: !25)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!176 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !53)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "memconfig", scope: !130, file: !54, line: 152, baseType: !178, size: 64, offset: 384)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = !DISubroutineType(types: !180)
!180 = !{!127, !52, !181, !181, !136}
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !130, file: !54, line: 157, baseType: !183, size: 64, offset: 448)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = !DISubroutineType(types: !185)
!185 = !{!127, !52, !146, !186, !186}
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!187 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !188)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_filter", file: !189, line: 65, baseType: !190)
!189 = !DIFile(filename: "liblzma/api/lzma/filter.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!190 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !189, line: 43, size: 128, elements: !191)
!191 = !{!192, !193}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !190, file: !189, line: 54, baseType: !134, size: 64)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !190, file: !189, line: 63, baseType: !94, size: 64, offset: 64)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !196)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_filter_info", file: !54, line: 82, baseType: !197)
!197 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_filter_info_s", file: !54, line: 109, size: 192, elements: !198)
!198 = !{!199, !200, !203}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !197, file: !54, line: 112, baseType: !134, size: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !197, file: !54, line: 116, baseType: !201, size: 64, offset: 64)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_init_function", file: !54, line: 86, baseType: !202)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !197, file: !54, line: 119, baseType: !94, size: 64, offset: 128)
!204 = !{}
!205 = !DILocalVariable(name: "next", arg: 1, scope: !124, file: !1, line: 357, type: !128)
!206 = !DILocation(line: 357, column: 42, scope: !124)
!207 = !DILocalVariable(name: "allocator", arg: 2, scope: !124, file: !1, line: 357, type: !146)
!208 = !DILocation(line: 357, column: 64, scope: !124)
!209 = !DILocalVariable(name: "filters", arg: 3, scope: !124, file: !1, line: 358, type: !194)
!210 = !DILocation(line: 358, column: 27, scope: !124)
!211 = !DILocation(line: 361, column: 4, scope: !124)
!212 = !DILocation(line: 361, column: 10, scope: !124)
!213 = !DILocation(line: 361, column: 21, scope: !124)
!214 = !DILocation(line: 360, column: 9, scope: !124)
!215 = !DILocation(line: 360, column: 2, scope: !124)
!216 = distinct !DISubprogram(name: "lzma2_encoder_init", scope: !1, file: !1, line: 312, type: !217, scopeLine: 314, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !204)
!217 = !DISubroutineType(types: !218)
!218 = !{!127, !219, !146, !276, !278}
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_lz_encoder", file: !221, line: 208, baseType: !222)
!221 = !DIFile(filename: "liblzma/lz/lz_encoder.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!222 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !221, line: 192, size: 256, elements: !223)
!223 = !{!224, !225, !271, !272}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "coder", scope: !222, file: !221, line: 194, baseType: !52, size: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !222, file: !221, line: 197, baseType: !226, size: 64, offset: 64)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!227 = !DISubroutineType(types: !228)
!228 = !{!127, !229, !230, !162, !160, !101}
!229 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !52)
!230 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !231)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_mf", file: !221, line: 28, baseType: !233)
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_mf_s", file: !221, line: 29, size: 960, elements: !234)
!234 = !{!235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !255, !259, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !233, file: !221, line: 35, baseType: !163, size: 64)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !233, file: !221, line: 39, baseType: !60, size: 32, offset: 64)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "keep_size_before", scope: !233, file: !221, line: 45, baseType: !60, size: 32, offset: 96)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "keep_size_after", scope: !233, file: !221, line: 51, baseType: !60, size: 32, offset: 128)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !233, file: !221, line: 58, baseType: !60, size: 32, offset: 160)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "read_pos", scope: !233, file: !221, line: 63, baseType: !60, size: 32, offset: 192)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "read_ahead", scope: !233, file: !221, line: 67, baseType: !60, size: 32, offset: 224)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "read_limit", scope: !233, file: !221, line: 75, baseType: !60, size: 32, offset: 256)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "write_pos", scope: !233, file: !221, line: 80, baseType: !60, size: 32, offset: 288)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !233, file: !221, line: 84, baseType: !60, size: 32, offset: 320)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "find", scope: !233, file: !221, line: 92, baseType: !246, size: 64, offset: 384)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = !DISubroutineType(types: !248)
!248 = !{!60, !231, !249}
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_match", file: !221, line: 25, baseType: !251)
!251 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !221, line: 22, size: 64, elements: !252)
!252 = !{!253, !254}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !251, file: !221, line: 23, baseType: !60, size: 32)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !251, file: !221, line: 24, baseType: !60, size: 32, offset: 32)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "skip", scope: !233, file: !221, line: 97, baseType: !256, size: 64, offset: 448)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!257 = !DISubroutineType(types: !258)
!258 = !{null, !231, !60}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !233, file: !221, line: 99, baseType: !260, size: 64, offset: 512)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "son", scope: !233, file: !221, line: 100, baseType: !260, size: 64, offset: 576)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_pos", scope: !233, file: !221, line: 101, baseType: !60, size: 32, offset: 640)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_size", scope: !233, file: !221, line: 102, baseType: !60, size: 32, offset: 672)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "hash_mask", scope: !233, file: !221, line: 103, baseType: !60, size: 32, offset: 704)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !233, file: !221, line: 106, baseType: !60, size: 32, offset: 736)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "nice_len", scope: !233, file: !221, line: 109, baseType: !60, size: 32, offset: 768)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "match_len_max", scope: !233, file: !221, line: 114, baseType: !60, size: 32, offset: 800)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !233, file: !221, line: 119, baseType: !164, size: 32, offset: 832)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "hash_size_sum", scope: !233, file: !221, line: 122, baseType: !60, size: 32, offset: 864)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "sons_count", scope: !233, file: !221, line: 125, baseType: !60, size: 32, offset: 896)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !222, file: !221, line: 202, baseType: !167, size: 64, offset: 128)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "options_update", scope: !222, file: !221, line: 205, baseType: !273, size: 64, offset: 192)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!274 = !DISubroutineType(types: !275)
!275 = !{!127, !52, !186}
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!277 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_lz_options", file: !221, line: 161, baseType: !280)
!280 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !221, line: 129, size: 512, elements: !281)
!281 = !{!282, !283, !284, !285, !286, !287, !288, !289, !290}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "before_size", scope: !280, file: !221, line: 132, baseType: !101, size: 64)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "dict_size", scope: !280, file: !221, line: 135, baseType: !101, size: 64, offset: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "after_size", scope: !280, file: !221, line: 139, baseType: !101, size: 64, offset: 128)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "match_len_max", scope: !280, file: !221, line: 144, baseType: !101, size: 64, offset: 192)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "nice_len", scope: !280, file: !221, line: 148, baseType: !101, size: 64, offset: 256)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "match_finder", scope: !280, file: !221, line: 151, baseType: !78, size: 32, offset: 320)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !280, file: !221, line: 154, baseType: !60, size: 32, offset: 352)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "preset_dict", scope: !280, file: !221, line: 157, baseType: !65, size: 64, offset: 384)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "preset_dict_size", scope: !280, file: !221, line: 159, baseType: !60, size: 32, offset: 448)
!291 = !DILocalVariable(name: "lz", arg: 1, scope: !216, file: !1, line: 312, type: !219)
!292 = !DILocation(line: 312, column: 37, scope: !216)
!293 = !DILocalVariable(name: "allocator", arg: 2, scope: !216, file: !1, line: 312, type: !146)
!294 = !DILocation(line: 312, column: 57, scope: !216)
!295 = !DILocalVariable(name: "options", arg: 3, scope: !216, file: !1, line: 313, type: !276)
!296 = !DILocation(line: 313, column: 15, scope: !216)
!297 = !DILocalVariable(name: "lz_options", arg: 4, scope: !216, file: !1, line: 313, type: !278)
!298 = !DILocation(line: 313, column: 41, scope: !216)
!299 = !DILocation(line: 315, column: 6, scope: !300)
!300 = distinct !DILexicalBlock(scope: !216, file: !1, line: 315, column: 6)
!301 = !DILocation(line: 315, column: 14, scope: !300)
!302 = !DILocation(line: 315, column: 6, scope: !216)
!303 = !DILocation(line: 316, column: 3, scope: !300)
!304 = !DILocation(line: 318, column: 6, scope: !305)
!305 = distinct !DILexicalBlock(scope: !216, file: !1, line: 318, column: 6)
!306 = !DILocation(line: 318, column: 10, scope: !305)
!307 = !DILocation(line: 318, column: 16, scope: !305)
!308 = !DILocation(line: 318, column: 6, scope: !216)
!309 = !DILocation(line: 319, column: 55, scope: !310)
!310 = distinct !DILexicalBlock(scope: !305, file: !1, line: 318, column: 25)
!311 = !DILocation(line: 319, column: 15, scope: !310)
!312 = !DILocation(line: 319, column: 3, scope: !310)
!313 = !DILocation(line: 319, column: 7, scope: !310)
!314 = !DILocation(line: 319, column: 13, scope: !310)
!315 = !DILocation(line: 320, column: 7, scope: !316)
!316 = distinct !DILexicalBlock(scope: !310, file: !1, line: 320, column: 7)
!317 = !DILocation(line: 320, column: 11, scope: !316)
!318 = !DILocation(line: 320, column: 17, scope: !316)
!319 = !DILocation(line: 320, column: 7, scope: !310)
!320 = !DILocation(line: 321, column: 4, scope: !316)
!321 = !DILocation(line: 323, column: 3, scope: !310)
!322 = !DILocation(line: 323, column: 7, scope: !310)
!323 = !DILocation(line: 323, column: 12, scope: !310)
!324 = !DILocation(line: 324, column: 3, scope: !310)
!325 = !DILocation(line: 324, column: 7, scope: !310)
!326 = !DILocation(line: 324, column: 11, scope: !310)
!327 = !DILocation(line: 325, column: 3, scope: !310)
!328 = !DILocation(line: 325, column: 7, scope: !310)
!329 = !DILocation(line: 325, column: 22, scope: !310)
!330 = !DILocation(line: 327, column: 26, scope: !310)
!331 = !DILocation(line: 327, column: 30, scope: !310)
!332 = !DILocation(line: 327, column: 4, scope: !310)
!333 = !DILocation(line: 327, column: 38, scope: !310)
!334 = !DILocation(line: 327, column: 43, scope: !310)
!335 = !DILocation(line: 328, column: 2, scope: !310)
!336 = !DILocation(line: 330, column: 25, scope: !216)
!337 = !DILocation(line: 330, column: 29, scope: !216)
!338 = !DILocation(line: 330, column: 3, scope: !216)
!339 = !DILocation(line: 330, column: 37, scope: !216)
!340 = !DILocation(line: 330, column: 76, scope: !216)
!341 = !DILocation(line: 330, column: 48, scope: !216)
!342 = !DILocation(line: 330, column: 47, scope: !216)
!343 = !DILocation(line: 332, column: 25, scope: !216)
!344 = !DILocation(line: 332, column: 29, scope: !216)
!345 = !DILocation(line: 332, column: 3, scope: !216)
!346 = !DILocation(line: 332, column: 37, scope: !216)
!347 = !DILocation(line: 332, column: 46, scope: !216)
!348 = !DILocation(line: 333, column: 25, scope: !216)
!349 = !DILocation(line: 333, column: 29, scope: !216)
!350 = !DILocation(line: 333, column: 3, scope: !216)
!351 = !DILocation(line: 333, column: 37, scope: !216)
!352 = !DILocation(line: 333, column: 53, scope: !216)
!353 = !DILocation(line: 334, column: 25, scope: !216)
!354 = !DILocation(line: 334, column: 29, scope: !216)
!355 = !DILocation(line: 334, column: 3, scope: !216)
!356 = !DILocation(line: 334, column: 37, scope: !216)
