; ModuleID = 'liblzma/simple/ia64.c'
source_filename = "liblzma/simple/ia64.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.lzma_next_coder_s = type { i8*, i64, i64, i32 (i8*, %struct.lzma_allocator*, i8*, i64*, i64, i8*, i64*, i64, i32)*, void (i8*, %struct.lzma_allocator*)*, i32 (i8*)*, i32 (i8*, i64*, i64*, i64)*, i32 (i8*, %struct.lzma_allocator*, %struct.lzma_filter*, %struct.lzma_filter*)* }
%struct.lzma_filter = type { i64, i8* }
%struct.lzma_allocator = type { i8* (i8*, i64, i64)*, void (i8*, i8*)*, i8* }
%struct.lzma_filter_info_s = type { i64, {}*, i8* }
%struct.lzma_simple_s = type opaque

@ia64_code.BRANCH_TABLE = internal constant [32 x i32] [i32 0, i32 0, i32 0, i32 0, i32 0, i32 0, i32 0, i32 0, i32 0, i32 0, i32 0, i32 0, i32 0, i32 0, i32 0, i32 0, i32 4, i32 4, i32 6, i32 6, i32 0, i32 0, i32 7, i32 7, i32 4, i32 4, i32 0, i32 0, i32 4, i32 4, i32 0, i32 0], align 16, !dbg !0

; Function Attrs: noinline nounwind uwtable
define dso_local i32 @lzma_simple_ia64_encoder_init(%struct.lzma_next_coder_s* %next, %struct.lzma_allocator* %allocator, %struct.lzma_filter_info_s* %filters) #0 !dbg !66 {
entry:
  %next.addr = alloca %struct.lzma_next_coder_s*, align 8
  %allocator.addr = alloca %struct.lzma_allocator*, align 8
  %filters.addr = alloca %struct.lzma_filter_info_s*, align 8

!7 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!8 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_simple", file: !11, line: 19, baseType: !12)
!11 = !DIFile(filename: "liblzma/simple/simple_private.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!12 = !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_simple_s", file: !11, line: 19, flags: DIFlagFwdDecl)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !14, line: 26, baseType: !15)
!14 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !16, line: 42, baseType: !17)
!16 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!17 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!18 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !14, line: 24, baseType: !21)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !16, line: 38, baseType: !22)
!22 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!23 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !24, retainedTypes: !53, globals: !56, splitDebugInlining: false, nameTableKind: None)
!24 = !{!25, !40, !46}
!25 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !26, line: 57, baseType: !17, size: 32, elements: !27)
!26 = !DIFile(filename: "liblzma/api/lzma/base.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!27 = !{!28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39}
!28 = !DIEnumerator(name: "LZMA_OK", value: 0, isUnsigned: true)
!29 = !DIEnumerator(name: "LZMA_STREAM_END", value: 1, isUnsigned: true)
!30 = !DIEnumerator(name: "LZMA_NO_CHECK", value: 2, isUnsigned: true)
!31 = !DIEnumerator(name: "LZMA_UNSUPPORTED_CHECK", value: 3, isUnsigned: true)
!32 = !DIEnumerator(name: "LZMA_GET_CHECK", value: 4, isUnsigned: true)
!33 = !DIEnumerator(name: "LZMA_MEM_ERROR", value: 5, isUnsigned: true)
!34 = !DIEnumerator(name: "LZMA_MEMLIMIT_ERROR", value: 6, isUnsigned: true)
!35 = !DIEnumerator(name: "LZMA_FORMAT_ERROR", value: 7, isUnsigned: true)
!36 = !DIEnumerator(name: "LZMA_OPTIONS_ERROR", value: 8, isUnsigned: true)
!37 = !DIEnumerator(name: "LZMA_DATA_ERROR", value: 9, isUnsigned: true)
!38 = !DIEnumerator(name: "LZMA_BUF_ERROR", value: 10, isUnsigned: true)
!39 = !DIEnumerator(name: "LZMA_PROG_ERROR", value: 11, isUnsigned: true)
!40 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !26, line: 250, baseType: !17, size: 32, elements: !41)
!41 = !{!42, !43, !44, !45}
!42 = !DIEnumerator(name: "LZMA_RUN", value: 0, isUnsigned: true)
!43 = !DIEnumerator(name: "LZMA_SYNC_FLUSH", value: 1, isUnsigned: true)
!44 = !DIEnumerator(name: "LZMA_FULL_FLUSH", value: 2, isUnsigned: true)
!45 = !DIEnumerator(name: "LZMA_FINISH", value: 3, isUnsigned: true)
!46 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !47, line: 27, baseType: !17, size: 32, elements: !48)
!47 = !DIFile(filename: "liblzma/api/lzma/check.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!48 = !{!49, !50, !51, !52}
!49 = !DIEnumerator(name: "LZMA_CHECK_NONE", value: 0, isUnsigned: true)
!50 = !DIEnumerator(name: "LZMA_CHECK_CRC32", value: 1, isUnsigned: true)
!51 = !DIEnumerator(name: "LZMA_CHECK_CRC64", value: 4, isUnsigned: true)
!52 = !DIEnumerator(name: "LZMA_CHECK_SHA256", value: 10, isUnsigned: true)
!53 = !{!54, !13, !20}
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !14, line: 27, baseType: !55)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !16, line: 45, baseType: !8)
!56 = !{!0}
!57 = !{}
!58 = !DICompositeType(tag: DW_TAG_array_type, baseType: !59, size: 1024, elements: !60)
!59 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!60 = !{!61}
!61 = !DISubrange(count: 32)
!62 = !{i32 7, !"Dwarf Version", i32 4}
!63 = !{i32 2, !"Debug Info Version", i32 3}
!64 = !{i32 1, !"wchar_size", i32 4}
!65 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!66 = distinct !DISubprogram(name: "lzma_simple_ia64_encoder_init", scope: !3, file: !3, line: 98, type: !67, scopeLine: 100, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !23, retainedNodes: !57)
!67 = !DISubroutineType(types: !68)
!68 = !{!69, !70, !89, !139}
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_ret", file: !26, line: 237, baseType: !25)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_next_coder", file: !72, line: 80, baseType: !73)
!72 = !DIFile(filename: "liblzma/common/common.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!73 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_next_coder_s", file: !72, line: 124, size: 512, elements: !74)
!74 = !{!75, !78, !81, !84, !110, !115, !122, !127}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "coder", scope: !73, file: !72, line: 126, baseType: !76, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_coder", file: !72, line: 78, baseType: null)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !73, file: !72, line: 130, baseType: !79, size: 64, offset: 64)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_vli", file: !80, line: 63, baseType: !54)
!80 = !DIFile(filename: "liblzma/api/lzma/vli.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!81 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !73, file: !72, line: 136, baseType: !82, size: 64, offset: 128)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !83, line: 90, baseType: !8)
!83 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!84 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !73, file: !72, line: 139, baseType: !85, size: 64, offset: 192)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_code_function", file: !72, line: 94, baseType: !86)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = !DISubroutineType(types: !88)
!88 = !{!69, !76, !89, !103, !106, !6, !108, !106, !6, !109}
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_allocator", file: !26, line: 403, baseType: !91)
!91 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !26, line: 341, size: 192, elements: !92)
!92 = !{!93, !98, !102}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !91, file: !26, line: 376, baseType: !94, size: 64)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = !DISubroutineType(types: !96)
!96 = !{!97, !97, !6, !6}
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !91, file: !26, line: 390, baseType: !99, size: 64, offset: 64)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = !DISubroutineType(types: !101)
!101 = !{null, !97, !97}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !91, file: !26, line: 401, baseType: !97, size: 64, offset: 128)
!103 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !104)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !20)
!106 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !107)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !19)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_action", file: !26, line: 322, baseType: !40)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !73, file: !72, line: 144, baseType: !111, size: 64, offset: 256)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_end_function", file: !72, line: 102, baseType: !112)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = !DISubroutineType(types: !114)
!114 = !{null, !76, !89}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "get_check", scope: !73, file: !72, line: 148, baseType: !116, size: 64, offset: 320)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DISubroutineType(types: !118)
!118 = !{!119, !120}
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_check", file: !47, line: 55, baseType: !46)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !77)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "memconfig", scope: !73, file: !72, line: 152, baseType: !123, size: 64, offset: 384)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = !DISubroutineType(types: !125)
!125 = !{!69, !76, !126, !126, !54}
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !73, file: !72, line: 157, baseType: !128, size: 64, offset: 448)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = !DISubroutineType(types: !130)
!130 = !{!69, !76, !89, !131, !131}
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !133)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_filter", file: !134, line: 65, baseType: !135)
!134 = !DIFile(filename: "liblzma/api/lzma/filter.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!135 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !134, line: 43, size: 128, elements: !136)
!136 = !{!137, !138}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !135, file: !134, line: 54, baseType: !79, size: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !135, file: !134, line: 63, baseType: !97, size: 64, offset: 64)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!140 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !141)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_filter_info", file: !72, line: 82, baseType: !142)
!142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_filter_info_s", file: !72, line: 109, size: 192, elements: !143)
!143 = !{!144, !145, !148}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !142, file: !72, line: 112, baseType: !79, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !142, file: !72, line: 116, baseType: !146, size: 64, offset: 64)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_init_function", file: !72, line: 86, baseType: !147)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !142, file: !72, line: 119, baseType: !97, size: 64, offset: 128)
!149 = !DILocalVariable(name: "next", arg: 1, scope: !66, file: !3, line: 98, type: !70)
!150 = !DILocation(line: 98, column: 48, scope: !66)
!151 = !DILocalVariable(name: "allocator", arg: 2, scope: !66, file: !3, line: 99, type: !89)
!152 = !DILocation(line: 99, column: 19, scope: !66)
!153 = !DILocalVariable(name: "filters", arg: 3, scope: !66, file: !3, line: 99, type: !139)
!154 = !DILocation(line: 99, column: 54, scope: !66)
!155 = !DILocation(line: 101, column: 25, scope: !66)
!156 = !DILocation(line: 101, column: 31, scope: !66)
!157 = !DILocation(line: 101, column: 42, scope: !66)
!158 = !DILocation(line: 101, column: 9, scope: !66)
!159 = !DILocation(line: 101, column: 2, scope: !66)
!160 = distinct !DISubprogram(name: "ia64_coder_init", scope: !3, file: !3, line: 89, type: !161, scopeLine: 91, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !23, retainedNodes: !57)
!161 = !DISubroutineType(types: !162)
!162 = !{!69, !70, !89, !139, !18}
!163 = !DILocalVariable(name: "next", arg: 1, scope: !160, file: !3, line: 89, type: !70)
!164 = !DILocation(line: 89, column: 34, scope: !160)
!165 = !DILocalVariable(name: "allocator", arg: 2, scope: !160, file: !3, line: 89, type: !89)
!166 = !DILocation(line: 89, column: 56, scope: !160)
!167 = !DILocalVariable(name: "filters", arg: 3, scope: !160, file: !3, line: 90, type: !139)
!168 = !DILocation(line: 90, column: 27, scope: !160)
!169 = !DILocalVariable(name: "is_encoder", arg: 4, scope: !160, file: !3, line: 90, type: !18)
!170 = !DILocation(line: 90, column: 41, scope: !160)
!171 = !DILocation(line: 92, column: 32, scope: !160)
!172 = !DILocation(line: 92, column: 38, scope: !160)
!173 = !DILocation(line: 92, column: 49, scope: !160)
!174 = !DILocation(line: 93, column: 27, scope: !160)
!175 = !DILocation(line: 92, column: 9, scope: !160)
!176 = !DILocation(line: 92, column: 2, scope: !160)
!177 = distinct !DISubprogram(name: "lzma_simple_ia64_decoder_init", scope: !3, file: !3, line: 106, type: !67, scopeLine: 108, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !23, retainedNodes: !57)
!178 = !DILocalVariable(name: "next", arg: 1, scope: !177, file: !3, line: 106, type: !70)
!179 = !DILocation(line: 106, column: 48, scope: !177)
!180 = !DILocalVariable(name: "allocator", arg: 2, scope: !177, file: !3, line: 107, type: !89)
!181 = !DILocation(line: 107, column: 19, scope: !177)
!182 = !DILocalVariable(name: "filters", arg: 3, scope: !177, file: !3, line: 107, type: !139)
!183 = !DILocation(line: 107, column: 54, scope: !177)
!184 = !DILocation(line: 109, column: 25, scope: !177)
!185 = !DILocation(line: 109, column: 31, scope: !177)
!186 = !DILocation(line: 109, column: 42, scope: !177)
!187 = !DILocation(line: 109, column: 9, scope: !177)
!188 = !DILocation(line: 109, column: 2, scope: !177)
!189 = !DILocalVariable(name: "simple", arg: 1, scope: !2, file: !3, line: 18, type: !9)
!190 = !DILocation(line: 18, column: 24, scope: !2)
!191 = !DILocalVariable(name: "now_pos", arg: 2, scope: !2, file: !3, line: 19, type: !13)
!192 = !DILocation(line: 19, column: 12, scope: !2)
!193 = !DILocalVariable(name: "is_encoder", arg: 3, scope: !2, file: !3, line: 19, type: !18)
!194 = !DILocation(line: 19, column: 26, scope: !2)
!195 = !DILocalVariable(name: "buffer", arg: 4, scope: !2, file: !3, line: 20, type: !19)
!196 = !DILocation(line: 20, column: 12, scope: !2)
!197 = !DILocalVariable(name: "size", arg: 5, scope: !2, file: !3, line: 20, type: !6)
!198 = !DILocation(line: 20, column: 27, scope: !2)
!199 = !DILocalVariable(name: "i", scope: !2, file: !3, line: 29, type: !6)
!200 = !DILocation(line: 29, column: 9, scope: !2)
!201 = !DILocation(line: 30, column: 9, scope: !202)
!202 = distinct !DILexicalBlock(scope: !2, file: !3, line: 30, column: 2)
!203 = !DILocation(line: 30, column: 7, scope: !202)
