; ModuleID = 'liblzma/common/stream_flags_decoder.c'
source_filename = "liblzma/common/stream_flags_decoder.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.lzma_stream_flags = type { i32, i64, i32, i32, i32, i32, i32, i8, i8, i8, i8, i8, i8, i8, i8, i32, i32 }

@lzma_header_magic = external dso_local constant [6 x i8], align 1
@lzma_footer_magic = external dso_local constant [2 x i8], align 1

; Function Attrs: noinline nounwind uwtable
define dso_local i32 @lzma_stream_header_decode(%struct.lzma_stream_flags* %options, i8* %in) #0 !dbg !38 {
entry:
  %retval = alloca i32, align 4
  %options.addr = alloca %struct.lzma_stream_flags*, align 8
  %in.addr = alloca i8*, align 8
  %crc = alloca i32, align 4
  store %struct.lzma_stream_flags* %options, %struct.lzma_stream_flags** %options.addr, align 8
  call void @llvm.dbg.declare(metadata %struct.lzma_stream_flags** %options.addr, metadata !78, metadata !DIExpression()), !dbg !79
  store i8* %in, i8** %in.addr, align 8
  call void @llvm.dbg.declare(metadata i8** %in.addr, metadata !80, metadata !DIExpression()), !dbg !81
  %0 = load i8*, i8** %in.addr, align 8, !dbg !82
  %call = call i32 @memcmp(i8* %0, i8* getelementptr inbounds ([6 x i8], [6 x i8]* @lzma_header_magic, i64 0, i64 0), i64 6) #4, !dbg !84
  %cmp = icmp ne i32 %call, 0, !dbg !85
  br i1 %cmp, label %if.then, label %if.end, !dbg !86


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !29, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "liblzma/common/stream_flags_decoder.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!2 = !{!3, !19, !26}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 57, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "liblzma/api/lzma/base.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18}
!7 = !DIEnumerator(name: "LZMA_OK", value: 0, isUnsigned: true)
!8 = !DIEnumerator(name: "LZMA_STREAM_END", value: 1, isUnsigned: true)
!9 = !DIEnumerator(name: "LZMA_NO_CHECK", value: 2, isUnsigned: true)
!10 = !DIEnumerator(name: "LZMA_UNSUPPORTED_CHECK", value: 3, isUnsigned: true)
!11 = !DIEnumerator(name: "LZMA_GET_CHECK", value: 4, isUnsigned: true)
!12 = !DIEnumerator(name: "LZMA_MEM_ERROR", value: 5, isUnsigned: true)
!13 = !DIEnumerator(name: "LZMA_MEMLIMIT_ERROR", value: 6, isUnsigned: true)
!14 = !DIEnumerator(name: "LZMA_FORMAT_ERROR", value: 7, isUnsigned: true)
!15 = !DIEnumerator(name: "LZMA_OPTIONS_ERROR", value: 8, isUnsigned: true)
!16 = !DIEnumerator(name: "LZMA_DATA_ERROR", value: 9, isUnsigned: true)
!17 = !DIEnumerator(name: "LZMA_BUF_ERROR", value: 10, isUnsigned: true)
!18 = !DIEnumerator(name: "LZMA_PROG_ERROR", value: 11, isUnsigned: true)
!19 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !20, line: 27, baseType: !5, size: 32, elements: !21)
!20 = !DIFile(filename: "liblzma/api/lzma/check.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!21 = !{!22, !23, !24, !25}
!22 = !DIEnumerator(name: "LZMA_CHECK_NONE", value: 0, isUnsigned: true)
!23 = !DIEnumerator(name: "LZMA_CHECK_CRC32", value: 1, isUnsigned: true)
!24 = !DIEnumerator(name: "LZMA_CHECK_CRC64", value: 4, isUnsigned: true)
!25 = !DIEnumerator(name: "LZMA_CHECK_SHA256", value: 10, isUnsigned: true)
!26 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 44, baseType: !5, size: 32, elements: !27)
!27 = !{!28}
!28 = !DIEnumerator(name: "LZMA_RESERVED_ENUM", value: 0, isUnsigned: true)
!29 = !{!30}
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !31, line: 26, baseType: !32)
!31 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !33, line: 42, baseType: !5)
!33 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!34 = !{i32 7, !"Dwarf Version", i32 4}
!35 = !{i32 2, !"Debug Info Version", i32 3}
!36 = !{i32 1, !"wchar_size", i32 4}
!37 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!38 = distinct !DISubprogram(name: "lzma_stream_header_decode", scope: !1, file: !1, line: 31, type: !39, scopeLine: 32, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !77)
!39 = !DISubroutineType(types: !40)
!40 = !{!41, !42, !73}
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_ret", file: !4, line: 237, baseType: !3)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_stream_flags", file: !44, line: 105, baseType: !45)
!44 = !DIFile(filename: "liblzma/api/lzma/stream_flags.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!45 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !44, line: 33, size: 448, elements: !46)
!46 = !{!47, !48, !54, !56, !58, !59, !60, !61, !64, !65, !66, !67, !68, !69, !70, !71, !72}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !45, file: !44, line: 51, baseType: !30, size: 32)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "backward_size", scope: !45, file: !44, line: 69, baseType: !49, size: 64, offset: 64)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_vli", file: !50, line: 63, baseType: !51)
!50 = !DIFile(filename: "liblzma/api/lzma/vli.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !31, line: 27, baseType: !52)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !33, line: 45, baseType: !53)
!53 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !45, file: !44, line: 79, baseType: !55, size: 32, offset: 128)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_check", file: !20, line: 55, baseType: !19)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum1", scope: !45, file: !44, line: 90, baseType: !57, size: 32, offset: 160)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_reserved_enum", file: !4, line: 46, baseType: !26)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum2", scope: !45, file: !44, line: 91, baseType: !57, size: 32, offset: 192)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum3", scope: !45, file: !44, line: 92, baseType: !57, size: 32, offset: 224)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum4", scope: !45, file: !44, line: 93, baseType: !57, size: 32, offset: 256)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool1", scope: !45, file: !44, line: 94, baseType: !62, size: 8, offset: 288)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_bool", file: !4, line: 29, baseType: !63)
!63 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool2", scope: !45, file: !44, line: 95, baseType: !62, size: 8, offset: 296)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool3", scope: !45, file: !44, line: 96, baseType: !62, size: 8, offset: 304)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool4", scope: !45, file: !44, line: 97, baseType: !62, size: 8, offset: 312)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool5", scope: !45, file: !44, line: 98, baseType: !62, size: 8, offset: 320)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool6", scope: !45, file: !44, line: 99, baseType: !62, size: 8, offset: 328)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool7", scope: !45, file: !44, line: 100, baseType: !62, size: 8, offset: 336)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool8", scope: !45, file: !44, line: 101, baseType: !62, size: 8, offset: 344)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int1", scope: !45, file: !44, line: 102, baseType: !30, size: 32, offset: 352)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int2", scope: !45, file: !44, line: 103, baseType: !30, size: 32, offset: 384)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !75)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !31, line: 24, baseType: !76)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !33, line: 38, baseType: !63)
!77 = !{}
!78 = !DILocalVariable(name: "options", arg: 1, scope: !38, file: !1, line: 31, type: !42)
!79 = !DILocation(line: 31, column: 46, scope: !38)
!80 = !DILocalVariable(name: "in", arg: 2, scope: !38, file: !1, line: 31, type: !73)
!81 = !DILocation(line: 31, column: 70, scope: !38)
!82 = !DILocation(line: 34, column: 13, scope: !83)
!83 = distinct !DILexicalBlock(scope: !38, file: !1, line: 34, column: 6)
!84 = !DILocation(line: 34, column: 6, scope: !83)
!85 = !DILocation(line: 34, column: 63, scope: !83)
!86 = !DILocation(line: 34, column: 6, scope: !38)
!87 = !DILocation(line: 35, column: 3, scope: !83)
!88 = !DILocalVariable(name: "crc", scope: !38, file: !1, line: 39, type: !89)
!89 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !30)
!90 = !DILocation(line: 39, column: 17, scope: !38)
!91 = !DILocation(line: 39, column: 34, scope: !38)
!92 = !DILocation(line: 39, column: 37, scope: !38)
!93 = !DILocation(line: 39, column: 23, scope: !38)
!94 = !DILocation(line: 41, column: 6, scope: !95)
!95 = distinct !DILexicalBlock(scope: !38, file: !1, line: 41, column: 6)
!96 = !DILocation(line: 41, column: 32, scope: !95)
!97 = !DILocation(line: 41, column: 35, scope: !95)
!98 = !DILocation(line: 42, column: 4, scope: !95)
!99 = !DILocation(line: 41, column: 13, scope: !95)
!100 = !DILocation(line: 41, column: 10, scope: !95)
!101 = !DILocation(line: 41, column: 6, scope: !38)
!102 = !DILocation(line: 43, column: 3, scope: !95)
!103 = !DILocation(line: 46, column: 26, scope: !104)
!104 = distinct !DILexicalBlock(scope: !38, file: !1, line: 46, column: 6)
!105 = !DILocation(line: 46, column: 35, scope: !104)
!106 = !DILocation(line: 46, column: 38, scope: !104)
!107 = !DILocation(line: 46, column: 6, scope: !104)
!108 = !DILocation(line: 46, column: 6, scope: !38)
!109 = !DILocation(line: 47, column: 3, scope: !104)
!110 = !DILocation(line: 53, column: 2, scope: !38)
!111 = !DILocation(line: 53, column: 11, scope: !38)
!112 = !DILocation(line: 53, column: 25, scope: !38)
!113 = !DILocation(line: 55, column: 2, scope: !38)
!114 = !DILocation(line: 56, column: 1, scope: !38)
!115 = distinct !DISubprogram(name: "unaligned_read32le", scope: !116, file: !116, line: 311, type: !117, scopeLine: 312, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !77)
!116 = !DIFile(filename: "common/tuklib_integer.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!117 = !DISubroutineType(types: !118)
!118 = !{!30, !73}
!119 = !DILocalVariable(name: "buf", arg: 1, scope: !115, file: !116, line: 311, type: !73)
!120 = !DILocation(line: 311, column: 35, scope: !115)
!121 = !DILocalVariable(name: "num", scope: !115, file: !116, line: 313, type: !30)
!122 = !DILocation(line: 313, column: 11, scope: !115)
!123 = !DILocation(line: 313, column: 27, scope: !115)
!124 = !DILocation(line: 313, column: 17, scope: !115)
!125 = !DILocation(line: 314, column: 19, scope: !115)
!126 = !DILocation(line: 314, column: 9, scope: !115)
!127 = !DILocation(line: 314, column: 26, scope: !115)
!128 = !DILocation(line: 314, column: 6, scope: !115)
!129 = !DILocation(line: 315, column: 19, scope: !115)
!130 = !DILocation(line: 315, column: 9, scope: !115)
!131 = !DILocation(line: 315, column: 26, scope: !115)
!132 = !DILocation(line: 315, column: 6, scope: !115)
!133 = !DILocation(line: 316, column: 19, scope: !115)
!134 = !DILocation(line: 316, column: 9, scope: !115)
