; ModuleID = 'xz/options.c'
source_filename = "xz/options.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.option_map = type { i8*, %struct.name_id_map*, i64, i64 }
%struct.name_id_map = type { i8*, i64 }
%struct.lzma_options_delta = type { i32, i32, i32, i32, i32, i32, i8*, i8* }
%struct.lzma_options_bcj = type { i32 }
%struct.lzma_options_lzma = type { i32, i8*, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i8*, i8* }

@options_delta.opts = internal constant [2 x %struct.option_map] [%struct.option_map { i8* getelementptr inbounds ([5 x i8], [5 x i8]* @.str, i32 0, i32 0), %struct.name_id_map* null, i64 1, i64 256 }, %struct.option_map zeroinitializer], align 16, !dbg !0
@.str = private unnamed_addr constant [5 x i8] c"dist\00", align 1
@options_bcj.opts = internal constant [2 x %struct.option_map] [%struct.option_map { i8* getelementptr inbounds ([6 x i8], [6 x i8]* @.str.1, i32 0, i32 0), %struct.name_id_map* null, i64 0, i64 4294967295 }, %struct.option_map zeroinitializer], align 16, !dbg !52
@.str.1 = private unnamed_addr constant [6 x i8] c"start\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "opts", scope: !2, file: !3, line: 167, type: !64, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "options_delta", scope: !3, file: !3, line: 165, type: !4, scopeLine: 166, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !32, retainedNodes: !63)
!3 = !DIFile(filename: "xz/options.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !DISubroutineType(types: !5)
!5 = !{!6, !29}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_options_delta", file: !8, line: 77, baseType: !9)
!8 = !DIFile(filename: "liblzma/api/lzma/delta.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !8, line: 45, size: 320, elements: !10)
!10 = !{!11, !17, !22, !23, !24, !25, !26, !28}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !9, file: !8, line: 47, baseType: !12, size: 32)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_delta_type", file: !8, line: 37, baseType: !13)
!13 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !8, line: 35, baseType: !14, size: 32, elements: !15)
!14 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!15 = !{!16}
!16 = !DIEnumerator(name: "LZMA_DELTA_TYPE_BYTE", value: 0, isUnsigned: true)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !9, file: !8, line: 59, baseType: !18, size: 32, offset: 32)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !19, line: 26, baseType: !20)
!19 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !21, line: 42, baseType: !14)
!21 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!22 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int1", scope: !9, file: !8, line: 70, baseType: !18, size: 32, offset: 64)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int2", scope: !9, file: !8, line: 71, baseType: !18, size: 32, offset: 96)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int3", scope: !9, file: !8, line: 72, baseType: !18, size: 32, offset: 128)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int4", scope: !9, file: !8, line: 73, baseType: !18, size: 32, offset: 160)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr1", scope: !9, file: !8, line: 74, baseType: !27, size: 64, offset: 192)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr2", scope: !9, file: !8, line: 75, baseType: !27, size: 64, offset: 256)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!30 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !31)
!31 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!32 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !33, retainedTypes: !50, globals: !51, splitDebugInlining: false, nameTableKind: None)
!33 = !{!13, !34, !39, !46}
!34 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !35, line: 138, baseType: !14, size: 32, elements: !36)
!35 = !DIFile(filename: "liblzma/api/lzma/lzma.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!36 = !{!37, !38}
!37 = !DIEnumerator(name: "LZMA_MODE_FAST", value: 1, isUnsigned: true)
!38 = !DIEnumerator(name: "LZMA_MODE_NORMAL", value: 2, isUnsigned: true)
!39 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !35, line: 58, baseType: !14, size: 32, elements: !40)
!40 = !{!41, !42, !43, !44, !45}
!41 = !DIEnumerator(name: "LZMA_MF_HC3", value: 3, isUnsigned: true)
!42 = !DIEnumerator(name: "LZMA_MF_HC4", value: 4, isUnsigned: true)
!43 = !DIEnumerator(name: "LZMA_MF_BT2", value: 18, isUnsigned: true)
!44 = !DIEnumerator(name: "LZMA_MF_BT3", value: 19, isUnsigned: true)
!45 = !DIEnumerator(name: "LZMA_MF_BT4", value: 20, isUnsigned: true)
!46 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !47, line: 44, baseType: !14, size: 32, elements: !48)
!47 = !DIFile(filename: "liblzma/api/lzma/base.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!48 = !{!49}
!49 = !DIEnumerator(name: "LZMA_RESERVED_ENUM", value: 0, isUnsigned: true)
!50 = !{!27}
!51 = !{!0, !52, !85, !129, !134}
!52 = !DIGlobalVariableExpression(var: !53, expr: !DIExpression())
!53 = distinct !DIGlobalVariable(name: "opts", scope: !54, file: !3, line: 211, type: !64, isLocal: true, isDefinition: true)
!54 = distinct !DISubprogram(name: "options_bcj", scope: !3, file: !3, line: 209, type: !55, scopeLine: 210, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !32, retainedNodes: !63)
!55 = !DISubroutineType(types: !56)
!56 = !{!57, !29}
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_options_bcj", file: !59, line: 90, baseType: !60)
!59 = !DIFile(filename: "liblzma/api/lzma/bcj.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!60 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !59, line: 73, size: 32, elements: !61)
!61 = !{!62}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "start_offset", scope: !60, file: !59, line: 88, baseType: !18, size: 32)
!63 = !{}
!64 = !DICompositeType(tag: DW_TAG_array_type, baseType: !65, size: 512, elements: !83)
!65 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !66)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "option_map", file: !3, line: 31, baseType: !67)
!67 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 26, size: 256, elements: !68)
!68 = !{!69, !70, !81, !82}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !67, file: !3, line: 27, baseType: !29, size: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !67, file: !3, line: 28, baseType: !71, size: 64, offset: 64)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!72 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !73)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "name_id_map", file: !3, line: 23, baseType: !74)
!74 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 20, size: 128, elements: !75)
!75 = !{!76, !77}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !74, file: !3, line: 21, baseType: !29, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !74, file: !3, line: 22, baseType: !78, size: 64, offset: 64)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !19, line: 27, baseType: !79)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !21, line: 45, baseType: !80)
!80 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !67, file: !3, line: 29, baseType: !78, size: 64, offset: 128)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !67, file: !3, line: 30, baseType: !78, size: 64, offset: 192)
!83 = !{!84}
!84 = !DISubrange(count: 2)
!85 = !DIGlobalVariableExpression(var: !86, expr: !DIExpression())
!86 = distinct !DIGlobalVariable(name: "modes", scope: !87, file: !3, line: 319, type: !126, isLocal: true, isDefinition: true)
!87 = distinct !DISubprogram(name: "options_lzma", scope: !3, file: !3, line: 317, type: !88, scopeLine: 318, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !32, retainedNodes: !63)
!88 = !DISubroutineType(types: !89)
!89 = !{!90, !29}
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_options_lzma", file: !35, line: 399, baseType: !92)
!92 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !35, line: 185, size: 896, elements: !93)
!93 = !{!94, !95, !101, !102, !103, !104, !105, !107, !108, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !121, !122, !123, !124, !125}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "dict_size", scope: !92, file: !35, line: 217, baseType: !18, size: 32)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "preset_dict", scope: !92, file: !35, line: 240, baseType: !96, size: 64, offset: 64)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !98)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !19, line: 24, baseType: !99)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !21, line: 38, baseType: !100)
!100 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "preset_dict_size", scope: !92, file: !35, line: 254, baseType: !18, size: 32, offset: 128)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "lc", scope: !92, file: !35, line: 281, baseType: !18, size: 32, offset: 160)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "lp", scope: !92, file: !35, line: 293, baseType: !18, size: 32, offset: 192)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !92, file: !35, line: 316, baseType: !18, size: 32, offset: 224)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !92, file: !35, line: 322, baseType: !106, size: 32, offset: 256)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_mode", file: !35, line: 155, baseType: !34)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "nice_len", scope: !92, file: !35, line: 342, baseType: !18, size: 32, offset: 288)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "mf", scope: !92, file: !35, line: 345, baseType: !109, size: 32, offset: 320)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_match_finder", file: !35, line: 111, baseType: !39)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !92, file: !35, line: 375, baseType: !18, size: 32, offset: 352)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int1", scope: !92, file: !35, line: 384, baseType: !18, size: 32, offset: 384)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int2", scope: !92, file: !35, line: 385, baseType: !18, size: 32, offset: 416)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int3", scope: !92, file: !35, line: 386, baseType: !18, size: 32, offset: 448)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int4", scope: !92, file: !35, line: 387, baseType: !18, size: 32, offset: 480)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int5", scope: !92, file: !35, line: 388, baseType: !18, size: 32, offset: 512)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int6", scope: !92, file: !35, line: 389, baseType: !18, size: 32, offset: 544)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int7", scope: !92, file: !35, line: 390, baseType: !18, size: 32, offset: 576)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int8", scope: !92, file: !35, line: 391, baseType: !18, size: 32, offset: 608)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum1", scope: !92, file: !35, line: 392, baseType: !120, size: 32, offset: 640)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_reserved_enum", file: !47, line: 46, baseType: !46)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum2", scope: !92, file: !35, line: 393, baseType: !120, size: 32, offset: 672)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum3", scope: !92, file: !35, line: 394, baseType: !120, size: 32, offset: 704)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum4", scope: !92, file: !35, line: 395, baseType: !120, size: 32, offset: 736)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr1", scope: !92, file: !35, line: 396, baseType: !27, size: 64, offset: 768)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr2", scope: !92, file: !35, line: 397, baseType: !27, size: 64, offset: 832)
!126 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 384, elements: !127)
!127 = !{!128}
!128 = !DISubrange(count: 3)
!129 = !DIGlobalVariableExpression(var: !130, expr: !DIExpression())
!130 = distinct !DIGlobalVariable(name: "mfs", scope: !87, file: !3, line: 325, type: !131, isLocal: true, isDefinition: true)
!131 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 768, elements: !132)
!132 = !{!133}
!133 = !DISubrange(count: 6)
!134 = !DIGlobalVariableExpression(var: !135, expr: !DIExpression())
!135 = distinct !DIGlobalVariable(name: "opts", scope: !87, file: !3, line: 334, type: !136, isLocal: true, isDefinition: true)
!136 = !DICompositeType(tag: DW_TAG_array_type, baseType: !65, size: 2560, elements: !137)
!137 = !{!138}
!138 = !DISubrange(count: 10)
!139 = !{i32 7, !"Dwarf Version", i32 4}
!140 = !{i32 2, !"Debug Info Version", i32 3}
!141 = !{i32 1, !"wchar_size", i32 4}
!142 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!143 = !DILocalVariable(name: "str", arg: 1, scope: !2, file: !3, line: 165, type: !29)
!144 = !DILocation(line: 165, column: 27, scope: !2)
!145 = !DILocalVariable(name: "options", scope: !2, file: !3, line: 173, type: !6)
!146 = !DILocation(line: 173, column: 22, scope: !2)
!147 = !DILocation(line: 173, column: 32, scope: !2)
!148 = !DILocation(line: 174, column: 3, scope: !2)
!149 = !DILocation(line: 174, column: 13, scope: !2)
!150 = !DILocation(line: 174, column: 33, scope: !2)
!151 = !DILocation(line: 180, column: 16, scope: !2)
!152 = !DILocation(line: 180, column: 39, scope: !2)
!153 = !DILocation(line: 180, column: 2, scope: !2)
!154 = !DILocation(line: 182, column: 9, scope: !2)
!155 = !DILocation(line: 182, column: 2, scope: !2)
!156 = distinct !DISubprogram(name: "parse_options", scope: !3, file: !3, line: 60, type: !157, scopeLine: 64, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !32, retainedNodes: !63)
!157 = !DISubroutineType(types: !158)
!158 = !{null, !29, !159, !160, !27}
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = !DISubroutineType(types: !162)
!162 = !{null, !27, !18, !78, !29}
!163 = !DILocalVariable(name: "str", arg: 1, scope: !156, file: !3, line: 60, type: !29)
!164 = !DILocation(line: 60, column: 27, scope: !156)
!165 = !DILocalVariable(name: "opts", arg: 2, scope: !156, file: !3, line: 60, type: !159)
!166 = !DILocation(line: 60, column: 50, scope: !156)
!167 = !DILocalVariable(name: "set", arg: 3, scope: !156, file: !3, line: 61, type: !160)
!168 = !DILocation(line: 61, column: 10, scope: !156)
!169 = !DILocalVariable(name: "filter_options", arg: 4, scope: !156, file: !3, line: 63, type: !27)
!170 = !DILocation(line: 63, column: 9, scope: !156)
!171 = !DILocation(line: 65, column: 6, scope: !172)
!172 = distinct !DILexicalBlock(scope: !156, file: !3, line: 65, column: 6)
!173 = !DILocation(line: 65, column: 10, scope: !172)
!174 = !DILocation(line: 65, column: 18, scope: !172)
!175 = !DILocation(line: 65, column: 21, scope: !172)
!176 = !DILocation(line: 65, column: 28, scope: !172)
!177 = !DILocation(line: 65, column: 6, scope: !156)
!178 = !DILocation(line: 66, column: 3, scope: !172)
!179 = !DILocalVariable(name: "s", scope: !156, file: !3, line: 68, type: !180)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!181 = !DILocation(line: 68, column: 8, scope: !156)
!182 = !DILocation(line: 68, column: 20, scope: !156)
!183 = !DILocation(line: 68, column: 12, scope: !156)
!184 = !DILocalVariable(name: "name", scope: !156, file: !3, line: 69, type: !180)
!185 = !DILocation(line: 69, column: 8, scope: !156)
!186 = !DILocation(line: 69, column: 15, scope: !156)
