; ModuleID = 'liblzma/common/block_buffer_encoder.c'
source_filename = "liblzma/common/block_buffer_encoder.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.lzma_block = type { i32, i32, i32, i64, i64, %struct.lzma_filter*, [64 x i8], i8*, i8*, i8*, i32, i32, i64, i64, i64, i64, i64, i64, i32, i32, i32, i32, i8, i8, i8, i8, i8, i8, i8, i8 }
%struct.lzma_filter = type { i64, i8* }
%struct.lzma_allocator = type { i8* (i8*, i64, i64)*, void (i8*, i8*)*, i8* }
%struct.lzma_check_state = type { %union.anon, %union.anon.0 }
%union.anon = type { [8 x i64] }
%union.anon.0 = type { %struct.anon }
%struct.anon = type { [8 x i32], i64 }
%struct.lzma_next_coder_s = type { i8*, i64, i64, i32 (i8*, %struct.lzma_allocator*, i8*, i64*, i64, i8*, i64*, i64, i32)*, void (i8*, %struct.lzma_allocator*)*, i32 (i8*)*, i32 (i8*, i64*, i64*, i64)*, i32 (i8*, %struct.lzma_allocator*, %struct.lzma_filter*, %struct.lzma_filter*)* }
%struct.lzma_options_lzma = type { i32, i8*, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i8*, i8* }

; Function Attrs: noinline nounwind uwtable
define dso_local i64 @lzma_block_buffer_bound(i64 %uncompressed_size) #0 !dbg !56 {
entry:
  %retval = alloca i64, align 8
  %uncompressed_size.addr = alloca i64, align 8
  %lzma2_size = alloca i64, align 8
  store i64 %uncompressed_size, i64* %uncompressed_size.addr, align 8

!46 = !DIEnumerator(name: "LZMA_MF_BT4", value: 20, isUnsigned: true)
!47 = !{!48, !5, !49}
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !50, line: 46, baseType: !51)
!50 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!51 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!52 = !{i32 7, !"Dwarf Version", i32 4}
!53 = !{i32 2, !"Debug Info Version", i32 3}
!54 = !{i32 1, !"wchar_size", i32 4}
!55 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!56 = distinct !DISubprogram(name: "lzma_block_buffer_bound", scope: !1, file: !1, line: 55, type: !57, scopeLine: 56, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !59)
!57 = !DISubroutineType(types: !58)
!58 = !{!49, !49}
!59 = !{}
!60 = !DILocalVariable(name: "uncompressed_size", arg: 1, scope: !56, file: !1, line: 55, type: !49)
!61 = !DILocation(line: 55, column: 32, scope: !56)
!62 = !DILocalVariable(name: "lzma2_size", scope: !56, file: !1, line: 62, type: !63)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_vli", file: !64, line: 63, baseType: !65)
!64 = !DIFile(filename: "liblzma/api/lzma/vli.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !66, line: 27, baseType: !67)
!66 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !68, line: 45, baseType: !51)
!68 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!69 = !DILocation(line: 62, column: 11, scope: !56)
!70 = !DILocation(line: 62, column: 36, scope: !56)
!71 = !DILocation(line: 62, column: 24, scope: !56)
!72 = !DILocation(line: 63, column: 6, scope: !73)
!73 = distinct !DILexicalBlock(scope: !56, file: !1, line: 63, column: 6)
!74 = !DILocation(line: 63, column: 17, scope: !73)
!75 = !DILocation(line: 63, column: 6, scope: !56)
!76 = !DILocation(line: 64, column: 3, scope: !73)
!77 = !DILocation(line: 67, column: 16, scope: !56)
!78 = !DILocation(line: 67, column: 27, scope: !56)
!79 = !DILocation(line: 67, column: 32, scope: !56)
!80 = !DILocation(line: 67, column: 13, scope: !56)
!81 = !DILocation(line: 77, column: 25, scope: !56)
!82 = !DILocation(line: 77, column: 23, scope: !56)
!83 = !DILocation(line: 77, column: 2, scope: !56)
!84 = !DILocation(line: 78, column: 1, scope: !56)
!85 = distinct !DISubprogram(name: "lzma2_bound", scope: !1, file: !1, line: 32, type: !86, scopeLine: 33, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !59)
!86 = !DISubroutineType(types: !87)
!87 = !{!63, !63}
!88 = !DILocalVariable(name: "uncompressed_size", arg: 1, scope: !85, file: !1, line: 32, type: !63)
!89 = !DILocation(line: 32, column: 22, scope: !85)
!90 = !DILocation(line: 35, column: 6, scope: !91)
!91 = distinct !DILexicalBlock(scope: !85, file: !1, line: 35, column: 6)
!92 = !DILocation(line: 35, column: 24, scope: !91)
!93 = !DILocation(line: 35, column: 6, scope: !85)
!94 = !DILocation(line: 36, column: 3, scope: !91)
!95 = !DILocalVariable(name: "overhead", scope: !85, file: !1, line: 42, type: !96)
!96 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !63)
!97 = !DILocation(line: 42, column: 17, scope: !85)
!98 = !DILocation(line: 42, column: 30, scope: !85)
!99 = !DILocation(line: 42, column: 48, scope: !85)
!100 = !DILocation(line: 42, column: 66, scope: !85)
!101 = !DILocation(line: 43, column: 5, scope: !85)
!102 = !DILocation(line: 44, column: 4, scope: !85)
!103 = !DILocation(line: 44, column: 32, scope: !85)
!104 = !DILocation(line: 47, column: 28, scope: !105)
!105 = distinct !DILexicalBlock(scope: !85, file: !1, line: 47, column: 6)
!106 = !DILocation(line: 47, column: 26, scope: !105)
!107 = !DILocation(line: 47, column: 39, scope: !105)
!108 = !DILocation(line: 47, column: 37, scope: !105)
!109 = !DILocation(line: 47, column: 6, scope: !85)
!110 = !DILocation(line: 48, column: 3, scope: !105)
!111 = !DILocation(line: 50, column: 9, scope: !85)
!112 = !DILocation(line: 50, column: 29, scope: !85)
!113 = !DILocation(line: 50, column: 27, scope: !85)
!114 = !DILocation(line: 50, column: 2, scope: !85)
!115 = !DILocation(line: 51, column: 1, scope: !85)
!116 = distinct !DISubprogram(name: "lzma_block_buffer_encode", scope: !1, file: !1, line: 225, type: !117, scopeLine: 228, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !59)
!117 = !DISubroutineType(types: !118)
!118 = !{!119, !120, !173, !186, !49, !188, !189, !49}
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_ret", file: !4, line: 237, baseType: !3)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_block", file: !122, line: 245, baseType: !123)
!122 = !DIFile(filename: "liblzma/api/lzma/block.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!123 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !122, line: 30, size: 1664, elements: !124)
!124 = !{!125, !128, !129, !131, !132, !133, !141, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !161, !162, !163, !164, !166, !167, !168, !169, !170, !171, !172}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !123, file: !122, line: 47, baseType: !126, size: 32)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !66, line: 26, baseType: !127)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !68, line: 42, baseType: !5)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "header_size", scope: !123, file: !122, line: 67, baseType: !126, size: 32, offset: 32)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !123, file: !122, line: 88, baseType: !130, size: 32, offset: 64)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_check", file: !20, line: 55, baseType: !19)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "compressed_size", scope: !123, file: !122, line: 143, baseType: !63, size: 64, offset: 128)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "uncompressed_size", scope: !123, file: !122, line: 167, baseType: !63, size: 64, offset: 192)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "filters", scope: !123, file: !122, line: 195, baseType: !134, size: 64, offset: 256)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_filter", file: !136, line: 65, baseType: !137)
!136 = !DIFile(filename: "liblzma/api/lzma/filter.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!137 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !136, line: 43, size: 128, elements: !138)
!138 = !{!139, !140}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !137, file: !136, line: 54, baseType: !63, size: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !137, file: !136, line: 63, baseType: !48, size: 64, offset: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "raw_check", scope: !123, file: !122, line: 212, baseType: !142, size: 512, offset: 320)
!142 = !DICompositeType(tag: DW_TAG_array_type, baseType: !143, size: 512, elements: !146)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !66, line: 24, baseType: !144)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !68, line: 38, baseType: !145)
!145 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!146 = !{!147}
!147 = !DISubrange(count: 64)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr1", scope: !123, file: !122, line: 221, baseType: !48, size: 64, offset: 832)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr2", scope: !123, file: !122, line: 222, baseType: !48, size: 64, offset: 896)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr3", scope: !123, file: !122, line: 223, baseType: !48, size: 64, offset: 960)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int1", scope: !123, file: !122, line: 224, baseType: !126, size: 32, offset: 1024)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int2", scope: !123, file: !122, line: 225, baseType: !126, size: 32, offset: 1056)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int3", scope: !123, file: !122, line: 226, baseType: !63, size: 64, offset: 1088)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int4", scope: !123, file: !122, line: 227, baseType: !63, size: 64, offset: 1152)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int5", scope: !123, file: !122, line: 228, baseType: !63, size: 64, offset: 1216)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int6", scope: !123, file: !122, line: 229, baseType: !63, size: 64, offset: 1280)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int7", scope: !123, file: !122, line: 230, baseType: !63, size: 64, offset: 1344)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int8", scope: !123, file: !122, line: 231, baseType: !63, size: 64, offset: 1408)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum1", scope: !123, file: !122, line: 232, baseType: !160, size: 32, offset: 1472)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_reserved_enum", file: !4, line: 46, baseType: !26)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum2", scope: !123, file: !122, line: 233, baseType: !160, size: 32, offset: 1504)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum3", scope: !123, file: !122, line: 234, baseType: !160, size: 32, offset: 1536)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum4", scope: !123, file: !122, line: 235, baseType: !160, size: 32, offset: 1568)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool1", scope: !123, file: !122, line: 236, baseType: !165, size: 8, offset: 1600)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_bool", file: !4, line: 29, baseType: !145)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool2", scope: !123, file: !122, line: 237, baseType: !165, size: 8, offset: 1608)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool3", scope: !123, file: !122, line: 238, baseType: !165, size: 8, offset: 1616)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool4", scope: !123, file: !122, line: 239, baseType: !165, size: 8, offset: 1624)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool5", scope: !123, file: !122, line: 240, baseType: !165, size: 8, offset: 1632)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool6", scope: !123, file: !122, line: 241, baseType: !165, size: 8, offset: 1640)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool7", scope: !123, file: !122, line: 242, baseType: !165, size: 8, offset: 1648)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool8", scope: !123, file: !122, line: 243, baseType: !165, size: 8, offset: 1656)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_allocator", file: !4, line: 403, baseType: !175)
!175 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 341, size: 192, elements: !176)
!176 = !{!177, !181, !185}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !175, file: !4, line: 376, baseType: !178, size: 64)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = !DISubroutineType(types: !180)
!180 = !{!48, !48, !49, !49}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !175, file: !4, line: 390, baseType: !182, size: 64, offset: 64)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DISubroutineType(types: !184)
!184 = !{null, !48, !48}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !175, file: !4, line: 401, baseType: !48, size: 64, offset: 128)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!187 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !143)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!190 = !DILocalVariable(name: "block", arg: 1, scope: !116, file: !1, line: 225, type: !120)
!191 = !DILocation(line: 225, column: 38, scope: !116)
!192 = !DILocalVariable(name: "allocator", arg: 2, scope: !116, file: !1, line: 225, type: !173)
!193 = !DILocation(line: 225, column: 61, scope: !116)
!194 = !DILocalVariable(name: "in", arg: 3, scope: !116, file: !1, line: 226, type: !186)
!195 = !DILocation(line: 226, column: 18, scope: !116)
!196 = !DILocalVariable(name: "in_size", arg: 4, scope: !116, file: !1, line: 226, type: !49)
!197 = !DILocation(line: 226, column: 29, scope: !116)
!198 = !DILocalVariable(name: "out", arg: 5, scope: !116, file: !1, line: 227, type: !188)
!199 = !DILocation(line: 227, column: 12, scope: !116)
!200 = !DILocalVariable(name: "out_pos", arg: 6, scope: !116, file: !1, line: 227, type: !189)
!201 = !DILocation(line: 227, column: 25, scope: !116)
!202 = !DILocalVariable(name: "out_size", arg: 7, scope: !116, file: !1, line: 227, type: !49)
!203 = !DILocation(line: 227, column: 41, scope: !116)
!204 = !DILocation(line: 230, column: 6, scope: !205)
!205 = distinct !DILexicalBlock(scope: !116, file: !1, line: 230, column: 6)
!206 = !DILocation(line: 230, column: 12, scope: !205)
!207 = !DILocation(line: 230, column: 20, scope: !205)
!208 = !DILocation(line: 230, column: 24, scope: !205)
!209 = !DILocation(line: 230, column: 27, scope: !205)
!210 = !DILocation(line: 230, column: 35, scope: !205)
!211 = !DILocation(line: 230, column: 38, scope: !205)
!212 = !DILocation(line: 230, column: 46, scope: !205)
!213 = !DILocation(line: 230, column: 52, scope: !205)
!214 = !DILocation(line: 230, column: 55, scope: !205)
!215 = !DILocation(line: 230, column: 59, scope: !205)
!216 = !DILocation(line: 231, column: 4, scope: !205)
!217 = !DILocation(line: 231, column: 7, scope: !205)
!218 = !DILocation(line: 231, column: 15, scope: !205)
!219 = !DILocation(line: 231, column: 23, scope: !205)
!220 = !DILocation(line: 231, column: 27, scope: !205)
!221 = !DILocation(line: 231, column: 26, scope: !205)
!222 = !DILocation(line: 231, column: 37, scope: !205)
!223 = !DILocation(line: 231, column: 35, scope: !205)
!224 = !DILocation(line: 230, column: 6, scope: !116)
!225 = !DILocation(line: 232, column: 3, scope: !205)
!226 = !DILocation(line: 236, column: 6, scope: !227)
!227 = distinct !DILexicalBlock(scope: !116, file: !1, line: 236, column: 6)
!228 = !DILocation(line: 236, column: 13, scope: !227)
!229 = !DILocation(line: 236, column: 21, scope: !227)
!230 = !DILocation(line: 236, column: 6, scope: !116)
!231 = !DILocation(line: 237, column: 3, scope: !227)
!232 = !DILocation(line: 239, column: 21, scope: !233)
!233 = distinct !DILexicalBlock(scope: !116, file: !1, line: 239, column: 6)
!234 = !DILocation(line: 239, column: 28, scope: !233)
!235 = !DILocation(line: 239, column: 35, scope: !233)
!236 = !DILocation(line: 240, column: 4, scope: !233)
!237 = !DILocation(line: 240, column: 7, scope: !233)
!238 = !DILocation(line: 240, column: 14, scope: !233)
!239 = !DILocation(line: 240, column: 22, scope: !233)
!240 = !DILocation(line: 239, column: 6, scope: !116)
!241 = !DILocation(line: 241, column: 3, scope: !233)
!242 = !DILocation(line: 243, column: 31, scope: !243)
!243 = distinct !DILexicalBlock(scope: !116, file: !1, line: 243, column: 6)
!244 = !DILocation(line: 243, column: 38, scope: !243)
!245 = !DILocation(line: 243, column: 7, scope: !243)
!246 = !DILocation(line: 243, column: 6, scope: !116)
!247 = !DILocation(line: 244, column: 3, scope: !243)
!248 = !DILocation(line: 249, column: 15, scope: !116)
!249 = !DILocation(line: 249, column: 27, scope: !116)
!250 = !DILocation(line: 249, column: 26, scope: !116)
!251 = !DILocation(line: 249, column: 24, scope: !116)
!252 = !DILocation(line: 249, column: 36, scope: !116)
!253 = !DILocation(line: 249, column: 11, scope: !116)
!254 = !DILocalVariable(name: "check_size", scope: !116, file: !1, line: 252, type: !255)
!255 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !49)
!256 = !DILocation(line: 252, column: 15, scope: !116)
!257 = !DILocation(line: 252, column: 44, scope: !116)
!258 = !DILocation(line: 252, column: 51, scope: !116)
!259 = !DILocation(line: 252, column: 28, scope: !116)
!260 = !DILocation(line: 256, column: 6, scope: !261)
!261 = distinct !DILexicalBlock(scope: !116, file: !1, line: 256, column: 6)
!262 = !DILocation(line: 256, column: 18, scope: !261)
!263 = !DILocation(line: 256, column: 17, scope: !261)
!264 = !DILocation(line: 256, column: 15, scope: !261)
!265 = !DILocation(line: 256, column: 29, scope: !261)
!266 = !DILocation(line: 256, column: 26, scope: !261)
!267 = !DILocation(line: 256, column: 6, scope: !116)
!268 = !DILocation(line: 257, column: 3, scope: !261)
!269 = !DILocation(line: 259, column: 14, scope: !116)
!270 = !DILocation(line: 259, column: 11, scope: !116)
!271 = !DILocalVariable(name: "ret", scope: !116, file: !1, line: 262, type: !272)
!272 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !119)
!273 = !DILocation(line: 262, column: 17, scope: !116)
!274 = !DILocation(line: 262, column: 43, scope: !116)
!275 = !DILocation(line: 262, column: 50, scope: !116)
!276 = !DILocation(line: 263, column: 4, scope: !116)
!277 = !DILocation(line: 263, column: 8, scope: !116)
!278 = !DILocation(line: 263, column: 17, scope: !116)
!279 = !DILocation(line: 263, column: 22, scope: !116)
!280 = !DILocation(line: 263, column: 31, scope: !116)
!281 = !DILocation(line: 262, column: 23, scope: !116)
!282 = !DILocation(line: 264, column: 6, scope: !283)
!283 = distinct !DILexicalBlock(scope: !116, file: !1, line: 264, column: 6)
!284 = !DILocation(line: 264, column: 10, scope: !283)
!285 = !DILocation(line: 264, column: 6, scope: !116)
!286 = !DILocation(line: 267, column: 7, scope: !287)
!287 = distinct !DILexicalBlock(scope: !288, file: !1, line: 267, column: 7)
!288 = distinct !DILexicalBlock(scope: !283, file: !1, line: 264, column: 22)
!289 = !DILocation(line: 267, column: 11, scope: !287)
!290 = !DILocation(line: 267, column: 7, scope: !288)
!291 = !DILocation(line: 268, column: 11, scope: !287)
!292 = !DILocation(line: 268, column: 4, scope: !287)
!293 = !DILocation(line: 275, column: 3, scope: !288)
!294 = !DILocalVariable(name: "ret_", scope: !295, file: !1, line: 275, type: !272)
!295 = distinct !DILexicalBlock(scope: !288, file: !1, line: 275, column: 3)
!296 = !DILocation(line: 275, column: 3, scope: !295)
!297 = !DILocation(line: 275, column: 3, scope: !298)
!298 = distinct !DILexicalBlock(scope: !295, file: !1, line: 275, column: 3)
!299 = !DILocation(line: 277, column: 2, scope: !288)
!300 = !DILocalVariable(name: "i", scope: !301, file: !1, line: 284, type: !49)
!301 = distinct !DILexicalBlock(scope: !116, file: !1, line: 284, column: 2)
!302 = !DILocation(line: 284, column: 14, scope: !301)
!303 = !DILocation(line: 284, column: 27, scope: !301)
!304 = !DILocation(line: 284, column: 34, scope: !301)
!305 = !DILocation(line: 284, column: 7, scope: !301)
!306 = !DILocation(line: 284, column: 52, scope: !307)
!307 = distinct !DILexicalBlock(scope: !301, file: !1, line: 284, column: 2)
!308 = !DILocation(line: 284, column: 54, scope: !307)
!309 = !DILocation(line: 284, column: 2, scope: !301)
!310 = !DILocation(line: 286, column: 3, scope: !311)
!311 = distinct !DILexicalBlock(scope: !307, file: !1, line: 284, column: 64)
!312 = !DILocation(line: 286, column: 9, scope: !311)
!313 = !DILocation(line: 286, column: 17, scope: !311)
!314 = !DILocation(line: 286, column: 21, scope: !311)
!315 = !DILocation(line: 287, column: 2, scope: !311)
!316 = !DILocation(line: 284, column: 59, scope: !307)
!317 = !DILocation(line: 284, column: 2, scope: !307)
!318 = distinct !{!318, !309, !319}
!319 = !DILocation(line: 287, column: 2, scope: !301)
!320 = !DILocation(line: 290, column: 6, scope: !321)
!321 = distinct !DILexicalBlock(scope: !116, file: !1, line: 290, column: 6)
!322 = !DILocation(line: 290, column: 17, scope: !321)
!323 = !DILocation(line: 290, column: 6, scope: !116)
!324 = !DILocalVariable(name: "check", scope: !325, file: !1, line: 294, type: !326)
!325 = distinct !DILexicalBlock(scope: !321, file: !1, line: 290, column: 22)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_check_state", file: !327, line: 56, baseType: !328)
!327 = !DIFile(filename: "liblzma/check/check.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!328 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !327, line: 34, size: 832, elements: !329)
!329 = !{!330, !342}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !328, file: !327, line: 40, baseType: !331, size: 512)
!331 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !328, file: !327, line: 36, size: 512, elements: !332)
!332 = !{!333, !334, !338}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "u8", scope: !331, file: !327, line: 37, baseType: !142, size: 512)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "u32", scope: !331, file: !327, line: 38, baseType: !335, size: 512)
!335 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 512, elements: !336)
!336 = !{!337}
!337 = !DISubrange(count: 16)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "u64", scope: !331, file: !327, line: 39, baseType: !339, size: 512)
!339 = !DICompositeType(tag: DW_TAG_array_type, baseType: !65, size: 512, elements: !340)
!340 = !{!341}
!341 = !DISubrange(count: 8)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !328, file: !327, line: 54, baseType: !343, size: 320, offset: 512)
!343 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !328, file: !327, line: 43, size: 320, elements: !344)
!344 = !{!345, !346, !347}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "crc32", scope: !343, file: !327, line: 44, baseType: !126, size: 32)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "crc64", scope: !343, file: !327, line: 45, baseType: !65, size: 64)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "sha256", scope: !343, file: !327, line: 53, baseType: !348, size: 320)
!348 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !343, file: !327, line: 47, size: 320, elements: !349)
!349 = !{!350, !352}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !348, file: !327, line: 49, baseType: !351, size: 256)
!351 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 256, elements: !340)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !348, file: !327, line: 52, baseType: !65, size: 64, offset: 256)
!353 = !DILocation(line: 294, column: 20, scope: !325)
!354 = !DILocation(line: 295, column: 27, scope: !325)
!355 = !DILocation(line: 295, column: 34, scope: !325)
!356 = !DILocation(line: 295, column: 3, scope: !325)
!357 = !DILocation(line: 296, column: 29, scope: !325)
!358 = !DILocation(line: 296, column: 36, scope: !325)
!359 = !DILocation(line: 296, column: 43, scope: !325)
!360 = !DILocation(line: 296, column: 47, scope: !325)
!361 = !DILocation(line: 296, column: 3, scope: !325)
!362 = !DILocation(line: 297, column: 29, scope: !325)
!363 = !DILocation(line: 297, column: 36, scope: !325)
!364 = !DILocation(line: 297, column: 3, scope: !325)
!365 = !DILocation(line: 299, column: 10, scope: !325)
!366 = !DILocation(line: 299, column: 17, scope: !325)
!367 = !DILocation(line: 299, column: 3, scope: !325)
!368 = !DILocation(line: 299, column: 34, scope: !325)
!369 = !DILocation(line: 299, column: 41, scope: !325)
!370 = !DILocation(line: 299, column: 45, scope: !325)
!371 = !DILocation(line: 300, column: 10, scope: !325)
!372 = !DILocation(line: 300, column: 17, scope: !325)
!373 = !DILocation(line: 300, column: 16, scope: !325)
!374 = !DILocation(line: 300, column: 14, scope: !325)
!375 = !DILocation(line: 300, column: 32, scope: !325)
!376 = !DILocation(line: 300, column: 39, scope: !325)
!377 = !DILocation(line: 300, column: 3, scope: !325)
!378 = !DILocation(line: 300, column: 43, scope: !325)
!379 = !DILocation(line: 301, column: 15, scope: !325)
!380 = !DILocation(line: 301, column: 4, scope: !325)
!381 = !DILocation(line: 301, column: 12, scope: !325)
!382 = !DILocation(line: 302, column: 2, scope: !325)
!383 = !DILocation(line: 304, column: 2, scope: !116)
!384 = !DILocation(line: 305, column: 1, scope: !116)
!385 = distinct !DISubprogram(name: "block_encode_normal", scope: !1, file: !1, line: 163, type: !117, scopeLine: 166, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !59)
!386 = !DILocalVariable(name: "block", arg: 1, scope: !385, file: !1, line: 163, type: !120)
!387 = !DILocation(line: 163, column: 33, scope: !385)
!388 = !DILocalVariable(name: "allocator", arg: 2, scope: !385, file: !1, line: 163, type: !173)
!389 = !DILocation(line: 163, column: 56, scope: !385)
!390 = !DILocalVariable(name: "in", arg: 3, scope: !385, file: !1, line: 164, type: !186)
!391 = !DILocation(line: 164, column: 18, scope: !385)
!392 = !DILocalVariable(name: "in_size", arg: 4, scope: !385, file: !1, line: 164, type: !49)
!393 = !DILocation(line: 164, column: 29, scope: !385)
!394 = !DILocalVariable(name: "out", arg: 5, scope: !385, file: !1, line: 165, type: !188)
!395 = !DILocation(line: 165, column: 12, scope: !385)
!396 = !DILocalVariable(name: "out_pos", arg: 6, scope: !385, file: !1, line: 165, type: !189)
!397 = !DILocation(line: 165, column: 25, scope: !385)
!398 = !DILocalVariable(name: "out_size", arg: 7, scope: !385, file: !1, line: 165, type: !49)
!399 = !DILocation(line: 165, column: 41, scope: !385)
!400 = !DILocation(line: 168, column: 39, scope: !385)
!401 = !DILocation(line: 168, column: 27, scope: !385)
!402 = !DILocation(line: 168, column: 2, scope: !385)
!403 = !DILocation(line: 168, column: 9, scope: !385)
!404 = !DILocation(line: 168, column: 25, scope: !385)
!405 = !DILocation(line: 169, column: 6, scope: !406)
!406 = distinct !DILexicalBlock(scope: !385, file: !1, line: 169, column: 6)
!407 = !DILocation(line: 169, column: 13, scope: !406)
!408 = !DILocation(line: 169, column: 29, scope: !406)
!409 = !DILocation(line: 169, column: 6, scope: !385)
!410 = !DILocation(line: 170, column: 3, scope: !406)
!411 = !DILocation(line: 172, column: 29, scope: !385)
!412 = !DILocation(line: 172, column: 2, scope: !385)
!413 = !DILocation(line: 172, column: 9, scope: !385)
!414 = !DILocation(line: 172, column: 27, scope: !385)
!415 = !DILocation(line: 173, column: 2, scope: !385)
!416 = !DILocalVariable(name: "ret_", scope: !417, file: !1, line: 173, type: !272)
!417 = distinct !DILexicalBlock(scope: !385, file: !1, line: 173, column: 2)
!418 = !DILocation(line: 173, column: 2, scope: !417)
!419 = !DILocation(line: 173, column: 2, scope: !420)
!420 = distinct !DILexicalBlock(scope: !417, file: !1, line: 173, column: 2)
!421 = !DILocation(line: 176, column: 6, scope: !422)
!422 = distinct !DILexicalBlock(scope: !385, file: !1, line: 176, column: 6)
!423 = !DILocation(line: 176, column: 18, scope: !422)
!424 = !DILocation(line: 176, column: 17, scope: !422)
!425 = !DILocation(line: 176, column: 15, scope: !422)
!426 = !DILocation(line: 176, column: 29, scope: !422)
!427 = !DILocation(line: 176, column: 36, scope: !422)
!428 = !DILocation(line: 176, column: 26, scope: !422)
!429 = !DILocation(line: 176, column: 6, scope: !385)
!430 = !DILocation(line: 177, column: 3, scope: !422)
!431 = !DILocalVariable(name: "out_start", scope: !385, file: !1, line: 179, type: !255)
!432 = !DILocation(line: 179, column: 15, scope: !385)
!433 = !DILocation(line: 179, column: 28, scope: !385)
!434 = !DILocation(line: 179, column: 27, scope: !385)
!435 = !DILocation(line: 180, column: 14, scope: !385)
!436 = !DILocation(line: 180, column: 21, scope: !385)
!437 = !DILocation(line: 180, column: 3, scope: !385)
!438 = !DILocation(line: 180, column: 11, scope: !385)
!439 = !DILocation(line: 184, column: 6, scope: !440)
!440 = distinct !DILexicalBlock(scope: !385, file: !1, line: 184, column: 6)
!441 = !DILocation(line: 184, column: 18, scope: !440)
!442 = !DILocation(line: 184, column: 17, scope: !440)
!443 = !DILocation(line: 184, column: 15, scope: !440)
!444 = !DILocation(line: 184, column: 28, scope: !440)
!445 = !DILocation(line: 184, column: 35, scope: !440)
!446 = !DILocation(line: 184, column: 26, scope: !440)
!447 = !DILocation(line: 184, column: 6, scope: !385)
!448 = !DILocation(line: 185, column: 15, scope: !440)
!449 = !DILocation(line: 185, column: 14, scope: !440)
!450 = !DILocation(line: 185, column: 25, scope: !440)
!451 = !DILocation(line: 185, column: 32, scope: !440)
!452 = !DILocation(line: 185, column: 23, scope: !440)
!453 = !DILocation(line: 185, column: 12, scope: !440)
!454 = !DILocation(line: 185, column: 3, scope: !440)
!455 = !DILocalVariable(name: "raw_encoder", scope: !385, file: !1, line: 189, type: !456)
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_next_coder", file: !457, line: 80, baseType: !458)
!457 = !DIFile(filename: "liblzma/common/common.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!458 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_next_coder_s", file: !457, line: 124, size: 512, elements: !459)
!459 = !{!460, !463, !464, !467, !476, !481, !487, !492}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "coder", scope: !458, file: !457, line: 126, baseType: !461, size: 64)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_coder", file: !457, line: 78, baseType: null)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !458, file: !457, line: 130, baseType: !63, size: 64, offset: 64)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !458, file: !457, line: 136, baseType: !465, size: 64, offset: 128)
!465 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !466, line: 90, baseType: !51)
!466 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!467 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !458, file: !457, line: 139, baseType: !468, size: 64, offset: 192)
!468 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_code_function", file: !457, line: 94, baseType: !469)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64)
!470 = !DISubroutineType(types: !471)
!471 = !{!119, !461, !173, !472, !473, !49, !474, !473, !49, !475}
!472 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !186)
!473 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !189)
!474 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !188)
!475 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_action", file: !4, line: 322, baseType: !29)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !458, file: !457, line: 144, baseType: !477, size: 64, offset: 256)
!477 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_end_function", file: !457, line: 102, baseType: !478)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!479 = !DISubroutineType(types: !480)
!480 = !{null, !461, !173}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "get_check", scope: !458, file: !457, line: 148, baseType: !482, size: 64, offset: 320)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64)
!483 = !DISubroutineType(types: !484)
!484 = !{!130, !485}
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64)
!486 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !462)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "memconfig", scope: !458, file: !457, line: 152, baseType: !488, size: 64, offset: 384)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64)
!489 = !DISubroutineType(types: !490)
!490 = !{!119, !461, !491, !491, !65}
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !458, file: !457, line: 157, baseType: !493, size: 64, offset: 448)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64)
!494 = !DISubroutineType(types: !495)
!495 = !{!119, !461, !173, !496, !496}
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64)
!497 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !135)
!498 = !DILocation(line: 189, column: 18, scope: !385)
!499 = !DILocalVariable(name: "ret", scope: !385, file: !1, line: 190, type: !119)
!500 = !DILocation(line: 190, column: 11, scope: !385)
!501 = !DILocation(line: 191, column: 18, scope: !385)
!502 = !DILocation(line: 191, column: 29, scope: !385)
!503 = !DILocation(line: 191, column: 36, scope: !385)
!504 = !DILocation(line: 190, column: 17, scope: !385)
!505 = !DILocation(line: 193, column: 6, scope: !506)
!506 = distinct !DILexicalBlock(scope: !385, file: !1, line: 193, column: 6)
!507 = !DILocation(line: 193, column: 10, scope: !506)
!508 = !DILocation(line: 193, column: 6, scope: !385)
!509 = !DILocalVariable(name: "in_pos", scope: !510, file: !1, line: 194, type: !49)
!510 = distinct !DILexicalBlock(scope: !506, file: !1, line: 193, column: 22)
!511 = !DILocation(line: 194, column: 10, scope: !510)
!512 = !DILocation(line: 195, column: 21, scope: !510)
!513 = !DILocation(line: 195, column: 38, scope: !510)
!514 = !DILocation(line: 195, column: 45, scope: !510)
!515 = !DILocation(line: 196, column: 5, scope: !510)
!516 = !DILocation(line: 196, column: 18, scope: !510)
!517 = !DILocation(line: 196, column: 27, scope: !510)
!518 = !DILocation(line: 196, column: 32, scope: !510)
!519 = !DILocation(line: 196, column: 41, scope: !510)
!520 = !DILocation(line: 195, column: 9, scope: !510)
!521 = !DILocation(line: 195, column: 7, scope: !510)
!522 = !DILocation(line: 198, column: 2, scope: !510)
!523 = !DILocation(line: 201, column: 30, scope: !385)
!524 = !DILocation(line: 201, column: 2, scope: !385)
!525 = !DILocation(line: 203, column: 6, scope: !526)
!526 = distinct !DILexicalBlock(scope: !385, file: !1, line: 203, column: 6)
!527 = !DILocation(line: 203, column: 10, scope: !526)
!528 = !DILocation(line: 203, column: 6, scope: !385)
!529 = !DILocation(line: 206, column: 8, scope: !530)
!530 = distinct !DILexicalBlock(scope: !526, file: !1, line: 203, column: 30)
!531 = !DILocation(line: 206, column: 7, scope: !530)
!532 = !DILocation(line: 206, column: 19, scope: !530)
!533 = !DILocation(line: 206, column: 31, scope: !530)
!534 = !DILocation(line: 206, column: 38, scope: !530)
!535 = !DILocation(line: 206, column: 29, scope: !530)
!536 = !DILocation(line: 206, column: 16, scope: !530)
!537 = !DILocation(line: 205, column: 3, scope: !530)
!538 = !DILocation(line: 205, column: 10, scope: !530)
!539 = !DILocation(line: 206, column: 5, scope: !530)
!540 = !DILocation(line: 207, column: 34, scope: !530)
!541 = !DILocation(line: 207, column: 41, scope: !530)
!542 = !DILocation(line: 207, column: 47, scope: !530)
!543 = !DILocation(line: 207, column: 45, scope: !530)
!544 = !DILocation(line: 207, column: 9, scope: !530)
!545 = !DILocation(line: 207, column: 7, scope: !530)
!546 = !DILocation(line: 208, column: 7, scope: !547)
!547 = distinct !DILexicalBlock(scope: !530, file: !1, line: 208, column: 7)
!548 = !DILocation(line: 208, column: 11, scope: !547)
!549 = !DILocation(line: 208, column: 7, scope: !530)
!550 = !DILocation(line: 209, column: 8, scope: !547)
!551 = !DILocation(line: 209, column: 4, scope: !547)
!552 = !DILocation(line: 211, column: 2, scope: !530)
!553 = !DILocation(line: 211, column: 13, scope: !554)
!554 = distinct !DILexicalBlock(scope: !526, file: !1, line: 211, column: 13)
!555 = !DILocation(line: 211, column: 17, scope: !554)
!556 = !DILocation(line: 211, column: 13, scope: !526)
!557 = !DILocation(line: 213, column: 7, scope: !558)
!558 = distinct !DILexicalBlock(scope: !554, file: !1, line: 211, column: 29)
!559 = !DILocation(line: 214, column: 2, scope: !558)
!560 = !DILocation(line: 217, column: 6, scope: !561)
!561 = distinct !DILexicalBlock(scope: !385, file: !1, line: 217, column: 6)
!562 = !DILocation(line: 217, column: 10, scope: !561)
!563 = !DILocation(line: 217, column: 6, scope: !385)
!564 = !DILocation(line: 218, column: 14, scope: !561)
!565 = !DILocation(line: 218, column: 4, scope: !561)
!566 = !DILocation(line: 218, column: 12, scope: !561)
!567 = !DILocation(line: 218, column: 3, scope: !561)
!568 = !DILocation(line: 220, column: 9, scope: !385)
!569 = !DILocation(line: 220, column: 2, scope: !385)
!570 = !DILocation(line: 221, column: 1, scope: !385)
!571 = distinct !DISubprogram(name: "block_encode_uncompressed", scope: !1, file: !1, line: 82, type: !572, scopeLine: 84, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !59)
!572 = !DISubroutineType(types: !573)
!573 = !{!119, !120, !186, !49, !188, !189, !49}
!574 = !DILocalVariable(name: "block", arg: 1, scope: !571, file: !1, line: 82, type: !120)
!575 = !DILocation(line: 82, column: 39, scope: !571)
!576 = !DILocalVariable(name: "in", arg: 2, scope: !571, file: !1, line: 82, type: !186)
!577 = !DILocation(line: 82, column: 61, scope: !571)
!578 = !DILocalVariable(name: "in_size", arg: 3, scope: !571, file: !1, line: 82, type: !49)
!579 = !DILocation(line: 82, column: 72, scope: !571)
!580 = !DILocalVariable(name: "out", arg: 4, scope: !571, file: !1, line: 83, type: !188)
!581 = !DILocation(line: 83, column: 12, scope: !571)
!582 = !DILocalVariable(name: "out_pos", arg: 5, scope: !571, file: !1, line: 83, type: !189)
!583 = !DILocation(line: 83, column: 25, scope: !571)
!584 = !DILocalVariable(name: "out_size", arg: 6, scope: !571, file: !1, line: 83, type: !49)
!585 = !DILocation(line: 83, column: 41, scope: !571)
!586 = !DILocalVariable(name: "lzma2", scope: !571, file: !1, line: 91, type: !587)
!587 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_options_lzma", file: !36, line: 399, baseType: !588)
!588 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !36, line: 185, size: 896, elements: !589)
!589 = !{!590, !591, !592, !593, !594, !595, !596, !598, !599, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "dict_size", scope: !588, file: !36, line: 217, baseType: !126, size: 32)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "preset_dict", scope: !588, file: !36, line: 240, baseType: !186, size: 64, offset: 64)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "preset_dict_size", scope: !588, file: !36, line: 254, baseType: !126, size: 32, offset: 128)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "lc", scope: !588, file: !36, line: 281, baseType: !126, size: 32, offset: 160)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "lp", scope: !588, file: !36, line: 293, baseType: !126, size: 32, offset: 192)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !588, file: !36, line: 316, baseType: !126, size: 32, offset: 224)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !588, file: !36, line: 322, baseType: !597, size: 32, offset: 256)
!597 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_mode", file: !36, line: 155, baseType: !35)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "nice_len", scope: !588, file: !36, line: 342, baseType: !126, size: 32, offset: 288)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "mf", scope: !588, file: !36, line: 345, baseType: !600, size: 32, offset: 320)
!600 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_match_finder", file: !36, line: 111, baseType: !40)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !588, file: !36, line: 375, baseType: !126, size: 32, offset: 352)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int1", scope: !588, file: !36, line: 384, baseType: !126, size: 32, offset: 384)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int2", scope: !588, file: !36, line: 385, baseType: !126, size: 32, offset: 416)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int3", scope: !588, file: !36, line: 386, baseType: !126, size: 32, offset: 448)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int4", scope: !588, file: !36, line: 387, baseType: !126, size: 32, offset: 480)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int5", scope: !588, file: !36, line: 388, baseType: !126, size: 32, offset: 512)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int6", scope: !588, file: !36, line: 389, baseType: !126, size: 32, offset: 544)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int7", scope: !588, file: !36, line: 390, baseType: !126, size: 32, offset: 576)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int8", scope: !588, file: !36, line: 391, baseType: !126, size: 32, offset: 608)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum1", scope: !588, file: !36, line: 392, baseType: !160, size: 32, offset: 640)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum2", scope: !588, file: !36, line: 393, baseType: !160, size: 32, offset: 672)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum3", scope: !588, file: !36, line: 394, baseType: !160, size: 32, offset: 704)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum4", scope: !588, file: !36, line: 395, baseType: !160, size: 32, offset: 736)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr1", scope: !588, file: !36, line: 396, baseType: !48, size: 64, offset: 768)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr2", scope: !588, file: !36, line: 397, baseType: !48, size: 64, offset: 832)
!616 = !DILocation(line: 91, column: 20, scope: !571)
!617 = !DILocalVariable(name: "filters", scope: !571, file: !1, line: 95, type: !618)
!618 = !DICompositeType(tag: DW_TAG_array_type, baseType: !135, size: 256, elements: !619)
!619 = !{!620}
!620 = !DISubrange(count: 2)
!621 = !DILocation(line: 95, column: 14, scope: !571)
!622 = !DILocation(line: 96, column: 2, scope: !571)
!623 = !DILocation(line: 96, column: 13, scope: !571)
!624 = !DILocation(line: 96, column: 16, scope: !571)
!625 = !DILocation(line: 97, column: 23, scope: !571)
!626 = !DILocation(line: 97, column: 2, scope: !571)
!627 = !DILocation(line: 97, column: 13, scope: !571)
!628 = !DILocation(line: 97, column: 21, scope: !571)
!629 = !DILocation(line: 98, column: 2, scope: !571)
!630 = !DILocation(line: 98, column: 13, scope: !571)
!631 = !DILocation(line: 98, column: 16, scope: !571)
!632 = !DILocalVariable(name: "filters_orig", scope: !571, file: !1, line: 102, type: !134)
!633 = !DILocation(line: 102, column: 15, scope: !571)
!634 = !DILocation(line: 102, column: 30, scope: !571)
!635 = !DILocation(line: 102, column: 37, scope: !571)
!636 = !DILocation(line: 103, column: 19, scope: !571)
!637 = !DILocation(line: 103, column: 2, scope: !571)
!638 = !DILocation(line: 103, column: 9, scope: !571)
!639 = !DILocation(line: 103, column: 17, scope: !571)
!640 = !DILocation(line: 105, column: 29, scope: !641)
!641 = distinct !DILexicalBlock(scope: !571, file: !1, line: 105, column: 6)
!642 = !DILocation(line: 105, column: 6, scope: !641)
!643 = !DILocation(line: 105, column: 36, scope: !641)
!644 = !DILocation(line: 105, column: 6, scope: !571)
!645 = !DILocation(line: 106, column: 20, scope: !646)
!646 = distinct !DILexicalBlock(scope: !641, file: !1, line: 105, column: 48)
!647 = !DILocation(line: 106, column: 3, scope: !646)
!648 = !DILocation(line: 106, column: 10, scope: !646)
!649 = !DILocation(line: 106, column: 18, scope: !646)
!650 = !DILocation(line: 107, column: 3, scope: !646)
!651 = !DILocation(line: 116, column: 6, scope: !652)
!652 = distinct !DILexicalBlock(scope: !571, file: !1, line: 116, column: 6)
!653 = !DILocation(line: 116, column: 18, scope: !652)
!654 = !DILocation(line: 116, column: 17, scope: !652)
!655 = !DILocation(line: 116, column: 15, scope: !652)
!656 = !DILocation(line: 117, column: 6, scope: !652)
!657 = !DILocation(line: 117, column: 13, scope: !652)
!658 = !DILocation(line: 117, column: 27, scope: !652)
!659 = !DILocation(line: 117, column: 34, scope: !652)
!660 = !DILocation(line: 117, column: 25, scope: !652)
!661 = !DILocation(line: 117, column: 4, scope: !652)
!662 = !DILocation(line: 116, column: 6, scope: !571)
!663 = !DILocation(line: 118, column: 20, scope: !664)
!664 = distinct !DILexicalBlock(scope: !652, file: !1, line: 117, column: 51)
!665 = !DILocation(line: 118, column: 3, scope: !664)
!666 = !DILocation(line: 118, column: 10, scope: !664)
!667 = !DILocation(line: 118, column: 18, scope: !664)
!668 = !DILocation(line: 119, column: 3, scope: !664)
!669 = !DILocation(line: 122, column: 31, scope: !670)
!670 = distinct !DILexicalBlock(scope: !571, file: !1, line: 122, column: 6)
!671 = !DILocation(line: 122, column: 38, scope: !670)
!672 = !DILocation(line: 122, column: 45, scope: !670)
!673 = !DILocation(line: 122, column: 44, scope: !670)
!674 = !DILocation(line: 122, column: 42, scope: !670)
!675 = !DILocation(line: 122, column: 6, scope: !670)
!676 = !DILocation(line: 122, column: 54, scope: !670)
!677 = !DILocation(line: 122, column: 6, scope: !571)
!678 = !DILocation(line: 123, column: 20, scope: !679)
!679 = distinct !DILexicalBlock(scope: !670, file: !1, line: 122, column: 66)
!680 = !DILocation(line: 123, column: 3, scope: !679)
!681 = !DILocation(line: 123, column: 10, scope: !679)
!682 = !DILocation(line: 123, column: 18, scope: !679)
!683 = !DILocation(line: 124, column: 3, scope: !679)
