; ModuleID = 'liblzma/common/index_decoder.c'
source_filename = "liblzma/common/index_decoder.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.lzma_stream = type { i8*, i64, i64, i8*, i64, i64, %struct.lzma_allocator*, %struct.lzma_internal_s*, i8*, i8*, i8*, i8*, i64, i64, i64, i64, i32, i32 }
%struct.lzma_allocator = type { i8* (i8*, i64, i64)*, void (i8*, i8*)*, i8* }
%struct.lzma_internal_s = type { %struct.lzma_next_coder_s, i32, i64, [4 x i8], i8 }
%struct.lzma_next_coder_s = type { i8*, i64, i64, i32 (i8*, %struct.lzma_allocator*, i8*, i64*, i64, i8*, i64*, i64, i32)*, void (i8*, %struct.lzma_allocator*)*, i32 (i8*)*, i32 (i8*, i64*, i64*, i64)*, i32 (i8*, %struct.lzma_allocator*, %struct.lzma_filter*, %struct.lzma_filter*)* }
%struct.lzma_filter = type { i64, i8* }
%struct.lzma_index_s = type opaque
%struct.lzma_coder_s = type { i32, i64, %struct.lzma_index_s*, %struct.lzma_index_s**, i64, i64, i64, i64, i32 }

; Function Attrs: noinline nounwind uwtable
define dso_local i32 @lzma_index_decoder(%struct.lzma_stream* %strm, %struct.lzma_index_s** %i, i64 %memlimit) #0 !dbg !168 {
entry:
  %retval = alloca i32, align 4
  %strm.addr = alloca %struct.lzma_stream*, align 8
  %i.addr = alloca %struct.lzma_index_s**, align 8
  %memlimit.addr = alloca i64, align 8
  %ret_ = alloca i32, align 4
  %ret_2 = alloca i32, align 4

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !162, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "liblzma/common/index_decoder.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!2 = !{!3, !19, !25, !32, !131, !134}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 57, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "liblzma/api/lzma/base.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18}
!7 = !DIEnumerator(name: "LZMA_OK", value: 0, isUnsigned: true)
!8 = !DIEnumerator(name: "LZMA_STREAM_END", value: 1, isUnsigned: true)
!9 = !DIEnumerator(name: "LZMA_NO_CHECK", value: 2, isUnsigned: true)
!10 = !DIEnumerator(name: "LZMA_UNSUPPORTED_CHECK", value: 3, isUnsigned: true)
!11 = !DIEnumerator(name: "LZMA_GET_CHECK", value: 4, isUnsigned: true)
!12 = !DIEnumerator(name: "LZMA_MEM_ERROR", value: 5, isUnsigned: true)
!13 = !DIEnumerator(name: "LZMA_MEMLIMIT_ERROR", value: 6, isUnsigned: true)
!14 = !DIEnumerator(name: "LZMA_FORMAT_ERROR", value: 7, isUnsigned: true)
!15 = !DIEnumerator(name: "LZMA_OPTIONS_ERROR", value: 8, isUnsigned: true)
!16 = !DIEnumerator(name: "LZMA_DATA_ERROR", value: 9, isUnsigned: true)
!17 = !DIEnumerator(name: "LZMA_BUF_ERROR", value: 10, isUnsigned: true)
!18 = !DIEnumerator(name: "LZMA_PROG_ERROR", value: 11, isUnsigned: true)
!19 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 250, baseType: !5, size: 32, elements: !20)
!20 = !{!21, !22, !23, !24}
!21 = !DIEnumerator(name: "LZMA_RUN", value: 0, isUnsigned: true)
!22 = !DIEnumerator(name: "LZMA_SYNC_FLUSH", value: 1, isUnsigned: true)
!23 = !DIEnumerator(name: "LZMA_FULL_FLUSH", value: 2, isUnsigned: true)
!24 = !DIEnumerator(name: "LZMA_FINISH", value: 3, isUnsigned: true)
!25 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !26, line: 27, baseType: !5, size: 32, elements: !27)
!26 = !DIFile(filename: "liblzma/api/lzma/check.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!27 = !{!28, !29, !30, !31}
!28 = !DIEnumerator(name: "LZMA_CHECK_NONE", value: 0, isUnsigned: true)
!29 = !DIEnumerator(name: "LZMA_CHECK_CRC32", value: 1, isUnsigned: true)
!30 = !DIEnumerator(name: "LZMA_CHECK_CRC64", value: 4, isUnsigned: true)
!31 = !DIEnumerator(name: "LZMA_CHECK_SHA256", value: 10, isUnsigned: true)
!32 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !34, file: !33, line: 187, baseType: !5, size: 32, elements: !124)
!33 = !DIFile(filename: "liblzma/common/common.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!34 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_internal_s", file: !33, line: 179, size: 704, elements: !35)
!35 = !{!36, !116, !117, !118, !123}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !34, file: !33, line: 181, baseType: !37, size: 512)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_next_coder", file: !33, line: 80, baseType: !38)
!38 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_next_coder_s", file: !33, line: 124, size: 512, elements: !39)
!39 = !{!40, !43, !51, !54, !87, !92, !99, !104}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "coder", scope: !38, file: !33, line: 126, baseType: !41, size: 64)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_coder", file: !33, line: 78, baseType: null)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !38, file: !33, line: 130, baseType: !44, size: 64, offset: 64)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_vli", file: !45, line: 63, baseType: !46)
!45 = !DIFile(filename: "liblzma/api/lzma/vli.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !47, line: 27, baseType: !48)
!47 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !49, line: 45, baseType: !50)
!49 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!50 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !38, file: !33, line: 136, baseType: !52, size: 64, offset: 128)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !53, line: 90, baseType: !50)
!53 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!54 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !38, file: !33, line: 139, baseType: !55, size: 64, offset: 192)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_code_function", file: !33, line: 94, baseType: !56)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!57 = !DISubroutineType(types: !58)
!58 = !{!59, !41, !60, !76, !82, !69, !84, !82, !69, !86}
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_ret", file: !4, line: 237, baseType: !3)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_allocator", file: !4, line: 403, baseType: !62)
!62 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 341, size: 192, elements: !63)
!63 = !{!64, !71, !75}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !62, file: !4, line: 376, baseType: !65, size: 64)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!66 = !DISubroutineType(types: !67)
!67 = !{!68, !68, !69, !69}
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !70, line: 46, baseType: !50)
!70 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!71 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !62, file: !4, line: 390, baseType: !72, size: 64, offset: 64)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!73 = !DISubroutineType(types: !74)
!74 = !{null, !68, !68}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !62, file: !4, line: 401, baseType: !68, size: 64, offset: 128)
!76 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !77)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !79)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !47, line: 24, baseType: !80)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !49, line: 38, baseType: !81)
!81 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!82 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !83)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !85)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_action", file: !4, line: 322, baseType: !19)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !38, file: !33, line: 144, baseType: !88, size: 64, offset: 256)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_end_function", file: !33, line: 102, baseType: !89)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!90 = !DISubroutineType(types: !91)
!91 = !{null, !41, !60}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "get_check", scope: !38, file: !33, line: 148, baseType: !93, size: 64, offset: 320)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = !DISubroutineType(types: !95)
!95 = !{!96, !97}
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_check", file: !26, line: 55, baseType: !25)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !42)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "memconfig", scope: !38, file: !33, line: 152, baseType: !100, size: 64, offset: 384)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = !DISubroutineType(types: !102)
!102 = !{!59, !41, !103, !103, !46}
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !38, file: !33, line: 157, baseType: !105, size: 64, offset: 448)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!106 = !DISubroutineType(types: !107)
!107 = !{!59, !41, !60, !108, !108}
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !110)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_filter", file: !111, line: 65, baseType: !112)
!111 = !DIFile(filename: "liblzma/api/lzma/filter.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!112 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !111, line: 43, size: 128, elements: !113)
!113 = !{!114, !115}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !112, file: !111, line: 54, baseType: !44, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !112, file: !111, line: 63, baseType: !68, size: 64, offset: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !34, file: !33, line: 194, baseType: !32, size: 32, offset: 512)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "avail_in", scope: !34, file: !33, line: 199, baseType: !69, size: 64, offset: 576)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "supported_actions", scope: !34, file: !33, line: 202, baseType: !119, size: 32, offset: 640)
!119 = !DICompositeType(tag: DW_TAG_array_type, baseType: !120, size: 32, elements: !121)
!120 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!121 = !{!122}
!122 = !DISubrange(count: 4)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "allow_buf_error", scope: !34, file: !33, line: 206, baseType: !120, size: 8, offset: 672)
!124 = !{!125, !126, !127, !128, !129, !130}
!125 = !DIEnumerator(name: "ISEQ_RUN", value: 0, isUnsigned: true)
!126 = !DIEnumerator(name: "ISEQ_SYNC_FLUSH", value: 1, isUnsigned: true)
!127 = !DIEnumerator(name: "ISEQ_FULL_FLUSH", value: 2, isUnsigned: true)
!128 = !DIEnumerator(name: "ISEQ_FINISH", value: 3, isUnsigned: true)
!129 = !DIEnumerator(name: "ISEQ_END", value: 4, isUnsigned: true)
!130 = !DIEnumerator(name: "ISEQ_ERROR", value: 5, isUnsigned: true)
!131 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 44, baseType: !5, size: 32, elements: !132)
!132 = !{!133}
!133 = !DIEnumerator(name: "LZMA_RESERVED_ENUM", value: 0, isUnsigned: true)
!134 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !135, file: !1, line: 18, baseType: !5, size: 32, elements: !153)
!135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_coder_s", file: !1, line: 17, size: 576, elements: !136)
!136 = !{!137, !138, !139, !144, !146, !147, !148, !149, !150}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !135, file: !1, line: 27, baseType: !134, size: 32)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "memlimit", scope: !135, file: !1, line: 30, baseType: !46, size: 64, offset: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !135, file: !1, line: 33, baseType: !140, size: 64, offset: 128)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_index", file: !142, line: 37, baseType: !143)
!142 = !DIFile(filename: "liblzma/api/lzma/index.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!143 = !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_index_s", file: !142, line: 37, flags: DIFlagFwdDecl)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "index_ptr", scope: !135, file: !1, line: 37, baseType: !145, size: 64, offset: 192)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !135, file: !1, line: 40, baseType: !44, size: 64, offset: 256)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "unpadded_size", scope: !135, file: !1, line: 43, baseType: !44, size: 64, offset: 320)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "uncompressed_size", scope: !135, file: !1, line: 46, baseType: !44, size: 64, offset: 384)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !135, file: !1, line: 49, baseType: !69, size: 64, offset: 448)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "crc32", scope: !135, file: !1, line: 52, baseType: !151, size: 32, offset: 512)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !47, line: 26, baseType: !152)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !49, line: 42, baseType: !5)
!153 = !{!154, !155, !156, !157, !158, !159, !160, !161}
!154 = !DIEnumerator(name: "SEQ_INDICATOR", value: 0, isUnsigned: true)
!155 = !DIEnumerator(name: "SEQ_COUNT", value: 1, isUnsigned: true)
!156 = !DIEnumerator(name: "SEQ_MEMUSAGE", value: 2, isUnsigned: true)
!157 = !DIEnumerator(name: "SEQ_UNPADDED", value: 3, isUnsigned: true)
!158 = !DIEnumerator(name: "SEQ_UNCOMPRESSED", value: 4, isUnsigned: true)
!159 = !DIEnumerator(name: "SEQ_PADDING_INIT", value: 5, isUnsigned: true)
!160 = !DIEnumerator(name: "SEQ_PADDING", value: 6, isUnsigned: true)
!161 = !DIEnumerator(name: "SEQ_CRC32", value: 7, isUnsigned: true)
!162 = !{!68, !52, !163}
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!164 = !{i32 7, !"Dwarf Version", i32 4}
!165 = !{i32 2, !"Debug Info Version", i32 3}
!166 = !{i32 1, !"wchar_size", i32 4}
!167 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!168 = distinct !DISubprogram(name: "lzma_index_decoder", scope: !1, file: !1, line: 294, type: !169, scopeLine: 295, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !196)
!169 = !DISubroutineType(types: !170)
!170 = !{!59, !171, !145, !46}
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_stream", file: !4, line: 490, baseType: !173)
!173 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 453, size: 1088, elements: !174)
!174 = !{!175, !176, !177, !178, !179, !180, !181, !182, !185, !186, !187, !188, !189, !190, !191, !192, !193, !195}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "next_in", scope: !173, file: !4, line: 454, baseType: !77, size: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "avail_in", scope: !173, file: !4, line: 455, baseType: !69, size: 64, offset: 64)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "total_in", scope: !173, file: !4, line: 456, baseType: !46, size: 64, offset: 128)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "next_out", scope: !173, file: !4, line: 458, baseType: !85, size: 64, offset: 192)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "avail_out", scope: !173, file: !4, line: 459, baseType: !69, size: 64, offset: 256)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "total_out", scope: !173, file: !4, line: 460, baseType: !46, size: 64, offset: 320)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !173, file: !4, line: 468, baseType: !60, size: 64, offset: 384)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !173, file: !4, line: 471, baseType: !183, size: 64, offset: 448)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_internal", file: !4, line: 411, baseType: !34)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr1", scope: !173, file: !4, line: 479, baseType: !68, size: 64, offset: 512)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr2", scope: !173, file: !4, line: 480, baseType: !68, size: 64, offset: 576)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr3", scope: !173, file: !4, line: 481, baseType: !68, size: 64, offset: 640)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr4", scope: !173, file: !4, line: 482, baseType: !68, size: 64, offset: 704)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int1", scope: !173, file: !4, line: 483, baseType: !46, size: 64, offset: 768)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int2", scope: !173, file: !4, line: 484, baseType: !46, size: 64, offset: 832)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int3", scope: !173, file: !4, line: 485, baseType: !69, size: 64, offset: 896)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int4", scope: !173, file: !4, line: 486, baseType: !69, size: 64, offset: 960)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum1", scope: !173, file: !4, line: 487, baseType: !194, size: 32, offset: 1024)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_reserved_enum", file: !4, line: 46, baseType: !131)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum2", scope: !173, file: !4, line: 488, baseType: !194, size: 32, offset: 1056)
!196 = !{}
!197 = !DILocalVariable(name: "strm", arg: 1, scope: !168, file: !1, line: 294, type: !171)
!198 = !DILocation(line: 294, column: 33, scope: !168)
!199 = !DILocalVariable(name: "i", arg: 2, scope: !168, file: !1, line: 294, type: !145)
!200 = !DILocation(line: 294, column: 52, scope: !168)
!201 = !DILocalVariable(name: "memlimit", arg: 3, scope: !168, file: !1, line: 294, type: !46)
!202 = !DILocation(line: 294, column: 64, scope: !168)
!203 = !DILocation(line: 296, column: 2, scope: !168)
!204 = !DILocation(line: 296, column: 2, scope: !205)
!205 = distinct !DILexicalBlock(scope: !168, file: !1, line: 296, column: 2)
!206 = !DILocalVariable(name: "ret_", scope: !207, file: !1, line: 296, type: !208)
!207 = distinct !DILexicalBlock(scope: !205, file: !1, line: 296, column: 2)
!208 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !59)
!209 = !DILocation(line: 296, column: 2, scope: !207)
!210 = !DILocation(line: 296, column: 2, scope: !211)
!211 = distinct !DILexicalBlock(scope: !207, file: !1, line: 296, column: 2)
!212 = !DILocalVariable(name: "ret_", scope: !205, file: !1, line: 296, type: !208)
!213 = !DILocation(line: 296, column: 2, scope: !214)
!214 = distinct !DILexicalBlock(scope: !205, file: !1, line: 296, column: 2)
!215 = !DILocation(line: 296, column: 2, scope: !216)
!216 = distinct !DILexicalBlock(scope: !214, file: !1, line: 296, column: 2)
!217 = !DILocation(line: 298, column: 2, scope: !168)
!218 = !DILocation(line: 298, column: 8, scope: !168)
!219 = !DILocation(line: 298, column: 18, scope: !168)
!220 = !DILocation(line: 298, column: 46, scope: !168)
!221 = !DILocation(line: 299, column: 2, scope: !168)
!222 = !DILocation(line: 299, column: 8, scope: !168)
!223 = !DILocation(line: 299, column: 18, scope: !168)
!224 = !DILocation(line: 299, column: 49, scope: !168)
!225 = !DILocation(line: 301, column: 2, scope: !168)
!226 = !DILocation(line: 302, column: 1, scope: !168)
!227 = distinct !DISubprogram(name: "index_decoder_init", scope: !1, file: !1, line: 268, type: !228, scopeLine: 270, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !196)
!228 = !DISubroutineType(types: !229)
!229 = !{!59, !230, !60, !145, !46}
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!231 = !DILocalVariable(name: "next", arg: 1, scope: !227, file: !1, line: 268, type: !230)
!232 = !DILocation(line: 268, column: 37, scope: !227)
!233 = !DILocalVariable(name: "allocator", arg: 2, scope: !227, file: !1, line: 268, type: !60)
!234 = !DILocation(line: 268, column: 59, scope: !227)
!235 = !DILocalVariable(name: "i", arg: 3, scope: !227, file: !1, line: 269, type: !145)
!236 = !DILocation(line: 269, column: 16, scope: !227)
!237 = !DILocalVariable(name: "memlimit", arg: 4, scope: !227, file: !1, line: 269, type: !46)
!238 = !DILocation(line: 269, column: 28, scope: !227)
!239 = !DILocation(line: 271, column: 2, scope: !227)
!240 = !DILocation(line: 271, column: 2, scope: !241)
!241 = distinct !DILexicalBlock(scope: !242, file: !1, line: 271, column: 2)
!242 = distinct !DILexicalBlock(scope: !227, file: !1, line: 271, column: 2)
!243 = !DILocation(line: 271, column: 2, scope: !242)
!244 = !DILocation(line: 273, column: 6, scope: !245)
!245 = distinct !DILexicalBlock(scope: !227, file: !1, line: 273, column: 6)
!246 = !DILocation(line: 273, column: 8, scope: !245)
!247 = !DILocation(line: 273, column: 16, scope: !245)
!248 = !DILocation(line: 273, column: 19, scope: !245)
!249 = !DILocation(line: 273, column: 28, scope: !245)
!250 = !DILocation(line: 273, column: 6, scope: !227)
!251 = !DILocation(line: 274, column: 3, scope: !245)
!252 = !DILocation(line: 276, column: 6, scope: !253)
!253 = distinct !DILexicalBlock(scope: !227, file: !1, line: 276, column: 6)
!254 = !DILocation(line: 276, column: 12, scope: !253)
