; ModuleID = 'liblzma/common/alone_encoder.c'
source_filename = "liblzma/common/alone_encoder.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.lzma_stream = type { i8*, i64, i64, i8*, i64, i64, %struct.lzma_allocator*, %struct.lzma_internal_s*, i8*, i8*, i8*, i8*, i64, i64, i64, i64, i32, i32 }
%struct.lzma_allocator = type { i8* (i8*, i64, i64)*, void (i8*, i8*)*, i8* }
%struct.lzma_internal_s = type { %struct.lzma_next_coder_s, i32, i64, [4 x i8], i8 }
%struct.lzma_next_coder_s = type { i8*, i64, i64, i32 (i8*, %struct.lzma_allocator*, i8*, i64*, i64, i8*, i64*, i64, i32)*, void (i8*, %struct.lzma_allocator*)*, i32 (i8*)*, i32 (i8*, i64*, i64*, i64)*, i32 (i8*, %struct.lzma_allocator*, %struct.lzma_filter*, %struct.lzma_filter*)* }
%struct.lzma_filter = type { i64, i8* }
%struct.lzma_options_lzma = type { i32, i8*, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i8*, i8* }
%struct.lzma_filter_info_s = type { i64, i32 (%struct.lzma_next_coder_s*, %struct.lzma_allocator*, %struct.lzma_filter_info_s*)*, i8* }
%struct.lzma_coder_s = type { %struct.lzma_next_coder_s, i32, i64, [13 x i8] }

; Function Attrs: noinline nounwind uwtable
define dso_local i32 @lzma_alone_encoder(%struct.lzma_stream* %strm, %struct.lzma_options_lzma* %options) #0 !dbg !165 {
entry:
  %retval = alloca i32, align 4

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !159, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "liblzma/common/alone_encoder.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!2 = !{!3, !19, !25, !32, !131, !134, !139, !146}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 57, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "liblzma/api/lzma/base.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18}
!7 = !DIEnumerator(name: "LZMA_OK", value: 0, isUnsigned: true)
!8 = !DIEnumerator(name: "LZMA_STREAM_END", value: 1, isUnsigned: true)
!9 = !DIEnumerator(name: "LZMA_NO_CHECK", value: 2, isUnsigned: true)
!10 = !DIEnumerator(name: "LZMA_UNSUPPORTED_CHECK", value: 3, isUnsigned: true)
!11 = !DIEnumerator(name: "LZMA_GET_CHECK", value: 4, isUnsigned: true)
!12 = !DIEnumerator(name: "LZMA_MEM_ERROR", value: 5, isUnsigned: true)
!13 = !DIEnumerator(name: "LZMA_MEMLIMIT_ERROR", value: 6, isUnsigned: true)
!14 = !DIEnumerator(name: "LZMA_FORMAT_ERROR", value: 7, isUnsigned: true)
!15 = !DIEnumerator(name: "LZMA_OPTIONS_ERROR", value: 8, isUnsigned: true)
!16 = !DIEnumerator(name: "LZMA_DATA_ERROR", value: 9, isUnsigned: true)
!17 = !DIEnumerator(name: "LZMA_BUF_ERROR", value: 10, isUnsigned: true)
!18 = !DIEnumerator(name: "LZMA_PROG_ERROR", value: 11, isUnsigned: true)
!19 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 250, baseType: !5, size: 32, elements: !20)
!20 = !{!21, !22, !23, !24}
!21 = !DIEnumerator(name: "LZMA_RUN", value: 0, isUnsigned: true)
!22 = !DIEnumerator(name: "LZMA_SYNC_FLUSH", value: 1, isUnsigned: true)
!23 = !DIEnumerator(name: "LZMA_FULL_FLUSH", value: 2, isUnsigned: true)
!24 = !DIEnumerator(name: "LZMA_FINISH", value: 3, isUnsigned: true)
!25 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !26, line: 27, baseType: !5, size: 32, elements: !27)
!26 = !DIFile(filename: "liblzma/api/lzma/check.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!27 = !{!28, !29, !30, !31}
!28 = !DIEnumerator(name: "LZMA_CHECK_NONE", value: 0, isUnsigned: true)
!29 = !DIEnumerator(name: "LZMA_CHECK_CRC32", value: 1, isUnsigned: true)
!30 = !DIEnumerator(name: "LZMA_CHECK_CRC64", value: 4, isUnsigned: true)
!31 = !DIEnumerator(name: "LZMA_CHECK_SHA256", value: 10, isUnsigned: true)
!32 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !34, file: !33, line: 187, baseType: !5, size: 32, elements: !124)
!33 = !DIFile(filename: "liblzma/common/common.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!34 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_internal_s", file: !33, line: 179, size: 704, elements: !35)
!35 = !{!36, !116, !117, !118, !123}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !34, file: !33, line: 181, baseType: !37, size: 512)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_next_coder", file: !33, line: 80, baseType: !38)
!38 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_next_coder_s", file: !33, line: 124, size: 512, elements: !39)
!39 = !{!40, !43, !51, !54, !87, !92, !99, !104}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "coder", scope: !38, file: !33, line: 126, baseType: !41, size: 64)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_coder", file: !33, line: 78, baseType: null)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !38, file: !33, line: 130, baseType: !44, size: 64, offset: 64)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_vli", file: !45, line: 63, baseType: !46)
!45 = !DIFile(filename: "liblzma/api/lzma/vli.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !47, line: 27, baseType: !48)
!47 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !49, line: 45, baseType: !50)
!49 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!50 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !38, file: !33, line: 136, baseType: !52, size: 64, offset: 128)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !53, line: 90, baseType: !50)
!53 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!54 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !38, file: !33, line: 139, baseType: !55, size: 64, offset: 192)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_code_function", file: !33, line: 94, baseType: !56)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!57 = !DISubroutineType(types: !58)
!58 = !{!59, !41, !60, !76, !82, !69, !84, !82, !69, !86}
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_ret", file: !4, line: 237, baseType: !3)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_allocator", file: !4, line: 403, baseType: !62)
!62 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 341, size: 192, elements: !63)
!63 = !{!64, !71, !75}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !62, file: !4, line: 376, baseType: !65, size: 64)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!66 = !DISubroutineType(types: !67)
!67 = !{!68, !68, !69, !69}
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !70, line: 46, baseType: !50)
!70 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!71 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !62, file: !4, line: 390, baseType: !72, size: 64, offset: 64)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!73 = !DISubroutineType(types: !74)
!74 = !{null, !68, !68}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !62, file: !4, line: 401, baseType: !68, size: 64, offset: 128)
!76 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !77)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !79)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !47, line: 24, baseType: !80)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !49, line: 38, baseType: !81)
!81 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!82 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !83)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !85)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_action", file: !4, line: 322, baseType: !19)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !38, file: !33, line: 144, baseType: !88, size: 64, offset: 256)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_end_function", file: !33, line: 102, baseType: !89)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!90 = !DISubroutineType(types: !91)
!91 = !{null, !41, !60}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "get_check", scope: !38, file: !33, line: 148, baseType: !93, size: 64, offset: 320)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = !DISubroutineType(types: !95)
!95 = !{!96, !97}
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_check", file: !26, line: 55, baseType: !25)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !42)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "memconfig", scope: !38, file: !33, line: 152, baseType: !100, size: 64, offset: 384)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = !DISubroutineType(types: !102)
!102 = !{!59, !41, !103, !103, !46}
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !38, file: !33, line: 157, baseType: !105, size: 64, offset: 448)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!106 = !DISubroutineType(types: !107)
!107 = !{!59, !41, !60, !108, !108}
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !110)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_filter", file: !111, line: 65, baseType: !112)
!111 = !DIFile(filename: "liblzma/api/lzma/filter.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!112 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !111, line: 43, size: 128, elements: !113)
!113 = !{!114, !115}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !112, file: !111, line: 54, baseType: !44, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !112, file: !111, line: 63, baseType: !68, size: 64, offset: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !34, file: !33, line: 194, baseType: !32, size: 32, offset: 512)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "avail_in", scope: !34, file: !33, line: 199, baseType: !69, size: 64, offset: 576)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "supported_actions", scope: !34, file: !33, line: 202, baseType: !119, size: 32, offset: 640)
!119 = !DICompositeType(tag: DW_TAG_array_type, baseType: !120, size: 32, elements: !121)
!120 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!121 = !{!122}
!122 = !DISubrange(count: 4)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "allow_buf_error", scope: !34, file: !33, line: 206, baseType: !120, size: 8, offset: 672)
!124 = !{!125, !126, !127, !128, !129, !130}
!125 = !DIEnumerator(name: "ISEQ_RUN", value: 0, isUnsigned: true)
!126 = !DIEnumerator(name: "ISEQ_SYNC_FLUSH", value: 1, isUnsigned: true)
!127 = !DIEnumerator(name: "ISEQ_FULL_FLUSH", value: 2, isUnsigned: true)
!128 = !DIEnumerator(name: "ISEQ_FINISH", value: 3, isUnsigned: true)
!129 = !DIEnumerator(name: "ISEQ_END", value: 4, isUnsigned: true)
!130 = !DIEnumerator(name: "ISEQ_ERROR", value: 5, isUnsigned: true)
!131 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 44, baseType: !5, size: 32, elements: !132)
!132 = !{!133}
!133 = !DIEnumerator(name: "LZMA_RESERVED_ENUM", value: 0, isUnsigned: true)
!134 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !135, line: 138, baseType: !5, size: 32, elements: !136)
!135 = !DIFile(filename: "liblzma/api/lzma/lzma.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!136 = !{!137, !138}
!137 = !DIEnumerator(name: "LZMA_MODE_FAST", value: 1, isUnsigned: true)
!138 = !DIEnumerator(name: "LZMA_MODE_NORMAL", value: 2, isUnsigned: true)
!139 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !135, line: 58, baseType: !5, size: 32, elements: !140)
!140 = !{!141, !142, !143, !144, !145}
!141 = !DIEnumerator(name: "LZMA_MF_HC3", value: 3, isUnsigned: true)
!142 = !DIEnumerator(name: "LZMA_MF_HC4", value: 4, isUnsigned: true)
!143 = !DIEnumerator(name: "LZMA_MF_BT2", value: 18, isUnsigned: true)
!144 = !DIEnumerator(name: "LZMA_MF_BT3", value: 19, isUnsigned: true)
!145 = !DIEnumerator(name: "LZMA_MF_BT4", value: 20, isUnsigned: true)
!146 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !147, file: !1, line: 23, baseType: !5, size: 32, elements: !156)
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_coder_s", file: !1, line: 20, size: 768, elements: !148)
!148 = !{!149, !150, !151, !152}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !147, file: !1, line: 21, baseType: !37, size: 512)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !147, file: !1, line: 26, baseType: !146, size: 32, offset: 512)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "header_pos", scope: !147, file: !1, line: 28, baseType: !69, size: 64, offset: 576)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !147, file: !1, line: 29, baseType: !153, size: 104, offset: 640)
!153 = !DICompositeType(tag: DW_TAG_array_type, baseType: !79, size: 104, elements: !154)
!154 = !{!155}
!155 = !DISubrange(count: 13)
!156 = !{!157, !158}
!157 = !DIEnumerator(name: "SEQ_HEADER", value: 0, isUnsigned: true)
!158 = !DIEnumerator(name: "SEQ_CODE", value: 1, isUnsigned: true)
!159 = !{!52, !68, !160}
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!161 = !{i32 7, !"Dwarf Version", i32 4}
!162 = !{i32 2, !"Debug Info Version", i32 3}
!163 = !{i32 1, !"wchar_size", i32 4}
!164 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!165 = distinct !DISubprogram(name: "lzma_alone_encoder", scope: !1, file: !1, line: 151, type: !166, scopeLine: 152, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !226)
!166 = !DISubroutineType(types: !167)
!167 = !{!59, !168, !193}
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_stream", file: !4, line: 490, baseType: !170)
!170 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 453, size: 1088, elements: !171)
!171 = !{!172, !173, !174, !175, !176, !177, !178, !179, !182, !183, !184, !185, !186, !187, !188, !189, !190, !192}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "next_in", scope: !170, file: !4, line: 454, baseType: !77, size: 64)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "avail_in", scope: !170, file: !4, line: 455, baseType: !69, size: 64, offset: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "total_in", scope: !170, file: !4, line: 456, baseType: !46, size: 64, offset: 128)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "next_out", scope: !170, file: !4, line: 458, baseType: !85, size: 64, offset: 192)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "avail_out", scope: !170, file: !4, line: 459, baseType: !69, size: 64, offset: 256)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "total_out", scope: !170, file: !4, line: 460, baseType: !46, size: 64, offset: 320)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !170, file: !4, line: 468, baseType: !60, size: 64, offset: 384)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !170, file: !4, line: 471, baseType: !180, size: 64, offset: 448)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_internal", file: !4, line: 411, baseType: !34)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr1", scope: !170, file: !4, line: 479, baseType: !68, size: 64, offset: 512)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr2", scope: !170, file: !4, line: 480, baseType: !68, size: 64, offset: 576)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr3", scope: !170, file: !4, line: 481, baseType: !68, size: 64, offset: 640)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr4", scope: !170, file: !4, line: 482, baseType: !68, size: 64, offset: 704)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int1", scope: !170, file: !4, line: 483, baseType: !46, size: 64, offset: 768)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int2", scope: !170, file: !4, line: 484, baseType: !46, size: 64, offset: 832)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int3", scope: !170, file: !4, line: 485, baseType: !69, size: 64, offset: 896)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int4", scope: !170, file: !4, line: 486, baseType: !69, size: 64, offset: 960)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum1", scope: !170, file: !4, line: 487, baseType: !191, size: 32, offset: 1024)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_reserved_enum", file: !4, line: 46, baseType: !131)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum2", scope: !170, file: !4, line: 488, baseType: !191, size: 32, offset: 1056)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!194 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !195)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_options_lzma", file: !135, line: 399, baseType: !196)
!196 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !135, line: 185, size: 896, elements: !197)
!197 = !{!198, !201, !202, !203, !204, !205, !206, !208, !209, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "dict_size", scope: !196, file: !135, line: 217, baseType: !199, size: 32)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !47, line: 26, baseType: !200)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !49, line: 42, baseType: !5)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "preset_dict", scope: !196, file: !135, line: 240, baseType: !77, size: 64, offset: 64)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "preset_dict_size", scope: !196, file: !135, line: 254, baseType: !199, size: 32, offset: 128)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "lc", scope: !196, file: !135, line: 281, baseType: !199, size: 32, offset: 160)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "lp", scope: !196, file: !135, line: 293, baseType: !199, size: 32, offset: 192)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !196, file: !135, line: 316, baseType: !199, size: 32, offset: 224)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !196, file: !135, line: 322, baseType: !207, size: 32, offset: 256)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_mode", file: !135, line: 155, baseType: !134)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "nice_len", scope: !196, file: !135, line: 342, baseType: !199, size: 32, offset: 288)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "mf", scope: !196, file: !135, line: 345, baseType: !210, size: 32, offset: 320)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_match_finder", file: !135, line: 111, baseType: !139)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !196, file: !135, line: 375, baseType: !199, size: 32, offset: 352)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int1", scope: !196, file: !135, line: 384, baseType: !199, size: 32, offset: 384)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int2", scope: !196, file: !135, line: 385, baseType: !199, size: 32, offset: 416)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int3", scope: !196, file: !135, line: 386, baseType: !199, size: 32, offset: 448)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int4", scope: !196, file: !135, line: 387, baseType: !199, size: 32, offset: 480)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int5", scope: !196, file: !135, line: 388, baseType: !199, size: 32, offset: 512)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int6", scope: !196, file: !135, line: 389, baseType: !199, size: 32, offset: 544)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int7", scope: !196, file: !135, line: 390, baseType: !199, size: 32, offset: 576)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int8", scope: !196, file: !135, line: 391, baseType: !199, size: 32, offset: 608)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum1", scope: !196, file: !135, line: 392, baseType: !191, size: 32, offset: 640)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum2", scope: !196, file: !135, line: 393, baseType: !191, size: 32, offset: 672)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum3", scope: !196, file: !135, line: 394, baseType: !191, size: 32, offset: 704)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum4", scope: !196, file: !135, line: 395, baseType: !191, size: 32, offset: 736)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr1", scope: !196, file: !135, line: 396, baseType: !68, size: 64, offset: 768)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr2", scope: !196, file: !135, line: 397, baseType: !68, size: 64, offset: 832)
!226 = !{}
!227 = !DILocalVariable(name: "strm", arg: 1, scope: !165, file: !1, line: 151, type: !168)
!228 = !DILocation(line: 151, column: 33, scope: !165)
!229 = !DILocalVariable(name: "options", arg: 2, scope: !165, file: !1, line: 151, type: !193)
!230 = !DILocation(line: 151, column: 64, scope: !165)
!231 = !DILocation(line: 153, column: 2, scope: !165)
!232 = !DILocation(line: 153, column: 2, scope: !233)
!233 = distinct !DILexicalBlock(scope: !165, file: !1, line: 153, column: 2)
!234 = !DILocalVariable(name: "ret_", scope: !235, file: !1, line: 153, type: !236)
!235 = distinct !DILexicalBlock(scope: !233, file: !1, line: 153, column: 2)
!236 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !59)
!237 = !DILocation(line: 153, column: 2, scope: !235)
!238 = !DILocation(line: 153, column: 2, scope: !239)
!239 = distinct !DILexicalBlock(scope: !235, file: !1, line: 153, column: 2)
!240 = !DILocalVariable(name: "ret_", scope: !233, file: !1, line: 153, type: !236)
!241 = !DILocation(line: 153, column: 2, scope: !242)
!242 = distinct !DILexicalBlock(scope: !233, file: !1, line: 153, column: 2)
!243 = !DILocation(line: 153, column: 2, scope: !244)
!244 = distinct !DILexicalBlock(scope: !242, file: !1, line: 153, column: 2)
!245 = !DILocation(line: 155, column: 2, scope: !165)
!246 = !DILocation(line: 155, column: 8, scope: !165)
!247 = !DILocation(line: 155, column: 18, scope: !165)
!248 = !DILocation(line: 155, column: 46, scope: !165)
!249 = !DILocation(line: 156, column: 2, scope: !165)
!250 = !DILocation(line: 156, column: 8, scope: !165)
!251 = !DILocation(line: 156, column: 18, scope: !165)
!252 = !DILocation(line: 156, column: 49, scope: !165)
!253 = !DILocation(line: 158, column: 2, scope: !165)
!254 = !DILocation(line: 159, column: 1, scope: !165)
!255 = distinct !DISubprogram(name: "alone_encoder_init", scope: !1, file: !1, line: 80, type: !256, scopeLine: 82, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !226)
!256 = !DISubroutineType(types: !257)
!257 = !{!59, !258, !60, !193}
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!259 = !DILocalVariable(name: "next", arg: 1, scope: !255, file: !1, line: 80, type: !258)
!260 = !DILocation(line: 80, column: 37, scope: !255)
!261 = !DILocalVariable(name: "allocator", arg: 2, scope: !255, file: !1, line: 80, type: !60)
!262 = !DILocation(line: 80, column: 59, scope: !255)
!263 = !DILocalVariable(name: "options", arg: 3, scope: !255, file: !1, line: 81, type: !193)
!264 = !DILocation(line: 81, column: 28, scope: !255)
!265 = !DILocation(line: 83, column: 2, scope: !255)
!266 = !DILocation(line: 83, column: 2, scope: !267)
!267 = distinct !DILexicalBlock(scope: !268, file: !1, line: 83, column: 2)
!268 = distinct !DILexicalBlock(scope: !255, file: !1, line: 83, column: 2)
!269 = !DILocation(line: 83, column: 2, scope: !268)
!270 = !DILocation(line: 85, column: 6, scope: !271)
!271 = distinct !DILexicalBlock(scope: !255, file: !1, line: 85, column: 6)
!272 = !DILocation(line: 85, column: 12, scope: !271)
!273 = !DILocation(line: 85, column: 18, scope: !271)
!274 = !DILocation(line: 85, column: 6, scope: !255)
!275 = !DILocation(line: 86, column: 57, scope: !276)
!276 = distinct !DILexicalBlock(scope: !271, file: !1, line: 85, column: 27)
!277 = !DILocation(line: 86, column: 17, scope: !276)
!278 = !DILocation(line: 86, column: 3, scope: !276)
!279 = !DILocation(line: 86, column: 9, scope: !276)
!280 = !DILocation(line: 86, column: 15, scope: !276)
!281 = !DILocation(line: 87, column: 7, scope: !282)
!282 = distinct !DILexicalBlock(scope: !276, file: !1, line: 87, column: 7)
!283 = !DILocation(line: 87, column: 13, scope: !282)
!284 = !DILocation(line: 87, column: 19, scope: !282)
!285 = !DILocation(line: 87, column: 7, scope: !276)
!286 = !DILocation(line: 88, column: 4, scope: !282)
!287 = !DILocation(line: 90, column: 3, scope: !276)
!288 = !DILocation(line: 90, column: 9, scope: !276)
!289 = !DILocation(line: 90, column: 14, scope: !276)
!290 = !DILocation(line: 91, column: 3, scope: !276)
!291 = !DILocation(line: 91, column: 9, scope: !276)
!292 = !DILocation(line: 91, column: 13, scope: !276)
!293 = !DILocation(line: 92, column: 26, scope: !276)
!294 = !DILocation(line: 92, column: 32, scope: !276)
!295 = !DILocation(line: 92, column: 4, scope: !276)
!296 = !DILocation(line: 92, column: 40, scope: !276)
!297 = !DILocation(line: 92, column: 47, scope: !276)
!298 = !DILocation(line: 93, column: 2, scope: !276)
!299 = !DILocation(line: 96, column: 25, scope: !255)
!300 = !DILocation(line: 96, column: 31, scope: !255)
!301 = !DILocation(line: 96, column: 3, scope: !255)
!302 = !DILocation(line: 96, column: 39, scope: !255)
!303 = !DILocation(line: 96, column: 48, scope: !255)
!304 = !DILocation(line: 97, column: 25, scope: !255)
!305 = !DILocation(line: 97, column: 31, scope: !255)
!306 = !DILocation(line: 97, column: 3, scope: !255)
!307 = !DILocation(line: 97, column: 39, scope: !255)
!308 = !DILocation(line: 97, column: 50, scope: !255)
!309 = !DILocation(line: 101, column: 30, scope: !310)
!310 = distinct !DILexicalBlock(scope: !255, file: !1, line: 101, column: 6)
!311 = !DILocation(line: 101, column: 62, scope: !310)
!312 = !DILocation(line: 101, column: 68, scope: !310)
!313 = !DILocation(line: 101, column: 40, scope: !310)
!314 = !DILocation(line: 101, column: 76, scope: !310)
!315 = !DILocation(line: 101, column: 39, scope: !310)
!316 = !DILocation(line: 101, column: 6, scope: !310)
!317 = !DILocation(line: 101, column: 6, scope: !255)
!318 = !DILocation(line: 102, column: 3, scope: !310)
!319 = !DILocation(line: 105, column: 6, scope: !320)
!320 = distinct !DILexicalBlock(scope: !255, file: !1, line: 105, column: 6)
!321 = !DILocation(line: 105, column: 15, scope: !320)
!322 = !DILocation(line: 105, column: 25, scope: !320)
!323 = !DILocation(line: 105, column: 6, scope: !255)
!324 = !DILocation(line: 106, column: 3, scope: !320)
!325 = !DILocalVariable(name: "d", scope: !255, file: !1, line: 112, type: !199)
!326 = !DILocation(line: 112, column: 11, scope: !255)
!327 = !DILocation(line: 112, column: 15, scope: !255)
!328 = !DILocation(line: 112, column: 24, scope: !255)
!329 = !DILocation(line: 112, column: 34, scope: !255)
!330 = !DILocation(line: 113, column: 7, scope: !255)
!331 = !DILocation(line: 113, column: 9, scope: !255)
!332 = !DILocation(line: 113, column: 4, scope: !255)
!333 = !DILocation(line: 114, column: 7, scope: !255)
!334 = !DILocation(line: 114, column: 9, scope: !255)
!335 = !DILocation(line: 114, column: 4, scope: !255)
!336 = !DILocation(line: 115, column: 7, scope: !255)
!337 = !DILocation(line: 115, column: 9, scope: !255)
!338 = !DILocation(line: 115, column: 4, scope: !255)
!339 = !DILocation(line: 116, column: 7, scope: !255)
!340 = !DILocation(line: 116, column: 9, scope: !255)
!341 = !DILocation(line: 116, column: 4, scope: !255)
!342 = !DILocation(line: 117, column: 7, scope: !255)
!343 = !DILocation(line: 117, column: 9, scope: !255)
!344 = !DILocation(line: 117, column: 4, scope: !255)
!345 = !DILocation(line: 118, column: 6, scope: !346)
!346 = distinct !DILexicalBlock(scope: !255, file: !1, line: 118, column: 6)
!347 = !DILocation(line: 118, column: 8, scope: !346)
!348 = !DILocation(line: 118, column: 6, scope: !255)
!349 = !DILocation(line: 119, column: 3, scope: !346)
!350 = !DILocation(line: 121, column: 45, scope: !255)
!351 = !DILocation(line: 121, column: 51, scope: !255)
!352 = !DILocation(line: 121, column: 23, scope: !255)
!353 = !DILocation(line: 121, column: 59, scope: !255)
!354 = !DILocation(line: 121, column: 22, scope: !255)
!355 = !DILocation(line: 121, column: 66, scope: !255)
!356 = !DILocation(line: 121, column: 71, scope: !255)
!357 = !DILocation(line: 121, column: 2, scope: !255)
!358 = !DILocation(line: 124, column: 32, scope: !255)
!359 = !DILocation(line: 124, column: 38, scope: !255)
!360 = !DILocation(line: 124, column: 10, scope: !255)
!361 = !DILocation(line: 124, column: 46, scope: !255)
!362 = !DILocation(line: 124, column: 9, scope: !255)
!363 = !DILocation(line: 124, column: 53, scope: !255)
!364 = !DILocation(line: 124, column: 57, scope: !255)
!365 = !DILocation(line: 124, column: 2, scope: !255)
!366 = !DILocalVariable(name: "filters", scope: !255, file: !1, line: 127, type: !367)
!367 = !DICompositeType(tag: DW_TAG_array_type, baseType: !368, size: 384, elements: !380)
!368 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !369)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_filter_info", file: !33, line: 82, baseType: !370)
!370 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_filter_info_s", file: !33, line: 109, size: 192, elements: !371)
!371 = !{!372, !373, !379}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !370, file: !33, line: 112, baseType: !44, size: 64)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !370, file: !33, line: 116, baseType: !374, size: 64, offset: 64)
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_init_function", file: !33, line: 86, baseType: !375)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64)
!376 = !DISubroutineType(types: !377)
!377 = !{!59, !258, !60, !378}
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !370, file: !33, line: 119, baseType: !68, size: 64, offset: 128)
!380 = !{!381}
!381 = !DISubrange(count: 2)
!382 = !DILocation(line: 127, column: 25, scope: !255)
!383 = !DILocation(line: 127, column: 38, scope: !255)
!384 = !DILocation(line: 128, column: 3, scope: !255)
!385 = !DILocation(line: 130, column: 24, scope: !255)
!386 = !DILocation(line: 130, column: 15, scope: !255)
!387 = !DILocation(line: 136, column: 55, scope: !255)
!388 = !DILocation(line: 136, column: 61, scope: !255)
!389 = !DILocation(line: 136, column: 33, scope: !255)
!390 = !DILocation(line: 136, column: 69, scope: !255)
!391 = !DILocation(line: 136, column: 75, scope: !255)
!392 = !DILocation(line: 136, column: 86, scope: !255)
!393 = !DILocation(line: 136, column: 9, scope: !255)
!394 = !DILocation(line: 136, column: 2, scope: !255)
!395 = !DILocation(line: 137, column: 1, scope: !255)
!396 = distinct !DISubprogram(name: "alone_encode", scope: !1, file: !1, line: 34, type: !57, scopeLine: 40, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !226)
!397 = !DILocalVariable(name: "pcoder", arg: 1, scope: !396, file: !1, line: 34, type: !41)
!398 = !DILocation(line: 34, column: 26, scope: !396)
!399 = !DILocalVariable(name: "allocator", arg: 2, scope: !396, file: !1, line: 35, type: !60)
!400 = !DILocation(line: 35, column: 19, scope: !396)
!401 = !DILocalVariable(name: "in", arg: 3, scope: !396, file: !1, line: 36, type: !76)
!402 = !DILocation(line: 36, column: 27, scope: !396)
!403 = !DILocalVariable(name: "in_pos", arg: 4, scope: !396, file: !1, line: 36, type: !82)
!404 = !DILocation(line: 36, column: 48, scope: !396)
!405 = !DILocalVariable(name: "in_size", arg: 5, scope: !396, file: !1, line: 37, type: !69)
!406 = !DILocation(line: 37, column: 10, scope: !396)
!407 = !DILocalVariable(name: "out", arg: 6, scope: !396, file: !1, line: 37, type: !84)
!408 = !DILocation(line: 37, column: 37, scope: !396)
!409 = !DILocalVariable(name: "out_pos", arg: 7, scope: !396, file: !1, line: 38, type: !82)
!410 = !DILocation(line: 38, column: 20, scope: !396)
!411 = !DILocalVariable(name: "out_size", arg: 8, scope: !396, file: !1, line: 38, type: !69)
!412 = !DILocation(line: 38, column: 36, scope: !396)
!413 = !DILocalVariable(name: "action", arg: 9, scope: !396, file: !1, line: 39, type: !86)
!414 = !DILocation(line: 39, column: 15, scope: !396)
!415 = !DILocalVariable(name: "coder", scope: !396, file: !1, line: 41, type: !160)
!416 = !DILocation(line: 41, column: 23, scope: !396)
!417 = !DILocation(line: 41, column: 31, scope: !396)
!418 = !DILocation(line: 42, column: 2, scope: !396)
!419 = !DILocation(line: 42, column: 10, scope: !396)
!420 = !DILocation(line: 42, column: 9, scope: !396)
!421 = !DILocation(line: 42, column: 20, scope: !396)
!422 = !DILocation(line: 42, column: 18, scope: !396)
!423 = !DILocation(line: 43, column: 10, scope: !396)
!424 = !DILocation(line: 43, column: 17, scope: !396)
!425 = !DILocation(line: 43, column: 2, scope: !396)
!426 = !DILocation(line: 45, column: 15, scope: !427)
!427 = distinct !DILexicalBlock(scope: !396, file: !1, line: 43, column: 27)
!428 = !DILocation(line: 45, column: 22, scope: !427)
!429 = !DILocation(line: 45, column: 31, scope: !427)
!430 = !DILocation(line: 45, column: 38, scope: !427)
!431 = !DILocation(line: 47, column: 5, scope: !427)
!432 = !DILocation(line: 47, column: 10, scope: !427)
!433 = !DILocation(line: 47, column: 19, scope: !427)
!434 = !DILocation(line: 45, column: 3, scope: !427)
!435 = !DILocation(line: 48, column: 7, scope: !436)
!436 = distinct !DILexicalBlock(scope: !427, file: !1, line: 48, column: 7)
!437 = !DILocation(line: 48, column: 14, scope: !436)
!438 = !DILocation(line: 48, column: 25, scope: !436)
!439 = !DILocation(line: 48, column: 7, scope: !427)
!440 = !DILocation(line: 49, column: 4, scope: !436)
!441 = !DILocation(line: 51, column: 3, scope: !427)
