; ModuleID = 'liblzma/common/block_header_decoder.c'
source_filename = "liblzma/common/block_header_decoder.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.lzma_block = type { i32, i32, i32, i64, i64, %struct.lzma_filter*, [64 x i8], i8*, i8*, i8*, i32, i32, i64, i64, i64, i64, i64, i64, i32, i32, i32, i32, i8, i8, i8, i8, i8, i8, i8, i8 }
%struct.lzma_filter = type { i64, i8* }
%struct.lzma_allocator = type { i8* (i8*, i64, i64)*, void (i8*, i8*)*, i8* }

; Function Attrs: noinline nounwind uwtable
define dso_local i32 @lzma_block_header_decode(%struct.lzma_block* %block, %struct.lzma_allocator* %allocator, i8* %in) #0 !dbg !39 {
entry:
  %retval = alloca i32, align 4
  %block.addr = alloca %struct.lzma_block*, align 8
  %allocator.addr = alloca %struct.lzma_allocator*, align 8
  %in.addr = alloca i8*, align 8
  %i = alloca i64, align 8
  %in_size = alloca i64, align 8
  %in_pos = alloca i64, align 8
  %ret_ = alloca i32, align 4
  %ret_42 = alloca i32, align 4
  %filter_count = alloca i64, align 8
  %i57 = alloca i64, align 8
  %ret = alloca i32, align 4
  store %struct.lzma_block* %block, %struct.lzma_block** %block.addr, align 8
  call void @llvm.dbg.declare(metadata %struct.lzma_block** %block.addr, metadata !117, metadata !DIExpression()), !dbg !118
  store %struct.lzma_allocator* %allocator, %struct.lzma_allocator** %allocator.addr, align 8

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !29, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "liblzma/common/block_header_decoder.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!2 = !{!3, !19, !26}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 57, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "liblzma/api/lzma/base.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18}
!7 = !DIEnumerator(name: "LZMA_OK", value: 0, isUnsigned: true)
!8 = !DIEnumerator(name: "LZMA_STREAM_END", value: 1, isUnsigned: true)
!9 = !DIEnumerator(name: "LZMA_NO_CHECK", value: 2, isUnsigned: true)
!10 = !DIEnumerator(name: "LZMA_UNSUPPORTED_CHECK", value: 3, isUnsigned: true)
!11 = !DIEnumerator(name: "LZMA_GET_CHECK", value: 4, isUnsigned: true)
!12 = !DIEnumerator(name: "LZMA_MEM_ERROR", value: 5, isUnsigned: true)
!13 = !DIEnumerator(name: "LZMA_MEMLIMIT_ERROR", value: 6, isUnsigned: true)
!14 = !DIEnumerator(name: "LZMA_FORMAT_ERROR", value: 7, isUnsigned: true)
!15 = !DIEnumerator(name: "LZMA_OPTIONS_ERROR", value: 8, isUnsigned: true)
!16 = !DIEnumerator(name: "LZMA_DATA_ERROR", value: 9, isUnsigned: true)
!17 = !DIEnumerator(name: "LZMA_BUF_ERROR", value: 10, isUnsigned: true)
!18 = !DIEnumerator(name: "LZMA_PROG_ERROR", value: 11, isUnsigned: true)
!19 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !20, line: 27, baseType: !5, size: 32, elements: !21)
!20 = !DIFile(filename: "liblzma/api/lzma/check.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!21 = !{!22, !23, !24, !25}
!22 = !DIEnumerator(name: "LZMA_CHECK_NONE", value: 0, isUnsigned: true)
!23 = !DIEnumerator(name: "LZMA_CHECK_CRC32", value: 1, isUnsigned: true)
!24 = !DIEnumerator(name: "LZMA_CHECK_CRC64", value: 4, isUnsigned: true)
!25 = !DIEnumerator(name: "LZMA_CHECK_SHA256", value: 10, isUnsigned: true)
!26 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 44, baseType: !5, size: 32, elements: !27)
!27 = !{!28}
!28 = !DIEnumerator(name: "LZMA_RESERVED_ENUM", value: 0, isUnsigned: true)
!29 = !{!30, !31, !5}
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !32, line: 26, baseType: !33)
!32 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !34, line: 42, baseType: !5)
!34 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!35 = !{i32 7, !"Dwarf Version", i32 4}
!36 = !{i32 2, !"Debug Info Version", i32 3}
!37 = !{i32 1, !"wchar_size", i32 4}
!38 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!39 = distinct !DISubprogram(name: "lzma_block_header_decode", scope: !1, file: !1, line: 34, type: !40, scopeLine: 36, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !116)
!40 = !DISubroutineType(types: !41)
!41 = !{!42, !43, !99, !114}
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_ret", file: !4, line: 237, baseType: !3)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_block", file: !45, line: 245, baseType: !46)
!45 = !DIFile(filename: "liblzma/api/lzma/block.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!46 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !45, line: 30, size: 1664, elements: !47)
!47 = !{!48, !49, !50, !52, !58, !59, !67, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !87, !88, !89, !90, !92, !93, !94, !95, !96, !97, !98}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !46, file: !45, line: 47, baseType: !31, size: 32)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "header_size", scope: !46, file: !45, line: 67, baseType: !31, size: 32, offset: 32)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !46, file: !45, line: 88, baseType: !51, size: 32, offset: 64)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_check", file: !20, line: 55, baseType: !19)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "compressed_size", scope: !46, file: !45, line: 143, baseType: !53, size: 64, offset: 128)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_vli", file: !54, line: 63, baseType: !55)
!54 = !DIFile(filename: "liblzma/api/lzma/vli.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !32, line: 27, baseType: !56)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !34, line: 45, baseType: !57)
!57 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "uncompressed_size", scope: !46, file: !45, line: 167, baseType: !53, size: 64, offset: 192)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "filters", scope: !46, file: !45, line: 195, baseType: !60, size: 64, offset: 256)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_filter", file: !62, line: 65, baseType: !63)
!62 = !DIFile(filename: "liblzma/api/lzma/filter.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!63 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !62, line: 43, size: 128, elements: !64)
!64 = !{!65, !66}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !63, file: !62, line: 54, baseType: !53, size: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !63, file: !62, line: 63, baseType: !30, size: 64, offset: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "raw_check", scope: !46, file: !45, line: 212, baseType: !68, size: 512, offset: 320)
!68 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 512, elements: !72)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !32, line: 24, baseType: !70)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !34, line: 38, baseType: !71)
!71 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!72 = !{!73}
!73 = !DISubrange(count: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr1", scope: !46, file: !45, line: 221, baseType: !30, size: 64, offset: 832)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr2", scope: !46, file: !45, line: 222, baseType: !30, size: 64, offset: 896)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr3", scope: !46, file: !45, line: 223, baseType: !30, size: 64, offset: 960)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int1", scope: !46, file: !45, line: 224, baseType: !31, size: 32, offset: 1024)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int2", scope: !46, file: !45, line: 225, baseType: !31, size: 32, offset: 1056)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int3", scope: !46, file: !45, line: 226, baseType: !53, size: 64, offset: 1088)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int4", scope: !46, file: !45, line: 227, baseType: !53, size: 64, offset: 1152)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int5", scope: !46, file: !45, line: 228, baseType: !53, size: 64, offset: 1216)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int6", scope: !46, file: !45, line: 229, baseType: !53, size: 64, offset: 1280)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int7", scope: !46, file: !45, line: 230, baseType: !53, size: 64, offset: 1344)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int8", scope: !46, file: !45, line: 231, baseType: !53, size: 64, offset: 1408)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum1", scope: !46, file: !45, line: 232, baseType: !86, size: 32, offset: 1472)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_reserved_enum", file: !4, line: 46, baseType: !26)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum2", scope: !46, file: !45, line: 233, baseType: !86, size: 32, offset: 1504)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum3", scope: !46, file: !45, line: 234, baseType: !86, size: 32, offset: 1536)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum4", scope: !46, file: !45, line: 235, baseType: !86, size: 32, offset: 1568)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool1", scope: !46, file: !45, line: 236, baseType: !91, size: 8, offset: 1600)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_bool", file: !4, line: 29, baseType: !71)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool2", scope: !46, file: !45, line: 237, baseType: !91, size: 8, offset: 1608)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool3", scope: !46, file: !45, line: 238, baseType: !91, size: 8, offset: 1616)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool4", scope: !46, file: !45, line: 239, baseType: !91, size: 8, offset: 1624)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool5", scope: !46, file: !45, line: 240, baseType: !91, size: 8, offset: 1632)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool6", scope: !46, file: !45, line: 241, baseType: !91, size: 8, offset: 1640)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool7", scope: !46, file: !45, line: 242, baseType: !91, size: 8, offset: 1648)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool8", scope: !46, file: !45, line: 243, baseType: !91, size: 8, offset: 1656)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_allocator", file: !4, line: 403, baseType: !101)
!101 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 341, size: 192, elements: !102)
!102 = !{!103, !109, !113}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !101, file: !4, line: 376, baseType: !104, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!105 = !DISubroutineType(types: !106)
!106 = !{!30, !30, !107, !107}
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !108, line: 46, baseType: !57)
!108 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!109 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !101, file: !4, line: 390, baseType: !110, size: 64, offset: 64)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DISubroutineType(types: !112)
!112 = !{null, !30, !30}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !101, file: !4, line: 401, baseType: !30, size: 64, offset: 128)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !69)
!116 = !{}
!117 = !DILocalVariable(name: "block", arg: 1, scope: !39, file: !1, line: 34, type: !43)
!118 = !DILocation(line: 34, column: 38, scope: !39)
!119 = !DILocalVariable(name: "allocator", arg: 2, scope: !39, file: !1, line: 35, type: !99)
!120 = !DILocation(line: 35, column: 19, scope: !39)
!121 = !DILocalVariable(name: "in", arg: 3, scope: !39, file: !1, line: 35, type: !114)
!122 = !DILocation(line: 35, column: 45, scope: !39)
!123 = !DILocalVariable(name: "i", scope: !124, file: !1, line: 44, type: !107)
!124 = distinct !DILexicalBlock(scope: !39, file: !1, line: 44, column: 2)
!125 = !DILocation(line: 44, column: 14, scope: !124)
!126 = !DILocation(line: 44, column: 7, scope: !124)
!127 = !DILocation(line: 44, column: 21, scope: !128)
!128 = distinct !DILexicalBlock(scope: !124, file: !1, line: 44, column: 2)
!129 = !DILocation(line: 44, column: 23, scope: !128)
!130 = !DILocation(line: 44, column: 2, scope: !124)
!131 = !DILocation(line: 45, column: 3, scope: !132)
!132 = distinct !DILexicalBlock(scope: !128, file: !1, line: 44, column: 49)
!133 = !DILocation(line: 45, column: 10, scope: !132)
!134 = !DILocation(line: 45, column: 18, scope: !132)
!135 = !DILocation(line: 45, column: 21, scope: !132)
!136 = !DILocation(line: 45, column: 24, scope: !132)
!137 = !DILocation(line: 46, column: 3, scope: !132)
!138 = !DILocation(line: 46, column: 10, scope: !132)
!139 = !DILocation(line: 46, column: 18, scope: !132)
!140 = !DILocation(line: 46, column: 21, scope: !132)
!141 = !DILocation(line: 46, column: 29, scope: !132)
!142 = !DILocation(line: 47, column: 2, scope: !132)
!143 = !DILocation(line: 44, column: 44, scope: !128)
!144 = !DILocation(line: 44, column: 2, scope: !128)
!145 = distinct !{!145, !130, !146}
!146 = !DILocation(line: 47, column: 2, scope: !124)
!147 = !DILocation(line: 50, column: 2, scope: !39)
!148 = !DILocation(line: 50, column: 9, scope: !39)
!149 = !DILocation(line: 50, column: 17, scope: !39)
!150 = !DILocation(line: 54, column: 6, scope: !151)
!151 = distinct !DILexicalBlock(scope: !39, file: !1, line: 54, column: 6)
!152 = !DILocation(line: 54, column: 46, scope: !151)
!153 = !DILocation(line: 54, column: 53, scope: !151)
!154 = !DILocation(line: 54, column: 43, scope: !151)
!155 = !DILocation(line: 55, column: 4, scope: !151)
!156 = !DILocation(line: 55, column: 22, scope: !151)
!157 = !DILocation(line: 55, column: 29, scope: !151)
!158 = !DILocation(line: 55, column: 36, scope: !151)
!159 = !DILocation(line: 54, column: 6, scope: !39)
!160 = !DILocation(line: 56, column: 3, scope: !151)
!161 = !DILocalVariable(name: "in_size", scope: !39, file: !1, line: 59, type: !162)
!162 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !107)
!163 = !DILocation(line: 59, column: 15, scope: !39)
!164 = !DILocation(line: 59, column: 25, scope: !39)
!165 = !DILocation(line: 59, column: 32, scope: !39)
!166 = !DILocation(line: 59, column: 44, scope: !39)
!167 = !DILocation(line: 62, column: 17, scope: !168)
!168 = distinct !DILexicalBlock(scope: !39, file: !1, line: 62, column: 6)
!169 = !DILocation(line: 62, column: 21, scope: !168)
!170 = !DILocation(line: 62, column: 6, scope: !168)
!171 = !DILocation(line: 62, column: 55, scope: !168)
!172 = !DILocation(line: 62, column: 60, scope: !168)
!173 = !DILocation(line: 62, column: 58, scope: !168)
!174 = !DILocation(line: 62, column: 36, scope: !168)
!175 = !DILocation(line: 62, column: 33, scope: !168)
!176 = !DILocation(line: 62, column: 6, scope: !39)
!177 = !DILocation(line: 63, column: 3, scope: !168)
!178 = !DILocation(line: 66, column: 6, scope: !179)
!179 = distinct !DILexicalBlock(scope: !39, file: !1, line: 66, column: 6)
!180 = !DILocation(line: 66, column: 12, scope: !179)
