; ModuleID = 'liblzma/common/index_hash.c'
source_filename = "liblzma/common/index_hash.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.lzma_index_hash_s = type { i32, %struct.lzma_index_hash_info, %struct.lzma_index_hash_info, i64, i64, i64, i64, i32 }
%struct.lzma_index_hash_info = type { i64, i64, i64, i64, %struct.lzma_check_state }
%struct.lzma_check_state = type { %union.anon, %union.anon.0 }
%union.anon = type { [8 x i64] }
%union.anon.0 = type { %struct.anon }
%struct.anon = type { [8 x i32], i64 }
%struct.lzma_allocator = type { i8* (i8*, i64, i64)*, void (i8*, i8*)*, i8* }

; Function Attrs: noinline nounwind uwtable
define dso_local %struct.lzma_index_hash_s* @lzma_index_hash_init(%struct.lzma_index_hash_s* %index_hash, %struct.lzma_allocator* %allocator) #0 !dbg !105 {
entry:
  %retval = alloca %struct.lzma_index_hash_s*, align 8
  %index_hash.addr = alloca %struct.lzma_index_hash_s*, align 8
  %allocator.addr = alloca %struct.lzma_allocator*, align 8
  store %struct.lzma_index_hash_s* %index_hash, %struct.lzma_index_hash_s** %index_hash.addr, align 8
  call void @llvm.dbg.declare(metadata %struct.lzma_index_hash_s** %index_hash.addr, metadata !125, metadata !DIExpression()), !dbg !126
  store %struct.lzma_allocator* %allocator, %struct.lzma_allocator** %allocator.addr, align 8

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !97, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "liblzma/common/index_hash.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!2 = !{!3, !75, !82}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !4, file: !1, line: 38, baseType: !41, size: 32, elements: !67)
!4 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_index_hash_s", file: !1, line: 37, size: 2560, elements: !5)
!5 = !{!6, !7, !59, !60, !61, !62, !63, !66}
!6 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !4, file: !1, line: 46, baseType: !3, size: 32)
!7 = !DIDerivedType(tag: DW_TAG_member, name: "blocks", scope: !4, file: !1, line: 49, baseType: !8, size: 1088, offset: 64)
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_index_hash_info", file: !1, line: 34, baseType: !9)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1, line: 18, size: 1088, elements: !10)
!10 = !{!11, !19, !20, !21, !22}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "blocks_size", scope: !9, file: !1, line: 20, baseType: !12, size: 64)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_vli", file: !13, line: 63, baseType: !14)
!13 = !DIFile(filename: "liblzma/api/lzma/vli.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !15, line: 27, baseType: !16)
!15 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !17, line: 45, baseType: !18)
!17 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!18 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "uncompressed_size", scope: !9, file: !1, line: 23, baseType: !12, size: 64, offset: 64)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !9, file: !1, line: 26, baseType: !12, size: 64, offset: 128)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "index_list_size", scope: !9, file: !1, line: 29, baseType: !12, size: 64, offset: 192)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !9, file: !1, line: 32, baseType: !23, size: 832, offset: 256)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_check_state", file: !24, line: 56, baseType: !25)
!24 = !DIFile(filename: "liblzma/check/check.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!25 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !24, line: 34, size: 832, elements: !26)
!26 = !{!27, !48}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !25, file: !24, line: 40, baseType: !28, size: 512)
!28 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !25, file: !24, line: 36, size: 512, elements: !29)
!29 = !{!30, !37, !44}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "u8", scope: !28, file: !24, line: 37, baseType: !31, size: 512)
!31 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 512, elements: !35)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !15, line: 24, baseType: !33)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !17, line: 38, baseType: !34)
!34 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!35 = !{!36}
!36 = !DISubrange(count: 64)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "u32", scope: !28, file: !24, line: 38, baseType: !38, size: 512)
!38 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 512, elements: !42)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !15, line: 26, baseType: !40)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !17, line: 42, baseType: !41)
!41 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!42 = !{!43}
!43 = !DISubrange(count: 16)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "u64", scope: !28, file: !24, line: 39, baseType: !45, size: 512)
!45 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 512, elements: !46)
!46 = !{!47}
!47 = !DISubrange(count: 8)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !25, file: !24, line: 54, baseType: !49, size: 320, offset: 512)
!49 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !25, file: !24, line: 43, size: 320, elements: !50)
!50 = !{!51, !52, !53}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "crc32", scope: !49, file: !24, line: 44, baseType: !39, size: 32)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "crc64", scope: !49, file: !24, line: 45, baseType: !14, size: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "sha256", scope: !49, file: !24, line: 53, baseType: !54, size: 320)
!54 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !49, file: !24, line: 47, size: 320, elements: !55)
!55 = !{!56, !58}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !54, file: !24, line: 49, baseType: !57, size: 256)
!57 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 256, elements: !46)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !54, file: !24, line: 52, baseType: !14, size: 64, offset: 256)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "records", scope: !4, file: !1, line: 52, baseType: !8, size: 1088, offset: 1152)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "remaining", scope: !4, file: !1, line: 55, baseType: !12, size: 64, offset: 2240)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "unpadded_size", scope: !4, file: !1, line: 58, baseType: !12, size: 64, offset: 2304)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "uncompressed_size", scope: !4, file: !1, line: 61, baseType: !12, size: 64, offset: 2368)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !4, file: !1, line: 65, baseType: !64, size: 64, offset: 2432)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !65, line: 46, baseType: !18)
!65 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!66 = !DIDerivedType(tag: DW_TAG_member, name: "crc32", scope: !4, file: !1, line: 68, baseType: !39, size: 32, offset: 2496)
!67 = !{!68, !69, !70, !71, !72, !73, !74}
!68 = !DIEnumerator(name: "SEQ_BLOCK", value: 0, isUnsigned: true)
!69 = !DIEnumerator(name: "SEQ_COUNT", value: 1, isUnsigned: true)
!70 = !DIEnumerator(name: "SEQ_UNPADDED", value: 2, isUnsigned: true)
!71 = !DIEnumerator(name: "SEQ_UNCOMPRESSED", value: 3, isUnsigned: true)
!72 = !DIEnumerator(name: "SEQ_PADDING_INIT", value: 4, isUnsigned: true)
!73 = !DIEnumerator(name: "SEQ_PADDING", value: 5, isUnsigned: true)
!74 = !DIEnumerator(name: "SEQ_CRC32", value: 6, isUnsigned: true)
!75 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !76, line: 27, baseType: !41, size: 32, elements: !77)
!76 = !DIFile(filename: "liblzma/api/lzma/check.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!77 = !{!78, !79, !80, !81}
!78 = !DIEnumerator(name: "LZMA_CHECK_NONE", value: 0, isUnsigned: true)
!79 = !DIEnumerator(name: "LZMA_CHECK_CRC32", value: 1, isUnsigned: true)
!80 = !DIEnumerator(name: "LZMA_CHECK_CRC64", value: 4, isUnsigned: true)
!81 = !DIEnumerator(name: "LZMA_CHECK_SHA256", value: 10, isUnsigned: true)
!82 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !83, line: 57, baseType: !41, size: 32, elements: !84)
!83 = !DIFile(filename: "liblzma/api/lzma/base.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!84 = !{!85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96}
!85 = !DIEnumerator(name: "LZMA_OK", value: 0, isUnsigned: true)
!86 = !DIEnumerator(name: "LZMA_STREAM_END", value: 1, isUnsigned: true)
!87 = !DIEnumerator(name: "LZMA_NO_CHECK", value: 2, isUnsigned: true)
!88 = !DIEnumerator(name: "LZMA_UNSUPPORTED_CHECK", value: 3, isUnsigned: true)
!89 = !DIEnumerator(name: "LZMA_GET_CHECK", value: 4, isUnsigned: true)
!90 = !DIEnumerator(name: "LZMA_MEM_ERROR", value: 5, isUnsigned: true)
!91 = !DIEnumerator(name: "LZMA_MEMLIMIT_ERROR", value: 6, isUnsigned: true)
!92 = !DIEnumerator(name: "LZMA_FORMAT_ERROR", value: 7, isUnsigned: true)
!93 = !DIEnumerator(name: "LZMA_OPTIONS_ERROR", value: 8, isUnsigned: true)
!94 = !DIEnumerator(name: "LZMA_DATA_ERROR", value: 9, isUnsigned: true)
!95 = !DIEnumerator(name: "LZMA_BUF_ERROR", value: 10, isUnsigned: true)
!96 = !DIEnumerator(name: "LZMA_PROG_ERROR", value: 11, isUnsigned: true)
!97 = !{!98, !99}
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !32)
!101 = !{i32 7, !"Dwarf Version", i32 4}
!102 = !{i32 2, !"Debug Info Version", i32 3}
!103 = !{i32 1, !"wchar_size", i32 4}
!104 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!105 = distinct !DISubprogram(name: "lzma_index_hash_init", scope: !1, file: !1, line: 73, type: !106, scopeLine: 74, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !124)
!106 = !DISubroutineType(types: !107)
!107 = !{!108, !108, !111}
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_index_hash", file: !110, line: 25, baseType: !4)
!110 = !DIFile(filename: "liblzma/api/lzma/index_hash.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_allocator", file: !83, line: 403, baseType: !113)
!113 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !83, line: 341, size: 192, elements: !114)
!114 = !{!115, !119, !123}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !113, file: !83, line: 376, baseType: !116, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DISubroutineType(types: !118)
!118 = !{!98, !98, !64, !64}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !113, file: !83, line: 390, baseType: !120, size: 64, offset: 64)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = !DISubroutineType(types: !122)
!122 = !{null, !98, !98}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !113, file: !83, line: 401, baseType: !98, size: 64, offset: 128)
!124 = !{}
!125 = !DILocalVariable(name: "index_hash", arg: 1, scope: !105, file: !1, line: 73, type: !108)
!126 = !DILocation(line: 73, column: 39, scope: !105)
!127 = !DILocalVariable(name: "allocator", arg: 2, scope: !105, file: !1, line: 73, type: !111)
!128 = !DILocation(line: 73, column: 67, scope: !105)
!129 = !DILocation(line: 75, column: 6, scope: !130)
!130 = distinct !DILexicalBlock(scope: !105, file: !1, line: 75, column: 6)
!131 = !DILocation(line: 75, column: 17, scope: !130)
!132 = !DILocation(line: 75, column: 6, scope: !105)
!133 = !DILocation(line: 76, column: 52, scope: !134)
!134 = distinct !DILexicalBlock(scope: !130, file: !1, line: 75, column: 26)
!135 = !DILocation(line: 76, column: 16, scope: !134)
!136 = !DILocation(line: 76, column: 14, scope: !134)
!137 = !DILocation(line: 77, column: 7, scope: !138)
!138 = distinct !DILexicalBlock(scope: !134, file: !1, line: 77, column: 7)
!139 = !DILocation(line: 77, column: 18, scope: !138)
!140 = !DILocation(line: 77, column: 7, scope: !134)
!141 = !DILocation(line: 78, column: 4, scope: !138)
!142 = !DILocation(line: 79, column: 2, scope: !134)
!143 = !DILocation(line: 81, column: 2, scope: !105)
!144 = !DILocation(line: 81, column: 14, scope: !105)
!145 = !DILocation(line: 81, column: 23, scope: !105)
!146 = !DILocation(line: 82, column: 2, scope: !105)
!147 = !DILocation(line: 82, column: 14, scope: !105)
!148 = !DILocation(line: 82, column: 21, scope: !105)
!149 = !DILocation(line: 82, column: 33, scope: !105)
!150 = !DILocation(line: 83, column: 2, scope: !105)
!151 = !DILocation(line: 83, column: 14, scope: !105)
!152 = !DILocation(line: 83, column: 21, scope: !105)
!153 = !DILocation(line: 83, column: 39, scope: !105)
!154 = !DILocation(line: 84, column: 2, scope: !105)
!155 = !DILocation(line: 84, column: 14, scope: !105)
!156 = !DILocation(line: 84, column: 21, scope: !105)
!157 = !DILocation(line: 84, column: 27, scope: !105)
!158 = !DILocation(line: 85, column: 2, scope: !105)
!159 = !DILocation(line: 85, column: 14, scope: !105)
!160 = !DILocation(line: 85, column: 21, scope: !105)
!161 = !DILocation(line: 85, column: 37, scope: !105)
!162 = !DILocation(line: 86, column: 2, scope: !105)
!163 = !DILocation(line: 86, column: 14, scope: !105)
!164 = !DILocation(line: 86, column: 22, scope: !105)
!165 = !DILocation(line: 86, column: 34, scope: !105)
!166 = !DILocation(line: 87, column: 2, scope: !105)
!167 = !DILocation(line: 87, column: 14, scope: !105)
!168 = !DILocation(line: 87, column: 22, scope: !105)
!169 = !DILocation(line: 87, column: 40, scope: !105)
!170 = !DILocation(line: 88, column: 2, scope: !105)
!171 = !DILocation(line: 88, column: 14, scope: !105)
!172 = !DILocation(line: 88, column: 22, scope: !105)
!173 = !DILocation(line: 88, column: 28, scope: !105)
!174 = !DILocation(line: 89, column: 2, scope: !105)
!175 = !DILocation(line: 89, column: 14, scope: !105)
!176 = !DILocation(line: 89, column: 22, scope: !105)
!177 = !DILocation(line: 89, column: 38, scope: !105)
!178 = !DILocation(line: 90, column: 2, scope: !105)
!179 = !DILocation(line: 90, column: 14, scope: !105)
!180 = !DILocation(line: 90, column: 28, scope: !105)
!181 = !DILocation(line: 91, column: 2, scope: !105)
!182 = !DILocation(line: 91, column: 14, scope: !105)
!183 = !DILocation(line: 91, column: 32, scope: !105)
!184 = !DILocation(line: 92, column: 2, scope: !105)
!185 = !DILocation(line: 92, column: 14, scope: !105)
!186 = !DILocation(line: 92, column: 18, scope: !105)
!187 = !DILocation(line: 93, column: 2, scope: !105)
!188 = !DILocation(line: 93, column: 14, scope: !105)
!189 = !DILocation(line: 93, column: 20, scope: !105)
!190 = !DILocation(line: 96, column: 25, scope: !105)
!191 = !DILocation(line: 96, column: 37, scope: !105)
!192 = !DILocation(line: 96, column: 44, scope: !105)
!193 = !DILocation(line: 96, column: 8, scope: !105)
