; ModuleID = 'liblzma/lz/lz_encoder.c'
source_filename = "liblzma/lz/lz_encoder.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.lzma_lz_options = type { i64, i64, i64, i64, i64, i32, i32, i8*, i32 }
%struct.lzma_mf_s = type { i8*, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32 (%struct.lzma_mf_s*, %struct.lzma_match*)*, void (%struct.lzma_mf_s*, i32)*, i32*, i32*, i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.lzma_match = type { i32, i32 }
%struct.lzma_allocator = type { i8* (i8*, i64, i64)*, void (i8*, i8*)*, i8* }
%struct.lzma_next_coder_s = type { i8*, i64, i64, i32 (i8*, %struct.lzma_allocator*, i8*, i64*, i64, i8*, i64*, i64, i32)*, void (i8*, %struct.lzma_allocator*)*, i32 (i8*)*, i32 (i8*, i64*, i64*, i64)*, i32 (i8*, %struct.lzma_allocator*, %struct.lzma_filter*, %struct.lzma_filter*)* }
%struct.lzma_filter = type { i64, i8* }
%struct.lzma_filter_info_s = type { i64, i32 (%struct.lzma_next_coder_s*, %struct.lzma_allocator*, %struct.lzma_filter_info_s*)*, i8* }
%struct.lzma_lz_encoder = type { i8*, i32 (i8*, %struct.lzma_mf_s*, i8*, i64*, i64)*, void (i8*, %struct.lzma_allocator*)*, i32 (i8*, %struct.lzma_filter*)* }
%struct.lzma_coder_s = type { %struct.lzma_lz_encoder, %struct.lzma_mf_s, %struct.lzma_next_coder_s }

; Function Attrs: noinline nounwind uwtable
define dso_local i64 @lzma_lz_encoder_memusage(%struct.lzma_lz_options* %lz_options) #0 !dbg !189 {

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !40, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "liblzma/lz/lz_encoder.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!2 = !{!3, !12, !19, !33}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 58, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "liblzma/api/lzma/lzma.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9, !10, !11}
!7 = !DIEnumerator(name: "LZMA_MF_HC3", value: 3, isUnsigned: true)
!8 = !DIEnumerator(name: "LZMA_MF_HC4", value: 4, isUnsigned: true)
!9 = !DIEnumerator(name: "LZMA_MF_BT2", value: 18, isUnsigned: true)
!10 = !DIEnumerator(name: "LZMA_MF_BT3", value: 19, isUnsigned: true)
!11 = !DIEnumerator(name: "LZMA_MF_BT4", value: 20, isUnsigned: true)
!12 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !13, line: 250, baseType: !5, size: 32, elements: !14)
!13 = !DIFile(filename: "liblzma/api/lzma/base.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!14 = !{!15, !16, !17, !18}
!15 = !DIEnumerator(name: "LZMA_RUN", value: 0, isUnsigned: true)
!16 = !DIEnumerator(name: "LZMA_SYNC_FLUSH", value: 1, isUnsigned: true)
!17 = !DIEnumerator(name: "LZMA_FULL_FLUSH", value: 2, isUnsigned: true)
!18 = !DIEnumerator(name: "LZMA_FINISH", value: 3, isUnsigned: true)
!19 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !13, line: 57, baseType: !5, size: 32, elements: !20)
!20 = !{!21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32}
!21 = !DIEnumerator(name: "LZMA_OK", value: 0, isUnsigned: true)
!22 = !DIEnumerator(name: "LZMA_STREAM_END", value: 1, isUnsigned: true)
!23 = !DIEnumerator(name: "LZMA_NO_CHECK", value: 2, isUnsigned: true)
!24 = !DIEnumerator(name: "LZMA_UNSUPPORTED_CHECK", value: 3, isUnsigned: true)
!25 = !DIEnumerator(name: "LZMA_GET_CHECK", value: 4, isUnsigned: true)
!26 = !DIEnumerator(name: "LZMA_MEM_ERROR", value: 5, isUnsigned: true)
!27 = !DIEnumerator(name: "LZMA_MEMLIMIT_ERROR", value: 6, isUnsigned: true)
!28 = !DIEnumerator(name: "LZMA_FORMAT_ERROR", value: 7, isUnsigned: true)
!29 = !DIEnumerator(name: "LZMA_OPTIONS_ERROR", value: 8, isUnsigned: true)
!30 = !DIEnumerator(name: "LZMA_DATA_ERROR", value: 9, isUnsigned: true)
!31 = !DIEnumerator(name: "LZMA_BUF_ERROR", value: 10, isUnsigned: true)
!32 = !DIEnumerator(name: "LZMA_PROG_ERROR", value: 11, isUnsigned: true)
!33 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !34, line: 27, baseType: !5, size: 32, elements: !35)
!34 = !DIFile(filename: "liblzma/api/lzma/check.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!35 = !{!36, !37, !38, !39}
!36 = !DIEnumerator(name: "LZMA_CHECK_NONE", value: 0, isUnsigned: true)
!37 = !DIEnumerator(name: "LZMA_CHECK_CRC32", value: 1, isUnsigned: true)
!38 = !DIEnumerator(name: "LZMA_CHECK_CRC64", value: 4, isUnsigned: true)
!39 = !DIEnumerator(name: "LZMA_CHECK_SHA256", value: 10, isUnsigned: true)
!40 = !{!41, !46, !47, !157, !116}
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !42, line: 27, baseType: !43)
!42 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !44, line: 45, baseType: !45)
!44 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!45 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!48 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_coder_s", file: !1, line: 24, size: 1728, elements: !49)
!49 = !{!50, !149, !150}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "lz", scope: !48, file: !1, line: 26, baseType: !51, size: 256)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_lz_encoder", file: !52, line: 208, baseType: !53)
!52 = !DIFile(filename: "liblzma/lz/lz_encoder.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!53 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !52, line: 192, size: 256, elements: !54)
!54 = !{!55, !59, !118, !135}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "coder", scope: !53, file: !52, line: 194, baseType: !56, size: 64)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_coder", file: !58, line: 78, baseType: null)
!58 = !DIFile(filename: "liblzma/common/common.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!59 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !53, file: !52, line: 197, baseType: !60, size: 64, offset: 64)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = !DISubroutineType(types: !62)
!62 = !{!63, !64, !65, !113, !114, !116}
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_ret", file: !13, line: 237, baseType: !19)
!64 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !56)
!65 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !66)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_mf", file: !52, line: 28, baseType: !68)
!68 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_mf_s", file: !52, line: 29, size: 960, elements: !69)
!69 = !{!70, !75, !78, !79, !80, !81, !82, !83, !84, !85, !86, !96, !100, !102, !103, !104, !105, !106, !107, !108, !109, !111, !112}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !68, file: !52, line: 35, baseType: !71, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !42, line: 24, baseType: !73)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !44, line: 38, baseType: !74)
!74 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !68, file: !52, line: 39, baseType: !76, size: 32, offset: 64)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !42, line: 26, baseType: !77)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !44, line: 42, baseType: !5)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "keep_size_before", scope: !68, file: !52, line: 45, baseType: !76, size: 32, offset: 96)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "keep_size_after", scope: !68, file: !52, line: 51, baseType: !76, size: 32, offset: 128)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !68, file: !52, line: 58, baseType: !76, size: 32, offset: 160)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "read_pos", scope: !68, file: !52, line: 63, baseType: !76, size: 32, offset: 192)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "read_ahead", scope: !68, file: !52, line: 67, baseType: !76, size: 32, offset: 224)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "read_limit", scope: !68, file: !52, line: 75, baseType: !76, size: 32, offset: 256)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "write_pos", scope: !68, file: !52, line: 80, baseType: !76, size: 32, offset: 288)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !68, file: !52, line: 84, baseType: !76, size: 32, offset: 320)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "find", scope: !68, file: !52, line: 92, baseType: !87, size: 64, offset: 384)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!88 = !DISubroutineType(types: !89)
!89 = !{!76, !66, !90}
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_match", file: !52, line: 25, baseType: !92)
!92 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !52, line: 22, size: 64, elements: !93)
!93 = !{!94, !95}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !92, file: !52, line: 23, baseType: !76, size: 32)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !92, file: !52, line: 24, baseType: !76, size: 32, offset: 32)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "skip", scope: !68, file: !52, line: 97, baseType: !97, size: 64, offset: 448)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!98 = !DISubroutineType(types: !99)
!99 = !{null, !66, !76}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !68, file: !52, line: 99, baseType: !101, size: 64, offset: 512)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "son", scope: !68, file: !52, line: 100, baseType: !101, size: 64, offset: 576)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_pos", scope: !68, file: !52, line: 101, baseType: !76, size: 32, offset: 640)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_size", scope: !68, file: !52, line: 102, baseType: !76, size: 32, offset: 672)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "hash_mask", scope: !68, file: !52, line: 103, baseType: !76, size: 32, offset: 704)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !68, file: !52, line: 106, baseType: !76, size: 32, offset: 736)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "nice_len", scope: !68, file: !52, line: 109, baseType: !76, size: 32, offset: 768)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "match_len_max", scope: !68, file: !52, line: 114, baseType: !76, size: 32, offset: 800)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !68, file: !52, line: 119, baseType: !110, size: 32, offset: 832)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_action", file: !13, line: 322, baseType: !12)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "hash_size_sum", scope: !68, file: !52, line: 122, baseType: !76, size: 32, offset: 864)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "sons_count", scope: !68, file: !52, line: 125, baseType: !76, size: 32, offset: 896)
!113 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !71)
!114 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !115)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !117, line: 46, baseType: !45)
!117 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!118 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !53, file: !52, line: 202, baseType: !119, size: 64, offset: 128)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = !DISubroutineType(types: !121)
!121 = !{null, !56, !122}
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_allocator", file: !13, line: 403, baseType: !124)
!124 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 341, size: 192, elements: !125)
!125 = !{!126, !130, !134}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !124, file: !13, line: 376, baseType: !127, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = !DISubroutineType(types: !129)
!129 = !{!46, !46, !116, !116}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !124, file: !13, line: 390, baseType: !131, size: 64, offset: 64)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DISubroutineType(types: !133)
!133 = !{null, !46, !46}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !124, file: !13, line: 401, baseType: !46, size: 64, offset: 128)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "options_update", scope: !53, file: !52, line: 205, baseType: !136, size: 64, offset: 192)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DISubroutineType(types: !138)
!138 = !{!63, !56, !139}
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!140 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !141)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_filter", file: !142, line: 65, baseType: !143)
!142 = !DIFile(filename: "liblzma/api/lzma/filter.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!143 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !142, line: 43, size: 128, elements: !144)
!144 = !{!145, !148}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !143, file: !142, line: 54, baseType: !146, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_vli", file: !147, line: 63, baseType: !41)
!147 = !DIFile(filename: "liblzma/api/lzma/vli.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!148 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !143, file: !142, line: 63, baseType: !46, size: 64, offset: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "mf", scope: !48, file: !1, line: 29, baseType: !67, size: 960, offset: 256)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !48, file: !1, line: 32, baseType: !151, size: 512, offset: 1216)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_next_coder", file: !58, line: 80, baseType: !152)
!152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_next_coder_s", file: !58, line: 124, size: 512, elements: !153)
!153 = !{!154, !155, !156, !159, !167, !169, !176, !181}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "coder", scope: !152, file: !58, line: 126, baseType: !56, size: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !152, file: !58, line: 130, baseType: !146, size: 64, offset: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !152, file: !58, line: 136, baseType: !157, size: 64, offset: 128)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !158, line: 90, baseType: !45)
!158 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!159 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !152, file: !58, line: 139, baseType: !160, size: 64, offset: 192)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_code_function", file: !58, line: 94, baseType: !161)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!162 = !DISubroutineType(types: !163)
!163 = !{!63, !56, !122, !164, !114, !116, !113, !114, !116, !110}
!164 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !165)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !72)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !152, file: !58, line: 144, baseType: !168, size: 64, offset: 256)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_end_function", file: !58, line: 102, baseType: !119)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "get_check", scope: !152, file: !58, line: 148, baseType: !170, size: 64, offset: 320)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = !DISubroutineType(types: !172)
!172 = !{!173, !174}
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_check", file: !34, line: 55, baseType: !33)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!175 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !57)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "memconfig", scope: !152, file: !58, line: 152, baseType: !177, size: 64, offset: 384)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!178 = !DISubroutineType(types: !179)
!179 = !{!63, !56, !180, !180, !41}
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !152, file: !58, line: 157, baseType: !182, size: 64, offset: 448)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DISubroutineType(types: !184)
!184 = !{!63, !56, !122, !139, !139}
!185 = !{i32 7, !"Dwarf Version", i32 4}
!186 = !{i32 2, !"Debug Info Version", i32 3}
!187 = !{i32 1, !"wchar_size", i32 4}
!188 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!189 = distinct !DISubprogram(name: "lzma_lz_encoder_memusage", scope: !1, file: !1, line: 444, type: !190, scopeLine: 445, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !207)
!190 = !DISubroutineType(types: !191)
!191 = !{!41, !192}
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !194)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_lz_options", file: !52, line: 161, baseType: !195)
!195 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !52, line: 129, size: 512, elements: !196)
!196 = !{!197, !198, !199, !200, !201, !202, !204, !205, !206}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "before_size", scope: !195, file: !52, line: 132, baseType: !116, size: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "dict_size", scope: !195, file: !52, line: 135, baseType: !116, size: 64, offset: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "after_size", scope: !195, file: !52, line: 139, baseType: !116, size: 64, offset: 128)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "match_len_max", scope: !195, file: !52, line: 144, baseType: !116, size: 64, offset: 192)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "nice_len", scope: !195, file: !52, line: 148, baseType: !116, size: 64, offset: 256)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "match_finder", scope: !195, file: !52, line: 151, baseType: !203, size: 32, offset: 320)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_match_finder", file: !4, line: 111, baseType: !3)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !195, file: !52, line: 154, baseType: !76, size: 32, offset: 352)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "preset_dict", scope: !195, file: !52, line: 157, baseType: !165, size: 64, offset: 384)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "preset_dict_size", scope: !195, file: !52, line: 159, baseType: !76, size: 32, offset: 448)
!207 = !{}
!208 = !DILocalVariable(name: "lz_options", arg: 1, scope: !189, file: !1, line: 444, type: !192)
!209 = !DILocation(line: 444, column: 49, scope: !189)
!210 = !DILocalVariable(name: "mf", scope: !189, file: !1, line: 447, type: !67)
!211 = !DILocation(line: 447, column: 10, scope: !189)
!212 = !DILocation(line: 455, column: 36, scope: !213)
!213 = distinct !DILexicalBlock(scope: !189, file: !1, line: 455, column: 6)
!214 = !DILocation(line: 455, column: 6, scope: !213)
!215 = !DILocation(line: 455, column: 6, scope: !189)
!216 = !DILocation(line: 456, column: 3, scope: !213)
!217 = !DILocation(line: 459, column: 23, scope: !189)
!218 = !DILocation(line: 459, column: 42, scope: !189)
!219 = !DILocation(line: 459, column: 37, scope: !189)
!220 = !DILocation(line: 459, column: 9, scope: !189)
!221 = !DILocation(line: 460, column: 5, scope: !189)
!222 = !DILocation(line: 461, column: 41, scope: !189)
!223 = !DILocation(line: 461, column: 27, scope: !189)
!224 = !DILocation(line: 461, column: 25, scope: !189)
!225 = !DILocation(line: 461, column: 47, scope: !189)
!226 = !DILocation(line: 459, column: 2, scope: !189)
!227 = !DILocation(line: 462, column: 1, scope: !189)
!228 = distinct !DISubprogram(name: "lz_encoder_prepare", scope: !1, file: !1, line: 184, type: !229, scopeLine: 186, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !207)
!229 = !DISubroutineType(types: !230)
!230 = !{!231, !66, !122, !192}
!231 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!232 = !DILocalVariable(name: "mf", arg: 1, scope: !228, file: !1, line: 184, type: !66)
!233 = !DILocation(line: 184, column: 29, scope: !228)
!234 = !DILocalVariable(name: "allocator", arg: 2, scope: !228, file: !1, line: 184, type: !122)
!235 = !DILocation(line: 184, column: 49, scope: !228)
!236 = !DILocalVariable(name: "lz_options", arg: 3, scope: !228, file: !1, line: 185, type: !192)
!237 = !DILocation(line: 185, column: 26, scope: !228)
!238 = !DILocation(line: 190, column: 6, scope: !239)
!239 = distinct !DILexicalBlock(scope: !228, file: !1, line: 190, column: 6)
!240 = !DILocation(line: 190, column: 18, scope: !239)
!241 = !DILocation(line: 190, column: 28, scope: !239)
!242 = !DILocation(line: 191, column: 4, scope: !239)
!243 = !DILocation(line: 191, column: 7, scope: !239)
!244 = !DILocation(line: 191, column: 19, scope: !239)
!245 = !DILocation(line: 192, column: 5, scope: !239)
!246 = !DILocation(line: 193, column: 4, scope: !239)
!247 = !DILocation(line: 193, column: 7, scope: !239)
!248 = !DILocation(line: 193, column: 19, scope: !239)
!249 = !DILocation(line: 193, column: 30, scope: !239)
!250 = !DILocation(line: 193, column: 42, scope: !239)
!251 = !DILocation(line: 193, column: 28, scope: !239)
!252 = !DILocation(line: 190, column: 6, scope: !228)
!253 = !DILocation(line: 194, column: 3, scope: !239)
!254 = !DILocation(line: 196, column: 25, scope: !228)
!255 = !DILocation(line: 196, column: 37, scope: !228)
!256 = !DILocation(line: 196, column: 51, scope: !228)
!257 = !DILocation(line: 196, column: 63, scope: !228)
!258 = !DILocation(line: 196, column: 49, scope: !228)
!259 = !DILocation(line: 196, column: 2, scope: !228)
!260 = !DILocation(line: 196, column: 6, scope: !228)
!261 = !DILocation(line: 196, column: 23, scope: !228)
!262 = !DILocation(line: 198, column: 24, scope: !228)
!263 = !DILocation(line: 198, column: 36, scope: !228)
!264 = !DILocation(line: 199, column: 6, scope: !228)
!265 = !DILocation(line: 199, column: 18, scope: !228)
!266 = !DILocation(line: 199, column: 4, scope: !228)
!267 = !DILocation(line: 198, column: 2, scope: !228)
!268 = !DILocation(line: 198, column: 6, scope: !228)
!269 = !DILocation(line: 198, column: 22, scope: !228)
!270 = !DILocalVariable(name: "reserve", scope: !228, file: !1, line: 212, type: !76)
!271 = !DILocation(line: 212, column: 11, scope: !228)
!272 = !DILocation(line: 212, column: 21, scope: !228)
!273 = !DILocation(line: 212, column: 33, scope: !228)
!274 = !DILocation(line: 212, column: 43, scope: !228)
!275 = !DILocation(line: 213, column: 6, scope: !276)
!276 = distinct !DILexicalBlock(scope: !228, file: !1, line: 213, column: 6)
!277 = !DILocation(line: 213, column: 14, scope: !276)
!278 = !DILocation(line: 213, column: 6, scope: !228)
!279 = !DILocation(line: 214, column: 11, scope: !276)
!280 = !DILocation(line: 214, column: 3, scope: !276)
!281 = !DILocation(line: 216, column: 14, scope: !228)
!282 = !DILocation(line: 216, column: 26, scope: !228)
!283 = !DILocation(line: 216, column: 40, scope: !228)
!284 = !DILocation(line: 216, column: 52, scope: !228)
!285 = !DILocation(line: 216, column: 38, scope: !228)
!286 = !DILocation(line: 217, column: 6, scope: !228)
!287 = !DILocation(line: 217, column: 18, scope: !228)
!288 = !DILocation(line: 217, column: 4, scope: !228)
!289 = !DILocation(line: 217, column: 30, scope: !228)
!290 = !DILocation(line: 217, column: 34, scope: !228)
!291 = !DILocation(line: 216, column: 10, scope: !228)
!292 = !DILocalVariable(name: "old_size", scope: !228, file: !1, line: 219, type: !293)
!293 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !76)
!294 = !DILocation(line: 219, column: 17, scope: !228)
!295 = !DILocation(line: 219, column: 28, scope: !228)
!296 = !DILocation(line: 219, column: 32, scope: !228)
!297 = !DILocation(line: 220, column: 13, scope: !228)
!298 = !DILocation(line: 220, column: 17, scope: !228)
!299 = !DILocation(line: 220, column: 36, scope: !228)
!300 = !DILocation(line: 220, column: 34, scope: !228)
!301 = !DILocation(line: 220, column: 46, scope: !228)
!302 = !DILocation(line: 220, column: 50, scope: !228)
!303 = !DILocation(line: 220, column: 44, scope: !228)
!304 = !DILocation(line: 220, column: 2, scope: !228)
!305 = !DILocation(line: 220, column: 6, scope: !228)
!306 = !DILocation(line: 220, column: 11, scope: !228)
!307 = !DILocation(line: 224, column: 6, scope: !308)
!308 = distinct !DILexicalBlock(scope: !228, file: !1, line: 224, column: 6)
!309 = !DILocation(line: 224, column: 10, scope: !308)
!310 = !DILocation(line: 224, column: 17, scope: !308)
!311 = !DILocation(line: 224, column: 25, scope: !308)
!312 = !DILocation(line: 224, column: 28, scope: !308)
!313 = !DILocation(line: 224, column: 40, scope: !308)
!314 = !DILocation(line: 224, column: 44, scope: !308)
!315 = !DILocation(line: 224, column: 37, scope: !308)
!316 = !DILocation(line: 224, column: 6, scope: !228)
!317 = !DILocation(line: 225, column: 13, scope: !318)
!318 = distinct !DILexicalBlock(scope: !308, file: !1, line: 224, column: 50)
!319 = !DILocation(line: 225, column: 17, scope: !318)
!320 = !DILocation(line: 225, column: 25, scope: !318)
!321 = !DILocation(line: 225, column: 3, scope: !318)
!322 = !DILocation(line: 226, column: 3, scope: !318)
!323 = !DILocation(line: 226, column: 7, scope: !318)
!324 = !DILocation(line: 226, column: 14, scope: !318)
!325 = !DILocation(line: 227, column: 2, scope: !318)
!326 = !DILocation(line: 230, column: 22, scope: !228)
!327 = !DILocation(line: 230, column: 34, scope: !228)
!328 = !DILocation(line: 230, column: 2, scope: !228)
!329 = !DILocation(line: 230, column: 6, scope: !228)
!330 = !DILocation(line: 230, column: 20, scope: !228)
!331 = !DILocation(line: 231, column: 17, scope: !228)
!332 = !DILocation(line: 231, column: 29, scope: !228)
!333 = !DILocation(line: 231, column: 2, scope: !228)
!334 = !DILocation(line: 231, column: 6, scope: !228)
!335 = !DILocation(line: 231, column: 15, scope: !228)
!336 = !DILocation(line: 248, column: 20, scope: !228)
!337 = !DILocation(line: 248, column: 32, scope: !228)
!338 = !DILocation(line: 248, column: 42, scope: !228)
!339 = !DILocation(line: 248, column: 2, scope: !228)
!340 = !DILocation(line: 248, column: 6, scope: !228)
!341 = !DILocation(line: 248, column: 18, scope: !228)
!342 = !DILocation(line: 251, column: 10, scope: !228)
!343 = !DILocation(line: 251, column: 22, scope: !228)
!344 = !DILocation(line: 251, column: 2, scope: !228)
!345 = !DILocation(line: 254, column: 3, scope: !346)
!346 = distinct !DILexicalBlock(scope: !228, file: !1, line: 251, column: 36)
!347 = !DILocation(line: 254, column: 7, scope: !346)
!348 = !DILocation(line: 254, column: 12, scope: !346)
!349 = !DILocation(line: 255, column: 3, scope: !346)
!350 = !DILocation(line: 255, column: 7, scope: !346)
!351 = !DILocation(line: 255, column: 12, scope: !346)
!352 = !DILocation(line: 256, column: 3, scope: !346)
!353 = !DILocation(line: 260, column: 3, scope: !346)
!354 = !DILocation(line: 260, column: 7, scope: !346)
!355 = !DILocation(line: 260, column: 12, scope: !346)
!356 = !DILocation(line: 261, column: 3, scope: !346)
!357 = !DILocation(line: 261, column: 7, scope: !346)
!358 = !DILocation(line: 261, column: 12, scope: !346)
!359 = !DILocation(line: 262, column: 3, scope: !346)
!360 = !DILocation(line: 266, column: 3, scope: !346)
!361 = !DILocation(line: 266, column: 7, scope: !346)
!362 = !DILocation(line: 266, column: 12, scope: !346)
!363 = !DILocation(line: 267, column: 3, scope: !346)
!364 = !DILocation(line: 267, column: 7, scope: !346)
!365 = !DILocation(line: 267, column: 12, scope: !346)
!366 = !DILocation(line: 268, column: 3, scope: !346)
!367 = !DILocation(line: 272, column: 3, scope: !346)
!368 = !DILocation(line: 272, column: 7, scope: !346)
!369 = !DILocation(line: 272, column: 12, scope: !346)
!370 = !DILocation(line: 273, column: 3, scope: !346)
!371 = !DILocation(line: 273, column: 7, scope: !346)
!372 = !DILocation(line: 273, column: 12, scope: !346)
!373 = !DILocation(line: 274, column: 3, scope: !346)
!374 = !DILocation(line: 278, column: 3, scope: !346)
!375 = !DILocation(line: 278, column: 7, scope: !346)
!376 = !DILocation(line: 278, column: 12, scope: !346)
!377 = !DILocation(line: 279, column: 3, scope: !346)
!378 = !DILocation(line: 279, column: 7, scope: !346)
!379 = !DILocation(line: 279, column: 12, scope: !346)
!380 = !DILocation(line: 280, column: 3, scope: !346)
!381 = !DILocation(line: 284, column: 3, scope: !346)
!382 = !DILocalVariable(name: "hash_bytes", scope: !228, file: !1, line: 289, type: !293)
!383 = !DILocation(line: 289, column: 17, scope: !228)
!384 = !DILocation(line: 289, column: 30, scope: !228)
!385 = !DILocation(line: 289, column: 42, scope: !228)
!386 = !DILocation(line: 289, column: 55, scope: !228)
!387 = !DILocation(line: 290, column: 6, scope: !388)
!388 = distinct !DILexicalBlock(scope: !228, file: !1, line: 290, column: 6)
!389 = !DILocation(line: 290, column: 19, scope: !388)
!390 = !DILocation(line: 290, column: 23, scope: !388)
!391 = !DILocation(line: 290, column: 17, scope: !388)
!392 = !DILocation(line: 290, column: 6, scope: !228)
!393 = !DILocation(line: 291, column: 3, scope: !388)
!394 = !DILocalVariable(name: "is_bt", scope: !228, file: !1, line: 293, type: !395)
!395 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !231)
!396 = !DILocation(line: 293, column: 13, scope: !228)
!397 = !DILocation(line: 293, column: 22, scope: !228)
!398 = !DILocation(line: 293, column: 34, scope: !228)
!399 = !DILocation(line: 293, column: 47, scope: !228)
!400 = !DILocation(line: 293, column: 55, scope: !228)
!401 = !DILocalVariable(name: "hs", scope: !228, file: !1, line: 294, type: !76)
!402 = !DILocation(line: 294, column: 11, scope: !228)
!403 = !DILocation(line: 296, column: 6, scope: !404)
!404 = distinct !DILexicalBlock(scope: !228, file: !1, line: 296, column: 6)
!405 = !DILocation(line: 296, column: 17, scope: !404)
!406 = !DILocation(line: 296, column: 6, scope: !228)
!407 = !DILocation(line: 297, column: 6, scope: !408)
!408 = distinct !DILexicalBlock(scope: !404, file: !1, line: 296, column: 23)
!409 = !DILocation(line: 298, column: 2, scope: !408)
!410 = !DILocation(line: 301, column: 8, scope: !411)
!411 = distinct !DILexicalBlock(scope: !404, file: !1, line: 298, column: 9)
!412 = !DILocation(line: 301, column: 20, scope: !411)
!413 = !DILocation(line: 301, column: 30, scope: !411)
!414 = !DILocation(line: 301, column: 6, scope: !411)
!415 = !DILocation(line: 302, column: 9, scope: !411)
!416 = !DILocation(line: 302, column: 12, scope: !411)
!417 = !DILocation(line: 302, column: 6, scope: !411)
!418 = !DILocation(line: 303, column: 9, scope: !411)
!419 = !DILocation(line: 303, column: 12, scope: !411)
!420 = !DILocation(line: 303, column: 6, scope: !411)
!421 = !DILocation(line: 304, column: 9, scope: !411)
!422 = !DILocation(line: 304, column: 12, scope: !411)
!423 = !DILocation(line: 304, column: 6, scope: !411)
!424 = !DILocation(line: 305, column: 9, scope: !411)
!425 = !DILocation(line: 305, column: 12, scope: !411)
!426 = !DILocation(line: 305, column: 6, scope: !411)
!427 = !DILocation(line: 306, column: 6, scope: !411)
!428 = !DILocation(line: 307, column: 6, scope: !411)
!429 = !DILocation(line: 309, column: 7, scope: !430)
!430 = distinct !DILexicalBlock(scope: !411, file: !1, line: 309, column: 7)
!431 = !DILocation(line: 309, column: 10, scope: !430)
!432 = !DILocation(line: 309, column: 7, scope: !411)
!433 = !DILocation(line: 310, column: 8, scope: !434)
!434 = distinct !DILexicalBlock(scope: !435, file: !1, line: 310, column: 8)
!435 = distinct !DILexicalBlock(scope: !430, file: !1, line: 309, column: 33)
!436 = !DILocation(line: 310, column: 19, scope: !434)
!437 = !DILocation(line: 310, column: 8, scope: !435)
!438 = !DILocation(line: 311, column: 8, scope: !434)
!439 = !DILocation(line: 311, column: 5, scope: !434)
!440 = !DILocation(line: 313, column: 8, scope: !434)
!441 = !DILocation(line: 314, column: 3, scope: !435)
!442 = !DILocation(line: 317, column: 18, scope: !228)
!443 = !DILocation(line: 317, column: 2, scope: !228)
!444 = !DILocation(line: 317, column: 6, scope: !228)
!445 = !DILocation(line: 317, column: 16, scope: !228)
!446 = !DILocation(line: 319, column: 2, scope: !228)
!447 = !DILocation(line: 320, column: 6, scope: !448)
!448 = distinct !DILexicalBlock(scope: !228, file: !1, line: 320, column: 6)
!449 = !DILocation(line: 320, column: 17, scope: !448)
!450 = !DILocation(line: 320, column: 6, scope: !228)
!451 = !DILocation(line: 321, column: 6, scope: !448)
!452 = !DILocation(line: 321, column: 3, scope: !448)
!453 = !DILocation(line: 322, column: 6, scope: !454)
!454 = distinct !DILexicalBlock(scope: !228, file: !1, line: 322, column: 6)
!455 = !DILocation(line: 322, column: 17, scope: !454)
!456 = !DILocation(line: 322, column: 6, scope: !228)
!457 = !DILocation(line: 323, column: 6, scope: !454)
!458 = !DILocation(line: 323, column: 3, scope: !454)
!459 = !DILocalVariable(name: "old_count", scope: !228, file: !1, line: 336, type: !293)
!460 = !DILocation(line: 336, column: 17, scope: !228)
!461 = !DILocation(line: 336, column: 29, scope: !228)
!462 = !DILocation(line: 336, column: 33, scope: !228)
!463 = !DILocation(line: 336, column: 49, scope: !228)
!464 = !DILocation(line: 336, column: 53, scope: !228)
!465 = !DILocation(line: 336, column: 47, scope: !228)
!466 = !DILocation(line: 337, column: 22, scope: !228)
!467 = !DILocation(line: 337, column: 2, scope: !228)
!468 = !DILocation(line: 337, column: 6, scope: !228)
!469 = !DILocation(line: 337, column: 20, scope: !228)
!470 = !DILocation(line: 338, column: 19, scope: !228)
!471 = !DILocation(line: 338, column: 23, scope: !228)
!472 = !DILocation(line: 338, column: 2, scope: !228)
!473 = !DILocation(line: 338, column: 6, scope: !228)
!474 = !DILocation(line: 338, column: 17, scope: !228)
!475 = !DILocation(line: 339, column: 6, scope: !476)
!476 = distinct !DILexicalBlock(scope: !228, file: !1, line: 339, column: 6)
!477 = !DILocation(line: 339, column: 6, scope: !228)
!478 = !DILocation(line: 340, column: 3, scope: !476)
!479 = !DILocation(line: 340, column: 7, scope: !476)
!480 = !DILocation(line: 340, column: 18, scope: !476)
!481 = !DILocalVariable(name: "new_count", scope: !228, file: !1, line: 342, type: !293)
!482 = !DILocation(line: 342, column: 17, scope: !228)
!483 = !DILocation(line: 342, column: 29, scope: !228)
!484 = !DILocation(line: 342, column: 33, scope: !228)
!485 = !DILocation(line: 342, column: 49, scope: !228)
!486 = !DILocation(line: 342, column: 53, scope: !228)
!487 = !DILocation(line: 342, column: 47, scope: !228)
!488 = !DILocation(line: 346, column: 6, scope: !489)
!489 = distinct !DILexicalBlock(scope: !228, file: !1, line: 346, column: 6)
!490 = !DILocation(line: 346, column: 19, scope: !489)
!491 = !DILocation(line: 346, column: 16, scope: !489)
!492 = !DILocation(line: 346, column: 6, scope: !228)
!493 = !DILocation(line: 347, column: 13, scope: !494)
!494 = distinct !DILexicalBlock(scope: !489, file: !1, line: 346, column: 30)
!495 = !DILocation(line: 347, column: 17, scope: !494)
!496 = !DILocation(line: 347, column: 23, scope: !494)
!497 = !DILocation(line: 347, column: 3, scope: !494)
!498 = !DILocation(line: 348, column: 3, scope: !494)
!499 = !DILocation(line: 348, column: 7, scope: !494)
!500 = !DILocation(line: 348, column: 12, scope: !494)
!501 = !DILocation(line: 349, column: 2, scope: !494)
!502 = !DILocation(line: 352, column: 14, scope: !228)
!503 = !DILocation(line: 352, column: 26, scope: !228)
!504 = !DILocation(line: 352, column: 2, scope: !228)
!505 = !DILocation(line: 352, column: 6, scope: !228)
!506 = !DILocation(line: 352, column: 12, scope: !228)
!507 = !DILocation(line: 353, column: 6, scope: !508)
!508 = distinct !DILexicalBlock(scope: !228, file: !1, line: 353, column: 6)
!509 = !DILocation(line: 353, column: 10, scope: !508)
!510 = !DILocation(line: 353, column: 16, scope: !508)
!511 = !DILocation(line: 353, column: 6, scope: !228)
!512 = !DILocation(line: 354, column: 7, scope: !513)
!513 = distinct !DILexicalBlock(scope: !514, file: !1, line: 354, column: 7)
!514 = distinct !DILexicalBlock(scope: !508, file: !1, line: 353, column: 22)
!515 = !DILocation(line: 354, column: 7, scope: !514)
!516 = !DILocation(line: 355, column: 21, scope: !513)
!517 = !DILocation(line: 355, column: 25, scope: !513)
!518 = !DILocation(line: 355, column: 34, scope: !513)
!519 = !DILocation(line: 355, column: 19, scope: !513)
!520 = !DILocation(line: 355, column: 4, scope: !513)
!521 = !DILocation(line: 355, column: 8, scope: !513)
!522 = !DILocation(line: 355, column: 14, scope: !513)
!523 = !DILocation(line: 357, column: 20, scope: !513)
!524 = !DILocation(line: 357, column: 24, scope: !513)
!525 = !DILocation(line: 357, column: 33, scope: !513)
!526 = !DILocation(line: 357, column: 18, scope: !513)
!527 = !DILocation(line: 357, column: 4, scope: !513)
!528 = !DILocation(line: 357, column: 8, scope: !513)
!529 = !DILocation(line: 357, column: 14, scope: !513)
!530 = !DILocation(line: 358, column: 2, scope: !514)
!531 = !DILocation(line: 360, column: 2, scope: !228)
!532 = !DILocation(line: 361, column: 1, scope: !228)
!533 = distinct !DISubprogram(name: "lzma_lz_encoder_init", scope: !1, file: !1, line: 502, type: !534, scopeLine: 507, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !207)
!534 = !DISubroutineType(types: !535)
!535 = !{!63, !536, !122, !537, !549}
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64)
!538 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !539)
!539 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_filter_info", file: !58, line: 82, baseType: !540)
!540 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_filter_info_s", file: !58, line: 109, size: 192, elements: !541)
!541 = !{!542, !543, !548}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !540, file: !58, line: 112, baseType: !146, size: 64)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !540, file: !58, line: 116, baseType: !544, size: 64, offset: 64)
!544 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_init_function", file: !58, line: 86, baseType: !545)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64)
!546 = !DISubroutineType(types: !547)
!547 = !{!63, !536, !122, !537}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !540, file: !58, line: 119, baseType: !46, size: 64, offset: 128)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64)
!550 = !DISubroutineType(types: !551)
!551 = !{!63, !552, !122, !553, !555}
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64)
!554 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!556 = !DILocalVariable(name: "next", arg: 1, scope: !533, file: !1, line: 502, type: !536)
!557 = !DILocation(line: 502, column: 39, scope: !533)
!558 = !DILocalVariable(name: "allocator", arg: 2, scope: !533, file: !1, line: 502, type: !122)
!559 = !DILocation(line: 502, column: 61, scope: !533)
!560 = !DILocalVariable(name: "filters", arg: 3, scope: !533, file: !1, line: 503, type: !537)
!561 = !DILocation(line: 503, column: 27, scope: !533)
!562 = !DILocalVariable(name: "lz_init", arg: 4, scope: !533, file: !1, line: 504, type: !549)
!563 = !DILocation(line: 504, column: 14, scope: !533)
!564 = !DILocation(line: 514, column: 6, scope: !565)
!565 = distinct !DILexicalBlock(scope: !533, file: !1, line: 514, column: 6)
!566 = !DILocation(line: 514, column: 12, scope: !565)
!567 = !DILocation(line: 514, column: 18, scope: !565)
!568 = !DILocation(line: 514, column: 6, scope: !533)
!569 = !DILocation(line: 515, column: 57, scope: !570)
!570 = distinct !DILexicalBlock(scope: !565, file: !1, line: 514, column: 27)
!571 = !DILocation(line: 515, column: 17, scope: !570)
!572 = !DILocation(line: 515, column: 3, scope: !570)
!573 = !DILocation(line: 515, column: 9, scope: !570)
!574 = !DILocation(line: 515, column: 15, scope: !570)
!575 = !DILocation(line: 516, column: 7, scope: !576)
!576 = distinct !DILexicalBlock(scope: !570, file: !1, line: 516, column: 7)
!577 = !DILocation(line: 516, column: 13, scope: !576)
!578 = !DILocation(line: 516, column: 19, scope: !576)
!579 = !DILocation(line: 516, column: 7, scope: !570)
!580 = !DILocation(line: 517, column: 4, scope: !576)
!581 = !DILocation(line: 519, column: 3, scope: !570)
!582 = !DILocation(line: 519, column: 9, scope: !570)
!583 = !DILocation(line: 519, column: 14, scope: !570)
!584 = !DILocation(line: 520, column: 3, scope: !570)
!585 = !DILocation(line: 520, column: 9, scope: !570)
!586 = !DILocation(line: 520, column: 13, scope: !570)
!587 = !DILocation(line: 521, column: 3, scope: !570)
!588 = !DILocation(line: 521, column: 9, scope: !570)
!589 = !DILocation(line: 521, column: 16, scope: !570)
!590 = !DILocation(line: 523, column: 26, scope: !570)
!591 = !DILocation(line: 523, column: 32, scope: !570)
!592 = !DILocation(line: 523, column: 4, scope: !570)
!593 = !DILocation(line: 523, column: 40, scope: !570)
!594 = !DILocation(line: 523, column: 43, scope: !570)
!595 = !DILocation(line: 523, column: 49, scope: !570)
!596 = !DILocation(line: 524, column: 26, scope: !570)
!597 = !DILocation(line: 524, column: 32, scope: !570)
!598 = !DILocation(line: 524, column: 4, scope: !570)
!599 = !DILocation(line: 524, column: 40, scope: !570)
!600 = !DILocation(line: 524, column: 43, scope: !570)
!601 = !DILocation(line: 524, column: 48, scope: !570)
!602 = !DILocation(line: 525, column: 26, scope: !570)
!603 = !DILocation(line: 525, column: 32, scope: !570)
!604 = !DILocation(line: 525, column: 4, scope: !570)
!605 = !DILocation(line: 525, column: 40, scope: !570)
!606 = !DILocation(line: 525, column: 43, scope: !570)
!607 = !DILocation(line: 525, column: 47, scope: !570)
!608 = !DILocation(line: 527, column: 26, scope: !570)
!609 = !DILocation(line: 527, column: 32, scope: !570)
!610 = !DILocation(line: 527, column: 4, scope: !570)
!611 = !DILocation(line: 527, column: 40, scope: !570)
!612 = !DILocation(line: 527, column: 43, scope: !570)
!613 = !DILocation(line: 527, column: 50, scope: !570)
!614 = !DILocation(line: 528, column: 26, scope: !570)
