; ModuleID = 'liblzma/lzma/lzma2_decoder.c'
source_filename = "liblzma/lzma/lzma2_decoder.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.lzma_next_coder_s = type { i8*, i64, i64, i32 (i8*, %struct.lzma_allocator*, i8*, i64*, i64, i8*, i64*, i64, i32)*, void (i8*, %struct.lzma_allocator*)*, i32 (i8*)*, i32 (i8*, i64*, i64*, i64)*, i32 (i8*, %struct.lzma_allocator*, %struct.lzma_filter*, %struct.lzma_filter*)* }
%struct.lzma_filter = type { i64, i8* }
%struct.lzma_allocator = type { i8* (i8*, i64, i64)*, void (i8*, i8*)*, i8* }
%struct.lzma_filter_info_s = type { i64, {}*, i8* }
%struct.lzma_lz_decoder = type { i8*, i32 (i8*, %struct.lzma_dict*, i8*, i64*, i64)*, void (i8*, i8*)*, void (i8*, i64)*, void (i8*, %struct.lzma_allocator*)* }
%struct.lzma_dict = type { i8*, i64, i64, i64, i64, i8 }
%struct.lzma_lz_options = type { i64, i8*, i64 }
%struct.lzma_options_lzma = type { i32, i8*, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i8*, i8* }
%struct.lzma_coder_s = type { i32, i32, %struct.lzma_lz_decoder, i64, i64, i8, i8, %struct.lzma_options_lzma }

; Function Attrs: noinline nounwind uwtable
define dso_local i32 @lzma_lzma2_decoder_init(%struct.lzma_next_coder_s* %next, %struct.lzma_allocator* %allocator, %struct.lzma_filter_info_s* %filters) #0 !dbg !177 {
entry:
  %next.addr = alloca %struct.lzma_next_coder_s*, align 8

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !57, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "liblzma/lzma/lzma2_decoder.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!2 = !{!3, !19, !25, !32, !37, !44, !47}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 57, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "liblzma/api/lzma/base.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18}
!7 = !DIEnumerator(name: "LZMA_OK", value: 0, isUnsigned: true)
!8 = !DIEnumerator(name: "LZMA_STREAM_END", value: 1, isUnsigned: true)
!9 = !DIEnumerator(name: "LZMA_NO_CHECK", value: 2, isUnsigned: true)
!10 = !DIEnumerator(name: "LZMA_UNSUPPORTED_CHECK", value: 3, isUnsigned: true)
!11 = !DIEnumerator(name: "LZMA_GET_CHECK", value: 4, isUnsigned: true)
!12 = !DIEnumerator(name: "LZMA_MEM_ERROR", value: 5, isUnsigned: true)
!13 = !DIEnumerator(name: "LZMA_MEMLIMIT_ERROR", value: 6, isUnsigned: true)
!14 = !DIEnumerator(name: "LZMA_FORMAT_ERROR", value: 7, isUnsigned: true)
!15 = !DIEnumerator(name: "LZMA_OPTIONS_ERROR", value: 8, isUnsigned: true)
!16 = !DIEnumerator(name: "LZMA_DATA_ERROR", value: 9, isUnsigned: true)
!17 = !DIEnumerator(name: "LZMA_BUF_ERROR", value: 10, isUnsigned: true)
!18 = !DIEnumerator(name: "LZMA_PROG_ERROR", value: 11, isUnsigned: true)
!19 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 250, baseType: !5, size: 32, elements: !20)
!20 = !{!21, !22, !23, !24}
!21 = !DIEnumerator(name: "LZMA_RUN", value: 0, isUnsigned: true)
!22 = !DIEnumerator(name: "LZMA_SYNC_FLUSH", value: 1, isUnsigned: true)
!23 = !DIEnumerator(name: "LZMA_FULL_FLUSH", value: 2, isUnsigned: true)
!24 = !DIEnumerator(name: "LZMA_FINISH", value: 3, isUnsigned: true)
!25 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !26, line: 27, baseType: !5, size: 32, elements: !27)
!26 = !DIFile(filename: "liblzma/api/lzma/check.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!27 = !{!28, !29, !30, !31}
!28 = !DIEnumerator(name: "LZMA_CHECK_NONE", value: 0, isUnsigned: true)
!29 = !DIEnumerator(name: "LZMA_CHECK_CRC32", value: 1, isUnsigned: true)
!30 = !DIEnumerator(name: "LZMA_CHECK_CRC64", value: 4, isUnsigned: true)
!31 = !DIEnumerator(name: "LZMA_CHECK_SHA256", value: 10, isUnsigned: true)
!32 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !33, line: 138, baseType: !5, size: 32, elements: !34)
!33 = !DIFile(filename: "liblzma/api/lzma/lzma.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!34 = !{!35, !36}
!35 = !DIEnumerator(name: "LZMA_MODE_FAST", value: 1, isUnsigned: true)
!36 = !DIEnumerator(name: "LZMA_MODE_NORMAL", value: 2, isUnsigned: true)
!37 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !33, line: 58, baseType: !5, size: 32, elements: !38)
!38 = !{!39, !40, !41, !42, !43}
!39 = !DIEnumerator(name: "LZMA_MF_HC3", value: 3, isUnsigned: true)
!40 = !DIEnumerator(name: "LZMA_MF_HC4", value: 4, isUnsigned: true)
!41 = !DIEnumerator(name: "LZMA_MF_BT2", value: 18, isUnsigned: true)
!42 = !DIEnumerator(name: "LZMA_MF_BT3", value: 19, isUnsigned: true)
!43 = !DIEnumerator(name: "LZMA_MF_BT4", value: 20, isUnsigned: true)
!44 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 44, baseType: !5, size: 32, elements: !45)
!45 = !{!46}
!46 = !DIEnumerator(name: "LZMA_RESERVED_ENUM", value: 0, isUnsigned: true)
!47 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "sequence", file: !1, line: 20, baseType: !5, size: 32, elements: !48)
!48 = !{!49, !50, !51, !52, !53, !54, !55, !56}
!49 = !DIEnumerator(name: "SEQ_CONTROL", value: 0, isUnsigned: true)
!50 = !DIEnumerator(name: "SEQ_UNCOMPRESSED_1", value: 1, isUnsigned: true)
!51 = !DIEnumerator(name: "SEQ_UNCOMPRESSED_2", value: 2, isUnsigned: true)
!52 = !DIEnumerator(name: "SEQ_COMPRESSED_0", value: 3, isUnsigned: true)
!53 = !DIEnumerator(name: "SEQ_COMPRESSED_1", value: 4, isUnsigned: true)
!54 = !DIEnumerator(name: "SEQ_PROPERTIES", value: 5, isUnsigned: true)
!55 = !DIEnumerator(name: "SEQ_LZMA", value: 6, isUnsigned: true)
!56 = !DIEnumerator(name: "SEQ_COPY", value: 7, isUnsigned: true)
!57 = !{!58, !59, !145}
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!60 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_coder_s", file: !1, line: 19, size: 1472, elements: !61)
!61 = !{!62, !63, !64, !136, !137, !138, !139, !140}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !60, file: !1, line: 29, baseType: !47, size: 32)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "next_sequence", scope: !60, file: !1, line: 32, baseType: !47, size: 32, offset: 32)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "lzma", scope: !60, file: !1, line: 35, baseType: !65, size: 320, offset: 64)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_lz_decoder", file: !66, line: 72, baseType: !67)
!66 = !DIFile(filename: "liblzma/lz/lz_decoder.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!67 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !66, line: 54, size: 320, elements: !68)
!68 = !{!69, !73, !105, !111, !119}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "coder", scope: !67, file: !66, line: 56, baseType: !70, size: 64)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_coder", file: !72, line: 78, baseType: null)
!72 = !DIFile(filename: "liblzma/common/common.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!73 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !67, file: !66, line: 59, baseType: !74, size: 64, offset: 64)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = !DISubroutineType(types: !76)
!76 = !{!77, !78, !79, !100, !103, !92}
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_ret", file: !4, line: 237, baseType: !3)
!78 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !70)
!79 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !80)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_dict", file: !66, line: 44, baseType: !82)
!82 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !66, line: 20, size: 384, elements: !83)
!83 = !{!84, !91, !95, !96, !97, !98}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !82, file: !66, line: 24, baseType: !85, size: 64)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !87, line: 24, baseType: !88)
!87 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !89, line: 38, baseType: !90)
!89 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!90 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !82, file: !66, line: 28, baseType: !92, size: 64, offset: 64)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !93, line: 46, baseType: !94)
!93 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!94 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "full", scope: !82, file: !66, line: 33, baseType: !92, size: 64, offset: 128)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !82, file: !66, line: 36, baseType: !92, size: 64, offset: 192)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !82, file: !66, line: 39, baseType: !92, size: 64, offset: 256)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "need_reset", scope: !82, file: !66, line: 42, baseType: !99, size: 8, offset: 320)
!99 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!100 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !101)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !86)
!103 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !104)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !67, file: !66, line: 63, baseType: !106, size: 64, offset: 128)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = !DISubroutineType(types: !108)
!108 = !{null, !70, !109}
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "set_uncompressed", scope: !67, file: !66, line: 66, baseType: !112, size: 64, offset: 192)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = !DISubroutineType(types: !114)
!114 = !{null, !70, !115}
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_vli", file: !116, line: 63, baseType: !117)
!116 = !DIFile(filename: "liblzma/api/lzma/vli.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !87, line: 27, baseType: !118)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !89, line: 45, baseType: !94)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !67, file: !66, line: 70, baseType: !120, size: 64, offset: 256)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = !DISubroutineType(types: !122)
!122 = !{null, !70, !123}
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_allocator", file: !4, line: 403, baseType: !125)
!125 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 341, size: 192, elements: !126)
!126 = !{!127, !131, !135}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !125, file: !4, line: 376, baseType: !128, size: 64)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = !DISubroutineType(types: !130)
!130 = !{!58, !58, !92, !92}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !125, file: !4, line: 390, baseType: !132, size: 64, offset: 64)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = !DISubroutineType(types: !134)
!134 = !{null, !58, !58}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !125, file: !4, line: 401, baseType: !58, size: 64, offset: 128)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "uncompressed_size", scope: !60, file: !1, line: 38, baseType: !92, size: 64, offset: 384)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "compressed_size", scope: !60, file: !1, line: 42, baseType: !92, size: 64, offset: 448)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "need_properties", scope: !60, file: !1, line: 46, baseType: !99, size: 8, offset: 512)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "need_dictionary_reset", scope: !60, file: !1, line: 50, baseType: !99, size: 8, offset: 520)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !60, file: !1, line: 52, baseType: !141, size: 896, offset: 576)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_options_lzma", file: !33, line: 399, baseType: !142)
!142 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !33, line: 185, size: 896, elements: !143)
!143 = !{!144, !147, !148, !149, !150, !151, !152, !154, !155, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !168, !169, !170, !171, !172}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "dict_size", scope: !142, file: !33, line: 217, baseType: !145, size: 32)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !87, line: 26, baseType: !146)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !89, line: 42, baseType: !5)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "preset_dict", scope: !142, file: !33, line: 240, baseType: !101, size: 64, offset: 64)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "preset_dict_size", scope: !142, file: !33, line: 254, baseType: !145, size: 32, offset: 128)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "lc", scope: !142, file: !33, line: 281, baseType: !145, size: 32, offset: 160)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "lp", scope: !142, file: !33, line: 293, baseType: !145, size: 32, offset: 192)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !142, file: !33, line: 316, baseType: !145, size: 32, offset: 224)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !142, file: !33, line: 322, baseType: !153, size: 32, offset: 256)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_mode", file: !33, line: 155, baseType: !32)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "nice_len", scope: !142, file: !33, line: 342, baseType: !145, size: 32, offset: 288)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "mf", scope: !142, file: !33, line: 345, baseType: !156, size: 32, offset: 320)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_match_finder", file: !33, line: 111, baseType: !37)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !142, file: !33, line: 375, baseType: !145, size: 32, offset: 352)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int1", scope: !142, file: !33, line: 384, baseType: !145, size: 32, offset: 384)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int2", scope: !142, file: !33, line: 385, baseType: !145, size: 32, offset: 416)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int3", scope: !142, file: !33, line: 386, baseType: !145, size: 32, offset: 448)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int4", scope: !142, file: !33, line: 387, baseType: !145, size: 32, offset: 480)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int5", scope: !142, file: !33, line: 388, baseType: !145, size: 32, offset: 512)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int6", scope: !142, file: !33, line: 389, baseType: !145, size: 32, offset: 544)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int7", scope: !142, file: !33, line: 390, baseType: !145, size: 32, offset: 576)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int8", scope: !142, file: !33, line: 391, baseType: !145, size: 32, offset: 608)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum1", scope: !142, file: !33, line: 392, baseType: !167, size: 32, offset: 640)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_reserved_enum", file: !4, line: 46, baseType: !44)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum2", scope: !142, file: !33, line: 393, baseType: !167, size: 32, offset: 672)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum3", scope: !142, file: !33, line: 394, baseType: !167, size: 32, offset: 704)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum4", scope: !142, file: !33, line: 395, baseType: !167, size: 32, offset: 736)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr1", scope: !142, file: !33, line: 396, baseType: !58, size: 64, offset: 768)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr2", scope: !142, file: !33, line: 397, baseType: !58, size: 64, offset: 832)
!173 = !{i32 7, !"Dwarf Version", i32 4}
!174 = !{i32 2, !"Debug Info Version", i32 3}
!175 = !{i32 1, !"wchar_size", i32 4}
!176 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!177 = distinct !DISubprogram(name: "lzma_lzma2_decoder_init", scope: !1, file: !1, line: 253, type: !178, scopeLine: 255, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !232)
!178 = !DISubroutineType(types: !179)
!179 = !{!77, !180, !123, !222}
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_next_coder", file: !72, line: 80, baseType: !182)
!182 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_next_coder_s", file: !72, line: 124, size: 512, elements: !183)
!183 = !{!184, !185, !186, !189, !196, !198, !205, !210}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "coder", scope: !182, file: !72, line: 126, baseType: !70, size: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !182, file: !72, line: 130, baseType: !115, size: 64, offset: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !182, file: !72, line: 136, baseType: !187, size: 64, offset: 128)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !188, line: 90, baseType: !94)
!188 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!189 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !182, file: !72, line: 139, baseType: !190, size: 64, offset: 192)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_code_function", file: !72, line: 94, baseType: !191)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = !DISubroutineType(types: !193)
!193 = !{!77, !70, !123, !100, !103, !92, !194, !103, !92, !195}
!194 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !85)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_action", file: !4, line: 322, baseType: !19)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !182, file: !72, line: 144, baseType: !197, size: 64, offset: 256)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_end_function", file: !72, line: 102, baseType: !120)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "get_check", scope: !182, file: !72, line: 148, baseType: !199, size: 64, offset: 320)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!200 = !DISubroutineType(types: !201)
!201 = !{!202, !203}
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_check", file: !26, line: 55, baseType: !25)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !71)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "memconfig", scope: !182, file: !72, line: 152, baseType: !206, size: 64, offset: 384)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!207 = !DISubroutineType(types: !208)
!208 = !{!77, !70, !209, !209, !117}
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !182, file: !72, line: 157, baseType: !211, size: 64, offset: 448)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!212 = !DISubroutineType(types: !213)
!213 = !{!77, !70, !123, !214, !214}
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!215 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !216)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_filter", file: !217, line: 65, baseType: !218)
!217 = !DIFile(filename: "liblzma/api/lzma/filter.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!218 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !217, line: 43, size: 128, elements: !219)
!219 = !{!220, !221}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !218, file: !217, line: 54, baseType: !115, size: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !218, file: !217, line: 63, baseType: !58, size: 64, offset: 64)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64)
!223 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !224)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_filter_info", file: !72, line: 82, baseType: !225)
!225 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_filter_info_s", file: !72, line: 109, size: 192, elements: !226)
!226 = !{!227, !228, !231}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !225, file: !72, line: 112, baseType: !115, size: 64)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !225, file: !72, line: 116, baseType: !229, size: 64, offset: 64)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_init_function", file: !72, line: 86, baseType: !230)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !225, file: !72, line: 119, baseType: !58, size: 64, offset: 128)
!232 = !{}
!233 = !DILocalVariable(name: "next", arg: 1, scope: !177, file: !1, line: 253, type: !180)
!234 = !DILocation(line: 253, column: 42, scope: !177)
!235 = !DILocalVariable(name: "allocator", arg: 2, scope: !177, file: !1, line: 253, type: !123)
!236 = !DILocation(line: 253, column: 64, scope: !177)
!237 = !DILocalVariable(name: "filters", arg: 3, scope: !177, file: !1, line: 254, type: !222)
!238 = !DILocation(line: 254, column: 27, scope: !177)
!239 = !DILocation(line: 260, column: 30, scope: !177)
!240 = !DILocation(line: 260, column: 36, scope: !177)
!241 = !DILocation(line: 260, column: 47, scope: !177)
!242 = !DILocation(line: 260, column: 9, scope: !177)
!243 = !DILocation(line: 260, column: 2, scope: !177)
!244 = distinct !DISubprogram(name: "lzma2_decoder_init", scope: !1, file: !1, line: 226, type: !245, scopeLine: 228, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !232)
!245 = !DISubroutineType(types: !246)
!246 = !{!77, !247, !123, !109, !248}
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_lz_options", file: !66, line: 51, baseType: !250)
!250 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !66, line: 47, size: 192, elements: !251)
!251 = !{!252, !253, !254}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "dict_size", scope: !250, file: !66, line: 48, baseType: !92, size: 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "preset_dict", scope: !250, file: !66, line: 49, baseType: !101, size: 64, offset: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "preset_dict_size", scope: !250, file: !66, line: 50, baseType: !92, size: 64, offset: 128)
!255 = !DILocalVariable(name: "lz", arg: 1, scope: !244, file: !1, line: 226, type: !247)
!256 = !DILocation(line: 226, column: 37, scope: !244)
!257 = !DILocalVariable(name: "allocator", arg: 2, scope: !244, file: !1, line: 226, type: !123)
!258 = !DILocation(line: 226, column: 57, scope: !244)
!259 = !DILocalVariable(name: "opt", arg: 3, scope: !244, file: !1, line: 227, type: !109)
!260 = !DILocation(line: 227, column: 15, scope: !244)
!261 = !DILocalVariable(name: "lz_options", arg: 4, scope: !244, file: !1, line: 227, type: !248)
!262 = !DILocation(line: 227, column: 37, scope: !244)
!263 = !DILocation(line: 229, column: 6, scope: !264)
!264 = distinct !DILexicalBlock(scope: !244, file: !1, line: 229, column: 6)
!265 = !DILocation(line: 229, column: 10, scope: !264)
!266 = !DILocation(line: 229, column: 16, scope: !264)
!267 = !DILocation(line: 229, column: 6, scope: !244)
!268 = !DILocation(line: 230, column: 55, scope: !269)
!269 = distinct !DILexicalBlock(scope: !264, file: !1, line: 229, column: 25)
!270 = !DILocation(line: 230, column: 15, scope: !269)
!271 = !DILocation(line: 230, column: 3, scope: !269)
!272 = !DILocation(line: 230, column: 7, scope: !269)
!273 = !DILocation(line: 230, column: 13, scope: !269)
!274 = !DILocation(line: 231, column: 7, scope: !275)
!275 = distinct !DILexicalBlock(scope: !269, file: !1, line: 231, column: 7)
!276 = !DILocation(line: 231, column: 11, scope: !275)
!277 = !DILocation(line: 231, column: 17, scope: !275)
!278 = !DILocation(line: 231, column: 7, scope: !269)
!279 = !DILocation(line: 232, column: 4, scope: !275)
!280 = !DILocation(line: 234, column: 3, scope: !269)
!281 = !DILocation(line: 234, column: 7, scope: !269)
!282 = !DILocation(line: 234, column: 12, scope: !269)
!283 = !DILocation(line: 235, column: 3, scope: !269)
!284 = !DILocation(line: 235, column: 7, scope: !269)
!285 = !DILocation(line: 235, column: 11, scope: !269)
!286 = !DILocation(line: 237, column: 26, scope: !269)
!287 = !DILocation(line: 237, column: 30, scope: !269)
!288 = !DILocation(line: 237, column: 4, scope: !269)
!289 = !DILocation(line: 237, column: 38, scope: !269)
!290 = !DILocation(line: 237, column: 45, scope: !269)
!291 = !DILocation(line: 238, column: 2, scope: !269)
!292 = !DILocalVariable(name: "options", scope: !244, file: !1, line: 240, type: !293)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64)
!294 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !141)
!295 = !DILocation(line: 240, column: 27, scope: !244)
!296 = !DILocation(line: 240, column: 37, scope: !244)
!297 = !DILocation(line: 242, column: 25, scope: !244)
!298 = !DILocation(line: 242, column: 29, scope: !244)
!299 = !DILocation(line: 242, column: 3, scope: !244)
!300 = !DILocation(line: 242, column: 37, scope: !244)
!301 = !DILocation(line: 242, column: 46, scope: !244)
!302 = !DILocation(line: 243, column: 25, scope: !244)
!303 = !DILocation(line: 243, column: 29, scope: !244)
!304 = !DILocation(line: 243, column: 3, scope: !244)
!305 = !DILocation(line: 243, column: 37, scope: !244)
!306 = !DILocation(line: 243, column: 53, scope: !244)
!307 = !DILocation(line: 244, column: 61, scope: !244)
!308 = !DILocation(line: 244, column: 70, scope: !244)
!309 = !DILocation(line: 244, column: 82, scope: !244)
!310 = !DILocation(line: 245, column: 4, scope: !244)
!311 = !DILocation(line: 245, column: 7, scope: !244)
!312 = !DILocation(line: 245, column: 16, scope: !244)
!313 = !DILocation(line: 245, column: 33, scope: !244)
!314 = !DILocation(line: 244, column: 25, scope: !244)
!315 = !DILocation(line: 244, column: 29, scope: !244)
!316 = !DILocation(line: 244, column: 3, scope: !244)
!317 = !DILocation(line: 244, column: 37, scope: !244)
!318 = !DILocation(line: 244, column: 59, scope: !244)
!319 = !DILocation(line: 247, column: 58, scope: !244)
