; ModuleID = 'liblzma/common/common.c'
source_filename = "liblzma/common/common.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.lzma_allocator = type { i8* (i8*, i64, i64)*, void (i8*, i8*)*, i8* }
%struct.lzma_next_coder_s = type { i8*, i64, i64, i32 (i8*, %struct.lzma_allocator*, i8*, i64*, i64, i8*, i64*, i64, i32)*, void (i8*, %struct.lzma_allocator*)*, i32 (i8*)*, i32 (i8*, i64*, i64*, i64)*, i32 (i8*, %struct.lzma_allocator*, %struct.lzma_filter*, %struct.lzma_filter*)* }
%struct.lzma_filter = type { i64, i8* }
%struct.lzma_filter_info_s = type { i64, {}*, i8* }
%struct.lzma_stream = type { i8*, i64, i64, i8*, i64, i64, %struct.lzma_allocator*, %struct.lzma_internal_s*, i8*, i8*, i8*, i8*, i64, i64, i64, i64, i32, i32 }
%struct.lzma_internal_s = type { %struct.lzma_next_coder_s, i32, i64, [4 x i8], i8 }

@.str = private unnamed_addr constant [22 x i8] c"5.0.5benchmarkcpu2017\00", align 1

; Function Attrs: noinline nounwind uwtable
define dso_local i32 @lzma_version_number() #0 !dbg !139 {
entry:
  ret i32 50000056, !dbg !145
}

; Function Attrs: noinline nounwind uwtable
define dso_local i8* @lzma_version_string() #0 !dbg !146 {
entry:
  ret i8* getelementptr inbounds ([22 x i8], [22 x i8]* @.str, i64 0, i64 0), !dbg !152
}

; Function Attrs: noinline nounwind uwtable
define dso_local i8* @lzma_alloc(i64 %size, %struct.lzma_allocator* %allocator) #0 !dbg !153 {
entry:

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !134, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "liblzma/common/common.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!2 = !{!3, !19, !25, !32, !131}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 57, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "liblzma/api/lzma/base.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18}
!7 = !DIEnumerator(name: "LZMA_OK", value: 0, isUnsigned: true)
!8 = !DIEnumerator(name: "LZMA_STREAM_END", value: 1, isUnsigned: true)
!9 = !DIEnumerator(name: "LZMA_NO_CHECK", value: 2, isUnsigned: true)
!10 = !DIEnumerator(name: "LZMA_UNSUPPORTED_CHECK", value: 3, isUnsigned: true)
!11 = !DIEnumerator(name: "LZMA_GET_CHECK", value: 4, isUnsigned: true)
!12 = !DIEnumerator(name: "LZMA_MEM_ERROR", value: 5, isUnsigned: true)
!13 = !DIEnumerator(name: "LZMA_MEMLIMIT_ERROR", value: 6, isUnsigned: true)
!14 = !DIEnumerator(name: "LZMA_FORMAT_ERROR", value: 7, isUnsigned: true)
!15 = !DIEnumerator(name: "LZMA_OPTIONS_ERROR", value: 8, isUnsigned: true)
!16 = !DIEnumerator(name: "LZMA_DATA_ERROR", value: 9, isUnsigned: true)
!17 = !DIEnumerator(name: "LZMA_BUF_ERROR", value: 10, isUnsigned: true)
!18 = !DIEnumerator(name: "LZMA_PROG_ERROR", value: 11, isUnsigned: true)
!19 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 250, baseType: !5, size: 32, elements: !20)
!20 = !{!21, !22, !23, !24}
!21 = !DIEnumerator(name: "LZMA_RUN", value: 0, isUnsigned: true)
!22 = !DIEnumerator(name: "LZMA_SYNC_FLUSH", value: 1, isUnsigned: true)
!23 = !DIEnumerator(name: "LZMA_FULL_FLUSH", value: 2, isUnsigned: true)
!24 = !DIEnumerator(name: "LZMA_FINISH", value: 3, isUnsigned: true)
!25 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !26, line: 27, baseType: !5, size: 32, elements: !27)
!26 = !DIFile(filename: "liblzma/api/lzma/check.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!27 = !{!28, !29, !30, !31}
!28 = !DIEnumerator(name: "LZMA_CHECK_NONE", value: 0, isUnsigned: true)
!29 = !DIEnumerator(name: "LZMA_CHECK_CRC32", value: 1, isUnsigned: true)
!30 = !DIEnumerator(name: "LZMA_CHECK_CRC64", value: 4, isUnsigned: true)
!31 = !DIEnumerator(name: "LZMA_CHECK_SHA256", value: 10, isUnsigned: true)
!32 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !34, file: !33, line: 187, baseType: !5, size: 32, elements: !124)
!33 = !DIFile(filename: "liblzma/common/common.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!34 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_internal_s", file: !33, line: 179, size: 704, elements: !35)
!35 = !{!36, !116, !117, !118, !123}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !34, file: !33, line: 181, baseType: !37, size: 512)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_next_coder", file: !33, line: 80, baseType: !38)
!38 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_next_coder_s", file: !33, line: 124, size: 512, elements: !39)
!39 = !{!40, !43, !51, !54, !87, !92, !99, !104}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "coder", scope: !38, file: !33, line: 126, baseType: !41, size: 64)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_coder", file: !33, line: 78, baseType: null)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !38, file: !33, line: 130, baseType: !44, size: 64, offset: 64)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_vli", file: !45, line: 63, baseType: !46)
!45 = !DIFile(filename: "liblzma/api/lzma/vli.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !47, line: 27, baseType: !48)
!47 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !49, line: 45, baseType: !50)
!49 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!50 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !38, file: !33, line: 136, baseType: !52, size: 64, offset: 128)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !53, line: 90, baseType: !50)
!53 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!54 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !38, file: !33, line: 139, baseType: !55, size: 64, offset: 192)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_code_function", file: !33, line: 94, baseType: !56)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!57 = !DISubroutineType(types: !58)
!58 = !{!59, !41, !60, !76, !82, !69, !84, !82, !69, !86}
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_ret", file: !4, line: 237, baseType: !3)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_allocator", file: !4, line: 403, baseType: !62)
!62 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 341, size: 192, elements: !63)
!63 = !{!64, !71, !75}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !62, file: !4, line: 376, baseType: !65, size: 64)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!66 = !DISubroutineType(types: !67)
!67 = !{!68, !68, !69, !69}
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !70, line: 46, baseType: !50)
!70 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!71 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !62, file: !4, line: 390, baseType: !72, size: 64, offset: 64)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!73 = !DISubroutineType(types: !74)
!74 = !{null, !68, !68}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !62, file: !4, line: 401, baseType: !68, size: 64, offset: 128)
!76 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !77)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !79)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !47, line: 24, baseType: !80)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !49, line: 38, baseType: !81)
!81 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!82 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !83)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !85)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_action", file: !4, line: 322, baseType: !19)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !38, file: !33, line: 144, baseType: !88, size: 64, offset: 256)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_end_function", file: !33, line: 102, baseType: !89)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!90 = !DISubroutineType(types: !91)
!91 = !{null, !41, !60}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "get_check", scope: !38, file: !33, line: 148, baseType: !93, size: 64, offset: 320)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = !DISubroutineType(types: !95)
!95 = !{!96, !97}
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_check", file: !26, line: 55, baseType: !25)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !42)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "memconfig", scope: !38, file: !33, line: 152, baseType: !100, size: 64, offset: 384)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = !DISubroutineType(types: !102)
!102 = !{!59, !41, !103, !103, !46}
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !38, file: !33, line: 157, baseType: !105, size: 64, offset: 448)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!106 = !DISubroutineType(types: !107)
!107 = !{!59, !41, !60, !108, !108}
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !110)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_filter", file: !111, line: 65, baseType: !112)
!111 = !DIFile(filename: "liblzma/api/lzma/filter.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!112 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !111, line: 43, size: 128, elements: !113)
!113 = !{!114, !115}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !112, file: !111, line: 54, baseType: !44, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !112, file: !111, line: 63, baseType: !68, size: 64, offset: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !34, file: !33, line: 194, baseType: !32, size: 32, offset: 512)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "avail_in", scope: !34, file: !33, line: 199, baseType: !69, size: 64, offset: 576)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "supported_actions", scope: !34, file: !33, line: 202, baseType: !119, size: 32, offset: 640)
!119 = !DICompositeType(tag: DW_TAG_array_type, baseType: !120, size: 32, elements: !121)
!120 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!121 = !{!122}
!122 = !DISubrange(count: 4)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "allow_buf_error", scope: !34, file: !33, line: 206, baseType: !120, size: 8, offset: 672)
!124 = !{!125, !126, !127, !128, !129, !130}
!125 = !DIEnumerator(name: "ISEQ_RUN", value: 0, isUnsigned: true)
!126 = !DIEnumerator(name: "ISEQ_SYNC_FLUSH", value: 1, isUnsigned: true)
!127 = !DIEnumerator(name: "ISEQ_FULL_FLUSH", value: 2, isUnsigned: true)
!128 = !DIEnumerator(name: "ISEQ_FINISH", value: 3, isUnsigned: true)
!129 = !DIEnumerator(name: "ISEQ_END", value: 4, isUnsigned: true)
!130 = !DIEnumerator(name: "ISEQ_ERROR", value: 5, isUnsigned: true)
!131 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 44, baseType: !5, size: 32, elements: !132)
!132 = !{!133}
!133 = !DIEnumerator(name: "LZMA_RESERVED_ENUM", value: 0, isUnsigned: true)
!134 = !{!68, !52, !5}
!135 = !{i32 7, !"Dwarf Version", i32 4}
!136 = !{i32 2, !"Debug Info Version", i32 3}
!137 = !{i32 1, !"wchar_size", i32 4}
!138 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!139 = distinct !DISubprogram(name: "lzma_version_number", scope: !1, file: !1, line: 21, type: !140, scopeLine: 22, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !144)
!140 = !DISubroutineType(types: !141)
!141 = !{!142}
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !47, line: 26, baseType: !143)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !49, line: 42, baseType: !5)
!144 = !{}
!145 = !DILocation(line: 23, column: 2, scope: !139)
!146 = distinct !DISubprogram(name: "lzma_version_string", scope: !1, file: !1, line: 28, type: !147, scopeLine: 29, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !144)
!147 = !DISubroutineType(types: !148)
!148 = !{!149}
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !151)
!151 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!152 = !DILocation(line: 30, column: 2, scope: !146)
!153 = distinct !DISubprogram(name: "lzma_alloc", scope: !1, file: !1, line: 39, type: !154, scopeLine: 40, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !144)
!154 = !DISubroutineType(types: !155)
!155 = !{!68, !69, !60}
!156 = !DILocalVariable(name: "size", arg: 1, scope: !153, file: !1, line: 39, type: !69)
!157 = !DILocation(line: 39, column: 19, scope: !153)
!158 = !DILocalVariable(name: "allocator", arg: 2, scope: !153, file: !1, line: 39, type: !60)
!159 = !DILocation(line: 39, column: 41, scope: !153)
!160 = !DILocation(line: 42, column: 6, scope: !161)
!161 = distinct !DILexicalBlock(scope: !153, file: !1, line: 42, column: 6)
!162 = !DILocation(line: 42, column: 11, scope: !161)
!163 = !DILocation(line: 42, column: 6, scope: !153)
!164 = !DILocation(line: 43, column: 8, scope: !161)
!165 = !DILocation(line: 43, column: 3, scope: !161)
!166 = !DILocalVariable(name: "ptr", scope: !153, file: !1, line: 45, type: !68)
!167 = !DILocation(line: 45, column: 8, scope: !153)
!168 = !DILocation(line: 47, column: 6, scope: !169)
!169 = distinct !DILexicalBlock(scope: !153, file: !1, line: 47, column: 6)
!170 = !DILocation(line: 47, column: 16, scope: !169)
!171 = !DILocation(line: 47, column: 24, scope: !169)
!172 = !DILocation(line: 47, column: 27, scope: !169)
!173 = !DILocation(line: 47, column: 38, scope: !169)
!174 = !DILocation(line: 47, column: 44, scope: !169)
!175 = !DILocation(line: 47, column: 6, scope: !153)
!176 = !DILocation(line: 48, column: 9, scope: !169)
!177 = !DILocation(line: 48, column: 20, scope: !169)
!178 = !DILocation(line: 48, column: 26, scope: !169)
!179 = !DILocation(line: 48, column: 37, scope: !169)
!180 = !DILocation(line: 48, column: 48, scope: !169)
!181 = !DILocation(line: 48, column: 7, scope: !169)
!182 = !DILocation(line: 48, column: 3, scope: !169)
!183 = !DILocation(line: 50, column: 16, scope: !169)
!184 = !DILocation(line: 50, column: 9, scope: !169)
!185 = !DILocation(line: 50, column: 7, scope: !169)
!186 = !DILocation(line: 52, column: 9, scope: !153)
!187 = !DILocation(line: 52, column: 2, scope: !153)
!188 = distinct !DISubprogram(name: "lzma_free", scope: !1, file: !1, line: 57, type: !189, scopeLine: 58, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !144)
!189 = !DISubroutineType(types: !190)
!190 = !{null, !68, !60}
!191 = !DILocalVariable(name: "ptr", arg: 1, scope: !188, file: !1, line: 57, type: !68)
!192 = !DILocation(line: 57, column: 17, scope: !188)
!193 = !DILocalVariable(name: "allocator", arg: 2, scope: !188, file: !1, line: 57, type: !60)
!194 = !DILocation(line: 57, column: 38, scope: !188)
!195 = !DILocation(line: 59, column: 6, scope: !196)
!196 = distinct !DILexicalBlock(scope: !188, file: !1, line: 59, column: 6)
!197 = !DILocation(line: 59, column: 16, scope: !196)
!198 = !DILocation(line: 59, column: 24, scope: !196)
!199 = !DILocation(line: 59, column: 27, scope: !196)
!200 = !DILocation(line: 59, column: 38, scope: !196)
!201 = !DILocation(line: 59, column: 43, scope: !196)
!202 = !DILocation(line: 59, column: 6, scope: !188)
!203 = !DILocation(line: 60, column: 3, scope: !196)
!204 = !DILocation(line: 60, column: 14, scope: !196)
!205 = !DILocation(line: 60, column: 19, scope: !196)
!206 = !DILocation(line: 60, column: 30, scope: !196)
!207 = !DILocation(line: 60, column: 38, scope: !196)
!208 = !DILocation(line: 62, column: 8, scope: !196)
!209 = !DILocation(line: 62, column: 3, scope: !196)
!210 = !DILocation(line: 64, column: 2, scope: !188)
!211 = distinct !DISubprogram(name: "lzma_bufcpy", scope: !1, file: !1, line: 73, type: !212, scopeLine: 76, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !144)
!212 = !DISubroutineType(types: !213)
!213 = !{!69, !76, !82, !69, !84, !82, !69}
!214 = !DILocalVariable(name: "in", arg: 1, scope: !211, file: !1, line: 73, type: !76)
!215 = !DILocation(line: 73, column: 37, scope: !211)
!216 = !DILocalVariable(name: "in_pos", arg: 2, scope: !211, file: !1, line: 73, type: !82)
!217 = !DILocation(line: 73, column: 58, scope: !211)
!218 = !DILocalVariable(name: "in_size", arg: 3, scope: !211, file: !1, line: 74, type: !69)
!219 = !DILocation(line: 74, column: 10, scope: !211)
!220 = !DILocalVariable(name: "out", arg: 4, scope: !211, file: !1, line: 74, type: !84)
!221 = !DILocation(line: 74, column: 37, scope: !211)
!222 = !DILocalVariable(name: "out_pos", arg: 5, scope: !211, file: !1, line: 75, type: !82)
!223 = !DILocation(line: 75, column: 20, scope: !211)
!224 = !DILocalVariable(name: "out_size", arg: 6, scope: !211, file: !1, line: 75, type: !69)
!225 = !DILocation(line: 75, column: 36, scope: !211)
!226 = !DILocalVariable(name: "in_avail", scope: !211, file: !1, line: 77, type: !227)
!227 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !69)
!228 = !DILocation(line: 77, column: 15, scope: !211)
!229 = !DILocation(line: 77, column: 26, scope: !211)
!230 = !DILocation(line: 77, column: 37, scope: !211)
!231 = !DILocation(line: 77, column: 36, scope: !211)
!232 = !DILocation(line: 77, column: 34, scope: !211)
!233 = !DILocalVariable(name: "out_avail", scope: !211, file: !1, line: 78, type: !227)
!234 = !DILocation(line: 78, column: 15, scope: !211)
!235 = !DILocation(line: 78, column: 27, scope: !211)
!236 = !DILocation(line: 78, column: 39, scope: !211)
!237 = !DILocation(line: 78, column: 38, scope: !211)
!238 = !DILocation(line: 78, column: 36, scope: !211)
!239 = !DILocalVariable(name: "copy_size", scope: !211, file: !1, line: 79, type: !227)
!240 = !DILocation(line: 79, column: 15, scope: !211)
!241 = !DILocation(line: 79, column: 27, scope: !211)
!242 = !DILocation(line: 81, column: 9, scope: !211)
!243 = !DILocation(line: 81, column: 16, scope: !211)
!244 = !DILocation(line: 81, column: 15, scope: !211)
!245 = !DILocation(line: 81, column: 13, scope: !211)
!246 = !DILocation(line: 81, column: 25, scope: !211)
!247 = !DILocation(line: 81, column: 31, scope: !211)
!248 = !DILocation(line: 81, column: 30, scope: !211)
!249 = !DILocation(line: 81, column: 28, scope: !211)
!250 = !DILocation(line: 81, column: 39, scope: !211)
!251 = !DILocation(line: 81, column: 2, scope: !211)
!252 = !DILocation(line: 83, column: 13, scope: !211)
!253 = !DILocation(line: 83, column: 3, scope: !211)
!254 = !DILocation(line: 83, column: 10, scope: !211)
!255 = !DILocation(line: 84, column: 14, scope: !211)
!256 = !DILocation(line: 84, column: 3, scope: !211)
!257 = !DILocation(line: 84, column: 11, scope: !211)
!258 = !DILocation(line: 86, column: 9, scope: !211)
!259 = !DILocation(line: 86, column: 2, scope: !211)
!260 = distinct !DISubprogram(name: "lzma_next_filter_init", scope: !1, file: !1, line: 91, type: !261, scopeLine: 93, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !144)
!261 = !DISubroutineType(types: !262)
!262 = !{!59, !263, !60, !264}
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !266)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_filter_info", file: !33, line: 82, baseType: !267)
!267 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_filter_info_s", file: !33, line: 109, size: 192, elements: !268)
!268 = !{!269, !270, !273}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !267, file: !33, line: 112, baseType: !44, size: 64)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !267, file: !33, line: 116, baseType: !271, size: 64, offset: 64)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_init_function", file: !33, line: 86, baseType: !272)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !267, file: !33, line: 119, baseType: !68, size: 64, offset: 128)
!274 = !DILocalVariable(name: "next", arg: 1, scope: !260, file: !1, line: 91, type: !263)
!275 = !DILocation(line: 91, column: 40, scope: !260)
!276 = !DILocalVariable(name: "allocator", arg: 2, scope: !260, file: !1, line: 91, type: !60)
!277 = !DILocation(line: 91, column: 62, scope: !260)
!278 = !DILocalVariable(name: "filters", arg: 3, scope: !260, file: !1, line: 92, type: !264)
!279 = !DILocation(line: 92, column: 27, scope: !260)
!280 = !DILocation(line: 94, column: 2, scope: !260)
!281 = !DILocation(line: 94, column: 2, scope: !282)
!282 = distinct !DILexicalBlock(scope: !283, file: !1, line: 94, column: 2)
!283 = distinct !DILexicalBlock(scope: !260, file: !1, line: 94, column: 2)
!284 = !DILocation(line: 94, column: 2, scope: !283)
!285 = !DILocation(line: 95, column: 13, scope: !260)
!286 = !DILocation(line: 95, column: 24, scope: !260)
!287 = !DILocation(line: 95, column: 2, scope: !260)
!288 = !DILocation(line: 95, column: 8, scope: !260)
!289 = !DILocation(line: 95, column: 11, scope: !260)
!290 = !DILocation(line: 96, column: 9, scope: !260)
!291 = !DILocation(line: 96, column: 20, scope: !260)
!292 = !DILocation(line: 96, column: 25, scope: !260)
!293 = !DILocation(line: 97, column: 16, scope: !260)
!294 = !DILocation(line: 97, column: 27, scope: !260)
!295 = !DILocation(line: 97, column: 32, scope: !260)
!296 = !DILocation(line: 97, column: 38, scope: !260)
!297 = !DILocation(line: 97, column: 49, scope: !260)
!298 = !DILocation(line: 96, column: 2, scope: !260)
!299 = distinct !DISubprogram(name: "lzma_next_end", scope: !1, file: !1, line: 120, type: !300, scopeLine: 121, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !144)
!300 = !DISubroutineType(types: !301)
!301 = !{null, !263, !60}
!302 = !DILocalVariable(name: "next", arg: 1, scope: !299, file: !1, line: 120, type: !263)
!303 = !DILocation(line: 120, column: 32, scope: !299)
!304 = !DILocalVariable(name: "allocator", arg: 2, scope: !299, file: !1, line: 120, type: !60)
!305 = !DILocation(line: 120, column: 54, scope: !299)
!306 = !DILocation(line: 122, column: 6, scope: !307)
!307 = distinct !DILexicalBlock(scope: !299, file: !1, line: 122, column: 6)
!308 = !DILocation(line: 122, column: 12, scope: !307)
!309 = !DILocation(line: 122, column: 17, scope: !307)
!310 = !DILocation(line: 122, column: 6, scope: !299)
!311 = !DILocation(line: 126, column: 7, scope: !312)
!312 = distinct !DILexicalBlock(scope: !313, file: !1, line: 126, column: 7)
!313 = distinct !DILexicalBlock(scope: !307, file: !1, line: 122, column: 39)
!314 = !DILocation(line: 126, column: 13, scope: !312)
!315 = !DILocation(line: 126, column: 17, scope: !312)
!316 = !DILocation(line: 126, column: 7, scope: !313)
!317 = !DILocation(line: 127, column: 4, scope: !312)
!318 = !DILocation(line: 127, column: 10, scope: !312)
!319 = !DILocation(line: 127, column: 14, scope: !312)
!320 = !DILocation(line: 127, column: 20, scope: !312)
!321 = !DILocation(line: 127, column: 27, scope: !312)
!322 = !DILocation(line: 129, column: 14, scope: !312)
!323 = !DILocation(line: 129, column: 20, scope: !312)
!324 = !DILocation(line: 129, column: 27, scope: !312)
!325 = !DILocation(line: 129, column: 4, scope: !312)
!326 = !DILocation(line: 133, column: 4, scope: !313)
!327 = !DILocation(line: 133, column: 11, scope: !313)
!328 = !DILocation(line: 134, column: 2, scope: !313)
!329 = !DILocation(line: 136, column: 2, scope: !299)
!330 = distinct !DISubprogram(name: "lzma_next_filter_update", scope: !1, file: !1, line: 102, type: !331, scopeLine: 104, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !144)
!331 = !DISubroutineType(types: !332)
!332 = !{!59, !263, !60, !108}
!333 = !DILocalVariable(name: "next", arg: 1, scope: !330, file: !1, line: 102, type: !263)
!334 = !DILocation(line: 102, column: 42, scope: !330)
!335 = !DILocalVariable(name: "allocator", arg: 2, scope: !330, file: !1, line: 102, type: !60)
!336 = !DILocation(line: 102, column: 64, scope: !330)
!337 = !DILocalVariable(name: "reversed_filters", arg: 3, scope: !330, file: !1, line: 103, type: !108)
!338 = !DILocation(line: 103, column: 22, scope: !330)
!339 = !DILocation(line: 108, column: 6, scope: !340)
!340 = distinct !DILexicalBlock(scope: !330, file: !1, line: 108, column: 6)
!341 = !DILocation(line: 108, column: 26, scope: !340)
!342 = !DILocation(line: 108, column: 32, scope: !340)
!343 = !DILocation(line: 108, column: 38, scope: !340)
!344 = !DILocation(line: 108, column: 29, scope: !340)
!345 = !DILocation(line: 108, column: 6, scope: !330)
!346 = !DILocation(line: 109, column: 3, scope: !340)
!347 = !DILocation(line: 111, column: 6, scope: !348)
!348 = distinct !DILexicalBlock(scope: !330, file: !1, line: 111, column: 6)
!349 = !DILocation(line: 111, column: 26, scope: !348)
!350 = !DILocation(line: 111, column: 29, scope: !348)
!351 = !DILocation(line: 111, column: 6, scope: !330)
!352 = !DILocation(line: 112, column: 3, scope: !348)
!353 = !DILocation(line: 115, column: 9, scope: !330)
!354 = !DILocation(line: 115, column: 15, scope: !330)
!355 = !DILocation(line: 115, column: 22, scope: !330)
!356 = !DILocation(line: 115, column: 28, scope: !330)
!357 = !DILocation(line: 115, column: 35, scope: !330)
!358 = !DILocation(line: 115, column: 52, scope: !330)
!359 = !DILocation(line: 115, column: 2, scope: !330)
!360 = !DILocation(line: 116, column: 1, scope: !330)
!361 = distinct !DISubprogram(name: "lzma_strm_init", scope: !1, file: !1, line: 145, type: !362, scopeLine: 146, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !144)
!362 = !DISubroutineType(types: !363)
!363 = !{!59, !364}
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_stream", file: !4, line: 490, baseType: !366)
!366 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 453, size: 1088, elements: !367)
!367 = !{!368, !369, !370, !371, !372, !373, !374, !375, !378, !379, !380, !381, !382, !383, !384, !385, !386, !388}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "next_in", scope: !366, file: !4, line: 454, baseType: !77, size: 64)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "avail_in", scope: !366, file: !4, line: 455, baseType: !69, size: 64, offset: 64)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "total_in", scope: !366, file: !4, line: 456, baseType: !46, size: 64, offset: 128)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "next_out", scope: !366, file: !4, line: 458, baseType: !85, size: 64, offset: 192)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "avail_out", scope: !366, file: !4, line: 459, baseType: !69, size: 64, offset: 256)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "total_out", scope: !366, file: !4, line: 460, baseType: !46, size: 64, offset: 320)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !366, file: !4, line: 468, baseType: !60, size: 64, offset: 384)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !366, file: !4, line: 471, baseType: !376, size: 64, offset: 448)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_internal", file: !4, line: 411, baseType: !34)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr1", scope: !366, file: !4, line: 479, baseType: !68, size: 64, offset: 512)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr2", scope: !366, file: !4, line: 480, baseType: !68, size: 64, offset: 576)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr3", scope: !366, file: !4, line: 481, baseType: !68, size: 64, offset: 640)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr4", scope: !366, file: !4, line: 482, baseType: !68, size: 64, offset: 704)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int1", scope: !366, file: !4, line: 483, baseType: !46, size: 64, offset: 768)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int2", scope: !366, file: !4, line: 484, baseType: !46, size: 64, offset: 832)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int3", scope: !366, file: !4, line: 485, baseType: !69, size: 64, offset: 896)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int4", scope: !366, file: !4, line: 486, baseType: !69, size: 64, offset: 960)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum1", scope: !366, file: !4, line: 487, baseType: !387, size: 32, offset: 1024)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_reserved_enum", file: !4, line: 46, baseType: !131)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum2", scope: !366, file: !4, line: 488, baseType: !387, size: 32, offset: 1056)
!389 = !DILocalVariable(name: "strm", arg: 1, scope: !361, file: !1, line: 145, type: !364)
!390 = !DILocation(line: 145, column: 29, scope: !361)
!391 = !DILocation(line: 147, column: 6, scope: !392)
!392 = distinct !DILexicalBlock(scope: !361, file: !1, line: 147, column: 6)
!393 = !DILocation(line: 147, column: 11, scope: !392)
!394 = !DILocation(line: 147, column: 6, scope: !361)
!395 = !DILocation(line: 148, column: 3, scope: !392)
!396 = !DILocation(line: 150, column: 6, scope: !397)
!397 = distinct !DILexicalBlock(scope: !361, file: !1, line: 150, column: 6)
!398 = !DILocation(line: 150, column: 12, scope: !397)
!399 = !DILocation(line: 150, column: 21, scope: !397)
!400 = !DILocation(line: 150, column: 6, scope: !361)
!401 = !DILocation(line: 152, column: 5, scope: !402)
!402 = distinct !DILexicalBlock(scope: !397, file: !1, line: 150, column: 30)
!403 = !DILocation(line: 152, column: 11, scope: !402)
!404 = !DILocation(line: 151, column: 20, scope: !402)
!405 = !DILocation(line: 151, column: 3, scope: !402)
!406 = !DILocation(line: 151, column: 9, scope: !402)
!407 = !DILocation(line: 151, column: 18, scope: !402)
!408 = !DILocation(line: 153, column: 7, scope: !409)
!409 = distinct !DILexicalBlock(scope: !402, file: !1, line: 153, column: 7)
!410 = !DILocation(line: 153, column: 13, scope: !409)
!411 = !DILocation(line: 153, column: 22, scope: !409)
!412 = !DILocation(line: 153, column: 7, scope: !402)
!413 = !DILocation(line: 154, column: 4, scope: !409)
!414 = !DILocation(line: 156, column: 3, scope: !402)
!415 = !DILocation(line: 156, column: 9, scope: !402)
!416 = !DILocation(line: 156, column: 19, scope: !402)
!417 = !DILocation(line: 156, column: 26, scope: !402)
!418 = !DILocation(line: 157, column: 2, scope: !402)
!419 = !DILocation(line: 159, column: 2, scope: !361)
!420 = !DILocation(line: 159, column: 8, scope: !361)
!421 = !DILocation(line: 159, column: 18, scope: !361)
!422 = !DILocation(line: 159, column: 46, scope: !361)
!423 = !DILocation(line: 160, column: 2, scope: !361)
!424 = !DILocation(line: 160, column: 8, scope: !361)
!425 = !DILocation(line: 160, column: 18, scope: !361)
!426 = !DILocation(line: 160, column: 53, scope: !361)
!427 = !DILocation(line: 161, column: 2, scope: !361)
!428 = !DILocation(line: 161, column: 8, scope: !361)
!429 = !DILocation(line: 161, column: 18, scope: !361)
!430 = !DILocation(line: 161, column: 53, scope: !361)
!431 = !DILocation(line: 162, column: 2, scope: !361)
!432 = !DILocation(line: 162, column: 8, scope: !361)
!433 = !DILocation(line: 162, column: 18, scope: !361)
!434 = !DILocation(line: 162, column: 49, scope: !361)
!435 = !DILocation(line: 163, column: 2, scope: !361)
!436 = !DILocation(line: 163, column: 8, scope: !361)
!437 = !DILocation(line: 163, column: 18, scope: !361)
!438 = !DILocation(line: 163, column: 27, scope: !361)
!439 = !DILocation(line: 164, column: 2, scope: !361)
!440 = !DILocation(line: 164, column: 8, scope: !361)
!441 = !DILocation(line: 164, column: 18, scope: !361)
!442 = !DILocation(line: 164, column: 34, scope: !361)
!443 = !DILocation(line: 166, column: 2, scope: !361)
!444 = !DILocation(line: 166, column: 8, scope: !361)
!445 = !DILocation(line: 166, column: 17, scope: !361)
!446 = !DILocation(line: 167, column: 2, scope: !361)
!447 = !DILocation(line: 167, column: 8, scope: !361)
!448 = !DILocation(line: 167, column: 18, scope: !361)
!449 = !DILocation(line: 169, column: 2, scope: !361)
!450 = !DILocation(line: 170, column: 1, scope: !361)
!451 = distinct !DISubprogram(name: "lzma_code", scope: !1, file: !1, line: 174, type: !452, scopeLine: 175, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !144)
!452 = !DISubroutineType(types: !453)
!453 = !{!59, !364, !86}
!454 = !DILocalVariable(name: "strm", arg: 1, scope: !451, file: !1, line: 174, type: !364)
