; ModuleID = 'liblzma/delta/delta_encoder.c'
source_filename = "liblzma/delta/delta_encoder.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.lzma_next_coder_s = type { i8*, i64, i64, i32 (i8*, %struct.lzma_allocator*, i8*, i64*, i64, i8*, i64*, i64, i32)*, void (i8*, %struct.lzma_allocator*)*, i32 (i8*)*, i32 (i8*, i64*, i64*, i64)*, i32 (i8*, %struct.lzma_allocator*, %struct.lzma_filter*, %struct.lzma_filter*)* }
%struct.lzma_filter = type { i64, i8* }
%struct.lzma_allocator = type { i8* (i8*, i64, i64)*, void (i8*, i8*)*, i8* }
%struct.lzma_filter_info_s = type { i64, {}*, i8* }
%struct.lzma_coder_s = type { %struct.lzma_next_coder_s, i64, i8, [256 x i8] }
%struct.lzma_options_delta = type { i32, i32, i32, i32, i32, i32, i8*, i8* }

; Function Attrs: noinline nounwind uwtable
define dso_local i32 @lzma_delta_encoder_init(%struct.lzma_next_coder_s* %next, %struct.lzma_allocator* %allocator, %struct.lzma_filter_info_s* %filters) #0 !dbg !42 {
entry:
  %next.addr = alloca %struct.lzma_next_coder_s*, align 8
  %allocator.addr = alloca %struct.lzma_allocator*, align 8
  %filters.addr = alloca %struct.lzma_filter_info_s*, align 8
  store %struct.lzma_next_coder_s* %next, %struct.lzma_next_coder_s** %next.addr, align 8
  call void @llvm.dbg.declare(metadata %struct.lzma_next_coder_s** %next.addr, metadata !136, metadata !DIExpression()), !dbg !137

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !36, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "liblzma/delta/delta_encoder.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!2 = !{!3, !19, !25, !32}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 57, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "liblzma/api/lzma/base.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18}
!7 = !DIEnumerator(name: "LZMA_OK", value: 0, isUnsigned: true)
!8 = !DIEnumerator(name: "LZMA_STREAM_END", value: 1, isUnsigned: true)
!9 = !DIEnumerator(name: "LZMA_NO_CHECK", value: 2, isUnsigned: true)
!10 = !DIEnumerator(name: "LZMA_UNSUPPORTED_CHECK", value: 3, isUnsigned: true)
!11 = !DIEnumerator(name: "LZMA_GET_CHECK", value: 4, isUnsigned: true)
!12 = !DIEnumerator(name: "LZMA_MEM_ERROR", value: 5, isUnsigned: true)
!13 = !DIEnumerator(name: "LZMA_MEMLIMIT_ERROR", value: 6, isUnsigned: true)
!14 = !DIEnumerator(name: "LZMA_FORMAT_ERROR", value: 7, isUnsigned: true)
!15 = !DIEnumerator(name: "LZMA_OPTIONS_ERROR", value: 8, isUnsigned: true)
!16 = !DIEnumerator(name: "LZMA_DATA_ERROR", value: 9, isUnsigned: true)
!17 = !DIEnumerator(name: "LZMA_BUF_ERROR", value: 10, isUnsigned: true)
!18 = !DIEnumerator(name: "LZMA_PROG_ERROR", value: 11, isUnsigned: true)
!19 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 250, baseType: !5, size: 32, elements: !20)
!20 = !{!21, !22, !23, !24}
!21 = !DIEnumerator(name: "LZMA_RUN", value: 0, isUnsigned: true)
!22 = !DIEnumerator(name: "LZMA_SYNC_FLUSH", value: 1, isUnsigned: true)
!23 = !DIEnumerator(name: "LZMA_FULL_FLUSH", value: 2, isUnsigned: true)
!24 = !DIEnumerator(name: "LZMA_FINISH", value: 3, isUnsigned: true)
!25 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !26, line: 27, baseType: !5, size: 32, elements: !27)
!26 = !DIFile(filename: "liblzma/api/lzma/check.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!27 = !{!28, !29, !30, !31}
!28 = !DIEnumerator(name: "LZMA_CHECK_NONE", value: 0, isUnsigned: true)
!29 = !DIEnumerator(name: "LZMA_CHECK_CRC32", value: 1, isUnsigned: true)
!30 = !DIEnumerator(name: "LZMA_CHECK_CRC64", value: 4, isUnsigned: true)
!31 = !DIEnumerator(name: "LZMA_CHECK_SHA256", value: 10, isUnsigned: true)
!32 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !33, line: 35, baseType: !5, size: 32, elements: !34)
!33 = !DIFile(filename: "liblzma/api/lzma/delta.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!34 = !{!35}
!35 = !DIEnumerator(name: "LZMA_DELTA_TYPE_BYTE", value: 0, isUnsigned: true)
!36 = !{!37}
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!38 = !{i32 7, !"Dwarf Version", i32 4}
!39 = !{i32 2, !"Debug Info Version", i32 3}
!40 = !{i32 1, !"wchar_size", i32 4}
!41 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!42 = distinct !DISubprogram(name: "lzma_delta_encoder_init", scope: !1, file: !1, line: 104, type: !43, scopeLine: 106, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !135)
!43 = !DISubroutineType(types: !44)
!44 = !{!45, !46, !70, !125}
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_ret", file: !4, line: 237, baseType: !3)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_next_coder", file: !48, line: 80, baseType: !49)
!48 = !DIFile(filename: "liblzma/common/common.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!49 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_next_coder_s", file: !48, line: 124, size: 512, elements: !50)
!50 = !{!51, !54, !62, !65, !96, !101, !108, !113}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "coder", scope: !49, file: !48, line: 126, baseType: !52, size: 64)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_coder", file: !48, line: 78, baseType: null)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !49, file: !48, line: 130, baseType: !55, size: 64, offset: 64)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_vli", file: !56, line: 63, baseType: !57)
!56 = !DIFile(filename: "liblzma/api/lzma/vli.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !58, line: 27, baseType: !59)
!58 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !60, line: 45, baseType: !61)
!60 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!61 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !49, file: !48, line: 136, baseType: !63, size: 64, offset: 128)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !64, line: 90, baseType: !61)
!64 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!65 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !49, file: !48, line: 139, baseType: !66, size: 64, offset: 192)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_code_function", file: !48, line: 94, baseType: !67)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = !DISubroutineType(types: !69)
!69 = !{!45, !52, !70, !85, !91, !78, !93, !91, !78, !95}
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_allocator", file: !4, line: 403, baseType: !72)
!72 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 341, size: 192, elements: !73)
!73 = !{!74, !80, !84}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !72, file: !4, line: 376, baseType: !75, size: 64)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = !DISubroutineType(types: !77)
!77 = !{!37, !37, !78, !78}
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !79, line: 46, baseType: !61)
!79 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!80 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !72, file: !4, line: 390, baseType: !81, size: 64, offset: 64)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!82 = !DISubroutineType(types: !83)
!83 = !{null, !37, !37}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !72, file: !4, line: 401, baseType: !37, size: 64, offset: 128)
!85 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !86)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !88)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !58, line: 24, baseType: !89)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !60, line: 38, baseType: !90)
!90 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!91 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !92)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!93 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !94)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_action", file: !4, line: 322, baseType: !19)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !49, file: !48, line: 144, baseType: !97, size: 64, offset: 256)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_end_function", file: !48, line: 102, baseType: !98)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DISubroutineType(types: !100)
!100 = !{null, !52, !70}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "get_check", scope: !49, file: !48, line: 148, baseType: !102, size: 64, offset: 320)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DISubroutineType(types: !104)
!104 = !{!105, !106}
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_check", file: !26, line: 55, baseType: !25)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !53)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "memconfig", scope: !49, file: !48, line: 152, baseType: !109, size: 64, offset: 384)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = !DISubroutineType(types: !111)
!111 = !{!45, !52, !112, !112, !57}
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !49, file: !48, line: 157, baseType: !114, size: 64, offset: 448)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = !DISubroutineType(types: !116)
!116 = !{!45, !52, !70, !117, !117}
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !119)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_filter", file: !120, line: 65, baseType: !121)
!120 = !DIFile(filename: "liblzma/api/lzma/filter.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!121 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !120, line: 43, size: 128, elements: !122)
!122 = !{!123, !124}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !121, file: !120, line: 54, baseType: !55, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !121, file: !120, line: 63, baseType: !37, size: 64, offset: 64)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !127)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_filter_info", file: !48, line: 82, baseType: !128)
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_filter_info_s", file: !48, line: 109, size: 192, elements: !129)
!129 = !{!130, !131, !134}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !128, file: !48, line: 112, baseType: !55, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !128, file: !48, line: 116, baseType: !132, size: 64, offset: 64)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_init_function", file: !48, line: 86, baseType: !133)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !128, file: !48, line: 119, baseType: !37, size: 64, offset: 128)
!135 = !{}
!136 = !DILocalVariable(name: "next", arg: 1, scope: !42, file: !1, line: 104, type: !46)
!137 = !DILocation(line: 104, column: 42, scope: !42)
!138 = !DILocalVariable(name: "allocator", arg: 2, scope: !42, file: !1, line: 104, type: !70)
!139 = !DILocation(line: 104, column: 64, scope: !42)
!140 = !DILocalVariable(name: "filters", arg: 3, scope: !42, file: !1, line: 105, type: !125)
!141 = !DILocation(line: 105, column: 27, scope: !42)
!142 = !DILocation(line: 107, column: 2, scope: !42)
!143 = !DILocation(line: 107, column: 8, scope: !42)
!144 = !DILocation(line: 107, column: 13, scope: !42)
!145 = !DILocation(line: 108, column: 2, scope: !42)
!146 = !DILocation(line: 108, column: 8, scope: !42)
!147 = !DILocation(line: 108, column: 15, scope: !42)
!148 = !DILocation(line: 109, column: 31, scope: !42)
!149 = !DILocation(line: 109, column: 37, scope: !42)
!150 = !DILocation(line: 109, column: 48, scope: !42)
!151 = !DILocation(line: 109, column: 9, scope: !42)
!152 = !DILocation(line: 109, column: 2, scope: !42)
!153 = distinct !DISubprogram(name: "delta_encode", scope: !1, file: !1, line: 54, type: !68, scopeLine: 58, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !135)
!154 = !DILocalVariable(name: "pcoder", arg: 1, scope: !153, file: !1, line: 54, type: !52)
!155 = !DILocation(line: 54, column: 26, scope: !153)
!156 = !DILocalVariable(name: "allocator", arg: 2, scope: !153, file: !1, line: 54, type: !70)
!157 = !DILocation(line: 54, column: 50, scope: !153)
!158 = !DILocalVariable(name: "in", arg: 3, scope: !153, file: !1, line: 55, type: !85)
!159 = !DILocation(line: 55, column: 27, scope: !153)
!160 = !DILocalVariable(name: "in_pos", arg: 4, scope: !153, file: !1, line: 55, type: !91)
!161 = !DILocation(line: 55, column: 48, scope: !153)
!162 = !DILocalVariable(name: "in_size", arg: 5, scope: !153, file: !1, line: 56, type: !78)
!163 = !DILocation(line: 56, column: 10, scope: !153)
!164 = !DILocalVariable(name: "out", arg: 6, scope: !153, file: !1, line: 56, type: !93)
!165 = !DILocation(line: 56, column: 37, scope: !153)
!166 = !DILocalVariable(name: "out_pos", arg: 7, scope: !153, file: !1, line: 57, type: !91)
!167 = !DILocation(line: 57, column: 20, scope: !153)
!168 = !DILocalVariable(name: "out_size", arg: 8, scope: !153, file: !1, line: 57, type: !78)
!169 = !DILocation(line: 57, column: 36, scope: !153)
!170 = !DILocalVariable(name: "action", arg: 9, scope: !153, file: !1, line: 57, type: !95)
!171 = !DILocation(line: 57, column: 58, scope: !153)
!172 = !DILocalVariable(name: "coder", scope: !153, file: !1, line: 59, type: !173)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_coder_s", file: !175, line: 18, size: 2688, elements: !176)
!175 = !DIFile(filename: "liblzma/delta/delta_private.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!176 = !{!177, !178, !179, !180}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !174, file: !175, line: 20, baseType: !47, size: 512)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "distance", scope: !174, file: !175, line: 23, baseType: !78, size: 64, offset: 512)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !174, file: !175, line: 26, baseType: !88, size: 8, offset: 576)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "history", scope: !174, file: !175, line: 29, baseType: !181, size: 2048, offset: 584)
!181 = !DICompositeType(tag: DW_TAG_array_type, baseType: !88, size: 2048, elements: !182)
!182 = !{!183}
!183 = !DISubrange(count: 256)
!184 = !DILocation(line: 59, column: 23, scope: !153)
!185 = !DILocation(line: 59, column: 31, scope: !153)
!186 = !DILocalVariable(name: "ret", scope: !153, file: !1, line: 60, type: !45)
!187 = !DILocation(line: 60, column: 11, scope: !153)
!188 = !DILocation(line: 62, column: 6, scope: !189)
!189 = distinct !DILexicalBlock(scope: !153, file: !1, line: 62, column: 6)
!190 = !DILocation(line: 62, column: 13, scope: !189)
!191 = !DILocation(line: 62, column: 18, scope: !189)
!192 = !DILocation(line: 62, column: 23, scope: !189)
!193 = !DILocation(line: 62, column: 6, scope: !153)
!194 = !DILocalVariable(name: "in_avail", scope: !195, file: !1, line: 63, type: !196)
!195 = distinct !DILexicalBlock(scope: !189, file: !1, line: 62, column: 32)
!196 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !78)
!197 = !DILocation(line: 63, column: 16, scope: !195)
!198 = !DILocation(line: 63, column: 27, scope: !195)
!199 = !DILocation(line: 63, column: 38, scope: !195)
!200 = !DILocation(line: 63, column: 37, scope: !195)
!201 = !DILocation(line: 63, column: 35, scope: !195)
!202 = !DILocalVariable(name: "out_avail", scope: !195, file: !1, line: 64, type: !196)
!203 = !DILocation(line: 64, column: 16, scope: !195)
!204 = !DILocation(line: 64, column: 28, scope: !195)
!205 = !DILocation(line: 64, column: 40, scope: !195)
!206 = !DILocation(line: 64, column: 39, scope: !195)
!207 = !DILocation(line: 64, column: 37, scope: !195)
!208 = !DILocalVariable(name: "size", scope: !195, file: !1, line: 65, type: !196)
!209 = !DILocation(line: 65, column: 16, scope: !195)
!210 = !DILocation(line: 65, column: 23, scope: !195)
!211 = !DILocation(line: 67, column: 19, scope: !195)
!212 = !DILocation(line: 67, column: 26, scope: !195)
!213 = !DILocation(line: 67, column: 32, scope: !195)
!214 = !DILocation(line: 67, column: 31, scope: !195)
!215 = !DILocation(line: 67, column: 29, scope: !195)
!216 = !DILocation(line: 67, column: 40, scope: !195)
!217 = !DILocation(line: 67, column: 47, scope: !195)
!218 = !DILocation(line: 67, column: 46, scope: !195)
!219 = !DILocation(line: 67, column: 44, scope: !195)
!220 = !DILocation(line: 67, column: 56, scope: !195)
!221 = !DILocation(line: 67, column: 3, scope: !195)
!222 = !DILocation(line: 69, column: 14, scope: !195)
!223 = !DILocation(line: 69, column: 4, scope: !195)
!224 = !DILocation(line: 69, column: 11, scope: !195)
!225 = !DILocation(line: 70, column: 15, scope: !195)
!226 = !DILocation(line: 70, column: 4, scope: !195)
!227 = !DILocation(line: 70, column: 12, scope: !195)
!228 = !DILocation(line: 72, column: 9, scope: !195)
!229 = !DILocation(line: 72, column: 16, scope: !195)
!230 = !DILocation(line: 72, column: 28, scope: !195)
!231 = !DILocation(line: 72, column: 32, scope: !195)
!232 = !DILocation(line: 72, column: 31, scope: !195)
!233 = !DILocation(line: 72, column: 42, scope: !195)
!234 = !DILocation(line: 72, column: 39, scope: !195)
!235 = !DILocation(line: 0, scope: !195)
!236 = !DILocation(line: 72, column: 7, scope: !195)
!237 = !DILocation(line: 75, column: 2, scope: !195)
!238 = !DILocalVariable(name: "out_start", scope: !239, file: !1, line: 76, type: !196)
!239 = distinct !DILexicalBlock(scope: !189, file: !1, line: 75, column: 9)
!240 = !DILocation(line: 76, column: 16, scope: !239)
!241 = !DILocation(line: 76, column: 29, scope: !239)
!242 = !DILocation(line: 76, column: 28, scope: !239)
!243 = !DILocation(line: 78, column: 9, scope: !239)
!244 = !DILocation(line: 78, column: 16, scope: !239)
!245 = !DILocation(line: 78, column: 21, scope: !239)
!246 = !DILocation(line: 78, column: 26, scope: !239)
!247 = !DILocation(line: 78, column: 33, scope: !239)
!248 = !DILocation(line: 78, column: 38, scope: !239)
!249 = !DILocation(line: 78, column: 45, scope: !239)
!250 = !DILocation(line: 79, column: 5, scope: !239)
!251 = !DILocation(line: 79, column: 9, scope: !239)
!252 = !DILocation(line: 79, column: 17, scope: !239)
!253 = !DILocation(line: 79, column: 26, scope: !239)
!254 = !DILocation(line: 79, column: 31, scope: !239)
!255 = !DILocation(line: 79, column: 40, scope: !239)
!256 = !DILocation(line: 80, column: 5, scope: !239)
!257 = !DILocation(line: 78, column: 7, scope: !239)
!258 = !DILocation(line: 82, column: 19, scope: !239)
!259 = !DILocation(line: 82, column: 26, scope: !239)
!260 = !DILocation(line: 82, column: 32, scope: !239)
!261 = !DILocation(line: 82, column: 30, scope: !239)
!262 = !DILocation(line: 82, column: 44, scope: !239)
!263 = !DILocation(line: 82, column: 43, scope: !239)
!264 = !DILocation(line: 82, column: 54, scope: !239)
!265 = !DILocation(line: 82, column: 52, scope: !239)
!266 = !DILocation(line: 82, column: 3, scope: !239)
!267 = !DILocation(line: 85, column: 9, scope: !153)
!268 = !DILocation(line: 85, column: 2, scope: !153)
!269 = distinct !DISubprogram(name: "delta_encoder_update", scope: !1, file: !1, line: 90, type: !115, scopeLine: 93, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !135)
!270 = !DILocalVariable(name: "pcoder", arg: 1, scope: !269, file: !1, line: 90, type: !52)
!271 = !DILocation(line: 90, column: 34, scope: !269)
!272 = !DILocalVariable(name: "allocator", arg: 2, scope: !269, file: !1, line: 90, type: !70)
!273 = !DILocation(line: 90, column: 58, scope: !269)
!274 = !DILocalVariable(name: "filters_null", arg: 3, scope: !269, file: !1, line: 91, type: !117)
!275 = !DILocation(line: 91, column: 22, scope: !269)
!276 = !DILocalVariable(name: "reversed_filters", arg: 4, scope: !269, file: !1, line: 92, type: !117)
!277 = !DILocation(line: 92, column: 22, scope: !269)
!278 = !DILocalVariable(name: "coder", scope: !269, file: !1, line: 94, type: !173)
!279 = !DILocation(line: 94, column: 23, scope: !269)
!280 = !DILocation(line: 94, column: 31, scope: !269)
!281 = !DILocation(line: 99, column: 5, scope: !269)
!282 = !DILocation(line: 99, column: 12, scope: !269)
!283 = !DILocation(line: 99, column: 18, scope: !269)
!284 = !DILocation(line: 99, column: 29, scope: !269)
!285 = !DILocation(line: 99, column: 46, scope: !269)
!286 = !DILocation(line: 98, column: 9, scope: !269)
!287 = !DILocation(line: 98, column: 2, scope: !269)
!288 = distinct !DISubprogram(name: "lzma_delta_props_encode", scope: !1, file: !1, line: 114, type: !289, scopeLine: 115, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !135)
!289 = !DISubroutineType(types: !290)
!290 = !{!45, !291, !94}
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!292 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!293 = !DILocalVariable(name: "options", arg: 1, scope: !288, file: !1, line: 114, type: !291)
!294 = !DILocation(line: 114, column: 37, scope: !288)
!295 = !DILocalVariable(name: "out", arg: 2, scope: !288, file: !1, line: 114, type: !94)
!296 = !DILocation(line: 114, column: 55, scope: !288)
!297 = !DILocation(line: 118, column: 32, scope: !298)
!298 = distinct !DILexicalBlock(scope: !288, file: !1, line: 118, column: 6)
!299 = !DILocation(line: 118, column: 6, scope: !298)
!300 = !DILocation(line: 118, column: 41, scope: !298)
!301 = !DILocation(line: 118, column: 6, scope: !288)
!302 = !DILocation(line: 119, column: 3, scope: !298)
!303 = !DILocalVariable(name: "opt", scope: !288, file: !1, line: 121, type: !304)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!305 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !306)
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_options_delta", file: !33, line: 77, baseType: !307)
!307 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !33, line: 45, size: 320, elements: !308)
!308 = !{!309, !311, !314, !315, !316, !317, !318, !319}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !307, file: !33, line: 47, baseType: !310, size: 32)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_delta_type", file: !33, line: 37, baseType: !32)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !307, file: !33, line: 59, baseType: !312, size: 32, offset: 32)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !58, line: 26, baseType: !313)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !60, line: 42, baseType: !5)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int1", scope: !307, file: !33, line: 70, baseType: !312, size: 32, offset: 64)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int2", scope: !307, file: !33, line: 71, baseType: !312, size: 32, offset: 96)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int3", scope: !307, file: !33, line: 72, baseType: !312, size: 32, offset: 128)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int4", scope: !307, file: !33, line: 73, baseType: !312, size: 32, offset: 160)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr1", scope: !307, file: !33, line: 74, baseType: !37, size: 64, offset: 192)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr2", scope: !307, file: !33, line: 75, baseType: !37, size: 64, offset: 256)
!320 = !DILocation(line: 121, column: 28, scope: !288)
!321 = !DILocation(line: 121, column: 34, scope: !288)
!322 = !DILocation(line: 122, column: 11, scope: !288)
!323 = !DILocation(line: 122, column: 16, scope: !288)
!324 = !DILocation(line: 122, column: 21, scope: !288)
!325 = !DILocation(line: 122, column: 2, scope: !288)
!326 = !DILocation(line: 122, column: 9, scope: !288)
!327 = !DILocation(line: 124, column: 2, scope: !288)
!328 = !DILocation(line: 125, column: 1, scope: !288)
!329 = distinct !DISubprogram(name: "copy_and_encode", scope: !1, file: !1, line: 21, type: !330, scopeLine: 23, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !135)
!330 = !DISubroutineType(types: !331)
!331 = !{null, !52, !85, !93, !78}
!332 = !DILocalVariable(name: "pcoder", arg: 1, scope: !329, file: !1, line: 21, type: !52)
!333 = !DILocation(line: 21, column: 29, scope: !329)
!334 = !DILocalVariable(name: "in", arg: 2, scope: !329, file: !1, line: 22, type: !85)
!335 = !DILocation(line: 22, column: 27, scope: !329)
!336 = !DILocalVariable(name: "out", arg: 3, scope: !329, file: !1, line: 22, type: !93)
!337 = !DILocation(line: 22, column: 49, scope: !329)
!338 = !DILocalVariable(name: "size", arg: 4, scope: !329, file: !1, line: 22, type: !78)
!339 = !DILocation(line: 22, column: 61, scope: !329)
!340 = !DILocalVariable(name: "coder", scope: !329, file: !1, line: 24, type: !173)
!341 = !DILocation(line: 24, column: 23, scope: !329)
!342 = !DILocation(line: 24, column: 31, scope: !329)
!343 = !DILocalVariable(name: "distance", scope: !329, file: !1, line: 25, type: !196)
!344 = !DILocation(line: 25, column: 15, scope: !329)
!345 = !DILocation(line: 25, column: 26, scope: !329)
!346 = !DILocation(line: 25, column: 33, scope: !329)
!347 = !DILocalVariable(name: "i", scope: !348, file: !1, line: 27, type: !78)
!348 = distinct !DILexicalBlock(scope: !329, file: !1, line: 27, column: 2)
!349 = !DILocation(line: 27, column: 14, scope: !348)
!350 = !DILocation(line: 27, column: 7, scope: !348)
!351 = !DILocation(line: 27, column: 21, scope: !352)
!352 = distinct !DILexicalBlock(scope: !348, file: !1, line: 27, column: 2)
!353 = !DILocation(line: 27, column: 25, scope: !352)
!354 = !DILocation(line: 27, column: 23, scope: !352)
!355 = !DILocation(line: 27, column: 2, scope: !348)
!356 = !DILocalVariable(name: "tmp", scope: !357, file: !1, line: 28, type: !87)
!357 = distinct !DILexicalBlock(scope: !352, file: !1, line: 27, column: 36)
!358 = !DILocation(line: 28, column: 17, scope: !357)
!359 = !DILocation(line: 28, column: 23, scope: !357)
!360 = !DILocation(line: 28, column: 30, scope: !357)
!361 = !DILocation(line: 29, column: 6, scope: !357)
!362 = !DILocation(line: 29, column: 17, scope: !357)
!363 = !DILocation(line: 29, column: 24, scope: !357)
!364 = !DILocation(line: 29, column: 15, scope: !357)
!365 = !DILocation(line: 29, column: 29, scope: !357)
!366 = !DILocation(line: 30, column: 41, scope: !357)
!367 = !DILocation(line: 30, column: 44, scope: !357)
!368 = !DILocation(line: 30, column: 3, scope: !357)
!369 = !DILocation(line: 30, column: 10, scope: !357)
!370 = !DILocation(line: 30, column: 18, scope: !357)
!371 = !DILocation(line: 30, column: 25, scope: !357)
!372 = !DILocation(line: 30, column: 28, scope: !357)
!373 = !DILocation(line: 30, column: 31, scope: !357)
!374 = !DILocation(line: 30, column: 39, scope: !357)
!375 = !DILocation(line: 31, column: 12, scope: !357)
!376 = !DILocation(line: 31, column: 15, scope: !357)
!377 = !DILocation(line: 31, column: 20, scope: !357)
!378 = !DILocation(line: 31, column: 18, scope: !357)
!379 = !DILocation(line: 31, column: 3, scope: !357)
!380 = !DILocation(line: 31, column: 7, scope: !357)
!381 = !DILocation(line: 31, column: 10, scope: !357)
!382 = !DILocation(line: 32, column: 2, scope: !357)
