; ModuleID = 'liblzma/common/filter_encoder.c'
source_filename = "liblzma/common/filter_encoder.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.lzma_filter_encoder = type { i64, i32 (%struct.lzma_next_coder_s*, %struct.lzma_allocator*, %struct.lzma_filter_info_s*)*, i64 (i8*)*, i64 (i8*)*, i32 (i32*, i8*)*, i32, i32 (i8*, i8*)* }
%struct.lzma_next_coder_s = type { i8*, i64, i64, i32 (i8*, %struct.lzma_allocator*, i8*, i64*, i64, i8*, i64*, i64, i32)*, void (i8*, %struct.lzma_allocator*)*, i32 (i8*)*, i32 (i8*, i64*, i64*, i64)*, i32 (i8*, %struct.lzma_allocator*, %struct.lzma_filter*, %struct.lzma_filter*)* }
%struct.lzma_filter = type { i64, i8* }
%struct.lzma_allocator = type { i8* (i8*, i64, i64)*, void (i8*, i8*)*, i8* }
%struct.lzma_filter_info_s = type { i64, {}*, i8* }
%struct.lzma_stream = type { i8*, i64, i64, i8*, i64, i64, %struct.lzma_allocator*, %struct.lzma_internal_s*, i8*, i8*, i8*, i8*, i64, i64, i64, i64, i32, i32 }
%struct.lzma_internal_s = type { %struct.lzma_next_coder_s, i32, i64, [4 x i8], i8 }
%struct.lzma_filter_coder = type { i64, i32 (%struct.lzma_next_coder_s*, %struct.lzma_allocator*, %struct.lzma_filter_info_s*)*, i64 (i8*)* }


!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "encoders", scope: !2, file: !3, line: 56, type: !169, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !136, globals: !168, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "liblzma/common/filter_encoder.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!4 = !{!5, !21, !27, !34, !133}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 57, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "liblzma/api/lzma/base.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20}
!9 = !DIEnumerator(name: "LZMA_OK", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "LZMA_STREAM_END", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "LZMA_NO_CHECK", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "LZMA_UNSUPPORTED_CHECK", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "LZMA_GET_CHECK", value: 4, isUnsigned: true)
!14 = !DIEnumerator(name: "LZMA_MEM_ERROR", value: 5, isUnsigned: true)
!15 = !DIEnumerator(name: "LZMA_MEMLIMIT_ERROR", value: 6, isUnsigned: true)
!16 = !DIEnumerator(name: "LZMA_FORMAT_ERROR", value: 7, isUnsigned: true)
!17 = !DIEnumerator(name: "LZMA_OPTIONS_ERROR", value: 8, isUnsigned: true)
!18 = !DIEnumerator(name: "LZMA_DATA_ERROR", value: 9, isUnsigned: true)
!19 = !DIEnumerator(name: "LZMA_BUF_ERROR", value: 10, isUnsigned: true)
!20 = !DIEnumerator(name: "LZMA_PROG_ERROR", value: 11, isUnsigned: true)
!21 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 250, baseType: !7, size: 32, elements: !22)
!22 = !{!23, !24, !25, !26}
!23 = !DIEnumerator(name: "LZMA_RUN", value: 0, isUnsigned: true)
!24 = !DIEnumerator(name: "LZMA_SYNC_FLUSH", value: 1, isUnsigned: true)
!25 = !DIEnumerator(name: "LZMA_FULL_FLUSH", value: 2, isUnsigned: true)
!26 = !DIEnumerator(name: "LZMA_FINISH", value: 3, isUnsigned: true)
!27 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !28, line: 27, baseType: !7, size: 32, elements: !29)
!28 = !DIFile(filename: "liblzma/api/lzma/check.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!29 = !{!30, !31, !32, !33}
!30 = !DIEnumerator(name: "LZMA_CHECK_NONE", value: 0, isUnsigned: true)
!31 = !DIEnumerator(name: "LZMA_CHECK_CRC32", value: 1, isUnsigned: true)
!32 = !DIEnumerator(name: "LZMA_CHECK_CRC64", value: 4, isUnsigned: true)
!33 = !DIEnumerator(name: "LZMA_CHECK_SHA256", value: 10, isUnsigned: true)
!34 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !36, file: !35, line: 187, baseType: !7, size: 32, elements: !126)
!35 = !DIFile(filename: "liblzma/common/common.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!36 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_internal_s", file: !35, line: 179, size: 704, elements: !37)
!37 = !{!38, !118, !119, !120, !125}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !36, file: !35, line: 181, baseType: !39, size: 512)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_next_coder", file: !35, line: 80, baseType: !40)
!40 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_next_coder_s", file: !35, line: 124, size: 512, elements: !41)
!41 = !{!42, !45, !53, !56, !89, !94, !101, !106}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "coder", scope: !40, file: !35, line: 126, baseType: !43, size: 64)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_coder", file: !35, line: 78, baseType: null)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !40, file: !35, line: 130, baseType: !46, size: 64, offset: 64)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_vli", file: !47, line: 63, baseType: !48)
!47 = !DIFile(filename: "liblzma/api/lzma/vli.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !49, line: 27, baseType: !50)
!49 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !51, line: 45, baseType: !52)
!51 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!52 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !40, file: !35, line: 136, baseType: !54, size: 64, offset: 128)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !55, line: 90, baseType: !52)
!55 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!56 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !40, file: !35, line: 139, baseType: !57, size: 64, offset: 192)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_code_function", file: !35, line: 94, baseType: !58)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!59 = !DISubroutineType(types: !60)
!60 = !{!61, !43, !62, !78, !84, !71, !86, !84, !71, !88}
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_ret", file: !6, line: 237, baseType: !5)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_allocator", file: !6, line: 403, baseType: !64)
!64 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 341, size: 192, elements: !65)
!65 = !{!66, !73, !77}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !64, file: !6, line: 376, baseType: !67, size: 64)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = !DISubroutineType(types: !69)
!69 = !{!70, !70, !71, !71}
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !72, line: 46, baseType: !52)
!72 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!73 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !64, file: !6, line: 390, baseType: !74, size: 64, offset: 64)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = !DISubroutineType(types: !76)
!76 = !{null, !70, !70}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !64, file: !6, line: 401, baseType: !70, size: 64, offset: 128)
!78 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !79)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !81)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !49, line: 24, baseType: !82)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !51, line: 38, baseType: !83)
!83 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!84 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !85)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !87)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_action", file: !6, line: 322, baseType: !21)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !40, file: !35, line: 144, baseType: !90, size: 64, offset: 256)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_end_function", file: !35, line: 102, baseType: !91)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = !DISubroutineType(types: !93)
!93 = !{null, !43, !62}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "get_check", scope: !40, file: !35, line: 148, baseType: !95, size: 64, offset: 320)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = !DISubroutineType(types: !97)
!97 = !{!98, !99}
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_check", file: !28, line: 55, baseType: !27)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !44)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "memconfig", scope: !40, file: !35, line: 152, baseType: !102, size: 64, offset: 384)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DISubroutineType(types: !104)
!104 = !{!61, !43, !105, !105, !48}
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !40, file: !35, line: 157, baseType: !107, size: 64, offset: 448)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = !DISubroutineType(types: !109)
!109 = !{!61, !43, !62, !110, !110}
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !112)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_filter", file: !113, line: 65, baseType: !114)
!113 = !DIFile(filename: "liblzma/api/lzma/filter.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!114 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !113, line: 43, size: 128, elements: !115)
!115 = !{!116, !117}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !114, file: !113, line: 54, baseType: !46, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !114, file: !113, line: 63, baseType: !70, size: 64, offset: 64)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !36, file: !35, line: 194, baseType: !34, size: 32, offset: 512)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "avail_in", scope: !36, file: !35, line: 199, baseType: !71, size: 64, offset: 576)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "supported_actions", scope: !36, file: !35, line: 202, baseType: !121, size: 32, offset: 640)
!121 = !DICompositeType(tag: DW_TAG_array_type, baseType: !122, size: 32, elements: !123)
!122 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!123 = !{!124}
!124 = !DISubrange(count: 4)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "allow_buf_error", scope: !36, file: !35, line: 206, baseType: !122, size: 8, offset: 672)
!126 = !{!127, !128, !129, !130, !131, !132}
!127 = !DIEnumerator(name: "ISEQ_RUN", value: 0, isUnsigned: true)
!128 = !DIEnumerator(name: "ISEQ_SYNC_FLUSH", value: 1, isUnsigned: true)
!129 = !DIEnumerator(name: "ISEQ_FULL_FLUSH", value: 2, isUnsigned: true)
!130 = !DIEnumerator(name: "ISEQ_FINISH", value: 3, isUnsigned: true)
!131 = !DIEnumerator(name: "ISEQ_END", value: 4, isUnsigned: true)
!132 = !DIEnumerator(name: "ISEQ_ERROR", value: 5, isUnsigned: true)
!133 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 44, baseType: !7, size: 32, elements: !134)
!134 = !{!135}
!135 = !DIEnumerator(name: "LZMA_RESERVED_ENUM", value: 0, isUnsigned: true)
!136 = !{!70, !137}
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_filter_find", file: !138, line: 35, baseType: !139)
!138 = !DIFile(filename: "liblzma/common/filter_common.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!140 = !DISubroutineType(types: !141)
!141 = !{!142, !46}
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!143 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !144)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_filter_coder", file: !138, line: 32, baseType: !145)
!145 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !138, line: 20, size: 192, elements: !146)
!146 = !{!147, !148, !162}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !145, file: !138, line: 22, baseType: !46, size: 64)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !145, file: !138, line: 26, baseType: !149, size: 64, offset: 64)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_init_function", file: !35, line: 86, baseType: !150)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!151 = !DISubroutineType(types: !152)
!152 = !{!61, !153, !62, !154}
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!155 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !156)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_filter_info", file: !35, line: 82, baseType: !157)
!157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_filter_info_s", file: !35, line: 109, size: 192, elements: !158)
!158 = !{!159, !160, !161}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !157, file: !35, line: 112, baseType: !46, size: 64)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !157, file: !35, line: 116, baseType: !149, size: 64, offset: 64)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !157, file: !35, line: 119, baseType: !70, size: 64, offset: 128)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "memusage", scope: !145, file: !138, line: 30, baseType: !163, size: 64, offset: 128)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = !DISubroutineType(types: !165)
!165 = !{!48, !166}
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!167 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!168 = !{!0}
!169 = !DICompositeType(tag: DW_TAG_array_type, baseType: !170, size: 4032, elements: !193)
!170 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !171)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_filter_encoder", file: !3, line: 53, baseType: !172)
!172 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 21, size: 448, elements: !173)
!173 = !{!174, !175, !176, !177, !181, !188, !189}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !172, file: !3, line: 23, baseType: !46, size: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !172, file: !3, line: 27, baseType: !149, size: 64, offset: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "memusage", scope: !172, file: !3, line: 31, baseType: !163, size: 64, offset: 128)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !172, file: !3, line: 37, baseType: !178, size: 64, offset: 192)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = !DISubroutineType(types: !180)
!180 = !{!46, !166}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "props_size_get", scope: !172, file: !3, line: 42, baseType: !182, size: 64, offset: 256)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DISubroutineType(types: !184)
!184 = !{!61, !185, !166}
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !49, line: 26, baseType: !187)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !51, line: 42, baseType: !7)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "props_size_fixed", scope: !172, file: !3, line: 43, baseType: !186, size: 32, offset: 320)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "props_encode", scope: !172, file: !3, line: 51, baseType: !190, size: 64, offset: 384)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = !DISubroutineType(types: !192)
!192 = !{!61, !166, !87}
!193 = !{!194}
!194 = !DISubrange(count: 9)
!195 = !{i32 7, !"Dwarf Version", i32 4}
!196 = !{i32 2, !"Debug Info Version", i32 3}
!197 = !{i32 1, !"wchar_size", i32 4}
!198 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!199 = distinct !DISubprogram(name: "lzma_filter_encoder_is_supported", scope: !3, file: !3, line: 165, type: !200, scopeLine: 166, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !203)
!200 = !DISubroutineType(types: !201)
!201 = !{!202, !46}
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_bool", file: !6, line: 29, baseType: !83)
!203 = !{}
!204 = !DILocalVariable(name: "id", arg: 1, scope: !199, file: !3, line: 165, type: !46)
!205 = !DILocation(line: 165, column: 43, scope: !199)
!206 = !DILocation(line: 167, column: 22, scope: !199)
!207 = !DILocation(line: 167, column: 9, scope: !199)
!208 = !DILocation(line: 167, column: 26, scope: !199)
!209 = !DILocation(line: 167, column: 2, scope: !199)
!210 = distinct !DISubprogram(name: "encoder_find", scope: !3, file: !3, line: 154, type: !211, scopeLine: 155, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !203)
!211 = !DISubroutineType(types: !212)
!212 = !{!213, !46}
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!214 = !DILocalVariable(name: "id", arg: 1, scope: !210, file: !3, line: 154, type: !46)
!215 = !DILocation(line: 154, column: 23, scope: !210)
!216 = !DILocalVariable(name: "i", scope: !217, file: !3, line: 156, type: !71)
!217 = distinct !DILexicalBlock(scope: !210, file: !3, line: 156, column: 2)
!218 = !DILocation(line: 156, column: 14, scope: !217)
!219 = !DILocation(line: 156, column: 7, scope: !217)
!220 = !DILocation(line: 156, column: 21, scope: !221)
!221 = distinct !DILexicalBlock(scope: !217, file: !3, line: 156, column: 2)
!222 = !DILocation(line: 156, column: 23, scope: !221)
!223 = !DILocation(line: 156, column: 2, scope: !217)
!224 = !DILocation(line: 157, column: 16, scope: !225)
!225 = distinct !DILexicalBlock(scope: !221, file: !3, line: 157, column: 7)
!226 = !DILocation(line: 157, column: 7, scope: !225)
!227 = !DILocation(line: 157, column: 19, scope: !225)
!228 = !DILocation(line: 157, column: 25, scope: !225)
!229 = !DILocation(line: 157, column: 22, scope: !225)
!230 = !DILocation(line: 157, column: 7, scope: !221)
!231 = !DILocation(line: 158, column: 22, scope: !225)
!232 = !DILocation(line: 158, column: 20, scope: !225)
!233 = !DILocation(line: 158, column: 4, scope: !225)
!234 = !DILocation(line: 156, column: 47, scope: !221)
!235 = !DILocation(line: 156, column: 2, scope: !221)
!236 = distinct !{!236, !223, !237}
!237 = !DILocation(line: 158, column: 22, scope: !217)
!238 = !DILocation(line: 160, column: 2, scope: !210)
!239 = !DILocation(line: 161, column: 1, scope: !210)
!240 = distinct !DISubprogram(name: "lzma_filters_update", scope: !3, file: !3, line: 172, type: !241, scopeLine: 173, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !203)
!241 = !DISubroutineType(types: !242)
!242 = !{!61, !243, !110}
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_stream", file: !6, line: 490, baseType: !245)
!245 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 453, size: 1088, elements: !246)
!246 = !{!247, !248, !249, !250, !251, !252, !253, !254, !257, !258, !259, !260, !261, !262, !263, !264, !265, !267}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "next_in", scope: !245, file: !6, line: 454, baseType: !79, size: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "avail_in", scope: !245, file: !6, line: 455, baseType: !71, size: 64, offset: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "total_in", scope: !245, file: !6, line: 456, baseType: !48, size: 64, offset: 128)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "next_out", scope: !245, file: !6, line: 458, baseType: !87, size: 64, offset: 192)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "avail_out", scope: !245, file: !6, line: 459, baseType: !71, size: 64, offset: 256)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "total_out", scope: !245, file: !6, line: 460, baseType: !48, size: 64, offset: 320)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !245, file: !6, line: 468, baseType: !62, size: 64, offset: 384)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !245, file: !6, line: 471, baseType: !255, size: 64, offset: 448)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_internal", file: !6, line: 411, baseType: !36)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr1", scope: !245, file: !6, line: 479, baseType: !70, size: 64, offset: 512)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr2", scope: !245, file: !6, line: 480, baseType: !70, size: 64, offset: 576)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr3", scope: !245, file: !6, line: 481, baseType: !70, size: 64, offset: 640)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr4", scope: !245, file: !6, line: 482, baseType: !70, size: 64, offset: 704)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int1", scope: !245, file: !6, line: 483, baseType: !48, size: 64, offset: 768)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int2", scope: !245, file: !6, line: 484, baseType: !48, size: 64, offset: 832)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int3", scope: !245, file: !6, line: 485, baseType: !71, size: 64, offset: 896)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int4", scope: !245, file: !6, line: 486, baseType: !71, size: 64, offset: 960)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum1", scope: !245, file: !6, line: 487, baseType: !266, size: 32, offset: 1024)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_reserved_enum", file: !6, line: 46, baseType: !133)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum2", scope: !245, file: !6, line: 488, baseType: !266, size: 32, offset: 1056)
!268 = !DILocalVariable(name: "strm", arg: 1, scope: !240, file: !3, line: 172, type: !243)
!269 = !DILocation(line: 172, column: 34, scope: !240)
!270 = !DILocalVariable(name: "filters", arg: 2, scope: !240, file: !3, line: 172, type: !110)
!271 = !DILocation(line: 172, column: 59, scope: !240)
!272 = !DILocation(line: 174, column: 6, scope: !273)
!273 = distinct !DILexicalBlock(scope: !240, file: !3, line: 174, column: 6)
!274 = !DILocation(line: 174, column: 12, scope: !273)
!275 = !DILocation(line: 174, column: 22, scope: !273)
!276 = !DILocation(line: 174, column: 27, scope: !273)
!277 = !DILocation(line: 174, column: 34, scope: !273)
!278 = !DILocation(line: 174, column: 6, scope: !240)
!279 = !DILocation(line: 175, column: 3, scope: !273)
!280 = !DILocation(line: 178, column: 32, scope: !281)
!281 = distinct !DILexicalBlock(scope: !240, file: !3, line: 178, column: 6)
!282 = !DILocation(line: 178, column: 6, scope: !281)
!283 = !DILocation(line: 178, column: 41, scope: !281)
!284 = !DILocation(line: 178, column: 6, scope: !240)
!285 = !DILocation(line: 179, column: 3, scope: !281)
!286 = !DILocalVariable(name: "count", scope: !240, file: !3, line: 183, type: !71)
!287 = !DILocation(line: 183, column: 9, scope: !240)
!288 = !DILocation(line: 184, column: 2, scope: !240)
!289 = !DILocation(line: 184, column: 9, scope: !240)
!290 = !DILocation(line: 184, column: 17, scope: !240)
!291 = !DILocation(line: 184, column: 24, scope: !240)
!292 = !DILocation(line: 184, column: 27, scope: !240)
!293 = !DILocation(line: 185, column: 3, scope: !240)
!294 = distinct !{!294, !288, !295}
!295 = !DILocation(line: 185, column: 5, scope: !240)
!296 = !DILocalVariable(name: "reversed_filters", scope: !240, file: !3, line: 187, type: !297)
!297 = !DICompositeType(tag: DW_TAG_array_type, baseType: !112, size: 640, elements: !298)
!298 = !{!299}
!299 = !DISubrange(count: 5)
!300 = !DILocation(line: 187, column: 14, scope: !240)
!301 = !DILocalVariable(name: "i", scope: !302, file: !3, line: 188, type: !71)
!302 = distinct !DILexicalBlock(scope: !240, file: !3, line: 188, column: 2)
!303 = !DILocation(line: 188, column: 14, scope: !302)
!304 = !DILocation(line: 188, column: 7, scope: !302)
!305 = !DILocation(line: 188, column: 21, scope: !306)
!306 = distinct !DILexicalBlock(scope: !302, file: !3, line: 188, column: 2)
!307 = !DILocation(line: 188, column: 25, scope: !306)
!308 = !DILocation(line: 188, column: 23, scope: !306)
!309 = !DILocation(line: 188, column: 2, scope: !302)
!310 = !DILocation(line: 189, column: 20, scope: !306)
!311 = !DILocation(line: 189, column: 28, scope: !306)
!312 = !DILocation(line: 189, column: 26, scope: !306)
!313 = !DILocation(line: 189, column: 30, scope: !306)
!314 = !DILocation(line: 189, column: 3, scope: !306)
!315 = !DILocation(line: 189, column: 37, scope: !306)
!316 = !DILocation(line: 189, column: 45, scope: !306)
!317 = !DILocation(line: 188, column: 32, scope: !306)
!318 = !DILocation(line: 188, column: 2, scope: !306)
!319 = distinct !{!319, !309, !320}
!320 = !DILocation(line: 189, column: 46, scope: !302)
!321 = !DILocation(line: 191, column: 19, scope: !240)
!322 = !DILocation(line: 191, column: 2, scope: !240)
!323 = !DILocation(line: 191, column: 26, scope: !240)
!324 = !DILocation(line: 191, column: 29, scope: !240)
!325 = !DILocation(line: 193, column: 9, scope: !240)
!326 = !DILocation(line: 193, column: 15, scope: !240)
!327 = !DILocation(line: 193, column: 25, scope: !240)
!328 = !DILocation(line: 193, column: 30, scope: !240)
!329 = !DILocation(line: 193, column: 37, scope: !240)
!330 = !DILocation(line: 193, column: 43, scope: !240)
!331 = !DILocation(line: 193, column: 53, scope: !240)
!332 = !DILocation(line: 193, column: 58, scope: !240)
!333 = !DILocation(line: 194, column: 4, scope: !240)
!334 = !DILocation(line: 194, column: 10, scope: !240)
