; ModuleID = 'liblzma/common/stream_flags_encoder.c'
source_filename = "liblzma/common/stream_flags_encoder.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.lzma_stream_flags = type { i32, i64, i32, i32, i32, i32, i32, i8, i8, i8, i8, i8, i8, i8, i8, i32, i32 }

@lzma_header_magic = external dso_local constant [6 x i8], align 1
@lzma_footer_magic = external dso_local constant [2 x i8], align 1

; Function Attrs: noinline nounwind uwtable
define dso_local i32 @lzma_stream_header_encode(%struct.lzma_stream_flags* %options, i8* %out) #0 !dbg !34 {
entry:
  %retval = alloca i32, align 4
  %options.addr = alloca %struct.lzma_stream_flags*, align 8
  %out.addr = alloca i8*, align 8
  %crc = alloca i32, align 4
  store %struct.lzma_stream_flags* %options, %struct.lzma_stream_flags** %options.addr, align 8
  call void @llvm.dbg.declare(metadata %struct.lzma_stream_flags** %options.addr, metadata !78, metadata !DIExpression()), !dbg !79
  store i8* %out, i8** %out.addr, align 8
  call void @llvm.dbg.declare(metadata i8** %out.addr, metadata !80, metadata !DIExpression()), !dbg !81
  %0 = load %struct.lzma_stream_flags*, %struct.lzma_stream_flags** %options.addr, align 8, !dbg !82
  %version = getelementptr inbounds %struct.lzma_stream_flags, %struct.lzma_stream_flags* %0, i32 0, i32 0, !dbg !84
  %1 = load i32, i32* %version, align 8, !dbg !84
  %cmp = icmp ne i32 %1, 0, !dbg !85

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !29, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "liblzma/common/stream_flags_encoder.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!2 = !{!3, !19, !26}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 57, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "liblzma/api/lzma/base.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18}
!7 = !DIEnumerator(name: "LZMA_OK", value: 0, isUnsigned: true)
!8 = !DIEnumerator(name: "LZMA_STREAM_END", value: 1, isUnsigned: true)
!9 = !DIEnumerator(name: "LZMA_NO_CHECK", value: 2, isUnsigned: true)
!10 = !DIEnumerator(name: "LZMA_UNSUPPORTED_CHECK", value: 3, isUnsigned: true)
!11 = !DIEnumerator(name: "LZMA_GET_CHECK", value: 4, isUnsigned: true)
!12 = !DIEnumerator(name: "LZMA_MEM_ERROR", value: 5, isUnsigned: true)
!13 = !DIEnumerator(name: "LZMA_MEMLIMIT_ERROR", value: 6, isUnsigned: true)
!14 = !DIEnumerator(name: "LZMA_FORMAT_ERROR", value: 7, isUnsigned: true)
!15 = !DIEnumerator(name: "LZMA_OPTIONS_ERROR", value: 8, isUnsigned: true)
!16 = !DIEnumerator(name: "LZMA_DATA_ERROR", value: 9, isUnsigned: true)
!17 = !DIEnumerator(name: "LZMA_BUF_ERROR", value: 10, isUnsigned: true)
!18 = !DIEnumerator(name: "LZMA_PROG_ERROR", value: 11, isUnsigned: true)
!19 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !20, line: 27, baseType: !5, size: 32, elements: !21)
!20 = !DIFile(filename: "liblzma/api/lzma/check.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!21 = !{!22, !23, !24, !25}
!22 = !DIEnumerator(name: "LZMA_CHECK_NONE", value: 0, isUnsigned: true)
!23 = !DIEnumerator(name: "LZMA_CHECK_CRC32", value: 1, isUnsigned: true)
!24 = !DIEnumerator(name: "LZMA_CHECK_CRC64", value: 4, isUnsigned: true)
!25 = !DIEnumerator(name: "LZMA_CHECK_SHA256", value: 10, isUnsigned: true)
!26 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 44, baseType: !5, size: 32, elements: !27)
!27 = !{!28}
!28 = !DIEnumerator(name: "LZMA_RESERVED_ENUM", value: 0, isUnsigned: true)
!29 = !{!5}
!30 = !{i32 7, !"Dwarf Version", i32 4}
!31 = !{i32 2, !"Debug Info Version", i32 3}
!32 = !{i32 1, !"wchar_size", i32 4}
!33 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!34 = distinct !DISubprogram(name: "lzma_stream_header_encode", scope: !1, file: !1, line: 30, type: !35, scopeLine: 31, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !77)
!35 = !DISubroutineType(types: !36)
!36 = !{!37, !38, !74}
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_ret", file: !4, line: 237, baseType: !3)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!39 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !40)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_stream_flags", file: !41, line: 105, baseType: !42)
!41 = !DIFile(filename: "liblzma/api/lzma/stream_flags.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!42 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !41, line: 33, size: 448, elements: !43)
!43 = !{!44, !49, !55, !57, !59, !60, !61, !62, !65, !66, !67, !68, !69, !70, !71, !72, !73}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !42, file: !41, line: 51, baseType: !45, size: 32)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !46, line: 26, baseType: !47)
!46 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !48, line: 42, baseType: !5)
!48 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!49 = !DIDerivedType(tag: DW_TAG_member, name: "backward_size", scope: !42, file: !41, line: 69, baseType: !50, size: 64, offset: 64)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_vli", file: !51, line: 63, baseType: !52)
!51 = !DIFile(filename: "liblzma/api/lzma/vli.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !46, line: 27, baseType: !53)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !48, line: 45, baseType: !54)
!54 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !42, file: !41, line: 79, baseType: !56, size: 32, offset: 128)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_check", file: !20, line: 55, baseType: !19)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum1", scope: !42, file: !41, line: 90, baseType: !58, size: 32, offset: 160)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_reserved_enum", file: !4, line: 46, baseType: !26)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum2", scope: !42, file: !41, line: 91, baseType: !58, size: 32, offset: 192)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum3", scope: !42, file: !41, line: 92, baseType: !58, size: 32, offset: 224)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum4", scope: !42, file: !41, line: 93, baseType: !58, size: 32, offset: 256)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool1", scope: !42, file: !41, line: 94, baseType: !63, size: 8, offset: 288)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_bool", file: !4, line: 29, baseType: !64)
!64 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool2", scope: !42, file: !41, line: 95, baseType: !63, size: 8, offset: 296)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool3", scope: !42, file: !41, line: 96, baseType: !63, size: 8, offset: 304)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool4", scope: !42, file: !41, line: 97, baseType: !63, size: 8, offset: 312)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool5", scope: !42, file: !41, line: 98, baseType: !63, size: 8, offset: 320)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool6", scope: !42, file: !41, line: 99, baseType: !63, size: 8, offset: 328)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool7", scope: !42, file: !41, line: 100, baseType: !63, size: 8, offset: 336)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_bool8", scope: !42, file: !41, line: 101, baseType: !63, size: 8, offset: 344)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int1", scope: !42, file: !41, line: 102, baseType: !45, size: 32, offset: 352)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int2", scope: !42, file: !41, line: 103, baseType: !45, size: 32, offset: 384)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !46, line: 24, baseType: !76)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !48, line: 38, baseType: !64)
!77 = !{}
!78 = !DILocalVariable(name: "options", arg: 1, scope: !34, file: !1, line: 30, type: !38)
!79 = !DILocation(line: 30, column: 52, scope: !34)
!80 = !DILocalVariable(name: "out", arg: 2, scope: !34, file: !1, line: 30, type: !74)
!81 = !DILocation(line: 30, column: 70, scope: !34)
!82 = !DILocation(line: 35, column: 6, scope: !83)
!83 = distinct !DILexicalBlock(scope: !34, file: !1, line: 35, column: 6)
!84 = !DILocation(line: 35, column: 15, scope: !83)
!85 = !DILocation(line: 35, column: 23, scope: !83)
!86 = !DILocation(line: 35, column: 6, scope: !34)
!87 = !DILocation(line: 36, column: 3, scope: !83)
!88 = !DILocation(line: 39, column: 9, scope: !34)
!89 = !DILocation(line: 39, column: 2, scope: !34)
!90 = !DILocation(line: 42, column: 26, scope: !91)
!91 = distinct !DILexicalBlock(scope: !34, file: !1, line: 42, column: 6)
!92 = !DILocation(line: 42, column: 35, scope: !91)
!93 = !DILocation(line: 42, column: 39, scope: !91)
!94 = !DILocation(line: 42, column: 6, scope: !91)
!95 = !DILocation(line: 42, column: 6, scope: !34)
!96 = !DILocation(line: 43, column: 3, scope: !91)
!97 = !DILocalVariable(name: "crc", scope: !34, file: !1, line: 46, type: !98)
!98 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !45)
!99 = !DILocation(line: 46, column: 17, scope: !34)
!100 = !DILocation(line: 46, column: 34, scope: !34)
!101 = !DILocation(line: 46, column: 38, scope: !34)
!102 = !DILocation(line: 46, column: 23, scope: !34)
!103 = !DILocation(line: 49, column: 22, scope: !34)
!104 = !DILocation(line: 49, column: 26, scope: !34)
!105 = !DILocation(line: 50, column: 4, scope: !34)
!106 = !DILocation(line: 50, column: 30, scope: !34)
!107 = !DILocation(line: 49, column: 2, scope: !34)
!108 = !DILocation(line: 52, column: 2, scope: !34)
!109 = !DILocation(line: 53, column: 1, scope: !34)
!110 = distinct !DISubprogram(name: "stream_flags_encode", scope: !1, file: !1, line: 17, type: !111, scopeLine: 18, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !77)
!111 = !DISubroutineType(types: !112)
!112 = !{!113, !38, !74}
!113 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!114 = !DILocalVariable(name: "options", arg: 1, scope: !110, file: !1, line: 17, type: !38)
!115 = !DILocation(line: 17, column: 46, scope: !110)
!116 = !DILocalVariable(name: "out", arg: 2, scope: !110, file: !1, line: 17, type: !74)
!117 = !DILocation(line: 17, column: 64, scope: !110)
!118 = !DILocation(line: 19, column: 21, scope: !119)
!119 = distinct !DILexicalBlock(scope: !110, file: !1, line: 19, column: 6)
!120 = !DILocation(line: 19, column: 30, scope: !119)
!121 = !DILocation(line: 19, column: 37, scope: !119)
!122 = !DILocation(line: 19, column: 6, scope: !110)
!123 = !DILocation(line: 20, column: 3, scope: !119)
!124 = !DILocation(line: 22, column: 2, scope: !110)
!125 = !DILocation(line: 22, column: 9, scope: !110)
!126 = !DILocation(line: 23, column: 11, scope: !110)
!127 = !DILocation(line: 23, column: 20, scope: !110)
!128 = !DILocation(line: 23, column: 2, scope: !110)
!129 = !DILocation(line: 23, column: 9, scope: !110)
!130 = !DILocation(line: 25, column: 2, scope: !110)
!131 = !DILocation(line: 26, column: 1, scope: !110)
!132 = distinct !DISubprogram(name: "unaligned_write32le", scope: !133, file: !133, line: 351, type: !134, scopeLine: 352, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !77)
