; ModuleID = 'spec_xz.c'
source_filename = "spec_xz.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.spec_fd_t = type { i64, i64, i64, i32, i8* }
%struct.lzma_stream = type { i8*, i64, i64, i8*, i64, i64, %struct.lzma_allocator*, %struct.lzma_internal_s*, i8*, i8*, i8*, i8*, i64, i64, i64, i64, i32, i32 }
%struct.lzma_allocator = type { i8* (i8*, i64, i64)*, void (i8*, i8*)*, i8* }
%struct.lzma_internal_s = type opaque
%struct.lzma_options_lzma = type { i32, i8*, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i8*, i8* }
%struct.lzma_filter = type { i64, i8* }

@.str = private unnamed_addr constant [31 x i8] c"unsupported check method NONE\0A\00", align 1
@.str.1 = private unnamed_addr constant [32 x i8] c"unsupported check method CRC32\0A\00", align 1
@.str.2 = private unnamed_addr constant [32 x i8] c"unsupported check method CRC64\0A\00", align 1
@.str.3 = private unnamed_addr constant [33 x i8] c"unsupported check method SHA256\0A\00", align 1
@.str.4 = private unnamed_addr constant [47 x i8] c"unknown check method!  This shouldn't happen.\0A\00", align 1
@.str.5 = private unnamed_addr constant [25 x i8] c"Memory allocation failed\00", align 1
@.str.6 = private unnamed_addr constant [34 x i8] c"Specified preset is not supported\00", align 1
@.str.7 = private unnamed_addr constant [14 x i8] c"Unknown error\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !47, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "spec_xz.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!2 = !{!3, !8, !13, !20, !27, !41}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 44, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "liblzma/api/lzma/base.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7}
!7 = !DIEnumerator(name: "LZMA_RESERVED_ENUM", value: 0, isUnsigned: true)
!8 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !9, line: 138, baseType: !5, size: 32, elements: !10)
!9 = !DIFile(filename: "liblzma/api/lzma/lzma.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!10 = !{!11, !12}
!11 = !DIEnumerator(name: "LZMA_MODE_FAST", value: 1, isUnsigned: true)
!12 = !DIEnumerator(name: "LZMA_MODE_NORMAL", value: 2, isUnsigned: true)
!13 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !9, line: 58, baseType: !5, size: 32, elements: !14)
!14 = !{!15, !16, !17, !18, !19}
!15 = !DIEnumerator(name: "LZMA_MF_HC3", value: 3, isUnsigned: true)
!16 = !DIEnumerator(name: "LZMA_MF_HC4", value: 4, isUnsigned: true)
!17 = !DIEnumerator(name: "LZMA_MF_BT2", value: 18, isUnsigned: true)
!18 = !DIEnumerator(name: "LZMA_MF_BT3", value: 19, isUnsigned: true)
!19 = !DIEnumerator(name: "LZMA_MF_BT4", value: 20, isUnsigned: true)
!20 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !21, line: 27, baseType: !5, size: 32, elements: !22)
!21 = !DIFile(filename: "liblzma/api/lzma/check.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!22 = !{!23, !24, !25, !26}
!23 = !DIEnumerator(name: "LZMA_CHECK_NONE", value: 0, isUnsigned: true)
!24 = !DIEnumerator(name: "LZMA_CHECK_CRC32", value: 1, isUnsigned: true)
!25 = !DIEnumerator(name: "LZMA_CHECK_CRC64", value: 4, isUnsigned: true)
!26 = !DIEnumerator(name: "LZMA_CHECK_SHA256", value: 10, isUnsigned: true)
!27 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 57, baseType: !5, size: 32, elements: !28)
!28 = !{!29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40}
!29 = !DIEnumerator(name: "LZMA_OK", value: 0, isUnsigned: true)
!30 = !DIEnumerator(name: "LZMA_STREAM_END", value: 1, isUnsigned: true)
!31 = !DIEnumerator(name: "LZMA_NO_CHECK", value: 2, isUnsigned: true)
!32 = !DIEnumerator(name: "LZMA_UNSUPPORTED_CHECK", value: 3, isUnsigned: true)
!33 = !DIEnumerator(name: "LZMA_GET_CHECK", value: 4, isUnsigned: true)
!34 = !DIEnumerator(name: "LZMA_MEM_ERROR", value: 5, isUnsigned: true)
!35 = !DIEnumerator(name: "LZMA_MEMLIMIT_ERROR", value: 6, isUnsigned: true)
!36 = !DIEnumerator(name: "LZMA_FORMAT_ERROR", value: 7, isUnsigned: true)
!37 = !DIEnumerator(name: "LZMA_OPTIONS_ERROR", value: 8, isUnsigned: true)
!38 = !DIEnumerator(name: "LZMA_DATA_ERROR", value: 9, isUnsigned: true)
!39 = !DIEnumerator(name: "LZMA_BUF_ERROR", value: 10, isUnsigned: true)
!40 = !DIEnumerator(name: "LZMA_PROG_ERROR", value: 11, isUnsigned: true)
!41 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 250, baseType: !5, size: 32, elements: !42)
!42 = !{!43, !44, !45, !46}
!43 = !DIEnumerator(name: "LZMA_RUN", value: 0, isUnsigned: true)
!44 = !DIEnumerator(name: "LZMA_SYNC_FLUSH", value: 1, isUnsigned: true)
!45 = !DIEnumerator(name: "LZMA_FULL_FLUSH", value: 2, isUnsigned: true)
!46 = !DIEnumerator(name: "LZMA_FINISH", value: 3, isUnsigned: true)
!47 = !{!48, !5, !49}
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !50, line: 46, baseType: !51)
!50 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!51 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!52 = !{i32 7, !"Dwarf Version", i32 4}
!53 = !{i32 2, !"Debug Info Version", i32 3}
!54 = !{i32 1, !"wchar_size", i32 4}
!55 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!56 = distinct !DISubprogram(name: "init_encoder", scope: !1, file: !1, line: 68, type: !57, scopeLine: 68, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !142)
!57 = !DISubroutineType(types: !58)
!58 = !{!59, !60, !109, !114, !141}
!59 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_stream", file: !4, line: 490, baseType: !62)
!62 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 453, size: 1088, elements: !63)
!63 = !{!64, !72, !73, !76, !78, !79, !80, !94, !98, !99, !100, !101, !102, !103, !104, !105, !106, !108}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "next_in", scope: !62, file: !4, line: 454, baseType: !65, size: 64)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!66 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !67)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !68, line: 24, baseType: !69)
!68 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !70, line: 38, baseType: !71)
!70 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!71 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "avail_in", scope: !62, file: !4, line: 455, baseType: !49, size: 64, offset: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "total_in", scope: !62, file: !4, line: 456, baseType: !74, size: 64, offset: 128)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !68, line: 27, baseType: !75)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !70, line: 45, baseType: !51)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "next_out", scope: !62, file: !4, line: 458, baseType: !77, size: 64, offset: 192)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "avail_out", scope: !62, file: !4, line: 459, baseType: !49, size: 64, offset: 256)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "total_out", scope: !62, file: !4, line: 460, baseType: !74, size: 64, offset: 320)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "allocator", scope: !62, file: !4, line: 468, baseType: !81, size: 64, offset: 384)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_allocator", file: !4, line: 403, baseType: !83)
!83 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 341, size: 192, elements: !84)
!84 = !{!85, !89, !93}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !83, file: !4, line: 376, baseType: !86, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = !DISubroutineType(types: !88)
!88 = !{!48, !48, !49, !49}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !83, file: !4, line: 390, baseType: !90, size: 64, offset: 64)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = !DISubroutineType(types: !92)
!92 = !{null, !48, !48}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !83, file: !4, line: 401, baseType: !48, size: 64, offset: 128)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !62, file: !4, line: 471, baseType: !95, size: 64, offset: 448)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_internal", file: !4, line: 411, baseType: !97)
!97 = !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_internal_s", file: !4, line: 411, flags: DIFlagFwdDecl)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr1", scope: !62, file: !4, line: 479, baseType: !48, size: 64, offset: 512)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr2", scope: !62, file: !4, line: 480, baseType: !48, size: 64, offset: 576)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr3", scope: !62, file: !4, line: 481, baseType: !48, size: 64, offset: 640)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr4", scope: !62, file: !4, line: 482, baseType: !48, size: 64, offset: 704)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int1", scope: !62, file: !4, line: 483, baseType: !74, size: 64, offset: 768)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int2", scope: !62, file: !4, line: 484, baseType: !74, size: 64, offset: 832)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int3", scope: !62, file: !4, line: 485, baseType: !49, size: 64, offset: 896)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int4", scope: !62, file: !4, line: 486, baseType: !49, size: 64, offset: 960)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum1", scope: !62, file: !4, line: 487, baseType: !107, size: 32, offset: 1024)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_reserved_enum", file: !4, line: 46, baseType: !3)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum2", scope: !62, file: !4, line: 488, baseType: !107, size: 32, offset: 1056)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_options_lzma", file: !9, line: 399, baseType: !111)
!111 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !9, line: 185, size: 896, elements: !112)
!112 = !{!113, !116, !117, !118, !119, !120, !121, !123, !124, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "dict_size", scope: !111, file: !9, line: 217, baseType: !114, size: 32)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !68, line: 26, baseType: !115)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !70, line: 42, baseType: !5)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "preset_dict", scope: !111, file: !9, line: 240, baseType: !65, size: 64, offset: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "preset_dict_size", scope: !111, file: !9, line: 254, baseType: !114, size: 32, offset: 128)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "lc", scope: !111, file: !9, line: 281, baseType: !114, size: 32, offset: 160)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "lp", scope: !111, file: !9, line: 293, baseType: !114, size: 32, offset: 192)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !111, file: !9, line: 316, baseType: !114, size: 32, offset: 224)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !111, file: !9, line: 322, baseType: !122, size: 32, offset: 256)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_mode", file: !9, line: 155, baseType: !8)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "nice_len", scope: !111, file: !9, line: 342, baseType: !114, size: 32, offset: 288)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "mf", scope: !111, file: !9, line: 345, baseType: !125, size: 32, offset: 320)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_match_finder", file: !9, line: 111, baseType: !13)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !111, file: !9, line: 375, baseType: !114, size: 32, offset: 352)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int1", scope: !111, file: !9, line: 384, baseType: !114, size: 32, offset: 384)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int2", scope: !111, file: !9, line: 385, baseType: !114, size: 32, offset: 416)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int3", scope: !111, file: !9, line: 386, baseType: !114, size: 32, offset: 448)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int4", scope: !111, file: !9, line: 387, baseType: !114, size: 32, offset: 480)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int5", scope: !111, file: !9, line: 388, baseType: !114, size: 32, offset: 512)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int6", scope: !111, file: !9, line: 389, baseType: !114, size: 32, offset: 544)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int7", scope: !111, file: !9, line: 390, baseType: !114, size: 32, offset: 576)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_int8", scope: !111, file: !9, line: 391, baseType: !114, size: 32, offset: 608)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum1", scope: !111, file: !9, line: 392, baseType: !107, size: 32, offset: 640)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum2", scope: !111, file: !9, line: 393, baseType: !107, size: 32, offset: 672)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum3", scope: !111, file: !9, line: 394, baseType: !107, size: 32, offset: 704)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_enum4", scope: !111, file: !9, line: 395, baseType: !107, size: 32, offset: 736)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr1", scope: !111, file: !9, line: 396, baseType: !48, size: 64, offset: 768)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_ptr2", scope: !111, file: !9, line: 397, baseType: !48, size: 64, offset: 832)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_check", file: !21, line: 55, baseType: !20)
!142 = !{}
!143 = !DILocalVariable(name: "strm", arg: 1, scope: !56, file: !1, line: 68, type: !60)
!144 = !DILocation(line: 68, column: 32, scope: !56)
!145 = !DILocalVariable(name: "options", arg: 2, scope: !56, file: !1, line: 68, type: !109)
!146 = !DILocation(line: 68, column: 57, scope: !56)
!147 = !DILocalVariable(name: "preset", arg: 3, scope: !56, file: !1, line: 68, type: !114)
!148 = !DILocation(line: 68, column: 75, scope: !56)
!149 = !DILocalVariable(name: "check", arg: 4, scope: !56, file: !1, line: 68, type: !141)
!150 = !DILocation(line: 68, column: 94, scope: !56)
!151 = !DILocalVariable(name: "msg", scope: !56, file: !1, line: 69, type: !152)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !154)
!154 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!155 = !DILocation(line: 69, column: 17, scope: !56)
!156 = !DILocalVariable(name: "filters", scope: !56, file: !1, line: 70, type: !157)
!157 = !DICompositeType(tag: DW_TAG_array_type, baseType: !158, size: 640, elements: !166)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_filter", file: !159, line: 65, baseType: !160)
!159 = !DIFile(filename: "liblzma/api/lzma/filter.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!160 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !159, line: 43, size: 128, elements: !161)
!161 = !{!162, !165}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !160, file: !159, line: 54, baseType: !163, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_vli", file: !164, line: 63, baseType: !74)
!164 = !DIFile(filename: "liblzma/api/lzma/vli.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!165 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !160, file: !159, line: 63, baseType: !48, size: 64, offset: 64)
!166 = !{!167}
!167 = !DISubrange(count: 5)
!168 = !DILocation(line: 70, column: 17, scope: !56)
!169 = !DILocalVariable(name: "lzma_local_options", scope: !56, file: !1, line: 71, type: !110)
!170 = !DILocation(line: 71, column: 23, scope: !56)
!171 = !DILocation(line: 72, column: 9, scope: !172)
!172 = distinct !DILexicalBlock(scope: !56, file: !1, line: 72, column: 9)
!173 = !DILocation(line: 72, column: 17, scope: !172)
!174 = !DILocation(line: 72, column: 9, scope: !56)
!175 = !DILocation(line: 73, column: 17, scope: !172)
!176 = !DILocation(line: 73, column: 9, scope: !172)
!177 = !DILocation(line: 75, column: 23, scope: !178)
!178 = distinct !DILexicalBlock(scope: !56, file: !1, line: 75, column: 9)
!179 = !DILocation(line: 75, column: 29, scope: !178)
!180 = !DILocation(line: 75, column: 9, scope: !56)
!181 = !DILocation(line: 76, column: 15, scope: !178)
!182 = !DILocation(line: 76, column: 9, scope: !178)
!183 = !DILocation(line: 78, column: 22, scope: !56)
!184 = !DILocation(line: 78, column: 31, scope: !56)
!185 = !DILocation(line: 78, column: 5, scope: !56)
!186 = !DILocation(line: 79, column: 5, scope: !56)
!187 = !DILocation(line: 79, column: 16, scope: !56)
!188 = !DILocation(line: 79, column: 19, scope: !56)
!189 = !DILocation(line: 80, column: 26, scope: !56)
!190 = !DILocation(line: 80, column: 5, scope: !56)
!191 = !DILocation(line: 80, column: 16, scope: !56)
!192 = !DILocation(line: 80, column: 24, scope: !56)
!193 = !DILocation(line: 81, column: 5, scope: !56)
!194 = !DILocation(line: 81, column: 16, scope: !56)
!195 = !DILocation(line: 81, column: 19, scope: !56)
!196 = !DILocalVariable(name: "rc", scope: !56, file: !1, line: 83, type: !197)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_ret", file: !4, line: 237, baseType: !27)
!198 = !DILocation(line: 83, column: 14, scope: !56)
!199 = !DILocation(line: 83, column: 39, scope: !56)
!200 = !DILocation(line: 83, column: 45, scope: !56)
!201 = !DILocation(line: 83, column: 54, scope: !56)
!202 = !DILocation(line: 83, column: 19, scope: !56)
!203 = !DILocation(line: 85, column: 12, scope: !56)
!204 = !DILocation(line: 85, column: 5, scope: !56)
!205 = !DILocation(line: 87, column: 13, scope: !206)
!206 = distinct !DILexicalBlock(scope: !56, file: !1, line: 85, column: 16)
!207 = !DILocation(line: 89, column: 35, scope: !206)
!208 = !DILocation(line: 89, column: 20, scope: !206)
!209 = !DILocation(line: 89, column: 13, scope: !206)
!210 = !DILocation(line: 92, column: 25, scope: !211)
!211 = distinct !DILexicalBlock(scope: !206, file: !1, line: 89, column: 42)
!212 = !DILocation(line: 93, column: 21, scope: !211)
!213 = !DILocation(line: 96, column: 25, scope: !211)
!214 = !DILocation(line: 97, column: 21, scope: !211)
!215 = !DILocation(line: 99, column: 25, scope: !211)
!216 = !DILocation(line: 100, column: 21, scope: !211)
!217 = !DILocation(line: 102, column: 25, scope: !211)
!218 = !DILocation(line: 103, column: 21, scope: !211)
!219 = !DILocation(line: 105, column: 25, scope: !211)
!220 = !DILocation(line: 106, column: 21, scope: !211)
!221 = !DILocation(line: 107, column: 13, scope: !211)
!222 = !DILocation(line: 109, column: 17, scope: !206)
!223 = !DILocation(line: 110, column: 13, scope: !206)
!224 = !DILocation(line: 112, column: 17, scope: !206)
!225 = !DILocation(line: 113, column: 13, scope: !206)
!226 = !DILocation(line: 115, column: 17, scope: !206)
!227 = !DILocation(line: 116, column: 13, scope: !206)
!228 = !DILocation(line: 118, column: 82, scope: !56)
!229 = !DILocation(line: 118, column: 104, scope: !56)
!230 = !DILocation(line: 118, column: 111, scope: !56)
!231 = !DILocation(line: 118, column: 116, scope: !56)
!232 = !DILocation(line: 118, column: 5, scope: !56)
!233 = !DILocation(line: 119, column: 5, scope: !56)
!234 = !DILocation(line: 120, column: 1, scope: !56)
