; ModuleID = 'liblzma/lzma/lzma_encoder_optimum_fast.c'
source_filename = "liblzma/lzma/lzma_encoder_optimum_fast.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.lzma_mf_s = type { i8*, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32 (%struct.lzma_mf_s*, %struct.lzma_match*)*, void (%struct.lzma_mf_s*, i32)*, i32*, i32*, i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.lzma_match = type { i32, i32 }
%struct.lzma_coder_s = type { %struct.lzma_range_encoder, i32, [4 x i32], [274 x %struct.lzma_match], i32, i32, i8, i8, i8, i32, i32, i32, [16 x [768 x i16]], [12 x [16 x i16]], [12 x i16], [12 x i16], [12 x i16], [12 x i16], [12 x [16 x i16]], [4 x [64 x i16]], [114 x i16], [16 x i16], %struct.lzma_length_encoder, %struct.lzma_length_encoder, [4 x [64 x i32]], [4 x [128 x i32]], i32, i32, [16 x i32], i32, i32, i32, [4096 x %struct.lzma_optimal] }
%struct.lzma_range_encoder = type { i64, i64, i32, i8, i64, i64, [58 x i32], [58 x i16*] }
%struct.lzma_length_encoder = type { i16, i16, [16 x [8 x i16]], [16 x [8 x i16]], [256 x i16], [16 x [272 x i32]], i32, [16 x i32] }
%struct.lzma_optimal = type { i32, i8, i8, i32, i32, i32, i32, i32, [4 x i32] }

; Function Attrs: noinline nounwind uwtable
define dso_local void @lzma_lzma_optimum_fast(i8* %pcoder, %struct.lzma_mf_s* noalias %mf, i32* noalias %back_res, i32* noalias %len_res) #0 !dbg !70 {
entry:

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "liblzma/lzma/lzma_encoder_optimum_fast.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!2 = !{!3, !11, !51}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 250, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "liblzma/api/lzma/base.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9, !10}
!7 = !DIEnumerator(name: "LZMA_RUN", value: 0, isUnsigned: true)
!8 = !DIEnumerator(name: "LZMA_SYNC_FLUSH", value: 1, isUnsigned: true)
!9 = !DIEnumerator(name: "LZMA_FULL_FLUSH", value: 2, isUnsigned: true)
!10 = !DIEnumerator(name: "LZMA_FINISH", value: 3, isUnsigned: true)
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !13, file: !12, line: 40, baseType: !5, size: 32, elements: !45)
!12 = !DIFile(filename: "liblzma/rangecoder/range_encoder.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!13 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !12, line: 27, size: 5888, elements: !14)
!14 = !{!15, !21, !22, !25, !29, !32, !33, !37}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !13, file: !12, line: 28, baseType: !16, size: 64)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !17, line: 27, baseType: !18)
!17 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !19, line: 45, baseType: !20)
!19 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!20 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "cache_size", scope: !13, file: !12, line: 29, baseType: !16, size: 64, offset: 64)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !13, file: !12, line: 30, baseType: !23, size: 32, offset: 128)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !17, line: 26, baseType: !24)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !19, line: 42, baseType: !5)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !13, file: !12, line: 31, baseType: !26, size: 8, offset: 160)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !17, line: 24, baseType: !27)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !19, line: 38, baseType: !28)
!28 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !13, file: !12, line: 34, baseType: !30, size: 64, offset: 192)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !31, line: 46, baseType: !20)
!31 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!32 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !13, file: !12, line: 37, baseType: !30, size: 64, offset: 256)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "symbols", scope: !13, file: !12, line: 46, baseType: !34, size: 1856, offset: 320)
!34 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 1856, elements: !35)
!35 = !{!36}
!36 = !DISubrange(count: 58)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "probs", scope: !13, file: !12, line: 49, baseType: !38, size: 3712, offset: 2176)
!38 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 3712, elements: !35)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "probability", file: !41, line: 71, baseType: !42)
!41 = !DIFile(filename: "liblzma/rangecoder/range_common.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !17, line: 25, baseType: !43)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !19, line: 40, baseType: !44)
!44 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!45 = !{!46, !47, !48, !49, !50}
!46 = !DIEnumerator(name: "RC_BIT_0", value: 0, isUnsigned: true)
!47 = !DIEnumerator(name: "RC_BIT_1", value: 1, isUnsigned: true)
!48 = !DIEnumerator(name: "RC_DIRECT_0", value: 2, isUnsigned: true)
!49 = !DIEnumerator(name: "RC_DIRECT_1", value: 3, isUnsigned: true)
!50 = !DIEnumerator(name: "RC_FLUSH", value: 4, isUnsigned: true)
!51 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !52, line: 56, baseType: !5, size: 32, elements: !53)
!52 = !DIFile(filename: "liblzma/lzma/lzma_common.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!53 = !{!54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65}
!54 = !DIEnumerator(name: "STATE_LIT_LIT", value: 0, isUnsigned: true)
!55 = !DIEnumerator(name: "STATE_MATCH_LIT_LIT", value: 1, isUnsigned: true)
!56 = !DIEnumerator(name: "STATE_REP_LIT_LIT", value: 2, isUnsigned: true)
!57 = !DIEnumerator(name: "STATE_SHORTREP_LIT_LIT", value: 3, isUnsigned: true)
!58 = !DIEnumerator(name: "STATE_MATCH_LIT", value: 4, isUnsigned: true)
!59 = !DIEnumerator(name: "STATE_REP_LIT", value: 5, isUnsigned: true)
!60 = !DIEnumerator(name: "STATE_SHORTREP_LIT", value: 6, isUnsigned: true)
!61 = !DIEnumerator(name: "STATE_LIT_MATCH", value: 7, isUnsigned: true)
!62 = !DIEnumerator(name: "STATE_LIT_LONGREP", value: 8, isUnsigned: true)
!63 = !DIEnumerator(name: "STATE_LIT_SHORTREP", value: 9, isUnsigned: true)
!64 = !DIEnumerator(name: "STATE_NONLIT_MATCH", value: 10, isUnsigned: true)
!65 = !DIEnumerator(name: "STATE_NONLIT_REP", value: 11, isUnsigned: true)
!66 = !{i32 7, !"Dwarf Version", i32 4}
!67 = !{i32 2, !"Debug Info Version", i32 3}
!68 = !{i32 1, !"wchar_size", i32 4}
!69 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!70 = distinct !DISubprogram(name: "lzma_lzma_optimum_fast", scope: !1, file: !1, line: 20, type: !71, scopeLine: 22, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !121)
!71 = !DISubroutineType(types: !72)
!72 = !{null, !73, !76, !120, !120}
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_coder", file: !75, line: 78, baseType: null)
!75 = !DIFile(filename: "liblzma/common/common.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!76 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !77)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_mf", file: !79, line: 28, baseType: !80)
!79 = !DIFile(filename: "liblzma/lz/lz_encoder.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_mf_s", file: !79, line: 29, size: 960, elements: !81)
!81 = !{!82, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !103, !107, !109, !110, !111, !112, !113, !114, !115, !116, !118, !119}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !80, file: !79, line: 35, baseType: !83, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !80, file: !79, line: 39, baseType: !23, size: 32, offset: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "keep_size_before", scope: !80, file: !79, line: 45, baseType: !23, size: 32, offset: 96)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "keep_size_after", scope: !80, file: !79, line: 51, baseType: !23, size: 32, offset: 128)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !80, file: !79, line: 58, baseType: !23, size: 32, offset: 160)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "read_pos", scope: !80, file: !79, line: 63, baseType: !23, size: 32, offset: 192)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "read_ahead", scope: !80, file: !79, line: 67, baseType: !23, size: 32, offset: 224)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "read_limit", scope: !80, file: !79, line: 75, baseType: !23, size: 32, offset: 256)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "write_pos", scope: !80, file: !79, line: 80, baseType: !23, size: 32, offset: 288)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !80, file: !79, line: 84, baseType: !23, size: 32, offset: 320)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "find", scope: !80, file: !79, line: 92, baseType: !94, size: 64, offset: 384)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = !DISubroutineType(types: !96)
!96 = !{!23, !77, !97}
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_match", file: !79, line: 25, baseType: !99)
!99 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !79, line: 22, size: 64, elements: !100)
!100 = !{!101, !102}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !99, file: !79, line: 23, baseType: !23, size: 32)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !99, file: !79, line: 24, baseType: !23, size: 32, offset: 32)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "skip", scope: !80, file: !79, line: 97, baseType: !104, size: 64, offset: 448)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!105 = !DISubroutineType(types: !106)
!106 = !{null, !77, !23}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !80, file: !79, line: 99, baseType: !108, size: 64, offset: 512)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "son", scope: !80, file: !79, line: 100, baseType: !108, size: 64, offset: 576)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_pos", scope: !80, file: !79, line: 101, baseType: !23, size: 32, offset: 640)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_size", scope: !80, file: !79, line: 102, baseType: !23, size: 32, offset: 672)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "hash_mask", scope: !80, file: !79, line: 103, baseType: !23, size: 32, offset: 704)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !80, file: !79, line: 106, baseType: !23, size: 32, offset: 736)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "nice_len", scope: !80, file: !79, line: 109, baseType: !23, size: 32, offset: 768)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "match_len_max", scope: !80, file: !79, line: 114, baseType: !23, size: 32, offset: 800)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !80, file: !79, line: 119, baseType: !117, size: 32, offset: 832)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_action", file: !4, line: 322, baseType: !3)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "hash_size_sum", scope: !80, file: !79, line: 122, baseType: !23, size: 32, offset: 864)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "sons_count", scope: !80, file: !79, line: 125, baseType: !23, size: 32, offset: 896)
!120 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !108)
!121 = !{}
!122 = !DILocalVariable(name: "pcoder", arg: 1, scope: !70, file: !1, line: 20, type: !73)
!123 = !DILocation(line: 20, column: 49, scope: !70)
!124 = !DILocalVariable(name: "mf", arg: 2, scope: !70, file: !1, line: 20, type: !76)
!125 = !DILocation(line: 20, column: 75, scope: !70)
!126 = !DILocalVariable(name: "back_res", arg: 3, scope: !70, file: !1, line: 21, type: !120)
!127 = !DILocation(line: 21, column: 22, scope: !70)
!128 = !DILocalVariable(name: "len_res", arg: 4, scope: !70, file: !1, line: 21, type: !120)
!129 = !DILocation(line: 21, column: 51, scope: !70)
!130 = !DILocalVariable(name: "coder", scope: !70, file: !1, line: 23, type: !131)
!131 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !132)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_coder_s", file: !134, line: 72, size: 1996608, elements: !135)
!134 = !DIFile(filename: "liblzma/lzma/lzma_encoder_private.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!135 = !{!136, !138, !140, !144, !148, !149, !150, !152, !153, !154, !155, !156, !157, !162, !166, !169, !170, !171, !172, !173, !177, !181, !184, !206, !207, !209, !213, !214, !215, !216, !217, !218, !219}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "rc", scope: !133, file: !134, line: 74, baseType: !137, size: 5888)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_range_encoder", file: !12, line: 51, baseType: !13)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !133, file: !134, line: 77, baseType: !139, size: 32, offset: 5888)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_lzma_state", file: !52, line: 69, baseType: !51)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "reps", scope: !133, file: !134, line: 80, baseType: !141, size: 128, offset: 5920)
!141 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 128, elements: !142)
!142 = !{!143}
!143 = !DISubrange(count: 4)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "matches", scope: !133, file: !134, line: 83, baseType: !145, size: 17536, offset: 6048)
!145 = !DICompositeType(tag: DW_TAG_array_type, baseType: !98, size: 17536, elements: !146)
!146 = !{!147}
!147 = !DISubrange(count: 274)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "matches_count", scope: !133, file: !134, line: 86, baseType: !23, size: 32, offset: 23584)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "longest_match_length", scope: !133, file: !134, line: 90, baseType: !23, size: 32, offset: 23616)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "fast_mode", scope: !133, file: !134, line: 93, baseType: !151, size: 8, offset: 23648)
!151 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "is_initialized", scope: !133, file: !134, line: 97, baseType: !151, size: 8, offset: 23656)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "is_flushed", scope: !133, file: !134, line: 101, baseType: !151, size: 8, offset: 23664)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "pos_mask", scope: !133, file: !134, line: 103, baseType: !23, size: 32, offset: 23680)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "literal_context_bits", scope: !133, file: !134, line: 104, baseType: !23, size: 32, offset: 23712)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "literal_pos_mask", scope: !133, file: !134, line: 105, baseType: !23, size: 32, offset: 23744)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "literal", scope: !133, file: !134, line: 108, baseType: !158, size: 196608, offset: 23776)
!158 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 196608, elements: !159)
!159 = !{!160, !161}
!160 = !DISubrange(count: 16)
!161 = !DISubrange(count: 768)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "is_match", scope: !133, file: !134, line: 109, baseType: !163, size: 3072, offset: 220384)
!163 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 3072, elements: !164)
!164 = !{!165, !160}
!165 = !DISubrange(count: 12)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "is_rep", scope: !133, file: !134, line: 110, baseType: !167, size: 192, offset: 223456)
!167 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 192, elements: !168)
!168 = !{!165}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "is_rep0", scope: !133, file: !134, line: 111, baseType: !167, size: 192, offset: 223648)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "is_rep1", scope: !133, file: !134, line: 112, baseType: !167, size: 192, offset: 223840)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "is_rep2", scope: !133, file: !134, line: 113, baseType: !167, size: 192, offset: 224032)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "is_rep0_long", scope: !133, file: !134, line: 114, baseType: !163, size: 3072, offset: 224224)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "pos_slot", scope: !133, file: !134, line: 115, baseType: !174, size: 4096, offset: 227296)
!174 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 4096, elements: !175)
!175 = !{!143, !176}
!176 = !DISubrange(count: 64)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "pos_special", scope: !133, file: !134, line: 116, baseType: !178, size: 1824, offset: 231392)
!178 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 1824, elements: !179)
!179 = !{!180}
!180 = !DISubrange(count: 114)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "pos_align", scope: !133, file: !134, line: 117, baseType: !182, size: 256, offset: 233216)
!182 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 256, elements: !183)
!183 = !{!160}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "match_len_encoder", scope: !133, file: !134, line: 121, baseType: !185, size: 148032, offset: 233472)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_length_encoder", file: !134, line: 51, baseType: !186)
!186 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !134, line: 40, size: 148032, elements: !187)
!187 = !{!188, !189, !190, !194, !195, !199, !203, !204}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "choice", scope: !186, file: !134, line: 41, baseType: !40, size: 16)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "choice2", scope: !186, file: !134, line: 42, baseType: !40, size: 16, offset: 16)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !186, file: !134, line: 43, baseType: !191, size: 2048, offset: 32)
!191 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 2048, elements: !192)
!192 = !{!160, !193}
!193 = !DISubrange(count: 8)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "mid", scope: !186, file: !134, line: 44, baseType: !191, size: 2048, offset: 2080)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !186, file: !134, line: 45, baseType: !196, size: 4096, offset: 4128)
!196 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 4096, elements: !197)
!197 = !{!198}
!198 = !DISubrange(count: 256)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "prices", scope: !186, file: !134, line: 47, baseType: !200, size: 139264, offset: 8224)
!200 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 139264, elements: !201)
!201 = !{!160, !202}
!202 = !DISubrange(count: 272)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "table_size", scope: !186, file: !134, line: 48, baseType: !23, size: 32, offset: 147488)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "counters", scope: !186, file: !134, line: 49, baseType: !205, size: 512, offset: 147520)
!205 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 512, elements: !183)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "rep_len_encoder", scope: !133, file: !134, line: 122, baseType: !185, size: 148032, offset: 381504)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "pos_slot_prices", scope: !133, file: !134, line: 125, baseType: !208, size: 8192, offset: 529536)
!208 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 8192, elements: !175)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "distances_prices", scope: !133, file: !134, line: 126, baseType: !210, size: 16384, offset: 537728)
!210 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 16384, elements: !211)
!211 = !{!143, !212}
!212 = !DISubrange(count: 128)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "dist_table_size", scope: !133, file: !134, line: 127, baseType: !23, size: 32, offset: 554112)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "match_price_count", scope: !133, file: !134, line: 128, baseType: !23, size: 32, offset: 554144)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "align_prices", scope: !133, file: !134, line: 130, baseType: !205, size: 512, offset: 554176)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "align_price_count", scope: !133, file: !134, line: 131, baseType: !23, size: 32, offset: 554688)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "opts_end_index", scope: !133, file: !134, line: 134, baseType: !23, size: 32, offset: 554720)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "opts_current_index", scope: !133, file: !134, line: 135, baseType: !23, size: 32, offset: 554752)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "opts", scope: !133, file: !134, line: 136, baseType: !220, size: 1441792, offset: 554784)
!220 = !DICompositeType(tag: DW_TAG_array_type, baseType: !221, size: 1441792, elements: !233)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_optimal", file: !134, line: 69, baseType: !222)
!222 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !134, line: 54, size: 352, elements: !223)
!223 = !{!224, !225, !226, !227, !228, !229, !230, !231, !232}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !222, file: !134, line: 55, baseType: !139, size: 32)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "prev_1_is_literal", scope: !222, file: !134, line: 57, baseType: !151, size: 8, offset: 32)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "prev_2", scope: !222, file: !134, line: 58, baseType: !151, size: 8, offset: 40)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "pos_prev_2", scope: !222, file: !134, line: 60, baseType: !23, size: 32, offset: 64)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "back_prev_2", scope: !222, file: !134, line: 61, baseType: !23, size: 32, offset: 96)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "price", scope: !222, file: !134, line: 63, baseType: !23, size: 32, offset: 128)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "pos_prev", scope: !222, file: !134, line: 64, baseType: !23, size: 32, offset: 160)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "back_prev", scope: !222, file: !134, line: 65, baseType: !23, size: 32, offset: 192)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "backs", scope: !222, file: !134, line: 67, baseType: !141, size: 128, offset: 224)
!233 = !{!234}
!234 = !DISubrange(count: 4096)
!235 = !DILocation(line: 23, column: 32, scope: !70)
!236 = !DILocation(line: 23, column: 40, scope: !70)
!237 = !DILocalVariable(name: "nice_len", scope: !70, file: !1, line: 24, type: !238)
!238 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !23)
!239 = !DILocation(line: 24, column: 17, scope: !70)
!240 = !DILocation(line: 24, column: 28, scope: !70)
!241 = !DILocation(line: 24, column: 32, scope: !70)
!242 = !DILocalVariable(name: "len_main", scope: !70, file: !1, line: 26, type: !23)
!243 = !DILocation(line: 26, column: 11, scope: !70)
!244 = !DILocalVariable(name: "matches_count", scope: !70, file: !1, line: 27, type: !23)
!245 = !DILocation(line: 27, column: 11, scope: !70)
!246 = !DILocation(line: 28, column: 6, scope: !247)
!247 = distinct !DILexicalBlock(scope: !70, file: !1, line: 28, column: 6)
!248 = !DILocation(line: 28, column: 10, scope: !247)
!249 = !DILocation(line: 28, column: 21, scope: !247)
!250 = !DILocation(line: 28, column: 6, scope: !70)
!251 = !DILocation(line: 29, column: 22, scope: !252)
!252 = distinct !DILexicalBlock(scope: !247, file: !1, line: 28, column: 27)
!253 = !DILocation(line: 29, column: 42, scope: !252)
!254 = !DILocation(line: 29, column: 49, scope: !252)
!255 = !DILocation(line: 29, column: 14, scope: !252)
!256 = !DILocation(line: 29, column: 12, scope: !252)
!257 = !DILocation(line: 30, column: 2, scope: !252)
!258 = !DILocation(line: 32, column: 14, scope: !259)
!259 = distinct !DILexicalBlock(scope: !247, file: !1, line: 30, column: 9)
!260 = !DILocation(line: 32, column: 21, scope: !259)
!261 = !DILocation(line: 32, column: 12, scope: !259)
!262 = !DILocation(line: 33, column: 19, scope: !259)
!263 = !DILocation(line: 33, column: 26, scope: !259)
!264 = !DILocation(line: 33, column: 17, scope: !259)
!265 = !DILocalVariable(name: "buf", scope: !70, file: !1, line: 36, type: !266)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!267 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !26)
!268 = !DILocation(line: 36, column: 17, scope: !70)
!269 = !DILocation(line: 36, column: 30, scope: !70)
!270 = !DILocation(line: 36, column: 23, scope: !70)
!271 = !DILocation(line: 36, column: 34, scope: !70)
!272 = !DILocalVariable(name: "buf_avail", scope: !70, file: !1, line: 37, type: !238)
!273 = !DILocation(line: 37, column: 17, scope: !70)
!274 = !DILocation(line: 37, column: 29, scope: !70)
!275 = !DILocation(line: 39, column: 6, scope: !276)
!276 = distinct !DILexicalBlock(scope: !70, file: !1, line: 39, column: 6)
!277 = !DILocation(line: 39, column: 16, scope: !276)
!278 = !DILocation(line: 39, column: 6, scope: !70)
!279 = !DILocation(line: 41, column: 4, scope: !280)
!280 = distinct !DILexicalBlock(scope: !276, file: !1, line: 39, column: 21)
!281 = !DILocation(line: 41, column: 13, scope: !280)
!282 = !DILocation(line: 42, column: 4, scope: !280)
!283 = !DILocation(line: 42, column: 12, scope: !280)
!284 = !DILocation(line: 43, column: 3, scope: !280)
!285 = !DILocalVariable(name: "rep_len", scope: !70, file: !1, line: 47, type: !23)
!286 = !DILocation(line: 47, column: 11, scope: !70)
!287 = !DILocalVariable(name: "rep_index", scope: !70, file: !1, line: 48, type: !23)
!288 = !DILocation(line: 48, column: 11, scope: !70)
!289 = !DILocalVariable(name: "i", scope: !290, file: !1, line: 50, type: !23)
!290 = distinct !DILexicalBlock(scope: !70, file: !1, line: 50, column: 2)
!291 = !DILocation(line: 50, column: 16, scope: !290)
!292 = !DILocation(line: 50, column: 7, scope: !290)
!293 = !DILocation(line: 50, column: 23, scope: !294)
!294 = distinct !DILexicalBlock(scope: !290, file: !1, line: 50, column: 2)
!295 = !DILocation(line: 50, column: 25, scope: !294)
!296 = !DILocation(line: 50, column: 2, scope: !290)
!297 = !DILocalVariable(name: "buf_back", scope: !298, file: !1, line: 52, type: !299)
