; ModuleID = 'liblzma/lzma/lzma_encoder_optimum_normal.c'
source_filename = "liblzma/lzma/lzma_encoder_optimum_normal.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.lzma_mf_s = type { i8*, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32 (%struct.lzma_mf_s*, %struct.lzma_match*)*, void (%struct.lzma_mf_s*, i32)*, i32*, i32*, i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.lzma_match = type { i32, i32 }
%struct.lzma_coder_s = type { %struct.lzma_range_encoder, i32, [4 x i32], [274 x %struct.lzma_match], i32, i32, i8, i8, i8, i32, i32, i32, [16 x [768 x i16]], [12 x [16 x i16]], [12 x i16], [12 x i16], [12 x i16], [12 x i16], [12 x [16 x i16]], [4 x [64 x i16]], [114 x i16], [16 x i16], %struct.lzma_length_encoder, %struct.lzma_length_encoder, [4 x [64 x i32]], [4 x [128 x i32]], i32, i32, [16 x i32], i32, i32, i32, [4096 x %struct.lzma_optimal] }
%struct.lzma_range_encoder = type { i64, i64, i32, i8, i64, i64, [58 x i32], [58 x i16*] }
%struct.lzma_length_encoder = type { i16, i16, [16 x [8 x i16]], [16 x [8 x i16]], [256 x i16], [16 x [272 x i32]], i32, [16 x i32] }
%struct.lzma_optimal = type { i32, i8, i8, i32, i32, i32, i32, i32, [4 x i32] }

@lzma_rc_prices = external dso_local constant [128 x i8], align 16
@lzma_fastpos = external dso_local constant [8192 x i8], align 16

; Function Attrs: noinline nounwind uwtable

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "liblzma/lzma/lzma_encoder_optimum_normal.c", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!2 = !{!3, !11, !51}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 250, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "liblzma/api/lzma/base.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9, !10}
!7 = !DIEnumerator(name: "LZMA_RUN", value: 0, isUnsigned: true)
!8 = !DIEnumerator(name: "LZMA_SYNC_FLUSH", value: 1, isUnsigned: true)
!9 = !DIEnumerator(name: "LZMA_FULL_FLUSH", value: 2, isUnsigned: true)
!10 = !DIEnumerator(name: "LZMA_FINISH", value: 3, isUnsigned: true)
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !13, file: !12, line: 40, baseType: !5, size: 32, elements: !45)
!12 = !DIFile(filename: "liblzma/rangecoder/range_encoder.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!13 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !12, line: 27, size: 5888, elements: !14)
!14 = !{!15, !21, !22, !25, !29, !32, !33, !37}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !13, file: !12, line: 28, baseType: !16, size: 64)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !17, line: 27, baseType: !18)
!17 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !19, line: 45, baseType: !20)
!19 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!20 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "cache_size", scope: !13, file: !12, line: 29, baseType: !16, size: 64, offset: 64)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !13, file: !12, line: 30, baseType: !23, size: 32, offset: 128)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !17, line: 26, baseType: !24)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !19, line: 42, baseType: !5)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !13, file: !12, line: 31, baseType: !26, size: 8, offset: 160)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !17, line: 24, baseType: !27)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !19, line: 38, baseType: !28)
!28 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !13, file: !12, line: 34, baseType: !30, size: 64, offset: 192)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !31, line: 46, baseType: !20)
!31 = !DIFile(filename: "Rohit/IR2Vec-LoopOptimizationFramework/build_REL_AsrtON/lib/clang/10.0.1/include/stddef.h", directory: "/home/venkat/IF-DV")
!32 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !13, file: !12, line: 37, baseType: !30, size: 64, offset: 256)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "symbols", scope: !13, file: !12, line: 46, baseType: !34, size: 1856, offset: 320)
!34 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 1856, elements: !35)
!35 = !{!36}
!36 = !DISubrange(count: 58)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "probs", scope: !13, file: !12, line: 49, baseType: !38, size: 3712, offset: 2176)
!38 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 3712, elements: !35)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "probability", file: !41, line: 71, baseType: !42)
!41 = !DIFile(filename: "liblzma/rangecoder/range_common.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !17, line: 25, baseType: !43)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !19, line: 40, baseType: !44)
!44 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!45 = !{!46, !47, !48, !49, !50}
!46 = !DIEnumerator(name: "RC_BIT_0", value: 0, isUnsigned: true)
!47 = !DIEnumerator(name: "RC_BIT_1", value: 1, isUnsigned: true)
!48 = !DIEnumerator(name: "RC_DIRECT_0", value: 2, isUnsigned: true)
!49 = !DIEnumerator(name: "RC_DIRECT_1", value: 3, isUnsigned: true)
!50 = !DIEnumerator(name: "RC_FLUSH", value: 4, isUnsigned: true)
!51 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !52, line: 56, baseType: !5, size: 32, elements: !53)
!52 = !DIFile(filename: "liblzma/lzma/lzma_common.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!53 = !{!54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65}
!54 = !DIEnumerator(name: "STATE_LIT_LIT", value: 0, isUnsigned: true)
!55 = !DIEnumerator(name: "STATE_MATCH_LIT_LIT", value: 1, isUnsigned: true)
!56 = !DIEnumerator(name: "STATE_REP_LIT_LIT", value: 2, isUnsigned: true)
!57 = !DIEnumerator(name: "STATE_SHORTREP_LIT_LIT", value: 3, isUnsigned: true)
!58 = !DIEnumerator(name: "STATE_MATCH_LIT", value: 4, isUnsigned: true)
!59 = !DIEnumerator(name: "STATE_REP_LIT", value: 5, isUnsigned: true)
!60 = !DIEnumerator(name: "STATE_SHORTREP_LIT", value: 6, isUnsigned: true)
!61 = !DIEnumerator(name: "STATE_LIT_MATCH", value: 7, isUnsigned: true)
!62 = !DIEnumerator(name: "STATE_LIT_LONGREP", value: 8, isUnsigned: true)
!63 = !DIEnumerator(name: "STATE_LIT_SHORTREP", value: 9, isUnsigned: true)
!64 = !DIEnumerator(name: "STATE_NONLIT_MATCH", value: 10, isUnsigned: true)
!65 = !DIEnumerator(name: "STATE_NONLIT_REP", value: 11, isUnsigned: true)
!66 = !{i32 7, !"Dwarf Version", i32 4}
!67 = !{i32 2, !"Debug Info Version", i32 3}
!68 = !{i32 1, !"wchar_size", i32 4}
!69 = !{!"clang version 10.0.1 (https://github.com/svkeerthy/IR2Vec-LoopOptimizationFramework.git 561ac470e63b728263a0ac06ef987886ac648486)"}
!70 = distinct !DISubprogram(name: "lzma_lzma_optimum_normal", scope: !1, file: !1, line: 824, type: !71, scopeLine: 827, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !121)
!71 = !DISubroutineType(types: !72)
!72 = !{null, !73, !76, !120, !120, !23}
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_coder", file: !75, line: 78, baseType: null)
!75 = !DIFile(filename: "liblzma/common/common.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!76 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !77)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_mf", file: !79, line: 28, baseType: !80)
!79 = !DIFile(filename: "liblzma/lz/lz_encoder.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_mf_s", file: !79, line: 29, size: 960, elements: !81)
!81 = !{!82, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !103, !107, !109, !110, !111, !112, !113, !114, !115, !116, !118, !119}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !80, file: !79, line: 35, baseType: !83, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !80, file: !79, line: 39, baseType: !23, size: 32, offset: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "keep_size_before", scope: !80, file: !79, line: 45, baseType: !23, size: 32, offset: 96)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "keep_size_after", scope: !80, file: !79, line: 51, baseType: !23, size: 32, offset: 128)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !80, file: !79, line: 58, baseType: !23, size: 32, offset: 160)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "read_pos", scope: !80, file: !79, line: 63, baseType: !23, size: 32, offset: 192)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "read_ahead", scope: !80, file: !79, line: 67, baseType: !23, size: 32, offset: 224)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "read_limit", scope: !80, file: !79, line: 75, baseType: !23, size: 32, offset: 256)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "write_pos", scope: !80, file: !79, line: 80, baseType: !23, size: 32, offset: 288)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !80, file: !79, line: 84, baseType: !23, size: 32, offset: 320)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "find", scope: !80, file: !79, line: 92, baseType: !94, size: 64, offset: 384)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = !DISubroutineType(types: !96)
!96 = !{!23, !77, !97}
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_match", file: !79, line: 25, baseType: !99)
!99 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !79, line: 22, size: 64, elements: !100)
!100 = !{!101, !102}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !99, file: !79, line: 23, baseType: !23, size: 32)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !99, file: !79, line: 24, baseType: !23, size: 32, offset: 32)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "skip", scope: !80, file: !79, line: 97, baseType: !104, size: 64, offset: 448)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!105 = !DISubroutineType(types: !106)
!106 = !{null, !77, !23}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !80, file: !79, line: 99, baseType: !108, size: 64, offset: 512)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "son", scope: !80, file: !79, line: 100, baseType: !108, size: 64, offset: 576)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_pos", scope: !80, file: !79, line: 101, baseType: !23, size: 32, offset: 640)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "cyclic_size", scope: !80, file: !79, line: 102, baseType: !23, size: 32, offset: 672)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "hash_mask", scope: !80, file: !79, line: 103, baseType: !23, size: 32, offset: 704)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !80, file: !79, line: 106, baseType: !23, size: 32, offset: 736)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "nice_len", scope: !80, file: !79, line: 109, baseType: !23, size: 32, offset: 768)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "match_len_max", scope: !80, file: !79, line: 114, baseType: !23, size: 32, offset: 800)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "action", scope: !80, file: !79, line: 119, baseType: !117, size: 32, offset: 832)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_action", file: !4, line: 322, baseType: !3)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "hash_size_sum", scope: !80, file: !79, line: 122, baseType: !23, size: 32, offset: 864)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "sons_count", scope: !80, file: !79, line: 125, baseType: !23, size: 32, offset: 896)
!120 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !108)
!121 = !{}
!122 = !DILocalVariable(name: "pcoder", arg: 1, scope: !70, file: !1, line: 824, type: !73)
!123 = !DILocation(line: 824, column: 51, scope: !70)
!124 = !DILocalVariable(name: "mf", arg: 2, scope: !70, file: !1, line: 824, type: !76)
!125 = !DILocation(line: 824, column: 77, scope: !70)
!126 = !DILocalVariable(name: "back_res", arg: 3, scope: !70, file: !1, line: 825, type: !120)
!127 = !DILocation(line: 825, column: 22, scope: !70)
!128 = !DILocalVariable(name: "len_res", arg: 4, scope: !70, file: !1, line: 825, type: !120)
!129 = !DILocation(line: 825, column: 51, scope: !70)
!130 = !DILocalVariable(name: "position", arg: 5, scope: !70, file: !1, line: 826, type: !23)
!131 = !DILocation(line: 826, column: 12, scope: !70)
!132 = !DILocalVariable(name: "coder", scope: !70, file: !1, line: 828, type: !133)
!133 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !134)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lzma_coder_s", file: !136, line: 72, size: 1996608, elements: !137)
!136 = !DIFile(filename: "liblzma/lzma/lzma_encoder_private.h", directory: "/home/venkat/IF-DV/spec_build_release/CPU_2017/benchspec/CPU/557.xz_r/build/build_base_ld-loop-ext-m64.0000")
!137 = !{!138, !140, !142, !146, !150, !151, !152, !154, !155, !156, !157, !158, !159, !164, !168, !171, !172, !173, !174, !175, !179, !183, !186, !208, !209, !211, !215, !216, !217, !218, !219, !220, !221}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "rc", scope: !135, file: !136, line: 74, baseType: !139, size: 5888)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_range_encoder", file: !12, line: 51, baseType: !13)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !135, file: !136, line: 77, baseType: !141, size: 32, offset: 5888)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_lzma_state", file: !52, line: 69, baseType: !51)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "reps", scope: !135, file: !136, line: 80, baseType: !143, size: 128, offset: 5920)
!143 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 128, elements: !144)
!144 = !{!145}
!145 = !DISubrange(count: 4)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "matches", scope: !135, file: !136, line: 83, baseType: !147, size: 17536, offset: 6048)
!147 = !DICompositeType(tag: DW_TAG_array_type, baseType: !98, size: 17536, elements: !148)
!148 = !{!149}
!149 = !DISubrange(count: 274)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "matches_count", scope: !135, file: !136, line: 86, baseType: !23, size: 32, offset: 23584)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "longest_match_length", scope: !135, file: !136, line: 90, baseType: !23, size: 32, offset: 23616)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "fast_mode", scope: !135, file: !136, line: 93, baseType: !153, size: 8, offset: 23648)
!153 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "is_initialized", scope: !135, file: !136, line: 97, baseType: !153, size: 8, offset: 23656)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "is_flushed", scope: !135, file: !136, line: 101, baseType: !153, size: 8, offset: 23664)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "pos_mask", scope: !135, file: !136, line: 103, baseType: !23, size: 32, offset: 23680)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "literal_context_bits", scope: !135, file: !136, line: 104, baseType: !23, size: 32, offset: 23712)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "literal_pos_mask", scope: !135, file: !136, line: 105, baseType: !23, size: 32, offset: 23744)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "literal", scope: !135, file: !136, line: 108, baseType: !160, size: 196608, offset: 23776)
!160 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 196608, elements: !161)
!161 = !{!162, !163}
!162 = !DISubrange(count: 16)
!163 = !DISubrange(count: 768)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "is_match", scope: !135, file: !136, line: 109, baseType: !165, size: 3072, offset: 220384)
!165 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 3072, elements: !166)
!166 = !{!167, !162}
!167 = !DISubrange(count: 12)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "is_rep", scope: !135, file: !136, line: 110, baseType: !169, size: 192, offset: 223456)
!169 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 192, elements: !170)
!170 = !{!167}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "is_rep0", scope: !135, file: !136, line: 111, baseType: !169, size: 192, offset: 223648)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "is_rep1", scope: !135, file: !136, line: 112, baseType: !169, size: 192, offset: 223840)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "is_rep2", scope: !135, file: !136, line: 113, baseType: !169, size: 192, offset: 224032)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "is_rep0_long", scope: !135, file: !136, line: 114, baseType: !165, size: 3072, offset: 224224)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "pos_slot", scope: !135, file: !136, line: 115, baseType: !176, size: 4096, offset: 227296)
!176 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 4096, elements: !177)
!177 = !{!145, !178}
!178 = !DISubrange(count: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "pos_special", scope: !135, file: !136, line: 116, baseType: !180, size: 1824, offset: 231392)
!180 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 1824, elements: !181)
!181 = !{!182}
!182 = !DISubrange(count: 114)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "pos_align", scope: !135, file: !136, line: 117, baseType: !184, size: 256, offset: 233216)
!184 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 256, elements: !185)
!185 = !{!162}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "match_len_encoder", scope: !135, file: !136, line: 121, baseType: !187, size: 148032, offset: 233472)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_length_encoder", file: !136, line: 51, baseType: !188)
!188 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !136, line: 40, size: 148032, elements: !189)
!189 = !{!190, !191, !192, !196, !197, !201, !205, !206}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "choice", scope: !188, file: !136, line: 41, baseType: !40, size: 16)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "choice2", scope: !188, file: !136, line: 42, baseType: !40, size: 16, offset: 16)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !188, file: !136, line: 43, baseType: !193, size: 2048, offset: 32)
!193 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 2048, elements: !194)
!194 = !{!162, !195}
!195 = !DISubrange(count: 8)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "mid", scope: !188, file: !136, line: 44, baseType: !193, size: 2048, offset: 2080)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !188, file: !136, line: 45, baseType: !198, size: 4096, offset: 4128)
!198 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 4096, elements: !199)
!199 = !{!200}
!200 = !DISubrange(count: 256)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "prices", scope: !188, file: !136, line: 47, baseType: !202, size: 139264, offset: 8224)
!202 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 139264, elements: !203)
!203 = !{!162, !204}
!204 = !DISubrange(count: 272)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "table_size", scope: !188, file: !136, line: 48, baseType: !23, size: 32, offset: 147488)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "counters", scope: !188, file: !136, line: 49, baseType: !207, size: 512, offset: 147520)
!207 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 512, elements: !185)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "rep_len_encoder", scope: !135, file: !136, line: 122, baseType: !187, size: 148032, offset: 381504)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "pos_slot_prices", scope: !135, file: !136, line: 125, baseType: !210, size: 8192, offset: 529536)
!210 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 8192, elements: !177)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "distances_prices", scope: !135, file: !136, line: 126, baseType: !212, size: 16384, offset: 537728)
!212 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 16384, elements: !213)
!213 = !{!145, !214}
!214 = !DISubrange(count: 128)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "dist_table_size", scope: !135, file: !136, line: 127, baseType: !23, size: 32, offset: 554112)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "match_price_count", scope: !135, file: !136, line: 128, baseType: !23, size: 32, offset: 554144)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "align_prices", scope: !135, file: !136, line: 130, baseType: !207, size: 512, offset: 554176)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "align_price_count", scope: !135, file: !136, line: 131, baseType: !23, size: 32, offset: 554688)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "opts_end_index", scope: !135, file: !136, line: 134, baseType: !23, size: 32, offset: 554720)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "opts_current_index", scope: !135, file: !136, line: 135, baseType: !23, size: 32, offset: 554752)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "opts", scope: !135, file: !136, line: 136, baseType: !222, size: 1441792, offset: 554784)
!222 = !DICompositeType(tag: DW_TAG_array_type, baseType: !223, size: 1441792, elements: !235)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "lzma_optimal", file: !136, line: 69, baseType: !224)
!224 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !136, line: 54, size: 352, elements: !225)
!225 = !{!226, !227, !228, !229, !230, !231, !232, !233, !234}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !224, file: !136, line: 55, baseType: !141, size: 32)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "prev_1_is_literal", scope: !224, file: !136, line: 57, baseType: !153, size: 8, offset: 32)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "prev_2", scope: !224, file: !136, line: 58, baseType: !153, size: 8, offset: 40)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "pos_prev_2", scope: !224, file: !136, line: 60, baseType: !23, size: 32, offset: 64)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "back_prev_2", scope: !224, file: !136, line: 61, baseType: !23, size: 32, offset: 96)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "price", scope: !224, file: !136, line: 63, baseType: !23, size: 32, offset: 128)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "pos_prev", scope: !224, file: !136, line: 64, baseType: !23, size: 32, offset: 160)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "back_prev", scope: !224, file: !136, line: 65, baseType: !23, size: 32, offset: 192)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "backs", scope: !224, file: !136, line: 67, baseType: !143, size: 128, offset: 224)
!235 = !{!236}
!236 = !DISubrange(count: 4096)
!237 = !DILocation(line: 828, column: 32, scope: !70)
!238 = !DILocation(line: 828, column: 40, scope: !70)
!239 = !DILocation(line: 830, column: 6, scope: !240)
!240 = distinct !DILexicalBlock(scope: !70, file: !1, line: 830, column: 6)
!241 = !DILocation(line: 830, column: 13, scope: !240)
!242 = !DILocation(line: 830, column: 31, scope: !240)
!243 = !DILocation(line: 830, column: 38, scope: !240)
!244 = !DILocation(line: 830, column: 28, scope: !240)
!245 = !DILocation(line: 830, column: 6, scope: !70)
!246 = !DILocation(line: 832, column: 14, scope: !247)
!247 = distinct !DILexicalBlock(scope: !240, file: !1, line: 830, column: 58)
!248 = !DILocation(line: 832, column: 21, scope: !247)
!249 = !DILocation(line: 832, column: 26, scope: !247)
!250 = !DILocation(line: 832, column: 33, scope: !247)
!251 = !DILocation(line: 832, column: 53, scope: !247)
!252 = !DILocation(line: 833, column: 7, scope: !247)
!253 = !DILocation(line: 833, column: 14, scope: !247)
!254 = !DILocation(line: 833, column: 5, scope: !247)
!255 = !DILocation(line: 832, column: 4, scope: !247)
!256 = !DILocation(line: 832, column: 12, scope: !247)
!257 = !DILocation(line: 834, column: 15, scope: !247)
!258 = !DILocation(line: 834, column: 22, scope: !247)
!259 = !DILocation(line: 834, column: 27, scope: !247)
!260 = !DILocation(line: 834, column: 34, scope: !247)
!261 = !DILocation(line: 834, column: 54, scope: !247)
!262 = !DILocation(line: 834, column: 4, scope: !247)
!263 = !DILocation(line: 834, column: 13, scope: !247)
!264 = !DILocation(line: 835, column: 31, scope: !247)
!265 = !DILocation(line: 835, column: 38, scope: !247)
!266 = !DILocation(line: 836, column: 5, scope: !247)
!267 = !DILocation(line: 836, column: 12, scope: !247)
!268 = !DILocation(line: 836, column: 32, scope: !247)
!269 = !DILocation(line: 835, column: 3, scope: !247)
!270 = !DILocation(line: 835, column: 10, scope: !247)
!271 = !DILocation(line: 835, column: 29, scope: !247)
!272 = !DILocation(line: 837, column: 3, scope: !247)
!273 = !DILocation(line: 843, column: 6, scope: !274)
!274 = distinct !DILexicalBlock(scope: !70, file: !1, line: 843, column: 6)
!275 = !DILocation(line: 843, column: 10, scope: !274)
!276 = !DILocation(line: 843, column: 21, scope: !274)
!277 = !DILocation(line: 843, column: 6, scope: !70)
!278 = !DILocation(line: 844, column: 7, scope: !279)
!279 = distinct !DILexicalBlock(scope: !280, file: !1, line: 844, column: 7)
!280 = distinct !DILexicalBlock(scope: !274, file: !1, line: 843, column: 27)
!281 = !DILocation(line: 844, column: 14, scope: !279)
!282 = !DILocation(line: 844, column: 32, scope: !279)
!283 = !DILocation(line: 844, column: 7, scope: !280)
!284 = !DILocation(line: 845, column: 26, scope: !279)
!285 = !DILocation(line: 845, column: 4, scope: !279)
!286 = !DILocation(line: 847, column: 7, scope: !287)
!287 = distinct !DILexicalBlock(scope: !280, file: !1, line: 847, column: 7)
!288 = !DILocation(line: 847, column: 14, scope: !287)
!289 = !DILocation(line: 847, column: 32, scope: !287)
!290 = !DILocation(line: 847, column: 7, scope: !280)
!291 = !DILocation(line: 848, column: 22, scope: !287)
!292 = !DILocation(line: 848, column: 4, scope: !287)
!293 = !DILocation(line: 849, column: 2, scope: !280)
!294 = !DILocalVariable(name: "len_end", scope: !70, file: !1, line: 855, type: !23)
!295 = !DILocation(line: 855, column: 11, scope: !70)
!296 = !DILocation(line: 855, column: 29, scope: !70)
!297 = !DILocation(line: 855, column: 36, scope: !70)
!298 = !DILocation(line: 855, column: 40, scope: !70)
!299 = !DILocation(line: 855, column: 50, scope: !70)
!300 = !DILocation(line: 855, column: 59, scope: !70)
!301 = !DILocation(line: 855, column: 21, scope: !70)
!302 = !DILocation(line: 856, column: 6, scope: !303)
!303 = distinct !DILexicalBlock(scope: !70, file: !1, line: 856, column: 6)
